{
    "id": "-9-z-L2jnlI",
    "title": "Phones are SHATTERING...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-04-30T00:50:37Z",
    "video_url": "https://www.youtube.com/watch?v=-9-z-L2jnlI",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Samsung Galaxy S20",
        "ultra",
        "camera",
        "glass",
        "shatter",
        "shattering",
        "broken",
        "breaking",
        "s20 ultra",
        "s20",
        "s20 glass",
        "s20 glass shatter"
    ],
    "views": 479271,
    "likes": 24755,
    "comments_count": 1171,
    "description": "The first 100 people to go to  are going to get unlimited access for 1 week to try it out. Youll also get 25% off if you want the full membership.  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   (Don't) Buy a Samsung Galaxy S20 Ultra On Amazon (PAID LINK):  On Newegg (PAID LINK):   NEWS SOURCES  SHATTERED DREAMS     ZOOM OUT     CROWDED STADIA     WHEN THERE'S NO TIME FOR AMP-HOURS   HARD DRIVE, EASY USAGE?   SET THE DRIVERS FREE    FREE GAMES FOR THE NHS   BAD NEWS FOR THE LAZY  ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://blinkist.com/techlinked",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://geni.us/EbBsVr",
        "https://geni.us/q949R",
        "https://www.extremetech.com/mobile/309931-some-galaxy-s20-ultra-owners-claim-camera-glass-spontaneously-shatters",
        "https://www.slashgear.com/galaxy-s20-ultra-camera-glass-shattering-blamed-on-alleged-design-flaw-28618635/",
        "https://www.androidauthority.com/samsung-galaxy-s20-ultra-broken-glass-1112651/",
        "https://www.cnn.com/2020/04/29/tech/google-meet-free/index.html",
        "https://techcrunch.com/2020/04/29/google-is-making-meet-free-for-everyone/",
        "https://www.cnet.com/news/googles-zoom-rival-called-meet-is-now-free-to-consumers/",
        "https://9to5google.com/2020/04/28/google-stadia-ea-star-wars-games/",
        "https://www.fool.com/investing/2020/04/28/electronic-arts-partners-with-google-to-make-its-g.aspx",
        "https://www.kitguru.net/gaming/matthew-wilson/ea-becomes-the-latest-publisher-to-join-stadia/",
        "https://www.gsmarena.com/qualcomm_introduces_quick_charge_3_for_snapdragon_765_devices-news-42902.php",
        "https://www.windowslatest.com/2020/04/27/windows-10-is-getting-faster-in-next-feature-update/",
        "https://www.ghacks.net/2020/04/28/intel-unlocks-gpu-drivers-so-that-users-may-bypass-oem-driver-locks/",
        "https://downloadmirror.intel.com/29530/eng/ReleaseNotes_100.8141.pdf",
        "https://www.independent.co.uk/arts-entertainment/games/news/games-for-carers-nhs-free-website-not-working-loading-a9489646.html",
        "https://www.engadget.com/irobot-suspends-robotic-lawn-mower-terra-162443137.html?utm_campaign=homepage",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "James, do you know where the tech news is right now? It's flying over our heads in a million pieces, [James, in background] What? Is this a 5G thing? and it comes in through my head andWAAH! OUHH! [in background] And you drop it[?]! With all the talk of the pandemic [COVID-19], another thing we really don't need is an outbreak of shattering glass, but this exactly what's happening to some smartphone owners! According to reports, the camera glass on the Samsung Galaxy S20 Ultra has been breaking for no identifiable reason. Just what we needed! And keep in mind, this is a $1400 flagship device that features a huge cluster of lenses on the back. Reports of this are pouring into both Reddit and Samsung's own forums, and most unfortunately, damaged glass means that the that the camera lenses themselves aren't really usable. To make things worse, Samsung's warranty doesn't cover damage of this kind! [evil laughter in background] The Company is offering to fix the issue for $400, so they're not exactly earning a lot of good will with customers either. Turns out breaking trust is even easier than breaking glass! [James in background with frail voice] My tiny trust! Forever broken! If you've been looking for a good alternative to Zoom, which is been making headlines for questionable security lately, Google is making Meet, its zoom competitor free for everyone! [in background] Free Meet (meat)! Fr[chuckle] Blauuahh! [in background] Just tossin' it out! Previously, you had to be using G Suite, which is a paid service, but, now, anyone with a Gmail account Can use Meet at no charge! You can have up to 100 participants if you're using Meet for something like a virtual Family reunion, let's say. [in background] Not recommended! [chuckle] And, although free accounts can't *meet* for more than an hour at a time, this rule will be relaxed through at least the end of September due to the pandemic. However, do keep in mind, you may not be able to access it immediately, as the free tier is getting a staggered roll out! Until then, hey! Use literally anything else. It's a great time for chat app competition. Google Stadia is adding a new game publisher to the mix. Electronic Arts will be part of Stadia's roster now, as players will get to enjoy: Fifa, Madden NFL, and Star Wars Jedi Fallen Order. This isn't the first non-Origin service to feature EA games, as Microsoft's Project xCloud also has some EA titles on their lineup, although it's been reported that EA wants to eventually roll out its own game streaming service. It appears they also do not want to get left behind while that's in development. All the cool kids' games are on Stadia... Nope! It's not clear when exactly gamers will get to play these EA titles, but it should be by the end of the year. Plenty of time for EA to work in more overpriced DLC! [in the style of EA's intros] EA Sports! It's in the lame (game). [laughter] [in background] Wow. Hey, other Riley, got something to say? Now it's time for the Quick Bits brought to you by Blinkist, the app that takes the best insights and info from thousands of non-fiction books, and condenses them into 15 minutes. It's basically like speedreading, without the annoyingyou knowlearning-to-speedread part. You can listen to audio summaries or read them yourself, in a wide variety of categories, such as: Business & Finance, Parenting, Psychology, and Self-Help. And they even have full audiobooks now too! A bonus! Some of their most popular titles include \"The AI Economy\", which explains how the rise of artificial intelligence will affect society, and \"Streaming, Sharing, Stealing\", a look at how Apple, Netflix, and Amazon use data to understand their consumers. The first 100 people to go to blinkist.com/techlinked are going to get unlimited acces for one week to try it out. So, do that by clicking the link below. Thanks, me! On to the Quick Bits! Qualcomm has a faster way to charge your phone as the company has announced Quick Charge 3+ For platforms based on the Snapdragon 765 series of chips. The new tech should allow phones to go 050% charge in just 15 minutes, a 35% speed improvement! It ain't 0100 real quick, but it's getting there. [James in background] That's pretty dang fast. That's pretty fast. If you're rocking an old school mechanical hard drive in your computer, Windows 10's May update could significantly improve performance, thanks to changes in Windows Search, and how data gets indexed. It's great news for everyone who doesn't happen to rock SSDs exclusively. Those people probably havelikesolid gold toilets. Oh! How was the flight on the PJ, rich boy? Driver updates should get easier, now, at least for Intel based laptops, as Team Blue has just unlocked their GPU drivers, meaning users will no longer have to wait for the official, modified driver from Dell, HP or any of those other guys. We're finally free! Switch to Ryzen! It's notit's not applicable, but Workers for the UK's National Health Service are going to be getting access to over 85000 downloadable games for free, as a thank you, and a way for them to unwind during the pandemic. Large publishers like Sega, EA, Xbox, and Konami are all on board, but I wouldn't be surprised if games centered around zombie outbreaks don't get played all that much. The last of us? I thought this was the Sims! And the company that brought you Roomba was going to be releasing a robotic lawnmower, but unfortunately those planes have been shelved indefinitely due to the coronavirus. [in background] You don't need a lawn! Yeah! Justyouyou don't look at it anymore. The iRobot Terra could've been a great boon for those of us too lazy to mow our yards, but fortunately, there are competitors on the market, so your dreams of doing nothing over the summer don't have to die just yet. Well, that's our show! Hey, here's an idea, come back on Friday, sit there passively, and absorb some more tech news instead of vacuuming your house. I'm sure that'll make your parents happy! [in background] Throw out your Roomba! Who needs it? [James] Roomba apocalypse! There's no room for that Room That was a good impression, Andy.",
    "transcript_keywords": [
        "Meet",
        "free",
        "Quick Bits",
        "Quick",
        "Samsung",
        "glass",
        "games",
        "service",
        "Samsung Galaxy",
        "charge",
        "time",
        "Stadia",
        "Free Meet",
        "game streaming service",
        "Roomba",
        "Quick Bits brought",
        "breaking",
        "Company",
        "pandemic",
        "hey"
    ],
    "transcript_entity_values": [
        "400",
        "Reddit",
        "at least the end of September",
        "Fifa",
        "Windows Search",
        "Family",
        "Stadia",
        "1400",
        "Samsung Galaxy S20 Ultra",
        "Qualcomm",
        "Intel",
        "Project xCloud",
        "Madden NFL",
        "non-Origin",
        "85000",
        "up to 100",
        "HP",
        "Konami",
        "Quick Charge",
        "Business & Finance",
        "Google",
        "the summer",
        "Sims",
        "Sega",
        "Roomba",
        "100",
        "PJ",
        "Amazon",
        "EA",
        "Apple",
        "Andy",
        "Gmail",
        "Blinkist",
        "more than an hour",
        "a million",
        "Google Stadia",
        "G Suite",
        "765",
        "Stadia",
        "Samsung",
        "Microsoft",
        "the end of the year",
        "Friday",
        "James] Roomba",
        "35%",
        "the Quick Bits!",
        "first",
        "thousands",
        "Netflix",
        "National Health Service",
        "050%",
        "Riley",
        "15 minutes",
        "UK",
        "GPU",
        "one week",
        "Snapdragon",
        "The iRobot Terra",
        "Parenting, Psychology",
        "just 15 minutes",
        "Fr[chuckle]",
        "Team Blue",
        "Meet",
        "Xbox",
        "James",
        "The AI Economy\"",
        "the Quick Bits",
        "May",
        "Dell",
        "Electronic Arts",
        "Meet",
        "5",
        "Streaming, Sharing, Stealing",
        "Zoom"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "TIME",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG"
    ]
}