{
    "id": "-9PIcwUZvBU",
    "title": "Echo Loop hands-on: Amazon's smart ring",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-25T21:44:10Z",
    "video_url": "https://www.youtube.com/watch?v=-9PIcwUZvBU",
    "category": "Science & Technology",
    "tags": [
        "echo loop",
        "loop",
        "echo",
        "amazon",
        "amazon echo",
        "ring",
        "loop ring",
        "ring loop",
        "smart ring",
        "amazon echo loop",
        "smart device",
        "smart",
        "features",
        "specs",
        "price",
        "alexa",
        "echo alexa",
        "echo loop alexa",
        "loop price",
        "echo dot",
        "echo frames",
        "amazon event",
        "amazon keynote",
        "hardware",
        "amazon hardware",
        "tech",
        "dot",
        "amazon echo meme",
        "meme",
        "echo show 5",
        "hands on",
        "first look",
        "review",
        "amazon tech",
        "gadgets",
        "technology",
        "top 10",
        "latest updates",
        "tech news",
        "apple",
        "verge",
        "the verge"
    ],
    "views": 424397,
    "likes": 5381,
    "comments_count": 590,
    "description": "Amazons new Echo Loop took a whole Echo speaker and put it into a smart ring. Its part of a program Amazon is calling Day1, which is code for here are a bunch of products that are not really ready for mass sales, but we want to put them out there anyway. The first two are smart glasses and a little ring.  Read more:  Echo Buds hands-on:  Echo Frames hands-on:  New Echo lineup:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2lcMC0f",
        "http://bit.ly/2lL9sfC",
        "http://bit.ly/2lcqGSU",
        "http://bit.ly/2mKGQDo",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody I'm here again at Amazon's Hardware Event, and I have on my finger this big, ol' thing here which is the Amazon Echo Loop. It is Alexa in a little, tiny, ring on your finger. And if you look at it here it's titanium, it has a brushed, diamond-like finish on it. I think it looks okay, but I also have a wedding ring that's brushed metal, so there you go. It's sort of like a really nerdy, class ring if you think about it. Now, this looks pretty big, but it's actually the extra large size. It also comes in large, medium, and small, and they will send you some plastic demo rings to see if it fits you. All that aside, the point is that this is Alexa. And the way it works is there's a little button on the inside, and when you tap it, you feel a little vibration that tells you that Alexa's listening and you ask it a question. And then you hold it up to your ear, and she speaks back to you. And to use it, you really kind of want to be like (mumbles) and then you listen to it. It's not like you got it down here and you just talk to it. It really is sort of like whispering to Alexa. This thing can do a few other things. You can set a favorite contact in the app and if you double tap the button, it will actually call it and you take the call on your ring. I think that Alexa sounds a little bit tin-y on this ring, so I wouldn't recommend having a long call on this ring. Probably wouldn't recommend having a long call either because we don't know if the battery would stand up to something super long. Amazon says that it lasts about a day with intermittent use throughout the day, but if you were just taking a long call it would probably die eventually. The ring will also give you notifications, and you know it's going to all over, it'll just be a vibration, you can't customize the vibration per notification, but at least you'll know you got something, you can go look at your phone. It cost $179.99 eventually, but it has a launch price of $129.99, but it's only available in limited quantities. Hey everybody so much for watching. Are you interested in a ring that has Alexa on it that you can whisper secrets to your tiny, little, robot? Let me know in the comments, and also keep an eye for lots more videos from The Verge at the same time.",
    "transcript_keywords": [
        "Amazon Hardware Event",
        "Amazon Echo Loop",
        "Hardware Event",
        "Echo Loop",
        "Amazon Hardware",
        "Amazon Echo",
        "Alexa",
        "ring",
        "Event",
        "Loop",
        "Hardware",
        "Echo",
        "long call",
        "call",
        "Amazon",
        "long",
        "finger",
        "vibration",
        "tiny",
        "Alexa listening"
    ],
    "transcript_entity_values": [
        "Alexa",
        "Alexa",
        "129.99",
        "Amazon",
        "179.99",
        "about a day",
        "The Verge",
        "Alexa",
        "the day"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "FAC",
        "DATE"
    ]
}