{
    "id": "-A7CIS2C2bc",
    "title": "The WEIRDEST Smartphones",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-09-30T19:08:03Z",
    "video_url": "https://www.youtube.com/watch?v=-A7CIS2C2bc",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 147075,
    "likes": 5896,
    "comments_count": 203,
    "description": "Who needs iPhone 14 Pro when you got these?! WEIRDEST Products on Instagram:  iPhone 14 Pro (Kinda) Sucks:  GTA 6 Is BETTER Than You Think:  Windows 12 Is HERE:  WEIRDEST Products at Best Buy:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 The iPhone 14 is GARBAGE 0:09 Nokia 808 PureView 0:56 Escobar Fold 2 1:48 LG G5 2:38 Vertu Constellation x ULM 3:22 Energizer PowerMAX P18K 3:49 Nokia 5800 XpressMusic 4:57 Nokia N-Gage 5:33 HTC Sensation XE 6:05 Nextbit Robin 7:41 Casio GzONE Command 4G 8:19 Nokia N8 8:54 HuaWei Mate 40 Pro CAVIAR God of Fire Edition 9:43 Motorola Flipout 10:27 Palm Phone",
    "description_links": [
        "https://youtu.be/FlKv4BFM4Hc",
        "https://youtu.be/xkJZ1TyCKts",
        "https://youtu.be/KU5hJzZlPEM",
        "https://youtu.be/yPC6xs-xCRs",
        "https://youtu.be/akZnxzYGNqU",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- The iPhone 14 is here and it is garbage. - Garbage I say. - there are so many phones that are better than this one. And they've been out for a fortnight. Let's see the first one, (laughing) - the NOKIA 808 Pureview. At one point, I just wanna be like, Nokia are you okay? Is everything okay at home? Because it felt like they were overcompensating for a lot with these big camera balls. - No, no, no. Here's the thing. Nokia were ahead of their time while the iPhone was giving us what eight megapixels 12 megapixels, ah, this is a phone for ants. (laughing) - Is that, how ants measure in mega megapixels? - Yeah! - The size, how big is a big ant, how many megapixels is a big ant? - 30 - 30, 30! This is well a 41 megapixel camera would make for a giant, ant. - For context, this phone came out in 2012. It had the highest mega pickle. That's a mega pickle. (laughing) Seven years of the highest mega pickle count that we had ever seen. - The Escobar fold two (laughing) Pablo Escobar had a brother Roberto de Jesus. He said, I'm gonna start making solid bricks of gold into telephones, except that solid brick of gold was actually just a slightly worse de brand sticker. - The idea here was that Pablo Escobar's brother sold a scam. I mean a legitimate $400 phone and that you would send your money. I believe wire transfer owner - Wire transfer. So like slightly more secure than crypto - Just crypto. You could also send - Crypto. It was slightly more secure than literally just giving a bike messenger a bag of money and time to go across the border. - And it had a nifty wallpaper of a smiling Pablo Escobar - With his mugshot. Look, I feel like we're gonna get a shot for this after like we're gonna get taken out back and Escobared - The LG G5. Matt, I'm gonna ask you a question. - Yeah. - Need you to be honest with me. - Yeah. - I need you to look me square in the eyes. Have you ever used an LG phone? - I'm just realizing you have blue eyes. What, what was the question? I was, I was lost in those baby blues. - This was at a time in 2016, where removable batteries on phones were generally going away. You know, things like water resistance and whatnot was becoming a little bit more prevalent, glass back all that kind of stuff. But LG being the rebels that they are were rest in peace. They wanted to do something different. So they basically made the bottom of the phone detachable. So you could load up a battery. You also could get different friends which would give you things like the DAC module, camera grip, that kind of stuff. - When I bought mine, it came with two additional batteries. I was out here. (gun loading noise) - What is this one? - Matt I'll let you take this one. It's fine. - [Matt] The Virtu, the Virtu Constellation X ULM - Constellation. In order to buy the Virtu Constellation you have to buy a $5,100 NFT - Wait, wait, wait, no, hold on Kenzie. Please explain this a little more. - Yeah. So by September 23rd, you have to decide if you want to in fact fundge it and get a phone for it or keep the NFT and be part of their exclusive stupid club. - So it's one or the other. You're either fudging or you're non-fudging. Imagine though Matt people say NFTs have no purpose. What if you could turn your NFTs in the phones or computers or cars or something? That sounds pretty fungible to me. - You wouldn't fundge your car, would you? The Energizer power max P18K? - Oh, Matt. I know this one. I know this one. I know this one! - please. - The idea here is that this is a 1.1 pound phone 18 millimeters thick, and it had an 18,000 milliamp hour battery with weeks, weeks, weeks of standby time. Do you know how much they raised on Kickstarter? $15,000 out of the 1.2, they were looking for. The NOK 5,800 express music, but this is a 2008 smartphone. And it had one of the most incredible features that any phone has ever happened. Something that modern smartphones pale in comparison to a resistive touchscreen, know the Nintendo DS imagine putting that S*** in your phone. It came with a stylist. I'm sorry. Galaxy note series. Yeah. Canceled for a reason. Because the NOK 5,800 did it better, and did it first. - Do you think that the, like the design engineers at note NOKIA were just like doing mounds of cocaine as they're designing their phones? Like just like What? How can we make this weird? - Wait Kenzie, what's a Plectrum. - Do we need to censor it? - [Kenzie] No, no. - If we put it up here, do we have to censor whatever it is? - [Kenzie] No. No like, okay. So what a Plectrum is, is like what you use to like strum like stringed instruments. These guys said, you know what? We love express music so much. That we'll make one that works with your phone. Touchscreen - [Matt] Like a guitar pick. - [Kenzie] Yeah. - Look, all I know is if you wanna see Matt furiously strum his plectrum make sure to subscribe to this railing the daily button and otherwise you'll be forced to miss the plectrumming that's happening behind me. What's the NGAGE Matt? Tell me about the NGAGE! - [Matt] The NGAGE was what if the game boy advance had PlayStation I don't even wanna say one graphics. I would say PlayStation and a half graphics at a weird aspect ratio. And you could also get rejected from your crush on. - All I know is this, the iPhone 14 has what? Three buttons. It has what a higher definition O led 120 Hearst display. Hilarious. Imagine needing that. When in fact you could have the taco time of your dreams - The HTC sensation - Sensation, you know that this had HD video? - And it came with an eight gigabyte micro SD card which was at the time worth about $12,000. This was a steal. It also had touch sense which was just still the best looking. - The flip clock? - The flip clock, the rounded like kind of like home launcher bar. I would trade you and Kinzie. - Okay. - Both in - yep. - Hands down. - Yep. - For a modern version of an HTC with HTC sense. The NextBit Robin listen baby birds. We know what you're looking for. I love this phone. I loved it. However, thanks to our good balded friend, JerryRigEverything. He exposed the absolute scam of the NextBit Robin with the most controversial video on the internet of 2016. - The idea here was that it was a cloud powered smartphone. No, not for a cloud gaming. Lame. This was all about being able to offload your very very heavy data files. Instead you could upload it to the cloud and then you could just immediately get the performance of your fresh and clean phone back. Also. How about we make a phone out of plastic? That's a great idea. I don't see how that can go wrong. - And not just plastic. You know how plastic's made out dinosaurs. This plastic wasn't made out of a T-Rex or a Stegosaurus this was made out of those little running guys that are - Raptors? - No, the little ones. - Little Raptors, little dinosaurs are Raptors. - No. Medium size dinosaur. Raptors. - Yeah. There's also little ones too. - But I'm talking about the little ones. Okay. Whatever. - Anyway, what was most exciting about this was that while it raised $1.3 million on Kickstarter, Zach snapped it in half and then almost immediately razor purchased it about a year later - And they made it significantly better. - Yes. - This razor made a, a fine phone out of this. - Yeah. It was the basis of the first razor phone. Yeah. Unfortunately that very important cloud storage that next bit put together less than two years after this one on sale was completely discontinued. If only had an iPhone 14, you would. I mean, I mean a better phone than the iPhone 14. Wouldn't be a problem now. Would it? - The Casio? - Oh good Lord. - GZone commander 4G - The cow zone? What was this? - What is this thing? - This came out in 2013 for a hundred dollars on contract. Thanks to our friends over Verizon. This was a military eight, 10 G certified device. You could use it as a tactical weapon. - Good day. Good day malady. Would you like to accompany me to GZone? Can I ask you - Please do - Is the skin tire treads or is there like is there rubber on the case? If I'm gripping this phone, am I gripping a good year? - Can you take your iPhone 14 and throw in water and tactically knock someone out? I don't think so. The Nokia N8 Matt, this was actually a really good phone. I can with a completely straight face example can tell you that this is way better than the iPhone 14. HDMI output USB on the go FM transmitter and a 3.5g radio better than 5G. Because it's 3.55g. That's 3 whole better than the 5G. - What? - Even more importantly this actually was used to shoot a feature film, Matt something you know about because you've watched a film before haven't you? - I have (laughing) - No, no, no, no, no, no. We're not doing this one. We're not doing this one. I refuse. - First Of all, this looks like we're about to summon Dormammu. The dragon is made out of 18 Karat gold and a fragment of a meteorite - A fragment of a meteorite that fell from Mars. How can you tell a meteorite fell from Mars? Meteorites don't come from planets. They land on planets. - No, they originate from planets or from I guess celestial bodies. If wow. Because like, you know, so - Did piece - RIP Pluto. It cost a whopping $26,640 for the first time we can actually make this joke that literally cost more than a 2019 Ford focus. - This is clearly more expensive than an iPhone. - Yeah. - And does it have a piece of Mars in it? Not so yeah, not - Interested. When's the last time your phone had Mars in it? The Motorola Flipout - This is actually a neat phone. Can I tell you a little story? - Yeah. - Early in my YouTube career, I'm making videos for a year or two. - Yeah. - And what I realized was I could just lie and get views. - Are you admitting that you invented click bait? - I did. Basically. When a phone would get announced, I would just take a bunch of screenshots of the phone and then just talk about it. And that was it. I'd be like, oh, Hey, there's this new co phone called the Motorola Flipout it looks really neat. Check it out. And no one else was making videos at the time. Because YouTube was a barren wasteland in 2010. So I just got lots of views. And I remember I did a video on the Flipout and I seemed to recall it did very well. It was a phone that was great for reading three lines of an email or two texts on your screen. Other than that, it was completely filled - By MySpace status was perfect in this. - The Palm phone - The Palm phone. - Oh, so cute. - I love the Palm phone. - Yep. Do you know who the only person on the entire face of the planet I will listen to for phone advice is - Palm. - Nope. - Who, - why don't you take a guess - Marque. - Nope. - No - I don't to marque. Nope, absolutely not. - Does Linus use phones? - Nope, he does not. - I didn't think so. - Steph Curry. The answer Steph Curry step Curry is the only person on the face of the planet I will listen to. I was misdirecting you Steph Curry personally endorsed the Palm phone as his favorite device of all time. The idea with the Palm phone is that this was a secondary device. You were really kind of meant to use this alongside a regular smartphone because while it was a full Android device, it had a 3.3 inch screen and it was incredibly small. The battery life was very bad. The processor sucks. Do you think Steph Curry has time to be on his phone? He's gotta play basketball. Do you have to go play basketball? I thought so you need the Palm phone. Otherwise you're gonna be on your iPhone 14 being like hurry up to Dr. Dare - His endorsement of the thing. Wasn't just the Palm phone. It's a swoosh. - The phone cost. If I order one right now on the spot. - $350 - Today, you think so? - Yeah, because they're a collector's item. They've appreciated in value. - All right, I'm gonna do buy it now. Get, if you get a Palm phone, if - You're, if, if you buy this for me right now I will daily this for a month. - Buy it now. - Why? If you actually get - This, I just bought it. Thank you very much for watching. Make sure to subscribe Ringling that dinging bell because otherwise this is we're outta money because I keep buying stupid things for videos and we're gonna get in trouble. I bought this one now I did actually just buy it. - Couldn't regret this.",
    "transcript_keywords": [
        "phone",
        "Palm phone",
        "Yeah",
        "Palm",
        "time",
        "Matt",
        "Pablo Escobar",
        "Steph Curry",
        "iPhone",
        "phones",
        "NOKIA",
        "make",
        "made",
        "Curry",
        "Escobar",
        "good",
        "buy",
        "Virtu Constellation",
        "Mars",
        "Raptors"
    ],
    "transcript_entity_values": [
        "2013",
        "Android",
        "about a year later",
        "the Virtu Constellation",
        "Energizer",
        "three",
        "Roberto de Jesus",
        "1.1 pound",
        "26,640",
        "the Virtu Constellation X ULM - Constellation",
        "18,000 milliamp hour",
        "NFT",
        "a hundred dollars",
        "NGAGE",
        "Hearst",
        "Three",
        "3.3 inch",
        "MySpace",
        "$1.3 million",
        "Flipout",
        "Steph Curry",
        "Nintendo",
        "HTC",
        "NextBit",
        "September 23rd",
        "Casio",
        "YouTube",
        "1.2",
        "30",
        "18",
        "about $12,000",
        "2010",
        "5,800",
        "Pablo Escobar",
        "USB",
        "G5",
        "Dare",
        "Matt",
        "Curry",
        "daily",
        "2008",
        "Kinzie",
        "18 millimeters",
        "the Motorola Flipout",
        "weeks",
        "first",
        "less than two years",
        "10",
        "2012",
        "30 - 30",
        "Ringling",
        "a month",
        "Dormammu",
        "NOKIA",
        "Escobar",
        "LG",
        "eight gigabyte",
        "2016",
        "a good year",
        "Kenzie",
        "Plectrum",
        "4",
        "Pablo Escobar's",
        "400",
        "SD",
        "2019",
        "Kickstarter",
        "Linus",
        "Zach",
        "15,000",
        "PlayStation",
        "First",
        "Pablo Escobar - With",
        "more than a",
        "Ford",
        "one",
        "14",
        "Nokia",
        "3.5",
        "Mars",
        "Karat",
        "eight",
        "120",
        "Pureview",
        "Seven years",
        "a year",
        "3",
        "Palm",
        "half",
        "Virtu",
        "5,100",
        "NOK",
        "two",
        "41 megapixel",
        "350",
        "Verizon",
        "iPhone",
        "3.55"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL"
    ]
}