{
    "id": "-bGc4uHxK2g",
    "title": "Google Pixel 4 tease: what it means",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-06-14T13:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=-bGc4uHxK2g",
    "category": "Science & Technology",
    "tags": [
        "pixel 4",
        "google pixel 4",
        "google",
        "google pixel",
        "pixel 4xl",
        "pixel",
        "leaks",
        "pixel 4 leak",
        "tease",
        "pixel 4 rumors",
        "rumors",
        "pixel 3a",
        "pixel 3",
        "google pixel 3",
        "phones",
        "phone",
        "smartphones",
        "iphone",
        "apple iphone",
        "android",
        "unboxing",
        "hands on",
        "first look",
        "review",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "need to know",
        "what to expect",
        "processor",
        "dieter bohn",
        "how to",
        "mkbhd",
        "apple",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 617036,
    "likes": 12744,
    "comments_count": 651,
    "description": "Google's Pixel 4  the company just tweeted out a picture of it but why did Google do it and what does it mean? In this episode of Processor, Dieter Bohn explains three big reasons you should pay attention to for what is happening here.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2RgjkJA",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Google, what'd you do? If you didn't see this week Google just tweeted out a picture of the Pixel 4 months before it's going to release it which is not a thing companies do. And, so, I think it means three major things and I wanna go through 'em. Okay, so, first, it shows that they understand how leak culture works, especially in Android, because you know how the leak culture works, I know what the script looks like and companies never admit that they do too. But Google's now admitting that it knows. So, here's the script. Act one is like, there's a render. And then act two is we start to see some cases so we can guess at the shape of the phone and then act three is we start to get some leaks of what the features are gonna be and we start to know more about what we should expect. And then, act four, is like the thing falls off a truck and we see real photos and, in Google's case, sometimes, like, full on reviews before they've even announced the phone. And then act five, the big conclusion, the grand finale, the executive walks on stage and says this is Pixel 4 and we're like, yeah, dude, we know. We've already seen everything about it and it's a huge let down. So, Google's playing with that script a little bit. So, I think that's clever. There is a downside though, and that's what does this mean for the Pixel 3 which is now, like, the saddest sad panda of Pixel phones because no one's gonna go buy this thing because they're gonna wait for the Pixel 4 which has been officially revealed by Google itself. It probably means that Pixel 3 sales are even worse than we thought and we didn't think Pixel 3 sales were that good to begin with. But, it also means that, like, Google doesn't care. It doesn't need to make money on the Pixel 3. It's just gonna wait for the Pixel 4. So, the other thing about phone leak culture is it's all about hype and the hype cycle and it's about you, like, imagining this phone that's not out yet is going to be great and will be the thing that you want. It will be your next. And, just putting out a photo of it right away means that every time we write about the Pixel 4 on theverge.com, we're gonna use Google's official photo. It makes the hopes and dreams better. Every time an Android phone gets announced or released or reviewed between now and then, you're gonna compare it to this Pixel 4 which is going to be perfect and you've seen a nice photo of. It's this empty vessel to pour all of your hopes and dreams into. I'm pointing at the Pixel 3 'cause it is not an empty vessel, it is a sad, terrible battery life vessel. But the Pixel 4 won't be, it's gonna be great. Google knows that everybody thinks that because they tweeted the photo. We expect the iPhone 11 to look pretty much exactly like the Pixel 4. It's gonna have a big square camera bump on the side and be glossy and black and whatever. And, the iPhone always comes out a month before the Pixel and so when the Pixel would come out, people would be like, \"Oh, you just copied the iPhone.\" But now, the Pixel got shown first and so now the iPhone would be like, oh, you kinda copied the Pixel. And that's kind of, I don't know, funny to me. The second big thing that this tease means is we get to look at the picture that Google tweeted and try and make some guesses about what the features of the Pixel 4 are gonna be. The first thing that we can see is, if you look at the back of that photo, it doesn't have this two tone glossy versus matte finish that's design language that Google has stuck with for three years, which is exciting. Maybe this phone'll look and feel a little bit more high end than before. Second, there's no fingerprint sensor on the back, and that's important because it means they're gonna find some other way to let you log in biometrically. Maybe it'll be a real face ID on Android, finally. Or maybe it'll be an in-screen fingerprint sensor. We don't know but we do know that fingerprint sensors on the back are so 2017, and Google's moving away from it. Most importantly, we know that there's a big honkin' square camera module and, sure, it's gonna look like what the iPhone looks like and we're gonna have big honkin' square camera modules on all our phones now forever. Whatever. Inside that big honkin' square camera module, though, are two camera sensors and up until now, Google has said they only need one to do lots of cool stuff because they're better at computational photography. So, if they're adding a second camera sensor, that means they're promising they can do some really cool stuff with it. Will it be wide angle or telephoto? Will it have better portrait mode? What about those other little dots that are in there? Is one of them the spectral flicker sensor like on the Pixel 3? Or is it like a time of flight sensor with a laser? What's the flash gonna be? Where's the other microphone? Will they finally make good video on the Pixel 3? There's a lot of stuff that we can speculate on but we know for sure there's a second camera sensor and that means that Google's gonna lean even harder into photography on the Pixel. Oh, you know, there's one thing we can't see in the photo but I wanna talk about it anyway, and it's this Project Soli rumor. If you haven't heard of Project Soli, it comes outta Google's ATAP division and it's literally a tiny radar chip and it's designed to let a device detect tiny little hand movements out in space. Nine to Five Google heard a rumor that it was gonna be there. XDA developers found code in Android Q that verified that and I actually got to try it four years ago. You see me use on a smart watch where I twist my fingers and it, like, adjusts the smartwatch or a speaker where I could use it for, like, media controls. And we're expecting media controls to be the thing that happens on the Pixel. The last thing that this tease means, I think the most important thing, is that Google is raising the stakes on itself. The Pixel 4 should be a, like, truly flagship phone. It should be the kind of phone we've been waiting for Google to make and can compete head to head with the iPhone and with Samsung phones and with Huawei phones from a hardware quality perspective in addition to a camera and software quality perspective. Google acquired this HTC team, they call it the Taiwan team. The first phone that they worked on fully was the Pixel 3A, but the Pixel 4 is gonna be the first flagship phone that they work on and because the Pixel 3A exists, they've got a low cost option which gives them permission to make the Pixel 4 even higher cost and we're expecting the Pixel 4 to get sold by all US carriers and, probably, including AT&T. But, remember, it's coming out right after the iPhone and so, if Google wants to really prove that they can sell a lot of these and actually finally make money and make hardware a real, real business, they're going to need carrier marketing support. They're gonna be competing directly with the iPhone for shelf space and ad dollars and ad time. So, if the Pixel 4 isn't just truly great, it's gonna end up being the same thing that every Pixel phone is, a really good phone that virtually nobody buys. So, add all of that up. You've got the understanding of the hype cycle, you've got the ability to speculate on features based on the photo, and you've got this raising of the stakes. I think Google is saying that the Pixel 4 is gonna be something really special and, after all of that, it better be. Hey, thanks so much for watching. The thing that Google did was so wild, I just had to do a video about it, so I appreciate you comin' along with this ride with me. Lemme know what your hopes for the Pixel 4 are down in the comments and if you don't wanna spend that much money on a phone, you should check out our Pixel 3A review, 'cause that's a pretty good option for not a lot of money.",
    "transcript_keywords": [
        "Pixel",
        "Google",
        "phone",
        "thing",
        "Pixel phones",
        "camera",
        "iPhone",
        "photo",
        "make",
        "sensor",
        "Android",
        "big",
        "Act",
        "phones",
        "square camera",
        "Google ATAP",
        "week Google",
        "copied the Pixel",
        "Project Soli",
        "Google tweeted"
    ],
    "transcript_entity_values": [
        "four years ago",
        "Android",
        "this week",
        "one",
        "Second",
        "four",
        "a month",
        "three",
        "Pixel",
        "Google",
        "the Pixel 4 months",
        "2017",
        "US",
        "Five",
        "Pixel 4",
        "three years",
        "Project Soli",
        "Pixel 3A",
        "3",
        "Samsung",
        "two",
        "HTC",
        "4",
        "Taiwan",
        "Lemme",
        "second",
        "five",
        "Nine",
        "first",
        "iPhone",
        "Huawei"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG"
    ]
}