{
    "id": "-CRjHBM9Qo8",
    "title": "Xbox Series X hands-on: gameplay, load times, and Quick Resume",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-28T13:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=-CRjHBM9Qo8",
    "category": "Science & Technology",
    "tags": [
        "xbox series x",
        "xbox series s",
        "xbox",
        "xbox series",
        "microsoft xbox",
        "series s",
        "series x",
        "xbox series x hands on",
        "hands-on",
        "xbox series s hands on",
        "xbox hands on",
        "hands on",
        "review",
        "gaming",
        "gaming console",
        "xbox gaming",
        "first look",
        "4k gaming",
        "4k",
        "games",
        "controller",
        "warframe",
        "xbox one x",
        "the outer worlds",
        "assassins creed",
        "hard drive",
        "hardware",
        "developers",
        "ssd",
        "sea of thieves",
        "new console",
        "xbox vs ps5",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 422203,
    "likes": 9709,
    "comments_count": 1039,
    "description": "Microsofts Xbox Series X and Series S are new consoles designed for the next generation of gaming. Weve got a hands-on with both consoles, and a closer look at load times, gameplay, and quick resume on Xbox Series X.  If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Xbox Series X at GameStop:   Read more:   0:00 Intro 0:46 Hardware 2:30 Xbox Series X & Series S 4:15 Controller & external storage 5:19 Backwards compatibility  5:41 Load times  7:28 Quick Resume  8:58 Performance impressions  9:38 Destiny 2 performance  10:31 Conclusion  Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3icoz93",
        "https://bit.ly/3jagBhT",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- The next generation of game consoles are so close. I can almost taste it. (upbeat music) Okay, maybe not that close, but the Xbox Series X and the Xbox Series S are both arriving on November 10th. This tiny, dinky little Xbox Series S is priced at $299 and the larger, more powerful Xbox Series X comes in at $499. This is our first look at both of these next-gen consoles. Okay, so quick caveat. Microsoft has supplied a preview version of the Xbox Series X hardware. So that means I can't show you everything. There's a few things I can show you like you know the load times and just some of the new features as well. Now before we get into the software side, let's check out the hardware real quick. I'm just gonna say this straight up. I love the look of the little Xbox Series S. Unlike the larger Xbox Series X, the Series S is designed for 10 ATP and 1440p gaming up to 120 frames per second. It can be hooked up to 4K TV and games will be upscaled, but I think of the smaller Xbox as the Fortnite console you might have in a bedroom. Now, I know what you're thinking. What is this giant black circular thing? Well, the Xbox Series S can also be used as a walkie talkie. (screech) Oscar tango, Charlie, (screech) over and out. (screech) Now, this is obviously an Xbox Series S dummy unit. So I'm gonna have to test the walkie talkie feature properly and fully during the review. Psst, it isn't actually a walkie talkie feature. It's just British sense of humor. Now, laying walkie talkie jokes aside, the speaker-like grill on the top of the Series S is actually used for ventilation. It helps this tiny console stay cool. You'll also find ventilation at the sides and at the rear, there's an ethernet port, two USB ports, a HD UMI 2.1 port, the power connector and an expandable storage slot to increase the 512 storage that comes built in. You can position the Xbox Series S vertically or lay it flat horizontally. And I think the Xbox logo at the front shows you that this is clearly designed to lay flat. And that's probably a good thing because this should fit in most TV stands. As we don't have a fully working Xbox Series S unit, I'll leave impressions to a full review, but Microsoft has promised that Xbox Series X games will run well on this smaller, less powerful console. It uses the same CPU found on the larger Xbox Series X clocked slightly slower and with 512 gig of SSD storage. Faster storage and way better CPUs are gonna be the key for this next generation of gaming. So I think the Xbox Series S could be a really interesting option. If you don't own a 4K TV, you don't really care about 4K gaming and you just want a cheap entry point into next gen console gaming. Now, the Xbox Series X is the complete opposite of the tiny console. It stands proud vertically like some kind of monolith. If you can hear me in there, please, please give me 120 frames a second. There's a funky green effect on top, and no, it's not actually an LED. It's where the fan sits to push out the warm air. Microsoft promises up to 120 frames per second for 4K gaming with ray tracing and a lot of architectural changes under the hood. It's clearly designed to sit vertically even from the basics of the logo at the front, to the fact that it looks a little awkward and large on its side. The base also doesn't attach. So there's that. Unlike the smaller Series S, I think most people are gonna have a hard time slotting this into their existing TV stands. It's definitely something you have to consider before you get one these in your living room. It's also a massive fingerprint magnet and my unit already has plenty of smudges. The port selection on the Xbox Series X is identical to the S but a big difference is the Series X has a 4K Blue-ray drive. Microsoft is going all digital on the Xbox Series S. So that means if you'd like to buy your games on disc, or you'd like to share them with your friends, then the Xbox Series X is the obvious choice here. Now, all of this hardware is designed to obviously improve your existing games but it's also gonna be ushering in a new sort of next generation of games that can really take advantage of this new console hardware. So there's obviously the faster storage, the better CPUs and the graphical power that should introduce stuff like ray tracing into the mainstream. Both consoles will also come with an updated Xbox controller. The key differences are USB-C, a new share button and an updated D-pad. You'll still need to use AA batteries or purchase a rechargeable play-and-charge kit separately for 24 99. There's also one terabyte expandable storage cards to increase storage capacity. These are priced at $219 which is kind of pricey for storage but you will need them if you wanna play games that are enhanced for the Xbox Series X or S consoles. Now, you can of course grab some cheaper USB storage and store your games on there, but you will need to copy across these enhanced ones to the console, when you want to actually play them. But you should be able to play a bunch of older Xbox One games from the USB storage. It just really depends where the developers go and enhance these games to really take advantage of the SSD. (upbeat music) Now, speaking of older games, I've been testing a bunch of backward compatible games over the past week and it's fair to say the Xbox Series X improves all of them, even though game developers haven't enhanced them for this new console just yet. Load times are incredibly good in most games now. Let's check out Warframe to show you what I mean. Warframe loads in around 30 seconds on the Xbox Series X while on the older One X, it takes about a minute longer. Now I'm not going to force you to watch too many tedious load screens with me but doing these comparisons really highlighted just how long it takes for the current Xbox One X to load games. I could press A, go grab a coffee, come back and still have time to read an email before some games load. It's encouraging that we're seeing big improvements without developers even touching games and really taking advantage of the SSD in the Xbox Series X. These speed improvements are obvious in most games and I've noticed them in pretty much every single game I've been testing over the past week, whether that's Assassin's Creed Odyssey, No Man's Sky or Red Dead Redemption Two. Now, let's check out our two worlds which you'll see also benefits from the speed increases. Now on the Xbox Series X, you'll notice the outer worlds loads in around about 10 seconds but on the older Xbox One X, I have enough time to tell you that this new Xbox has an SSD that transfers data at 2.4 gigabits per second uncompressed, compared to just 140 megabits per second on the Xbox One X. That's why we're seeing these massive improvements. And while you had to wait minutes for some games to load on the current gen consoles. and now the Xbox One's ancient hard drive has stopped spinning and finally loaded. Congratulations on your second place there buddy. Now, I could show you a bunch more comparisons but I think you get the point. I'm now really looking forward to seeing what game developers can do to really take advantage of the SSD. (dramatic music) Another advantage of the power inside the Xbox Series X is a new feature called Quick Resume. The Xbox One had a similar feature but it kinda didn't really work very well and it just felt like most games didn't really support it. It was hit-and-miss shall we say. Now that is definitely not the case in the Xbox Series X. As you can see, I'm able to quickly swap between multiple games here and they all individually resume after around about five seconds of swap time. This feature takes advantage of the SSD on the X box Series X and I was able to quickly swap between five games freely. The limit will really depend on what type of games you're playing. It surprisingly still works even when you power the console down or you reboot it for updates which means you can quickly continue where you left off in a variety of games. And that's pretty great. If you're busy tackling a single player campaign game and then your buddy invites you to play a multiplayer game, you can just tap the Invite and not worry about save points. When Quick Resume works, it works really well. I have run into times where games are frozen up or Quick Resume hasn't worked properly. This is a preview on Xbox so, I'm not going to judge it too harshly just yet but not every game does support Quick Resume though. So games like Sea of Thieves, those big, massive online multiplayer games, they didn't work with Quick Resume and it kind of makes sense. They're not the sort of single player campaign mode where you quickly switch out and you just resume it later. They'll carry on in the background regardless of whether you're playing them or not. Now games that do support it will throw up a little Quick Resume at the top right, So you know exactly when your game is coming back to life. Since this is a preview Xbox Series X, I'm not gonna delve too deep into performance just yet especially as games haven't been fully optimized for this new console. We'll leave the side-by-side frame rate comparisons to the excellent folks at Digital Foundry. But what I will say is I'm really impressed with just how speedy and smooth games feel. It feels like I'm playing a typical Xbox but one that's actually keeping up with how I want to play with higher frame rates and smoother gameplay and with way lower load times. I wasn't able to test all the games I wanted to on the Xbox Series X just yet, simply because Microsoft is still testing a bunch of these games to make sure they run well. I was however able to play Destiny Two. Here is bungee shooter running on the Xbox Series X and overall, it feels just that bit much smoother. The only obvious load time improvements for the game. even things like jumping into menus and changing your character load out feel a lot on the Series X. Just look at how long it takes the older Xbox One to even load my character in a menu for comparison. That's a few seconds just to get to the character screen. The Xbox Series X improves these little experiences you have in games and even in public events in Destiny Two, the performance felt like it was just holding steady rather than the frame rates dipping like I've seen plenty of times on the Xbox One X version. These are pretty minor things to show you visually but you just get this stuff automatically and it makes games feel better. Now we'll be digging into a bunch more performance in games for the actual Xbox Series X review a lot closer to launch. (upbeat music) This early look has been encouraging though, particularly for the load time improvements where game developers don't even need to touch their games. Games to support unlock frame rates, We'll see immediate benefits too. I'm now super interested in seeing games that are fully optimized for this console that eliminate load screens even further and deliver on some of the performance promises that Microsoft has committed to. And there's also Sony with the PlayStation Five which is also arriving in November. Now Sony's approach is slightly different to Microsoft with the Xbox Series X flexing its 12 teraflops of power. And then the Series S, the slightly smaller, more affordable option, which isn't as powerful. Sony is also doing two PlayStation Fives as well except the internals are all the same. It's just one doesn't have a disk drive and that makes it slightly more affordable as a result. I'm not gonna put the PlayStation Five up against the Xbox or even care who wins the next generation of gaming or anything like that. I'm just glad that these two consoles exist and that they're both pushing the boundaries of next generation gaming. It's super exciting to see what's going to happen over the next few years. And I truly believe that what's inside these next generation consoles, the improvements in the processes, the SSD storage and just the graphical improvements alone, I think all of that combined is truly gonna be game changing. Okay, thanks for watching. I hope you enjoyed our real quick look at the Xbox Series X and the smaller Series S. Now it's getting a little bit dark in here so I'm gonna go and play some more Xbox Series XM. I hope that doesn't make you too jealous, sorry.",
    "transcript_keywords": [
        "Xbox Series",
        "Xbox",
        "Series",
        "larger Xbox Series",
        "games",
        "powerful Xbox Series",
        "preview Xbox Series",
        "working Xbox Series",
        "actual Xbox Series",
        "Quick Resume",
        "older Xbox",
        "game",
        "larger Xbox",
        "smaller Series",
        "quick",
        "console",
        "load",
        "Resume",
        "SSD",
        "storage"
    ],
    "transcript_entity_values": [
        "the Xbox Series S.",
        "Oscar tango",
        "Charlie",
        "2.1",
        "the Xbox Series X. As",
        "November",
        "one",
        "499",
        "Assassin",
        "the Series S",
        "the Xbox Series X",
        "the next few years",
        "the Xbox Series X",
        "USB",
        "November 10th",
        "British",
        "Series S",
        "the past week",
        "a few seconds",
        "the Xbox Series S",
        "1440p",
        "219",
        "Xbox Series S",
        "Xbox Series X",
        "K TV",
        "around about five seconds",
        "around 30 seconds",
        "120",
        "24 99",
        "Xbox Series XM",
        "No Man's Sky or Red Dead",
        "CPU",
        "512",
        "the Xbox Series X or",
        "PlayStation Fives",
        "Fortnite",
        "just 140 megabits",
        "the PlayStation Five",
        "around about 10 seconds",
        "Quick Resume",
        "Xbox One",
        "two",
        "the Series X",
        "12 teraflops",
        "the Xbox Series S",
        "Two",
        "Digital Foundry",
        "Xbox Series X",
        "4",
        "the Xbox Series S",
        "299",
        "Xbox One",
        "Xbox",
        "USB-C",
        "the Series S",
        "Xbox One X",
        "second",
        "minutes",
        "Quick Resume",
        "five",
        "Xbox One's",
        "Sony",
        "Warframe",
        "Microsoft",
        "first",
        "the Xbox Series X",
        "ATP",
        "SSD",
        "2.4 gigabits",
        "Invite",
        "Xbox Series X games",
        "The Xbox Series X",
        "Xbox Series S. Unlike",
        "about a minute",
        "about 4",
        "10"
    ],
    "transcript_entity_types": [
        "EVENT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "LOC",
        "PRODUCT",
        "DATE",
        "LAW",
        "ORG",
        "DATE",
        "NORP",
        "LOC",
        "DATE",
        "TIME",
        "EVENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "EVENT",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "LAW",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "EVENT",
        "TIME",
        "CARDINAL",
        "CARDINAL"
    ]
}