{
    "id": "-CrOfwZ1C_8",
    "title": "Can the iPhone 8 Match the PS4?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-09-22T23:59:08Z",
    "video_url": "https://www.youtube.com/watch?v=-CrOfwZ1C_8",
    "category": "Science & Technology",
    "tags": [
        "iphone 8",
        "iphone 8 plus",
        "iphone",
        "ps4",
        "apple iphone 8",
        "apple",
        "iphone gaming",
        "iphone 8 gaming",
        "iphone games",
        "iphone 8 games",
        "iphone 8 specs",
        "apple iphone",
        "playstation 4",
        "game console",
        "smartphone",
        "austin evans"
    ],
    "views": 1029045,
    "likes": 23887,
    "comments_count": 3025,
    "description": "The iPhone 8 with Apple A11 Bionic is fast but can it keep up with a Sony PS4? Why Does the Mac Mini Exist in 2017?  Subscribe!   Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=d8U5funnyA8",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. A few years ago, I compared the Xbox 360 to the then new iPhone 6 and the results were surprisingly close. But with the iPhone 8 coming out today, how does it stack up to a modern console like the PS4? First, let's take a look at what's inside the iPhone 8 as well as the iPhone X. The Apple A11 Bionic chip. The A series of SoC's have kind of been on top of the game for awhile now and the A11 is no exception. So compared to the iPhone 7, which only had a pair of high performance cores that were available for games, the iPhone 8 as well as X both have not only upgraded high performance cores. But you also have four low power cores that can all be used together. Essentially what this means, is that when you're gaming, the iPhone 8 and the iPhone X have a six core processor. That's not the entire story though. The A11 is rocking a brand new Apple designed GPU. Now this is a first. Previous iPhones, going all the way back to the original, used some sort of Imagination design. Whereas here, they designed their own triple core GPU. All this is built on TSMC's latest 10 nanometer process. Which means that the A11 has a fairly impressive 4.3 billion transistors. Now compare this to the PS4, which has a design that was originally launched in 2013. So this is using a custom AMD based APU, which not only has eight CPU cores, but also a fairly sizeable GPU. On the processor side the PS4 and the Xbox One have very similar designs. So essentially, while you do have eight cores, they're pretty weak. So based on AMD's Jaguar tech, they're going to be fine for normal use sort of on their own. But when you combine eight of them on a single console, it gives you pretty good performance. The PS4 also has a still impressive Radeon GPU which is backed up by eight gigabytes of fast GDDR5 memory. So back of the envelope math shows, that the iPhone's CPU is significantly quicker than the PS4. Somewhere in the neighborhood of about 40% faster. However, when you take a look at graphics, it is a very different story. The iPhone only has about 20% of the graphics power of the PS4. That is a huge difference. Now the iPhone is outputting to a much smaller display. Which does give it a little bit of leeway as far as the graphics power, but you do have to keep in mind that all this is inside a seven millimeter thick chassis. So with only about five watts of TDP, it has to dissipate all of that through the metal and glass design. Compare that to the PS4, which has about 90 watts to work with, and it has a heat sync, fan, vents. A lot of stuff that essentially means that the laws of physics are in the PS4's favor. Of course on paper specs are one thing but let see how actual games compare. First off, we have The Witness. A PS4 game that was recently ported to iOS. Take a look to see the differences between the two systems. What you should notice is that it is essentially the full experience on both devices. The iPhone version is running at a noticeably lower resolution which shouldn't be a huge surprise considering it's on a phone screen. And well yes, the graphics settings are not to the same level of the PS4. But the content is absolutely there and honestly it doesn't look hugely different. Now I did notice a couple of rendering issues on the iPhone 8, but honestly, once it gets an actual patch to support the 8, hopefully these will be eliminated. Next we have Transistor which is another game that will run cross platform. Here again the iPhone resolution is a bit lower and the graphics have been bumped down a notch, but it's still totally playable and honestly not a huge difference between the PS4 version. Now especially when you do pair it with a gamepad it really is a very similar gameplay experience. Now Minecraft runs on basically everything on Earth, but how do the PS4 and iPhone versions stack up? This is one of the better comparisons for the iPhone. Not only is the resolution a lot closer to what you're getting with the PS4 but the graphics settings are similar and especially once you pair it with a controller it feels very similar. Especially with that locked 60 frames per second. Continuing on the Minecraft train, we have Minecraft Story Mode. A classic Telltale game that of course is going to be running on both the iPhone as well as the PS4. You can notice some differences here so not only are the settings going to be lower but also is definitely not running at that full 1080p of the PS4. But, yet again, it is completely playable on both systems. Although with this one, I would definitely take the PS4 if I had the option. To really see what both systems can do, let's take a look at some exclusive games that just simply take better advantage of the hardware. So on the PS4 Horizon: Zero Dawn is a huge leap over anything that's available on the iPhone. The level of detail, the actual graphics, and of course the gameplay is seriously worth that $60. On the other hand, there are certain games that simply are better suited to the iPhone. Stuff like Monument Valley not only looks great, but also takes great advantage of the touch controls and games like Oz: Broken Kingdom do a really good job of leveraging the power of that A11 chip. Like I mentioned earlier, one of the downsides to having this much power in such a small device, is always going to be heat. You don't have those fans and vents to be able to pull it away. As you have to fully rely on the glass, metal build to dissipate all the heat from the device. Now I'll have to do some more throw testing but at least based on first impressions the iPhone 8 does pretty well here. So under an extended 30 minute gaming load, the back of the device actually doesn't even get that warm. So is the iPhone 8 as powerful as the PS4? No. To be fair, it is catching up surprisingly quickly. And for some games the experience isn't far off but the law of physics means that for this time the dedicated game console is going to win out. So what do you guys think of the power of the iPhone 8? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "iPhone",
        "graphics",
        "games",
        "Austin",
        "GPU",
        "cores",
        "game",
        "power",
        "Apple designed GPU",
        "iPhone CPU",
        "Minecraft",
        "core GPU",
        "Essentially",
        "huge",
        "graphics power",
        "similar",
        "performance cores",
        "high performance cores",
        "Apple",
        "story"
    ],
    "transcript_entity_values": [
        "six",
        "AMD",
        "iPhone",
        "Minecraft",
        "about 20%",
        "iPhone 6",
        "first",
        "Minecraft",
        "eight",
        "TSMC",
        "APU",
        "Austin",
        "10 nanometer",
        "two",
        "the iPhone 7",
        "AMD",
        "Apple",
        "PS4",
        "Telltale",
        "Monument Valley",
        "four",
        "Xbox",
        "the iPhone X.",
        "GDDR5",
        "60",
        "SoC",
        "iPhones",
        "eight gigabytes",
        "about 40%",
        "one",
        "8",
        "60",
        "second",
        "seven millimeter",
        "Minecraft Story Mode",
        "A11",
        "only about five watts",
        "A11 Bionic",
        "2013",
        "CPU",
        "Radeon GPU",
        "PS4",
        "Earth",
        "TDP",
        "4.3 billion",
        "about 90",
        "A few years ago",
        "Jaguar",
        "GPU",
        "today",
        "First",
        "30 minute"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "NORP",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "TIME"
    ]
}