{
    "id": "-dkfZuT7OCE",
    "title": "Apple AirPods 2 vs Samsung Galaxy Buds!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2019-03-31T22:09:44Z",
    "video_url": "https://www.youtube.com/watch?v=-dkfZuT7OCE",
    "category": "Science & Technology",
    "tags": [
        "airpods 2",
        "airpods 2019",
        "airpods vs galaxy buds",
        "galaxy buds",
        "galaxy buds vs airpods 2",
        "airpods 2 vs galaxy buds",
        "apple",
        "samsung",
        "apple vs samsung",
        "iphone XS vs galaxy s10",
        "iphone",
        "galaxy s10",
        "tld",
        "jonathan morrison",
        "airpods 2 review",
        "unboxing",
        "review",
        "tech",
        "2019",
        "comparison",
        "best wireless headphones"
    ],
    "views": 837980,
    "likes": 23540,
    "comments_count": 1907,
    "description": "Apple AirPods 2 vs Samsung Galaxy Buds Review + Comparison! Secret Galaxy S10 Wallpapers!   Intro track! 85% by Loote:  Spotify:  Apple Music:   Stuck by Sita:   Spotify:  Apple Music:   the 2019 AirPods feature wireless charging, a new H1 chip that enables hey Siri through voice, 50% more talk time and faster switching between devices.  Wireless Chargers!    Tech that made my iPhone better:  The Perfect MacBook Pro Setup:   TLD Spotify Playlist!   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:",
    "description_links": [
        "https://youtu.be/V-AOQH3etYc",
        "https://youtu.be/8kkIo8P6GZw",
        "https://open.spotify.com/track/3t1XqbvvUtM3SHwf0qKQV0?si=mEOHXENjQLuh11XwHSOysg",
        "https://itunes.apple.com/us/album/85-feat-gnash/1456182067?i=1456182079",
        "https://open.spotify.com/track/2vHdaKeMPI3me7RN5slGk0?si=3nDOWR-jRvmEbr8ceZWYTg",
        "https://itunes.apple.com/us/album/stuck-single/1453420449",
        "https://amzn.to/2FnUiCG",
        "https://amzn.to/2To7DA2",
        "https://youtu.be/LrcHHyMSVtY",
        "https://www.youtube.com/watch?v=fBTNg...",
        "https://open.spotify.com/user/jonathan.morrison/playlist/3wmqwmIrP6MFizjiyM7k6y?si=x_rBjHbiQp2lFmyM5Qj5SQ",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQ...",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq..."
    ],
    "transcript": "- The Samsung Galaxy Buds and the just released second generation AirPods are two of the best wireless options out right now. They both pack wireless charging. They both feature a few tricks up their sleeves, but how exactly do they stack up side by side? Ooh, I should really use my head I should really use my head instead thinking with my chest Ooh, I was dying to connect Give me 85%, only 85%, yeah - Shout-out to Loote for the intro track. If you guys want to check that out, I will drop a link down below. Today though, we got Galaxy Buds and we got new AirPods. And while for the most part, I feel like if you own an iPhone, you should grab AirPods, and if you own a Galaxy device, you should grab Galaxy Buds, all of you out there might be curious what each of these offer. Hands down, the biggest difference between these two is going to be the cost. The Galaxy Buds are priced pretty aggressively, coming in at just about 130 bucks, whereas the AirPods in classic Apple fashion cost a crapload more at just about 200 bucks when you factor in that fancy shiny wireless charging case because let's be honest, that is the only way you are gonna flex over gen one owners. For the most part, there hadn't been an AirPods alternative for Android until the Galaxy Buds debuted. They're not perfect, but they are really freaking good. With AirPods, you flip open the cap, I tap here, I tap there and you are good to go. And it's even faster with the second generation. For the most part with the Galaxy Buds, it's the same exact experience, just a little bit less sexy because you gotta say yes like four times to give your phone permission. But for the most part, they're stupid simple, and once you're done, you never have to worry about it. In terms of advantages with the Galaxy Buds, if you own a Galaxy S10, you can wirelessly charge those with your phone. If you own AirPods, you can't do that with your iPhone. Also, in classic Android fashion, you have way more customization and flexibility with a dedicated app. For starters, you can control the amount of the ambient noise from the outside world around you. You can turn it on. You can turn it off. Or you can change the intensity of the mix. What's also cool with the Galaxy Buds is the ability to change the EQ within the app, something you cannot do with AirPods. You do of course have third party options or the internal EQ with Spotify. And I will say, I'm not a huge fan of anything but that stock setting with the Galaxy Buds, but again, it's nice to have that flexibility. One of the weirdest quirks with the Galaxy Buds is conversely one of the best features of AirPods where you simply take out an earbud to pause your song or video and then pop it back in to have it resume. For whatever reason though, with the Galaxy Buds, you have to take out both, which is a little bit weird, so here's what it's like using Galaxy Buds. And here's what it's like using AirPods. As far as sound quality, I think the Galaxy Buds do two things without question better than AirPods, low end and noise isolation, so if you're into that bass, that slap, you will enjoy the Galaxy Buds. And if you work out or maybe you travel a lot on the planes, the Galaxy Buds are going to be the better option. In terms of overall sound quality though, I'll say the AirPods pack more clarity, there's more space, there's more separation. They definitely lack the low end that the Galaxy Buds have, and in terms of sound isolation at the gym or on an airplane, they are trash. But overall, I do like the balanced sound of AirPods. So yeah, both of these do charge wirelessly, but what's nice with the Galaxy Buds case is you have that flexibility of charging also with USB-C. If you own an iPhone, there is a good chance of course that you have a lightning cable, but I for one am ready for everything to be USB-C. Absolutely though, one of the biggest advantages with these second generation AirPods over Galaxy Buds that potentially may justify that price difference is the inclusion of Hey, which gives you control with your voice. Yes, before someone yells at me, you can access Bixby or Google Assistant by tapping on the Galaxy Buds, but using your voice is next level. Yes, Siri is not the greatest virtual assistant, but there's something cool about using your voice to send a text, look up the weather, to look up directions, or having control over my new details like changing the volume down to 10% to 50, that stuff is really useful. One other advantage with the AirPods actually comes down to the Apple ecosystem if you own a Macbook or iPad is the ability to change instantly between devices. That's something you just can't do with the Galaxy Buds, and it may not be a big deal to you, but if you're in that Apple ecosystem, jumping from device to device is really freaking cool. Now one huge reason why people go for AirPods is actually not music but for phone calls. So I thought it'd be cool to actually stack these side by side to see how AirPods sound versus Galaxy Buds. Austin Evans has no idea I'm about to call him right now. Hey. Call Austin Evans. Does Austin Evans answer right now on a Friday night at 9:00 PM? Evans, how you doing, buddy? I know this is a random call, but. So I'm calling you from either the Galaxy Buds or the AirPods. I'm not going to tell you which is which right now, so just get it in your mind, soak it in, how does my voice sound? What are you doing right now? Taking a bath? Cool, I'm gonna call you right back right now on the alternative set of earbuds. Peace. Austin Evans's number is 555, hey guys. That works. Evans. Just checking in on that bath. Lavender? I mean, that's cool. Alright, yeah, you sound. Can you hear me? No, hmm. Alright, I'm gonna call you, I'm gonna call you back one more time for the recap and the finale. Evans did not like that. - [Austin] Okay. - Evans, how are you doing? - [Austin] Good, I can actually hear you this time. - Is that bath water getting cold? - [Austin] It's icy cold, man. It's not good, not a good scene over here. - Kobe Bryant, I get it, it's cool, I respect that. So give me your thoughts. Tell the people. - [Austin] The first one was way better. The second one sounded like you were talking to me on some old landline. Whatever that was, it sounded super low quality. It wasn't even like hard to understand. It sounds like a really low bit rate. I don't know, whatever that thing was doing was not good. - Alright, the second one was AirPods. - [Austin] AirPods suck then. I, yeah, that wasn't even like a close comparison. - I'm just kidding, those are Galaxy Buds. Now everyone's gonna hate me Evans, thank you. - [Austin] Am I the only person who picked that? - No, you're the only friend I have so. - [Austin] Oh. (laughs) Okay, well, I don't know what was going on with Galaxy Buds. To me, that sounded, I don't know, it sounded really cheap. The first one, AirPods, definitely sound way better. No comparison. - So Tim Cook, you can definitely throw that on your next keynote. The AirPods definitely sound better, dash Austin Ekans. - [Austin] Thanks Tim Apple. - Peace. Now this may not matter to a ton of people out there but if you care about Bluetooth range or how far you can get from your phone before you drop connection, got this fancy pants laser measuring gun and with the AirPods, I was able to get about 50 feet before I dropped the signal and with the Galaxy Buds, I was able to go about 42 feet. I don't think there's going to be a situation where you're that far from your phone but it's nice that you have that range. And performance across both these gets a. - [Man] Very nice. - That said though, after everything is said and done, I still feel like if you own an iPhone, grab AirPods. You're gonna love the crap out of them. And if you're Team Galaxy, grab the Galaxy Buds because there is so much to like about them. Thank you guys so much for watching. Hopefully you enjoyed the video. If you did and you feel like being awesome, make sure you guys go, Evans taking a bubble bath, on that like button. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Galaxy Buds",
        "Samsung Galaxy Buds",
        "Galaxy",
        "Buds",
        "Samsung Galaxy",
        "grab Galaxy Buds",
        "AirPods",
        "Galaxy Buds case",
        "Galaxy Buds debuted",
        "versus Galaxy Buds",
        "Evans",
        "Austin Evans",
        "sound",
        "Team Galaxy",
        "Samsung",
        "cool",
        "good",
        "Austin",
        "Galaxy device",
        "call"
    ],
    "transcript_entity_values": [
        "two",
        "Siri",
        "10% to",
        "Kobe Bryant",
        "iPhone",
        "just about 130 bucks",
        "Austin Evans's",
        "Today",
        "One",
        "Evans",
        "only 85%",
        "The Galaxy Buds",
        "Tim Apple",
        "just about 200 bucks",
        "Loote",
        "Apple",
        "EQ",
        "Bixby",
        "555",
        "iPad",
        "four",
        "a ton",
        "AirPods",
        "about 42 feet",
        "the Galaxy Buds",
        "Spotify",
        "S10",
        "USB-C. Absolutely",
        "second",
        "Google",
        "first",
        "85%",
        "one",
        "Austin Evans",
        "Friday",
        "Austin",
        "Tim Cook",
        "Team Galaxy",
        "third",
        "Macbook",
        "Austin Ekans",
        "about 50 feet",
        "9:00 PM",
        "Android",
        "Galaxy Buds",
        "Jonathan",
        "USB-C."
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "TIME",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG"
    ]
}