{
    "id": "-E9VPBtAUXU",
    "title": "15 Smartphones that FAILED to Beat the iPhone",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-03-29T18:06:55Z",
    "video_url": "https://www.youtube.com/watch?v=-E9VPBtAUXU",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 177815,
    "likes": 6851,
    "comments_count": 350,
    "description": "Which smartphone do you think is better than the iPhone?   We Tried Netflix Gaming So You Dont Have To:  I SCAMMED Goodwill:  This Should be BANNED:  Do(n't) buy the Mac Studio:  We Tried WISH for Rich People:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Matt keeps getting screwed 0:24 Palm Pre 1:07 Nokia N95 1:34 Motorola Droid 2:08 HTC Evo 4G 2:40 Blackberry Bold 9900 3:24 Monohm Runcible 4:26 Samsung Galaxy S4 5:07 Amazon Fire Phone 5:52 Project Ara 6:48 RED Hydrogen One 7:36 KyoCera Echo 8:24 LG Wing 9:11 Sony Ericsson Xperia Play 10:02 Razer Phone 10:42 HTC First 11:24 What do you think?",
    "description_links": [
        "https://youtu.be/-DlpJHcbtHE",
        "https://youtu.be/cvFZdvdEC_w",
        "https://youtu.be/jA_cGZpgYK8",
        "https://youtu.be/rPZ_y7jzsUM",
        "https://youtu.be/sPOu5YN7X94",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- We don't actually know the order of the phones (laughs) we have to argue right now. So Matt just keeps getting screwed. (laughs) - Kinsey shuffled the deck, and has given me the worst hand. Hello and welcome to This Is. iPhone is arguably the- - Worst phone that's ever been made. And today we're gonna tell you some of the best phones that clearly are superior to the iPhone, and will instantly make you take your iPhone and throw it in the garbage, when you see it. They should have defeated the iPhone. Starting with Palm Pre. Now, Palm made a series of clever phones over the years, but the Palm Pre- - They've made some really bad phones too. - Ah, they're mostly good. But the Palm Pre was by far the most technologically advanced phone out there besides the iPhone. Let me pitch you on why. Okay. - Okay. - Palm Pre had wireless charging in 2009. Mind you, you had to get like a separate back and it was a little bit of a thing. But you could wirelessly charge your phone full like seven, eight years before most people could. On top of that, it had by far the best operating system that has ever been made based on Linux, that's not called Android, webOS. This TV behind us from LG, still uses webOS. - So you're saying the best OS that's ever existed on a phone is now running a bunch of little triangles behind us. - Yeah, exactly. Hit me then. What do you think is better than the Palm Pre? - The Nokia N95 was a better version of the Palm pilot. If you're looking for just features on a phone, just N95 was the superior phone. This had DVD quality camera. - Like the video? - So 480p video in 2007 on a camera. That was insane. And it actually sold way more units than the iPhone did. - Okay. But here's the thing. It's ugly. - It is. (laughs) That's fair. - You can't tell me that this is better than the Palm Pre, but you know what I can tell you was even better. Droid does baby. The Motorola droid was I think the quintessential iPhone killer. Now this was a couple years after the iPhone came out. So this is 2009. This phone had so much going for it. Not only did it actually have what was a fairly nice version of Android at the time because it's easy to forget that early Android was bad. And the hardware of this phone was really, really impressive. - Their success was also their failure because they decided to call it a droid. They lost all brand marketing for it. Everyone just thought that just meant an Android phone. - Yeah, that's true. - So everyone's like, \"Hey, can I get an Android?\" And I give you this true superior Android phone at the time, the HTC Evo 4G. In 2010, this was only $200 on contract. This is when contracts subsidized a lot of the phones. HTC Senses was the best- - No. - Skin on Android. - You just like the stupid flippy clock. - I did like to flippy clock. (laughs) Now what made this thing super cool. This had a micro HTMI port on it and a little kickstand. This was the ultimate media machine back in 2010. - Do you know the problem with your device? - What's the problem? - Doesn't have keyboard. - Your two phones had physical keyboards. Guess what doesn't have any physical keyboards anymore? - We live in the alternate universe where all phones still have keyboards. Mostly thanks to the Blackberry Bold 9900. Blackberry sadly doesn't have the reputation that they used to, but if you can bring yourself all the way back to 2008, I would argue that the Bold 9900 was one of the best Blackberries they ever made. It had, I think one of the most comfortable typing experiences that were ever in the physical keyboard realm. - You know what it didn't have at all? - Apps. - Apps. - Okay. - None. - Well, it was still better than the iPhone because it worked. - So I'm noticing a pattern with all the phones you think are the best from the time. They all had keyboards and they all had mouse-like devices on them. (laughs) - Look, you tell me to give you a list of phones that are better than the iPhone. That list is pretty small. I gotta get a little creative here, Matt. - You know what was better than the Blackberry at the time. (laughs) - Go ahead, Matt. What's the great execution again? - The best execution ever. (laugh) - You watch yourself into that one. - I can't say- - Tell me more. - This with a straight face. (laughs) What was better (laughs) than the- - iPhone killer. - The iPhone was the Monohm Runcible. (laughs) - The ridiculous, got it. - This literal piece of garbage was announced in 2015, it was Indiegogo, which raised over a quarter of a million dollars. - Which is nothing for a smartphone. - No. It was advertised as an anti-smartphone. No Android, no play store, no nothing. And it was this weird circle device. And it was like, the back of it was like you could get different textures. It was like rock, it was stone. That hole in the back of it is a camera, which it was so unwieldy. It was expensive and it never once showed. Yeah. Never shipped to market. - They spent years talking about it and then just whoop. Well, that's definitely better than the iPhone. - Yeah, definitely better. I can't, I can't, I can't. - Okay. Here. - This thing was trash. - I'll put it back on the rails. A phone that actually was legitimately a real competitor with the iPhone was the Samsung Galaxy S4. So Matt, the S4 to me, I would say the S3 as well but this was a good era for Samsung. The S4 had a lot going for it. Namely a 1080p OLED display something that is still honestly pretty impressive by today's standards. But keep in mind, this was from 2013. You had a removable battery, you had a micro SD card slot and you had the greatest softer experience in the world touch waves. - I'll give you that the Galaxy S4 was a damn fine phone. It was a great phone. Plastic, yeah. But if it had HTC Sense it would've been a perfect phone. - Okay. Well then what's better than the S4. - I'll tell you what's better than the S4. God damn it! (laughs) - We don't actually know the order of the phones we have to argue right now. So Matt keeps getting screwed - Kenzy shuffled the deck and has given me the worst hand. The Amazon Fire phone released in 2014 was a whopping $650 without a contract. Holy crap. What it was supposed to be able to do is like scan barcodes and products and whatnot. - And your face to give you that 3D interface. - And then you were supposed to be able to like integrate it with Amazon. This thing was trash, the specs on it were horrible. It didn't have any of the Play Store. - There was nothing going for the Fire Phone. This was back in the era where everyone and their moms were trying to make theirselves their own smartphone, Fire Phone was bad. You know, what was great? Project Ara. A revolutionary product that I think would've changed the game had it not been so cruelly taken away from us. So Project Ara was a Google phone. Essentially this was the idea of a fully modular smartphone. So you could theoretically have like the backbone and you could swap out a different screen if yours broke or there's a new, like higher res option you could swap out your processor. You could add extra battery modules or a new camera modules. Like it was a very cool idea and fun fact, Matt, I was one of the few people outside of Google to actually see one of these because they never shipped. But there was at one point I was at an event a Google engineer pulled this outta their pocket for a second. Me and a couple other people were like, oh, that's real. And we immediately shot video. And then a PR rapper goes like, nope. But if you wanna find real footage of Project Ara in action. Your boys got some of the footage on the whole internet. This unfortunately got canceled and ultimately was a really doomed scale budget. - There's no way to make it cost effective. - It is very limited - To be saying like, oh, I'm gonna upgrade my camera module. It just not happening. - You know, what is happening, Matt? The transition to your next phone that you don't know is. - The next phone is, the number one phone selling. (laughs) So the Red Hydrogen One might be the worst phone that's ever been made - But Matt is better than the iPhone. - I can't even argue this in a good way. So this absolute behemoth was released by Red. The camera manufacturer who also makes sunglasses founder of Oakley decide to start making cameras and then he released this piece of garbage. - So the idea was with Red cameras, it's super high end cinema cameras that you'd be able to attach this either to your Red camera or you could attach like nice like lenses and cameras and stuff to the back of the phone. But at $1,300, this crashed and burned harder than Matt's last segue. What's better than the Red Hydrogen and what's better than the iPhone is in fact, the Kyocera Echo. Now, Matt, I'm gonna tell you about this because this was a dual screen phone all the way back in 2011 back when the iPhone was an infant. The Kyocera Echo was a highly ahead of its time device. Android 2.3 was exactly the right version of Android to have a custom dual-screen version with very low in specs that could definitely run lots of apps at the same time. - So it had this super revolutionary feature where you could actually have four separate apps open at the same time. And there would be like one line of text for each of those because the resolution was so, so bad. - It was still ahead of his time. - Sometimes the technology's just not there yet. And I agree that we have to push the boundaries but sometimes maybe wait a year before you do that. But you know what didn't wait a year before revolutionizing the game. - What's that? (laughs) - All right. All right. No. So the LG Wing was actually semi revolutionary- - Yeah, yeah, yeah. Okay. I'll give you that. I'll give you that - This was like a legitimately cool but just poor executed feature. The main screen would flip out and there was a secondary screen below it. It gave you a good viewing angle. You could like be typing while still looking at things. This was great for playing Fortnite. - Yep. - Because you basically had controls on the bottom of it. I'm trying really hard to say, nice thing about this phone - I'm sold actually. I'm gonna throw everyone's iPhones on the garbage. The LG Wing was clearly the best phone that we've ever seen. - The LG Wing was such a flop that LG, just like, you know maybe we shouldn't make phones anymore and then they didn't. - But you know, what's even better than the LG Wing and something that truly blew everyone away. The Sony Erickson Experia Play. This was known as the PlayStation phone for a reason. Now this is around the era of the PSP Go right before the VDA came out. This actually had some really interesting ideas behind it. So it had a little slide out, but instead of keyboard you had an actual full like PSP style game pad on top of that, it had relatively decent specs and okay screen. And it actually was a relatively decent full featured phone. - Actually, the big problem with this one is it was announced as the PlayStation phone. And it wasn't released for like five years later. - [Austin] It wasn't that hot. And it could only play PS one games despite the fact it looked exactly like the PSP Go it couldn't play a single PSP game. And then the Vita came out immediately after that. And it was like, well, why would I get this phone? Cool idea, horrible execution. But you know, it, wasn't a horrible execution. Razor Phones which technically is one of the only ones on this list that's not officially discontinued. - Well they just didn't make anymore. (chuckles) - So in 2017 Razor released the Razor Phone which was pretty revolutionary as a gaming phone. It had 120 Hertz display. - [Austin] That was cool. - Which was super revolutionary at the time. Dual front facing speakers which no phones really have now. It had a vapor chamber for cooling. This was a gaming beast. - It was. And it also was a beast in your pants. - Yeah, it was quite large. I mean, it doesn't fit in your pocket. - We should stop this. This is going off the rose very quickly. - Yeah. - I'll tell you what the real Gs used. They used the HTC first, our last device of the day because the HTC first had the unique distinction of being a Facebook phone. A mid range phone that was aimed at the budget market that had a Facebook and a Facebook launcher, which was available on other devices, but it came with it right outta the box. - It originally launched at either $100 on contract, a $450 contract- - Mid range for the time. - Within a couple months, it was so unpopular that basically like, you know what, a dollar. You could have got this at the dollar store. - But the thing was the HTC first it was the only phone that was blessed by the Zuck. And honestly, if I don't trust the Zuck with my phone and my data, who else are you gonna trust? Except for that, this is crew and subscribing to make sure that you never miss another high quality video where we're super clue on exactly what we're talking about. Not making it up as we go. Make sure to subscribe, leave a like, Ring a ling that dingling button and let Matt know about how great his choices of phones were. And thank Kenzie for screwing us both over. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "Palm Pre",
        "phones",
        "iPhone",
        "Matt",
        "Android",
        "Android phone",
        "Palm",
        "Fire phone",
        "Pre",
        "Yeah",
        "back",
        "superior Android phone",
        "time",
        "HTC",
        "Worst phone",
        "camera",
        "Amazon Fire phone",
        "made",
        "Red"
    ],
    "transcript_entity_values": [
        "2013",
        "Android",
        "Razor",
        "the Galaxy S4",
        "the Fire Phone",
        "1,300",
        "the day",
        "Palm",
        "S4",
        "Fortnite",
        "650",
        "Indiegogo",
        "webOS",
        "The Kyocera Echo",
        "Palm Pre",
        "Zuck",
        "HTC",
        "Oakley",
        "2015",
        "2010",
        "Samsung Galaxy S4",
        "Erickson Experia Play",
        "the LG Wing",
        "Google",
        "2017",
        "Matt",
        "Austin",
        "Samsung",
        "PS",
        "2008",
        "The LG Wing",
        "2009",
        "100",
        "2014",
        "Amazon Fire",
        "eight years",
        "Project Ara",
        "2011",
        "first",
        "Linux",
        "the Kyocera Echo",
        "the Palm Pre",
        "Kinsey",
        "a couple months",
        "2.3",
        "LG",
        "Evo",
        "the Blackberry Bold",
        "Fire Phone",
        "Project Ara",
        "N95",
        "Kenzie",
        "only $200",
        "Facebook",
        "SD",
        "second",
        "like five years later",
        "a year before",
        "PlayStation",
        "Blackberry",
        "450",
        "one",
        "a couple years",
        "four",
        "the Play Store",
        "iPhones",
        "S3",
        "today",
        "Nokia",
        "120",
        "years",
        "the years",
        "the Red Hydrogen",
        "a year",
        "Hertz",
        "Palm",
        "VDA",
        "two",
        "Motorola",
        "Amazon",
        "seven,",
        "Sony",
        "Vita",
        "iPhone",
        "2007"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "FAC",
        "MONEY",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "GPE",
        "LAW",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE"
    ]
}