{
    "id": "-hnosneJg1Q",
    "title": "Apple iPhone 8 vs Samsung Galaxy S8!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-09-22T00:24:34Z",
    "video_url": "https://www.youtube.com/watch?v=-hnosneJg1Q",
    "category": "Science & Technology",
    "tags": [
        "Galaxy S8",
        "iPhone 8",
        "iPhone 8 X",
        "iPhone 8 vs Galaxy S8",
        "Apple",
        "Samsung",
        "iPhone 8 vs Galaxy Note 8",
        "Review",
        "Unboxing",
        "2017",
        "iPhone X vs Galaxy S8",
        "iphone 8 plus",
        "iphone",
        "iphone x",
        "samsung galaxy s8",
        "apple iphone 8",
        "iphone 8 unboxing",
        "iphone 10",
        "iphone x review",
        "iphone 8 review",
        "iphone x unboxing",
        "Apple vs Samsung",
        "iPhone vs Galaxy",
        "iphone x vs iphone 8",
        "iphone 8 hands on",
        "ios 11",
        "tld",
        "jonathan morrison",
        "iphone 8 camera"
    ],
    "views": 2162318,
    "likes": 47736,
    "comments_count": 5607,
    "description": "Complete iPhone 8 vs Galaxy S8 Hands on speed test & Camera Comparison!  S/O to Next Games for sponsoring this video! Download The Walking Dead: No Man's Land & get Negan for free! Offer is available until 9/30/17. Click here:  iPhone 8 plus vs iPhone 8 Unboxing!   Galaxy S8 & iPhone 8 Skins!  Anker PowerCore II:  Save 15% off by using code - JMPOWER2  The iPhone 8 & 8 Plus feature Apple's A11 Bionic Chip, Wireless Charging, Improved cameras (dual camera + portrait mode on the 8 plus), iOS 11 and more but is it enough to compete with Samsung's Galaxy S8 and it's beautiful 5.8\" Infinity Display, 12MP camera and....Bixby? :D   iPhone X vs iPhone 8 / 8 Plus!  iPhone X Hands on!   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://nxtg.ms/2vVzY5D",
        "https://youtu.be/F8i8pnZmk50",
        "https://dbrand.com/shop",
        "http://amzn.to/2gw6d4S",
        "https://youtu.be/qSIsMqSoRNs",
        "https://youtu.be/1L7JFN7tQLs",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- [Jonathan] Hey guys, Jonathan here. Without a doubt Samsung's Galaxy S8 is one of the most impressive phones of 2017. The iPhone 8 however is officially here and with that I think it's time to see how these two stack up side by side. Now clearly once you put these phones next to each other in terms of the design, aesthetics and really just overall looks, not to sugarcoat it or anything but the Galaxy S8 is miles ahead. The iPhone 8 definitely does have some very impressive features, but design wise, it really hasn't changed much over the years. So honestly for all intents and purposes, it very well could have been called the iPhone 7S. The Galaxy S8 on the other hand is a completely different story. It has this beautiful bezel-less display that looks like it's straight outta the future. And I've said it before but I still think the Galaxy S8 is arguably the best looking phone of 2017. Now with the upcoming iPhone X that very well may change that statement for me, but that is different comparison for a different day. For now, and especially because both the iPhone 8 and Galaxy S8 are very similar in pricing we're gonna focus on these two phones. Now regardless, both of these are very impressive devices and I'm sure most of you out there would love to win either of these. So with that you have a chance to win either a brand new Galaxy S8 or iPhone 8, the choice is yours. But if you wanna go crazy and we can get to 100,000 likes I will give away both of these. So for a chance to win go ahead and check out the link down below. But the main thing to do is make sure you subscribe, so if you haven't don't that, make sure you hit that subscribe button. Huge shout out to The Walking Dead: No Man's Land for sponsoring this comparison and giveaway. I was actually super excited they wanted to do that because I freaking love The Walking Dead. If you guys haven't checked out the game it is turn based action strategy game where you battle those walkers and you can do so with Daryl, Rick, Glenn and even the ninja master with a stick, Morgan. Now as much as I love those guys, there's a part of me that can't help but root for Megan and Lucille. So if you're a Megan fan too, right now you can download the game which is free in both the App Store and the Play Store before September 30th you get Megan for free. This game is super addicting. And if you can't get enough Walking Dead there's a unique storyline written specifically just for this game. There are weekly challenges and two huge updates just dropped. First is the Distance which is a brand new game mode which is specifically for players which have reached Council Level 18 and this is designed so you can put those skills to the test in a brand new Survival Mode. It's a little challenging because characters will not be able to heal in between missions. But if you're up for the challenge, it's worth it because new rewards will drop each time the Distance event occurs. This allows you collect components for your mission crates and craft badges for your survivors. Both these updates are available now, so make sure you check out the links below. And whether you're on team iPhone or team Android if you're a fan of The Walking Dead you're gonna dig this game. Now unfortunately with the iPhone 8 it still connects to a lightning port and surprise, surprise does not have a headphone jack. So two potential advantages with the Galaxy S8, is one, USB C and two, the fact that you can connect a pair of wired headphones without any adapter. Now another potential advantage with the Galaxy S8 is MicroSD card expandability. Now I don't want to turn this into an iOS versus Android war. For me I've never really felt the need to store anything on a MicroSD card but for some it may be big deal and if that's the case, that is clearly where the Galaxy S8 has one up. Some of you might notice that both the iPhone 8 and Galaxy S8 feature an all glass back. Now that's because both of these feature wireless charging. Clearly this isn't anything new to Samsung or the Galaxy line up. It is however brand new to the iPhone 8. They're using a wireless Qi standard and not some proprietary crap. So the fact that it's finally here on the iPhone is only gonna help wireless charging become further adopted and that is better for everybody. The one thing mention though in terms of fast charging or quick charging, that is something you get right out of the box with the Galaxy S8 whereas with the iPhone 8 you're going to need to spend nearly $100 in accessories just to get that which is kinda crazy. So definitely a plus one to Samsung for providing Quick Charge out of the box, and unfortunately in typical Apple fashion, you're gonna pay more for adapters and accessories. For me though, whether I'm on Android or iPhone I'm usually plugged into an Anker PowerBank or wall charger so I've never really felt like my phone needs to charge faster. This is their brand new PowerCore II which packs 20,000 mAh of juice inside, so battery for days. It really doesn't matter which device you're on, it just works and it works well. So if you're interested in checking on out, I would drop a link down below. Now from there, jumping into displays. It is not even close. The Galaxy S8 here is the clear winner. It features a beautiful and I mean beautiful 5.8 inch Super AMOLED display. It's bright it's colorful, it's vibrant and the lack of bezels kinda just makes you wanna stare in awe at it, and there is really no other word to describe it than impressive. With the display Samsung also did a fantastic job of implementing a virtual home button into the screen and it just works really well. The downside to that is that Samsung could not implement the finger print reader into the display so in turn it is located awkwardly on the back next to the camera which I'm still not a fan of. Unlike the iPhone X, the iPhone 8 does however have a fingerprint reader or Touch ID up front so in terms of that, I definitely prefer the iPhone 8. That though unfortunately does not help the iPhone 8's display when stacked up side by side against the Galaxy S8. Now the iPhone 8 is not a bad display by any means. Its got a beautiful white color gamut, bright, true tone, actually works really well but it just kinda pales in comparison in both size and resolution. It is a 4.7 inch display with a 750P resolution. And again when you stack it side by side against the Galaxy S8 it's not even close. So while the display is a clear advantage to the Galaxy S8 if we look under the hood, the iPhone 8 might surprise you. Yes, the Galaxy S8 has an eight core processor and I've seen people make fun of the iPhone 8, the iPhone X for finally getting a six core processor. But the fact is the A11 Bionic chip is nuts. Stacked up side by side against the Galaxy S8 it completely smashes and obliterates it. The big thing with that A11 chip is that when it needs to it's gonna utilize all six of those cores at the same time whereas with the Galaxy S8, it is actually two pairs of quad core processors. That in turn is why the iPhone 8 and especially in multi-core performance does so well. And just for reference that is on par with a 13 inch MacBook Pro which is crazy in terms of a smartphone. Again, I don't want to turn this into a war or negate how awesome the Galaxy S8 is, because it is a fantastic, beautiful, really fast phone. But in terms of performance, it is clear that Apple is miles ahead. From there I wanna jump over to cameras because honestly that is probably one of the most important features to pretty much everybody out there. Both the iPhone 8 and Galaxy S8 feature 12MP shooters on the back and in terms of performance goes as far as photography, both do an amazing job. The showcase that I think these two pictures here are a prime example of why that is the case, this was shot on the Galaxy S8 which is an amazing picture but if we hop over to the iPhone 8, it is pretty much equally as impressive. I'm not sure which I like more but I think either way you would not be disappointed with either of these. Same thing here with these pictures, I think the iPhone 8 does a fantastic job of capturing the highlights, the shadows, not over blowing the sunset. But it's pretty much the same thing on the Galaxy S8. The only advantage I would say the S8 has with this picture over here is if we crop it and zoom in, it does retain sharpness just a little bit better over the iPhone 8. Now into where I prefer the Galaxy S8 over the iPhone 8 is this alpha balance shot right here. The iPhone 8, it is every so slightly just a little over washed, a littler over exposed. But as we hop over to the Galaxy S8, it kinda just holds everything together better. The colors pop more and overall it's just a more pleasing image. From then we move into more of a lower light situation. I think both the iPhone 8 and Galaxy S8 do a really fantastic job. I think with the iPhone 8, you get a more natural true to life image with more accurate colors, whereas with the Galaxy S8 it looks great but it tends to cool things down a bit but overall it was just a sharper image. Now as far as the front facing cameras go that hands down goes to the Galaxy S8. I've always liked their wide angle lens. The iPhone has just never really felt wide enough. And as you can see as we stack them side by side, both do a really impressive job but I just prefer the look of the Galaxy S8 more. Now from there, one clear advantage the iPhone 8 has over the Galaxy S8 is when it comes to video. The iPhone 8 will shoot up to 4K at 60 frames per second. That's something the Galaxy S8 does not do. So for reference here's an example of both at 4K 30. So we're here on the iPhone 8 testing out 4K 30FPS video. Also gonna get a little test out to the stabilization. We're gonna walk around, give it a little back and forth. Rich with the crispy shirt. Looking good with the tricolors. Ralphy holding down the camera. And now let's hop over to the Galaxy S8. Holy crop factor, we're here on the Galaxy S8. Moving around again, test out the stabilization. Video quality looks good, I'm curious to see how it reacts a little bit, moving in, grabbing focus. That's pretty quick. Tricolors one more time. It looks crisp here, not gonna lie. Back to Ralphy, and lemme know which you think looks better with a comment down below. The other big deal with the iPhone 8 is 1080P 240FPS slow motion video which is crazy. Here's a quick example of the 240FPS slow motion video on the iPhone 8. Again, this is not something the Galaxy S8 even does so I can't truly compare apples to apples. To make it a little more even here's what 120FPS slow motion video looks like on the iPhone 8 and you can see it does a really amazing job. Clearly my rock juggling skills could use some improvement but as we hop over to the Galaxy S8, you can see in terms of clarity and just overall quality it is miles better on the iPhone 8. Now ultimately it really comes down to preference and ecosystem. Both of these are fantastic high quality phones. The Galaxy S8 is far superior in terms of design, hardware, the display. And while the iPhone 8 may not look the most impressive on the outside, it is packing some serious power and impressive features inside. With the Galaxy S8 and more specifically Android you're clearly getting more customization, more freedom, more flexibility whereas with the iPhone 8 and more specifically iOS11, yes it can be limiting but in terms of the eco-system the App Store it is second to none. For me, both these are fantastic phones, and again it is a great time to be alive in terms of technology. Hopefully this video kinda showcase what is cool about each of these phones and helped you with your choice. Aside from that, thank you guys very much for watching. If you missed it I just dropped a brand new iPhone 8 Plus versus 8 unboxing and comparison. You can check that out here or check out the link below. This is Jonathan and I will catch you guys later. (upbeat music)",
    "transcript_keywords": [
        "Galaxy",
        "iPhone",
        "Walking Dead",
        "doubt Samsung Galaxy",
        "Samsung Galaxy",
        "side",
        "terms",
        "display",
        "impressive",
        "Samsung",
        "game",
        "phones",
        "video",
        "Walking",
        "Dead",
        "Android",
        "brand",
        "fantastic",
        "job",
        "Store"
    ],
    "transcript_entity_values": [
        "two",
        "The Galaxy S8",
        "2017",
        "13 inch",
        "the Galaxy S8",
        "iPhone",
        "days",
        "4.7 inch",
        "Galaxy",
        "iPhone 8 Plus",
        "USB C",
        "the App Store",
        "the Galaxy S8",
        "the Play Store",
        "4",
        "The Galaxy S8",
        "the years",
        "1080P",
        "S8",
        "Lucille",
        "Apple",
        "The Walking Dead",
        "the Galaxy S8",
        "Survival Mode",
        "Galaxy S8",
        "12MP",
        "Council Level 18",
        "Distance",
        "iPhone X",
        "six",
        "the App Store",
        "Ralphy",
        "September 30th",
        "5.8 inch",
        "second",
        "Walking Dead",
        "Galaxy S8",
        "Qi",
        "A11 Bionic",
        "weekly",
        "First",
        "one",
        "Quick Charge",
        "20,000",
        "eight",
        "The Walking Dead:",
        "MacBook Pro",
        "Samsung",
        "Rick",
        "100,000",
        "8",
        "Anker",
        "Megan",
        "60",
        "Android",
        "nearly $100",
        "A11",
        "Daryl",
        "MicroSD",
        "Glenn",
        "Morgan",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "FAC",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "LOC",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}