{
    "id": "-IusirEOOh4",
    "title": "Why GPUs Are More EXPENSIVE",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-02-01T19:03:31Z",
    "video_url": "https://www.youtube.com/watch?v=-IusirEOOh4",
    "category": "Science & Technology",
    "tags": [
        "tariffs",
        "gpu",
        "graphics card",
        "nvidia",
        "amd",
        "cpu",
        "trump",
        "biden",
        "china",
        "export",
        "wto",
        "electronics",
        "cost",
        "price",
        "expensive",
        "currency",
        "exchange rate",
        "subsidy"
    ],
    "views": 440996,
    "likes": 25645,
    "comments_count": 2283,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   Learn about the role tariffs play in electronics prices.  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Even if you're one of the lucky few who's nabbed a new graphics card lately without forking over a $500 premium to a scalper, you might still end up paying more than you'd expect to due to the tariffs in the US on goods imported from China. And it keeps you forgot from your high school social studies class, a tariff is a tax that a country charges on imported goods. But why is the US government trying to Jack up the price on your already expensive graphics card? I don't have time to water my money tree during a pandemic. So you might already know that a huge proportion of consumer electronics, including graphics cards and motherboards are made in China. And we covered some of the reasons for that in this episode. But another reason that's the focus of today's video is one that has drawn some raised eyebrows from the international community. It's been well documented that the Chinese government has been subsidizing many of its own industries for a long time now. And this applies to everything, from electronics to steel to wood products. This means the Chinese companies can afford to sell their goods at a lower cost on international markets and undercut foreign competitors. But hold on a second, why is this bad? Plenty of countries subsidize their own industries in order to help them along such as the U S has long history of subsidizing its own farmers. So why have Chinese subsidies been controversial? The answer is that unlike other subsidies which are considered okay under international trade agreements, China's subsidies are targeted specifically at goods for export with these supposed intention of creating an uneven playing field. Additionally, China has been accused of consistently undervaluing its own currency which further gives them a leg up in the world market. And I'm not talking about the pop-up at the Community Center with those delicious European pastries. I want one right now. For example, if China makes their currency worth only 15 US cents instead of 20 cents, Chinese exports enter the international market priced much more cheaply once it's time for a foreign buyer to convert local currency and purchase a pallet of capacitors or whatever it is. Other countries have argued that artificial subsidies and currency adjustments like these violate conditions that China has agreed to as a member of the World Trade Organization. So some of these countries have retaliated by hitting Chinese goods with punitive tariffs several times over the years in hopes of weakening China's position by making their goods more expensive and sending a message that's subsidizing exports and messing with the value of their own currency isn't a fair way to do business. And although most economists agree that tariffs are generally a bad idea since they restrict free trade and hamper economic growth, a number of countries have used them in order to change China's behavior including the US. As contentious as American politics are these days, imposing tariffs on Chinese goods has actually found bipartisan support in recent years. So let's bring this back to graphics cards. In late 2019, the Trump administration specifically exempted a number of computer components, including graphics cards from existing tariffs after companies asked the government to throw them a fricking bone here, which makes sense. It's hard to get your hands on electronics that aren't at least partly made in China. But this exemption had a time limit on it. And now it's expired. Meaning the major graphics card manufacturers have been super nice and absorb the cost. Yeah, just kidding. They've passed along that cost to the hapless customers with MSRP is going up by anywhere from around 50 bucks to a few hundred dollars depending on exactly which card you want. Motherboards have seen price increases of their own as well and even other PC components like cases, power supplies and mice could be affected. Now at the time we wrote this video, it's not totally clear how the incoming Biden administration will handle these tariffs, but it looks like there may not be any swift action taken on the situation. As the trade dispute with China is still an important issue to both major political parties. So we may have to live with the price increases for some time. Unfortunately for our American viewers, you might be getting a little taste of how expensive GPUs tend to be in the rest of the world. Looking at you Australia. Are they super expensive there? They're more expensive than shrimp on the barbie. Speaking of delicious shrimp on the barbie, our sponsor is also delicious to your finances. FreshBooks, they're an easy to use accounting software designed specifically with you in mind, the small business owner. FreshBooks has everything you need to manage your books, invoices, expenses, time tracking and more. It's designed to be easy to use with built-in automation. So you spend less time invoicing, expensing and tracking projects, and more time doing what matters most, growing your business baby. Whether you're a trades person, creative agency or a YouTuber, you can choose a plan that's right for you. We have an award winning Toronto based support team. We're always happy to help if you need it. They're very nice people. Try FreshBooks free for 30 days today. No credit card required at freshbooks.com/techquickie. Well, I don't know what to say now. I guess I'll go ahead and say thanks for watching. Like the video if you liked it, disliked it if you disliked it. Check out our other videos and comment below with video suggestions. And don't forget to subscribe and follow. That sounds like a good thing to say.",
    "transcript_keywords": [
        "China",
        "Chinese",
        "time",
        "end up paying",
        "expect to due",
        "Chinese goods",
        "goods",
        "graphics card",
        "graphics",
        "tariffs",
        "card",
        "including graphics cards",
        "currency",
        "expensive",
        "trade",
        "goods imported",
        "imported goods",
        "international",
        "subsidies",
        "countries"
    ],
    "transcript_entity_values": [
        "500",
        "30 days",
        "US",
        "the U S",
        "Jack",
        "second",
        "American",
        "the Community Center",
        "FreshBooks",
        "Biden",
        "only 15 US cents",
        "recent years",
        "China",
        "European",
        "late 2019",
        "around 50 bucks",
        "a few hundred dollars",
        "Toronto",
        "Chinese",
        "these days",
        "the World Trade Organization",
        "Australia",
        "the years",
        "20 cents",
        "Trump",
        "MSRP",
        "YouTuber",
        "today"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "GPE",
        "GPE",
        "PERSON",
        "ORDINAL",
        "NORP",
        "FAC",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "GPE",
        "NORP",
        "DATE",
        "MONEY",
        "MONEY",
        "GPE",
        "NORP",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "NORP",
        "DATE"
    ]
}