{
    "id": "-kOS1HLLET0",
    "title": "Apple Is So Far Behind - Lightning Connector",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-11-13T18:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=-kOS1HLLET0",
    "category": "Science & Technology",
    "tags": [],
    "views": 780634,
    "likes": 41520,
    "comments_count": 2378,
    "description": "Visit  for a free trial!  Why has Apple stuck with the dated Lightning connector instead of switching to USB-C?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Back in 2012, Apple released the iPhone 5 which was a big deal, not just for giving us more screen real estate than previous models, but also for introducing the Lightning Connector. And while it was a welcome change from the previous big fat 30 pin cable, we're still stuck with it eight years later. And it hasn't exactly aged well. Of course there is that old saying, \"If it ain't broke, don't fix it.\" But the lightning connector has the obvious problem that the rest of the phone world has moved on to USB type C, which is faster and more versatile. So why is Apple stubbornly holding on to such an old connector other than, you know keeping a proprietary standard around to make more money? It might surprise you to know that Apple is actually part of the USB implementers forum, the original group of companies that worked on USB type C. However, Apple really wanted to go ahead and start getting thinner sleeker devices to market, and given their timetable for the iPhone 5, they didn't want to wait around for the USBC standard to get finalized. So they slapped their own miniaturized port on to the phone instead. And given that USB-C didn't start appearing in smartphones until 2015, that initial decision does look like it made some sense. Open standards in the tech industry take a notoriously long time to get approved and make their way onto gadgets. And even the lengthy approval process does not mean that they will end up working perfectly. In fact, the public release of USB-C didn't go very well, with lots of poor quality cables and accessories hitting the market. This meant Apple was quite happy to stick with their proprietary connector which gave them much more control over what consumers were actually getting. Apple either produces lightening devices itself, or licenses out the spec to third parties of its own choosing. And while that approach drives up costs, it admittedly does make quality control a bit easier. But Apple had another reason not to make the switch to USB-C. It already caught a lot of heat for switching to lightening in the first place. Do you know how many Apple accessories you see in your average big box store that used lightning connectors? Well, back in 2012, there were tons of similar accessories that use the 30 pin dock, and switching to lightening rendered all those older accessories obsolete as they would only work with iPhone models that were quickly becoming outdated. I mean, the 4S, didn't even have LTE. (snaps finger) So, Apple didn't really want to alienate it's consumers yet again by pulling the rug out from an even larger accessories install base. And in fact, the company has directly said this more recently in statements regarding the European Union's push to get standard connectors on most wireless consumer electronics. Apple would also face logistical issues in switching it's supply chain over to USB-C when it's been set up for so long to crank out lightening products on mass. And although it's definitely inconvenient that iPhones don't use USB-C, they also don't really need to. It's true that lightning is a relatively slow connector as it's speed seems to be somewhere in between USB 2 and USB 3, but data transfer over a wired connection is quickly becoming less and less important for smartphones. Contrast this with the fact that Apple has put USB type C on Macs and iPads, which makes more sense since these are full fledged computers and need to be compatible with a wider universe of PC peripherals. And then you go, \"Oh yeah. Okay.\" So does this mean that we're gonn have the lightening connector for a long time to come? Well perhaps not, as plenty of rumors have been flying that Apple will come out with a portlets iPhone in the next few years. 'Cause there's no reason Apple couldn't do that now that they use wireless charging across their entire lineup. Of course that might still really mess up the iPhone accessory market but do I really need that circuit 2013 iHome alarm clock anyway? Check out FreshBooks. FreshBooks is the cloud accounting solution for business that allows you to work from anywhere with their mobile app, and create professional invoices in seconds when you're on the go. You can snap pictures of your receipts and track your mileage on the iOS app as you drive so you can maximize your deductions at tax time. You can never miss an update. So you can see when a client has viewed their invoice and when it's overdue. And right now you can get 50% off three months of FreshBooks when you sign up for a paid plan at freshbooks.com/techquickie. So thanks for watching guys. Like, dislike, check out our other videos, leave a comment with a video suggestion. And don't forget to subscribe because if you do, I'm going to replace all of our black shirts with purple ones like this. This is actually a sample we're working on of our own purple shirt.",
    "transcript_keywords": [
        "screen real estate",
        "Apple",
        "USB",
        "USBC",
        "USB type",
        "screen real",
        "real estate",
        "previous big fat",
        "Apple released",
        "big deal",
        "Connector",
        "previous big",
        "Lightning Connector",
        "big",
        "iPhone",
        "lightening",
        "Lightning",
        "accessories",
        "make",
        "estate than previous"
    ],
    "transcript_entity_values": [
        "USBC",
        "LTE",
        "the European Union's",
        "USB 3",
        "2013",
        "eight years later",
        "USB-C.",
        "USB",
        "iPhone",
        "between USB 2",
        "the Lightning Connector",
        "seconds",
        "FreshBooks",
        "2015",
        "4S",
        "third",
        "Macs",
        "first",
        "iPhones",
        "iPads",
        "30",
        "the next few years",
        "50%",
        "USB-C",
        "Apple",
        "three months",
        "2012"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "DATE"
    ]
}