{
    "id": "-loW72V3XyI",
    "title": "Google Pixel Buds Pro Unboxing",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-08-08T18:45:12Z",
    "video_url": "https://www.youtube.com/watch?v=-loW72V3XyI",
    "category": "Science & Technology",
    "tags": [
        "earbuds",
        "TWS",
        "airpods",
        "google",
        "pixel",
        "buds",
        "pro",
        "audio",
        "personal",
        "bluetooth",
        "wireless",
        "true",
        "sound",
        "unboxing",
        "impressions"
    ],
    "views": 565347,
    "likes": 20427,
    "comments_count": 886,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   James is a long-time pixel user and did a video on the original Pixel Buds for LTT, but do the newest Pixel Buds Pro earbuds show that Google's taking the TWS space seriously, or should you go with one of the MANY other options available?  Buy Google Pixel Buds Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 He's back! 0:10 Unboxing and who this is for 0:41 Design impressions 1:11 Size and case impressions 1:33 Instructions and setup 2:27 Settings 3:06 Trying on the earbuds and fit test 4:00 Earbud mic and driver features 4:33 Feel, ANC, and touch control impressions 5:50 Sponsor - SecretLab 6:19 Touch control testing 7:33 Music quality impressions 8:55 Pixel Buds Pro competition 9:17 Call quality impressions 10:30 Battery Life and water resistance rating 11:25 Other unique features 12:07 Recommendation  12:32 Trying to use Multipoint connection 14:26 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "https://geni.us/c6BNy",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(creator repeatedly clapping) - We're back in the saddle baby. That's right. James is back with another earbuds review. Been a while. Adam took my spot, bastard. Today, it's the Pixel Buds Pro. I'm a longtime Pixel user. I reviewed the Pixel Buds back, the first one, remember the neck buds that were connected by a stupid- - [Jamie] Oh, yeah. - String? Everyone hated them. Oh, yeah. To get them in your ear, you had that stupid adjustment too. Yeah, they weren't that great. They sounded better than the AirPods though. Now, we've got the new Buds Pros, with active noise canceling. So, this is a competitor to the Apple AirPods Pros, Galaxy Buds Pros, all the other Pros. And, of course, the Sony WFXM4s. Okay, here we go. It's a little egg shape, kind of Aperture Lab style case. The box, by the way, it's all paper. Even this is paper. You know, these kind of things used to be plastic. So, that's great. Less plastic. Oh, cool. I really like this, kind of, elemental design language. They just have pictures of stuff. Like you could find this 10,000 years in the future, in like a post language world. Oh God. It's weird that it opens on both sides and then they spill out two sizes on each side. It's very cool though. Thank you. Wow. These are small. The original Pixel Buds, they were big. They were almost twice the size of this. These are like the size of maybe an M&M? They're bigger than M&Ms, but I'm impressed. That's a Hall effect sensor magnetic lid, by the way. That's a pretty satisfying, good fidget toy. When you're on the bus, you're on the SkyTrain, just annoying everyone around you, but you can't even hear it. 'Cause you got your buds in, that's living. Okay, you got a small again, paper, pull tab here for the literature. Oh, it doesn't unfold. It's just literally a little book. They want you to have Android 6 or greater, especially for the Google Assistant stuff. The real time translation stuff. \"Open the earbuds case and keep the earbuds inside. Tap.\" Oh, there it is. \"Tap the Google Pixel Buds Pro pairing notification and follow the on screen instructions.\" Speaking of the color, by the way, this is \"Lemongrass.\" There are four colors, also \"Charcoal\", which is basically black, \"Fog\", which is basically blue and \"Coral\", which is coral. Your device is ready to be set up. Let's set it up. What's going on? It's gone. Google Pixel Buds Pro connected. It's a hundred percent battery. And that's right on my home screen. Is that a Pixel only thing? And what happens if I click it? If I go back to the home screen, it's gone now. So, it was kind of like a toast. It was just there. So, I could easily access the menu and it shows battery for right and left. And, usually, with this kind of product, if you hit settings, rather than having a dedicated app, oh, \"Pixel Buds keep stopping.\" (James laughing) Usually for this kind of product, instead of having a dedicated app, they'll just have the settings right in the Bluetooth menu. Which is pretty cool, but it is gonna be a bit limiting. We can see which codecs this thing supports right now. It's AAC. You're not gonna get LDAC. That's a Sony proprietary one. AAC is fine. Pretty much all truly wireless headphones, these days have Google Assistant. Usually, you hold the button and it goes, ba-dink, this though, will let you hail the Assistant just for their voice, completely hands-free. That's useful, if you're riding your bike or something. I'll agree to voice match. It's useful. My kids can't hail it. Find the best fit. Okay. We're going through, this is a whole new rabbit hole. Oh, damn. It's playing some cool music. It's telling me to say still. Yes. They confirm that the seal's good. Excellent. Oh, cool, if you actually enable location services, you can use that to find the earbuds. Not only can you switch the hold action from Google Assistant to active noise canceling, but you can specify which ear that happens on. So, that's good. I'm gonna put Assistant on the right and noise canceling on the left. Hey Google. What's the weather like outside? 26. That's nice. All right, let's go full circle and go back to those ear tips. It's always medium that we have. They're smaller than this, but these don't look that large for the large ones. Man, these are small. That's crazy small. I'm gonna keep the mediums on and they're probably gonna give me a good enough seal 'cause my ears aren't huge. Can you imagine having a normal proportion face with gaping ear holes? They have three microphones. You can also see that there are wind filters over top of these mics. These three mics are beamforming. They also have voice acceleration. I'm not sure exactly what that feature means, but I do know that they use bone conduction to help know what noise is your voice and what noise is noise. Cut through the signal and noise. I believe they have like 11 millimeter dynamic drivers. There you go. There they are. And then you can actually see, if I tilt it this way, I believe that is the IR sensor for proximity, so that they pause when you take them out. All right, I'm gonna do my classic insert and twist. And they really just sit right in the pinna. They feel pretty flush to my head. Not completely. I can still feel them there, but not bad. I think the transparency mode's on right now. Hello? Yeah, it was. They have a feature where, if you pull one out, it automatically puts the other in transparency mode, which is pretty cool. It's a signal to the people around you that you're listening to them. And, it's probably faster than being like, \"Hold on.\" Hold it down. Transparency mode. The transparency mode on these is super subtle though. It's not over amplifying my voice and it's not making the HVAC super noticeable. Now that I put it back in, I think the ANC is completely on. I can't hear the HVAC at all. Isolation and seal is, I think it's pretty good. What'd you say? Is my phone making noise? It is! (Jake laughing) For the controls, the interface, which is something that I'm very particular about. I like what they've done. They've done what I would call \"the standard.\" You've got one tap for play. One for pause, double for next, triple for back, hold for Google Assistant. Unless you're using hands-free. And that leaves volume control. Because they're fully capacitative, you just swipe to step up the volume. I'm gonna try the interface out, once I get some music playing, but I'm gonna do that after this message from our sponsor. Thanks to Secretlab for sponsoring this video. Secretlab chairs are designed to keep you comfortable for those long nights of work and play. Their Titan Evo 2022 series chair offers 4-way lumbar support, magnetic memory foam head pillow and is offered in different upholsterers, like Hybrid Leatherette, SoftWeave fabric and NAPA leather. Best of all, they've got a 5 year extended warranty and a 49 day return policy. So, you're covered if anything is wrong. So, head to the link in the description and check out Secretlab today. Let's play some tunes. All right, I'm not gonna evaluate with this music right now. I'm just gonna try this out. Okay. One shot. Sure shot, it actually paused. Here's what the delay is like, bunk bunk. So, small delay, but that's basically what you get with these devices. Now I'm gonna try next. It looked like a triple tap, but that was actually the first one was a miss. 1, 2, 3. The little tone that it plays, when you do a double tap, it goes, di di, and a triple, di di di. So, that's nice. I got transparency mode on right now. (Jake's fingers snapping) So, I'm holding down the right. (Jake's fingers snapping) Yeah, I'm just toggling transparency and ANC, I think. Di di di. Yeah. Okay. So, both ears are doing the same thing. This music's pretty damn good though. I gotta say that. Let's try the swiping, 'cause sometimes with a swipe, it'll register as a tap. That worked. That worked and both those swipes, I just did, they connected with different parts of the earbud. The first one hit the back. The next one just kind of barely hit the front. Yeah, this is working really well, actually. In fact, I might go as far as to say, this is the the best capacitive kind of swiping action I've seen on an earphone. 'Cause usually you really gotta make sure you hit the right spot and everything. Okay. That one paused it. I'm getting a little cavalier at the taps though. You gotta be a little bit careful, but it's pretty good. Let's react to the music. All right, I gotta put on some tunes that I know. Yeah, I'll say the bass is pretty low. I listen to this song on a lot of different systems and the bass is definitely very like, baroom boom, like nice and low on this track. That's awesome. Now one thing they advertise is that they've got this kind of dynamic EQ where basically, because your ear is more sensitive to mids and highs, bass doesn't sound loud unless you turn it up pretty loud. And so, what can happen is you lose the bass, you lose the perception of the bass, as you turn it down. So what these do is boost the bass as you turn the volume down so that your perception of the bass is steady. I'd say it works. I'm at like 90%. This is probably as loud as I would put it at a gym or something, if I'm competing with the radio. Ah! Sorry. I just had to take one for the team and withstand that noisy volume just to see how harsh it gets, when it's really loud. That sounded pretty okay. Let's test it with some electric guitar. One of my favorite albums ever. And this is the type of music that is kind of supposed to be grading. So, it'll sound really grading and bad, if you don't have a good system. I do find myself turning up the volume a little higher than I might on another set of earphones. Like, this is pretty close to max, like a lot of other earphones, I only ever have to go like halfway, where right now, I'm at 75 or 80%. So, if you're one of those deaf people who blasts it, maybe these aren't for you. How about some Slash? These are awesome. I think they sound great for the $200 price point. I have seen some reports online that the Sony XM4s sound a bit better, but those also cost more. These are 200 bucks. The Sony are 280. The AirPods Pros are 250. The thing that they're really competing against is the Galaxy Buds Pros, which are also MSRP at $200, but can be got for 180 or even around 150 on Amazon right now. So, they're sitting pretty. This is a pretty compelling product, I would think. I want to test the calls though. So, can we set up the fan please? Is this meant to look like a giant Noctua fan? - [Jamie] It is. - Did we paint this? - [Jamie] Yeah, it's for the all Noctua build. (Jake laughing) - That's awesome. This is gonna test both noise and wind. (fan loudly humming) This has gotta be ANC. I actually do hear a bit of a hiss over here, but. Let's give a Jake Smellavance a call and see if he has any comments about this. You sound a little congested. Yeah. How's the sound? I'm calling you with the Google Pixel Buds Pros. He says it sounds like I'm calling from a phone-phone. Okay. How's it sound now? Do I still sound clear? Yeah, I'm pointing my ear right at this fan right now, it's blowing right at me. Nothing at all. Thanks buddy. He said that once I turned the fan on, it sounded like I was outside, that there was some kind of ambient noise, but he couldn't really put his finger on that it was wind. He said, I sounded totally clear except for when I stopped talking, there might be a little artifact there. I guess the noise suppression algorithms are, they're tweaking, right? Like they're cutting out everything when you're not talking. Then when you are talking. They're letting that in. And so, it has to just kind of switch between those two states and I guess there's a little artifact on the transition. But yeah, he said he thought I was just on an actual phone, not using headphones. That's great. Battery life, you get seven hours on the buds themselves, with ANC on, or 11 hours with off. And including the case, it is. And including the case, it's 31 hours with ANC off and 20 with it on. You can charge by USBC or wireless charging and a five minute charge into the case will give you an hour of playback. And then, for the water proof rating, the earbuds themselves are IPX4, which is pretty standard in this category of product. That'll keep you protected from splashes from any direction, sweat, if you're using it at the gym, you will be fine. The case though, is IPX2 rated. So, that test is actually just 10 minutes of dripping water coming at an angle that is at 15 or less degrees. And I think they do like four different orientations. So, it's not nothing, but they're not waterproof. Don't wear these in the sh, don't bring your case in the shower, don't open it up. Don't fall in the lake. One other thing, I'm not totally clear on how this works, but they advertise their active noise canceling as being called \"with Silent Seal.\" A lot of people get fixated on the frequency response curves, but having a good seal is gonna do a lot more to, I think good base, than the curve being plus or minus five decibels or something like that. Now, they have the \"Silent Seal\" thing. I don't exactly know what that means, but I do know that they have another feature that they advertise as sensing the pressure that's in your ears and relieving that, based on how it all the environment changes. So, I'm not sure if that is a subset of \"Silent Seal\", if that's what makes \"Silent Seal\" work. And I can't really tell the difference when I'm switching between ANC and transparency modes, I don't have like a popping or pressure in the ears. So, I think as advertised, as far as that goes. So, Pixel Buds Pro then, I think I would recommend them. Although caveat, I didn't show you any EQ tuning in the app or on the phone. And that's because it doesn't exist yet. They say it's coming this fall. It'll be a five band tuner. Don't buy stuff hoping for features to come down the line. Wait until the features you want are actually supported and then buy stuff. Otherwise, you'll be buying a TV and waiting for the VRR for a year and a half. 'Cause that seems to be how it goes. Ah, before we close this up, there's one other main feature that I wanna test, which is the multi-point connectivity. I'm supposed to be able to be using these on my phone. And then when I switch to my laptop for a call, it'll automatically switch over, as long as I've previously connected the Bluetooth on that. So, I want to know how that works, because it sounds like it could be annoying. So, let's check it out. So now that I'm pairing with not a Pixel, I actually have to use this pairing button on the case. Hold that for three seconds to let it be seen and you can see now the button has, the light has started blinking. All right. So, I got \"Crab Rave\" going. I'm going. I can hear it. I'm gonna pause it. I'm gonna close my laptop. I'm gonna grab my phone and start playing some music from here. It's coming outta the phone, obviously. Okay. It's on my phone. That's cool. The music is playing on my phone right now. Go back to the laptop. I couldn't hear this playing, which is good, but I don't see how this multi point was supposed to work, 'cause it just didn't at all. \"Tap to open Pixel Buds app\", nothing opens. Ah! Okay, I'm gonna try one last thing with this multi point thing. I'm gonna open my computer. I'm gonna start a call on it and we'll see if it switches. I'm assuming this is ringing right now, but I still am only hearing music, so. - [Jake] Hello? - Yeah. It says the Google Pixel Buds are connected to this laptop. I can still only hear the music. What if I pause the music? Hello, Jake? - [Jake] Hello. - These things suck! (Jake laughing) All right. - [Jake] Oh no. - Wow. The isolation's like surprisingly good in this. \"Your earbuds updated.\" \"Your case will update when you store your earbuds in the charging case for about 10 minutes.\" That's kind of cool. The earbuds like pass the update onto the case. But that's the Google Pixel Buds Pro. I think they're pretty cool. I think they're worth the money, but they obviously have some bugs to work out, or maybe I'm just dumb. I don't really care about this multi point feature anyway, but it'd be nice if it did all the things it claims to do. Thanks for watching ShortCircuit guys, if you liked this video, watch some of our other earphone reviews. Sometimes with me, sometimes with Linus, sometimes with Adam. (case lid smacking) Bye.",
    "transcript_keywords": [
        "Pixel Buds Pro",
        "Google Pixel Buds",
        "Pixel Buds",
        "Buds Pro",
        "Google Pixel",
        "Buds",
        "Buds Pros",
        "Galaxy Buds Pros",
        "Pixel",
        "Pixel Buds back",
        "Google Assistant",
        "open Pixel Buds",
        "pretty",
        "Google",
        "Pixel Buds app",
        "yeah",
        "kind",
        "Pros",
        "Buds Pro connected",
        "noise"
    ],
    "transcript_entity_values": [
        "15 or less degrees",
        "Pixel Buds",
        "an hour",
        "4",
        "Buds Pros",
        "di di di",
        "Google",
        "Amazon",
        "this 10,000 years",
        "11 hours",
        "180",
        "around 150",
        "Linus",
        "the Sony WFXM4s",
        "31 hours",
        "today",
        "IR",
        "6",
        "the Google Pixel Buds Pro",
        "11 millimeter",
        "the Galaxy Buds Pros",
        "280",
        "ANC",
        "Today",
        "NAPA",
        "75 or 80%",
        "max",
        "AAC",
        "Fog",
        "Bluetooth",
        "first",
        "Sony",
        "two",
        "Pros",
        "200",
        "Coral",
        "a hundred percent",
        "Aperture",
        "250",
        "HVAC",
        "IPX4",
        "minus five decibels",
        "about 10 minutes",
        "Crab Rave",
        "SkyTrain",
        "Di di di",
        "Jake",
        "Adam",
        "one",
        "5 year",
        "Pixel Buds",
        "three seconds",
        "the Pixel Buds Pro",
        "26",
        "VRR",
        "these days",
        "five minute",
        "Pixel Buds",
        "SoftWeave",
        "Pixel",
        "the Google Pixel Buds Pros",
        "LDAC",
        "Hybrid Leatherette",
        "ShortCircuit",
        "Secretlab",
        "five",
        "Lemongrass",
        "USBC",
        "3",
        "AirPods",
        "seven hours",
        "49 day",
        "2",
        "Charcoal",
        "Tap the Google Pixel Buds Pro",
        "three",
        "One",
        "a year and a half",
        "di di",
        "Noctua",
        "1",
        "90%",
        "four",
        "EQ",
        "Slash",
        "200 bucks",
        "a Jake Smellavance",
        "just 10 minutes",
        "James",
        "20",
        "the Apple AirPods Pros"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG"
    ]
}