{
    "id": "-ofQV33q0Bo",
    "title": "I Bought A $39 Laptop From Amazon...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-08-14T15:59:01Z",
    "video_url": "https://www.youtube.com/watch?v=-ofQV33q0Bo",
    "category": "Science & Technology",
    "tags": [
        "laptop",
        "notebook",
        "cheap laptop",
        "laptop unboxing",
        "laptop review",
        "budget",
        "2017",
        "laptop 2017",
        "amazon",
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "gaming",
        "dell",
        "computer",
        "cool gadgets",
        "iphone",
        "apple",
        "best",
        "video",
        "products",
        "new gadgets",
        "new inventions",
        "cool technology",
        "cool gadget",
        "amazing",
        "cool",
        "iphone 7",
        "iphone 8",
        "iphone 7 plus",
        "awesome",
        "android",
        "vs",
        "invention",
        "apple iphone",
        "new iphone",
        "7 plus",
        "samsung",
        "galaxy s8",
        "s8",
        "cool tech"
    ],
    "views": 8772566,
    "likes": 130010,
    "comments_count": 9546,
    "description": "The Coolest Phone You've Never Heard Of...   Craig Wireless Netbook (USA Link) -  Craig Wireless Netbook (International) -   I had hopes that this $39 laptop may exceed expectations (considering the price point). Turns out I received a lemon. Several keys on the keyboard did not function eliminating my opportunity to properly test it. The entire user interface was bizarre and the entire experience was reminiscent of a previous technology era (rightfully so, the manufacture date on this laptop is 2012). I would steer clear of this laptop even at $39 on Amazon.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/MjSeHQpEoTA?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2vBJko1",
        "http://geni.us/YOsN",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So recently I showed you guys a new laptop From razer the blade stealth a laptop that anybody would be happy to own today That might not be the case today. I'm going to show you a laptop. That's 39 dollars on Amazon $39 now, they're not really calling it a laptop They're calling it a netbook you might not even remember the term netbook netbooks were all the rage once upon a time I don't even know how many years ago. They weren't very powerful most of them had intel atom processors What a bizarre, era intact, here's the thing this is like some next-level netbook in the sense that it's only $39 and it runs Android this is on Amazon you can buy this right now So the question is what do you get for $40 and most importantly does it suck? It's got wi-Fi a browser a camera email ebook reader map music apps I'm guessing that front-facing cameras. Well, it's probably not pixel dense. We'll find out Flip it open it is kind of impressive for $39. I guess it has Youtube that'll be interesting HdmI port an RJ45 Jack and a Dc. End wow I'm excited Android 4.0 0.3 megapixel Front-facing camera alright four gigs of Built-in flash memory one gig of ram the HDMI out Jack is capable of 1080p Okay, a couple of usb ports and a mini usb port for charging oh Oh Jack Charger Ring buttom Stereo speakers Sd. Card slot it's got a headphone Jack the ice cream sandwich Android up there you see that that always man. I haven't had an ice cream sandwich in a while. Maybe I'll pick one up today bedtime reading There it is, okay feels pretty Sturdy Tiny little power Brick so the Power Brick just has a Female Usb port and then goes into here a mini usB To charge this up what can you get for 35 bucks the days Jack not much? But you get this, ooh Smooth here on the Back HDMI Ethernet 2 usbs on this side of the unit and then the other side packs in your sd card slot headphone Jack and a microphone Port as well look at all the connectivity on this thing for 39 bucks. Look at the manufacturer date july of 2012 the moment of truth It's kind of cute. I don't know maybe for a kid or something the trackpad is tiny an Anti-reflective screen might I add now this is a tiny little keyboard could you get used to that? Maybe if you have tiny little hands alright, so I've got it. Boot it up now. I'm at a familiar Android screen here from from back in the day as you could tell it's like if an Android phone was a laptop I have it hooked up to a display here. It is kind of odd though. Oh here. Okay here we go there we go now since the screen is not touched navigating without the mouse you use the directional buttons here Now they're a little are they lagging or is that just me what's going on here Up and down works and left works right is not working I Believe the right directional arrow is not working hmM and tight test Yes, the right Okay, I can't say I'm surprised Listen I'm not Gonna let that hold me back All right, if you're going for the 39 dollar laptop chances are you're ready to deal with some issues You're gonna be mad let's be on you may had 39 bucks. You're gonna be mad anyhow it's not gonna hold us back from our evaluation here because Well, or it will because I can't get over to the apps Beyond this area can obviously use my mouse widgets apps That's a disappointment. Let's try the camera slightly overexposed Holy Point 3 megapixels here we come 2012 back yeah, that's special you see that Jack don't you just want to put a picture like that on Twitter? You just can't wait who even knows where that's safe to is it. It's not much storage on here Let's go ahead and open a browser. It looks like we can open a browser least look at that We're browsing the web since we can't navigate to the Youtube app We're Gonna go to the website first you Gotta Spell Youtube correctly oh The B the B is not working either Jack good b oh Man, I can't even sight youtube I feel like if I just google Youtube spelt incorrectly I'm in survival mode here look at that see There it is loads up the mobile Youtube very very slowly unbox. Oh man, what's going on yet on no end no and Who needs a min? Okay, hang on a second you therapy Yes Okay, we got a fresh video here. Let's see if it plays Can we explain it's gonna play in Hq year man? I really feel like I'm in some other error right now This is not playing either Yeah, what oh I just took a screenshot. That's good I can't recommend this to anyone the date on the pictures folder is 1999 I mean I just got to say it. How did it? I just got to tell the people what's happening another option is we could have Requested the desktop website you might get a $40 heart attack here getting all fired up imagine you thought this was gonna be useful Imagine this was just another day in the office. Oh, it. Did it launched the mobile version anyway, okay? We have a thumbnail that's us. No, we're back here now. It's killing me I mean what am I what am I trying to do right now like I just gotta tell the people. What's happening I don't even think I need to Tell you much of a story here because it should be fairly obvious at this point that this is This is probably just gonna drive. You crazy you may become very frustrated Got you might regret at a later date This is one of the rare occasions where I really thought it might actually be decent for what it is But I can safely say avoid this thing avoid it at all costs steer clear Treat it like the plague. Oh, and yeah of course. It sucks. If you needed to hear it in those terms",
    "transcript_keywords": [
        "Jack",
        "laptop",
        "recently I showed",
        "showed you guys",
        "razer the blade",
        "blade stealth",
        "Jack Charger Ring",
        "Youtube",
        "Android",
        "stealth a laptop",
        "Back",
        "headphone Jack",
        "usb port",
        "Female Usb port",
        "Back HDMI Ethernet",
        "Jack Charger",
        "usb",
        "port",
        "term netbook netbooks",
        "power Brick"
    ],
    "transcript_entity_values": [
        "Twitter",
        "Holy Point",
        "intel",
        "35 bucks",
        "the day",
        "Sturdy Tiny",
        "only $39",
        "today",
        "the Back HDMI Ethernet 2",
        "first",
        "Youtube",
        "1999",
        "HDMI",
        "Jack",
        "Android",
        "second",
        "four",
        "RJ45 Jack",
        "39",
        "39 bucks",
        "Youtube",
        "2012",
        "Dc",
        "many years ago",
        "Hq year",
        "Amazon",
        "wi-Fi",
        "usb ports",
        "Port",
        "39 dollar",
        "39 dollars",
        "Jack Charger Ring",
        "Female Usb",
        "Flip",
        "the Power Brick",
        "one",
        "40"
    ],
    "transcript_entity_types": [
        "ORG",
        "FAC",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "CARDINAL",
        "MONEY"
    ]
}