{
    "id": "-PhszmKX7mI",
    "title": "DJI Mavic Air 2S review: new sensor makes all the difference",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-04-15T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=-PhszmKX7mI",
    "category": "Science & Technology",
    "tags": [
        "dji",
        "dji fpv drone",
        "dji drones",
        "dji fpv",
        "dji mavic air 2s",
        "dji mavic air 2s release date",
        "dji air 2s",
        "dji mavic air 2s price",
        "dji pro 3",
        "drone",
        "phantom 3",
        "dji fpv case",
        "dji fpv drone price",
        "dji fpv combo",
        "dji fpv googles v2",
        "dji om 4",
        "dij om4",
        "dij rs2",
        "dij mavic air 2 app",
        "flex 2.0 drone",
        "drone review",
        "fpv drone racing",
        "fpv drones",
        "drone footage",
        "drone test",
        "drone crash",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 336885,
    "likes": 4266,
    "comments_count": 327,
    "description": "Despite being less than a year old, DJI is updating its popular Mavic Air 2 drone and is releasing the Mavic Air 2S. A drone with a new 1-inch sensor capable of shooting 5.4K video and 4K video up to 60FPS.   Read more:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3uRYpPz",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - It hasn't even been a full year since the Mavic Air 2 was released but DJI decided it's time for an upgrade. Today, it is introducing a $999 Mavic Air 2S, a rare mid-cycle refresh that brings some notable new features to an already good drone. And the biggest upgrade isn't the camera. The Air 2S's camera now has a one-inch sensor compared to the half-an-inch sensor that was found in its predecessor. And it is capable of filming 4k footage at 60 frames per second. And that sounds great on paper but there are a lot more caveats than I anticipated. So let's go through them. (upbeat music) So when the original Mavic Air was introduced back in 2018, it had a tiny sensor capable of shooting 12-megapixel photos, mediocre dynamic range and passable 4K video. And now, this Mavic Air 2S has the same size sensor as their flagship Mavic, the Mavic 2 Pro. Shoots equally good photos and it's actually better at video in some aspects but better at least on paper. So here's what I mean by that. Okay. First things first, the maximum video resolution is 5.4K compared to the 4k on the Mavic 2 Pro. Awesome. And the Air 2S's 4k video actually has a higher bit rate than the Mavic 2 Pro. Check. And the Air 2S's 4k video can actually shoot at a higher frame rate, too. Amazing. So if you prioritize frames over resolution, you'll be stoked to hear that it can shoot 4k at 60 frames per second with that one-inch sensor. Except, don't get too stoked just yet. Because once you do switch to 4k-60, there will be some cropping there. Meaning, this drone actually isn't using its full one-inch sensor in that mode. The video still looks fantastic but the crop in this mode is the sort of thing you will not see on the spec sheet. So be aware of that. That also might explain why this drone actually has a wider focal length than the other Mavics in the lineup. When using the full, one-inch sensor, the focal length is 22 millimeters. Usually, DJI drones are either 24 or 28. I personally liked the slightly wider look. But if you prefer tighter composition you can use the built-in digital zoom or crop at the edit. So when it comes to zoom, there's some numbers to go through. 1080P-60 let's you zoom in 6 times. 1080P-30 let's zoom in eight times. 4k-60 up to three times. 4k-30 up to four times. And lastly, there is no digital zoom available when you're in 5.3K. Understandable. However, here's where we get to another caveat. None of these matters if you're filming in D-Log or HDR because you actually can use the digital zoom while shooting in any of those profiles unless you're using the standard color profile. Also, you can use digital zoom at all while taking photos. I'm not really sure why that's the case. I can easily see that changing in the future. But as of right now, it is not enabled. Oh, there's also one more caveat between the color profiles. The maximum ISO in the D-Log color profile is 1,600 compared to 3,200 in the standard color profile. Again, not a deal breaker. Usually, footage at that high ISO doesn't look fantastic but something you should be aware of, too. So one big selling point of the Air 2 was the ability to shoot 48-megapixel photos through pixel binning and all sorts of stuff. You will not find that option here but I'd always choose sensor size over just pure resolution numbers. And I think the Mavic Air 2S proved me right here. The photos look phenomenal. Having a one-inch sensor in a smaller body than a Mavic 2 Pro is kind of a dream come true for me. But cameras take 20-megapixel photos. But there are also a few noticeable differences between them. First, there's the focal length that I mentioned earlier, but there's also the dynamic range which is better on the Mavic 2 Pro. 14 stops with dynamic range compared to 12.4 on the new Air 2S. So, yeah. You lose a little bit of information to work with. But in practicality, the difference is not that super noticeable. Photos look compressed at both low and higher ISOs. However, there is one more feature that makes the Mavic 2 Pro better at photos but especially for video. And I wasn't expecting to find it on the Mavic Air 2S. It was wishful thinking. And I'm talking about adjustable aperture. So when you're filming video, you have to work within a few set rules and parameters. Lock shutter speed for one, depending on your frame rate. Meaning, that the only way you can adjust exposure on the Air 2S is by changing the ISO levels or by adding ND filters. Having an option to adjust exposure by adjusting aperture mid-flight is a luxury that looks like it's reserved for the Mavic 2 Pro at least for now. (upbeat music) The Air 2S does come with a new automated flight mode called Smart Shots. So once you activate it, the drone takes a few minutes to capture a couple of pre-programmed videos. Stuff like wide, circular shots and tighter, circular shots, dronies and basically you get five to 10 must-have clips. It's a great option for less-experienced pilots who just want to get something quick and easy. So there are some changes to the hyperlapse mode. You can no longer shoot 8K hyperlapse but you can shoot 4k or lower. And there's an added layer of stabilization in post. And I think it works okay. It's not super smooth. I still have to add some stabilization in post in After Effects or Premiere. Also super quick side note, DJI has $1299 fly-in-more bundle, which includes three batteries, charging hub, also includes a set of four ND filters: 4, 8, 16 and 32. I've never used DJI ND filters, but they come in this little case, which I'm weirdly obsessed with. It's a bit plasticky on the outside, but sure it has this nice, rubberized texture on the inside. And once again, it's incredibly thin. It's a small, seemingly irrelevant point but I just had to mention it because I love it that much. (upbeat music) And there's also a little change to the hardware, too. There's an extra set of sensors that sit right on top of the drone that will help with obstacle detection and avoidance, especially at higher speeds. DJI calls it APAS 4.0. It's encouraging to see some extra attention in that area. But DJI is nowhere near Skydio when it comes to autonomous flights. It's still mostly a safety feature that's something you would rely on. You do need to manually activate it to turn on obstacle avoidance and you pick how you want your drone to act, either it'll break in front of an obstacle or will try and go around it. And in my testing, the drone was a bit more hesitant than I anticipated, and it would often choose to break instead of avoiding an obstacle. (upbeat music) I know I've been pointing a lot of those things that you will not find on this drone or never that will not work. So I will end on a bit more positive note. This is still a fantastic drone that you'll undoubtedly be happy with if you decide to get one. And if you're okay with those caveats I've mentioned here. Frankly, most people will probably be okay with those trade-offs. Most people don't fly with APAS. Some people don't like 60 frames per second. Some people love resolution. But you just need to be aware of them. Bottom line. This is still a very, very capable drone with a very good camera on a smaller, lighter body than the flagship, Mavic 2 Pro. And it is a very good upgrade from the Mavic Air 2 from less than a year ago. But it's not a necessary upgrade for most of you. Thank you so much for watching. We've got plenty of videos on the channel this week. So if you're into cars, you can go take a look at the Mercedes EQS that we spent some time with. Or if you're into smartwatches, OnePlus is making its own smartwatches and we have the review of that with Dan Seifert. Bye. Thank you.",
    "transcript_keywords": [
        "Mavic Air",
        "Mavic",
        "Air",
        "original Mavic Air",
        "Pro",
        "sensor",
        "drone",
        "oneinch sensor",
        "video",
        "DJI",
        "photos",
        "zoom",
        "DJI decided",
        "shoot",
        "digital zoom",
        "oneinch",
        "bit",
        "frames",
        "times",
        "ISO"
    ],
    "transcript_entity_values": [
        "20-megapixel",
        "48-megapixel",
        "Today",
        "4k-60",
        "28",
        "Mavic Air",
        "1299",
        "4k",
        "one",
        "this week",
        "five to 10",
        "EQS",
        "four",
        "999",
        "three",
        "14",
        "Mavic Air 2S",
        "ISO",
        "12.4",
        "8",
        "one-inch",
        "the Air 2S",
        "5.4",
        "Air",
        "eight",
        "less than a year ago",
        "60",
        "8",
        "12-megapixel",
        "a few minutes",
        "DJI",
        "Mercedes",
        "Mavic Air 2S",
        "4k-30",
        "The Air 2S's",
        "Mavic Air 2",
        "Mavic 2 Pro",
        "a full year",
        "32",
        "24",
        "6",
        "4",
        "1080P-30",
        "3,200",
        "1,600",
        "APAS",
        "Skydio",
        "Mavic 2 Pro",
        "second",
        "2018",
        "OnePlus",
        "Dan Seifert",
        "22 millimeters",
        "first",
        "DJI ND",
        "16",
        "the Air 2S's",
        "ND",
        "Mavic",
        "1080P-60",
        "First"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL"
    ]
}