{
    "id": "-qpqd0-zw74",
    "title": "Lenovo made a rolling laptop",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-02-27T17:01:55Z",
    "video_url": "https://www.youtube.com/watch?v=-qpqd0-zw74",
    "category": "Science & Technology",
    "tags": [
        "lenovo",
        "lenovo rollable laptop",
        "MWC",
        "MWC 2023",
        "Mobile World Congress",
        "Mobile World Congress 2023",
        "rollable laptop",
        "lenovo rollable phone",
        "motorola",
        "sharp",
        "Thinkpad",
        "yoga book 9i",
        "CES",
        "CES 2023",
        "Samsung",
        "Galaxy Fold",
        "rollable tech",
        "MWC announcements",
        "MWC biggest announcements",
        "MWC Barcelona",
        "the verge",
        "verge",
        "tech",
        "first look",
        "tech reviews",
        "lenovo yoga",
        "lenovo thinkpad",
        "lenovo yoga 9i"
    ],
    "views": 155078,
    "likes": 2566,
    "comments_count": 162,
    "description": "Lenovo showed off two new rollable devices at Mobile World Congress 2023. The first was its rollable laptop that was first teased last October. When fully unrolled, Lenovos rollable laptop has a 15.3-inch display with an 8:9 aspect ratio, which the company points out is like having two 16:9 displays on top of one another. But we still dont know details on battery life, durability, or weight, so its clear theyre still far from ready for a public release.  Lenovo also announced a rolling phone. When all neatly rolled up, Lenovos Motorola rollable offers a 5-inch display with a 15:9 aspect ratio. Then, with a small double tap of a side button, the screen unfurls to give you a remarkably tall 6.5-inch display with a 22:9 aspect ratio. Lenovo would be the first to admit that its rollable concept devices are far from ready for prime time, but they offer a compelling argument for an alternative, rollable future. #Lenovo #MWC #MWC2023   0:01 Intro 0:21 Lenovo Rollable Concepts 0:51 Lenovo Rollable Laptop 4:25 Motorola Rollable Phone Concept  Read more:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Subscribe to The Vergecast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3Y5VrW1",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "https://bit.ly/3I6nJtz",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- So the last time I was at Mobile World Congress in Barcelona in 2019, foldables were the new hotness in town. Samsung had announced but not released its first Galaxy Fold and Huawei also had a foldable of its own, the Mate X. But that was four years and one pandemic ago. And in 2023, Lenovo is looking ahead to rollables. (lively music) So today we've had a firsthand look at a pair of rollable devices from Lenovo. There's a rollable phone and a rollable laptop and both of these they showed off in a video last October. Now, it's worth emphasizing that both of these are very early concept devices and Lenovo isn't ready to talk about pricing or release dates just yet. I didn't even get a chance to hold the devices for myself but both of them are a really interesting look at how transforming screens might influence the future of both phones and laptops alike. Let's start with a laptop because honestly, it's unlike anything I've ever seen before. The first thing to note about Lenovo's concept laptop, which it's just calling its rollable laptop for now is just how unassuming its appearance is. I mean, you really have no idea what this thing is capable of until it starts on rolling. And a group of us journalists just walked straight past it at first thinking it was just one of Lenovo's other 12.7 inch laptops with a four by three aspect ratio display. That all changes with a flip of a small switch on the right ofthe chassis at which point you can hear some motors worrying and the screen extends upwards. What's happening here is the screen is kind of being pulled out from underneath the laptop's keyboard and being displayed more or less vertically. It's a kind of slow process on this concept device that took maybe over 10 seconds but eventually, you're left with an almost square 15.3 inch display with an eight by nine aspect ratio. It's a little bit like LG's fancy rollable TV that can roll down into a little box when you're not using it. Only here, the screen is disappearing into the keyboard and it also doesn't entirely fold away. There's a small crease visible when the screen's fully extended, but again, it's a prototype. In terms of resolution, the display is 2,024 by 1,604 when unextended and 2,024 by 20, I'm just gonna put it up on screen. Oh yeah, of course. Yeah, 2,368 when fully extended. But basically the takeaway is that it's pretty usable without having to fully extend the display. The screen is applied by Sharp, which Lenovo has previously worked with on its ThinkPad X1 Foldable. Also, in terms of why you might want a laptop that can do this, other than it just being cool as hell, think of an eight by nine display's kind of like being two 16 by nine displays on top of each other, which is great news for anyone like me who really struggles to work on just a single laptop display and has been tempted multiple times to buy a laptop just to use as a secondary MacBook display. So the setup might be useful for coders to see more lines of text or for office workers to see more cells in Excel or content creators who can see more content. It would definitely be useful for me being able to have a video script in the bottom half of the screen and interview notes in the top half. Plenty of people like to use vertical monitors with their desktop PCs, so clearly it's a useful form factor and Windows' app windowing support can handle pretty much whatever weird screen sizes you throw at it. Okay, so the elephant in the room is that Lenovo isn't ready to talk about releasing this as a consumer device. And the more questions I asked about it, the better of an idea I got about why. I asked about durability and Lenovo said that it would like to get to a point where it's in the same ballpark as it's Fold X1 where it could survive maybe 20 to 30,000 folds but it doesn't sound like it's there yet. I admit that that doesn't sound like much compared to the hundreds of thousands of folds that foldable smartphones are typically rated for. But I guess with a laptop, you tend to open and close it far fewer times a day rather than every single time you want to check your messages. There're also questions about weight and battery life. Now, Lenovo wouldn't tell me how much this thing weighs and they also wouldn't let me pick it up. Trust me, I asked. And then in terms of battery life, apparently the rollable mechanism draws maybe a couple of watts of power, which doesn't sound like that much but I don't love it in an era where laptops sometimes still struggle to get through a full day's worth of use. That said, Lenovo is one of the few laptop manufacturers to have actually gotten an affordable laptop out the door. It released its original ThinkPad X1 Fold in 2020 and it announced a follow-up last year. So I think if it's showing off prototypes, there's at least some chance this might make it to a consumer release. I think it's fair to say this company isn't afraid to experiment with new laptop concepts. So fingers crossed this rollable concept gets the same treatment. Now, Lenovo's other device is a rollable smartphone. Now, there have been plenty of concept devices shown off over the years in various stages of development by the likes of Samsung Display, TCL and Oppo. But when it comes to devices that are actually available to buy, it's basically foldables. Anyway, like a foldable, the idea is that a rollable smartphone can be small when you need it to be portable and big when you need it to be, well, big. Oppo's rollable concept used its expanding screen to turn from a rectangle into more of a square. But Lenovo's phone, which it's calling the Motorola rollable smartphone concept, it's all about taking a small square of a display and making it longer. It's functionally kind of like a foldable flip phone but where you don't need a secondary cover display because it's the same screen the entire time. So here you're looking at a small five inch display with a 15 by nine aspect ratio when the phone's in its compact mode, and then with a small double tap of the side button, the screen unfurls to give you a full 6.5 inch display with a 22 by nine aspect ratio. It's pretty damn tall. Now Lenovo gets a lot of mileage out of this simple seeming design. There's the obvious stuff like being able to watch a video in its native aspect ratio with no black bars or getting a bigger screen when you go to compose an email. Lenovo's idea is the screen will dynamically adjust depending on which app you're using and it hopes that the final version will let its users as customize exactly how big they want the screen to be for each app. But there are also a couple of features of the Motorola concept that weren't immediately apparent. So for starters, that screen, when it's rolling down the bottom, it's not actually disappearing into the chassis, it's rolling around to the rear of the phone. So Lenovo says you might want to use this as a viewfinder when you're taking selfies with the rear cameras and even had a little demo where the rear display played cute eye-catching animations to get a child to look at the phone when you want to take a photo of them. Another cool touch is that the display can hide the selfie camera and earpiece only to reveal them when you make a call or gotta take a selfie. Like with the laptop, it's a concept device and there are plenty of questions that Lenovo didn't have answers to. There was no word on how durable it might be, how many rolls it might survive. There was no details on price or when this thing might actually release. And in our briefing at least, Lenovo didn't offer us a chance to try the device for ourselves. It was very much a hands-off experience. But like with the laptop, I think there's a non-zero chance this might actually one day make it into public hands. And remember, Lenovo's already put out a foldable in the form of the Motorola Razr. Maybe a rollable's next. In 2019, we asked whether foldable phones were the future but now I'd love to know is there a space in the foldable future for a couple of cheeky little Lenovo rollables? Thanks so much for watching, guys. We need to roll the ball along to our next briefing here in Barcelona. But you know, keep an eye on the site. We've got plenty of news. That's terrible. (director laughing) Thank you so much for watching, guys. Thank you so much for watching. Thank you. We gotta rollable along to our next briefing at MWC Barcelona. Let's keep an eye on the site for all of the top news from this year's show. - [Director] Just 'cause you're shouting the pun louder doesn't make it work more.",
    "transcript_keywords": [
        "Mobile World Congress",
        "Mobile World",
        "World Congress",
        "Lenovo",
        "screen",
        "laptop",
        "display",
        "rollable",
        "Lenovo concept laptop",
        "concept",
        "foldable",
        "Congress in Barcelona",
        "Mobile",
        "World",
        "Congress",
        "rollable laptop",
        "Lenovo rollables",
        "inch display",
        "aspect ratio",
        "phone"
    ],
    "transcript_entity_values": [
        "last year",
        "Mobile World Congress",
        "one",
        "four",
        "2,024",
        "three",
        "MWC Barcelona",
        "hundreds of thousands",
        "Windows",
        "the Motorola Razr",
        "LG",
        "today",
        "nine",
        "eight",
        "non-zero",
        "year",
        "22",
        "a couple of watts",
        "12.7 inch",
        "1,604",
        "20 to 30,000",
        "2020",
        "the years",
        "2,368",
        "20",
        "Excel",
        "maybe over 10 seconds",
        "Barcelona",
        "15",
        "last October",
        "Samsung",
        "half",
        "2023",
        "two 16",
        "Motorola",
        "one day",
        "6.5 inch",
        "four years",
        "Samsung Display",
        "MacBook",
        "TCL",
        "ThinkPad X1 Fold",
        "2019",
        "five inch",
        "a full day's",
        "ThinkPad X1 Foldable",
        "Lenovo",
        "Sharp",
        "first",
        "almost square 15.3 inch",
        "Oppo",
        "Huawei",
        "an eight by nine",
        "Galaxy Fold"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ]
}