{
    "id": "-SoZKXlsJG8",
    "title": "Tesla Arcade hands-on: the Model 3 is your video game console",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-06-19T02:38:10Z",
    "video_url": "https://www.youtube.com/watch?v=-SoZKXlsJG8",
    "category": "Science & Technology",
    "tags": [
        "tesla",
        "arcade",
        "tesla arcade",
        "elon musk",
        "Tesla model 3",
        "model 3",
        "Tesla model x",
        "beach buggy",
        "racing 2",
        "beach buggy racing 2",
        "video game",
        "video games",
        "gaming",
        "gaming console",
        "game controller",
        "controller",
        "xbox",
        "nintendo",
        "nintendo switch",
        "playstation",
        "ps3",
        "playstation 3",
        "xbox 360",
        "electric car",
        "ev",
        "tesla roadster",
        "electric",
        "e3",
        "e3 2019",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 725579,
    "likes": 9535,
    "comments_count": 663,
    "description": "Tesla Arcade is pulling the companys secret video game features out of the shadows and bringing them front and center, starting today. Tesla Arcade is a new video game hub found across its line of electric cars. Earlier this afternoon, Tesla brought a Model 3 to downtown San Francisco to let The Verge try out Arcade and its newest title, developer Vector Units Beach Buggy Racing 2.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2Xke0KJ",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- It's Nick Statt with The Verge, and we're checking out Tesla Arcade on a Tesla Model 3. It's the company's new video game hub built right into its touch screen. So Tesla has actually had video games built into their center screen here since last August. They used to hide it in a secret Easter egg menu so you would tap this Tesla bar up here, and you would pull down and it hid a whole bunch of stuff here, so not just video games but just like funny fart mode thing here, you can turn your car into a Mars Rover here. And then if you click this arcade cabinet, you would launch the video games. But now, with their most recent update, they've actually pulled this into the main menu bar. So you click this bar down here and you've got charging, calendar energy levels, that kind of thing. You've also got arcade in the far right corner. And there you go, you're launched right into the full list of titles that are supported on Tesla right now. Now when you launch a game, you're gonna get a warning screen. Effectively, Tesla is telling you, don't hit the accelerator when you're playing a game. You can hit the brake pedal and it will work in this racing game. The brake pedal will actually have the rear brake lights turn on while you're racing. But you're not supposed to hit the accelerator and also you have to be prepared for the full control of the car to resume when you exit the game. It's gonna be disabled while you're playing the game. But as soon as you exit, the accelerator's gonna start working again, the brake pedal's gonna start working again, and the gear stalk's gonna start working again. So you need to prepared for all of that. You can't really be doing this in the middle of the street or in traffic. They really don't you to do that. So Beach Buggy Racing 2 is a game you can play on Android phones and tablets. The developer, Vector Unit, works specifically works with Tesla to port the game over to its vehicles. Now, it's gonna have a few key tweaks. The first is that you're actually gonna be able to play as your own Tesla vehicle, so it's gonna know the make and color of your car. And it's gonna know that because it's gathering it from the software. Now the other key difference is that instead of using touchscreen controls, you can actually steer with your Tesla vehicle. So when you're steering with the Tesla steering wheel, it's gonna have you automatically have you driving, so it's pressing the accelerator for you. You can brake, using the touchscreen controls here. But you can also brake using the actual brake pedal of your Tesla vehicle. And it'll even show brake lights. So the point of this is not to distract you while you're driving, right? It's to give you something fun to do while you're waiting for your car to charge or you've got some time to kill and you're sitting in park. Tesla CEO Elon Musk, he's always loved video games. He basically designed his own video game before he was even a teenager so he's got an interest in doing this kind of fun stuff. And also, it's just a pretty cool thing. Tesla basically has an iPad sitting in the center of their infotainment center. It's got a powerful processor, it's got an internet connection. So basically it's no different than a tablet and it can do the things that a tablet can do, and Tesla wants to kind of emphasize that with Arcade. (beeps)",
    "transcript_keywords": [
        "Nick Statt",
        "Tesla Model",
        "Tesla",
        "video games",
        "game",
        "Tesla vehicle",
        "brake",
        "video",
        "Verge",
        "Model",
        "Nick",
        "Statt",
        "brake pedal",
        "video games built",
        "Arcade",
        "Tesla Arcade",
        "games",
        "Tesla CEO Elon",
        "video game hub",
        "Mars Rover"
    ],
    "transcript_entity_values": [
        "Arcade",
        "Tesla",
        "Easter",
        "Beach Buggy Racing 2",
        "Android",
        "Vector Unit",
        "a Mars Rover",
        "first",
        "Tesla Arcade",
        "Elon Musk",
        "last August",
        "iPad",
        "The Verge",
        "Tesla Model 3",
        "Nick Statt"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "FAC",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON"
    ]
}