{
    "id": "-uJ0MI_k7I8",
    "title": "The BEST Retro Gaming Handhelds",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-02-21T17:30:02Z",
    "video_url": "https://www.youtube.com/watch?v=-uJ0MI_k7I8",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "anbernic",
        "anbernic rg350",
        "retro game 350",
        "rg 350",
        "rg350 review",
        "retro gaming handheld",
        "pocketgo",
        "pocketgo review",
        "pocket go",
        "jimmy champane",
        "review",
        "rg350 handheld",
        "retro handheld",
        "emulator",
        "emulation",
        "gba emulator",
        "psx emulator",
        "tech",
        "rg 350 review",
        "rg350",
        "gba",
        "snes",
        "gameboy",
        "handheld",
        "playstation",
        "retro gaming",
        "unboxing",
        "roms",
        "gaming",
        "nintendo",
        "game boy advance",
        "best handheld emulator",
        "rg350 ps1",
        "retrogaming",
        "emulator handheld",
        "rg350 vs pocketgo",
        "pocket go review"
    ],
    "views": 201525,
    "likes": 5410,
    "comments_count": 425,
    "description": "Is the Anbernic RG350 the ultimate emulator? PocketGo on Amazon:  RG350 on Amazon:   Check out @JimmyChampane's channel!   Trying Beauty Products from WISH:  Is the Samsung Z Flip Worth It?  This Tech Is Older than You Think... Can GeForce Now Kill Stadia?  $16 a YEAR for Pokemon?!    Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://austin.tech/pocketgo",
        "https://austin.tech/rg350",
        "https://youtu.be/qqGrrWgi7RM",
        "https://youtu.be/xdyWoP6l0tU",
        "https://youtu.be/TBAp3YFcWBY",
        "https://youtu.be/DT9IayCreTg",
        "https://youtu.be/4txPvf_kZpQ",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, welcome to This Is. Today Jimmy, we have some weird Chinese emulators. - Yes we do. So, I've been trying to get into this game for a little while now, and the very first one that I've actually bought was this. - So you bought this with your own money. - Yes. - Ken could learn a thing or two from you. - Right, it's bad. So you could get these emulators from anywhere you could get 'em. This one's called the PocketGo, it's made by Retromimi, - How much is this? - This one is only $40 which is why it's the main, this is the one that people go for when they look for emulators. It comes shipped with ROM's on it. It has it's own emulators. - They ship it with ROM's? - Yes, they ship it with a lot of good ROM's, like, I don't want to say which, but if you want a game for Super Nintendo, NES, Game Boy Advance, Game Boy, it's probably on there already. - Okay. - The issue is, the first one I ordered never came. - Wait, you spent $40 and it just never showed up? - Yeah, so it was like a whole ordeal. They're already shipping the first one from China, I bought it directly from Retromimi. - Right. - And, it gives you a tracking number and everything like that, but customs just decided that it was theirs. - It's almost nefarious. - Right, it was very nefarious, so I hit up Retromimi and they were like, \"it made it to customs\", like, \"our hands our clean\", and I was like, \"okay.\" They're on Amazon now, Prime - [Austin] So just buy them on Amazon? - [Jimmy] Right, buy it on Prime, it's also cheaper, it's $35, I literally got it the next day. This one is entry level for a reason, it does look, I think the best out of all the different options you can get. - [Austin] Okay, so we have Amiga, Game Boy, Game Boy Advance, NES, and-- - There's multiple emulators for some of them because out of the box, this one needs an update, they all need updates out of the box. Which is not easy to do. - I'm assuming you just load it up on the MicroSD? - Yes, but you have to flash it. So there are multiple programs involved. - There's one website where you get them all, it's a very simple download, and once you watch, there's one YouTuber who's really good, and once you watch his videos, it's pretty simple for all of them, but I had to do that, and that wipes all of the ROM's off of it, so this one, not working too great. (laughs) - I'm feeling great right now. - Try the old power off, power on trick. - Yeah, the good old classic. - You'll see why I dumped this one pretty quick. I used it for about a day, and was like, cool concept, pretty bad execution. - I mean, for 35 bucks, if it plays games somewhat decently, I do like the size of this. - Yes. - Like, I don't want something huge-- - It looks like a Nintendo, like it's kind of a good mix between Super Nintendo and Game Boy. We've got Super Mario World. One of the best games ever made. And one of the best title screens ever. - [Austin] Oh dude, this screen is actually really nice. - [Jimmy] Right, it's sized right. It's got a decent resolution for that size, it's 2.4 inches, it's 320x240. - I mean, it's a Game Boy sized screen, but it's an actual LCD, like an-- I mean, it looks IPS, it's nice and sharp. So this will not do like, PlayStation games. - It has the ability to do PlayStation games, they just don't work right. Like they're very choppy, very low framerate, it's not worth it. - Got it. - And that's kind of what made me start investigating other options which we will look at soon. - [Austin] I'm not gonna lie, I feel like I'm dropping frames right now. - [Jimmy] Yeah, Super Nintendo drops a few frames, Game Boy Advance ironically is the one that runs best if you can get the games to start. And the sound's a little off, I can tell, having played this game thousands of times. It sounds a little off, it's okay. It's a very okay experience. - [Ken] For the size of that screen, it looks really sharp. - It is incredibly sharp, so that's one of the things that I'll definitely give this, is that it's a nice small console, but the screen, especially when you say $35, the screen is way better than I would expect, far better than any kind of Game Boy that you would be able to get, maybe some slight technical difficulties with it working and running smoothly, but, I heard that you have another console for me to try. - Yeah. That, this one for sure though, you can get working right, I just gave up on it really quickly 'cause it wasn't doing what I wanted it to do. - At 35 bucks, I'll put some time into getting this thing sort of, you know, settled, and properly sorted correctly, okay. - So but the cream of the crop, the next one we've got to look at, this is the Anbernic RG350. - [Austin] This is the same thing that we looked at on Mystery Tech. - [Jimmy] Right. - [Austin] Although, this one, it's a black and orange. - [Jimmy] Yeah, this is the default color. - [Austin] Okay, I like it, it's-- did you get it because it's Halloween colors? - Yeah, yeah, it's the default color though, so you know. - [Austin] Oh, those sticks feel good. - [Jimmy] Yes. It has dual analog sticks, it has a glass screen. - [Austin] USB-C and HDMI, this guy only has like a little AV like headphone styled jack for RCA. - The HDMI is not active. It just doesn't do anything. It works, theoretically, like the hardware level it works, but they haven't activated it yet. There is a very good community of homebrews for this device. Again, you have to flash the software or firmware to the device, but this one uses an internal SD card for it's firmware, and an external one for ROMS. The built in emulators for this device run great, they're optimized super well, the screen looks great. And, the biggest draw for a lot of people besides the fact that it has two triggers, or four triggers in total and dual analog sticks, is the fact that it can run PS1 games almost perfectly. - There we go, so that's the thing, so, I have wanted, since they really made the first NES classic, I've wanted a Game Boy Classic. - I would love something like that. And this seems like the closest to really giving me that full experience that also can run PlayStation games 'cause realistically, if I'm running an emulator, I'm running PlayStation 1 games, and I'm running Game Boy and Game Boy Advance games. - [Jimmy] Yes, so this is the same resolution as the PocketGo, it's just a little bit bigger. This one, I genuinely love. I play it a lot. - [Austin] So yeah, so this is the custom, or is this the PS1 Doom? No, this is Game Boy Advance SP, or Game Boy Advance Doom. It actually runs surprisingly smoothly, like that looks like 60FPS, or at least close to it. - [Jimmy] I've done a lot of testing on this thing, all the emulators have the ability to put the frame-rate on screen, it's 60 locked, 99% of the time. The only emulator it doesn't really work well with, though, is N64. - N64 is tough. All right, what else do we have, so how do I exit? - [Jimmy] Uh, there's... - [Austin] Is there a reset button? - [Jimmy] Did you hit the, like tap the power button? If you want it, so, you can reset the whole console with reset, that's kind of an inelegant way to do it, all of the emulators if you just tap the power button, you can quit them through the emulator menu. It's really good about once you're in an emulator you can go through the whole file structure of the device, so even if you accidentally saved Metal Gear Solid 1 in your Game Boy Advance folder, you can go find it, and execute it that way. - [Austin] That's cool. I will say, the screen actually seems to be a little low quality than on this guy. - Right, 'cause they're the same resolution. - [Austin] It's bigger, and also seems a little less contrast. Like this one, I felt like got a little bit brighter, it was a little more contrasted, this seems like a little more of-- how much is this guy? - Oh yeah, we didn't talk about that. This one's a little steeper, it's about 100 bucks. 70 bucks if you want to order it from China, to be fair, 100 bucks prime shipping on Amazon. For what you get here though, a device that can play all Game Boy Advance games, all Game Boy Color, anything you really want except N64, it's, I feel like worth it. Another option for running PS1 games, though, is the PS Vita, I brought mine in. I had Metal Gear Solid on it, it's a very tough process to get Metal Gear Solid on this thing, you actually have to have a PS3, you need the PS1 Classic on your PS3. - Wait, wait, sorry hang on, say that again? You have to, so you load it up from the PS3 side, and transfer it to Vita? Just for Metal Gear Solid 1. Also, PS Vita, as good as it is for emulating PSP and PS1, doesn't have any of the Crash Bandicoot games or any of the Tony Hawk games. - And the other thing with the Vita is that if you have one, obviously great, but you can't get these things cheap anymore, they're actually fairly expensive, right? - To get a Vita 2 used, it's about the same price. 100 bucks. - [Austin] Oh, okay. - And you usually get a memory card with it, again, doesn't use an SD Card. Since you're a specs guy, real quick, this one has 500 megahertz about a single core CPU - Oh, so that's why it can only run like SNES kind of poorly. - And it has 32 megabytes of RAM - Megabytes? - (laughs) Yeah. - Okay, 35 bucks, 35 bucks though. Okay. - You pay 100, you get a 1 gigahertz dual core processor. - [Austin] Which is why you can play Super Nintendo as well as PlayStation and everything. Okay. - And you get a half a gig of RAM, 512. - Perfectly reasonable. - Well, yeah. For 100 bucks, and the build quality on it, it's plastic, which kind of sucks. - [Austin] So I guess sort of it comes down to me to two choices. If you wanna just save some money, if you wanna just kinda get into this, especially if you're not really sure that you're going to want to spend a ton of time, the PocketGo seems like a perfectly reasonable option. You're not going to be able to play the higher-end games, it's more of a Game Boy emulator, the Super Nintendo, it was running a little choppy. - Super Nintendo is not, that's not the one to get it for. Game Boy Advance ironically runs the best on that device, unfortunately it's hard to get running, which is another downside I think, you have to install custom firmware, you gotta go find the ROM's yourself at that point, and sometimes they don't work, but once you get into a Game Boy Advance game, that one runs them the best, and that was the whole reason I initially bought it. - Well you're saving some money, and you spend a little bit of time in exchange. Where as with the Ambernic, you're getting something which is more powerful, obviously bigger, little bit more bulky, but it has a lot more functionality, you've got USB-C which I'm a big fan of. And, you also have something which to me, is a much more well rounded package at nearly $100 depending on where you get it. - You got a pocket PS1 and a pocket Game Boy Advance that runs both versions perfectly, you can't get that on a lot of other devices. The community around these things is massive, especially with the RG350, the technology evolves really quick, like the PocketGo 2 right now is the one everyone wants, but no one wants to order it directly from China, so everyone is just kinda waiting for it to show up on Amazon, but there is a huge community of people in China who are making these things themselves, they're using a lot of Android phone parts, so I feel like in the future, you're gonna be seeing a lot more Android devices instead of straight Linux. - If you're recycling an old Android phone, especially if it has a busted screen or something you're pulling out the beam board, you have a lot more power available because even something like this which is pretty good for an emulator, is nowhere near as powerful as a modern phone, such as the Galaxy Z Flip, which I just so hopefully have provided here, look at that wonderful-- - [Jimmy] You already have it running, that's awesome. It's so cool. (video game music) - So Austin's got his pocket Game Boy Advance SP. - Sorry, can't hear you over Pokmon. C'mon, look how cool that is! - The thing that I lose with this is buttons, I know, I know - [Austin] Fine, try it. So in no way am I recommending spending $1400 on a Z Flip, but I have one, and I put a Game Boy Emulator, and it feels exactly like a Game Boy Advance SP. - [Jimmy] It does, it feels really good. So you've got Haptic Feedback set up on the buttons, which, if you're gonna use touch screen buttons, that's the way to do it. Yeah, for your phone, getting this set up, I feel like would be pretty easy. The difference is, if you get an Android emulator from China, people are taking the buttons from PS Vitas, and putting those in there so you got the triggers, you've got the analog sticks. And I've seen some of them, they just look like this, like a Vita shape, but they have a earpiece here and a microphone here so you can call, they have dual SIM slots, so you can use them like a phone - You need me a photo of that, I can't even ima-- - It's ridiculous dude, and it's all really a couple guys who are making these things, they're like \"this is my new device,\" and everyone kinda flocks to it in China. There's one of these you can get that's all Aluminum, the Anbernic RG350. - That's so cool. So, essentially what these guys are doing, is essentially they're recycling, right? - Yes - So you're taking old phones that might just be tossed, you're pulling parts out of that, you're maybe taking old Vitas that might be tossed, pulling buttons and stuff out of it, and you're combining it into a new emulator. You know what, we're saving the environment one emulation station at a time. Anyway, thank you very much for watching this episode of This Is, make sure to subscribe, you also should go subscribe to Jimmy because he doesn't make videos like this at all on his channel but he probably should. (laughs) - You just switch my whole channel? - Yeah. - You know, no more Halloween movie stuff, no more horror movies, we're just gonna talk about emulating machines that kind of run games well. - No one likes movies Jimmy, everyone likes gaming. - [Jimmy] I mean, that's true.",
    "transcript_keywords": [
        "Game Boy Advance",
        "Game Boy",
        "Boy Advance",
        "Boy Advance games",
        "Game Boy emulator",
        "game",
        "Boy",
        "games",
        "pocket Game Boy",
        "Game Boy Classic",
        "running Game Boy",
        "Advance",
        "Game Boy Color",
        "Advance games",
        "Boy Advance ironically",
        "Super Nintendo",
        "Boy Advance Doom",
        "Metal Gear Solid",
        "Game Boy sized",
        "Boy emulator"
    ],
    "transcript_entity_values": [
        "Game Boy",
        "Android",
        "the Anbernic RG350",
        "Haptic Feedback",
        "ROM",
        "CPU",
        "PlayStation 1",
        "the PS Vita",
        "Retromimi, - How",
        "thousands",
        "jack",
        "Nintendo",
        "One",
        "Game Boy Advance SP",
        "35 bucks",
        "SNES",
        "RAM",
        "Aluminum",
        "NES",
        "PS Vita",
        "Classic",
        "1400",
        "YouTuber",
        "SIM",
        "500 megahertz",
        "Austin",
        "Mystery Tech",
        "the Super Nintendo",
        "Game Boy and Game Boy Advance",
        "only $40",
        "about a day",
        "Retromimi",
        "China",
        "1 gigahertz",
        "Amiga",
        "first",
        "Super Mario World",
        "Linux",
        "a ton",
        "Chinese",
        "Vita",
        "Today",
        "100 bucks",
        "LCD",
        "the next day",
        "PS Vitas",
        "Vitas",
        "Jimmy",
        "RAM - Megabytes",
        "Super Nintendo",
        "Metal Gear Solid 1",
        "N64",
        "70 bucks",
        "512",
        "PocketGo",
        "wonderful--",
        "SD",
        "60FPS",
        "Ambernic",
        "USB-C",
        "about 100 bucks",
        "AV",
        "Tony Hawk",
        "PlayStation",
        "32 megabytes",
        "2.4 inches",
        "PS3",
        "35",
        "one",
        "four",
        "ROMS",
        "99%",
        "60",
        "nearly $100",
        "Metal Gear Solid",
        "Pokmon",
        "RG350",
        "two",
        "Game Boy Advance Doom",
        "Amazon",
        "Jimmy",
        "Halloween",
        "40",
        "RCA",
        "Game Boy Advance",
        "MicroSD",
        "Vita",
        "100",
        "HDMI",
        "SD Card"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "WORK_OF_ART",
        "GPE",
        "QUANTITY",
        "NORP",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}