{
    "id": "-XB0NGf1Vc0",
    "title": "This screen is AMAZING! - HP Pavilion Plus 14",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-08-23T20:04:17Z",
    "video_url": "https://www.youtube.com/watch?v=-XB0NGf1Vc0",
    "category": "Science & Technology",
    "tags": [
        "hp",
        "unboxing",
        "impressions",
        "laptop",
        "display",
        "screen",
        "oled",
        "budget",
        "work from home",
        "wfh",
        "school",
        "back to school",
        "review"
    ],
    "views": 437501,
    "likes": 14460,
    "comments_count": 798,
    "description": "Play Enlisted for FREE on PC, Xbox Series X|S and PS5:    Follow the link to download the game and get your exclusive bonus now. See you in battle!  Alex thought this was just another laptop unboxing, but little did he know, this unassuming HP has a MAJOR upgrade. A fantastic OLED screen! Now the real question is \"does the rest of the laptop live up to the hype?\"  Buy an HP Pavilion Plus 14:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Aggressively excited 0:20 Exterior impressions and ports 1:11 What else is in the box? 1:24 Initial screen impressions 2:08 Some minor frustrations 3:02 Laptop specs 4:03 Testing chassis rigidity 4:47 Trackpad and keyboard impressions 5:40 Sponsor - Enlisted 6:16 Speaker test and comparison - Crab Rave! 7:20 Display comparison with XPS 8:37 Gaming - Valheim 9:35 Gaming - Rocket League 11:39 Benchmark - Cinebench 11:47 Mic and Webcam impressions 12:38 Teardown 15:25 Overall thoughts 15:36 Outro",
    "description_links": [
        "https://enplay.link/lttsc",
        "https://lmg.gg/j9DPb",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Are you looking for a screen that just so happens to have a laptop attached to it? Well, I've got a treat for you. This right here is the HP Pavilion 14 Plus and it's only $850, which I know, I know. That's not really budget but has a fricking OLED display. Look at that. It's beautiful. We're not starting with the display though. You'll get to look at that later. People always get mad when I describe laptops as looking a lot like a laptop but this is another one of those. It's a laptop. It does feel really good though. It's all aluminum construction, it's stamped, and also recycled aluminum is what they used. So that, you know, the Gen Z and millennial audience that ends up buying this, or at least they want to buy this doesn't get too mad about it. Speaking of things I wouldn't get mad about, the IO. So, we have a mini SD card reader. I do kinda wish there was a full size over here, but whatever. Also a full size Type-A headphone microphone combo jack and around the other side is where things get very fun. So, we have, oh, darn, they're not Thunderbolt. Or at least I don't believe there's a Thunderbolt but we do get two USB Type-Cs, full size HDMI, I believe it's only 2.0 and also USB Type-A. All right, what else do we have here? Before we continue, oh, geez. We have floor power cord. Yours probably won't come on the floor though. It's a 90 watt charger and it is USB Type-C. Love to see it. While Windows is updating, this is an excellent time to have a look at the black levels because this is all that we're getting at the moment. As you can see, just exceptionally dark in... Well, now the display's just off. There we go. Now you can see it. (chuckles) Just pitch black, everywhere. You know, it's not illuminated. Oh, is it not touch? Oh, touchscreen denied. I would be kind of sad about that, except that every single other spec about this display is just fricking the best. So, it's 2.8K, of all things. 2880 by 1800p. It is also OLED, and the absolute cherry on top is that it's 90 hertz. One very minor annoyance is that you can only plug in your charger on one side. Do wish they had a Type-C over here but at the same time, we're really splitting hairs, if that's the sort of thing we can complain about. All right, screw it. We're not using QuickSync, we're just brute-forcing this in code. All right, we're back. Now, we had a small issue there. Even though the processor and this is quite powerful, it was not very happy when we tried to do screen recording. Now, that's a combination of fairly high-resolution display and not having a GPU. It is possible to get a GPU in this. You can get a 2050, for some reason. If you want to go down that road, I would highly suggest not getting this laptop. There's many other options, the Envy 14 comes to mind where you could get like, a 3050, which is unsurprisingly much better than buying a 2050 in 2022. Anyway, there are specs of what we have in here are very good. For the processor, we have the i7-12700H, that's a 14 core processor. Insane that that's in a laptop like this. Now, you do have to remember that eight of those are efficiency cores. They're not as good as performance cores but you still get six performance cores. It's damn impressive in a laptop like this. As well, we have 16 gigabytes of RAM. I'm going to be very interested to see if you're able to upgrade it 'cause that would help a lot in this thing. It is DDR4, though, 3,200 megahertz. We also have a 256 gigabyte SSD, Realtek Wi-Fi 6, interesting. I don't know if that card's good or not, but an upgrade that you might want to do is upgrading that to an Intel Wi-Fi chip, 'cause those can be just way better. If you have weird like, dropping out and stuff with your Wi-Fi, then maybe consider doing that. And finally, Iris XE graphics. So, this will be 96 execution units in this one. And as we just saw, it's not good enough to do screen recording on this. The rest of the machine is pretty standard for HP. The chassis is just overall very well built, especially for something in this price range. It's stamped aluminum. It does have some macro flexing. Like, if I push here, you can see that the whole thing kind of bends down. But at the same time, like, it's not CNC machine, this isn't a Specter. It's more than good enough. It also is quite a thin machine. So, if you have a look here, it's 16 inch change in the front, 18 and a little bit more change in the back. That's it's pretty thin. It's not the thinnest or the lightest. 3.09 pounds. So yeah, this is a very easy laptop to sort of just live with from a weight and thickness perspective. I know that I've already said it, like a bunch of times, but the screen on this, especially for the price is just incredible. And there's a bunch of other things that are great about this too. Like, a couple years ago, an $850 Windows laptop would come with a track pad that was just, it would make you buy a MacBook Air. This one right here, not so much. It's nice and large. I don't believe it's glass topped, click feels excellent, general usability feel awesome. Great trackpad. Keyboard. (keyboard clicking) Keyboard's awesome. It feels the same as the ones that are on the Envy line, which is awesome. It's pretty snappy, has nice long travel. And if you look at the key stabilization, it's very good. Super easy to, you know, if you hit the corner of a key, it's going to actuate before the flexiness gets below the chassis line there. HP's been doing a great job with their keyboards for just years. Oh, what else do we have here? \"Crab Rave!\" Okay, of course. - [Bell] Our sponsor. - Oh geez, yeah. I can't give you a \"Crab Rave\" without telling you about our sponsor, \"Enlisted.\" Thanks to our sponsor, \"Enlisted.\" \"Enlisted\" is a free to play World War II multiplayer shooter available on PC, PS5, PS4, Xbox Series X, S, and Xbox One. It has a focus on historical authenticity and gameplay that always keeps you in the middle of the action. It'll be placed in large scale combat alongside dozens of soldiers and vehicles directly in famous historical campaigns, like the invasion of Normandy. Head to the link below to start playing \"Enlisted\" for free. You'll also get free bonus just for signing up. I am going to guess right now that the speakers on this are not very good, unless they happen to have some below the keyboard. Looks like they're gonna be down-firing. Yeah, so there's a speaker right there and right there. And anytime that you have to bounce sound off of a surface, it's going to lose some clarity. (upbeat music) My first impressions are that that's way better than I was expecting. There's no bass. There's none at all. (upbeat music) But at the same time, who cares? It's fairly clear and louder than I expected. Now, of course, we've got the main contender even though it's the hardly fair given how much more expensive this thing is. All right, let's see here. (lively upbeat music) Switching over to the XPS. (lively upbeat music continues) Yep, that's way better. Turns out that a $2,400 laptop sounds better than what, 850. Who would've guessed? The more interesting thing though, let me just turn up the brightness of this XPS here. Let's have a look at the panels. Damn. (chuckles) What's super impressive here is that these look effectively the same. I'll just turn this around for you, Andy, there. I was shocked by how good the display was on this XPS and to see it in a laptop that costs this much money and have it be effectively the same. - [Andy] The color on the HP- - That's crazy. - [Andy] Is definitely richer. - [Bell] Yeah, I agree. The HP looks nicer. - Yeah, that's interesting 'cause they both said that, you know, the HP actually looked a little bit better than the XPS 15, which makes sense, because I actually had to increase the black levels on the XPS here. It's kind of dumb, but the problem is just that, YouTube's compression is awful. So, if you have a display that's really good at showing off intricate detail in like, you know, very dark scenes, on a lot of YouTube videos that ends up just meaning that you see a bunch of blockiness or something. Or like someone does a very bad job of color grading. So, they're like pants that they're wearing that are black. Or just like looking into the void, as opposed to like, when they balanced it on LCD display it probably looked much more reasonable. So yeah, using OLED for most things to use a computer for is kind of dubious. But that said, this one looks really good.(chuckles) What else do we do? Game? Do you guys wanna have a little game? - [Andy] Yeah. - Yeah. First of all, everyone's favorite game. \"Valheim.\" I don't think it's gonna be able to run it. Not at like reasonable settings at least. Yeah, that's not ideal. So, we're currently getting 17 fps. Foraging will be very easy 'cause there's no grass cover or vegetation at all. That's a plus. In fairness, it doesn't feel as bad as, you know, generally gaming at 18 fps would be. Just simply because, you know, we have a 90 hertz display and also OLED has really good pixel response time. So, it's not the worst, the worst. Yeah, I need to turn down the resolution a bit. (gentle upbeat music) There we go. All right, you just need 900p and then you can get like 50 fps on low. Yeah, this looks really bad. Anyway, you can't play \"Valheim\" really. Let's try \"Rocket League.\" This is more the sort of game that I would expect you to play on a device like this. And it might be fine. It might not be, but it's probably fine. Okay, do you think that we can get away with, I was going to say can we get away with native resolution, but no. See, 1920 by 1200, we might be able to do that. Medium settings. This is not enough fps to be playing \"Rocket League.\" Right now, it's at around 30 fps. Ugh! And that's at 1080p, this is bad. Okay, let's try dropping it even lower. What do we need to do to make this playable? 1440 by 900. I'll turn down the anti-aliasing, just 'cause I hate smooth lines. Everything else is on quality-ish. Looking at 40 fps now, and this looks bad. So, I don't, oh wait, what we probably have to do, I wonder if there's some HP Command Center crap, performance mode. Will that help us out at all? Resume game. 40 fps. Well, don't game on it. That's what we're saying here. Now, that said though, this is an incredibly powerful laptop, if you're looking just purely for CPU performance. Oh, do we have Cinebench on here? We do. Beautiful. So, we're looking for what, that Yoga? That was a very similar size, got like 13,000. And that was propped up. We need to prop 'em all out. - [Bell] The new official testing ShortCircuit. - Yeah. (chuckles) The ShortCircuit official test. This is painter's tape. Performance mode, multi-core, let's go. All right, what do we think? Like, I'm guessing 12,569. What do you think, Andy? - [Andy] 12,420. - 12,420, okay. How fast is this CPU running right now? 2.16 gigahertz. Not as fast as I would want it to be going at this moment. I would be kind of hoping for like higher than base clock at least. Oh, damn, 13,026. So, that's still very impressive. That goes to show you that, you know, having 20 threads really helps in a multi-threaded application like this. So, if what you're looking to do is get a laptop for like photo editing or light video editing but particularly photo editing. This thing will be fricking incredible because like, the display. Our last little bit here before we open it up is the webcam. And this looks great. So, here we get a five megapixel webcam. And I do have to say, it looks really good. It is like, it's not the best looking camera ever because it's a webcam. But at the same time, it looks fairly sharp and more impressively it's exposing perfectly. And that's something that HP has done a fantastic job of doing. Like, if we're just kind of right here, it doesn't really matter what I do. It's exposing to my face. And it does an excellent job at that. HP does really know what they're doing as far as like a business laptop goes, like, video calls, keyboard, mouse, display. They've got that pretty down at this point. All right. So, basically you have an incredible processor and an incredible screen, which means that this is going to be a powerhouse for photo editors. But you know what photo editing needs a lot of? The RAM. And if you can upgrade it, then that's like, incredible. Let's see here, looks like only four screws. If that's the case, that is fantastic. We have to remove these rubber feet. Then that will be a little bit unfortunate. But in fairness to HP, these rubber feet are really good at just falling off on their own. So, that'll make access pretty easy in a while. Super easy. Four screws, you're in. No RAM upgrading. Damn. Yeah, so we can see, we have our little RAM chips all right along here. That's very unfortunate because it means that you have to buy the amount of RAM that you need from the factory. Now, the reason that I say that, is that this is more of a budget orientated device. So, there's a good chance that, you know, the eight gig model might go on sale, in a year. And you might be able to get it for a really good deal. And that would be fricking wicked, if you could just upgrade the RAM and be like, \"Yeah I have a great machine now.\" Whereas instead, you have to just, well you don't buy it 'cause you don't buy it laptop with the 8 gigs RAM that you can't upgrade. That's just like a rule for me. Fortunately though, you can easily upgrade the SSD. And we get a look at what gave us that 13000 Cinebench score. Two big ol' fans right here and a heat sink that goes all the way across the back. You also have really easy access to the Wi-Fi card, so if it turns out that's crap, you can replace it with an Intel one. Those are really cheap as well. And finally, the battery. 51 watt hours. And it's not enough. You'll get under good conditions about six hours of battery life out of this, according to HP. That's because the OLED display just, it sucks a bunch of energy. Now, you can probably do better by, you know, reducing the brightness, using dark mode and everything and so on. But at the same time, six hours of battery life is like barely acceptable. On top of that, I need to tell you about Windows Modern Standby, once again. Because it's my personal mission to annoy enough people in OEMs that they get mad at Microsoft. And then Microsoft might actually do something. Windows Modern Standby. It's terrible. You put your laptop in your backpack and then you come back like I did this morning and your stupid laptop's dead. And you have to go and get a fricking charger and you're late for your call. Windows, fix it, please. Jake, windows Modern Standby. - [Jake] Oh my god, don't even get me started. - Yeah, don't even get me started. Bring back S3 sleep, or I'm going to hurt you. - [Bell] That is a threat. - That is a threat. I will tell everyone to go and buy Apple products. - [Jake] It's why I went to a MacBook. - Yeah, that's why Jake went to a MacBook. Windows Modern Standby, it sucks balls. HP get mad at Microsoft. I've already had my Dell reps say that they've used these videos to get mad at Microsoft. You get mad at them too. All right, thank you. Anyway, HP pavilion Plus 14. It's a very good laptop, especially if you're looking to like photo editing or something. I don't think there's a better display for the money, just period. If you like what you see, hit subscribe, like, and just have a fantastic day. See you later.",
    "transcript_keywords": [
        "good",
        "laptop",
        "yeah",
        "Windows Modern Standby",
        "display",
        "Modern Standby",
        "RAM",
        "Windows Modern",
        "Windows",
        "time",
        "thing",
        "XPS",
        "OLED",
        "kind",
        "mad",
        "fps",
        "OLED display",
        "things",
        "laptop attached",
        "Enlisted"
    ],
    "transcript_entity_values": [
        "USB Type-A.",
        "Modern Standby",
        "S3",
        "USB Type-Cs",
        "just years",
        "8",
        "Thunderbolt",
        "90 watt",
        "90",
        "only 2.0",
        "a \"Crab Rave",
        "YouTube",
        "17",
        "Windows",
        "850",
        "World War II",
        "Normandy",
        "18",
        "Windows Modern Standby",
        "13,026",
        "50",
        "12,569",
        "2022",
        "LCD",
        "a couple years ago",
        "256 gigabyte",
        "CNC",
        "1800p",
        "MacBook Air",
        "MacBook",
        "Dell",
        "16 gigabytes",
        "3.09 pounds",
        "Valheim",
        "850",
        "900",
        "15",
        "HP",
        "Xbox One",
        "only $850",
        "2.8",
        "Andy",
        "a year",
        "13000",
        "the Wi-Fi",
        "Iris XE",
        "1440",
        "first",
        "16 inch",
        "two",
        "USB Type-C. Love",
        "900p",
        "2,400",
        "GPU",
        "2050",
        "this morning",
        "3050",
        "XPS",
        "HP Command Center",
        "Cinebench",
        "SD",
        "CPU",
        "13,000",
        "eight",
        "SSD",
        "Crab Rave",
        "Xbox Series X, S",
        "PS4",
        "1920",
        "Jake",
        "RAM",
        "QuickSync",
        "Rocket League",
        "one",
        "Yoga",
        "the Gen Z",
        "Microsoft",
        "96",
        "only four",
        "Windows Modern Standby",
        "3,200 megahertz",
        "51 watt hours",
        "PS5",
        "2.16 gigahertz",
        "1200",
        "1080p",
        "ShortCircuit",
        "six",
        "First",
        "YouTube",
        "five",
        "2050",
        "Apple",
        "Intel",
        "One",
        "Specter",
        "40",
        "14",
        "six hours",
        "Cinebench",
        "Four",
        "IO",
        "2880",
        "a fantastic day",
        "dozens",
        "Two",
        "about six hours",
        "XPS",
        "20",
        "Realtek Wi-Fi 6",
        "12,420"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "EVENT",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}