{
    "id": "-YxfCyGgYVI",
    "title": "Rare Macintosh Quadra Prototype Hits eBay (and I Got It!) - Krazy Ken’s Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-08-04T16:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=-YxfCyGgYVI",
    "category": "Science & Technology",
    "tags": [
        "Rare Macintosh Quadra Prototype Hits eBay (and I Got It!) - Krazy Ken’s Tech Misadventures",
        "Macintosh Quadra",
        "Quadra 700",
        "Jurassic Park",
        "Samuel Jackson",
        "System 7",
        "Mac OS",
        "Apple Prototype",
        "Mac Prototype",
        "eBay",
        "Vintage Apple Computer",
        "Vintage Mac",
        "Rare",
        "Apple",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "Computer",
        "Computer Clan",
        "Spike PVT"
    ],
    "views": 110331,
    "likes": 4960,
    "comments_count": 382,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below This Macintosh Quadra 700 (aka the Jurassic Park computer) landed on eBay, but it's special it's a prototype (codenamed Spike).  iMac internal software episode   iBook G3 prototype   See more rare tech    Download our epic wallpapers   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Did you like the wallpaper on the iMac in the background? There's a whole pack designed by Ian Zelbo (RendersbyIan)   (affiliate link)  Batteries for vintage Macs   Battery tester   Multimeter    Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/YBhN7kn8j-g",
        "https://youtu.be/_BkdIqacnKo",
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://gumroad.com/a/209727315/vaxwm",
        "https://amzn.to/3oSNlka",
        "https://amzn.to/3vAJJXW",
        "https://amzn.to/3JyGEgL",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Hey, guys! I'm almost ready to show you this really cool prototype Apple Macintosh Quadra 700. The same computer that was in \"Jurassic Park.\" I just have to win the eBay auction, and then, it will be mine. Thankfully, my new Klone Ken is helping me snipe it. All right, Klone Ken, what's the status? Hold on to your butts. - [Computer] Uh uh uh, you didn't say the magic word. - Gosh, dang! I hate this hack of crap. No! Someone sniped us while you were diddling around. Look, I can't help it sometimes. I'm just really good at hacking, and sometimes, I hack myself. (Ken sighing) I'll be back with you guys in a sec. Sponsored by Linode. (techno music) Hey, guys. How are you all doing? If you're new here, welcome. My name is Krazy Ken, and we lost. I wanted to show you this really cool, really rare Apple Macintosh prototype, but we didn't win the eBay auction. Hey, Ken. What? There's another one on eBay. Should I get it? Yeah, do it. Hold on to your butts. Stop saying that. All right, we got it. I chose the yesterday shipping, so it should be there by now. Oh, perfect. Well, now that we have this in the lair, let's take a look at it. Oops. Ken, there's one problem. What? Well, its \"for parts are not working\", so it might not work. (sighs) What am I paying you for? You don't pay me (beeps). Fair enough. Anyway, we've been through worse before, so we'll just have to make do with what we have. It'll be fine... Right? Here it is everyone. The rare Quadra 700 prototype is finally here. The same model of computer that was in \"Jurassic Park.\" The movie where Nedry was talking to someone over a \"live feed.\" (laughs) It was just a prerecorded video file. Yeah, movie magic. It was the early '90s. It's fine. So before we dive into this prototype more, a quick history about the Quadra. So the 700 was the first model. This is the beginning of the Quadra line. It was the first Mac to ship in a tower style case, which was really just a IIcx case flipped vertically with the labels rotated. And at launch, this was a $6,000 computer. It has a 25 MHz Motorola 68040 processor, and it could support up to 68 MB of RAM. I have more than that on my wrist today. We have a lot to be grateful for. So the eBay listing said its four parts are not working, and that it's untested. I don't want to be a Karen here, but if I were selling this for upwards of $1,000, I would take a little time out of my day to test the thing. But hey, what do I know? So let's take a look at some of the distinguishing features of this prototype that you don't see on the public retail version of these computers. And then, we'll see if it works, and see if there's anything on the hard drive. So apparently, this thing was codenamed \"Spike.\" I think that's kind of a fitting code name for a computer that was used in a movie about dinosaurs, right? So that's kind of fun. And on the back, it also says PVT, which is production validation test. That's a later stage of prototyping, and depending on the situation and depending on who you talk to, some people may not consider that a prototype because the computer at that stage is nearly complete, or sometimes, complete and ready for retail. I've heard stories of some companies selling PVT units if stock is low. And here's another unique thing about this case, and you might have already noticed it. It doesn't say the name of the computer on the front. That's another telltale sign of prototypes, at least in the Apple world. Sometimes when Apple does placeholders, they'll do X's, for example, like on the PowerBook XXXX. However, that other Spike PVT prototype that was on eBay actually had the name silkscreened on the front, but that was likely a later-stage computer. And we can deduce that by looking at the serial numbers. My buddy, Steve from Mac84, looked up the serial number and crosschecked it with the one on eBay. Thankfully, the seller had a photo where you could see the serial number. There was only a one-letter difference from this prototype and that prototype. So that owner likely received both of these prototype units at the same time. This model is slightly older than the other one on eBay. So that could be a reason why this has an incomplete name on the front, but the other one has the name on the front. Back to the serial number, super quick. When you look it up, you'll see it's from early August. And that's another great indicator that this is the prototype, because these didn't go on sale to the public until October. And another thing that always gets me curious is when you see a peeled label, makes you think what was there before. It's definitely bigger than the typical Apple asset tag labels. So yeah, not sure what that could have been. All right. Let's bust this, oh (beeps)! It's much heavier on top there. So let's bust this baby open, and take a look at the insides. It's actually not too dirty. Obviously, there's a lot of dust here. We'll wipe that out soon. But let me take you on the 50-cent tour. Here, we have the power supply. Here, we have the hard disk drive. Under there, I'm assuming is the floppy disk drive. That's our Motorola 68040 processor. That's the CPU with its nice heat sink. Apple isn't a big fan of fans. They'll have a fan in the power supply, but that's it. There's no other fans in the whole system, just a heat sink. Hello? You see what I see? No, you probably don't. I'll bring you in closer. These are the ROM chips, so that's July 19, 1991. The ROMs were made a whole month before the serial number dates. So that's kind of cool to see those earlier dates on there. This is actually different. These are soldered on ROM chips. The other one on eBay had a red ROM stick in this slot. It's a little disappointing that I don't have a cool red card in here. It's just blank. But it's also cool that it's different because in that unit, those onboard chips aren't soldered there. Anyway, continuing with our tour. Here's the RAM. It looks like there are, underneath here, four more RAM sticks that are occupied. Looks pretty good. All right, I'm just gonna give it a quick dusting here before we get too far. I forgot to get excited about this. I was so busy giving you guys a tour, I didn't even realize there's a fricking hard drive here. A lot of times when I get prototypes, not only do they not work, but they usually, they either don't have a hard drive or they have a replaced hard drive. This looks like the original. It says EPROM 1991. And I'm not trying to be a downer, while I'm dusting this thing, but typically, internal information would get purged from a prototype system in advance, but not always. And sometimes, there are other weird ways internal software leaks, like in my iMac episode with that build of Snow Leopard. There was a lot of internal stuff on that computer. I will get the rest of that caked-in dust in a sec because we have to take this carrier out, because the battery needs to be replaced. This is just good practice. If you have an old Mac, it's probably a good idea to put a new PRAM battery in there. Batteries will corrode over time. And if they leak, some people say it's a matter of when, not a matter of if. When they leak, they will F up your logic board. So it's best to just take them out and leave them out if you're gonna put 'em into storage. Or, at least, put in a fresh PRAM battery. And if you need to get some fresh ones, I have a link in my description, and I also recommend having a battery tester for two reasons. One, you can test to make sure the battery you just purchased isn't a dud. Green. That's good. But also, you can test the old battery, which we'll test the old battery in here, just to see if it has any juice left. Well, I found a popcorn seed? I have no idea what the heck this is. We'll save that for later if anybody's hungry. Power supply has to come out. But thankfully, this is quite modular. You don't even need tools. It's not screwed in, it's just held in with friction. There we go. One power supply box. Complete with fan. We'll dust this bad boy off a little bit later. There's a little tab right there. And then, the one Phillips screw we got earlier there. (battery clanking) There we go. The battery, which looks like it has a date of March, 1991 on it. So it's over 30 years old. Should probably take it out. Little flat-head screwdriver on the positive end of the battery here. Poke her in. And the plastic case should just pop right up. Should just pop right up. (laughs) There we go. Now, let's take a look. At quick glance, I don't see any corrosion. For grins and giggles, let's just see how the charge is. I'm guessing, after 30 years, it's not gonna be very much. It's saying, \"Replace the battery.\" Should we follow its advice? Yes, of course we should. Yeah, we'll take that out there. We'll pop that in there. Okay. Feels secure again. So now, I'm going to just, where's my trusty towel? Wipe down this dusty stuff and put it all back together. Ah, nice and clean. We'll plug everything into it, turn it on, hope it works, and see what's on that fricking hard drive. Okay. We're all set up. I paired it with the Apple Desktop Bus Mouse II, and the Extended Keyboard II, and this beautiful Apple monitor. So, let's hope it works. (dramatic techno music) Oop! Forgot to take my pill. One sec. Okay, that's all taken care of. What kind of pill was it? Use your imagination. Okay. Now, boot it up. Whoa! Yo! It works. Oh, might help if I turn the monitor on. Might help if I plug the monitor into power. Oops. (gentle guitar music) Okay, now that the monitor power is plugged in, let's do it for real. So far so good. Hard drive's cranking away. Happy Mac. That's good. Oh, this is interesting. It's showing the extensions and everything here, but it's not showing an actual boot screen. Hmm. I don't think I've ever seen that before. Okay. Hmm. Someone had windows open. Well, clean this up for now. Okay, black menu bar. That's interesting. Is that a setting? 'Cause normally, it's just white. This one's black. Hard disc\" and it has the Adobe logo on it. Was this used by Adobe? Or did the user just want to put an Adobe icon on there? Created September 17, 1991, about a month-ish before this retail product actually went to consumers. About this Mac, System 7.1. Okay. Got that. How much RAM is in here? 20 megabytes. Okay. So let's explore the system. Let's see if there's anything internally on here. We have a ClarisWorks 2.0 folder. Jane's folder. Kathleen, Courtney, Rich, Kid Pix, Pamela. So I'm guessing there were multiple users on this system. COPYright Pro, never heard of this before. Management science associates based out of Pittsburgh. Okay. Okay, so I'm not seeing anything else too crazy in the System folder. Let's move to these people's, I'm guessing, user folders? We'll go to Courtney's folder here, but it looks like we have a lot of ClarisWorks' documents. Courtney resume. Oh, interesting. I'm kind of curious. I wanna poke at this, but I won't show anything too sensitive. I'm just trying to find out who might have owned this particular PVT system. Okay. So Pennsylvania. That copyright application was also from a company in Pennsylvania. Not sure if that's a coincidence or not. Chadds Ford Merchant Group is the license for ClarisWorks. Here's another thing that says Pennsylvania. And so, this was probably in Pennsylvania at one time. Okay. Now, this looks like a homework assignment 'cause it says a teacher's name or something, but then it says, \"pd. 7.\" I'm guessing, period seven. \"Short Story #6. March 7, 1998.\" That was years after this computer came out. Maybe Apple just sold it at one time 'cause they needed inventory. I don't know. Okay. Well, let's take a look at another person's folder. Let's do Rich. Yeah, another thing in Pennsylvania, submitted by Sage Resources. Hey, Sage, you're inside my computer. That's so cool. How'd you get in there? And see, now we have like Kid Pix on here. So it's like, there's like university stuff, teacher stuff, but like you probably wouldn't be using Kid Pix at a university. So was this also used by a child? Like? (jazz music) So there's still one more hardware thing I want to test, but I just wanted to update you guys. I was poking around the file system, really trying to find more stuff. I was searching other keywords like \"classified\" or \"internal\" just to see if there's any internal documents on here. I even searched the word \"Apple\" just to look at all of those results, and scrolled through the file system a bunch. And I just couldn't find anything really exciting. So, I'm sorry. There's nothing classified or special on the hard drive. Hardware-wise, there's one more thing I want to try. So the eBay listing said it was untested, so I'm wondering maybe they didn't really test it 'cause they couldn't get it to turn on. And I'm wondering maybe the dead battery prevented the thing from turning on. Probably not, because old Macs can still boot with dead PRAM batteries, at least in my experience, or at least really low-charged PRAM batteries. But I'm gonna swap the battery for fun. Right? And just see if the system works with the old battery in it. All right. Let's try it out. Still works. I guess the system always worked, just the eBay seller didn't want to take the time to test it, I guess. Wanna crash it? (computer pinging) There we go. (laughs) I pressed that developer \"interrupt\" switch on the front, and when you do that, you get the nice, Sad Mac crash screen. That's always fun. (computer pinging) I don't know, why is he dead? Maybe he's hungry. That's the code. See? Food. You forgot to feed him. Your Tamagotchi died. Dead Tamagotchis aside, I would love to thank Linode for sponsoring this episode. And if you have an app or a website that you need to get off the ground, Linode has the infrastructure and the 24/7 support for you. And I don't know, maybe you need to write custom software for a dinosaur park. Like they were doing in the movie. Maybe they would've succeeded better if they had Linode. Just saying. Linode offers out-of-box apps for game servers like TF2, CS:GO, and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click one of the signup buttons. And when you do that, we'll give you a 60-day $100 credit just for watching this episode. And also, when you do that, you're supporting the Computer Clan. So, thank you very much. So I hope you guys enjoyed checking out the Spike PVT prototype with me. It's a little bit of a bummer that we didn't see anything internal on the hard drive, but there's always next time. And feel free to subscribe for more tech episodes coming out every week. I love making episodes about rare and retro tech, new tech, and of course, scam tech. And hey, if you like this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (techno music) (logo chiming) You know, all this talk about \"Jurassic Park\" made me wanna watch the movie again, so let's enjoy it on Blu-ray. Oh.",
    "transcript_keywords": [
        "Apple",
        "hard drive",
        "prototype",
        "battery",
        "system",
        "computer",
        "Spike PVT prototype",
        "eBay",
        "hard",
        "prototype Apple Macintosh",
        "Apple Macintosh prototype",
        "drive",
        "Apple Macintosh Quadra",
        "thing",
        "Linode",
        "Klone Ken",
        "Apple Macintosh",
        "test",
        "time",
        "Ken"
    ],
    "transcript_entity_values": [
        "Motorola",
        "October",
        "two",
        "PVT",
        "68",
        "Karen",
        "30 years",
        "700",
        "1991",
        "Sad Mac",
        "Short Story #6",
        "four",
        "one",
        "Spike PVT",
        "6,000",
        "Quadra",
        "25",
        "Blu-ray",
        "1,000",
        "Apple Macintosh",
        "Steve",
        "Sage Resources",
        "years",
        "Quadra 700",
        "Apple",
        "Linux",
        "100",
        "60-day",
        "Phillips",
        "Jurassic Park",
        "the early '90s",
        "Joomla",
        "first",
        "Chadds Ford Merchant Group",
        "iMac",
        "Nedry",
        "about a",
        "the Apple Desktop Bus Mouse II",
        "the PowerBook XXXX",
        "Linux",
        "Linode",
        "September 17, 1991",
        "Apple Macintosh Quadra 700",
        "early August",
        "sec",
        "Macs",
        "ClarisWorks",
        "Ken",
        "Adobe",
        "COPYright Pro",
        "Snow Leopard",
        "the Extended Keyboard II",
        "Pamela",
        "24/7",
        "Sage",
        "TF2",
        "PRAM",
        "today",
        "Krazy Ken",
        "Pennsylvania",
        "month-ish",
        "CPU",
        "Courtney",
        "seven",
        "20 megabytes",
        "ClarisWorks",
        "a whole month",
        "Pittsburgh",
        "Minecraft",
        "the Computer Clan",
        "July 19, 1991",
        "30 years old",
        "Kathleen",
        "every week",
        "eBay",
        "Mac",
        "Klone Ken",
        "Jane",
        "Kid Pix",
        "RAM",
        "Yo",
        "50-cent",
        "One",
        "yesterday",
        "signup",
        "Linode",
        "March 7, 1998"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "FAC",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "FAC",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE"
    ]
}