{
    "id": "0-3zf2EY-cU",
    "title": "This Laptop is from the FUTURE - Nexdock Touch",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-10-30T19:09:39Z",
    "video_url": "https://www.youtube.com/watch?v=0-3zf2EY-cU",
    "category": "Science & Technology",
    "tags": [
        "Lapdock",
        "Laptop",
        "Smartphone",
        "Desktop",
        "Mode",
        "Samsung",
        "Nexdock",
        "Future",
        "Technology",
        "Minamalist",
        "Mobile",
        "Device",
        "USB-C",
        "Connection",
        "Keyboard",
        "Touchscreen"
    ],
    "views": 796591,
    "likes": 35293,
    "comments_count": 2042,
    "description": "Get your free 32GB Flash Drive & 32GB Micro SD Card at  Get the best prices and best selection at Micro Center:  Micro Center Community:  Micro Center Custom PC Builder:   Connecting your smartphone to your laptop isn't exactly new but having it be the brains of your \"laptop\" is fairly interesting, especially since it's almost as fast as your a mid-tier laptop.   Check out the NexDock 2 Touch at   Buy Samsung S20 Smartphone On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://rebrand.ly/ea62pxh",
        "https://rebrand.ly/j6slcz3",
        "https://rebrand.ly/6ankfr7",
        "https://rebrand.ly/rx0om8v",
        "https://lmg.gg/rtLiz",
        "https://geni.us/yMQOkP",
        "https://geni.us/E1UHl3",
        "https://geni.us/c7HrJs",
        "https://geni.us/Fc9AY",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- When is a laptop not a laptop? When it's a lapdock. This is the NextDock Touch, NextDock Two Touch. I forget if it's something like that. We've reviewed the NextDock Two on Linus Tech Tips, last year? I forget exactly when it was. Editor, will tell you now. And when we did that video, I was like, I like doing these kinds of products where it's like it doesn't really make a ton of sense for the average person, but it's something that makes you think. It's something that makes you imagine a future where we're all flying in cars and it's a utopia and there's people trying to hunt down Androids and retire them by force because they're getting becoming sentient. You know, that kind of thing. So the NextDock Two was really cool but the one thing that we really wanted it to have, that it didn't have yet is a touch screen. So this one apparently has a touch screen and it's added, it's kind of refined the design a little bit more. So, as usual, there's no knife to open these things. So I'm using James's screwdriver. Ooh, I almost stabbed myself. I didn't even say what this thing is. It's a lapdock, which means that there's no laptop brains inside, there's no computer in it. It's just a shell, to which you are supposed to connect like a phone or a Raspberry PI. You'll see, if that doesn't make sense. I'll show you, don't worry. It's really cool, okay. Ooh. Oh, okay. So that was a somewhat unglamorous way of dumping all this stuff out, but This is like a micro USB to USB-C. It looks like an HDMI to micro HDMI adapter, cool. These are all power adapters for various regions, I believe. Okay, so there are still cords. Here's a USB-C to C, which we need to connect the phone. HDMI, USB-C to micro USB and USB type A. So that is for a Raspberry Pi, or a similar kind of micro PC device. I like this packaging, hey? You got the saw you got the closed cell foam. Not only that, but they also, have What do you call this air pocket? What would I what would you call this? Inflatable pool toy packaging, a life preserver, a lapdock preserver. Quick start guide. Okay, let go, let's just look through this real quick. Just do some light reading, just so I know. You don't wanna see my knees, Andy? Look, it's beautiful. Help! So right away, I noticed that they may be listened to us. One of the things we said about the other NextDock, the pre touch NextDock, was the fact that the finish on it felt kinda rough. Like, they did this kind of like, blasted aluminum look that you know, it looks like a MacBook type of thing or a ZenBook or whatever you wanna do. But if it felt a little rougher than you'd expect and this feels already a bit smoother, so that's nice. Nice job, NextDock. And, let's look at the ports. So can you see that, Andy? We've got the same ports, it looks like. One HDMI, which is how you would connect to something other than a smartphone to put a video onto the display. And actually you can connect anything with an HDMI output. You can kind of connect game consoles, other things with HDMI upwards, I guess, a computer, I guess a regular PC. And then you have three USB-C ports, which are all meant for different things. So, this one is for charging. This one is for, I believe for the Raspberry Pi. And I think this is a multi-use one. You can use it for Raspberry Pis and for like data. And then this one is to connect your smartphone. On the other side, we have a USB three type A port, a headphone jack, and a micro, yeah, micro SD card slot, nice. Very nice. They really took some measures to protect this thing. Like it had that extra layer of like, bump protection and now they had, they had a keyboard protector and a plastic screen protector. That glossy screen looks nice. It looks nicer than I remember on the other one. Okay, the feel is pretty similar to the original NextDock. One thing that I said about it was that I thought the keys were a bit large and I think that appears to be the case here as well. I don't know how that. Aren't I aren't like laptop keys kind of a standard size? But it's not anything horrible, like obviously if you know how to type on a keyboard, you can still type, It's just like, Oh, I don't need that, I don't need that much space. What are you trying to say about my fat fingers, NextDock? Wow, is this track pad even bigger than the last one? I feel like it is. And also again, the finish on it is a lot nicer, so nice to see that, NextDock. Nice, job. One other thing I wanna say about the physical design before we get into it, is this little notch here. This wasn't here the last time. Can you see that, Andy? This thing? They added a little nipple nubbin. It doesn't have a webcam. This is like a little vent. I can see that there's a vent there. I don't know whether that's input or output, probably output. But I guess maybe this also serves a function of allowing a little more air pass through there. I don't know. Okay, so it's time to turn this thing on. But before we do that, it's time to talk about our sponsor, guys. Micro Center, get the best prices and best selection at Micro Center, at any of their 25 locations across the United States or online. Join the new Micro Center community to give and receive advice on PC parts selection and hardware. Also check out their custom PC builder configurator. And if you follow the link below right now, you can get a free 32 gig flash drive, and a free 32 gig micro SD card, valid in store only, no purchase necessary. Check 'em out. It's time to plug stuff in. I got a Samsung Galaxy S20 5G. Now in case you're wondering why the heck you would ever want something like this, we kinda go over it in the LTT video. So you should definitely watch that if you haven't seen it. Basically the NextDock is a dream, for those who, you know, want to realize a future where you can have all of your personal info and all of your like PC stuff that you need on your phone. Power, okay, so there's a light, there's an LED light. Editor, pull up a shot of the NextDock Two non-touch edition bezels. 'Cause they were a lot thicker. That was one of the main things that we had a problem with on the first model, in addition to the texture stuff. Now, granted, they can make them that thin because there is no camera. So that's one of the things that you're losing. Although, you have a phone. So if you really need a webcam, and it's plugged in like this, boom, you got a, get over yourself. And right away, you know what? Before I do anything crazy, I wanna hook up this magnetic mount as well. What am I looking at? Okay, so we're putting it on. Here we go. That seems about right. And now, we put the phone on. I should've put it higher up 'cause I'm seeing, there's a bit of a, there's a bit of a bending, bendy cord problem. Ooh, that is a, that's a very unfortunate sort of a situation here, where it's like, okay cool, look at your, your phone mounted there. And then you can't really have it at a certain angle before it starts falling back. Or you could just keep it there. I'll just keep it there forever. Can I have another internet window? Aha, I can! So you can have two browser windows open side by side. This is another big thing I wanted to talk about. The touch pad. On the original NextDock Two, the touch pad had this weird like acceleration problem. Like you would swipe over and the mouse would just kinda keep going. And they appear to have fixed that. This is a lot more snappy. It doesn't feel like I'm like out of control. I definitely felt like I could not do things with precision. Nice job, NextDock, thank you. Okay, cool. The last thing I wanted to do is to take a look at the bottom, because, I opened up the last one and I want to see whether there's any major changes. So, let's do it. Let go of your, (laughs) Oh, this is different. This is two-cell battery. It says 60.8 watt hours, which is a lot, well, the last one had 52. I think originally, the NextDock Two was gonna ship with like 40 something, and then they upped it to 52 watt hours. And now this one has a 60.8 watt hour. Great job. Oh, you're here. I just wanted to show you that I took this off. Are you proud of me? - [Alex] Ughhh - For the first time, I've never touched this laptop and I took it off, are you proud of me? - [Alex] What the hell is this laptop? - Are you proud of me? - [Alex] I'm proud of you, Riley. - Good, God! It's a lapdock, it's not a laptop. Have you ever heard of that? - [Alex] Yeah, so it's like a stamp bottom. They didn't CNC it. - You're getting, wait, what? - [Alex] Why? - What why? - [Alex] Why so much expensive? - Why? Wait, what do you mean? You don't even know how expensive it is. Yeah, it's 269 for this thing. - [Ales] I bet. - Yeah, I mean like you could get a Chromebook or you could just like get one of these and you could plug your phone in or a Raspberry Pi or a whatever you want. (banging on machine) Ah, that's not right. That's the way, that, that's, the build quality overall, has improved in this version. But, there is still that kinda feel of like, \"Hey, we're like a startup, you know, we're trying to prototype quickly and get some of these things out to people who are, who are really trying to tinker around with new ways of computing.\" And that's cool, I think that's cool. But know that, you know, it's 269. For a relatively high-end build you know, there are some things like when you take the panel off the edge is a little bit sharp and there's a little bit of flex to the panel. But I mean, I don't know. I think these kinda tinkerers who like, go for this kinda thing, are they really complaining, I dunno. - [Linus] But it manages to do so with a claimed, zero addition of-- - That's plenty loud. What's that? - [Linus] And, the exact same TDB as before. - What? - [Linus] On top of that, aim (pop music) - Okay, so they're, you know, they're not super great laptop speakers or whatever, but they'll do, I mean, like I've heard a lot of laptops speakers that are worse. Okay, well I'm impressed. I mean, it seems like NextDock has improved on most of the things that we had an issue with last time. The texture is a lot smoother. The track pad responsiveness is a lot better. The bezels, the big fat bezels are gone. There's touch support, bigger battery. I, I'm impressed. Nice job, NextDock. I, you know, this gives me more faith that this kind of future where we all have just our phones as our main computing devices is maybe a bit more realistic than it seems. Even if, even if Samsung might be the only phone manufacturer, really putting a desktop mode in their phones. And NextDock, you appear to basically be the only manufacturer doing these. I've seen a few other ones, and like there's been some on Kickstarter and stuff, but like, they haven't really gone to fruition. So even if you guys are the only people who seem to be really pushing this future, I think it's a future worth pushing. And keep pushing, pusher. All the way to the bank. Probably not, but maybe. 269 bucks, not bad. And you know what else wouldn't be bad? If you checked out more of Short Circuit's videos. 'Cause we're making these how many are we making, three or four a week? I don't wanna promise that. Tweet Jono, if we're short on videos. You can get real mad at him. And after you do that, come back here and subscribe to Short Circuit, 'cause I'll miss you, what? Hey, you ever heard of \"Carpool Critics,\" movie podcast? It's a thing. Subscribe to that. I'm on it. Tech Linked. (background chatter) It's okay. (laughter)",
    "transcript_keywords": [
        "NextDock",
        "thing",
        "kind",
        "things",
        "micro",
        "Touch",
        "nice",
        "HDMI",
        "phone",
        "bit",
        "laptop",
        "Micro Center",
        "Raspberry",
        "micro USB",
        "cool",
        "lot",
        "USB",
        "USBC",
        "connect",
        "time"
    ],
    "transcript_entity_values": [
        "Linus Tech Tips",
        "32",
        "60.8 watt hour",
        "last year",
        "micro HDMI adapter",
        "three",
        "One",
        "USB-C.",
        "ZenBook",
        "60.8 watt hours",
        "40",
        "one",
        "Riley",
        "USB",
        "Chromebook",
        "Nice",
        "NextDock Two Touch",
        "micro SD",
        "Micro Center",
        "269 bucks",
        "52 watt hours",
        "Andy",
        "NextDock Two",
        "Samsung Galaxy",
        "LTT",
        "a Raspberry Pi",
        "Tech Linked",
        "NextDock",
        "269",
        "Samsung",
        "the NextDock Touch",
        "Raspberry Pis",
        "first",
        "two",
        "Kickstarter",
        "Tweet Jono",
        "Short Circuit's",
        "the United States",
        "Short Circuit",
        "Carpool Critics",
        "CNC",
        "USB-C",
        "52",
        "the Raspberry Pi",
        "Androids",
        "jack",
        "James",
        "MacBook",
        "zero",
        "25"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "FAC",
        "CARDINAL",
        "CARDINAL"
    ]
}