{
    "id": "0-7yqUaRGIc",
    "title": "Unboxing Razer's New Smallest Keyboard! - Huntsman Mini",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-29T18:59:10Z",
    "video_url": "https://www.youtube.com/watch?v=0-7yqUaRGIc",
    "category": "Science & Technology",
    "tags": [
        "Razer",
        "Mini",
        "Keyboard",
        "Gaming",
        "PC",
        "60%",
        "Form Factor",
        "Small",
        "Optical",
        "Switches",
        "PBT",
        "Keycaps",
        "Customization",
        "Custom",
        "RGB",
        "Colors",
        "Colours",
        "Clicky",
        "Desk Space",
        "Huntsman Mini",
        "Linear",
        "Click",
        "Switch",
        "Synapse"
    ],
    "views": 764124,
    "likes": 24072,
    "comments_count": 1380,
    "description": "Join us in War Thunder for FREE on PC, PS4 and Xbox One:   Get an exclusive bonus using our link - thanks for supporting the channel!  Razer launches their first keyboard in the 60% form factor for people who just want the basics or their desk space is limited, also it has optical switches. What size of keyboard do you prefer?    Buy Razer Huntsman Mini Keyboard  On Amazon (PAID LINK) at  On Best Buy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://gjn.link/ShortCircuit",
        "https://geni.us/bGy0Og﻿",
        "https://shop-links.co/1725432053106517443",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So many boxes today. Okay. What is all this crap? It's Razer's new Huntsman Mini keyboard from their Huntsman line. Now they have a 60% keyboard joining the line. A 60% keyboard is a small keyboard. It has no numpad, no function row, no navigation keys like Home and End, no arrow keys, it's just the alphanumerics. Pretty cool, pretty tiny. Let's look at it. But what's this other crap? I have some extra keycaps. We'll get to those in a bit. And some special boxes? I haven't even opened these. I can only guess what's inside. And I can also further guess that this is not available to the public, so is it even worth unboxing? Right after this message from our sponsor that we might as well just get over with already, right? Today's video is brought to you by \"War Thunder\". \"War Thunder\" is a free-to-play online military vehicle combat game. It's available on Windows, Mac, Linux, PS4 and Xbox One with cross-play. It features an incredible arsenal of over 1,500 historically accurate playable tanks, aircraft, helicopters and ships from the 1930s to way up to the 1990s. It's got massive combined arms battles on over 80 major battlefields from World War II to, you guessed it, the end of the Cold War. So head to the link below and start playing \"War Thunder\" for free, at the link below. And you'll also get an exclusive bonus. What's this? This is just a wooden box, some kinda metal hinges. There's a button on the front. Ooh! Huh? Okay. Cool. It is a keyboard. And it's personalized. How do I get you outta here? Oh, this little pull-tab maybe. (laughs) It says ShortCircuit on it! That is cool. Again, I'm pretty sure you will not be able to get this. Definitely can't get a ShortCircuit one. But here's the keyboard. What else do we have in this box? \"Dominate on a different scale.\" Ha, cute writing. \"Our first 60% keyboard, available in Razer clicky or improved linear optical switches.\" Improved. \"Experiencing lightning-fast actuation in our most compact form factor yet. For Gamers, By Gamers, Razer.\" Also comes with a bag, which undoubtedly holds the USB-C cable. There it is. It has a nice Razer cable tie. Flexible. Multiple steps. USB-C on that side. USB-A on that side. And it's white, matches the keyboard. Now, what do we have in our other wood box? Huh? Is it a black one? Huh? Yes it is. Okay. Cool. Let's see if I can do this trick twice. Oh, this one actually just comes out like normal. This is the clicky one. (keys clicking) Black cable, black cable tie and even black little... What do you call these, hats? Condoms? Wait a second. Whoa, that's sweet. There's actually little grooves in this channel that correspond to female grooves on the plug so that there's no risk of the cable getting yanked in this direction, which would bend... Bend the end. That is just a nice step for longevity and durability, things that Razer has not traditionally been known for. So good for them for trying to rebuild their brand in that respect. Here they are. But that's not really a complete unboxing 'cause that's not the box you guys are gonna get, so why don't we just rip through here really quickly? This is the clicky option in this box, which they call Purple. Their linears are also called Red. Cherry-style. Ow! That really hurt. This key is too girthy-endy. Okay, inside this much more simple box, your keyboard actually comes with plastic around it, shrink-wrapped. And again, the black one's clicky. Now, the Mercury, or white color, and the black color are each available with either the clicky or linear. You can mix and match. It's just by coincidence that both my blacks are clicky. Look at all these keyboards. And we also have... Yeah, there's the cable for that one. And a little bag of books here. \"You've got a great device in your hands, complete with a two-year limited warranty.\" Serial number. Oh, and look at that on the back, that's nice. It says, \"For Gamers. By Gamers,\" over and over again like some kind of Bart Simpson chalkboard punishment, which is cool, it's on the bottom. It's like when the inside of your clothes, like the inside of your hood has a nice, neat pattern that you don't see that often. You get that on like dress shirts sometimes by the cuffs or in the collar and it's just a nice touch even though it's seldom seen. There're stands set for 6-degree and 9-degree tilt configurations. I mean, they're both nice. I would probably go black, but it depends on your style. If you have a white case or a white mouse already or your monitor, yeah, they're both nice. So... Where to begin? How 'bout the feel? How 'bout the feel? (keys clicking) Now, these are a lot quieter than previous Huntsman keyboards. I understand that they actually made an adjustment to the switch where they... Basically, underneath that plus sign that you see there, there's a column, a tube. Inside of that tube they place dampeners. They used to have this metallic kinda ping that had this kinda roll-off on it, you know, when keyboard are like, \"Bing.\" They used to have that. It's not so bad anymore. So the linear switches require 40 grams of force to actuate and they just bottom out, of course, 'cause they're linear. There's no tactile bumper or anything in them. And these are optical switches. They say that they're a little bit faster. They have fewer mechanical moving parts, so they should have higher durability, be more consistent. The issue with it, though, is that these switches could come out, you still couldn't pop in any other switches other than just, I guess, maybe the linears, like whatever that Razer provides, you know? Whereas if you just got a normal mechanical keyboard there's just myriad switches available, thousands of them, all different types, you can really get into it. With this, you're kinda just married to what you get. If what you get is good then stay married to it, whatever. These keys are pretty consistent. And then on the clicky side... (keys clicking) These sound okay. Not the best sound I've ever... These only take 45 grams of actuation force. This is still a gaming keyboard. You really don't have to press very far. I feel like I could get my shots off pretty immediately. All right, so why get a 60-percenter? Two reasons, really. Either aesthetics, if you have a really clean setup, if you want everything to be minimal. And the second reason to get a 60% is if you are the type of person who has a low-sensitivity mouse and you're playing shooters and you just need a lotta space for your mouse arm to whip around, it can be nice to not have that extra stuff on your keyboard so you don't have to reach as far. You have more desk real estate and you don't get as much shoulder strain. Actually, a third reason is portability. It's way easier to put a 60-percenter into your backpack and go to a LAN party or an esports tournament than it is a full-sized keyboard. Productivity wise, it sucks not having a numpad. For me, it sucks using second functions, but Razer says you lose no functionality on this keyboard because all the second functions are available on a secondary layer. And you can see where they are by looking at the side-printed legend on these keys. I wanna plug this in 'cause I wanna see if the light shines through there. And no, it looks like the side-printed legend is just on there. To be fair, I don't think I've ever seen secondary functions be lit up, so... Now, you can see the light is shining through these other keys, and that is because these are double-shot injected which means that the black area you see here is one layer of plastic and it would've had a hole in it for the words. And then there's a second layer of plastic which is white, you can see it. Therefore you can never scratch that off. There's no way to scratch this off. It's impossible. You'll wear through your fingers first. Another thing is that these are PBT plastic and so they're not gonna get shiny. You know when you use a keyboard for a long time and you don't wash your hands between eating and gaming, what happens is that the plastic degrades and you get this shiny look on the most commonly used keys. That's not gonna happen to these, so that's nice. I guess this is a good time to talk about these other sold-separately keycaps that we got here. They're mostly just different colors. These are black. Razer Green. Mercury White and Quartz Pink. So if you wanted to have a black chassis with white keycaps or vice versa, or if you wanted to just, what I think looks cool, just have a certain number of them swapped out so you kinda of have like a half-and-half look, like panda-style, I think that can look really cool and striking. Is this really necessary? Oh yeah, all the little stabilizers and... Oh man, they're like vacuum-sealed in here. It's like they're tofu or something. See, the issue with these is that they don't have the side printing for your secondary functions. I mean, I guess that's kind of understandable, and for 30 bucks this is actually a decent value. Oh, and you get a keycap removal tool, so wow. I don't know how well the Quartz is gonna go with this black. They're kind of opposite pallettes. Yeah, that looks pretty bad. (laughs) I think I shoulda put it on... Let's try it on the white one. Yeah, this is already so much better. Ah! That's nice. It's cute. When you have the colored keycaps like this, though, I feel like you're a little more limited with what RGB colors you can choose because some colors, they just don't look great when they're shining through. And so you might wanna just restrict yourself to something that looks good with the color. Like I don't feel like the red going through here looks very good. So like basically any keyboard you can get, it has N-key rollover, it's got anti-ghosting. It actually, despite being a 60%, it has a standard bottom row, which is nice. Sometimes these get kinda screwed up and things are moved around, this is standard. It also has a game mode so that your Windows key won't come up in games. There's even media keys on the secondary row. The one thing that you can't do onboard, despite being able to have five keyboard profiles that you can save on-device and despite there being some default RBG settings, as you saw me cycle through, on-device, there is no ability for you to create a new RGB profile and then save that to your device and take it somewhere. You can make your own custom RGB profile, but you have to do that in Razer's Synapse software and then it'll save to your account on Synapse. So if I brought this keyboard somewhere else I would have to plug it into that machine, get Synapse on that machine, log in, and then I could have my profile again on this. But the build quality is pretty nice. It's got an aluminum faceplate on it here. And you don't really get that much deck flex with these as is. So it feels pretty stable. It's not as fat as that CandyBar keyboard I had a little while ago on ShortCircuit. And for weight, we're looking at 430-ish grams, which is like... That's fine. It's pretty average in terms of weight. I wouldn't call it heavy for its size, or really too light. It's kinda normal. Pricing-wise. Kinda weird. $120 for the clicky version, making it the cheapest in the Huntsman lineup. However, an extra $10 for the presently unavailable linear version. Weird that there's a price difference. I think it's because they just revamped the linear switches from their previous iteration, so maybe they had to cover some R&D costs or something there. But 10 bucks difference. Not the cheapest keyboard out there, but it's Razer, so what did you expect? It's not a groundbreaking device, but it's cool. You'll probably like it. I don't know if they're gonna last in the long term. We'll have to wait and see. But you get a two-year warranty, so whatever. If you're a fan of Razer, if you wanna use your Razer Chroma lighting effects with all your other devices and your supported games and you want a 60% keyboard, then this is the one to go for. So thanks for watching ShortCircuit. If you liked this video you might like our other previous review of the CandyBar keyboard that came with a cool kind of DIY kit, and that is a good foot in the door for enthusiast keyboards. If you want something that's plug-and-play, then this is the way to go. Bye.",
    "transcript_keywords": [
        "keyboard",
        "Razer",
        "nice",
        "kind",
        "War Thunder",
        "black",
        "cool",
        "Huntsman Mini keyboard",
        "Pretty",
        "War",
        "white",
        "clicky",
        "keys",
        "switches",
        "nice Razer cable",
        "linear",
        "cable",
        "box",
        "Gamers",
        "good"
    ],
    "transcript_entity_values": [
        "Synapse",
        "120",
        "Synapse",
        "Razer",
        "DIY",
        "PS4",
        "Razer",
        "Razer Green",
        "one",
        "USB",
        "1,500",
        "CandyBar",
        "Xbox One",
        "two-year",
        "60%",
        "Today",
        "World War II",
        "second",
        "40 grams",
        "\"War Thunder",
        "RBG",
        "today",
        "Windows, Mac",
        "80",
        "430-ish grams",
        "Linux",
        "LAN",
        "up to the 1990s",
        "9-degree",
        "third",
        "60-percenter",
        "Huntsman Mini",
        "the 1930s",
        "Bart Simpson",
        "thousands",
        "Purple",
        "first",
        "the Cold War",
        "Razer",
        "Quartz",
        "Razer Chroma",
        "War Thunder",
        "Razer",
        "45 grams",
        "30 bucks",
        "linear",
        "Huntsman",
        "Huntsman",
        "Two",
        "RGB",
        "ShortCircuit",
        "five",
        "Mercury",
        "10",
        "6-degree",
        "the secondary row",
        "Home and End",
        "10 bucks"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "PRODUCT",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "EVENT",
        "ORDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "EVENT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY"
    ]
}