{
    "id": "07tkIbbLH_Y",
    "title": "World's Smallest Android Phone!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-17T20:20:02Z",
    "video_url": "https://www.youtube.com/watch?v=07tkIbbLH_Y",
    "category": "Science & Technology",
    "tags": [
        "android",
        "google",
        "smallest android",
        "smallest smartphone",
        "smartphone",
        "android smartphone",
        "posh",
        "posh mobile",
        "micro",
        "micro x",
        "s240",
        "worlds",
        "tech",
        "technology",
        "unboxtherapy",
        "iphone",
        "review",
        "unboxing",
        "unbox therapy",
        "apple",
        "phone",
        "best",
        "iphone 6s",
        "android (operating system)",
        "samsung",
        "galaxy",
        "new",
        "iphone 6",
        "iphone 6s plus",
        "apple iphone",
        "6s",
        "test",
        "camera",
        "iphone 7",
        "vs",
        "smartphone (video game platform)",
        "apple iphone 6s",
        "s7",
        "galaxy s7",
        "apple inc. (publisher)",
        "s7 edge",
        "galaxy s7 edge",
        "gadgets",
        "edge",
        "plus",
        "mobile"
    ],
    "views": 4081333,
    "likes": 60986,
    "comments_count": 4644,
    "description": "Follow my Twitter - htto://twitter.com/unboxtherapy Posh Mobile Micro X S240 -  Phone sent to me by -   This thing is insane! It's easily the smallest phone I've ever handled. Welcome to miniature Android.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1U8HyhA",
        "https://www.instagram.com/cellzrepairz/",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lou here back with another video. And it doesn't get any less exciting here at Unbox Therapy. Today I am bringing you The World's Smallest? Possibly? Android Smartphone? That's what I'm told. This is the Micro X S240. Company called Posh Mobile.com This was sent to me from a guy named..Tom. What's up Tom? I will link them down in the description. He sent me 3 of these units, so I guess I'm gonna do a give-away as well follow me on Twitter for details there. Maybe you want the smallest smartphone on the planet. Why wouldn't you? Specs: 4 GB ROM, 512 MB of RAM, Dual Core Processor, Multi touch. Well I hope so, hope it's got a touch screen. *LAUGHS* 2 MP camera and a VGA front camera - Listen, It ain't always about specs. Maybe you have a different agenda. It's for a very specific type of individual. So... Ooh Get out of town! Look at this little guy! This would be cool for a kid to have. Hello? So there's your little display on there. Camera on the back, speaker here. Micro USB on the bottom for charging. Microphone Now it does look like the rear is removable here. Let me see.. I don't have the fingernails necessary I don't think. Theres a bunch of stuff, what do we have? Basic little headset with microphone Micro USB cable, Power brick Let's try this again. Come on Lou, use your muscles. So here we go, battery goes in. Come on battery... Little bit of juice Give us something Ooh POSH Mobile So...POSH Dare I... *Woosh* This little guy I mean.. Here is the set up Yes, this is small Oh my...*Laugh* Look at how small the keyboard is Do you see that?...What do I... Oh man... What do you need for this? A little pen or something Look at that! It's a real phone Very dimly lit capacitive buttons The brightness of the screen is surprising, I didn't expect it to be that bright. The main thing here is just how small it is. Benjamin Button He's a li.. I think he get's smaller as time goes on He still needs a phone Phone, messages and contacts by default You scroll over here... little skin on this android it looks like Browser, clock... camera! *oOoOo's* Did that work? I think... Yea! *Chuckles* Just a little delay! Hello to the world From 1999 Ooo...I think i'm getting better Maybe not... You're not going to want to write a novel on this guy here *Laugh* Man..Look at that tiny little Youtube player Is the orientation locked here? There we go! Speakers not terrible! There you can see it...How do they get it all in there? I dunno how they get it all in there.. Galaxy Note 5 Wow...It's the smart car of phones! If you're a... little different kind of person This might be just what you're looking for Cause I like to suprise people... In weird ways... Wow... What is this? This is the quietest I've been...This is mysterious",
    "transcript_keywords": [
        "Unbox Therapy",
        "Micro USB",
        "guy",
        "Dual Core Processor",
        "camera",
        "Posh",
        "Micro",
        "Tom",
        "phone",
        "video",
        "Ooh POSH Mobile",
        "Laugh",
        "Posh Mobile.com",
        "called Posh Mobile.com",
        "microphone Micro USB",
        "smallest smartphone",
        "Therapy",
        "small",
        "Lou",
        "Smallest"
    ],
    "transcript_entity_values": [
        "Dual Core Processor",
        "RAM",
        "VGA",
        "Galaxy Note 5",
        "Micro USB",
        "1999",
        "Today",
        "Lou",
        "Multi",
        "GB ROM",
        "512",
        "Benjamin Button",
        "3",
        "Twitter",
        "4",
        "Youtube",
        "2",
        "Posh Mobile.com",
        "Tom"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON"
    ]
}