{
    "id": "0abWMwwCtQw",
    "title": "The DUMBEST Thing About HDMI (EDID)",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-01-01T18:03:57Z",
    "video_url": "https://www.youtube.com/watch?v=0abWMwwCtQw",
    "category": "Science & Technology",
    "tags": [],
    "views": 600233,
    "likes": 34364,
    "comments_count": 1144,
    "description": "Sign up for Private Internet Access VPN at    What is EDID, and how can it cause HDMI problems?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/TechQuickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It used to be that trying to hook up something to a TV or a monitor was like dumping garbage onto a truck. You'd plug in some analog cables and the TV would just show whatever it was sent. If the picture looked off in some way, such as having weird colors or being the wrong size, it was up to the user to troubleshoot the problem. But these days, most digital screens and video sources will support a standard called Extended Display Identification Data, or EDID. The purpose of EDID is to allow devices to talk to each other and share information about their own capabilities, so both devices are on the same page. And the basic way it works is that when two devices are connected by a protocol that supports EDID such as HDMI or Display Port, the display will tell the source device its manufacturer, model, and supported resolutions and color spaces. The source device will then take this information and output a video signal which fits those parameters which is part of how auto settings on something like a game console works. Once the source receives the EDID information from your screen, it can automagically output the game at the correct resolution and color space, and even enable HDR, if appropriate. Or at least that's how it's supposed to work. Like many other things in tech, the addition of processing to make setup more convenient introduces a number of things that can go wrong. One minor annoyance is because EDID data has to be processed at every point in the device chain, you might experience longer delays if you're routing a source device through a receiver. So be prepared for some black screen time when you first turn everything on. But larger issues can also arise. You see, because modern interfaces like HDMI feature hot plug support, meaning you can plug or unplug it while the system's running, the connector has a special pin to detect when it's being hot plugged. When a device detects a voltage on the hot plug pin, it starts the EDID process. But sometimes, devices don't read the hot plug signal in the same way, as it can be implemented inconsistently, so the EDID exchange never happens. And as a result, you get a blank screen, as one device in the chain may think it's not connected to anything. But even if you're not struggling with your setup completely refusing to work, equipment coming with incorrect EDID information coded in is a more common problem than we'd all like. A device like an A/V receiver might actually be capable of accepting a surround sound signal, yes, EDID works with audio too, but thanks to bad EDID information an attached device like a set-top box or a Blu-ray player might not send it along since that particular receiver doesn't say, \"Hey, I can support Dolby digital plus.\" Frustratingly, this is often a firmware issue caused by programming oversights meaning that a hapless home user can't just easily fix this on their own. And actually, a similar culprit was behind the recent issue in which certain Sony TVs couldn't display a Dolby Vision signal at 4K at 120 hertz which of course, was disappointing for owners of a gaming PC or an Xbox Series X. You see, EDID actually has character limits which appears to keep these displays from telling the video source what it supports because the just support so much stuff, now. Other times, devices might receive the correct EDID information but not do the correct thing with it. For example, a computer plugged into a display knows, through the EDID, that the display can support a large range of resolutions and a range of refresh rates. But instead of picking the native resolution at the highest refresh rate possible, it might default to something completely different, meaning you have to go into the settings, yourself, and adjust everything, which kind of defeats the whole point. If you're having problems with the EDID, there are special EDID emulators that you can program yourself, to ensure the correct information is being passed along. But of course, it's often easier simply to take a minute and check that the settings you can adjust are the way you want them. It's a little annoying that we haven't figured out how to make EDID work correctly without intervention every time, but hey, we also haven't figured out how to make self-checkouts not totally suck. So (claps) here we are. So thanks to Private Internet Access for sponsoring this video. PIA's a tool that masks your IP address and encrypts traffic on your devices. You can combine it with private browsing tools to even make savvy websites think you're somewhere else. They offer reliable service with over 12,000 servers in 74 countries, and no bandwidth caps. They have configurable encryption and an internet kill switch prevents data from leaking should you be involuntarily disconnected. Their MACE feature blocks requests to known malware and tracking domains all together, so you are safe. Try it risk-free with their 7-day money back guarantee. Right now, they're got clients for Windows, Mac OS, Android, iOS, and Linux to get you connected up to five devices at once. You can check them out at PrivateInternetAccess.com/techQuickie. So thanks for watching, guys. If you like this video, hit Subscribe, give us a thumbs-up, and be sure to hit us up in the Comments section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "EDID",
        "EDID information",
        "device",
        "source device",
        "Extended Display Identification",
        "devices",
        "monitor was dumping",
        "dumping garbage",
        "Display",
        "correct EDID information",
        "information",
        "make EDID work",
        "Display Identification Data",
        "source",
        "supports EDID",
        "EDID works",
        "EDID work",
        "support",
        "EDID data",
        "plug"
    ],
    "transcript_entity_values": [
        "EDID",
        "74",
        "Private Internet Access",
        "One",
        "Linux",
        "Display Port",
        "one",
        "4K",
        "MACE",
        "PIA",
        "7-day",
        "Dolby",
        "PrivateInternetAccess.com/techQuickie",
        "Extended Display Identification Data",
        "12,000",
        "Dolby Vision",
        "Subscribe",
        "Blu-ray",
        "Windows, Mac OS",
        "first",
        "these days",
        "Sony",
        "HDMI",
        "two",
        "120",
        "up to five",
        "Android",
        "a minute"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME"
    ]
}