{
    "id": "0aFhzGEBQlk",
    "title": "Trinitron: Sony's Once Unbeatable Product",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2017-12-30T15:28:24Z",
    "video_url": "https://www.youtube.com/watch?v=0aFhzGEBQlk",
    "category": "Science & Technology",
    "tags": [
        "Trinitron",
        "sony",
        "TV",
        "CRT",
        "aperture grille",
        "shadow mask"
    ],
    "views": 2168822,
    "likes": 62339,
    "comments_count": 3468,
    "description": "You can support this channel on Patreon!  Link below Throughout much of the analog television era, Sony was the fairly undisputed king of TVs.  Their Trinitron picture tube was a universally well received technology and made a number of important improvements on the standard color picture tube.  This is the story of its creation.  **The trinitron CRT wasn't impervious to Moire patterns.  However, it was less prone to them because of the lack of a phosphor grid.  Vertical misalignment could still occur with the aperture grille, so moire patterns could still appear on patterns with strong vertical stripes.  However, moire patterns wouldn't appear with horizontal image components due to the lack of distinct phosphor groupings.  **The patent expired in 1996, not 1998.  You can support this channel on Patreon!   Thank you to all my current patrons! Charlie Quigley, Tommi Hares, Dakota Williams, Eitan Tal, Brendan Sheehy, Jay Foreman, James Id, Howard Longden, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, twiglet, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Sam Hodge, Matthew Rossi, Paul Craigie, Chuck Floyd, Sophie Haskins, Alex Smith, Paul Williams, Ashleigh R, Stephen Bell, voodookidney, rn Arnarson, Eric Wood, Stephen Pick, Stephen Vrazel, Paul Fisher, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Ellis M. Eisen, Francis Fisher, Kedar Deshpande, Boris, Bill Basch, Lukas Komischke, Dave Anderson, Felix Freiberger, Dane Peterson, Brent LaRowe, Aerospyke, Kieran Cox, Hunter Schwisow, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, Bjrn Vegar Torseth, Yaniv, Teague Chrystie, Steven Hidy, Marinus Swanepoel, Matt Falcon, Kevin Landrigan, Evan Papp, Jason Weathered, Richard L Stoer, KrzysFR, Sage Kitamorn, Ma rie, jolyan g shaba, Stephen Youndt, Steven First, Gianluca D'Orazio, Martin Granestrand, Andrew Dousay, Rod, Cori Rozentle, Steve Page, Kevin Cheek, Daniel, Jeffrey, Jason Nevins, U.H., PaulKT, Gabriel Frncu, Athanasios Kountouras, Nathan Casteel, Gerald Monaco, Piotr Mardziel, Randall Gaz, Dennis Mossler, wsh, h.drew foy, Martin Hansen, Nicolas de Cosson, Edwin ster, Nathan Weetman, Bruce Williams, Matt Harrison, Steven Crowson, Anthonio Pettit, Paul Ziegler, Stephen Furness, Joseph, Marty Connor, Wesley Van Pelt, Lorenzo Novara, Lee Lemoine, John Trevick, Elliot King, Paul Anderson, Gustaf Lindblad, Carl Yazbek, Nicholas, Matthew, Daniel Mann, Harald E. Westlie, Daniel Newton, urbanhusky, Henri Hyyrylinen, James Holmes, Neil Hopwood, Duncan Middleton, Conor Killeen, Tyler Knott, Slone Fallion, seagull, Sarah Symon, Tab Patterson, Philipp Thomasberger, Gustavo Carballeira, SkydiveWeee, Alex Smith, Tyler, Jernej Virag, Nolan Johnson, Samuel Kadolph, Robert Toth, TM , Kasper Guldmann, Lorenzo Stanco, Michael Shick, David Hollister, Jon Payne, Steven Willis, Neema Mostafavi, Thomas Jew, Joe Bond, Eidorian, Nikolaj Srensen, Jesper Hansen, John Kesson, cpb, Anonymous49856739245764, Jason Ganiatsas, Jess R. Robles, Bruno AFB, Till Bockemhl, Les Freed, Andrew Roberts, Colin Theys, Aric Vogel, Steven Metcalf, Cordite, Yaroslav Veremenko, Verysofisticated, Sean Yem @ ThisTechUK, Dorin Paslaru, Chris Lidyard, John Fielding, Lolucoca, Adam Coddington, Steven Clarke, Sven Almgren, Matt Standish, John McLusky, Nathan Campos, MAtt Whitehorn, Xavier Crespin, Tex Arcana, Sina Farhat, Bitcore, Ramsey Rodriguez, Brain G. Shacklett, Cotton Aubrey Hooke, Paul Mills, Dave Rahardja, Corey Dunn, Josh McCulloch, Eric Rivas, Kelly Rose, Christopher Luna, Guillermo Rodriguez, Sergey Kiselev, Kotanu, Brendan Terrett, Jason McMillon, Nick Krabbenhoeft, Tiago Pereira dos Santos silva From Porto, Portugal, Matt Greer, Jesse Cardone, Techmoan, Matt Leach, Mike Mason, Brendan Denney, Justin Welches, Clara Latter, Padrino, Elijah Reeds, Christopher Jett, Ingo Ruhnke, Justin Talbot, Francisco Vogliotti, Steve Perkins  The image of the Chromatron Television was used under Creative Commons License.  Photo by Patfass",
    "description_links": [
        "https://www.patreon.com/technologyconnections",
        "https://commons.wikimedia.org/wiki/File:Sony_Chromatron.jpg"
    ],
    "transcript": "In 1960, the fledgling Sony company in Japan decided to get into the television business. Their first foray into television was a remarkable achievement in and of itself, being the first completely transistorized television. The TV8-301 wasnt really a commercial hit, but it was a technical feat. And just a year later, Sonys dealers were putting pressure on them to develop a color TV Sony was understandably reluctant as color TV sales at the time were abysmal in Japan, but the sales department managed to exert sufficient pressure on the engineering department to actually start work. Sonys visit to the 1961 IEEE trade show resulted in a glimpse of the Autometric companys Chromatron tube. This picture tube worked in a completely different fashion than the shadow mask picture tubes of the time. Rather than use three electron guns and a matrix of holes to create the separation like the standard shadow mask picture tube did, the Chromatron used a single electron gun combined with a vertical grille of electrically charged wires at the front of the tube. In essence, the Chromatron relied heavily on electronics to focus the electron beam onto the correct color. The beam was normally focused onto the vertical green phosphor stripes present at the front of the screen. But the deflecting wires, placed about a half inch behind the phosphors, could push the beam to either side, and light up the adjacent phosphor stripe. The pattern of these phosphor stripes on a Chromatron tube, sometimes called a Lawrence tube, were arranged as RGB - BGR. This was necessary due to the way the deflecting wires worked. Without a charge, the beam wouldnt be a tightly focused and would light all three phosphors together. But by placing a charge between pairs of wires, you would get both a tighter beam and the ability to push it left and right to control the alternate colors. Placing a single green stripe between two reds and two blues made this easier to accomplish, as the direction the beam was pulled would reverse as it crossed each pair of deflection wires, as their individual voltage potential remained constant. Using an RGB-RGB pattern would require constantly reversing the wire grids charge, which would be a nightmare with the electronics of the time. Already there was a lot of added complexity, as with a single electron beam, it needed to be precisely modulated when producing a color image to ensure it fired with the correct intensity as it repeatedly changed what color component it was illuminating. The huge advantage of this chromatron tube was a much brighter picture than conventional tubes using a shadow mask. Even though it used just one electron gun, none of the beams energy was lost with this system, as all of it passed through the focusing wires. The Chromatron also benefited from minimal required convergence tweaking. This made the Chromatron tube much easier to configure in the factory, and less likely to experience convergence problems requiring adjustment over time. Remember, this was only seven years after the first color television was mass produced, so were dealing with brand new technologies with patents and licensing to go along with them. Sony saw both the better picture results of this tube and the possibility to skirt around licensing costs and leapt at the chance to take over the project. Sony bought the entire Autometric operation from Paramount Pictures, who was behind it. But theyd soon discover that while the Chromatron tube was a fabulous device once built, it was a veritable pain in the ass to produce. It took until 1964 for the first Chromatron television to actually be mass produced. And Sony sold each one at a loss. They were put on the market for a reasonable 198,000 Yen, but cost 400,000 Yen to build. Thats obviously not sustainable, but Sony had faith that if they just stuck with it, they could get the manufacturing costs down by perfecting the process as the production line matured. Well, they couldnt. It continued to be a nightmare. So in 1966 Masaru Ibuka, Sonys president and co-founder, led the way to find a replacement for the Chromatron. Part of the reason was that General Electrics Porta-Color TVs had introduced an improved shadow mask design and new arrangement of electron guns. These picture tubes moved the electron guns from a triangle arrangement to an in-line arrangement, and shifted from the dot-pattern of the original CRT designs to the vertical triad design you see here. The result was a much brighter picture that was close to what the Chromatron was producing, and also eliminated many of the convergence problems conventional shadow mask tubes suffered from. So now Sony was stuck with a money-losing product that wasnt that much better than the competition. The engineers at Sony would alter some of the ideas from the Portacolor and merge them with the Chromatrons design. Susumu Yoshida asked engineer Senri Miyaoka if the three in-line electron guns could be replaced by a single electron gun with three individual cathodes, as this could decrease the cost of manufacturing. Turns out, yes you could! This initially made for focusing challenges, but they were eventually solved. The other big development in this new tube was similar to the Chromatrons wire grille. The Chromatrons electrically charged wires were altered into whats called an aperture grille, which was fundamentally similar but didnt require an electrical charge. The aperture grill was more of a single metal sheet with slits cut vertically through it, though it is sometimes still referred to as being made of wires. The grille separated the color components by blocking their path much like the shadow mask, but kept the vertical phosphor orientation of the chromatron. The aperture grill was very simple and very effective, but perhaps most importantly to Sonys pocketbook, was unique enough for it to be patented! This new picture tube was called the Trinitron, and it was better than what any of the competition were producing by a wide margin. Introduced in 1968, these televisions were more expensive than the competition, but were universally well received. In fact, Sony received an Emmy award in 1973 for the invention of the Trinitron. But what made the tube so great? Lets compare a Trinitron tube to a standard shadow mask tube. So, when you put a Trinitron display side-by-side with a conventional shadow-mask display, the most obvious difference is the shape. A Trinitron tube has a distinctive appearance due to the geometry of aperture grille vs. the shadow mask. A shadow mask tube has a near constant curvature across the face because the angles the three electron beams approach at to create the individual Red, Green, and Blue color components need to be consistent across the whole face. The center of the tube is aligned with the electron guns in the back, but the edges need to curve outwards to keep the inside face more or less perpendicular to the source of the beam. A Trinitron tube, meanwhile, only curves side to side. It doesnt curve vertically, producing a distinctive, cylindrical shape. This is actually a requirement of the aperture grille. The aperture grille is fundamentally simpler than the shadow mask, as it only needs to block the electron beams in the X dimension. Three separate beams arranged in a line can be separated with just a slit. With the green beam in the center, it can pass straight through. But the red and blue beams can only pass through the left, and right, respectively. But this arrangement requires the slits in the grill to always be perpendicular with respect to the three beams linear arrangement, in other words the grille had to always stay completely vertical, as any tilt to the left or right could cause cross-over and youd get messed up colors. We all know from Ghostbusters that you shouldnt cross the beams! So, Trinitron tubes were designed to only curve in the X dimension, keeping the face of the tube perpendicular to the electron gun along its width, and the beam separation angle constant along its height. The other thing youll notice when comparing a Trinitron TV to a conventional one is a generally much brighter image. This was the signature big deal of the Trinitron. A shadow mask separates the color components through individual holes in a metal sheet. The earliest CRTs using a shadow mask would lose upwards of 80% of the beams energy to the mask itself, with only a paltry percentage actually making it through to excite the phosphors and make the screen glow. This was improved over time through the use of the in-line guns and the triad phosphor arrangement introduced with the Portacolor, but the beam was still blasting its way through tiny slits. This required very powerful electron guns, yet still resulted in a dim picture compared to conventional black and white TVs. The aperture grille, meanwhile, only needs to blocks the beam from left to right to separate the color components. Vertically there is no separation at all, and this allows much more beam energy to pass through it and reach the phosphors. This alone made the phosphors glow more intensely, but the tubes were further helped along by uninterrupted phosphor stripes rather than individual groupings. If you look closely at a Trinitron picture tube, youll see continuous lines going from top to bottom with no horizontal separation at all. When operating you see the stripes broken up, but thats merely the result of the way the image is made via scanning in horizontal lines. As Ive said now on two separate occasions, phosphor groups you see in a conventional tube ARE NOT pixels. This is analog video were talking and any Trinitron display helps to show how this is true by only containing stripes of phosphors. Now do you understand??? Anyway, a conventional tubes phosphor groupings have black lines above and below each grouping. These lines further reduce the image brightness because, well, they dont glow. I mean, thats fairly obvious now isnt it? But they also cause other problems. Conventional color picture tubes would display false patterns, sometimes injecting color where it shouldnt be, when displaying an image with fine patterns. This happens when the displayed pattern is misaligned with the phosphor grid. Because a Trinitron doesnt have a phosphor grid, is was less prone to this occurring, so in many instances a non-trinitron display would produce a Moire pattern or false color, and a Trinitron wouldnt. Perhaps the only downside to the Trinitron tube is a fine stabilization wire needed to prevent the aperture grille from vibrating. If the tube was exposed to loud sounds, the aperture grille could vibrate and produce wild distortions in color. The stabilization wire would hold them together and prevent this, but the wire itself is visible. On smaller tubes like this only one wire is present, about a third of the way up from the bottom, while larger tubes would have a second wire the same distance from the top. To be fair, these wires are barely visible, since they are much finer than any of the scan lines, but they can be an annoyance when the tube is displaying uniformly bright images. In most cases the image displayed would contain enough variation to make the line essentially invisible. Now, the fact that this stabilization wire was necessary may explain the Chromatrons ultimate demise. The charged wires probably suffered from the same vibration issues, particularly since they were so far behind the phosphors. And they couldnt be stabilized as easily as the Trinitrons aperture grill because a wire holding them all together would remove the required voltage differential between pairs. Im willing to bet that the Chromatron would have experienced continually worse problems as larger picture tubes were manufactured, and it would have needed even more R&D to address it. The many advantages of the Trinitron picture tube made Sony the undisputed king of televisions (at least from a quality standpoint) for many years, and they were able to charge a premium for their televisions which many people were willing to fork over. These two TVs show how successfully Sony was with the product. These are obviously made many years apart, but the actual picture tube is virtually the same. It might even have the same part number. Sony was able to keep pumping out the same picture tubes, update the cabinets that held them and the electronics that drove them, and theyd still be better than what the competition offered. From 1968 until 1998, any other manufacturer who wanted Trinitron technology in their televisions would need to license it from Sony, and Sony was plenty happy with just making the TVs themselves and made it difficult to do so, though Apple was notably keen on using Trinitron tubes in their early color monitors. However, in 1998 the patent for Trinitron expired, allowing the competition to make their own Trinitron-like picture tubes without paying royalties to Sony. But, the name Trinitron was still a trademark of Sonys, so they had to fudge the name. Most of these new picture tubes would have some sort of Tron in their title, like Mitsubishis Diamondtron. Sonys timing was pretty good. By the time their patent had expired, LCD and Plasma TVs were beginning to take over. By the mid 2000s, CRT displays represented a tiny fraction of televisions sold in mainstream markets. But for the entire 30 years that Sony held the patent, it was virtually second to none. Trinitron remained important for many years, and in some applications is still the preferred display device. Ill tell you that for watching standard definition content, nothing beats it, and thats why this TV stays here along with my menagerie of obsolete A/V equipment. Thanks for watching, I hope you enjoyed it. If youre new to this channel, why not hit that Subscribe button? And I suppose I should suggest that you also hit the bell? I hear thats important. Id also like to thank all of my Patreon supporters out there. Patreon supporters are allowing me to spend less time in a normal job, and more time making videos for you. If youre interested in helping out, please check out my Patreon page through the link on your screen or down below in the description. Thanks for your consideration, and Ill see you next time.",
    "transcript_keywords": [
        "Trinitron picture tube",
        "Chromatron tube",
        "tube",
        "Trinitron",
        "Trinitron tube",
        "picture tubes",
        "Sony",
        "Chromatron",
        "tubes",
        "shadow mask",
        "tube made Sony",
        "picture",
        "shadow mask tube",
        "companys Chromatron tube",
        "beam",
        "color",
        "electron",
        "Trinitron picture",
        "color picture tubes",
        "electron guns"
    ],
    "transcript_entity_values": [
        "Moire",
        "Susumu Yoshida",
        "just a year later",
        "Sonys",
        "Tron",
        "Three",
        "the entire 30 years",
        "only seven years",
        "Sony",
        "Portacolor",
        "two",
        "Apple",
        "1973",
        "Mitsubishis Diamondtron",
        "Senri Miyaoka",
        "Chromatron",
        "linear",
        "about a third",
        "RGB-RGB",
        "Lawrence",
        "80%",
        "198,000 Yen",
        "Patreon",
        "LCD",
        "Japan",
        "the mid 2000s",
        "IEEE",
        "RGB - BGR",
        "400,000 Yen",
        "Chromatrons",
        "Ghostbusters",
        "Trinitrons",
        "first",
        "Autometric",
        "one",
        "Paramount Pictures",
        "1964",
        "1966",
        "Trinitron TV",
        "many years",
        "Masaru Ibuka",
        "1961",
        "about a half inch",
        "CRT",
        "1968",
        "1998",
        "Trinitron",
        "Red, Green",
        "second",
        "General Electrics Porta-Color",
        "1960",
        "three"
    ],
    "transcript_entity_types": [
        "LOC",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}