{
    "id": "0c_aVmRUfpE",
    "title": "iPhone X: Your Questions Answered! [Hands-On]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-11-01T07:54:15Z",
    "video_url": "https://www.youtube.com/watch?v=0c_aVmRUfpE",
    "category": "Science & Technology",
    "tags": [
        "iphone x review",
        "iphone x hands on",
        "iphone x unboxing",
        "iphone x vs note 8",
        "iphone x impressions",
        "mrmobile",
        "michael fisher",
        "face id",
        "iphone x faceid",
        "face unlock"
    ],
    "views": 414547,
    "likes": 19466,
    "comments_count": 1618,
    "description": "The iPhone X is the most exciting Apple product in years, and it's the reason I titled my iPhone 8 review \"The Forgotten iPhone.\" By now youve seen the iPhone X specs; youve gotten the iPhone X first impressions; and youre gonna get a full iPhone X review very soon. But before I even *start* to make time for any of that window dressing, I'm hitting up what's really important: your questions. Join me as I answer questions from my Twitter audience following my first four hours with the iPhone X, and then hop on over to iMore for the definitive iPhone X review! (MrMobile's full iPhone X review coming soon.)   [SUBSCRIBE]     [ABOUT THE iPHONE X HANDS-ON REVIEW]  MrMobile's iPhone X Hands-On Review was produced following four hours with an iPhone review unit on loan from Apple, in collaboration with iMore. The full iPhone X Review will be published following extended testing with an iPhone X retail device.    [FURTHER READING]  iPhone X Review [iMore]:   Lumia 950 Review [Pocketnow]:    [MUSIC]  Boosted by Cymatix, available at Premium Beat:   A New Departure by Vincent Tone, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.imore.com/iphone-x-review",
        "http://pocketnow.com/2015/12/22/lumia-950-review",
        "https://www.premiumbeat.com/royalty_free_music/songs/boosted",
        "https://www.premiumbeat.com/royalty_free_music/songs/a-new-departure",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] You've seen the specs, you've gotten the impressions and you're gonna get a full review very soon. But first, I'm answering your questions about the most exciting iPhone in years. I'm MrMobile and this is the iPhone X. (upbeat music) I'm not gonna make you wait until the end of the episode for number one, folks. Far and away your most asked question about the iPhone X surrounds its most polarizing attribute, that notch. Specifically, how big a deal is it? Well, this is a question I've actually tackled rather recently on another high profile smartphone so allow myself to quote myself. This is something I expected to be annoyed by every time I looked at the phone but I actually came to like the quirky personality it lends to the design. I like it so much in fact that when I use an app that doesn't automatically scale to fill the whole canvas, I get annoyed at the notch's absence. I feel mostly the same way about the iPhone X. After less than an hour I mostly stopped noticing it and when I did it was more like a pleasant reminder that finally I was holding an iPhone that did something different instead of yet another retread of the iPhone 6. That being said it's early yet and some apps haven't quite adapted to the new forehead in their midst. Also, going landscape in Safari produces this pillarboxing that makes for a real feeling of wasted space unless you zoom in. So, there are rough patches to be worked out for sure but as for me, I'll take bold but strange over symmetrical but safe any day. The next biggest question is all about the feature that makes the notch necessary, face ID. In your tweets, you wanted to know how well it works and whether it's as good as old reliable touch ID or fingerprint scanning. The answer to the first part is the same as it always is. It works very well in the kind of demo situations that require you to fit your face in the phone in the same shot for your camera. Even when the lights go down in the conference room face ID is a champ. And that makes sense since the IR illuminator and dot projectors don't care about the dark. It's fast too. In normal operation it ties with the Galaxy Note 8's iris scanner pretty much every time and it gets even faster if I wanna trade some security and disable the attention awareness tie in. That's the tech that tells the iPhone whether your eyeballs are looking at it. But look, I've been using face unlock since 2015 on smartphones from Microsoft, Samsung and now Apple, and in my experience it always starts great and then gradually worsens over time as you test it in more and more different environments. Now, Apple's technology is more advanced than anything we've seen before but even when it works perfectly, this tech is still usually less convenient than laying a finger on a home button. Even more frustrating, it's actually even slower than it could be since Apple annoyingly makes you swipe to unlock even after it's decided that you are really you. So, on the whole, I don't think this was a good move but only the full review will tell us how well this works in daylight. Speaking of, subscribe to The MrMobile on YouTube so you don't miss it. Displays are the buzzy things to talk about in smartphones today. Thank you slash I'm so sorry Google Pixel 2 XL. So, many of you wanted to know how Apple's first OLED display looks in person. It's quite striking and it's certainly nice to see Apple fans finally getting those OLED advantages. Apple also appears to have tuned this display quite well. It looks better in person than it does in this video because of white balance issues caused by the lighting at the venue. Still, coming as I am from the Android world, this display just seems good to me. After all, the Galaxy Note 8 can get twice as bright as the iPhone X and its Galaxy S siblings have it beat here too. Now, brightness isn't everything and I think the general thrust of your questions was is this display gonna turn out like the disaster that befell Google's latest phones, and I'd have to say that aside from the expected effects as blue shift, I'm not worried about it. You wanted to know how the deletion of the home button affects the day to day. Are the new gestures complicated and how do they measure up to the platforms that inspired them? Well, like so many of my geeky comrades it was Palm that taught me the joys of gesture controls on smartphones those many years ago. And I was so looking forward to getting them back on the iPhone X. But it's a steeper learning curve here. Because the screen goes right to the bottom, there's very little room for a gesture area. So, filling out that edge takes some practice, as does timing out the beats, that mean the difference between swiping home and skidding over into the app switcher. On that subject, you know that cathartic buzz you use to get from flicking away cards to close apps, kiss it goodbye. It's been replaced by an awkward press and hold mechanic. This might actually be a good thing since you were probably doing more harm than good flicking those apps closed manually, but damn it, it was fun. And fun was what I expected from all these new gestures. Instead it's just kind of complicated and weird. I spent minutes trying to get the new reachability gesture right for example. But, but, but, but, but, but let me stress once again that these are first impressions from a four-hour session with the phone. To see how a real pro handles the new software after just a little more time, check out Rene Ritchie's review over at iMore. Finally, not a single one of you asked me about Animoji to which I say good for you. You're all excellent people. You got to admit though, this is kind of fun. - [Rene] I was gonna say something very funny and then I just, I couldn't think anymore. Woo! Woo! Yeah! - [Michael] Cameras, phone calls, battery tests and yes, spec sheets. They're all coming up in the full review once I get my retail device. Keep dropping your questions in the comments below and I'll answer just as many as I can. Again, check out Rene's review at iMore for a way deeper dive than I'll probably ever take. And finally, notice that there's no sponsor on this video, folks. That leaves me these precious few seconds to ask you to please, share it if you enjoyed it. MrMobile needs to grow and to do that he needs help from viewers like you. Until next time. Thanks for watching and stay mobile my friends. (upbeat music)",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "good",
        "Galaxy Note",
        "time",
        "review",
        "makes",
        "full review",
        "questions",
        "question",
        "display",
        "phone",
        "face",
        "Galaxy",
        "works",
        "finally",
        "exciting iPhone",
        "Apple annoyingly makes",
        "notch",
        "gesture"
    ],
    "transcript_entity_values": [
        "iPhone X",
        "Google Pixel 2 XL",
        "Samsung",
        "Microsoft",
        "iMore",
        "Apple",
        "Michael] Cameras",
        "Safari",
        "Animoji",
        "Rene Ritchie's",
        "these precious few seconds",
        "Rene",
        "today",
        "iPhone",
        "first",
        "minutes",
        "Google",
        "those many years ago",
        "years",
        "four-hour",
        "Galaxy S",
        "MrMobile",
        "2015",
        "Palm",
        "Android",
        "the day to day",
        "less than an hour"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "TIME"
    ]
}