{
    "id": "0gZpdU1NPYY",
    "title": "Why the Opal C1 is a great webcam",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-02-07T15:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=0gZpdU1NPYY",
    "category": "Science & Technology",
    "tags": [
        "best webcams",
        "best webcams 2022",
        "how to choose a webcam",
        "opal c1",
        "elgato facecam",
        "elgato epoccam",
        "best webcam 2021",
        "webcam",
        "elgato",
        "dslr camera",
        "dslr",
        "best webcam for twitch",
        "webcam opal c1",
        "opal c1 webcam",
        "opal c1 español",
        "zoom",
        "best webcam for streaming",
        "best webcam for video conferencing",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 250328,
    "likes": 5674,
    "comments_count": 382,
    "description": "If youre looking for a webcam thats better than what you have, whether thats a plug-and-play webcam you may have paid too much for during the pandemic or the (likely) lousy one thats inside of your laptop, weve gathered a few unique and great options, including ones that cost next to nothing.  Read more:    Webcam buying guide:   0:00 Intro 0:29 Opal C1  3:07 DSLR webcam 3:59 Webcams under $200 4:14 Elgato Facecam  4:59 DroidCam (Android and iOS webcam) 5:35 Elgato EpocCam 5:55 Smartphone webcam accessories 6:12 Conclusion  Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22680689",
        "https://bit.ly/3JbKmLN",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Webcams come in many shapes, sizes and prices. But the thing that binds many of them together is that, well, they can be terrible. It looks pretty bad. They are more important to people than ever, but few categories of consumer tech have needed more of an overhaul than the webcam. But that's not to say that all webcams are bad. If you're unhappy with what you've got, or you're buying your very first webcam, I'm gonna show you a few good options. Let's start with a $300 Opal C1, a camera that improves on the webcam formula in some big ways. First off, it's sleek design and sturdy build materials make it stand out compared to most other models. It also has a good camera sensor. It's actually the same 12 megapixel sensor originally used in Google's first pixel phone from 2016. When you put it like that, I know it sounds a little long in the tooth, but in the world of webcams, it amounts to a major boost in quality that outpaces any other webcam I've tried. The picture isn't soft and grainy. Good hardware like this is important. But the thing that separates the Opal C1 from the pack is it's heavy reliance on software to improve picture quality. As practically all smartphone makers have illustrated, software along with some machine learning is crucial for squeezing more out of small camera hardware. In Opal's case, this approach to making a webcam makes it really smart at figuring out the best color accuracy, white balance, exposure, and more without the need to adjust settings manually. If you're one of those people who likes to manually tweak all of the dials, you can do that in Opal's macOS app. Oh, and just a heads up for the windows users out there, Opal says full Windows compatibility won't arrive until late 2022. Back to the macOS app. It can enable some cool features in the C1. It's most effective feature is an adjustable bokeh effect that looks softer and far more realistic than the intense blur provided by most video conferencing apps. Some of my Verge colleagues weren't fooled by the simulated bokeh, but hey, what'd you expect? We're tough critics. I think most people will like the way that it looks though. Opal's focus on software and machine learning gives the C1 some other tricks. It has a feature that can keep your face within the frame. Several other webcams at this point can do some version of this though the face tracking in the C1 is surprisingly responsive. I'm impressed with what the Opal C1 delivers, but some of its most interesting features aren't available yet, like gesture control. The company wants you to be able to drop out of calls simply by holding up the peace sign in front of the camera. Opal also thinks it'll be possible for the C1's microphones to listen for speech patterns, like uh and um that you wanna rely on less often and provide feedback after your meeting. These features seem fun but I'm a little skeptical that they'll work as well as it sounds on paper Opal is showing that software can take webcams to greater Heights, even higher than the company's original ambitions. And that's cool, but the C1 S $300 price is more than double what a lot of typical webcams cost and it doesn't end there. The Opal C1 includes access to its growing suite of software tools for early adopters. But at some point it'll begin charging $4 a month for some features, a subscription plan probably isn't what most people have in mind when they purchase a webcam but the Opal C1, isn't your average webcam. If you have a bigger budget and want the absolute best video quality the next step beyond a C1 is a DSLR. And considering that these can cost more than a thousand dollars, I wouldn't recommend doing this unless you have at least a budding passion for photography. I bought this Olympus at the beginning of the pandemic for about 500 bucks, including the lens. So it is possible to get a web camera ready camera without completely breaking the bank. But here's the thing, even after your big investment you'll likely need to wrestle with a few cables and dongles and mounts, a power supply, and maybe even a new microphone. You'll also need to become an expert of your camera settings to get your setup just right. Some people may like this challenge. And if that's you go for it, the results might be worth it. Several Verge staffers swear by this method. Or they're just trying to get the most out of their indulgences either way they look great, except for when their cameras overheat. If you have a budget of $200 or less I recommend checking out our buying guide where I've compared a handful of webcams in different price ranges to see what's actually worth buying. We've linked that in the description below and we'll be updating it with more 2022 models as they release. One of my favorites from that list is Elgato's Facecam. It sells for 200 bucks and sometimes a little lower and it's just a webcam that's great at the basics. It supports 1080 P resolution at up to 60 frames per second. It has a customizable field of view and it offers a plethora of other settings in Elgato's PC app. It fits in with the rest of Elgato's streamer focused gear. To that end the Facecam has a heat sink to keep its internals cool during marathon streams. Most importantly, if you have decent lighting the face cam produces a clean image that'll be a leap over what a laptop webcam or even many dedicated webcams can deliver though compared to the Opal C1's video fidelity it comes in a rather distance, second place and it lacks a built in microphone. So you'll need to provide one of your own. Okay, despite saving this for last I've been most excited to tell you that there are ways to get a good webcam without buying one. No, it doesn't involved theft. A few app developers out there have figured out low cost or no cost solutions for turning your smartphone into a webcam. And even some slightly older phones out there can deliver better image quality than many webcams. The app that I've used the most is called DroidCam and it works with Android and iOS with Windows PCs. The free version of the app gives you all of the essentials to get started. But aid version comes with extra features like boosting the resolution, letting you rotate the picture or zooming in. This could be a great option for you even if the phone you have might not be all that useful otherwise. Another option if you have an iPhone is Elgato's EpocCam. It lets you easily blur your background or super superimpose yourself onto a different background with its chroma key feature. This will make it will for creators or for people who just wanna keep themselves entertained by imposing themselves onto a pizza or something. The paid version includes support for 10 ADP HDR footage, video filters and more. Outside of a webcam's specs and features one thing I like to have is the option to mount it to a tripod. On my desk I use this Gorillapod, which I like because I can stand it upright or wrap it around a monitor arm. And if you don't have natural lighting to light your face it'd be a good idea to invest in a small key light to stay well lit. I never thought that I'd become so invested in webcams but they're so important to so many people. Now I've gone just a few options to step up your webcam game and whichever route you choose I hope you get the results you're looking for. By the way I brought a power bank and a USB cable if we wanna do like a fun, like guh, you know under lit. Do you have a cool webcam rig at home? Let us know about it in the comments below. And thanks for watching.",
    "transcript_keywords": [
        "Opal",
        "webcam",
        "Webcams",
        "camera",
        "people",
        "features",
        "app",
        "good",
        "Elgato",
        "software",
        "Opal macOS app",
        "thing",
        "quality",
        "feature",
        "face",
        "cost",
        "cool",
        "video",
        "buying",
        "version"
    ],
    "transcript_entity_values": [
        "C1",
        "Android",
        "ADP",
        "2022",
        "Opal",
        "Elgato",
        "Gorillapod",
        "Facecam",
        "Windows",
        "USB",
        "DSLR",
        "more than a thousand dollars",
        "1080",
        "Google",
        "Facecam",
        "up to 60",
        "Olympus",
        "late 2022",
        "300",
        "4",
        "2016",
        "Heights",
        "the Opal C1",
        "webcam",
        "about 500 bucks",
        "One",
        "the Opal C1's",
        "12 megapixel",
        "200",
        "EpocCam",
        "second",
        "first",
        "iPhone",
        "200 bucks",
        "DroidCam",
        "The Opal C1",
        "First",
        "10"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL"
    ]
}