{
    "id": "0HFUFICYoiY",
    "title": "This is HUGE!!! - VIZIO Elevate Sound Bar",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-07T22:00:25Z",
    "video_url": "https://www.youtube.com/watch?v=0HFUFICYoiY",
    "category": "Science & Technology",
    "tags": [],
    "views": 556011,
    "likes": 24027,
    "comments_count": 983,
    "description": "Thanks to VIZIO for sponsoring this video! Purchase the VIZIO Elevate 5.1.4 Sound Bar here:  For all of VIZIOs Top Deals, click here:   Dont forget to follow VIZIO on Facebook, Instagram, and Twitter for all the latest giveaways and sweepstakes!  Facebook:  Instagram:  Twitter:    Buy Sony Playstation 5 On Amazon (PAID LINK):  On Newegg (PAID LINK):   On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy Xbox Series X On Amazon (PAID LINK):  On Newegg (PAID LINK):        On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://vizio.ink/BestBuy_Elevate2",
        "https://www.vizio.com/en/shop/top-deals",
        "https://www.facebook.com/vizio/",
        "https://www.instagram.com/vizio/",
        "https://twitter.com/VIZIO",
        "https://geni.us/jIJHq",
        "https://geni.us/FImjr",
        "https://geni.us/utonP",
        "https://geni.us/jKHve",
        "https://geni.us/kAKD7",
        "https://geni.us/dhShJt",
        "https://geni.us/mfBcO",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Says here, team lift. But there's no me in team or there is a me in team? You know what? I got this. This, oh! Is the Vizio Elevate. It actually has automatically upward firing rotating speakers for a more immersive listening experience and they have sponsored this video on ShortCircuit. Don't mind the LTT set. It was just we needed a bigger one 'cause this thing is absolutely freakin' a monster and we're gonna check it out. I actually need a minute first though, I do not understand this packaging. It's right side up, right? Okay, now we go like this. It's right side up. Now we go like this. It's right side, oh wait. Am I supposed to have it stood up while I open it? Look, this is sideways. Oh, scan here for... A moment please. Welcome to Vizio Elevate easy setup. Unbox it, power it up. Wait, what? That's the whole instruction. I'm just an ape. I don't know how to unbox it. Now the big highlights for Vizio here are obviously gonna be the sound quality, support for Dolby Atmos, and the fact that in a box you are getting an entire and they've specifically instructed me not to say, 5.1.4 speaker setup. So that's five channels surround one channel of subwoofer, and four more channels of upward speakers. And the way they achieve that is of course with those rotating upward firing drivers that I was talking about before. So we'll get to the rears and the subwoofer in a moment here. I really wanna take a look at the Elevate soundbar. Wow, okay, yeah, just didn't quite find the middle there. It's got a nice style to it actually, kind of rounded up the front, pretty minimalistic looking if you're into that sort of thing. So either these end pieces will fire towards you if you're not listening to DTS:X or Dolby Atmos content, or if you are, they'll rotate up so that they can bounce off of your ceiling and sound like they're coming from above you. Can I just say how adorable that is that you don't see any branding on this thing whatsoever. Unless you are actually listening to Dolby Atmos or DTS:X content? So it's like, \"Hey, we're in branded media formats listening time now. \"Turn it up, suckers!\" In terms of mounting, you got lots of options, you got little rubber feet, you got little threaded doodads in here, if you wanted to get it wall mounted, or whatever the case may be. And in terms of IO, you've got everything you'd expect, a couple 3.5 millimeter jacks. Really they still got an optical jack, oh that's nice. Then over here we've got a USB port as well as three HDMI ports. One of these goes out to your TV, it's got support for eARC. So there'll be no compromises in terms of audio quality, as long as your other devices support enhanced audio return channel. And then two more for alternate inputs, which is nice because even now in 2021, there are high end sound bars out there that don't have a built in HDMI switch, which is really frustrating because, because you're using eARC, you actually take up one of the HDMI inputs on your TV. And if you wanted an AV receiver, you probably wouldn't be going for like the clean, simplistic soundbar approach. So it's really nice to have those extra HDMI inputs for all of your devices. Like maybe you're the kind of household that just can't decide whether you want a PlayStation 5 or an Xbox series. Maybe you just need both. Eight inch downward firing driver. And of course, very simple IO. Now, I was a little dismayed when I saw what looked like proprietary connections for the left and right satellite speakers. But it appears that they're actually just little custom packaged RCA cables that are twin so that they're in a nice low profile cable. So I'm happy 'cause that means that if you wanted to, you could extend them and use something else off the shelf if you needed to. But this is a little bit more palatable when it comes to wife approval factor. What I'm really waiting to see now is what the mechanisms like for tilting those speakers up and like, I don't know, is it gonna make that much of a difference? You got 18 drivers in the soundbar. So like, it doesn't matter that much. If some of them go up here, some of them go over there? We're gonna see. Just like the soundbar, the surrounds have a couple of mounting choices. So you can just plunk them onto something with the rubber foot or you can screw the main with the threaded hole right there. I mean, we're just setting this up to audition them. So I'm gonna go ahead and put a little something like that. Okay, I found my remote control. I got my wall mount brackets and screw... I gotta talk to those inventory guys. I keep telling them, you don't have to put a label on it every single stupid thing. It's ridiculous. Okay, fine. Got the two different options for 3.5 mil so you can either go RCA or just into a regular headphone jack. Got the remote. That explains why there's no knobs or adjustment dials on the back of the subwoofer. You change all that through here. Oh or, I mean, I guess there are physical buttons as well. Not everything's on there though, you can pair Bluetooth, volume up and down, power and change the source. But if you want to adjust EQ or set effects or whatever that's in here. Look at that, it's got a little screen. See? Look, Vizio. Hello? To hear the Elevate audio effects we could have actually forced it to simulate the top channels but because the PlayStation 5 doesn't support Dolby Atmos, we had to turn to our good friend the Xbox series X. Now if we're in the menu, I don't think... Oh, look at that! Huh, I didn't even have to open up Forza Horizon 4 in order to get it going. (engine revving) There's no doubt you give up some of the directness of the front firing speakers, but it's a fuller sound. Very interesting. Top firing for this genre, maybe not so much, but you actually don't have to use it. So if we go back into that effects menu, a little bit wide. There we go. (engine revving) We can opt for this. Just get that wider soundstage. Not a bad looking little setup. Of course the mouse pad is integral, lttstore.com. Thanks again to Vizio for sponsoring this video. Thanks to you guys for checking out the Vizio Elevate. Don't forget to subscribe to ShortCircuit so you don't miss all of these videos. All of them. Otherwise you will miss all of them.",
    "transcript_keywords": [
        "Dolby Atmos",
        "Vizio Elevate",
        "team lift",
        "Vizio",
        "Elevate",
        "team",
        "Dolby",
        "support Dolby Atmos",
        "Atmos",
        "HDMI",
        "speakers",
        "nice",
        "firing",
        "Dolby Atmos content",
        "Vizio Elevate easy",
        "HDMI inputs",
        "listening",
        "thing",
        "support",
        "sound"
    ],
    "transcript_entity_values": [
        "PlayStation 5",
        "three",
        "One",
        "one",
        "USB",
        "2021",
        "RCA",
        "a couple 3.5 millimeter",
        "Eight inch",
        "the PlayStation 5",
        "Forza Horizon 4",
        "AV",
        "LTT",
        "IO",
        "18",
        "Xbox",
        "first",
        "HDMI",
        "two",
        "5.1.4",
        "four",
        "EQ",
        "3.5 mil",
        "ShortCircuit",
        "Vizio",
        "Xbox",
        "Dolby Atmos",
        "five",
        "jack",
        "Dolby Atmos",
        "a minute",
        "Unbox"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "TIME",
        "ORG"
    ]
}