{
    "id": "0iEkAy1WcGw",
    "title": "I bought AirPods Max from a SCALPER!",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-12-17T04:33:09Z",
    "video_url": "https://www.youtube.com/watch?v=0iEkAy1WcGw",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Airpods",
        "Max",
        "Headphones",
        "ANC",
        "Bluetooth",
        "New",
        "Linus",
        "Unboxing"
    ],
    "views": 1284222,
    "likes": 55740,
    "comments_count": 4064,
    "description": "So I had to buy the AirPods Max from a scalper to make this video. I sure hope it was worth it.  Buy Apple AirPods Max headphones  On Amazon (PAID LINK):   On BestBuy (PAID LINK):   Buy Bose Noise Cancelling Headphones 700 On Amazon (PAID LINK):   On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy Sony WH-1000XM4 Headphones On Amazon (PAID LINK):  On Newegg (PAID LINK):      On B&H (PAID LINK):  On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/d5La3n",
        "https://geni.us/lygA7",
        "https://geni.us/JCm3zp",
        "https://geni.us/f7RtvA",
        "https://geni.us/tee12c",
        "https://geni.us/6BCT",
        "https://geni.us/5BB789a",
        "https://geni.us/vVkA",
        "https://geni.us/4ZUAMU4",
        "https://geni.us/iq7YCM8",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Apple, what could you possibly be thinking? According to the internet, I'm the biggest Apple hater out there, and yet here I am on launch day with the AirPods Max. Why would you send it to me? - [Jono] We didn't. We bought it. - Oh, we bought them? All right, well, we bought them. So these come in at $550 USD, which means that naturally, in the current environment, we paid, how much was it? - [Jono] $1,200 Canadian. - $1,200 Canadian? - [Jono] Yeah. - All I have to say is these things better be flippin' awesome. I have cloistered myself, I know absolutely nothing about them, other than what is on my spec sheet here. They come in five different colors, so we got the basically black, I guess what this, space gray with a black headband, that's what we've got. They've got eight active noise canceling microphones, and if there's anything I know about Apple's active noise canceling technology, based on my experience with AirPods Pros is that my expectations for this are extremely high. It's got three mics for voice, so two of those are also used for ANC, that gives you a total of nine microphones on these things. And they've got an Apple H1 chip in each ear cup, what kind of carrying case is this? - [David] It's called a bra. - Truly it is, the bra purse. Ooh, I can already tell that that's probably not going to be enough cushion for my head pushin'. I mean, it's one thing for a pair of headphones to be comfortable when you first put it on for like 10 minutes. It's quite another for a pair of headphones to be comfortable when you've been sitting listening to them for, you know, three hours on a super long train ride, or whatever the case may be. All right, that's gotta magnetic dodadamajig there. To Apple's credit, it's fast to put in and take out, I guess. 'Kay, first let's finish the unboxing. 'Kay, lightning charging cable, lightning to type C cable included, no charger, did you see Brazil challenged Apple's stance that including a charger is, or not including a charger, is for environmental purposes. They were like, sorry, what? A charger is sort of fundamental to using the product, you guys are gonna need to include chargers. Okay, we got little paper protectors. This is nice, so nice environmental-friendly packaging. Okay, all right, only twists one way, so that means it's, you know, you don't have to have any like muscle memory for which way it folds to put in the case. The ear pads are removable, it's magnetic. Absolutely freaking love that, nice big drivers in there, although I wouldn't have expected anything less from an audio product that costs $550 USD. Although I do wanna take a second to comment on the price. I saw people outraged about a $550 price tag for these. And I guess if all you've ever known for high-end consumer audio is like Bose QCs, then $550 seems like a lot, but I can tell you from the audiophile community point of things, that's like, wow, well, these are like bang for the buck. Wow, they've even got wireless built in at that price? What is a disappointment from an audiophile standpoint, is you don't even have the option of driving them with an external amp and DAC, so you can see here, the only interface for these, in true modern Apple fashion is, you've got lightning down here for charging, and guess what? That's flippin' it. So if you want to plug them into your, you know, HiFi setup at home or whatever, you might as well just give up, Bluetooth is all. You've got crown kind of wheel and button up here, another button over on what is the right ear cup. I love these nice, clear labels on the ear cups. You see that David? - [David] Oh, yeah. - Not that is how I would evaluate a pair of headphones, but they do look pretty freaking sick. In terms of sizing, I'd say if you've got a super, you'd have to have pretty super small head for this to not go small enough for ya, like I don't think my kids could wear it, but if you're an adult, it should be no problem. And, oh, they powered on immediately. So intuitive, I already figured out how the active noise cancellation works. I just went to like adjust them on my head, and immediately, the exact same noise I expect from my AirPods Pros, the active noise cancellation I think was on by default, so it kicked off, and now I've turned it back on. There's a little bit of hiss, just a little bit. Little bit of that active noise cancellation pressure. They're heavy though, like metal construction has been attempted many times on headphones and rarely well, but to their credit, they're holding really well. - [James] You're holding back. - How about the shake test? Oh, there's a little bit. They got momentum. To the headband's credit, this held up way better than I expected, like usually I can tell very quickly, like oh yeah, there's a ridge running across my head. They've got just enough ear clamp pressure that it might be okay, but like I said, I'd have to really wear them for two hours to see if they eventually fatigue me. Hold on a second, sorry, I'm having a hard time hearing you, just have to turn on the transparency, whoa! To an even greater extent than the AirPods Pros, I kind of feel like I am listening to myself on the radio, can you guys, just tell me, James tell me about how's your daughter doing? - [James] Well, she's a (beep). (crew laughs) She climbs on everything-- - Yeah, okay. You sound totally normal to me, though. It's like, it's damn close, like that's impressive. Okay, so the crown controls, so you turn it for volume control, press once for play/pause or to answer a phone call, twice to skip forward, three times to skip back. This button has a nice feeling to it, actually. And press and hold for Siri. I think it's a little easy to press for my liking, though. Like every time I grab them, I'm like, I'm pressing and holding it, it's the kinda thing that once you own the product, realistically you're gonna get used to it in time, but it adds an adjustment period, that there maybe didn't have to be. - [James] When you put it into the smart case, it makes them go into a lower power state. - Why wouldn't they just go into a lower power state when you take them off your head, like every other pair of wireless headphones in this price bracket? - [James] 'Cause they don't want everybody walking around with scuffed ear cups. - So you have to carry this stupid case around with you? That is completely asinine, why wouldn't you just have, I mean, this is ugh, see, I sit here and I try to appreciate the good things, but then Apple just has this like... Point of clarification, it does eventually go into low-power mode, but it takes two hours to get there? Why don't we just have a button combo for this? I fixed it for you, Apple. Let's pair it to phone, we're going to go with my iPhone because there are some features that work better on iPhone. Apple's spatial audio, 360 degree virtual surround, only works on iPhone. The seamless sharing and switching features are unlikely to work on Android, so this lets you sort of seamlessly switch between your Mac and your iPhone, which is pretty cool, or share an audio stream with another pair of AirPods. Voice activation will be specific to Siri. And the headphones have a lightning port for charging, rather than USB type C, that's not strictly speaking something that is works better on iPhone, but it'll certainly integrate better into the rest of your ecosystem, if you have an iPhone and use lightning for all of your charging. So normally you just bring AirPods close to an iPhone, and it just kind of like magically pops up, do I have to like take it out of the magic case to magically pair? I don't know, yeah, if you just like open up the case of the AirPods it just pairs, so I'm just kind of like making assumptions here. No, magic case doesn't even have that functionality, thanks magic case, smart case, I don't, whatever. Hold the crown, press this, maybe holding them both, is Bluetooth pairing? Oh, wait well, whatever it's here. I don't even know what put it in pairing mode. Why does it not just have a light for pairing mode? Oh yeah, it does, there it is. I think. Okay, whatever, it's connected, magical enough. All right, let's go with songs that you guys are allowed to hear. Can you guys, is it completely noise isolated, like can you guys hear anything? - I can't hear anything. - I can't hear it. - [James] I hear some. - So if I like crank it, and I'm like vibing on the bus or whatever. - [David] I can hear it a bit now. - Yeah, even with transparency mode on, I can't hear a damn thing you're saying, sorry. - [David] I can hear it a bit. - You can hear it, okay. So that's a good sign, when you're trying to build a product with active noise cancellation, one of the first steps is building something with good noise isolation because it's obviously a lot harder to compensate for sound waves that are getting right through it into your ear holes. If you could just block out most of it in the first place, it makes life a lot simpler. And let's just pop into the Settings app. So there's transparency, there's just off, so this is no ANC, but wow, these are really isolating. Like I feel like I'm inside my own head. (person snapping) Yeah, like I can hear it, but it's like, it's like I've got my bedsheets and my pillows like over top my head, and I'm like talking to myself, like I can almost feel the vibration of my voice in my own skull, that's actually kinda trippy. I would definitely have them in transparency mode or ANC all the time, I would never do this. Not really a whole lot to adjust. I'm sure there's third-party apps for EQ, but that's something we can explore in the full review. Make sure you're subscribed to Linus Tech Tips, so you don't miss that. We'll also be comparing to Bose's, what are these, Noise Canceling Headphones 700s, as well as Sony's, I think, these are their Gen four, XM4, yeah? They sound a little better to me in this like off mode, but everything else is kind of weird and trippy, so all right, let's try transparency mode, and can you guys, I'm gonna listen at like sort of a reasonable volume here. Let's see if I can kinda hear you, I can hear myself much better, and I don't actually notice the unnatural sound of my own voice anymore. Jono, how's your dog doing? How's Cadence? - [Jono] Cadence's doing fantastic. - Can't hear a damn word you're saying. Okay, let's try someone else, David. Yeah, tell me about Cyberpunk. - [David] Cyberpunk is a video game that is a hot mess, but I'm enjoying the heck out of it-- - All right. - [David] And I can't wait to go home and play more. - Yeah, okay, so it's usable, I'd still have to turn down what I would think would be my typical listening volume, but it's working. Let's pop it in noise cancellation 'cause this is probably how I would use them the vast majority of the time. So even at a fairly modest listening volume, I'm not expecting to hear a word you guys are saying. James, how was your commute this morning? (James imitates a baby) - Okay, I can tell you're just making noises now 'cause I could see your, I could barely hear that. Were you doing it loud-- - [James] Baby cries, going wah. - Oh, I see. So just like with the AirPods Pros, I'm really impressed with the active noise cancellation, Apple's done a great job of reducing that pressure feeling on your ears, and it works really well. I take issue already with Apple's claims that, what did they call this, the best audio experience possible or on the market, or something like that? They're (beep) not, like... (crew laughs) Within about four seconds, they're not. Why does Apple make me do this? Like if they had said, yeah, they're pricey, because they're made of a solid piece of aluminum for each ear cup, and they have great modern features like high-end Bluetooth connectivity and spatial audio. You know, what do you want from us? They're pricey, they're, you know, $150 more than the competition, deal with it. If that's what they said, I would've been like, fair enough, Apple, I get it, don't call them the best sounding headphones. Yeah, rated for 20 hours of listening time on a single charge with ANC or transparency, up to 20 hours in movie playback on a single charge with spatial audio on, so that's pretty sweet. We're gonna have to try that in the full review. I'm actually kind of excited for that. That'd be pretty sweet, being able to take like a 5.1 setup around with you-- - [James] Atmos. - Atmos, actually. - I think so. - That actually makes sense. Five minutes charge time provides one-and-a-half hours of listening time, that's pretty sweet, so you can top them up, right before you, you know, leave. And 20 hours of talk on a single charge. Man, I would feel like such a douchebag, like walking around having phone calls on this thing. I mean, maybe it's just like, it needs to become, you know, the norm though. Like I'm sure people felt like douches with their AirPods at first. Maybe this will just become normal because lord knows, Apple is not having any difficulty selling the things. First impressions then, build quality feels great. They're surprisingly comfortable. They look outstanding, I mean, you know, it's not like I'm gonna gloss over that. They look absolutely sick, and they sound pretty damn good, even if it just doesn't hold up to what Apple claimed they sounded like. Go get yours for $550, just kidding. They're gonna cost you probably another 250 bucks on top of that because scalpers, (beep) you scalpers. Thanks. Subscribe to Channel Super Fun, wait. (crew laughs) Short circuit, I forgot-- - What? Look, I forgot (beep) channel I was on today, okay? - [Man] Are you telling the scalpers to go Channel Super Fun? - No, everyone. (crew laughs)",
    "transcript_keywords": [
        "Apple",
        "hear",
        "active noise",
        "active noise cancellation",
        "noise",
        "Yeah",
        "noise cancellation",
        "case",
        "AirPods Pros",
        "kind",
        "AirPods",
        "Apple active noise",
        "headphones",
        "ear",
        "pair",
        "active",
        "guys",
        "head",
        "iPhone",
        "audio"
    ],
    "transcript_entity_values": [
        "David] Cyberpunk",
        "10 minutes",
        "AirPods",
        "eight",
        "up to 20 hours",
        "Jono] Cadence's",
        "three",
        "the AirPods Pros",
        "$550 USD",
        "H1",
        "one",
        "550",
        "USB",
        "James] Baby",
        "iPhone",
        "Gen four",
        "Linus Tech Tips",
        "Mac",
        "Bose's",
        "Brazil",
        "DAC",
        "Siri",
        "ANC",
        "nine",
        "three hours",
        "second",
        "250 bucks",
        "Channel Super Fun",
        "David",
        "two hours",
        "Five minutes",
        "Jono",
        "third",
        "my AirPods Pros",
        "Bluetooth",
        "first",
        "Bose QCs",
        "Sony",
        "20 hours",
        "two",
        "Canadian",
        "150",
        "Android",
        "AirPods Pros",
        "the AirPods Max",
        "EQ",
        "James] Atmos",
        "First",
        "five",
        "James",
        "about four seconds",
        "Kay",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "TIME",
        "TIME",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "NORP",
        "MONEY",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "DATE"
    ]
}