{
    "id": "0LrTZfetZNo",
    "title": "How do networks actually work? | Free CCNA 200-301 Course | Video #10",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-08-05T16:38:32Z",
    "video_url": "https://www.youtube.com/watch?v=0LrTZfetZNo",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "ccna 200-301",
        "networking",
        "ethertype",
        "protocols",
        "port numbers",
        "ports",
        "arp",
        "ethernet",
        "tcp/ip",
        "ccna training",
        "cisco ccna",
        "free ccna",
        "ccna study",
        "ccna certification",
        "ccna exam",
        "new ccna",
        "ccna full course",
        "best ccna",
        "ccna fundamentals",
        "200 120 ccna",
        "cisco ccna certification",
        "cisco",
        "ccna tutorial",
        "ccna 200-301 full course",
        "ccna 2020",
        "ccna course for beginners",
        "200-301",
        "ccna lecture",
        "free ccna video",
        "ccnp",
        "cisco certification",
        "cisco training",
        "cisco ccna 200-301",
        "network engineer"
    ],
    "views": 73162,
    "likes": 1897,
    "comments_count": 146,
    "description": "How do networks actually work? Lots to discuss here! DavidBombal.com: CCNA ($10):  support the mission, join thisisIT:   In this video I practically demonstrate ARP, TCP 3-way handshakes, HTTP, Ethernet Types, Protocol Numbers, Port numbers and more. A lot of information in this video!  This is video #10 of my FREE CCNA Course 200-301 - a complete CCNA course for the new Cisco CCNA exam. I am going to be covering all the topics in the exam blueprint in this course.   I want to make this content practical and it will include a lots of labs and demonstrations to help you better understand topics on the exam.  The course will contain: - Videos - Labs using Cisco Packet Tracer - Quiz Questions - And more!  Menu: Overview: 0:00 Topology: 0:39 Devices at your home: 1:10 IP lights demo: 2:03 Packet Tracer Lab: 2:54 ARP: 3:31 TCP 3-way handshake: 6:10 HTTP message: 6:35 How are higher layer protocols referenced? 7:08 Ethernet Type Field: 7:47 Layer 3 Protocol Field: 9:29 Port numbers: 10:30 Server Services: 11:40 Dynamic / Private / Ephermeral Port numbers: 13:34 What to learn for the CCNA exam: 16:19 What about return traffic? 16:52 Thank you to my supporters: 19:08  Packet Tracer lab used in this video:   CCNA 200-301 Playlist:   Support me via thisisIT: support the mission, join thisisIT:   Or, buy the CCNA course and support me: DavidBombal.com: CCNA ($10):  Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   ====================== Special Offers: ====================== Cisco Press: Up to 50% discount Save every day on Cisco Press learning products! Use discount code BOMBAL during checkout to save 35% on print books (plus free shipping in the U.S.), 45% on eBooks, and 50% on video courses and simulator software. Offer expires December 31, 2020. Shop now.  Link: bit.ly/ciscopress50  Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  CCNA Free CCNA 200-301 ccna 200-301 free ccna course network networking thisisit osi model tcp/ip model  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    #ccna #ccna200301p #networking",
    "description_links": [
        "http://bit.ly/yt999ccna",
        "https://bit.ly/thisisitccna",
        "https://bit.ly/tcpipmodellab",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKPc2RecyiM_A9nf3fUU3e6g",
        "https://bit.ly/thisisitccna",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- Now you will learn a lot more by doing rather than just watching me talk about protocols and talk about things. So make sure that you download this Packet Tracer file. And try this yourself. I'm gonna walk you through a scenario, and a few scenarios in this video and in subsequent videos, and labs, but try this yourself. You will learn far more by doing than by watching or listening. You learn to ride a bicycle by riding, you don't learn to ride a bicycle by watching someone else ride a bicycle or watching videos, so try this yourself. Okay, so in this example, I've got a topology consisting of multiple devices. So zooming out, I've got a whole bunch of devices, but for this initial video, we're going to concentrate on this PC, which is in our internal network. In other words, think of this as being at your home or company, and then we've got a device that's connected to the internet here. So this would be our internet router. What we're gonna do, however, is connect to a server in our internal network. At home, you may have multiple internet connected devices, you could as an example, simply open up a web browser on your PC and connected to your internet router. As an example, if I open up a web browser, and connect to an IP address in my network, and don't worry too much about IP addresses at this point if you don't understand them. Basically, an IP address is a number that you allocate to a device that allows it to communicate using a protocol, which in this example is IP, IP version 4 in this specific example. Here I've got a BT Home Hub. So you may have devices at home that you can connect to. We're gonna mimic that or represent that in Packet Tracer. So on the left here, I have some servers running internally. I have a internet router, which is connecting me to the internet. As a further demonstration, here, I've got an iPhone, I could connect to that light, that's a hue, like using Bluetooth, and then do something to that light. Now in your home, you may have some devices that are connected via IP as well, that light isn't using IP as a normal IP, it's using Bluetooth. So I'm connecting to that light via Bluetooth from my iPhone and turning it on and off. But this light as an example, is connected via IP. So I can go into my phone, and then I could say, \"Okay, let's turn that light off.\" So it's gone off, turn it on. Now the way that works is I'm simply connecting to that light via TCP IP. You can actually look at the traffic on your home network using an application called Wireshark. I'll talk about that in a separate video. But in this example, let's use Packet Tracer so that we can talk about the same protocols together. So on this PC, I'm gonna open up a desktop. And I'm gonna open up a web browser. Now before I connect to a server, I'm gonna change the Packet Tracer mode to simulation mode so that we can see the actual packets going across the network. On my Windows PC, I'm gonna connect via HTTP to the server on the left, which is 10 11100. Notice nothing happens, but when we go back here we can see that some packets have been created. First one is ARP. Now on Ethernet devices communicate using what's called a MAC address. A MAC address is a burnt in address on a network interface card. So I'm connecting from this PC to the server. The PC doesn't know the MAC address of the server. This is the MAC address of the PC and we can see that by going to the config of the PC, go to Fast Ethernet, notice MAC address ends in 1199. So this PC is basically arping or requesting. An ARP is address resolution protocol requesting the MAC address of the server. So it's basically saying who has this IP address. So that gets sent to the switch. Now this is what's called a broadcast frame. Notice the destination is F's. That's a broadcast basically saying who has this IP address. If we look at the PDU, or protocol data unit, what you'll notice is the target MAC addresses blank. Target IP addresses this. Now this is a broadcast and a layer two switch will flood the broadcast which basically says it sends it out of all ports. So it gets sent to the server. This server drops the message because it doesn't have the IP address requested by the PC. This router will also drop the packet, but this server will reply back. So the inbound PDU is from the PC to a broadcast address. But the reply is now from the server ending in zero zero eight six as its MAC address to the PC. Notice how Packet Tracer uses seven layers here. At the moment, it only shows layer one and two here. If we look at the inbound PDU, however, at layer two we have Ethernet, at layer three we have ARP and in the outbound PDU, that's what we see, something similar layer two, layer three ARP. Target IP address is the PC, source IP address is the server source MAC address is the server. And we can see that by looking at the interface notice zero zero 86 is the MAC address. So what happens now is that it gets sent back to the switch and get sent to the PC. So now the PC knows the MAC address of the server and can communicate directly to the server. Notice this is a TCP packet. So in TCP before communication takes place, they do what's called a three-way handshake. They agree on certain parameters, such as sequence numbers, and how much data they can send. And then an HTTP packet is sent into the network. So if we look at the actual HTTP, and that's the one I wanna concentrate on here, let's look at the HTTP packet or HTTP message. Packet Tracer shows us very nicely, gigabit 104 on the switch receives the frame. So this interface receives the frame from the PC. We've got layer one and layer two information here. It's gonna be forwarded out of gigabit 102. So forwarded to the the server. But let's look at the inbound PDU and outbound PDU or protocol data unit in a lot of detail. Source MAC addresses the PC, destination MAC address is the server, we have a Type field. How does one layer referred to the layer above it? At layer two on Ethernet it uses a Type field. This type 0800 in hexadecimal 0 hexa means hexadecimal, indicates that the higher layer protocols IP version 4, we could have other protocols here like IP version 6. So if I go back to a ARP packet and have a look at that, notice the Type field is different here. It's zero eight zero six, that indicates ARP. So when a device receives a frame at layer two, it needs to know which protocol to use, in other words, which protocol stack to use. We can see that in Windows by going to control panel and if we have a look at our adapter, so this is the wireless adapter that I'm currently using and go to properties, what you'll notice is we have IP version 4, and IP version 6. Two protocols at layer three have been enabled on this PC. When the PC receives frames off the wire, so when that PC receives data, how does it know which protocol stack to use? In other words, is it an IP version 4 packet or is it an IP version 6 packet, it's based on the Type field at layer two. So this server on the left here, when it receives this HTTP packet, will know that it needs to use the IP version 4 protocol stack. If you send IP version 4 packets to IP version 6, it's not gonna understand it. In the same way that I have in English protocol stack, and I have an Afrikaans protocol stack. I'm much better at English than I am at Afrikaans. If I say good morning, how are you and use the English protocol stack it's gonna make a lot of sense. If you speak multiple languages and you hear different languages, your mind will just switch to that language very easily. But on that PC it needs to know which protocol stack or which language to use. So in this example, IP version 4 is the layer three protocol. And here we can see IP version 4 source and destination IP addresses. Now, same thing again, how does it know which protocol is being used at layer four. Ethernet is the layer two encapsulation, IP version 4 is the layer three protocol, TCP is the layer four protocol. This number here indicates, so it's a six in hexadecimal or six in decimal, indicates that the protocol used at layer four is TCP. You can find protocol information easily by just searching for IP version 4 protocol numbers, and then the IANA website gives you a list of protocol numbers. So as an example, TCP is protocol number six, 17, if we scroll down is UDP, TCP, or Transmission Control Protocol is reliable. User Datagram Protocol, or UDP is not reliable. So again protocol at layer four is TCP, which layer seven protocols use. Notice destination port is 80, 80 is HTTP. Notice we've got what's called a destination port. We could search in Google for port numbers. And let's go to the IANA website which is the Internet Assigned Numbers Authority and if we search for 80 in that list, you can see that HTTP Port 80 is World Wide Web HTTP. Now some protocols such as DNS, or Domain Name Server, or Domain Name System, as it's sometimes called, uses both TCP and UDP. HTTP generally uses TCP, because we want reliability. So again, layer three protocol is IP version 4, layer four protocol is TCP. We are indicating the application that we wanna send the data to by the port number. Think of it as follows, the server is running multiple services, and I want you to see the services and look at the protocols going to the services. So under services, we've got an HTTP server. We've also got a TFTP server. We've got an FTP server, and email server and various other servers. Where should the data go, it needs to go to the right application, you're not going to open up a mp3 music file in a word processor, it's not gonna work. Word opens word processing files. An application, such as a music application gets used to open music files. So you need the right application or right service to work with the right data. So again, you use a port number to send the HTTP traffic to the HTTP server, you'd use a port number, like 53 to send traffic to a DNS server, you use Port 21, to send it to FTP server or service. 69 to a TFTP service. You have one physical server running different processes or different applications, and you wanna send the data to the correct service or correct server application. Those applications listen on a specific port number. So the HTTP server listens on port 80. The FTP server will listen on port 21, TFTP will listen on port 69. So this is indicating to the server that this data needs to go to the application listening on port 80, and here you can see the HTTP request. So, packet gets sent to the server, the server because it's listening on that port, will receive the data and send it to the relevant application. What you'll also notice here is the source port is 1025. So let's talk about port numbers in a bit more detail. A server service will listen on what's called a well known port number. But when you initiate a session to a well known port number, such as 80, you will use what's called a femoral or random port number. Now, going back to the IANA, we're told that service names are assigned on a first come first serve basis as documented in this RFC. Service names and port numbers are used to distinguish between services that run over transport protocols such as TCP, UDP, and others. This is the important part, these port numbers in the range zero to 1023 are signed as system port numbers. So 80 is in that range. We have what's called a user port numbers in this range, and then we have what are called dynamic or private port numbers, also called ephemeral port numbers. Again, people use different terms. Is that a router, is it a router? Is it a highway or a motorway? Is it a sneaker, is it a trainer or in South Africa, is it a tackie? So a tackie is a word that comes from Afrikaans, but we use that as the English word in South Africa. So is it a tackie, is it a trainer like in the UK, was it a sneaker in the USA? Different terms used by different people, but dynamic or random port numbers or private port numbers, or ephemeral port numbers are dynamically or randomly used. Now you'll notice Packet Tracer is actually using a port number in this range, 1025 is the source port number. Things change over time. If I do a search in Google for ephemeral port numbers on Wikipedia, you can read more detail about how the IANA recommends those port numbers for dynamic or private ports, but many Linux kernels use this range. BSD used this range. Windows XP used this range by default, so 1025 not 1024 Vista, Windows 7, 2008 use the IANA range. Windows 2003 used this range. Basically different operating systems used different ranges. You can also see that Windows allows you to customize this. So you can specify custom range. The moral of the story is servers, and for the CCNA, I need to worry about some of the well known port numbers, 80, HTTP 21, FTP 69, TFTP and there's a few others. 23 is telnet, 22 is SSH. Know the well known protocols. HTTPS as an example is 443. You'll get to know these protocols as you work with networks, but for the exam study the well known port numbers and well known protocols. So here we can see the PCs using this source port number, going to the server. However, what you'll notice and let's show that in the PDU. Is that the port numbers get swapped round when the server replies. So this is the inbound PDU, this is the PDU from the PC to the server. Source MAC addresses the PC, source IP addresses the PC. Source port number is 1025 but for the reply that gets reversed round. Source MAC address is the server, destination is the PC. Source IP addresses the server, destination is the PC. Source port numbers 80, destination port number is 1025. So basically for our communication, MAC addresses gets swapped round, IP addresses get swapped round and port numbers get swapped round. So if you talk from your PC to my server on port 80, I'll reply from port 80 to the port number that you've chosen. The reason why the PC will choose dynamic port numbers, is if you open up two sessions to my server, your first session may use port number 1025, and your second session may use port number 1026. They should be randomized, but often they're not done. That's why hackers can often guess what port number is gonna be used next by application. But there you go, that's an example of layer two, layer three, layer four, and layer seven. If we look in the OSI model here, they don't show layer seven as the protocol here. But that's actually the protocol used in the TCP IP protocol stack. Again, TCP IP model, originally four layers, we now have five layers. So we group layer five, six and seven together as the application but we talk about layer seven because of the history with the OSI model. Okay, so that was quite detailed. I'm hoping that helps you understand a bit about port numbers, protocol numbers, ethernet types, and so forth. In the next video, I'm gonna show you another protocol. Let's use email and let's say FTP. Spend some time however, going through this yourself, having a look at the different protocols. (soothing music)",
    "transcript_keywords": [
        "port numbers",
        "port",
        "MAC address",
        "server",
        "protocol",
        "layer",
        "MAC",
        "numbers",
        "HTTP",
        "Packet Tracer",
        "TCP",
        "number",
        "address",
        "Packet",
        "protocols",
        "HTTP packet",
        "HTTP server",
        "source port number",
        "PDU",
        "source MAC"
    ],
    "transcript_entity_values": [
        "three",
        "Domain Name System",
        "SSH",
        "World Wide Web HTTP",
        "Afrikaans",
        "80",
        "two",
        "104",
        "four",
        "eight",
        "TCP",
        "second",
        "Google",
        "HTTP",
        "English",
        "Linux",
        "eight zero",
        "17",
        "80",
        "BT Home Hub",
        "OSI",
        "10 11100",
        "22",
        "User Datagram Protocol",
        "XP",
        "4",
        "Wikipedia",
        "Fast Ethernet",
        "Windows",
        "2003",
        "one",
        "IANA",
        "0800",
        "TCP",
        "DNS",
        "BSD",
        "Vista",
        "first",
        "UK",
        "Bluetooth",
        "6",
        "443",
        "USA",
        "69",
        "CCNA",
        "South Africa",
        "iPhone",
        "23",
        "Transmission Control Protocol",
        "IP",
        "Packet Tracer",
        "MAC",
        "ARP",
        "First",
        "1199",
        "F's",
        "102",
        "1023",
        "six",
        "53",
        "1026",
        "seven",
        "Ethernet",
        "1024",
        "five",
        "Wireshark",
        "FTP",
        "zero",
        "1025",
        "Packet Tracer",
        "21",
        "HTTPS",
        "PDU",
        "Tracer",
        "Two",
        "Port 21",
        "0 hexa means hexadecimal",
        "UDP"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "ORG",
        "ORG",
        "LANGUAGE",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "NORP",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "ORG"
    ]
}