{
    "id": "0MaX8CFxrRQ",
    "title": "New chips, new screens, new gadgets | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-06-25T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=0MaX8CFxrRQ",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "gadgets",
        "boox",
        "palma",
        "review",
        "ereader",
        "kindle",
        "eink",
        "epaper",
        "interview",
        "discussion",
        "ebooks",
        "microsoft",
        "surface",
        "pro",
        "computer",
        "laptop",
        "touchscreen",
        "Arm",
        "processor chips"
    ],
    "views": 21171,
    "likes": 277,
    "comments_count": 33,
    "description": "Today on the flagship podcast of the many definitions of electronic paper:   The Verges David Pierce takes a look at the Boox Palma, a phone-shaped e-reader that runs Android. He also compares notes with Clockwises Matt Martin and writer Craig Mod.   The Verges Nathan Edwards and Tom Warren join the show to discuss their experience using Microsofts new Surface Copilot PCs. They also answer a question from The Vergecast Hotline.  Further reading:   The Boox Palma is an amazing gadget I didn't even know I wanted:   New Pop-up Walk, Reading Digitally in 2024  Roden Newsletter Archive:    Surface Laptop 7th Edition review: Microsofts best MacBook Air competitor yet:    With Copilot Plus, the new and improved Windows PCs are here:     Microsofts embarrassing Recall:     Microsoft makes Copilot less useful on new Copilot Plus PCs:   00:00 - Intro and Daylight DC1  02:04 - Boox Palma: a unique E Ink device 06:54 - User Experiences with the Books Palma 12:33 - Craig Mod's insights on digital reading 19:45 - The future of E Ink technology 26:47 - Microsoft Surfaces w/ Nathan Edwards + Tom Warren 35:38 - Performance comparison: M3 vs. competitors 36:11 - Battery life insights and benchmarks 42:01 - Surface Pro's detachable keyboard 47:08 - AI features and real-world applications 56:21 - Future of Windows on Arm and market impact (Vergecast Hotline)  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/24184777/boox-palma-e-ink-smartphone-reader",
        "https://craigmod.com/roden/091/",
        "https://www.theverge.com/2024/6/25/24185462/microsoft-surface-laptop-7th-edition-review",
        "https://www.theverge.com/2024/6/23/24183235/copilot-pcs-elden-ring-erdtree-hank-green-installer",
        "https://www.theverge.com/2024/6/20/24182350/microsoft-windows-recall-launch-on-arm",
        "https://www.theverge.com/2024/6/21/24182979/microsoft-copilot-key-keyboard-shortcut-pwa",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://link.chtbl.com/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- Welcome to the \"Vergecast,\" the flagship podcast of the many, many definitions of electronic paper. I'm your friend David Pierce and I am at the park for research and journalism as you do. So, I have this new device, it's called the Daylight DC1 and it's a tablet, obviously, but the idea is that it's a different kind of tablet. It doesn't use a big, bright, colorful screen like the iPad, but it's also not an e-ink screen, which has sort of slow refresh rate and doesn't have some of the things that you want from like a smoothly scrolling, easy typing tablet. It tries to be a middle ground and I find that middle ground really interesting. I've been using this tablet a lot. They really want you to use it outdoors. It's called the Daylight. It comes in this like plush sort of outdoorsy case instead of like the sleek metallic fabricy thing you normally get with a tablet. And it's designed to just be a simpler kind of technology. And I have a lot of testing left to do with this thing, but so far it's not that impressive gadget. But I still find it fascinating 'cause I think this idea that what if instead of totally, you know, ground up reinventing every kind of gadget that exists in the world, we just tweaked the formula a little bit. Different kinds of screens, different sizes, different shapes, different fabrics, different textures. And maybe that changes the way that we'll feel about these things and the way that we use them in more interesting ways than just, you know, throw it all away and try again. To some extent, that is actually what we're gonna talk about in this episode. First, we're gonna talk about an e-ink device called the BOOX Palma that I'm sort of obsessed with. We'll talk about why in a few minutes after that we're gonna talk about the new Surface Laptop and Surface Pro from Microsoft, which are still very gadgety gadgets, but they're making this big bet that AI and a new kind of chip from Qualcomm can change how you feel about something that still looks like a tablet and still looks like a laptop, but might mean something else to you. It's very gadgety episode, (birds chirping) but it's also I think, gonna get strangely philosophical in spots, I'm very excited about it. We also have a questionnaire from the hotline. Lots to get to. (birds chirping) All that is coming up in just a second, but I have never played pickleball before and those people are playing pickleball. I'm gonna go learn how to play pickleball. This is the \"Vergecast,\" we'll see you in a sec. (upbeat energetic music) Welcome back. So one of the things that happens when you write about technology is that you tend to accumulate a lot of technology. This is like the world's best problem to have, by the way, I just have a million gadgets around all the time and the truth is very few of them have much staying power in my life. I test something out maybe to write about it, maybe just to understand all this stuff a little bit better and then it goes in a drawer or sits in a desk or goes back to whoever sent it to me until I have another question about it. I try new stuff for a living, which again, it's great, cannot recommend it enough, which is what makes the BOOX Palma kind of remarkable. I've got it right here. I almost always have it with me now actually. It's a device that on paper is pretty much a smartphone, 6.1 inch screen, six gigs of RAM, camera on the back, runs Android, but it's not a smartphone because that 6.1 inch display is an E Ink screen. The E Ink Carta 1200 if you're really curious, which makes the Palma kind of the exact middle between a smartphone and a Kindle. And for me that turns out to be kind of perfect. The Palma launched last fall and I remember being sort of interested in it back then. BOOX, the company, it's B-O-O-X by the way, has been making these interesting E Ink Android devices for a while and they started out kind of clunky but have steadily gotten better over time. The Palma launched last fall and I remember being sort of interested in it back then. BOOX, the company, it's B-O-O-X by the way, has been making these interesting E Ink Android devices for a while and they started kind of clunky but have steadily gotten better over time. It's a China-based company and it sells like a million different devices. There's the BOOX Note Air3 C and the BOOX Tab Ultra and the BOOX Page and the BOOX Leaf and the BOOX Leaf2 and the BOOX Note Air2 and the BOOX Go and the BOOX Go Color. Basically every size of e-reader you can imagine you can get. I already have a lot of e-readers, though. I read a lot on my iPad. I have a couple of Kindles of various sizes and generations. I have a remarkable tablet that I really like. I'm honestly good on E Ink devices. The Palma is also $280, which is a lot for an e-reader. But I ended up getting one anyway because over the months since it launched I've seen a surprising number of people talk about how much they love this thing. So I got mine a couple of months ago and I have to say I understood the appeal pretty much right away. For me, there are two things about the Palma that have actually made it stick in my life. The first is just the size. The fact that it fits in my pocket and is really easy to hold in one hand is a total game changer. That sounds sort of ridiculous to say, but it's really been true. It's easier for reading in bed, it's easier to bring with me on a walk or to a coffee shop. I can lug the Palma the same way I lug my phone and that has just made me have it around more often. The second thing is the fact that it runs Android, which, I mean, obviously, right? That's like the whole BOOX thing. Instead of just having to do everything through Amazon on a Kindle or through Barnes & Noble on a NOOK, you get the whole universe of Android stuff. For me as a reader, that means I can have three crucial things on the device at the same time. The place I read books, which happens to be the Kindle app, the place I read articles, which is an app called Readwise Reader and the place that I save webpages and other links to get to later, which is an app called Raindrop. All of my reading, no matter what form it takes, now lives on this one device with an E Ink screen. Any app with pagination, you can scroll with the volume buttons on the side, which I really love. The battery lasts a long time, somewhere between like a few days and a week, depending on how I use it. I'm not distracted by other stuff because I don't have any other stuff because TikTok and YouTube all really suck on an E Ink screen, it's just perfect. I did also install Pocket Casts and Spotify, which are where I listen to podcasts and music. So now this thing is both my Kindle and my iPod, I go online to download new stuff, then I put the thing in airplane mode and I'm good to go. Anyway, I sound like I'm shilling for the BOOX Palma and I kind of am, I love this thing, but it's not because this is some magnificently perfect unique gadget. It's kinda flimsy. I wish the screen were higher res. I wish it supported a stylus. It's pretty slow even when you're just trying to get to the home screen. And most problematically by far, it's running Android 11, which is now four years old and I'm deeply worried it's never going to get updated past that. The upside of Kindle is that my Kindle from whatever six years ago still works great. There are lots of things about the Palma that I wish were better and very little about it actually, that someone else couldn't do better. But that's actually what's been so fun about using this thing. It has totally proven to me that there is something in this hardware combination, an E Ink display in the body of a smartphone with all the apps I need. That's it. It's worse than my phone at a lot of things, but massively better than my phone in just enough ways that it's worth having around. I've spent a lot of time testing out new kinds of gadgets this year, smart glasses and Ai Pins and foldable devices and weird new ideas about tablets. And as it turns out the thing I like the most is just a new take on the smartphone. Anyway, I wanted to know what other people liked about the Palma and why this thing has been such a hit with people who have tried it. So I called up a couple of them to chat about it. The first person I called was Matt Martin. He runs a company called Clockwise and I actually caught him a few weeks into parental leave. He said he found the Palma the same way I did because people just wouldn't stop talking about it. - [Matt] People in my feed that really loved good products, good design, seemed to like hit the zeitgeist somehow in like the little tech world that we live in. I also am having a new kid and I was like, well, I aspire to read. I aspire not to, you know, spend my 30 minutes before bed on- - [David] Sure. [Matt] You know, Instagram reels. And so I got it and I have to tell you, like the thing that I find really quite compelling about it, even after using it for a month or so, is having a full OS on it. Like the Kindle, you're in Amazon's little world where, you know it's the Kindle operating system running on top of Android, but you know, you only have access to what Amazon gives you. It is basically a full version of Android. You can go to the Google Play store. I downloaded the New York Times app, I downloaded Instapaper, I downloaded Libby and I downloaded the Kindle app, which, by the way, makes for just as good a reading experiences on a Kindle. And that's actually, it's the combination of the portability and being able to like flip through online articles that are cultivated in the \"New York Times\" and actually flip through things. It's actually pretty, I wouldn't say it's revolutionary, but it's an evolution that transforms that device for me to make it pretty compelling and something I reach for. - [David] I totally agree. The argument I have heard against this device is basically like, just download those apps onto your phone. You do this. Like, what is the point of having a whole separate dedicated device just for this? And I think to some extent the answer is, like, E Ink is nicer to look at, right? But it also feels like there's some, there's something about having a thing that feels like a dedicated device. - [Matt] Yeah. - [David] Even though it's not a totally dedicated device, that it's like I could put all the stuff I don't wanna look at on the Palma and for some reason I haven't and I don't feel tempted to. There is a web browser and no part of me is tempted to go look at the web browser. And I, like- - [Matt] Yeah. - [David] I have a hard time figuring out why that is. - [Matt] So I am addicted to \"New York Times\" little games. - [David] Hm. - [Matt] I play with friends and I was like, oh, I can play Connections on here. Even that I find not compelling to do. Like, if it's outside of reading, I don't really wanna do it on the Palma. And I think that the answer is probably not a very exciting one, which is that, you know, as humans, you know there's the old anecdote that we're probably all taught in \"Psych 101,\" which is that physical environment matters. Like if you set up an environment for a specific context, your brain actually is kinda hardwired to take in the context and get prepared for that. And I think a separate device matters here a bit, like, if I'm in the context of my phone, there's just like that muscle, like, you know, iOS has become so refined at getting between the application so quickly. Like, I can have a random thought and this happens all the time. Like, sometimes you're reading, you're in a slow section, you have that random thought about like, \"Oh, what was that thing that I wanna buy on Amazon?\" And you're there without even thinking about it. And now I'm on like a rabbit hole of attention that I didn't mean to be on. - [David] This is part of the reason I've been so interested in this gadget ecosystem for so long is I think anybody who says, \"Oh, just use your smartphone differently. It's a matter of willpower.\" Is just like, no, (laughs) you're wrong. And that's not how it works. And also I don't, my phone is very good at a lot of things and I'm happy it's good at those things. So what, give me the full list of the apps you have on there. You mentioned Kindle, New York Times, what else do you have? - [Matt] That's basically it, man. I mean, so it was kinda wild. I realized when I was logging in everything that I could install one password and like, it would just work. - [David] Oh that's smart. - [Matt] Integrated, which is, you know, it's a full install of Android. So I have in addition to those, I have one password, Audible, Wikipedia, but I really, the home screen is just four apps. It's just Kindle, Instapaper, New York Times and Libby. 'Cause again, it's a dedicated device for me. I don't really even seek out the other applications you said, like you said, there's a web browser and I don't really have any impulse to go use that. - [David] Do you wish there were things this thing could do that it doesn't? What do you dislike about the Palma? - [Matt] Not yet, honestly, I'm very happy with it. So I'll answer to all this, which is like, look, let's just acknowledge that we're weirdos. I wouldn't scream from the mountaintops that everybody should go get a BOOX Palma. - [David] Sure. - [Matt] Like, my mom would probably love this thing, but also she probably shouldn't get one. Like, it's fine. And I'm also not like a, I don't quite nerd out despite my profession being in a company that focuses on focus time and helping give people more time in their day. I actually don't geek out on like, all these different apps that try to, you know, give you more time to focus or prune your little garden when you're trying to focus your elements. But I just find the thing compelling because it helps me read, like, that's it, full stop, full story. - [David] Yeah. - [Matt] I was at a pediatrics appointment and I stuck in my pocket because I knew I'd be waiting around and I was sitting there and I pulled it out and read an article that I'd saved, instead pulling out my phone and looking at some dumb crap on Instagram and like, I don't know, small win but kinda feels good. (laughs) - [David] The way Matt put that was something I've been thinking about a lot ever since. When I have my phone in my pocket, my impulse when I pull it out is to open Threads or TikTok or Instagram. I can fight that impulse and be productive and do the thing that I wanted to do, but that's still the impulse. When I have something like the Palma in my pocket, I open it up and my impulse is to open up Readwise or the Crosswords app. It just incentivizes a different kind of behavior in a way that I really like. After I talked to Matt, the next person I called is probably the single person most responsible for all the other people in my Threads feed talking about the Palma. It's this guy, - [Craig] I'm Craig Mod and I'm a writer and photographer and I make books. - [David] Craig wrote a blog post in early May about why he loves the Palma, which got a lot of people excited. Craig has been thinking and writing about digital reading for a really long time. So for him to love a reading device is a pretty meaningful thing actually. Especially because as he told me, he never expected to love a digital reading device ever again. - [Craig] Oh, I totally stopped hoping for the best long time ago. - [David] Okay. - [Craig] That's why I stopped writing about it. That's why I stopped talking to companies that would like, you know, people would email me and be like, \"Hey, I'm doing a startup around digital books.\" It's, like, instantly into the trash. Like, no, they're like- - [David] (laughs) yeah, good luck with that. - [Craig] I know how that song ends. - [David] Earlier this year, though, the folks at Readwise called up Craig to talk to him about some digital reading stuff. He's actually an advisor to the company these days, but he also does just like the app and so do I. It's very good. And they ended up showing him the Palma. He bought one along with one of the other larger BOOX tablets and immediately fell in love with it. So we compared notes for a little while. - [Craig] I'm excited about this idea that E Ink screens are cheap enough that anyone can kinda produce these devices now and Android as an operating system and you know, in general touch-based tablet operating systems, like, whatever, we've figured 'em out. We figured 'em out a long time ago. There's no cancer to be solved in tablets anymore. It all works the same, they're all fine. And so, like, Android is totally good enough. So, like, the fact that you can kinda stick an Android computer into a device that has a great E Ink screen and run the Kindle app. Which by the way, Kindle devices are just Android devices. - [David] Oh yeah, that's true. - [Craig] They're just running the Kindle app and that's all they run. And the BOOX folks runs every Android app in the app store runs the Readwise Reader app. So suddenly you have all your long-form reading beautifully synced between all your devices. The Readwise Reader app is actually really thoughtfully done. The scroll design that they released earlier this year- - [David] Do you do the paginated scroll? - [Craig] Yes, yes and I love it. I think it's so good. - [David] I turned that on the second they launched it and I- - [Craig] Yeah. - [David] I have switched to and from Instapaper 100,000 times just because it paginates. - [Craig] Yeah. - [David] And I don't, especially for very long things, I just don't wanna scroll it like a webpage. - [Craig] No! - [David] I told the Readwise folks, like, a year ago, like, please dear God, just give me pagination. They were like, \"I don't know, I'm not sure anybody except you wants that.\" And I was like, \"All right, fair enough. Understood.\" And then they launched it and it was instantly, everything about my reading life got better. - [Craig] Yeah, no and they did a really good job with it and I love how they do the breaks and with like the BOOX Palma, you can set the volume buttons as the scroll buttons and it's just perfect one-handed reading and there is something, you're absolutely right, scrolling and reading long texts sucks, it sucks. And this is one of the reasons why I think if you looked at engagement on laptop screens, like, long text, I can't read something over 1,000 words on a laptop. I just can't do it. And so I've given up on it, so everything gets sent to Reader. You know, you just click the little icon, you know, in your extensions bar in Chrome or whatever boom, it's in Reader, Readwise Reader and you know, it's on all these devices waiting to be read, beautifully paginated, you can do note taking, highlighting, synced beautifully. It goes into Obsidian, the Obsidian Sync notes, you can see them, you click on 'em, it opens in Readwise Reader on the web. All the loops are closed for engagement around long-form reading. And I have found since getting these devices, because I used to send long-form articles to the Kindle, but it was such a clumsy affair and the notes weren't really synced and saved and it just felt like I was throwing things away and I'd never be able to go back to them. And the archive was bad. Now that I can use Readwise Reader and I have an E Ink device that has essentially a week long, two week long battery life, I never think about charging these things. Even now it's like 44%. I've been using this for the last week and now that I can do that, that ecosystem has completely reinvigorated all of my digital reading and long-form reading. I've read more long-form articles in the last three months than I have probably in the last year. - [David] That's awesome. - [Craig] And I just love it. I love it. I love that everything that the Kindle had a monopoly on, which was mainly hardware and screens, that's gone. - [David] Hm. - [Craig] The mode is totally gone. And it feels like we are at this now at this precipice, high refresh e-ink screens, low cost Android devices. Let's go, like, let's do something interesting around this space. Like it's just really exciting. - [David] What is it about the Palma in particular that sort of speaks to you? - [Craig] Well it's, you can just have it in your pocket. This is one of the things that drove me insane about the Oasis is like, I like the oasis, the shape of it is shaped so it can't fit in any pocket known to man. (David laughs) It's the craziest shape I've ever seen in my life. It doesn't fit into any pocket! I don't know how they did it. They, like, it's like they went around the world and they checked every pocket and they're like, \"Okay, make it one millimeter bigger than every single angle, will you?\" So this, you know, this Palma I'm holding right now, it's so light, it fits anywhere. You can just have it in your breast pocket, you can have it in your pant pocket, whatever. So it is my, like, go-to thing to have on trains, whenever I'm traveling, I pull this thing out and I'm reading on it. It's also my bedtime computer, you know, it's like you can be in bed, all the lights are off, all the back lights stuff on these BOOX devices are pretty well done. It's kind of like a, I don't know if it's a warm back light, but it's like you can have it low enough where it doesn't really feel like it's affecting sleep. It's just perfect, one-handed, it's not heavy. It's not gonna fall on your face in a weird way. You can be on your side, you got it in your hand with your thumb on the volume controls and you can just easily go through an article until you fall asleep. It's like a gentle lullaby of a reader. It's great. And it makes you wonder why hasn't someone made an E Ink phone? Because yes, it's, so everything that I'm looking for in a device, is, like, this Palma, the Palma, the refresh rate is high enough. I mean, have you watched video on these things? It's really wild. Like it disincentivizes you from watching video, but the fact that this E Ink screen can update fast enough to show you video and it looks like video. And it doesn't have that much ghosting. That just means that you can do highly interactive interfaces that wouldn't be annoying to type messages on, do the basics. You could run Google Maps on this thing and zoom and do searches and it would be fine. And I would love to have this as my main driver, so much more than, you know, the dopamine casino iPhone, where it's like vying for your attention every two seconds and all the notifications look so good and it's just such a juicy device to be spending time with. But this Palma, it really has reconfigured like, 'cause I hadn't been paying attention to the state of E Ink and so, you know, the state of E Ink for me was whatever the latest Kindle was doing. And you know, you don't really get a sense of how good it is with the Kindles and these BOOX devices have really blown my mind, just how fast E Ink can be and how joyful it is to run all these different apps in E Ink. - [David] Yeah, what do you do on the Palma other than read? - [Craig] That's it! So that's, I mean, that's the other great, all I run is Reader and Kindle, but I've, you know, poked around on the, if I need to do a web search, which I very rarely do, but if I need to, I can. And if I need to buy a Kindle book, I can go to the Kindle website and run that. And like the fact that I can do that and it doesn't feel like a burden or like I'm taxing the machine, you know, whereas like on the Kindle, anytime you had to load up the experimental, now like 14 years later still experimental browser, - [David] Disaster. - [Craig] Doesn't work. Doesn't work well at all. Yeah, I know it, absolutely terrible. Yeah, it's just made me go, wow, there's a whole world of E Inc exploration that hasn't happened and can happen now. And the technology is clearly like the IP is, I think there's a lot of IP issues or whatever. it was expensive to license before. Maybe that's all changed. - [David] Yeah. - [Craig] And yeah. And now you can make things like this, which is incredible, I love it! More E Ink please. - [David] I (laughs) agree and I actually think the, what you said though, like, if you need to, you can, to me it's like- - [Craig] Yeah. - [David] The perfect description of everything about the Palma because like, yes, you can watch video, but it sucks. Like it's not, you wouldn't wanna sit and watch a video, but ultimately it's like if I need to watch a video in service of the thing that I'm reading for a minute, it's there, I will get through it, I will get the thing that I need out of it and then I'll go back to reading, which is what I'm after here. - [Craig] For sure. - [David] And so that to me is, like, the fact that it does all of these things, the fact that it does them poorly has actually become a feature, not a bug for me. Which is not what I expected when I first got this device. - [Craig] It's the absolute perfect amount of friction. - [David] Yeah, yeah. - [Craig] Whereas the Kindle is too much friction for doing most things. The BOOX devices, it's like just a little bit of friction where it's like, as you say, it's like you wouldn't wanna go surf YouTube and be like, \"All right, lemme watch MKBHD,\" you know, his most recent video on this thing. But if I needed to watch a little interview with Denis Johnson talking about \"Train Dreams\" or whatever like I could pop into that for a second and be like, exactly like you said, get what you need to get out of it and go back into the reading. And that's exciting. And you know, and I think the perfect amount of friction is exactly what no one is willing to bake into most devices. And this is kind of happening almost like as a byproduct, a natural byproduct of the technology. And that feels organic and really lovely. - [David] Totally, is there anything you would change about the Palma? Like as a gadget? - [Craig] I'd probably get rid of the camera. I'd simplify it even more. - [David] I forgot it had a camera. Just this moment was the first time I've thought about the Palma's camera since the second I got it. - [Craig] Yeah, I've taken a few photos with it. It's kinda funny to then look at them, you know, later and it's like, oh yeah, that's right, I could take photos with this. But like, I'd probably put the volume rockers on both sides. So you could do page change on both sides of it and just really optimize for like, if you're holding it with your right hand or left hand, you have the exact same kind of hardware interaction model. I'd probably move the power button at the top because I think that's the best place for all power buttons. I think the iPhone power button on the side was the worst hardware change they made to the iPhone in the history of the iPhone. I mean, just because how many times do you accidentally, you know, do screenshots and yet, you know, anyway, I love power on the top, which by the way, this other BOOX model does, power on the top in there- - [David] Okay. - In their tablet and that feels really good. And then just, yeah, just have those page turn buttons on both sides and then I think that's it. Maybe the screen, like, I do feel like the screen on this thing is not extremely well protected. You know, I- - [David] Oh, interesting. Yeah. - [Craig] I would love to see a Gorilla Glass version of this. What would that feel like? How much heavier would it make it? I wouldn't want the body to be metal. I think this plastic body, I think the texture on the back of it is fine. I think lightness is a huge bonus when it comes to- - [David] Yeah, again. - [Craig] devices like this. And I just worry, like, sometimes when I put it in my bag, I'm like, \"Is this screen gonna get messed up?\" I'm still treating it, I'm not babying it at all. I'm just throwing it in my bag and I'm like, \"Okay, whatever's gonna happen is gonna happen.\" But I do feel like a stronger, even just like a couple generations old Gorilla Glass might be a really interesting modification. I don't know what the IPX rating is, but I'd wanna make sure it would be like fully submersible that those would be, you know, I see the Palma more as like a long-form reading Renaissance device rather than a digital book Renaissance device. - [David] I buy it. - [Craig] Hopefully it can be that too, though. Hopefully it can create better interfaces for digital books as well, not just for long-form articles. - [David] Totally. Yeah and honestly, like, I have spent so many years wondering why Amazon has not just built a decent way to read web articles on the Kindle. And if books just makes Amazon do that, it will have done the world a great service. But I don't think it's ever gonna happen. - [Craig] It's never gonna happen, no, no, no. (David laughs) Like you just have to accept that there's a certain size of company that internally just doesn't have the willpower- - [David] Yeah. - [Craig] To do these things that, where that, you look at the spreadsheet and you go, what's the market cap of this? What's, you know, the... And it's essentially a rounding error, you know, it's zero and it's just not gonna happen unless you have a C-level person who owns it. And I think with Jeff out of Amazon, I don't know anyone there who is an avid old GQ, you know, Esquire reader or whatever, right. (laughs) It's like, we've gotta make this amazing to read old Gay Talese articles or whatever, (laughs) you know, it's like- - [David] Yep. - [Craig] So thankfully we don't have to, because the e-ink technology is now trickled down to everyone else and companies like BOOX, which we should say, and I think it's important to say, BOOX is a bad open source citizen, I don't know if you know about this, but like they are using I think Android models or Android software in a way that breaks the terms of the open source license. - [David] Oh, interesting. - [Craig] Like if Hacker News ever, like if a BOOX like device article comes up on Hacker News, you know, people go nuts about this and bring it up. - [David] Sure. - [Craig] I think it is important to bring up. - [David] Yeah. - [Craig] Because they are effectively violating the license and I think it would be very easy for them to not violate it. And I think we should talk about this in podcasts like this and say, \"Hey, BOOX, can you just be a good citizen? It's like such a dumb, easy thing to do, why aren't you doing it?\" And we'd love to, you know, it would help me even more enthusiastically recommend these devices. You know, I know anecdotally I have probably sold at least a couple hundred of these things in the last couple of months at least. - [David] I believe it. - [Craig] These are people just messaging me directly. So I may, it's probably in the thousands of folks who bought Palmas and are using them and in fact anyone listening to this who has bought a Palma and has had, you know, had an interesting experience with it, I'd love, send please, write into us. Tell us what changes you would like to see. - [David] Yeah. - [Craig] I'd love to hear how people are using these things or thinking about it. But it does seem like we are in this moment where maybe, maybe just maybe digital reading of long-form stuff could, the interfaces for it could change the way we interact with these libraries could change. And it's an exciting moment. - [David] I really agree with what Craig said there. I do think this is an exciting moment. I think there are a lot of companies out there being like, \"We will replace your smartphone.\" And I think that's mostly ridiculous. But I also think that there are a lot of things that can be done better than the way our phones do them. And it's fun to watch gadgets explore that. Sometimes they get it wrong like the Humane Ai Pin, but there's still something to the idea that not everything should be inside of your smartphone. I've been using the Ray-Ban Meta smart glasses as a way to take photos without sticking my phone in my kids' face. I've been using the Apple Watch as a faster way to set reminders or take notes and I've been using the Palma as a way to read and listen to stuff without the rest of my digital life getting in the way. None of these things replace my phone all the time, but they do some of the time and I think that might be enough. Alright, enough about E Ink for now. We gotta take a break and then we're gonna come back and talk about some Windows computers. We'll be right back. (energetic upbeat music) (electronic notification chimes) All right, we're back. We've talked a lot on this show over the last several weeks about this new generation of Windows PCs, thanks to a new set of chips from Qualcomm and this new co-pilot AI stuff from Microsoft. The whole Copilot+ PC idea, which is a name I really hate, but a concept I think is very cool, feels like it might be a moment in the history of PCs if these computers are as good and as versatile and as long lasting and as powerful as Microsoft and Qualcomm would like you to believe. This could be really exciting for the whole laptop and desktop industry. It's been kind of a weird rollout though. There was the whole issue with Recall, which was Microsoft's big new AI feature that would let you search through and organize basically everything you ever did on your computer. Turns out giant security disaster, at least in the way that Microsoft initially implemented it. So that's been slowed way down. I don't think a lot of people are going to be excited about it at first. So suddenly Recall feels less cool and exciting and like the future of Windows than it once did. But we're still getting some of these devices. I still have lots of questions. Companies basically across the PC industry are all in on this Copilot+ PC idea. We're starting to see tons of new models, we're gonna have lots of new reviews, but personally the ones I'm most excited about are the ones that come from Microsoft. Microsoft has been at, I think the forefront of Windows hardware for a pretty long time. And with the new Surface Pro and the new Surface Laptop is really trying to, I would say, show the rest of the industry how this Copilot+ PC thing can work. So Tom Warren and Nathan Edwards on our team have been reviewing those devices. They haven't told me anything about how it's going and I am desperate to find out. So I'm going to use the fact that we are (laughs) here on the \"Vergecast\" to make them tell me things about these new devices. Let's get into it. Tom Warren, hello. - [Tom] Hello. - [David] Nathan Edwards, hello. - [Nathan] Hi, David. - [David] First let's just level set a little. I wanna know the Microsoft gear you both currently have right now. Tom, what do you have in your possession that you've been playing with? - [Tom] So I have the 13 inch Surface Laptop, 7th edition, not seven, 7th edition. - [David] (laughs) That's very important. - [Tom] Yeah, I have the 15 inch model as well. - [David] Okay. - [Tom] The laptop. And I've also got the Surface Pro 11th edition. - [Nathan] It's the 11th edition, yeah. - [David] 11th edition, yeah. For our purposes we're just gonna call them the new ones because God help anyone who tries to keep all these numbers in their brains. - [Tom] Yes. - [David] And that's both of you, so God help (laughs) both of you. Nathan, you're on the Pro, which Pro are you on? - [Nathan] I have the top of the line new Pro. It's also 13 inches. It's got, they of course, sent the tricked out version, 32 gigs of RAM, one terabyte of storage and the Elite 8,100 processor. - [David] So this is like, if there is going to be one that kicks ass, it's gonna be this one. - [Nathan] Yes, this is their $2,100 without the keyboard model. - [David] Okay, that's serious business. (laughs) So I have a lot of questions for both of you about both of these devices, but I feel like the place we have to start is with the chips, right? Like, that is, there are lots of stories of this thing, but I feel like the question most people wanna know is like, did Qualcomm do the thing here? Are these things actually good? So Nathan, let's start very top of the line and then Tom, I wanna hear your more like mainstreaming experience. But what have you seen so far, Nathan? How do these things hold up? - [Nathan] It does not disappoint me. - [David] Really? - [Nathan] Yes. - [David] That's so exciting! - [Nathan] I don't have to think, most of the time I don't have to think about the fact that it's not X86. It's not perfect. And there are like, places in which it's like, not the top runner but it's a good laptop, it's a good laptop, a good Windows laptop (David laughs) with an ARM processor. - [David] Which you like really cannot overstate how big a thing that is to be able to say at this moment in time. - [Nathan] Yeah and Tom has the Pro X and he's done a little bit of like digging it out and brushing the dust off and I wanna hear more on that. But like this, I'm not fundamentally fighting the thing except in the sense that I would be fundamentally fighting Windows anyway. - [David] Yeah. - [Nathan] Like, generally with a few edge exceptions, it like just works. - [David] Tom, has that been your experience too? - [Tom] Yeah, pretty much. And I'm obviously using the 999.99 cents Surface Laptop and that's the base model. So I've been using that one primarily for the past week. 'Cause I, mainly, because we obviously didn't get these beforehand for review embargo and all that sort of stuff, so I was like, I don't want the tricked out one. I wanna test what the base model one is because it's got 16 gig of RAM, 256 gig of storage and in the X Plus processor, which is I think for me now testing the Elite is around about 20% better performing roughly. So that's kinda the gap. But in real terms, if you're just using your day to day, you're probably not gonna notice that unless you're really pushing it. But yeah, in terms of app compatibility I'd say, like, you know, like, the 90% of the apps you're gonna use aren't gonna be emulated and the key one being the browser, right? Which obviously, everyone kind of lives in these days. But then outside of that, yeah there's gonna be some app compatibility things, some weird things like Google Drive desktop still doesn't work but that isn't necessarily because it can't emulate. It's probably 'cause Google's just flagged it not to. So there's like, these weird things of like, the past 10, 12 years of Windows and ARM being a bit crappy, coming back to sort of haunting at this time. But Microsoft and Qualcomm have done a quite good job at like getting these software vendors to sort of play ball and it's definitely a lot better than I've ever used in the past. - [David] That is super exciting. Nathan, have you run into anything that just like flatly didn't work? - [Nathan] I mean yeah, so Premier Pro does not work but they told us it wasn't gonna work. You're gonna hate this Arc, refuses to run. - [David] That's disappointing. - [Nathan] It's my browser of choice on both Mac and Windows these days, although it's much better on Mac still and they were just like, \"Sorry, we don't support ARM64, let us know if you want us to put my name in a little form, please let me know.\" (David laughs) - [David] Yeah, please let it be known that we want it to, (laughs) if you're listening- - [Nathan] Yeah - [David] We would like that. But I would say that alone, those are things that presumably will get updated over time. And Tom, your point about the history of this maybe being a problem that there are a lot of folks who are like actually turned it off because the experience was so bad, who are now gonna have to be convinced to turn emulation stuff back on. My hope would be if the performance is as good as you guys are describing that that'll start to happen fairly quickly. So even the stuff that exists hopefully won't exist for too much longer. - [Tom] Yeah and with the Adobe stuff like, so we've Premier Pro, it's quite a funny one because they disabled it or like blocked it on the X Elite but they forgot to do it on the X Plus. (David laughs) So I got it installed and then I think they realized like a day later. And then it like- - [Nathan] Yeah. - [Tom] Dropped out of my Creative Cloud but I still have it installed and I can understand why they blocked it 'cause so, I tried to process like a 4K, a 20 second 4K video, right? On this thing. And it was like stuttering, like, you couldn't just play it without it skipping, dropping frames and all that sort of stuff. I tried to export it and it said it was gonna take five minutes to export and I was like for a 20 second 4K video, that's like obviously way too long. And for comparison, this is really unfair comparison but I'm gonna make this comparison anyway, I tried out my desktop PC, which is a 4900K and a 4090 and it exported in seven seconds. (David laughs) I can see why they have Premier Pro blocked on there 'cause it's not good experience. I feel like if you were trying to edit in that, you would come, like, I feel like you'd make editing mistakes just from the basic, like, trying to crop a video or in the timeline, all that sort of stuff. It's just very laggy because it's obviously, yeah, it's not been optimized and that is a heavyweight app, that will hopefully be better later this year once they release the actual ARM64 version, which they've promised to. - [David] Got it. Okay. So it seems like the performance promises that we've gotten, some of it is like you won't notice the difference and Nathan, it seems like, that's kinda been your experience that most of the time you don't have to think about the fact that this is an ARM processor instead of an X86 processor, which on its own giant terrific win. Microsoft in particular has also made a lot of noise about how it, like, beats the crap out of Apple silicon and everybody is making large grandiose performance claims here, like, in terms of actual raw performance, like, good enough is a huge deal and that's frankly I would say, like, that's the benchmark and it sounds like we've mostly cleared it and that's very exciting. How good are these actually that you've seen so far? - [Nathan] Well, I wanna preface by saying Joanna Nelius has our big benchmark article coming in a few days. That'll be the big word on it, the official word. But they are single core, they're not as good as the M3 at all. - [David] Okay. - [Nathan] They do pretty well on most things compared to the Core Ultra stuff and compared to Ryzen 8000. But it's like, it's not, like, it's not crushing anybody. They do, on the reviewer's guide did this very funny, 58% faster than the M3, it is on, very specifically on Cinebench multi-core. - [David] (laughs) Okay. - [Nathan] Notably it has about 50% more cores. Each of those cores is slower than- - [David] It's just more. - [Nathan] The M3 single core. There's just more of them, which is, you know what- - [David] Sure. - [Nathan] Yes, sure, fair. You did it, like, good job. But it's competitive. They're competitive. - [David] Yeah. - [Nathan] Which is more than I could say for any Snapdragon based Windows laptop before. - [David] Yeah, just to be in range, feels like a victory. - [Nathan] In range, yeah! - [David] Yeah. - [Nathan] Battery life is decent. - [David] Yeah, that was the next thing I was gonna ask about because this is hopefully the other big byproduct of switching to ARM. What have you seen on the Pro, battery lifewise? - [Nathan] So I haven't gotten a full day of battery out of it but I've been doing a lot of benchmarking. - [David] Okay. - [Nathan] I haven't had like a full day of what I would consider my normal workday. Just like doing spreadsheets and Word Docs and Slack, Slack is still a battery killer. Every time I look at the battery usage thing, Slack is right up there. Maybe not as bad as it used to be on ARM. - [David] Slack is pretty bad on everything to be fair. - [Nathan] It is. - [David] We should just do an episode at some point where we just sit and yell about all the apps that are grossly inefficient and messy on computers and we would spend a lot of time talking about Slack, I suspect. - [Nathan] It's funny, it does to the computer, what it does to our attention spans. (David laughs) - [David] Just slowly destroys it. - [Nathan] Yeah. - [David] Tom, what are you seeing on the laptop? - [Tom] Yeah, really good battery life, to be honest. On the first day I was like working outside and it was like, I had this screen at 100% brightness. I was downloading like multiple steam games, doing video calls, working in Photoshop, all that sort of stuff. So I'd say that was probably more than my sort of average workday of using a laptop. But I still got roundabout seven hours battery life on that day. And then in the evening I charged it up to like 100%, I was using it indoors at like, you know, 50% brightness. You don't need the 100% brightness and I think in around four hours it only drained 25%, so... - [David] Okay. - [Tom] I was like, okay, that's good. And then I closed the lid and it had like 70 whatever percent remaining at like 11:00 PM and I woke up the next day, did some stuff and then I ended up grabbing the laptop about midday and it still had that 70%. It was like, I think I went to sleep at like 72 and it had 70% and I was like, okay, that's good as well because- - [David] That's pretty exciting. - [Tom] Half the time... Yeah, half the time you close the lid on Windows laptop, you kinda like, is it gonna wake, just keep this thing plugged in 'cause it's not actually gonna, it's gonna just drain the battery overnight. So I've never seen it do that. It's usually like 1 or 2% it drains overnight. - [David] Yeah. - [Tom] And to be honest, I haven't left it long enough for like, you know, five, six nights to see whether that is 1 or 2% per day or if that's just, you know, every time you sort of sleep it. But yeah, the battery life is phenomenal as long as you are in the native apps. - [David] Yeah. - [Tom] As long as you're doing sort of the lightweight stuff. So if I had a day, I think I had a day where I was working predominantly in like Slack and Discord and Chrome and WhatsApp, you know, not too heavy lifting apps and I think I charged it and I think I got sort of like, something like, six hours and it was about down 30% in those six hours. - [David] Wow, okay. - [Tom] Which is pretty, yeah, which is quite surprising. So, yeah but then if you start downloading, stuffing on Steam, like, which is an emulated app. - [David] Sure. - [Tom] Like, I could notice it drop by like 5 to 10% just from downloading a big game on Steam. - [David] Not even playing, just downloading. - [Tom] Just downloading. - [David] Now, just as soon as it needs to do an emulated app. - [Tom] Yeah. - [David] You can feel it working harder. - [Tom] And steam's quite vigorous when it's downloading and unpacking games. - [Nathan] Yeah, on the CPU. - [Tom] Yeah. So it's understandable why it's done that, but yeah, it's emulated. So I'd be very curious to see if there's ever gonna be a ARM64 Steam client and whether that would improve that. - [Nathan] I'm sure there will be. - [David] Yeah, it feels like it's coming but it seems like to me the two levels of battery tests are like, the first is sort of the cross-country flight test where it's like, I can use it in the airport and then like watch two movies on it and then get to wherever I'm going without it dying. That's like, that's test number one. It feels like any laptop that can't pass that test sucks. - [Tom] Yeah. - [David] And then there's the like use it all day and you know, use it and don't charge till the next morning. And this doesn't seem like it's quite gotten there, but it does seem like it probably passes the cross-country flight test, which again for a pretty powerful Windows laptop is a big victory and at least it's like it's not as good as Apple, which is pretty easily in the like I can use it all day and then charge it at lunch the next day with a lot of things. This doesn't feel like it's quite there, but it's almost there and that's something. - [Nathan] I think it probably is. - [David] Okay if you're not doing the emulated stuff. - [Tom] Yeah, as long as you're not doing emulated stuff. I think so, like, I don't do the battery tests that other sort of reviewers do where they just have a bunch of tabs or a bunch of videos going because that stuff is not real world. You know, that's the stuff that Microsoft always says, you know, 15, 20 hours of video. - [David] Offline video playback. Like, who is that for? Yeah. - [Tom] Yeah, it's like, but I do the real world stuff and I think, like, I charged it on Friday and I used it a bunch over the weekend and then I haven't charged it since Friday and it's still has 27%. - [David] Oh, all right, then yeah, we're onto something there. Nathan, it sounds like the Pro is not quite as good though. It doesn't quite hang as well. - [Nathan] I would say I haven't had the time, I haven't had the like extended amounts of time to test it. So it was, yeah, lemme tell you, Cinebench murders the battery life as does actually what killed it was Blender. So if you use Blender, don't get a Snapdragon thing yet. Like if that's part of your workflow- - [David] Interesting. - [Nathan] it is emulated and it's not hitting the GPU cores at all. It's just pure CPU compute, it's brute forcing it, it takes- - [David] Oh, boy! - [Nathan] A long time and it's not pretty, that will, like, we're at now, like, if there's an app that you need that's not native yet, that's not to say this won't be a good choice, but I wouldn't go for it yet. - [David] Yeah and also if ever a setup was going to set your computer on fire, blender running on the CPU would be the answer I suspect. - [Nathan] Yes, it got toasty. - [David] Yeah, (laughs) I would imagine. - [Nathan] But not on the keyboard 'cause that's detachable. - [David] Oh yeah, okay, wait, I wanna get into all the AI stuff, we have to talk about that for a minute. I totally forgot about that. This is very exciting. Tell me about this new keyboard setup and how you've been using it. - [Nathan] So the Surface Pro has a detachable keyboard, it connects by pogo pins. That is the way it's always been. You pull it off, it's like a little folio thing. This year they finally put a battery in it. Not all of them, but there's the Pro Flex Keyboard. It's Bluetooth, it's got a battery, you wanna take it off, you pull it off and it still works. And that feels like, obviously, this is the way detachable keyboards ought to be. - [David] Yes. - [Nathan] Like, often they're just like, here is a Bluetooth keyboard or here is a pogo pin keyboard and you sort of have to pick. Pogo pin is great because it doesn't run outta battery. But also if you're in a situation where you want to detach the keyboard, then all of a sudden it's dead. But I love this thing. - [David] So how have you actually used it in practice? Like, give me the detached use case. - [Nathan] Well, for example, for ergonomics, if you wanna put the screen on like a big pile of books to get it higher up and keep your keyboard down below, you can do that. That's kind of the use case. - [David] As someone I've spent years with, like the, I would have the screen in the middle and I would put my laptop up on a stand next to it as kind of a second display. Having, being able to use the Surface keyboard as the keyboard down on my desk for that, incredible. - [Nathan] I will say that it is $350 and if your use case is like you're mostly at home with the thing running this as like your desktop basically, and then you shove it in a bag once in a while, take with you, you can buy a lot of really nice keyboards- - [David] Yes. - [Nathan] For $350 and then still have room in the budget for like the regular Flex keyboard to take with you. - [David] Yeah, you can buy several really nice keyboards for $350. - [Nathan] You can buy one really nice keyboard. - [David] You can also buy one, yeah. - [Nathan] Yeah. - [Tom] It's like a third of the price of the Surface Laptop as well. - [David] I know, it's nuts. - [Nathan] Yeah. - [David] It's truly nuts. - [Nathan] It's $350 or 500 bucks basically with the slim pen. And like many people consider a keyboard to be an important part of a laptop. - [David] (laughs) Many people are saying, yeah. - [Nathan] But Microsoft, their big thing is like, listen, we give you options. You can have the regular pogo pin one, you can have the Bluetooth one. If you already have a flex keyboard from a previous Surface Pro, you can just use that. It's backwards compatible. It's fine. - [David] Yeah. - [Nathan] So like, I used to be like, oh, why, why? This isn't really a $999 laptop, it's 1,200 bucks, which have the keyboard. But like, I do actually appreciate the optionality. - [David] Yeah, no, I totally buy it. Is there any other hardware stuff we should talk about? I feel like for the most part, the hardware is as it has been and it's still pretty good. I guess the OLED screen is new. - [Nathan] The OLED screen is nice. - [David] Is that exciting? Has that changed your life in any meaningful way? - [Nathan] It doesn't change my life. I mean, so it is 120 hertz variable. It goes up to 600 knits and then I think 900 knits of peak brightness for HDR. It's a nice screen. I will say 50% brightness or whatever, not quite enough. I keep having to crank it up a little bit and it does have a little faint grain to it at peak brightness where you can see the touch sensors in the panel. - [David] It's interesting! - [Nathan] Several reviewers have noticed this. We were talking back channelings, like, Microsoft was like, \"Hmm, we haven't noticed.\" And several reviewers like, \"Yeah.\" (David laughs) - [David] They're like, don't worry about it. You're not seeing what you think. - [Nathan] It's fine, it's fine. (David laughs) It doesn't bother me. Welch noticed it. But no, it's a nice thing. I will say you're still in dongle life. - [David] Hm. - [Nathan] Two USB-C ports. They do still have the Surface Connector on the other side, which is like a magnetic proprietary connector, which again, Microsoft is like, \"Listen, you wanna charge with that? That's fine. You can charge via USB-C, that's fine.\" I have it connected to my, usually I have it connected to my, like, 32 inch 4K monitor with a USB-C and it powers the laptop at full speed. It runs all this stuff. - [David] Nice. - [Nathan] But right now when you're not hooked in, two USB-C ports is still pretty limiting. - [David] Yeah. - [Nathan] Especially 'cause there's no headphone jack. - [David] Yeah, it's not enough, I agree. I've gotten used to it as a MacBook Air user for years. But then- - [Nathan] Yeah. - [David] Every time I am forced to encounter a computer with more, it's like, oh, this is delightful. Like, I have a Surface Laptop Studio from a couple of years ago and that thing just feels like it has infinite ports compared to this one. - [Nathan] It's just nice. Like, right now we're, so, we're recording and I have my headphones plugged into a USB-C dongle and that takes up one port and I have our microphone plugged into USB-C and that takes up the other port and that's all the ports. (David laughs) I'm charging from the Surface Connector. So I'm glad that that's there. - [David] Uh-huh. - [Nathan] That's it. Yes, I have dongles and gizmos and gadgets galore, but like it'd be nice. - [Tom] What do you think of the track pad? - [Nathan] It's fine. It's a track pad, I don't hate it, I don't love it. - [Tom] So I started using it today after using the bigger Surface Laptop track pad for the last week. And I keep hitting the bottom of the key, like, 'cause they've made it vertically smaller. - [Nathan] Yes, it is a little compressed. It's small, you're right. - [Tom] I don't like that 'cause like, the Slim Pen is always on display now as well up top. - [David] Oh, interesting. - [Tom] Yeah, so you've lost a little bit of, like, they just sort of shifted the keyboard down accordingly, so... - [David] Yeah, I don't love that. - [Nathan] The little cradle for the Slim Pen does charge the pen, which I do like. - [David] That's nice. - [Nathan] 'Cause I have an Air with the new Pencil Pro, that thing just goes flying all over the place. Like it magnets to the top to charge, but it's just, every time I pick it up, the pen flies off into the distance. I'm amazed I haven't lost it yet. - [David] You might have a magnet problem but that's for another day. So wait, let's just talk about the AI stuff here for a few minutes before we switch gears. The promise of all of this stuff is that it will do on device AI things that will make everything wonderful. Recall obviously its own story, not here. We'll worry about that another time. What stuff have you guys noticed in the course of testing these things that feels like it is part of the sort of AI PC future? I just wanna say as soon as I said that Nathan's webcam started moving around, which I suspect is an answer to my question. (laughs) - [Nathan] A lot of gimmicks and a couple slightly useful features. - [David] Okay, hit me with the useful ones first. - [Nathan] So the Windows Studio Effects on the webcam, some of them are kinda nice, like, so they use this absurd, like, ultra wide webcam on the Surface Pro that, like, makes you look like you're being looked at by a 4-year-old. (David laughs) You're looming over them and so they use the Studio Effects to crop that down to like, center you and it follows you around the frame. Like you've got your dedicated camera person, like the Nest Hub Max does, it's also got fake eye contact thing like Nvidia uses. - [David] Oh no, that stuff creeps me out. - [Nathan] I mean, yeah, it's creepy. (David laughs) - [David] It feels like a good idea. It's one of those things that like, once that's not creepy it'll be great. But at least everything I've seen so far, it veers toward creepy. - [Nathan] Is it creeping you out right now? - [David] Now you pointed, it wasn't until you pointed it out and now I feel like I'm looking too deep into your eyes through a webcam. - [Nathan] So there's that. It does have live captioning, which is on device and it can caption any video that's playing on your computer. - [David] Oh, that's cool. - [Nathan] I tried it a couple times. I tried it in a video call with Antonio and with Joanna and it translated Italian like spoken on the fly pretty well. But it was like, you know, where's the library level Italian? - [David] Sure. - [Nathan] I tried playing it on Netflix. I was watching \"Delicious in Dungeon.\" You will be shocked that it could not keep up nor did it match the quality of the actual human translated subtitles. - [David] But it's serviceable in a pinch I guess. - [Nathan] It seems to be - [David] Okay. - [Nathan] A little slow, but like it's cool that it can do that on device. That's a cool use of the NPU. I've not been that impressed with any of the image creation or co-creation stuff, although I'm curious if Tom has a different experience. - [David] Yeah, Tom, have you seen any features that have jumped out to you? - [Tom] I mean, there's not a lot, let's be honest, (David laughs) that stuff feels like a bit of a sides show to the Windows and ARM stuff really. I don't know why they need to make such a big deal out of it because it's like they're laying the foundations for this stuff but it's not quite there yet. - [David] Mm. - [Tom] So, you've got like, Paint, in Paint, they've got Image Cocreator, which is interesting on the Surface Laptop because one thing I should say is that it doesn't support pen input anymore. Like, whereas you could use the Slim Pen before on the previous modules, you can't now. The Image Cocreator feature here pretty much relies on you drawing what you want to see, which obviously you can do on a track pad, but it's kind of a little bit not the best way to draw. You just wanna do it on the screen and we'd have to touch. So yeah, that feature seems a little bit less useful than on the Pro if I'm honest, because it's just way more easy just to draw. But even still it just uses like a local AI model, which I think it's using, Is this Stable Diffusion it's using? - [Nathan] I think, yeah. They told us it was Stable Diffusion - [Tom] And the results are pretty bad. - [Nathan] They're terrible to be honest. - [Tom] Yeah. - [David] I mean, what would you expect from Paint? I don't know how high my bar for quality would really be there. - [Tom] Yeah, I tried to draw like a dog on a beach with a ball and it drew the dog fine but it just refused to pick up the fact that I'd drawn a ball and in the prompt I'd said I wanted a ball. It was just like this lonely dog, looking all sad on the beach and it just, yeah, it just looked junk anyway. But even though it's using a local AI model, you still need to be connected to the internet. And I know this because when I first did hands-on May 20th, you could turn off the wifi and do the image creation in a photos app it and it had no filter so you could put Bill Gates, you know, whatever. - [David] Sure. - [Tom] You could do the typical Mario stuff and it would generate it and it was really bad 'cause it's Stable Diffusion, it wasn't very good but you could do it. But they've changed that now. So you have to sign in, you have to be online, even though it's using an AI local model to do that. - [Nathan] The same is true for Cocreator. - [Tom] Yeah. - [Nathan] Like, it generates it on device with the limited model that it has and then it runs it by the safety filters just in case. - [Tom] That's right, yeah. - [Nathan] But it could just, why not just send it off to a more powerful model somewhere else? - [David] Yeah, it's an odd way of doing that. You're actually doing all the hard stuff in the place where you wouldn't wanna do the hard stuff. It's a very weird system. In general though, it feels like, the read on these so far, at least to me seems like, the basics are good, right? That, like, Tom, what you're saying is that the Windows on ARM thing is a much bigger deal that it's like, okay, we've now done the thing, that- - [Tom] Yeah. - [David] Windows now works pretty well on ARM, we'll solve some of these last remaining apps and use cases. But the question of like, so what do we do with that? Doesn't really seem like it's been answered yet, that like the... And I guess maybe that's supposed to be Recall, right? That like, this is what we get with all this new stuff, but the like, what is now possible and cool and new and exciting because we've made Windows on ARM work and because these Qualcomm chips are good, it doesn't really feel like either of you have found a super exciting compelling answer to that yet, is that fair? - [Tom] No, I think it's because they're pretty much laying the groundwork for this stuff. So it's kind of like build it and they'll come. That's their approach, right? And obviously, Recall is supposed to be the flagship feature here, but obviously we can't try it yet, so. I mean, I have been using it for like two weeks on the Surface Pro X when it was, you know, you could hack it to get it working. So I've got some falls on it. But yeah, I feel like even with that, it's not like a massive selling point, like, that's not really, I don't think the reason you're gonna buy this laptop, it's mainly 'cause you want a good performing laptop that's thin and light and that actually has good battery life, you know? And that's as a base model at 999 bucks is like pretty compelling, like a $100 less than a MacBook M3 model. That in itself is compelling enough I think to get people to buy it. So I don't know why Microsoft had to kinda like put these AI tricks in there that aren't, they're not really that impressive, maybe Recall, yeah, sure, might be impressive but controversial. - [David] Nathan, is that where you've landed too? Kind of very good device, nice job, but this is not like a brand new day for the PC era yet. - [Nathan] Yeah, I mean, I think that all of the AI stuff is, they have this processor and they're trying to figure out reasons to use it. It's free real estate. They're looking for something to do with AI because AI is buzzy, it's on the chips anyway. They've got the NPUs, you gotta find something to do, but the reason to buy this thing, yeah, like Tom said, it's got good battery life. it's nice! (laughs) (David laughs) Yeah, it's a third option. It's a good option. Not for gaming but for like normal productivity stuff, like, seems like a good value. - [David] Yeah. - [Nathan] And yeah, I just kind of ignore the AI stuff for now. Somebody will find something useful to do with it, maybe, probably, like, they've got the compute there, even just as it is. If that module wasn't there at all, I don't think I'd notice and it wouldn't change my opinion that much. - [David] Yeah, that's fair. I'm sitting here looking at my new iPad Pro and I feel precisely exactly the same way about it. - [Nathan] I tried to work on an iPad a couple weeks ago on vacation and I hated every second of it and I was like, \"Why can't they just,\" you know the refrain. - [David] Oh yeah. - [Nathan] Just put Mac OS on it, whatever. Just put a real operating system on it. I will say I got the Surface Pro and I opened it up and it was like a real operating system. I can have two Windows side by side. I can run something in the background, I can do stuff, I can download utilities. I have a clipboard manager, you know what? And I can still watch Netflix if I really want to. - [David] It's not a bad setup. Alex Cranz has been running around for two months saying, \"Everybody who thinks they want an iPad Pro actually wants a Surface.\" And I think she's not crazy about that. - [Nathan] No, she's not wrong. I mean, you very much still are using Windows 11 and therefore you're on, you're like, especially on a Surface, you're like, fully locked into Microsoft's vision of the future of Windows, which involves a lot of opting out of things. - [David] Hm. - [Nathan] In my experience they're just really trying to push certain things, like, \"Would you like to use Edge? How about Binging it?\" I had a very funny moment where I logged into my Edge account 'cause I use Edge on by a normal Windows laptop and it's like, \"Fantastic, thanks for using Edge the default browser. Now you're Binging stuff again.\" That's not the search engine I asked for, thank you. - [David] Yeah, no I'm good on that, I'm good on that front. Alright, this is actually a good segue into a question we got on the hotline. We need to take a break really fast. Can you guys stick around and help me answer this question? (energetic upbeat music) - [Nathan] Yes, sure. - [David] All right, cool. We'll be right back. (energetic upbeat music continues) (funky upbeat music) All right, we're back. Let's do a question from the Vergecast hotline. As always the number is 866-VERGE11, send all of your questions. You can also email vergecast@theverge.com. Send us all of your questions. The weirder the better. We've gotten some weird ones and I enjoy it very much. This week we have a question about precisely what we've been talking about and it comes from Dean. (Phone beeps) - [Dean] Hey, my name is Dean, I'm from Northern Virginia. The question that I have is regarding Windows 11 computers and what's gonna happen in the market, now that the new Windows on ARM units are being released, will the market be some new style Windows 11 and some of the old ones still on the market or do you think soon the X86 architecture will be completely gone and people will only be able to purchase the so-called AI PCs and I was wondering if there'll be a massive, you think there'll be massive fire sale as the X86 inventory gets cleared out. Do you think there'll be a high end, low end situation where the new architecture will be at the high end and the X86 will be at the low end? Just wondering how you see the PC market shaking out once the AI PCs, Windows on ARM PCs come on the market? Thank you. - [David] All right, Nathan, you were making several faces during that. Tell me what you think. - [Nathan] I do not think that Snapdragon, I don't think that ARM is going to wholesale replace X86 for Windows computers. Certainly not on the low end because at least for now Microsoft is mandated 16 gigs of RAM and I think it's 256 gigs of storage and the cheapest Copilot+ PC we've seen so far is about a grand. I don't think we've seen anything under the 999 mark at the moment. They don't really have anything that can compete with like a $400 Windows laptop on price nor do they have anything for gaming. They don't work right now with dedicated GPUs. The internal GPUs are not for gaming at all. - [David] No. - [Nathan] I mean you can do some casual stuff but they're not gonna wholesale replace. I don't think it's gonna be a high, low either because I think there's still gonna be your high end X86 stuff, not just for gaming but for anything that requires serious graphical processing, also compatibility issues. Like, I think this is gonna end up at best, It'll be a third option at the soda fountain and I think a good option for a lot of people, especially for the productivity thin and light space. But yeah, we have a lot of unknowns about how Intel's next processor architecture is gonna go Lunar Lake or like and Tom I think can speak much better to that. - [David] Yeah, Tom, I'm curious (indistinct) your read on this, because you've been reporting a lot on how bullish Microsoft is on all of this and how much kind of muscle and marketing weight it's putting behind this. And I feel like if I were to squint at it a little, I could imagine a world in which Microsoft is really excited about, you know, ARM being the future of everything on Windows. What is your sense of where we're headed there? - [Tom] Yeah, I think it's, look, they obviously tried to start doing this since 2012 and it's been a long time coming and I think this is the beginning of a transition. I don't know if it will fully, you know, displace Intel and AMD, but I do wonder if AMD really has much of a market in the laptop side of things going forward 'cause they're always a second choice anyway and now this kind of, does this make them a third choice? I don't know, like, it's gonna be interesting to see how that shakes out. But then Qualcomm are about to rev their chips next year as well, so which will probably be coming around about the same time as we see M4 MacBooks. So that's gonna be interesting. So I think this is a train that's not gonna slow down now. It's kicked off the way it should have done originally or at least a few years ago anyway. And I think it's definitely not gonna slow down. I wouldn't be surprised if we see a lot more ARM sort of PCs and cheaper ones in like, sort of like, the 2025-2026 era, so- - [David] So it seems like best case scenario is not that ARM wins, but that this just makes everything more exciting and more competitive, right? That Intel has to get its act together because there's real competition and so it starts doing better and AMD starts doing better and all of a sudden we have a bunch of really good options instead of a bunch of, I would say increasingly non-competitive options, which is where we've been for a while now thanks to Intel. I also wonder about that because then it's like, okay, how do you make a Windows that works with everything, all of these ways? So, I guess, Nathan is the best outcome here that we get, one winner or the other in some meaningful way because it'll, like, make the software better and make everything make more sense. Or should we, you know, let 1,000 chip flowers bloom and everything will be fine. - [Nathan] I mean, that's Windows, isn't it? Let a chip, 1,000 flowers bloom, like the whole thing backwards compatibility, forwards compatibility, sideways compatibility, like- - [David] But that's been part of the challenge, right? Like, I think that- - [Nathan] Yeah. - [David] If you wanna describe whatever mess exists inside of Windows, I think you can ascribe a lot of it to that exact thing. - [Nathan] Yeah, you can. I mean, I don't think if there's gonna be a winner, an overall winner, I don't know, I just don't see it. There's so much on X86, I don't think it would be ARM, like they don't have the pull, they're beholden to huge enterprise deployments in a way that Mac frankly is not. They can be like, \"Hey, heads up we're switching silicon entirely.\" - [David] (laughs) Right. - [Nathan] And you're gonna have to deal with it and I don't think Microsoft can or wants to do that, but yeah, maybe this makes things more complicated for developers. They're like, \"Okay great, now I gotta make an ARM64 version too.\" - [David] So, it does seem like the idea that these Copilot+ PCs are going to like, immediately sweep the market and be so much better that they're going to, like, take over, at least from y'all's experience so far, it doesn't seem like we're there yet, that this is, what we have is like a meaningful new competitor, not an entire new paradigm that is so much drastically better than anything we've had before. Maybe we'll get there, maybe buying an ARM thing right now is a smart future proofing decision as this stuff gets better. But it doesn't sound like either of you would sort of going away, say, this is the obvious new future and everything else is going to be relegated to the side quickly, right? Is that fair? - [Tom] It's definitely important to point out that the Copilot+ stuff isn't just ARM. - [David] True, yeah. - [Tom] So there is gonna be Intel and AMD ones coming and even like that listener, who asked the question, like, is this gonna be like a transition, is this gonna be a fire sale? No, like, that's not really gonna happen because essentially the premium end of the market is gonna be all Copilot+ PC from now on. Like that's just the standard thing apart from like maybe the gaming laptops are slightly different, but even some of those are gonna be Copilot PCs, we've seen those from Nvidia or an AMD but yeah, no, I don't think it's like a sweeping transition to ARM instantly, but I think it's like a slow burn, like AMD and Nvidia are both rumored to be doing ARM chips for 2025 for PCs. So if they do that then that puts a lot of additional pressure on Intel. So it's gonna be interesting. - [David] Yeah, it does seem like 2025 is shaping up to be a pretty fascinating year in this space, that like, we're gonna see everybody's chips on the table in a pretty new way with all of this coming out and we're gonna have some real answers to like, where is all of this headed. Whereas right now, even with the ARM stuff in front of us, what this whole market looks like, is still just like this much theoretical, we don't have quite the features, we don't have Intel's new stuff, we don't have AMD's new stuff. Like, we're almost to knowing everything, but we haven't quite seen all of it yet. And I think next year it might be that time. (energetic upbeat music) Tom and Nathan, thank you so much. - [Nathan] Thank you. - [Tom] Thank you. (energetic upbeat music continues) - [David] Alright, that is it for the \"Vergecast\" today. Thanks to everybody who came on the show and thank you as always for listening. There's lots more on everything that we talked about from those Surface Laptops to my story on the BOOX Palma and lots of other stuff @theverge.com. I'm gonna have a story about the Daylight DC1 probably sometime this week. So keep an eye out for that. We'll put some links in the show notes. But as always, read the verge.com, it's a cool website and if you have thoughts, feelings, questions, or you live in the DC area and wanna teach me how to play pickleball, you can always email us at vergecast@theverge.com. Call the hotline, 866-VERGE11. We love hearing all of your questions and thoughts and ideas and feedback on everything. We have lots of fun stuff planned for the rest of this year and we're trying to do some weird new stuff on the show. So if you have ideas of stuff you want us to do, we'd love to hear it. This show is produced by Andrew Marino, Liam James, and Will Poor. The \"Vergecast\" is a Verge production and part of the Vox Media Podcast Network. Nilay, Alex and I will be back on Friday to talk more about some Copilot+ PCs, lots of other gadgets stuff, more AI news and everything else going on in tech. We'll see you then. Rock and roll. (energetic upbeat music continues) (energetic upbeat music fades)",
    "transcript_keywords": [
        "Yeah",
        "BOOX Palma",
        "thing",
        "stuff",
        "Palma",
        "Surface Pro",
        "things",
        "Windows",
        "BOOX",
        "good",
        "Surface Laptop",
        "Kindle",
        "Ink Android devices",
        "time",
        "BOOX Palma kind",
        "Windows laptop",
        "Laptop",
        "Surface",
        "Pro",
        "lot"
    ],
    "transcript_entity_values": [
        "8,100",
        "Android",
        "three",
        "thousands",
        "Antonio",
        "the first day",
        "the X Plus",
        "50%",
        "Two",
        "Tom Warren",
        "Pogo",
        "a pretty fascinating year",
        "the next morning",
        "about midday",
        "Wikipedia",
        "third",
        "the Windows Studio Effects on the webcam",
        "15 inch",
        "Tom",
        "David] Nathan Edwards",
        "Google",
        "Matt",
        "the weekend",
        "Photoshop",
        "the last several weeks",
        "around about 20%",
        "70%",
        "IPX",
        "MacBook Air",
        "the Surface Connector",
        "32",
        "the DC area",
        "WhatsApp",
        "BOOX",
        "Renaissance",
        "Raindrop",
        "Liam James",
        "Instagram",
        "Bill Gates",
        "Slack",
        "2012",
        "next year",
        "a few days",
        "six nights",
        "Train Dreams",
        "2025-2026",
        "Windows",
        "AI",
        "280",
        "Readwise",
        "Vergecast",
        "27%",
        "four years old",
        "the months",
        "Oasis",
        "4",
        "these days",
        "2025",
        "1,000",
        "a Surface Laptop Studio",
        "First",
        "Kindle",
        "one",
        "David] Slack",
        "999",
        "David] Interesting",
        "the BOOX Palma",
        "Kindles",
        "Spotify",
        "100,000",
        "six",
        "over 1,000",
        "the past 10, 12 years",
        "Crosswords",
        "Amazon",
        "72",
        "iPod",
        "seven seconds",
        "Gorilla Glass",
        "16",
        "zero",
        "4-year-old",
        "GQ",
        "New York Times",
        "Palma",
        "Vox Media Podcast Network",
        "Andrew Marino",
        "Air",
        "Surface Laptops",
        "David] Tom",
        "This year",
        "1,200 bucks",
        "This week",
        "Edge",
        "Instapaper",
        "Palmas",
        "about 50%",
        "Vergecast",
        "E Ink",
        "seven hours",
        "Snapdragon",
        "Recall",
        "like two weeks",
        "13 inches",
        "Ai Pins",
        "a few weeks",
        "first",
        "IP",
        "Welch",
        "7th",
        "Joanna Nelius",
        "the next day",
        "the past week",
        "AMD",
        "Matt Martin",
        "Android 11",
        "Tom] Hello",
        "the Nest Hub Max",
        "400",
        "Hacker News",
        "the Apple Watch",
        "later this year",
        "Craig",
        "866-VERGE11",
        "the New York Times",
        "1",
        "sec",
        "a minute",
        "M3",
        "a couple of months ago",
        "Reader, Readwise Reader",
        "Apple",
        "Creative Cloud",
        "2,100",
        "13 inch",
        "Readwise Reader",
        "around four hours",
        "the Ray-Ban Meta",
        "years",
        "Instapaper",
        "the last couple of months",
        "half",
        "five minutes",
        "the Surface Pro 11th",
        "David",
        "350",
        "E Inc",
        "Recall",
        "Surface Pro",
        "Joanna",
        "11:00 PM",
        "iPhone",
        "Mac",
        "Nvidia",
        "at least a few years ago",
        "Connections on here",
        "early May",
        "Windows",
        "two months",
        "Audible",
        "last fall",
        "the last week",
        "Obsidian Sync",
        "the Humane Ai Pin",
        "Earlier this year",
        "Mario",
        "2%",
        "CPU",
        "a couple of years ago",
        "iPad Pro",
        "Northern Virginia",
        "Google Maps",
        "Alex",
        "a million",
        "YouTube",
        "Dungeon",
        "David Pierce",
        "11th",
        "the Pro Flex Keyboard",
        "Obsidian",
        "Lunar Lake",
        "the \"New York Times",
        "a full day",
        "Slack",
        "a month or so",
        "Windows 11",
        "MacBook M3",
        "a couple weeks ago",
        "iPad",
        "1200",
        "Blender",
        "NPU",
        "25%",
        "100",
        "this year",
        "China",
        "five",
        "Flex",
        "the Slim Pen",
        "Netflix",
        "44%",
        "Friday",
        "the Surface Laptop",
        "Surface Laptop and Surface Pro",
        "David] Windows",
        "Barnes & Noble",
        "Kindle",
        "Google Drive",
        "Readwise Reader",
        "100%",
        "a day later",
        "Clockwise",
        "Esquire",
        "256",
        "another day",
        "the 90%",
        "USB-C",
        "second",
        "Jeff",
        "500 bucks",
        "Intel",
        "58%",
        "Nathan",
        "David] Nathan",
        "999 bucks",
        "999.99 cents",
        "Cinebench",
        "Surface Laptop",
        "six hours",
        "120",
        "Psych 101",
        "Dean",
        "David] Craig",
        "Denis Johnson",
        "Image Cocreator",
        "webcam",
        "one millimeter",
        "Talese",
        "5 to 10%",
        "32 inch",
        "Pocket Casts",
        "Nathan Edwards",
        "David] Nice",
        "Slack, Slack",
        "600",
        "those six hours",
        "seven",
        "just four",
        "that day",
        "AMD",
        "Craig Mod",
        "six years ago",
        "30%",
        "the Surface Pro",
        "BOOX",
        "a few minutes",
        "Elite",
        "Alex Cranz",
        "between like a few days",
        "20",
        "workday",
        "Italian",
        "jack",
        "30 minutes",
        "Chrome",
        "NOOK",
        "E Ink Android",
        "TikTok",
        "Microsoft",
        "Kindle",
        "RAM",
        "Arc",
        "15, 20 hours",
        "David] Mm",
        "the last year",
        "Nathan",
        "GPU",
        "two week",
        "Stable Diffusion",
        "May 20th",
        "999",
        "David] Hm",
        "Qualcomm",
        "the Surface Pro X",
        "Edge",
        "every two seconds",
        "14 years later",
        "a year ago",
        "Snapdragon",
        "Surface",
        "at least a couple hundred",
        "Windows",
        "lemme watch MKBHD",
        "Adobe",
        "pogo",
        "Pencil Pro",
        "David]",
        "6.1 inch",
        "Mac",
        "Libby",
        "Palma",
        "today",
        "70 whatever percent",
        "Slack and Discord",
        "Matt] Integrated",
        "two",
        "the last three months"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "TIME",
        "TIME",
        "PERSON",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "FAC",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "TIME",
        "EVENT",
        "PERSON",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "PERSON",
        "PERCENT",
        "ORG",
        "DATE",
        "PRODUCT",
        "LOC",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "ORDINAL",
        "LAW",
        "GPE",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "DATE",
        "GPE",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "FAC",
        "LAW",
        "PERCENT",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "PERCENT",
        "PERSON",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "QUANTITY",
        "NORP",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "EVENT",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "NORP",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE"
    ]
}