{
    "id": "0mipec0cg2Y",
    "title": "Samsung Z Fold 5  'Shock Dispersion Layer' FINALLY REVEALED!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-08-25T14:35:00Z",
    "video_url": "https://www.youtube.com/watch?v=0mipec0cg2Y",
    "category": "Howto & Style",
    "tags": [
        "Samsung Z fold 5",
        "Galaxy Fold 5",
        "Fold 5",
        "folding phone",
        "smartphone",
        "android",
        "iphone",
        "samsung",
        "apple",
        "z fold 5 teardown",
        "z fold 5 screen repair",
        "suspension layer"
    ],
    "views": 1127784,
    "likes": 31994,
    "comments_count": 1177,
    "description": "Today we take apart the new Samsung Galaxy Z Fold 5 to reveal the all new hidden suspension layer under the flexible folding screen. Grab a teardown skin for your own phone HERE:  Get the Z Fold 5 at Samsung:  Watch the durability test of the Fold 5 HERE:   And watch the Lithium Battery Recycling video HERE:",
    "description_links": [
        "http://www.dbrand.com/teardown",
        "https://howl.me/ckF4arEkSiT",
        "https://youtu.be/5y7a1Eb6QR4?si=p9G1J3Ko9UScr1Wl",
        "https://youtu.be/s2xrarUWVRQ"
    ],
    "transcript": "One of the very few things that Samsung changed on the Z-Fold 5 this year is the hinge. And supposedly they added a new shock dispersion layer underneath the flexible screen. Is this shock dispersion layer made from some flexible foam, a padded pillow, or maybe some squishy springs? There's only one way to find out. Let's get started. [Intro] Now it's no surprise to anyone that the Samsung Z-Fold 5 is incredibly difficult to take apart. Not only does it have super futuristic hardware, but it's also IP68 watertight. The IP rating makes it hard for water to get inside...and also me, since I'm 70% water. The plastic bumper around the flexible screen is attached extremely well. I can imagine that this display can be replaced easily, but only after sacrificing the original. Ugh dang it. Not too big of a deal in my opinion. There's no other hardware under here that ever could need replacing. And as you can see by the lines of dead pixels passing through the layers, this is probably not going to end well for the flexi bits. If it dies, it dies. With the plastic borders finally all the way removed, I can try lifting up on the folding display, slicing behind all of the layers till we reach the metal frame of the phone and prying up with my razor knife. And this time it looks like there are ribbons passing through the frame on both sides of the phone. To properly replace this screen we would have to open up the rest of the device and unplug these ribbons like little Legos. But since it's already broken anyway, we can just rip it off from here. This is definitely not a tutorial for how to properly take apart a Z-Fold 5. With the screen successfully unsuccessfully removed, we see that on the metal frame of the phone Samsung has added a very thin layer of foam, strips of black cushions with little circles cut out. Personally, I don't think this has anything to do with the shock dispersion layer. I think this is more to compensate for deviations or tolerances from milling out the armor aluminum. With plastic injected into the aluminum frame, and a transition lip from the hinge, there are a lot of variances or tolerances to compensate for them. Samsung has not confirmed this publicly or to me personally of course. Samsung and I don't talk much. I can't imagine why. Now while this aesthetic gold piece of perfection might appear as if it has some cushion to it, this is also not the shock dispersion layer. This gold sheet with vertical lines running throughout the surface is actually the digitizer for the s-pen. The lines are able to sense the copper coils in the tip of the s-pen and accurately let the writing utensils scribble on the large center screen. Kind of nifty. Would be niftier if Samsung could find room inside of the Fold 5 to store the s-pen, but at the moment that is not the case. And an external case is required to transport the pen. The cool gold digitizer is located on both sides. The 4 megapixel internal selfie camera peers out through this tiny cutout on the screen. The pixels turn off and the camera can see out through the mesh just like back in the day where you can see clearly out of a screen door when you were a little kid wanting to go outside with your face pressed up against the mesh. Now as an adult you can go outside whenever you want, but here we both are. The new shock dispersion layer I think is this guy. Or at least I thought so until I remembered that the Galaxy Fold 4 had the same fiber reinforced plastic layer. It was the Fold 3 that had the metal panel as the screen support. So if the fiber reinforced display support isn't the shock dispersion layer, I guess what Samsugn is talking about is back to the original foam that we saw at the beginning with the circular cutouts that's attached to the frame. Kind of anti-climactic, but any protection is good protection. And that thin layer of foam probably does help out. But now we know why Samsung doesn't talk about it much, since it isn't all that cool. Samsung is still using their ultra thin glass as we can see from the intricate cracks throughout the whole screen. And since on this teardown we've done everything incorrectly so far, we haven't encountered any screws. We should however start to see some as we enter the phone from the correct direction, starting from the back glass panel. Samsung says this slab is made with 22% recycled glass. Not bad. It's fairly difficult to remove from the phone since the slab is recessed into the frame walls, but it is still doable. The front glass display is quite a bit harder. I don't know if I was being too aggressive or my suction cup was being too sucky, but the front glass shattered even though it was blisteringly hot, the adhesive underneath was not softening. It would be extremely unfortunate if Samsung has switched to the temperature-proof glue that Apple uses on their back glass that can only be removed by lasers. I made a whole video about lasering away permanent glue. It would be a very sad day for repairability indeed. Hopefully it's just my unit being weird. One glorious day for repairability, however, gets revealed after we remove the 15 watt wireless charging pad when we see the dark blue Samsung battery pull tabs. Absolutely phenomenal. Can't wait to give it a tug. I'll pull out the NFC coil which works. Not to be confused with NFTs which don't work. Then we remove the 3 screws from the bottom left plastics, 4 screws from the bottom right plastics, and 10 more screws from the motherboard plastics, bringing our total so far to 17. I'll remove the extension ribbon, popping off each end like a little Lego, and then the upper plastics get set off to the side. We can unplug the battery, fingerprint, power button, and the volume rocker before removing one more extension ribbon going down from the main board to the USB board. Then we can pull out the battery - and pull out it does...easily, quickly with no alcohol or prying. Ten out of ten, Samsung. If I had more than 2 thumbs I'd put them all up. The first and smaller of the two batteries is a 2020 milliamp hour capacity. The charging port board has two more screws and with those gone we get our first look at the 25 watt USB-C charging port which does have a red rubber ring around the opening. Also down here we have our rectangular vibrator motor, with little lazer weld tacks keeping everything shut tight. At the bottom of the other half of the phone we have our black plastics and lower loudspeaker which has a transparent blue sticker so we can see the little foam balls inside, which I'm pretty sure fills the entire cavity from the window to the wall. There are 7 more screws holding in the upper plastics, bringing our total up to 26. Again, the upper loudspeaker has another blue window so we can see the foam balls inside. With a few more extension ribbons unplugged, we get access to the larger secondary battery. And again with a dark blue pull tab, it comes right out. Now you might have noticed that I did a few things wrong here. One, I forgot to unplug the battery. And two, I forgot to remove the SIM card tray. I did this on purpose of course, to help future explorers who might be following in my footsteps so they can see and avoid these little pitfalls. You're welcome. Also the larger of the two batteries is 2,380 milliamp hours for a total of 4,400. I just released a fantastic video on how cell phone and electric car batteries are recycled by the way. I'll leave a link for that down in the description. Next out, we get one of the 5G antennas. Always cool to see these little guys. There's another 5G antenna to the left of the camera modules. Speaking of which, the 10 megapixel front-facing selfie camera does not have OIS. The motherboard has two black screws holding it down before we get access to the rest of the cameras. Very interesting to note that there is no thermal paste on the back of the motherboard. There was no thermal paste on the Fold 4 either. Nor does any thermal paste appear in the S23 lineup. Samsung just doesn't believe in thermal paste I guess. Kind of strange, but if it works, it works. One thing that Samsung did not mention, however, is how fun the connectable camera units are. Camera units all have to be very precisely lined up so as the lenses switch in software, all the hardware can transition seamlessly. And these little pins and holes are pretty nifty. The 10 megapixel 3x telephoto camera does have OIS. The main 50 megapixel camera also has OIS, and the top 12 megapixel ultra wide camera does not have optical image stabilization. I'll pop off two more screws so we can check out the waterproofing on the ribbons that pass through the hinge, 28, and it looks like we have the same soft rubbery caulking that we saw last year, keeping liquids and dust from entering the phone body from the hinge. Speaking of which, the hinge has 12 more screws holding down plastic plates over the mechanism. We're not at 40. With those gone, the new flex hinge is revealed in all of its glory. There's still quite a few moving parts: springs, guide rails, and what Samsung is calling a dual rail structure. The top portion is looking rather dirty. This has got to be for my bend test. But it looks like the super tiny particles of dirt that were able to get inside are super tiny. None of them being big enough to disturb the actual function or sound of the hinge. There are three portions of hinge. An upper portion, a mid portion, and a lower segment. I'll remove 11 screws from that lower portion so we can get a close-up look of how it works. With how expensive this phone is, we're going to appreciate every single detail and get every penny's worth. So feel free to hit that subscribe button if you've enjoyed the...educational content thus far. If you notice, the lowest portion of the hinge is just a guided channel so the two sides of the phone are constrained together and can't twist out of alignment. These flap freely without any resistance. The folding resistance is provided by 4 springs that compress and pinch as the rest of the hinge moves closed. No rotating gears this time around, just sliding shafts. Super cool. If we add up the 14 screws in the center portion and the 11 screws in the top with the two additional screws we found near the power button on the other side, we have a total of 76 screws inside the Z-Flip 5. Incredibly complex. Incredibly interesting. And incredibly expensive. What's not expensive however, is seeing the insides of your smartphone with my Teardown Skin. All of the internal beauty with none of the external dismantling. I'll leave a link down in the description so you can pick up one for your own phone, and thank you for supporting the channel. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "shock dispersion layer",
        "Samsung",
        "screws",
        "dispersion layer",
        "phone",
        "layer",
        "shock dispersion",
        "hinge",
        "screen",
        "camera",
        "Samsung changed",
        "plastics",
        "shock",
        "dispersion",
        "frame",
        "phone Samsung",
        "plastic",
        "inside",
        "flexible screen",
        "foam"
    ],
    "transcript_entity_values": [
        "40",
        "the Galaxy Fold 4",
        "Samsugn",
        "50 megapixel",
        "Samsung Z-Fold 5",
        "22%",
        "Lego",
        "17",
        "76",
        "two",
        "ten",
        "three",
        "2,380 milliamp hours",
        "4 megapixel",
        "one",
        "25 watt",
        "the Z-Flip 5",
        "12 megapixel",
        "only one",
        "4",
        "SIM",
        "11",
        "10",
        "10 megapixel 3x",
        "this year",
        "the Z-Fold 5",
        "28",
        "5",
        "Apple",
        "NFC",
        "26",
        "4,400",
        "first",
        "last year",
        "15 watt",
        "milliamp hour",
        "Samsung",
        "70%",
        "12",
        "more than 2",
        "3",
        "One",
        "2020",
        "USB",
        "Ten",
        "a Z-Fold 5",
        "10 megapixel",
        "the day",
        "14",
        "7",
        "IP"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}