{
    "id": "0OCEo2n7vLw",
    "title": "Finally answering your questions...",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-11-18T15:27:26Z",
    "video_url": "https://www.youtube.com/watch?v=0OCEo2n7vLw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 217236,
    "likes": 9215,
    "comments_count": 1043,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(jovial music) - Oh, hi! Didn't see you guys over my 16 inch MacBook Pro. Today we're doing an ask iJ episode, I haven't done one of these in so long. That's where you guys ask me questions and I answer, and all of these questions I took from Twitter. A ton of you asked me what do I think of the new MacBook Pro, and obviously I love it. I'm going to be doing a bigger video talking about it very shortly, but so far it's been awesome. It has stayed so much cooler when I edit on my lap, and that little bit of screen real estate has actually made a huge difference when I'm editing in Final Cut. So I have been extremely happy, but lets get into the rest of the questions. Where should I put this? I'm gonna put it off to here, is that okay? I haven't done one of these in a while. We're gonna start with this first question from Nicholas because it's something that I'm extremely excited about, and something that I've been wanting to tell you guys for so long. I did make one video talking about it, but I am doing a conference on January 31st and February 1st in Los Angeles. We're calling it Vlog University, and for those of you who have been a part of my channel for a really long time, you might remember it's something that I started about nine, 10 years ago. So next year, 2020, is the ten year anniversary of Vlog University, and what better way to celebrate a crazy idea that I had when I feel like I was still a child, is now a massive conference that we're having in Los Angeles. It's basically going to be two days filled with speakers, incredible instructors, to basically teach you everything you need to know to become a content creator. So all of the things that you're gonna learning about, video editing, production, lighting, photography, even make-up tips, script-writing, what gear to get, we have lawyers, we have people from my team, my manager, my agents, everyone kind of inside my little iJustine bubble, we're all gonna be there and giving you guys some of the things we have learned over the past 13 years. To be able to do this, to give back to you guys and to be able to meet a bunch of you, who wanna become future content creators, is honestly the craziest, coolest thing that I think that I will ever be able to be a part of. So I look forward to seeing many of you guys there. Check out Vlog University for more information, and at checkout use ijustine10 so that you can get 10% discount. If you do plan on attending, make sure you register before December 31st, that way you will get not only a free T-shirt, but we'll be able to have a better sense of how many people will be attending. There's a lot of planning that's going into this, we've been working on this for the past year, and I could not be more excited! So, Nicholas, thank you for your question. This is a really great question from Caitlyn, and she's asking \"What is the biggest thing that you've learned so far in your career, and what do you think the future of YouTube and content creators will be?\". I love this question because it kind of segues very well from the Vlog University concept, and really what I wanted to do with that is I wanted to give all of the knowledge and the insight that I've learned over the years, and one of the biggest lessons that I've learned, I'm just gonna give it away here, is just keep going. There's been so many times throughout my career that I've questioned what I'm doing, I've questioned myself, I've questioned people around me, and you just get to a point where you have to just keep going. There's always something else that's going to happen next. You just kinda get to that point, and sometimes it's not easy, it can be extremely difficult. Life can get in the way, people can get in the way, but you just have to, I guess, kind of trust yourself to know that you're strong enough to keep going, you're strong enough to pave the way for whatever it is that you wanna do, and I know it sounds absolutely crazy because if I was sitting here, years and years ago, listening to somebody tell me these things, I would say \"You're crazy!\", but until you sort of live these life experiences, or you get to a point where anything that I'm saying makes sense, it's not going to make sense. Answering your second question, what do I think of the future of YouTube and content creators will be? I mean I have no idea, I just hope that doing the Vlog University, having fun events, and having a safe place where people can talk, make friends, and find other people in this industry that are doing the same things as you are is so amazing, 'cause when I started there was nobody else doing this I had no friends doing this, everyone thought I was crazy. I mean, I definitely was because no one else was doing this, everyone told me I should stop, I shouldn't do this, I remember one of my old bosses at my job, when I quit my actual job, he basically told me that I was going to amount to nothing, and I basically took that pain and anger as motivation, of like, \"Well, you don't think I'm gonna be anything? Well I'm gonna completely prove you wrong\", so sometimes that negativity can be completely flipped around, and you can use it to your advantage. Did I answer your question? Probably not. Ken Schillinger is ask- (stumbles) I probably pronounced your last name wrong. Shh-ba-dur! Am I ever going to do cooking videos again, you miss them? I honestly do miss them a lot, but it kinda turned into this thing, where I used to use cooking videos as filler content between tech videos, but now I feel like this year there has been so much tech that it's kind of taken over for the cooking videos. I do plan on doing some holiday videos, so if there's anything that you'd like to see me bake for the holidays, please, please, please leave it in the comments below, and hopefully I can make you some delicious holiday delights. This is a very interesting question from Lakshay, \"All of my social media links state \"be my friend\". There's a difference in being a follower and a friend, now will you consider changing it?\" It's crazy, because in the beginning, when I first started doing this stuff, everyone was a friend, I knew every single person that was following me because it was such a small community and a small audience that everyone knew each other. I would recognize peoples avatars, I would see the same people tweet me all the time and it's crazy because even though I do have a bigger audience, I'm still reading my comments, I'm still on Twitter, even though I may not respond to everything. I recognize the people who continually tweet me, I recognize people who comment all the time. I sometimes think that you guys don't think that I do read my stuff, but I do, I'm here all day on Instagram, on Twitter. Whit that being said though, I've cut back significantly because I think that through the years, I was so focused on social media that I wasn't living my own life, so I think that I've finally found a happy medium between that. I still definitely spend way too much on my phone, too much time on my computer, but I've cut back a lot. I guess the answer to your question though, I'm not gonna be changing it to follower because I still consider you guys friends. Owen is asking, \"What are my thoughts on the rumors of the 2020 iPhone 12, or is it too early?\" Oh my gosh, it's definitely not too early because I feel like everything in that 2020 iPhone has already sort of been leaked. I do remember last year, this design of the iPhone was leaked in like January. Who really knows any more? Let's see if there's any latest rumors. iPhone 2020. All right, MacRumors, what have you guys got for me? 5.4, 6.7 and 6.1 sizes, triple lens 3D camera with laser, all OLED displays, 5G, revamped design, A14 chip. It's crazy they have this much potentially leaked information. I just think that 5G is gonna be great, but unless it's in your area, unless you're near that tower, it's not gonna actually work very well, so I'm excited about 5G but I don't think the technology is really gonna be ready. I guess this is by September of next year. If we're going along the same timeline as this year and previous years, yeah this says Apple is expected to release the 2020 iPhone 12 in September of 2020. Under-display touch ID, I don't think they will do that. For some reason, I just really don't think that they're gonna waste their time. There's a lot other things that you can waste your time doing, like maybe a foldable phone, which I also don't think that they will do. So 2020 iPhone, I'm excited! Next question! \"Will I ever wait in line for an iPhone launch, like I did with the iPhone 6?\" That was such a crazy time! If any of you guys remember, my sister and I slept outside for 50 some hours to get the iPhone 6. This is back when the pre-orders were such a struggle, nothing ever worked properly. I just kept getting screwed trying to get pre-orders for my iPhone. So when I realized that I wouldn't have an iPhone for launch day, I asked my sister and some of my friends if they wanted to sleep outside, and we did, and it was an amazing experience. I definitely don't think that I really ever wanna do that again, but it's something that I did, it's something that I experienced, and I really don't ever wanna have to do it again. It was fun, but I think in my old age I don't know if I could handle it. Alec is asking \"What do I do to make myself feel better when you're feeling sad or depressed?\" It's taken me years to figure out what I need for myself to make myself feel better, and sometimes there's just no way out of it, you just have to keep going, keep moving, like I said before, just keep moving forward, keep going, don't quit. But what I found is, it's definitely exercise, working out, finding activities to do to kind of distract my mind from feeling the way that I'm feeling. Doing yoga, going for hikes, going for walks, just kind of getting out of my element, making myself sort of feel uncomfortable, but something that I also started almost a year and a half ago is I started training in Jujitsu, and I have not talked about this at all on my channel, so it's kind of weird that I'm even mentioning it. I don't post about it, I don't talk about it, I've never taken a single picture of myself training. But it's something that I do for myself, I don't do it for anyone else, and that has brought me this sort of peace, and this purpose outside of creating content, out of posting on social media. So find something that you do for yourself, you don't for anyone else, you don't do it for the internet, you don't do it for your parents or your boyfriend, girlfriend, sister, brother, whatever. You do it for you, and no one else. And it's crazy because some of my favorite achievements, even recently, are things that I've never even shared. Milestones that I've made training, friends that I've made at the gym, it's really crazy because for my entire life I have posted everything online, like I have posted so much, so to just completely flip a switch and decide that this is something I'm doing for me, and not the internet, it's incredibly refreshing. So I encourage anyone, whatever your mindset, whatever you're going through, to find something, find a new hobby, find something just completely out of your comfort zone and go do it, be uncomfortable. Oh god, I was probably uncomfortable for probably like 6 months. There's so many times even now, after training for almost two years, I still, every day, sometimes I will leave a session and I'm like \"Man, this is just so defeating\", but you keep going. It's a lot like life and I think that's why I really, really love it. One day, maybe, I'll make a full video talking about my experience, but right now it's still something that I'm doing for me, but I'm only mentioning this because I want you guys to do something for yourself, and hopefully you guys will have the same incredible experience that I've had doing this thing just for myself. Vikki is asking what I think of Instagram hiding likes, and it doesn't even matter any more, I don't ever even really look at likes any more. I mean, I tend to need them for brand deals, or for projects and things like that, obviously people want to know, but I just don't even care any more. I don't know if it's because I've been doing this for so long, and I think I just had the realization that none of this actually really matters. That realization, for me, has made me enjoy what I'm doing so much more, and Instagram hiding them, I think it might be a good thing because you do tend to compare yourself to people, you compare yourself to people who have more subscribers than you. How did this person get more like on this photo, and why did mine not do as well as this persons? It's so, so silly. There was definitely a time, doing YouTube and stuff like this, that I just started to stop enjoying it. It was maybe five or six years ago. I feel like it's every three years I kinda have this cycle of \"Yes, yes, yes, I love this! \"Oh shoot, everything is just falling apart!\" And then it kinda just keeps going back up. I feel like, not just with YouTube, but with life and for everyone, this isn't just YouTube, I keep stressing that because there's a lot of correlation between YouTube, people's careers, whatever it is that you're doing, it all is the same. Just because I'm sitting here talking to you, making this YouTube video, this it my job, this has become something that is work, and I'm so grateful that I really do enjoy it. I've had some jobs in the past that I didn't enjoy, and a lot of times you just have to do what you have to do, just get it done and really just keep thinking about what is it that you're most passionate about, and how can you turn that into a career? How can you use that passion to not only make money, but really enjoy your job. It's definitely not an easy thing, and I think eventually if you're persistent enough and passionate enough, I fully believe that you guys can do it. And I know this, speaking from my own experience, and I truly believe that if there is something that anybody wants to do, if they really wanna do it bad enough, they're gonna do it. I have faith in you guys. I'd love to hear from you though, in the comment, what is the one thing that you wanna do? What is something that you have done that you're super proud of? I'd love to hear it. William wants to know if we'll ever get an updated office tour. This is crazy because I actually am working on one right now, so when I saw this tweet I was like \"(gasp) You read my mind!\" Can't wait to show it to you guys, I have been waiting for one last piece of my office, and it was the TV so, spoiler alert, that's kind of what the video's gonna be about, but I can't wait to show you the new office tour, it's been so much fun to put together where I edit and where I spend a lot of my days, when I'm not traveling, 'cause usually I'm sitting on a plane, editing on this computer. Well that looks like that's all the questions we have! Thank you guys so much for watching, I appreciate you. I feel like I don't do these types of sit down videos as much any more, so if you enjoyed this please let me know, and I look forward to see you guys in the next video. Bye! (relaxed music)",
    "transcript_keywords": [
        "Vlog University",
        "guys",
        "people",
        "years",
        "kind",
        "crazy",
        "iPhone",
        "year",
        "question",
        "make",
        "feel",
        "things",
        "thing",
        "video",
        "time",
        "Vlog",
        "University",
        "videos",
        "lot",
        "years ago"
    ],
    "transcript_entity_values": [
        "Ken Schillinger",
        "September of 2020",
        "every day",
        "all day",
        "second",
        "5",
        "Whit",
        "one",
        "five or six years ago",
        "A ton",
        "William",
        "Vikki",
        "almost two years",
        "Nicholas",
        "Apple",
        "the ten year anniversary",
        "Vlog University",
        "the past 13 years",
        "ijustine10",
        "One day",
        "Instagram",
        "Today",
        "years",
        "iPhone",
        "2020",
        "50 some hours",
        "launch day",
        "Owen",
        "the years",
        "MacRumors",
        "Twitter",
        "YouTube",
        "Los Angeles",
        "Shh-ba-dur",
        "last year",
        "January",
        "December 31st",
        "years ago",
        "5.4",
        "Caitlyn",
        "6.7",
        "Jujitsu",
        "6.1",
        "10%",
        "the Vlog University",
        "10 years ago",
        "almost a year and a half ago",
        "like 6 months",
        "2020 iPhone 12",
        "A14",
        "Final Cut",
        "16 inch",
        "the past year",
        "this year",
        "next year",
        "about nine",
        "January 31st and February 1st",
        "Lakshay",
        "YouTube",
        "previous years",
        "first",
        "Alec",
        "September of next year",
        "MacBook Pro",
        "about 5",
        "two days"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE"
    ]
}