{
    "id": "0oChYfB96lo",
    "title": "Most Durable Smartphone of 2016 - Year End Summary Awards",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-12-17T14:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=0oChYfB96lo",
    "category": "Howto & Style",
    "tags": [
        "Most durable cell phone",
        "What cell phone is most durable",
        "Smart phone durability",
        "durable",
        "Drop test",
        "Scratch test",
        "how to fix cell phone",
        "What cell phone is most repairable",
        "Smart Phone Awards 2016",
        "Smart Phone awards",
        "mkbhd",
        "2016",
        "best smartphone",
        "iphone",
        "android",
        "best android"
    ],
    "views": 920459,
    "likes": 22610,
    "comments_count": 3645,
    "description": "2016 is over. And its time to evaluate all of the phones I have tested on my channel during this year. It was a tough choice trying to pick the strongest smartphone of 2016. There were so many good phones this year. The weakest was pretty easy.   CLICK TO SEE MORE   And there were a few failures of smartphones to add to the mix as well. 2016 was a very interesting year, and I have High Hopes for 2017!  Having a durable cell phone is important for the people who keep their phones longer than a year or two. Its important to get a phone that will last the test of time. ALSO its very important to always use a case and a screen protector on your device. I never recommend using your phone without protection.   You might have noticed that I didn't say much about the Galaxy S7 Active. This was intentional as I do not think the S7 Active should be winning any awards. 1) It is exclusive to AT&T, which makes it hard to obtain. AND its 'shatter resistant' screen is just glass covered in plastic. So, im sure its a good phone. But I don't think its a contender for this particular video.  --------------------------------------------------------- AWARDS:   Most Durable: HTC 10 Honorable Mention: OnePlus 3 Least Durable: NextBit Robin  Most Repairable: Google Pixel Honorable Mention: LG V20 Least Repairable: HTC 10  Most Innovative: Xiaomi Mi Mix Lease Innovative: iPhone 7  LG G5: Advertising Fail Note 7: A series of unfortunate events.  -------------------------------------------------------------  HTC 10 Durability Video:  HTC 10 Teardown:   Nextbit Robin Durability Test:   Google Pixel Durability video:  Google PIxel Teardown:   iPhone 7 Durability test:  iPhone 7 Screen Repair:   Mi Mix Durability test:  Mi Mix Teardown:   LG G5 durability test:  LG G5 Teardown:   Note 7 Durability test:  Note 7 Teardown:  Note 7 Explosion video:   LG V20 Durability video:  LG V20 Teardown:   One Plus 3 Durability test:  One Plus 3 Teardown:   Awesome Smart Phone Tool Kit:  Green Pry tool:  Phone opening metal tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/cQ62ixgzhrI",
        "https://youtu.be/T5uLJJnEHMk",
        "https://youtu.be/EU6Tv-OfXk0",
        "https://youtu.be/18nJ3hjUCTw",
        "https://youtu.be/0tKNn_w3Yfk",
        "https://youtu.be/0vYfAqEyGV0",
        "https://youtu.be/hIs6vLdHHKI",
        "https://youtu.be/_CZj-l9MJmg",
        "https://youtu.be/m5MkZC1uRZY",
        "https://youtu.be/0GQ43cF5TuU",
        "https://youtu.be/SyP_cEpp2Zo",
        "https://youtu.be/571pu66vEBc",
        "https://youtu.be/x3Iz0SPy2Ic",
        "https://youtu.be/_Cd2WIxKRDk",
        "https://youtu.be/nBlUL-7Dl4U",
        "https://youtu.be/KNgSDmkn96c",
        "https://youtu.be/8PZ8W_g6Vvk",
        "https://youtu.be/Hh_XgrcQ9oo",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "I've been systematically tearing down and durability testing every single new smartphone that has come out for the past few years. Cell phones are some of the most abused pieces of technology on the planet, and durability is pretty important. Today I am going to show you which phone is the MOST durable phone of 2016. And which phone is the easiest to repair. And we'll talk about some of the phones that failed in 2016 as well. Lets get started. [Intro] Lets start with the least durable phones of 2016. I tested about 30 phones this year. And only 3 of them completely failed my tests. The Xiomi Mi5... The Nextbit Robin... and Redmi Note 3... Hands down the weakest phone of 2016 is... the Nextbit robin. Designed purely from plastic, there is no structural integrity whatsoever inside the device. The motherboard screws go directly into plastic instead of metal like they would on a normal phone. Keep in mind, that this isnt a bad phone. I'm sure its great. It just didn't last long enough for me to try it out. Now lets talk about the most durable phone of 2016. This was a really tough choice. So many solid phones this year. My personal favorite: the Samsung Galaxy S7 felt super solid during my bend test. But both sides of the phone are made with glass, and glass does break easily when dropped, unfortunately. The ceramic Mi Mix is literally unscratchable, but once again, that ceramic material is even more brittle than glass... and So I have to go with the HTC 10 as the most solid and structurally sound phone of 2016. Its metal body and angled corners turn this phone into a very solid beast. But.. this also leads us into our next segment, the least repairable phone of 2016. This award also goes to the HTC 10. Not only is the thing glued shut. But there are 14 screws after the glue with 13 different connectors and a midframe inside of the phone that makes it a nightmare to repair. The easiest screen to repair in 2016 is actually the Google Pixel. The glass back of the pixel kept it from winning any durability awards, but when it comes to repair-ability, All you need is some heat and pop off two little screws. And the screen is set for replacement. And the best part about it, is that you can replace the screen without touching any other components inside the phone since they are protected by a middle separate layer. Its a pretty brilliant and fool proof design. A close runner up for the easiest phone to repair is the LG V20 There is no glue inside of this phone, which is refreshing, but you do have to remove every single component from the phone before you can swap out the screen, which gives more opportunitie for something to go wrong during the repair as everything has to be touched, and reconnected. Currently right now at the end of 2016 an LG V20 screen replacement costs 105 dollars, and a Pixel screen costs 135 dollars. Both of which are about the same price as an insurance deductible. Speaking of design, the most innovative phone of this year is the Xiaomi Mi mix. With the Edge to edge display and ceramic body, this phone is beautiful and stands out in a very eye catching way. So huge thumbs up to Xiaomi for taking risks and pushing the limits of cell phone design. The least innovative phone of 2016 is the iPhone 7. After years of camera optical image stabilization being implemented in other smartphones, Apple finally catches up and adds it to their camera on both the 7 and 7 plus, but then they go and remove the headphone jack. Promising that wireless headphones are the future. But then Apple has so many issues producing the wireless headphones that they are delayed for the average consumer until January of 2017, almost 5 months after they were announced. I've been using the iPhone 7 Plus for the last 2 months to give it a fair chance. And well... I'm switching back to Android. Ill have my full review posted in another week or so. Make sure you are subscribed so you don't miss that. The LGG5 had potential to be innovative. But failed pretty hard when it came to advertising their phone correctly. Even on their website right now, they are still claiming that the LG G5 has a metal alloy body. When clearly it has the warmth of plastic, and thick layer of plastic primer surrounding the entire phone. The word 'Alloy' is defined as two or more metals joined together. Not plastic covered metal. And finally, 2016 wouldn't be complete without mentioning the Note 7. It had the potential to be THE BEST smart phone in the world, but after many explosive recalls, 2 Million Note 7's have to be returned to Samsung. Every major carrier in the USA pushing out an update that will disable the phone entirely at the end of this December. Which means The Note 7 will no longer be able to charge, or make phone calls. So if for some crazy reason you still have one.. Be ready for that. I did a Twitter Poll earlier today and 75% of you guys keep your phones longer than a year. which means durability is pretty important. If you are looking for a phone on the cheaper end of the spectrum the OnePlus 3 does a really good job. Either way 2016 was an amazing and fun year for phones. Pretty much no matter what you buy... the phone is going to be good. As long as you stay away from the phones that are on my shelf of shame. Which phone is your favorite? Let me know in the comments below. And make sure you are subscribed with your notifications turned on because I plan on doing a ton more durability tests and teardowns in 2017. Thanks a ton for watching! Ill see you around.",
    "transcript_keywords": [
        "phone",
        "phones",
        "durable phone",
        "systematically tearing",
        "screen",
        "Note",
        "year",
        "innovative phone",
        "Nextbit Robin",
        "durability",
        "repair",
        "plastic",
        "pretty",
        "metal",
        "solid",
        "glass",
        "inside",
        "Pixel",
        "durable",
        "solid phones"
    ],
    "transcript_entity_values": [
        "HTC",
        "Edge",
        "the past few years",
        "almost 5 months",
        "G5",
        "only 3",
        "2017",
        "Nextbit Robin",
        "two",
        "the LG V20",
        "Samsung Galaxy S7",
        "the end of this December",
        "75%",
        "Redmi Note",
        "years",
        "earlier today",
        "Xiaomi Mi",
        "the last 2 months",
        "Alloy",
        "Nextbit",
        "2 Million",
        "Mi Mix",
        "135 dollars",
        "this year",
        "USA",
        "Apple",
        "January of 2017",
        "Xiaomi",
        "Samsung",
        "2016",
        "the iPhone 7",
        "Today",
        "Android",
        "The Xiomi Mi5",
        "LG V20",
        "another week",
        "13",
        "105 dollars",
        "14",
        "OnePlus 3",
        "one",
        "7",
        "about 30",
        "the iPhone 7 Plus",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}