{
    "id": "0pO7DWIfR6Y",
    "title": "Top 3 Performance Laptops",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-06-16T20:56:10Z",
    "video_url": "https://www.youtube.com/watch?v=0pO7DWIfR6Y",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Best Laptops",
        "best laptop for 2018",
        "best laptop 2017",
        "best laptop 2019",
        "best laptop summer",
        "best gaming laptop",
        "best macbook",
        "video edits",
        "gaming",
        "fortnite",
        "portable computer"
    ],
    "views": 2468658,
    "likes": 39674,
    "comments_count": 3122,
    "description": "Dave2D comparison of the best laptops in 2018 for gaming and editing. Comparing build quality, performance, speakers, keyboard, trackpad, battery life and price. Laptop Skins -  MSI GS65 -  Aero 15X -  Razer Blade 15 -  GM501 -  XPS 15 -  XPS 15 2 in 1 -  LG Gram 15 -   Individual Reviews: XPS 15 2-in-1 -  Razer Blade 15 -  Asus GM501-  ZenBook Pro -  Aero 15X -  MSI GS65 -  LG Gram 15 -   Music Credits: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://bitly.com/1MovGDv",
        "https://amzn.to/2yjvGLe",
        "https://amzn.to/2t1MEIW",
        "https://amzn.to/2MujgmG",
        "https://amzn.to/2lciZZd",
        "https://amzn.to/2tepQoN",
        "https://amzn.to/2ynxsuC",
        "https://amzn.to/2JHpqC9",
        "https://youtu.be/TvXBl063ixk",
        "https://youtu.be/9lzvoBCOlJM",
        "https://youtu.be/zQT8rMlqfqI",
        "https://youtu.be/b5wGGp88nBs",
        "https://youtu.be/yEV9MGrxbEU",
        "https://youtu.be/E_2ptII-7DY",
        "https://youtu.be/vLAucnrFDOQ",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey how it's going , Dave2D here So in front of me are eight laptops , and I will consider these to be the best laptops right now in mid 2018 So kind of the best laptops in that premium thin and light market These all are very powerful , they all have high CPU core count , they all have dedicated GPUs (well, most of them do) These are .. yeah these are like the premium ones So I have four gaming oriented ones then I have four 'content creation' oriented ones But in 2018 I feel like there are lots of crossover, lots of stuff that gamers like looking for It's the same stuff that content creators looking for so kinda mix them up. But, to introduce them, I'm gonna go with the gaming side first So we have the GS65 from MSI, so there's no more black and red accents on this thing, it's gold and black, it has thin bezels and it's by far the best thin and light laptop MSI has made. We also have the Aero 15x - Gigabyte did a pretty heavy refresh on it this year, faster components, faster screen, but the chassis is pretty much unchanged from last year. We have the 2018 Razer Blade - this is Razer's new 15 inch thin and light gaming laptop, It's got better thermals, thinner bezels, and it's improved all - round this year. We also have the GM501 from Asus, so this is the more reasonably priced varient of the original Zephyrus. It's packing a faster screen and a better keyboard and trackpad layout than the original Zephyrus. Okay moving onto the devices that are leaning more towards content creation So these are for people that are into 3D modeling, or they're illustrators or video editors whatever it is that you do, if it's content and you're making it, you can probably use one of these So first we have the XPS 15, so this is the 9570 , this is a product ID that's on year 3 - beautiful screen but the unchanged design and the thermal limitations are getting a little stale uh, we also have the XPS 15 2-in-1, so we have the maglev keyboard, pen support, tablet mode It's got an AMD Vega M GPU combined with an Intel CPU, a very thin package for a 2-in-1 We also have the new ZenBook Pro from Asus -- so this is a laptop with 2 screens",
    "transcript_keywords": [
        "CPU core count",
        "high CPU core",
        "light laptop MSI",
        "core count",
        "light gaming laptop",
        "thin and light",
        "high CPU",
        "CPU core",
        "light market",
        "thin",
        "dedicated GPUs",
        "premium thin",
        "original Zephyrus",
        "laptop MSI",
        "light laptop",
        "year",
        "light",
        "kind of mix",
        "content",
        "laptops"
    ],
    "transcript_entity_values": [
        "Zephyrus",
        "2",
        "Razer Blade",
        "Razer",
        "CPU",
        "Asus",
        "year 3",
        "this year",
        "XPS",
        "15 inch",
        "GM501",
        "eight",
        "2018",
        "CPU",
        "first",
        "mid 2018",
        "four",
        "AMD Vega M GPU",
        "9570",
        "Intel",
        "ZenBook Pro",
        "15",
        "last year",
        "MSI"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}