{
    "id": "0rDex2Itb8o",
    "title": "They Sent a $45,000 Bill... Then Ghosted Us. - EMC Chamber Problems",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-10-26T16:11:05Z",
    "video_url": "https://www.youtube.com/watch?v=0rDex2Itb8o",
    "category": "Science & Technology",
    "tags": [],
    "views": 3437068,
    "likes": 108367,
    "comments_count": 4205,
    "description": "Check out the MSI RTX 4090 SUPRIM:   TEAMGROUP's Black Friday/Cyber Monday Sale:  TEAMGROUP Delta RGB DDR5 6400 - White at Micro Center:   The lab is spending mucho money on an Anechoic EMC Chamber. What does that mean? It means a big box, it means carbon-impregnated, it means WIFI, it means FOAM. And a whole mess of an order.  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:17 What we were expecting 2:36 Problems Pt 1 3:15 FOAM and what it does 5:19 Ferrite Tiling 7:03 Story Time 8:29 Making Lemonade 10:18 Making Foam Fort 12:18 Outro",
    "description_links": [
        "https://www.msi.com/Graphics-Card/GeForce-RTX-4090-SUPRIM-X-24G",
        "https://bit.ly/3FffwDC",
        "https://bit.ly/3CGMObR",
        "https://linustechtips.com/topic/1463470-we-paid-45000-they-ghosted-us/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Did you know that when your phone says 5G up there it's probably lying? When I type star, pound, star, pound 4, 6, 3, 6 pound star pound, star; LTE. I paid for 5G?! Darn it. What's going on here? As it turns out, corporations is a liar sometimes and this kind of trickery is one of the reasons that we decided to spend nearly $45,000 on an industry standard radio frequency shielded room. It will allow us to identify and debunk all kinds of industry connivings like this, as well as test products like cell phones, routers, even microwaves for things like signal range, battery drain, interference regulatory compliance, and so much more. There's just one small problem. They shipped us the wrong one, and they stopped replying to our emails. So now all we have is this foam, a big pile of wood some other assorted paraphernalia and a great big project to turn this into something usable, but don't worry we got a plan for that, that I'm gonna share with you along with this segue to our sponsor. - Team Group. Black Friday and Cyber Monday are coming and Team Group has organized a cyberpunk style website with tons of deals. Click the link below and take advantage of their sale today. - When it comes to wireless technology it's really hard to know what's going on and it's not like you can see it, which means that before we can test anything we're gonna need some specialized equipment. For one thing, we're gonna need a 4G/5G Labkit which is essentially a mobile network in a box that will allow us to spin up our own access points here and then measure the performance at various frequencies across the spectrum with all kinds of devices, be they iPhones or Samsung Galaxies. Naturally, we'll wanna do the same thing for home wireless equipment, be it wifi or Bluetooth, and in order to ensure that our measurements are accurate we will need, da da da-da an EMC chamber. So let's talk about the kind we were supposed to get. For those of you in the know 45 grand for a fully assembled 16 by 12 foot EMF chamber. It's actually not a ton of money. That is because we bought it used. Wait, used? Whoa No, actually that is completely normal and fine, as long as it was built by a reputable manufacturer. These things have no moving parts, so they don't really wear out the way that you might imagine. And it's extremely common to see scientific equipment like this on its third or fourth or fifth owner decades after it was first built. Of course, it doesn't really look like anything special. What makes it a a good one? Well, this one, honestly not much. It took three weeks to ship and not only does it not match the picture on the website, it is entirely the wrong size. We ordered 16 by 12 and they shipped us a 13 by 13. Not to mention that it is in horrible condition. Like seriously, this thing looks like they stored it outside. Look how beat up these foam panels are. Like, what even happened to the tips on this one and this one and this? These are the most critical part of the chamber, but since it's in this state anyway, I guess nothing prevents me from cutting it open and giving you guys a little lesson about foam. Different kinds of chambers, those designed for acoustic use or radio frequency use. Wow, this stuff is pretty heavy. Ah, come on, open up! The point is, they will use different kinds of foam materials and construction depending on their purpose. Ours is a high performance, fire resistant, theoretically... so it is, pyramidal foam EMC absorber. EMC stands for electromagnetic compatibility and means that it shouldn't unintentionally generate, reflect or retransmit electromagnetic interference. Oh, that stinks. Of course. No material is going to be absolutely perfect in this regard, which is where the shape comes into play. These pyramids aren't purely aesthetic but rather, they have a function. An electromagnetic wave, like a sound wave, can reflect off of a flat surface, which means that if you're trying to measure the strength of a signal from a wifi router, for example with a sensor here that do do, do bounce, or realistically many bounces, could interfere with your reading. Now, to be clear, acoustic and EMC products can be flat like the acoustic panels that we mounted for, Call me Chris and that will still help to reduce the energy of any waves that hit them. But, by employing this shape we give the waves multiple opportunities to bounce off of the sides of the pyramids before hopefully being nearly fully dissipated. This elimination of bouncing waves is where an anechoic chamber gets its name. An- like not any, and -choic, like not any echoes. Not all foams are created equal though like the high density foam that we use in our super comfortable straps on the ltt backpack, ltt store.com. And there are a couple of main differences between EMC foam like this, and the kind that you would find in a sound chamber. First up, while both are made of polyurethane, the density and the internal structure tends to be higher for acoustic applications compared to what we need. The second major factor is that EMC foam like ours, is carbon impregnated. Carbon has a lot of space in its outer electron orbitals allowing it to absorb energy, which then gradually dissipates causing the electrons to fall back into their normal orbitals. This makes it super effective, like iron, at blocking electromagnetic interference, turning the entire chamber lined with this stuff into a sort of Faraday cage, sort of. For better isolation what we should really have is high density Ferrite tiling that lines the inside of the chamber but a two by two inch tile, okay, is eight US dollars. Which is why comparably sized chambers with Ferrite can run you into the millions of dollars. That's a yikes. The good news is that we don't actually need Ferrite tiling. Ferrite is useful for blocking lower frequency waves and with it we could block signals all the down to 26 to 30 megahertz, allowing us to test like AM radios and stuff. But I suspect most of you don't really care about that sort of thing anyway, and besides without the Ferrite tiling we can still keep anything above 800 megahertz from passing through the walls into our chamber. As for extremely high frequencies, well, we don't need to worry about those in here either because we've got a 10 inch thick concrete building all the way around us that is gonna block them out nicely. The finish chamber is gonna be assembled right here and it's gonna be about this big. I'm walking around inside it right now, which is a perfect fit for our consumer electronics devices, along with our 4G, 5G, antenna, cameras and any other measuring equipment that we will need when it's built. But first, story time. As I already mentioned, the picture on the website didn't match what was shipped, but guys it gets way worse than that. The seller never sold that chamber or even owned it in the first place. I mean, we thought we were at least buying a comparable one but it was completely different. Well, could have been an innocent mistake, right? No, not so much. Thanks to the contractor who, ironically, the seller hired to come out and build this thing for us. We got in touch with the original seller of the actual pictured chamber, and it turns out that they messaged these guys years ago telling them to remove those photos. The thing is, the RF industry is pretty small and it seems like everyone knows everyone. Now thankfully, we haven't actually wired the money for this. So the obvious course of action was, \"Hey guys, can you pack all this up and take it back?\" And this, I kid you not, is their response. (cricket sound) It has been months of crickets now, which I guess means I am the proud owner of many, many piles and pallets of literal garbage. It's not all bad though. Through the assembly contractor we were able to get in direct contact with some excellent EMC chamber manufacturers, and we're hoping that the next time we update you guys on this, it'll be with great news. And maybe there's a way to make some lemonade out of these lemons. The thing is, the degradation of these pyramids means that we cannot trust this foam to evenly attenuate any RF in the interior space. But it could still prove useful for our future sound isolation chamber, which will be a dual wall design. So there's no reason that we couldn't pack this stuff into the airspace between the inner and outer walls to improve the isolation even further. As for the framing, well, we can use that to put together our camera testing chamber which is gonna have consistent lighting and lots of fun little objects and test patterns that we can take pictures of to evaluate both standalone and smartphone integrated cameras. If I get my way, it'll also have a little model train, which I think would be sick. As for the rest of it, well, I don't know. Hopefully we'll figure something out and they're not expecting us to send this back after leaving it with us and ignoring us for months. I mean, the way that I see it, if they ask for it back at this point. By the way, you guys, this looked like a lot. Come, come, come, come, come, come, come over here. It's two layers thick. No, no, no, you gotta see. Yeah, here, here. Can you see that? Oh, sorry, sorry. It's two layers thick, so if they ask for it back I think I'm just gonna send them a storage invoice for their garbage and it might end up being a better deal for them to simply walk away. Like, look, I don't like to have to do it but, if I have to go ruthless business guy, then I will. I will. 'Cause this is, this is ridiculous. Look at this. It's got like tree debris on it, like all over it. That's not from us, we've had it inside. Oh. We haven't tested to see if it actually works at all for anything. Are you thinking what I'm thinking? - [Adam] Foam fort? - Foam fort! - LMG five. We're sitting at about 60. Okay. Okay. And going into the chamber. Wow, I'm already at 70 and here we are. While I may not be able to present the data we would collect from this chamber to you guys as valid results just cuz of all the issues with it. Can confirm carbon impregnated foam definitely does a thing. In fact, I'm using my onboard recorder right now that goes to the pack on my hip, and we're gonna switch over to the one that I am transmitting to our camera operator over there, and you guys are gonna see it's pretty bad. Adam, wanna go ahead and close in the last spot? - [Adam] Goodnight, sweet prince. - Here we go. Also, you're gonna see that when I bust outta here this red SSID in the corner here is gonna go from about minus 80 to... here we go. (screaming his way out) I dropped myself up to minus 50. All right, I can't wait to have an actual working one just like I can't wait to tell you guys that you can see the full video of us building the block board over on Floatplane.com and oh, I also can't wait to tell you about our sponsor. MSI. MSI released their new Geforce RTX 40 90 Suprim and it inherits the exterior design philosophy of its predecessor with a brushed metal cover in Chevrons around each fan. There's sections of different heat sink fins to disrupt unwanted airflow sounds to reduce noise and thermal pads under the metal backplate to provide additional cooling while ventilation reduces trapped heat. Their torques fans promise excellent longevity due to the double set of durable ball bearings that keep them spinning. And their Dual BIOS feature gives you control. You can choose either full performance gaming or silence. And they bundle in a support stand that can be attached to your case to hold up the card because hey, every tank needs good support. That's actually very funny, I like the talking points. So check out the RTX 40 90 Suprim at the link in the video description. If you guys enjoyed this video, you might also enjoy the one where we gave you guys a lab update on what's going on with keyboard testing. So why don't you go check out that one. Can I actually get a hand though? Just get that? Yep. No, no, for real. Yep. Okay. It's just at a really weird angle. I couldn't get any leverage.",
    "transcript_keywords": [
        "pound star pound",
        "chamber",
        "foam",
        "guys",
        "EMC",
        "EMC chamber",
        "thing",
        "EMC foam",
        "pound star",
        "star pound",
        "star",
        "pound",
        "Ferrite",
        "EMC chamber manufacturers",
        "excellent EMC chamber",
        "Ferrite tiling",
        "kinds",
        "Team Group",
        "foam EMC",
        "back"
    ],
    "transcript_entity_values": [
        "40",
        "3",
        "40 90",
        "Samsung Galaxies",
        "4G/5",
        "one",
        "Geforce",
        "second",
        "800 megahertz",
        "about minus 80",
        "Friday",
        "first",
        "13",
        "Chevrons",
        "two inch",
        "three weeks",
        "45",
        "nearly $45,000",
        "First",
        "iPhones",
        "26",
        "minus 50",
        "eight US dollars",
        "decades",
        "12 foot",
        "today",
        "16",
        "fifth",
        "Floatplane.com",
        "five",
        "10 inch",
        "Team Group",
        "MSI",
        "months",
        "us",
        "Chris",
        "5",
        "Faraday",
        "Monday",
        "4",
        "LTE",
        "6",
        "EMC",
        "ltt store.com",
        "da da da-da",
        "12",
        "Adam",
        "third",
        "years ago",
        "Suprim",
        "G Labkit",
        "about 60",
        "fourth",
        "6 pound star pound",
        "SSID",
        "two",
        "Ferrite",
        "the millions of dollars",
        "70"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE"
    ]
}