{
    "id": "0s4jZEqBOkQ",
    "title": "NEW Pink Sand iPhone Charging Case!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-04-08T14:48:43Z",
    "video_url": "https://www.youtube.com/watch?v=0s4jZEqBOkQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone",
        "iphone case charger",
        "pink sand",
        "pink charging case",
        "iphone xs max",
        "iphone xs"
    ],
    "views": 537951,
    "likes": 16379,
    "comments_count": 1448,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- The other day on my birthday, March 20th, happy birthday to me. Thank you to everyone who wished me a happy birthday. I'm loving being 25. Really, loving it. (laughs) But it was quite a gift, with all of the announcements. They've announced new spring Watch Bands. And they also announced a Pink Sand charging case. Now I made a video previously talking about these charging cases. I actually made two videos. Because I'm that obsessed. I think it's one of those things where, I had never used a charging case for so long that I forgot how amazing it is. Now, it does add a little bit of size. (laughing) To your phone, for sure. This is everything. I don't even know, like the kids say that all the time, and I'm not even sure what that even means. Like this is everything, is this everything? Does this mean everything to me? Is it everything? Like what does that even mean? So the Pink Sand is one of my favorite colors. It is in one of my favorite cases. And I have the gold phone. So this Pink Sand case always looked so great. This was one of those things that I completely missed the day that they had all of those announcements. Until every single one of you guys were Tweeting me this, asking if I got it. I didn't even know it was a thing, I completely missed it. So let's open this up. I'd also love to have my sister come up and talk about her case. If you guys remember, I surprised her with it. Get out of here, get out of your home. (gasping) Also, a surprise to my sister. I am wearing one of her shirts right now, so. I'm sure she'll notice as soon as she walks in (laughs). Here it is, Pink Sand. Get out of there, come on out. Join the family. So one of the things that I've loved so much about these cases is that in all honesty. I can get through a whole day, plus, and not even think about my phone dying at all, it's not even a thought any longer. Let's put it on. Look at that. This is such a beautiful phone. It's so great! Get in, okay. Alright. Look at it. Still is a pretty light color. I mean it matches my sisters shirt and everything. Hey Jenna! Bring your phone! Hope she has the case on it, or that's really gonna ruin, defeat the purpose. Oh hi, oh my gosh hello! - Hi! - How are you enjoying the new set? - Oh god I just got blinded. I like it, I used it for a video, I ran the light blue. - Oh cool, I've been changing the color for like each video so it's like super unique. - That's dramatic. Well I use blue. - Okay, I don't think I've used blue yet, I may have, I'm not sure, hmm, anyway. - Oh! - Where's your charging case? - Charging. (laughing) It died. - That was the whole reason that I brought you up here. Was to talk about the case. It's okay, I mean we know that you have it. - Well it's charging! - I surprised you with it. - I love it, I use it all the time. I actually don't charge my phone, I just use that, and I charge that. - So you just charge, so wait, you take your phone out of the case, charge the case, and then put the phone in it? - So half the time like when I'm going to bed like my phone is charged. So like, okay cool. So I'll take the case out, charge the case, because why would I keep charging my phone if it's already at 100 percent? - That's valid. - Is it? - That makes sense. See I just don't ever have to charge anything, because it's just fully charged always. - I mean it's like 10 o'clock at night. - It is 10 o'clock, it's really, we've been filming videos all day so. I get it, I think it's so cool that this is also wireless charging too. - Yes and like when I use it in my car, I plug it in, like it works with my CarPlay. - Jen doesn't like CarPlay, mostly because it reads her text messages. - But because it's like \"girl with smiling face, Justine poop emoji, girl raising hand, (laughter) person man with mustache.\" But other than that yeah no, I love that, it's actually my favorite case. I really like it. - I love it too. - Keeps my phone charged, I'm always using my phone. - I'm so into it, look at the pink! - Do you want me to go get it? - No I think we know what it looks like. - It's really pretty. - She has the black version. - I do! - Remember, I surprised you? - Are you gonna do something to me? - No! Here, put this in your hands, see if you can guess what it is. - It's rubbery, oh it's a phone case! - (gasping) Yeah but what kind? - I opened my eyes. Ooh this is nice! - It's a battery charging one! - It is a battery charger one! Pink looks good, it matches your sweater. - Matches your sweater. - It is my sweater. - That's why I picked this one. - To be fair you picked another pink shirt, and I said you can't wear that (laughs). This is like one of my favorite sweater. - I'm running out of clothes to wear. - Well that's like I just keep stealing yours. This is mine but I got it back from your closet. - I always thought that was mine. - No, it was just in your closet for the longest time, so that's the rule you get to keep it. - Are you wearing this over the top of a t-shirt? - Oh I got cold, so. I wasn't filming anymore. - You look good. (laughs) - I got cold, you stole my sweatshirt! - I did steal the sweatshirt. Okay well that's it, I just wanted to show them (laughs) the new case. And I wanted to get an update to see if you're still into yours. - I am, it's literally charging downstairs. I'm sorry I forgot that's what I'm coming up here for. - That's okay, that's okay. - I could go get it. Does the fact that my phone is always charging, is that messing it up? - I don't know, that was something that somebody asked me as well, and I don't have an answer. - Because I've always had problems, ugh I just always have problems. I just, I don't know, I just don't wanna like mess it up. But why would they make that if that would mess it up? - I don't know? - Ermagerd. - I am unsure. Well thanks joining me. - Yes, thank you for having me. - Yes. - You're gonna have to get a guest stool. It felt nice. - I'm gonna get a cheaper stool. Hannah's like getting wiggly. (banging) - Thank you for having me. - You're welcome (laughs). Well guys I just wanted to show you this and also give you an update on how much Jenna is obviously loving hers. She loves it so much she doesn't even have it on her phone. But that's only because she has it charging. If you guys haven't subscribed to my channel already, make sure you hit that subscribe button, and hit the Like button if you like the video. I will have more fun videos coming up for you very shortly. Like always, I don't know, I'm not sure, depends how fast I can edit. I'll see you later, bye! (funky music)",
    "transcript_keywords": [
        "case",
        "phone",
        "Pink Sand",
        "charging",
        "happy birthday",
        "Pink Sand case",
        "Pink",
        "charging case",
        "Pink Sand charging",
        "Sand charging case",
        "March",
        "Sand",
        "birthday",
        "charge",
        "cases",
        "Sand case",
        "video",
        "phone case",
        "Sand charging",
        "love"
    ],
    "transcript_entity_values": [
        "25",
        "March 20th",
        "100 percent",
        "all day",
        "Hannah",
        "Pink Sand",
        "spring",
        "one",
        "CarPlay",
        "10 o'clock at night",
        "10 o'clock",
        "Justine poop emoji",
        "Watch Bands",
        "Jenna",
        "two"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "PERSON",
        "LOC",
        "DATE",
        "CARDINAL",
        "FAC",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}