{
    "id": "0sWlm4xItBw",
    "title": "Is QLED better than OLED? - Unboxing a Massive QLED 8K TV!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-07-10T12:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=0sWlm4xItBw",
    "category": "Howto & Style",
    "tags": [
        "QLED 8K",
        "Best TV",
        "8K TV",
        "super big tv",
        "Samsung TV",
        "QLED",
        "large tv",
        "8k",
        "QLED 8k unboxing",
        "OLED tv",
        "QLED tv",
        "Samsung",
        "LCD Tv",
        "what tv is best",
        "8k UHD TV",
        "AI Upscaling",
        "Quantum processor"
    ],
    "views": 8952099,
    "likes": 162881,
    "comments_count": 13056,
    "description": "The future of TV has arrived with Samsungs new QLED 8K! Check out the current pricing here:  This video is sponsored by Samsung TV. Samsung sent over their MASSIVE new 82 inch QLED 8K for me to put to the test. With new 8K gaming consoles coming out next year, the lifelike 8K experience will be more popular than ever, and the massive Samsung QLED 8K is leading the way.  How to mount a TV on an entertainment center without breaking it:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.samsung.com/us/explore/qled-8k-tv/",
        "https://youtu.be/bfdYmYc3kTo",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "- [Zack] Think about all the pixels and quality in your favorite 4K video and then quadruple it. It really is a different experience. (upbeat music) Every time I see a super big TV like Samsung's new QLED 8K I'm always impressed with the size and picture quality but I'm always thinkin' how does it work? And, more importantly, how do you mount something this big and massive to the wall? Especially when it's so thin and there's no gap between the TV and the wall. Today we're gonna find out. Huge thanks to Samsung for sponsoring this video. - Let's get started. - Over the past five to ten years, TVs have hit quite a few different resolution milestones. You know, 720p, 1080p, 4K, and now finally the latest and greatest 8K. These super big TVs are perfect for large spaces or anywhere where entertainment is the focus. This 82 inch QLED 8K isn't even the biggest TV that Samsung makes. They range anywhere from 75 inches all the way up to the new 98 inch that was announced at CES last year. - [Zack] Think it's big enough Cambry? - Pretty massive. - It is possible to have the TV mounted on like a cabinet or an entertainment center and the legs for the TV are conveniently hidden right here on the back panel. Which is a pretty smart design. The legs just lift up and out. But we're not here to set the TV on stands. We're here to mount it to the wall. Let me show you how to do that. All right, so Cambry and I, we've measured the TV and we've kind of set tape up in the general area of where the TV might be and now we just need the professional's opinion on if it should be raised up or not. Do you want it higher or lower? - I think it just needs to be up a little bit higher. - [Zack] So the way the no gap mounting system works on a TV this large is that underneath these plastic panels on the back of the TV is a mounting location. The TVs that are 82 inches and up have two mounting points and the no gap mount can fit right in that little slot, screw in with its screw and washer and then it sits almost completely flush with the back panel. So this'll all start comin' together in a second but this paper we just stuck up is a perfect template for where the wall mount is gonna to go. So what we need to do right now is drill holes into the studs behind this wall so it'll support the TV with the two mounts. One little trick that I have learned over the years is that if you take a sticky note, a little piece of paper, and put it underneath where you're drilling like this it'll catch all of the dust that is coming out of the wall and make it so that there's less clean up. There is a bunch of dust and nothin' on the floor. Now that we have all the holes drilled, we put the brackets in place. So before we can lift the TV up onto the wall there's two very important things to keep in mind. One is the connector cable for the back of the TV is fiber optic, meaning that it's made of glass. So any kink in the cable or bend sharper than four inches might break the glass and that's the only form of communication between the TV and the console. So don't bend that cable 'cause glass is glass and glass can break. We can pull down each of these mounts so they're ready to be hung on the wall mounts. And the second thing is when we're lifting the TV we don't want to put any pressure on the surface of the QLED 8K. Especially since the bezels are so small. It has this little protector here along the side that can come off. But we're gonna remove it after it's up on the wall. Since hopefully we just put this TV up one time, we're gonna have a little bit of fun with the wall and leave little notes for whoever comes after us. - Nelsons, established 2019. - [Zach] Nice. 100%? - [Man] Yup. - And the TV is on the wall. - I did most of the heavy lifting. - Now the TV's up on the wall, let's see what it can do with some of my own footage. Now this massive waterfall right here I shot with a 1080p drone while I was in Africa. Victoria Falls is the largest waterfall in the world. You can see the detail of the waterfall and the little people walking along the edge because the Samsung TV is taking my 1080p footage and upscaling it to 8K with its internal quantum AI processor. This pod of dolphins was shot in 4K using a handheld camera, along with this turtle also shot in 4K, currently being upscaled to 8K. This plane wreck was also shot with a 4K drone, currently being upscaled to 8K. You can see each individual tree and the plane wreck right in the middle of all of them. So even though there might not be a whole lot of 8K content available right now, it's not a big deal 'cause the TV generates its own 8K content with whatever is displaying and it's doing a pretty good job with my own footage. So you might be wondering, what's the difference between OLED and QLED displays. Some people might say that a TV is a TV but there's actually a difference in the technologies. OLED displays are made up of little, tiny pixels that light up on their own which kind of limits how bright they can get without losing their color. QLED is made up of little quantum dots that are backlit by LEDs. Meaning that QLED can get much brighter than a typical OLED. Pretty interesting stuff. So there used to be a projector on this wall since the wall is so large but this 82 inch super big TV is more than enough to take up the space of where the projector used to be. And it's even better because the TV can operate in light or dark environments where a projector just has to be in the dark. Let's talk about resolution for a second. Most smart phones these days, iPhones and Androids, are in this realm, 720p and 1080. Most computer monitors and TV screens are in this realm, 1080p and 4K. But Samsung QLED 8K is in this realm. Literally on the bleeding edge of technology. Each jump in resolution is associated with more definition and better picture quality. 8K is the closest thing we have right now to real life, which is why it's more of an experience instead of just watching. There are a lot of pixels in this TV. It would take four 4K displays to make up the pixel density of this one 8K panel. So what happens if you don't want a massive, black rectangle hanging in the middle of your wall? Samsung has added a stealth mode or something they call ambient mode, which makes the TV mimic the wall behind it or display pictures or photos or even personal albums as kind of like a screen saver of sorts. But it more allows your TV to kind of be a window to the outside world instead of just, you know, a black TV. And, more importantly, QLED does not have the same burn in problems that OLED has. Along with being a smart TV with access to the internet, the QLED 8K has the Apple TV app and Air Play built directly in. No external hardware is needed. The new app brings over 100,000 movies and TV shows and you can subscribe to premium channels like HBO and Showtime. You can also use any smart phone as a remote with the QLED 8K and all your favorite content from the Apple TV app is available on Samsung QLED TVs. So, Cambry, now that we have the whole thing up on the wall what do you think of it? - I think it's pretty amazing. It's huge and brilliant and I'm excited to play some video games. - Going back to the gaming we talked about earlier, this TV has Radeon FreeSync installed which means it has variable refresh rates. So, not only is it good for gaming, but it also upscales whatever game you're playing whether it's 1080p, 4K, it upscales it all the way to 8K. Rumor has it that the next gen video game consoles are gonna be in 8K. Cambry and I played for like eight hours one Saturday so if I'm ever slacking on videos you know where I'm at. - You can't blame me for that. - Groundbreaking, leading edge technology like this is always fluctuating in price so I'll leave a link in the description so you can check out the current pricing of the QLED 8K whether you just want to check out the current pricing or actually get one for yourself you don't have to mount it yourself, though. There's lots of professional options for mounting a TV this large. Huge thanks to Samsung for sponsoring this video and, Cambry, do you remember how we finish things off? - And we'll see you around. - Thanks still for watching and we'll see you around. - Aw, man.",
    "transcript_keywords": [
        "wall",
        "QLED",
        "Samsung QLED",
        "Samsung",
        "Samsung QLED TVs",
        "big",
        "Cambry",
        "mount",
        "super big",
        "OLED",
        "back",
        "video",
        "glass",
        "Pretty",
        "wall mount",
        "QLED TVs",
        "quality",
        "inch QLED",
        "TVs",
        "mounts"
    ],
    "transcript_entity_values": [
        "Showtime",
        "like eight hours one",
        "2019",
        "98 inch",
        "QLED",
        "CES",
        "HBO",
        "8",
        "Cambry",
        "1080p",
        "four inches",
        "four",
        "100%",
        "two",
        "AI",
        "82 inch",
        "100,000",
        "82 inches",
        "Africa",
        "82 inch QLED 8",
        "75 inches",
        "4",
        "Victoria Falls",
        "Androids",
        "the past five to ten years",
        "Saturday",
        "Apple",
        "Zach] Nice",
        "last year",
        "second",
        "1080",
        "Air Play",
        "Samsung",
        "these days",
        "Today",
        "One",
        "K",
        "iPhones",
        "Radeon FreeSync",
        "one",
        "the years",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}