{
    "id": "0tx3nmA2pSM",
    "title": "Pixel 3 Review - Two Weeks Later",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-10-24T19:29:09Z",
    "video_url": "https://www.youtube.com/watch?v=0tx3nmA2pSM",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Google Pixel",
        "Pixel 3",
        "Pixel 3 XL",
        "best smartphone",
        "pixel vs iphone",
        "camera test",
        "best smartphone camera",
        "best camera",
        "samsung",
        "note",
        "galaxy",
        "versus",
        "vs",
        "s9",
        "s9 plus"
    ],
    "views": 878514,
    "likes": 23014,
    "comments_count": 1674,
    "description": "Dave2D review of the Pixel 3 and Pixel 3 XL. The best smartphone from Google this year is way better than last years model. I like it better than Galaxy S9 Plus! Pixel 3 -   Running a Snapdragon 845 with a killer camera, the Pixel 3 and Pixel 3 XL is the best smartphone that Google has ever made. The Night Sight and Top shot feature are really nice and give the user a better camera experience than last year's Pixel 2  Background Music: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2PT5qvB",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here. So the Pixel and the Pixel 3XL, these have been my exclusive phones for the past couple of weeks Mostly the Pixel 3. I have a preference for the size I'd like the fact that doesn't have a notch and I've put more time on this one than have on the XL But I thought I'd do a video that kinda talks about some things I liked about them some things that I really don't like about them and Maybe help you decide whether or not you should get one So I like the size of the Pixel 3 a lot it actually feels way better in my hand And I thought it would the glass on the back does scratch very easily on the white It's not as visible when you scratch it the color kind of masks the marks but on the dark colored version of the Pixel It's actually quite visible. So this device with the Pixel stand is a great combination So when you put it on it charges wirelessly and it turns your phone into this quasi Google home It's not as good as a regular Google home either Mini or Macs just because of the mic sensitivity, so normally on a regular Google home You can be quite far away from your device and it'll pick up your voice but for whatever reason on either the phones either the XL or the regular you have to actually be quite close to the phone or Speak at a more elevated volume to be able to trigger the Google home functions Now that's something that may be able to fix with software But right now I do have to speak at a abnormally loud voice to make these things work Something I noticed with the Pixel stand This is the only wireless charger that can charge the Pixel 3 or the Pixel 3XL at the full 10 Watts all the other Wireless charges have tried which is like 5 or 6 of them, can only hit slow wireless charging speeds It'll say that it's rapidly charging but it isn't if you check the ampere that's going through It's quite low and I'm not sure if that's something they can tweak the software again But right now you can only charge these things rapidly through the Pixel stand and that thing is like 80 bucks Which is pretty expensive for a wireless charger right now the speakers on these phones are good they're stereo speakers again Like the Pixel 2XL that I had last year But these sound a lot better than the Pixel 2XL speakers Now the Pixel 3 like the regular Pixel 3 I think has a better speaker system than the Pixel 3XLnow This is louder. It's definitely a louder speaker. But the speaker on the left or the speaker on the airfield runway is noticeably quieter than the speaker on the right and this might be something that wouldn't bother most people if they're just listening to something for like 5 or 10 minutes but if you're watching a movie or if you're going on a bender and watch Like a ton of music videos on YouTube and you're using the Pixel 3XL it feels weird It's like when you have headphones and one side is broken. So one headphone is louder than the other It's just not a great experience. And this only exists on the Pixel 3XL on the regular Pixel 3 There is a noticeable difference as well if you listen for it But it's not nearly as pronounced and even after using these for an extended period of time they never bothered me I spent more time with the Pixel 3 than the Pixel 3XL for the past couple of weeks My sim card has been in the Pixel 3 and I feel that the battery life on this phone is very average I was expecting it to be Expecting the wrong word. I was hoping for it to be longer because it's a new phone new technology new SOC But I found it very similar to the Pixel 2XL from last year I'm ending the day with like 20 to maybe 40% battery life depending what I was doing It's not disappointing, but I was hoping for better now the display on this phone is excellent the display in both These phones was really good. I would say that the Pixel 3XL display is better, higher resolution, but that notch though I just I couldn't deal with it I know there was software to pull it down and kind of hide it but it never looked quite right to me That notch was so deep. The Pixel 3 screen is more symmetrical and despite the bigger forehead and chin It just looks more appropriate to me and I guess somewhere tolerant of a top and bottom bezel Then a notch. Now I was a little bit worried about the resolution Like I haven't used a 1080p screen for a while, but it's really sharp. It's an excellent screen Both of these are running Snapdragon 845s or both great performers but the Pixel 3XL definitely has better thermal management when I was running 3DMark repeatedly on these phones the Pixel 3 was dropping a score pretty quickly after even the second run the Pixel 3XL was able to maintain its core a little bit better This is not something that most people are going to care about but if you're gonna buy these phones and you plan on playing games On it. I would definitely pick up the XL instead of the regular three They're both not clocked at the highest like they're both at 2.5 gigahertz. I think instead of their standard 2.8 So these are not great gaming phones either way, but performance for regular stuff kick-ass. Ok RAM management is the last thing I want to talk about and this is something that kind of bugs me about these phones So these both ship with 4 gigs of RAM, which in 2018 is a very small amount of RAM There are flagships out there competitors that are shipping with like 8 Some phones are coming out with 10 gigs of RAM like the Black Shark but 4 gigs of RAM on a flagship phone feels Anemic for 2018 and I'm getting app closures when I'm running four or five apps Which is really bad particularly with music streaming apps when you look at companies like oneplus and they're sticking eight gigs of ram into phones That are six hundred bucks It just makes a phone like this feel out of place and I get it like when it comes to phone manufacturing sometimes it's easier and even cheaper to just Stuff phones with RAM and not have to deal with memory manager and software like it takes time and effort and like just a lot Of work to make a phone like this utilize four gigs of ram efficiently It can be done and Google's a software company if there's one company that can do it. Well, it's Google It's just that right. Now. This feels really half-baked. This phone should be able to use four gigs of RAM better but that being said I still think they should have put more memory in here because when you have competitors that are putting in Double the amount of memory for cheaper price. It's just a bad look. So are these phones good? Are they worth your money now? I'm someone who really values the whole pure or stock Android experience I know it's something that a lot of people don't care about but it's something that I personally enjoy so for me it is worth The premium to get that Google experience with the amazing Pixel camera so that camera you've probably seen tons of videos on it already, is an amazing camera It's very good at capturing light data. It's powerful. Its nightsight is good The top shot feature is so useful when you have a kid and you want to get him in a good photo like this photo Would have been very difficult to get without top shot that smile on his face lasted a split second This is actually one of my favorite photos of him and without top shot. I probably wouldn't been able to catch it the one thing I don't like about the camera system on this phone is that the microphone is Really poor a lot of camera phones don't have great mics again with this one sticks out as being really bad but all the things that I don't love about this phone are relatively insignificant to me now if you're someone that really cares about microphone Quality and you want fast charging from your wireless charger and all that stuff. There are things that are not perfect But this phone obviously, but for most people if you're willing to pay that steeper price with that Google experience in that Pixel camera I think it's a great phone this year. Ok. Hope you guys enjoyed this video thumbs If you liked it, subs if you loved to see you guys next time.",
    "transcript_keywords": [
        "Pixel",
        "Pixel stand",
        "phone",
        "phones",
        "regular Pixel",
        "RAM",
        "Pixel camera",
        "Google",
        "gigs of RAM",
        "Google home",
        "regular Google home",
        "regular Google",
        "regular",
        "speaker",
        "things",
        "amazing Pixel camera",
        "good",
        "great",
        "amazing Pixel",
        "phone feels Anemic"
    ],
    "transcript_entity_values": [
        "Pixel 3 I",
        "40%",
        "4",
        "Google",
        "5 or 10 minutes",
        "the Black Shark",
        "the past couple of weeks",
        "2.5 gigahertz",
        "XL",
        "one",
        "this year",
        "six hundred bucks",
        "Mini",
        "Pixel 2XL",
        "half",
        "20",
        "second",
        "eight",
        "Google",
        "Pixel",
        "80 bucks",
        "2018",
        "Android",
        "Macs",
        "Watts",
        "3",
        "five",
        "four",
        "10",
        "RAM",
        "8",
        "6",
        "3XLnow",
        "the Pixel 3XL",
        "Pixel 3",
        "SOC",
        "2.8",
        "last year",
        "YouTube",
        "5",
        "1080p"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "LOC",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}