{
    "id": "0vuzqunync8",
    "title": "I'm Stepping Down..",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-19T00:10:50Z",
    "video_url": "https://www.youtube.com/watch?v=0vuzqunync8",
    "category": "Science & Technology",
    "tags": [
        "linus steps down as ceo",
        "ltt getting a ceo",
        "who is the new ceo of lmg",
        "who is the new ceo of ltt?",
        "terren tong",
        "taran tong",
        "linus retiring",
        "state of the union"
    ],
    "views": 6873450,
    "likes": 478017,
    "comments_count": 27150,
    "description": "New Customer Exclusive - $25 Off ALL Processors:  All Customers can sign up and receive a 128gb flash drive at the Indianapolis store opening event:   Check out The Ridges Fathers Day sale using the link below and Save up to 40% through June 15th!   The time has come for me to step down as CEO of Linus Media Group (and everything else under the umbrella). Let me tell you what that looks like: what's changing, what's not, and who is taking my place...  Discuss on the forum:    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 The Big News 0:46 The Why 1:54 My New Role 2:54 What's not changing 3:54 I could have retired 4:51 What IS changing 5:45 WHO IS THE NEW CEO??",
    "description_links": [
        "https://micro.center/r0z",
        "https://micro.center/z4s",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1507902-im-stepping-down/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Most successful companies eventually outgrow the leadership of their founders, and it looks like my time is now. Effective July 1st, 2023, after 10 wild and very eventful years, I'll be stepping down as CEO of Linus Media Group, Creator Warehouse, and Float Plane Media. I'm sure you have a lot of questions and I'm gonna try to answer them all here, like why now? What's gonna happen to the channels in the lab? And if not you, who's gonna be around to tell us about our sponsor? - The Ridge! Father's Day is coming up. Luckily Ridge is having one of their biggest sales of the year. Give the dads in your life a unique and functional Ridge wallet or key case so they can do dad things, like brag about their wallet and keys. Check the Ridge out of the link below and make Dad proud. - The truth is, I was never really cut out to be a CEO. I remember putting it on my business cards in the early days when we had only four employees, thinking, this feels ridiculous, and I've never really outgrown that. I'm a lot of things. I'm a bottomless pit of creative energy, an excellent motivator and speaker. I'm wicked smart, charming, really funny. But in addition to those strengths, both real and imagined, I have a lot of weaknesses and chief among them, is that I've just never really had the attention to detail or the temperament that it takes to run an organization this large. I touched on some of this during my infamous 10 million subscriber stream, but the truth is, while I did manage to wrap that up with a positive message about finding motivation to move forward, none of those feelings I talked about ever went away. I wasn't built for this and I'm tired, like really can't do this anymore, tired. And if I try to drag myself through another 10 years of business administration, I know I'm gonna destroy myself and probably end up killing the company and the community that I love so much in the process. I'm at my best when I'm pitching new content, or product ideas, or when I'm problem solving ways to wipe garbage sites, like User Benchmark, out once and for all, and I have some good news, none of that stuff is gonna be going away. My new role is gonna be Chief Vision Officer, which is a stupid like, BS sounding made up role, but I think it really is the best one. We thought about Creative Officer, but that didn't really encompass what I'm gonna be responsible for, because my gut and principles are what got us to where we are today. So I'm still gonna be charting the path that I think makes sense. We don't wanna lose our moral compass, but when it comes to the details of how to best utilize our resources to get there, I need some help. And I'm sure you have a lot of questions right now, like who our second sponsor is. I'm just kidding, we're gonna get to that later. First, I wanna talk about what isn't. Did I really write that? Sorry. First I want to talk about what isn't going to change and the biggest one is the rest of our leadership team. Yvonne and I spent the last six months working with them on my replacement, which included having him work for us on a contract basis to ensure that they feel he is A, a competent manager, and B, the kind of person who can comfortably integrate into our team. They're gonna be continuing to work alongside him to ensure that this transition goes as smoothly as possible. The next thing that isn't gonna change is me. I am not going away. You can expect to see me on camera just as much as you used to. I mean, ideally, maybe more, since if all goes according to plan, I'm gonna be left to do what I do best, which is engage with our community, that's you, and create. Speaking of which, I'm gonna be doing a Q&A session about this with the community in the next week or so. Make sure you're signed up at floatplane.com/ltt so you don't miss it. Also, not changing, our ownership structure. Yvonne and I are still the sole shareholders and directors of the company, so there hasn't been some kind of corporate buyout that's gonna force us to sell our souls to cover their purchase investment. We did have a substantial offer recently to sell out and I might as well speak plainly. The offer was a hundred million dollars, 60% cash, 40% shares in the acquiring company. Basically, it was enough to live in a beachfront hotel for the rest of our lives, for our kids to do that, and for our kids' kids to do the same. we decided not to take it and there were a few reasons for that. First is that, honestly speaking, it wouldn't really change our lifestyle much. I mean, what are we gonna do? Buy an even bigger house, an even faster car? I mean, that's never really been us anyway. Second, is because we love this company and the people in it and I just don't think our mission's complete yet. I'm not sure that it will ever be. My point is just that our attitude towards money, so make lots of it and keep reinvesting and building this thing to do even better. It's not gonna change and you are not going to see the kind of short-term thinking that comes from investor pressure. Our long-term thinking is just gonna come from this guy instead. On that note, then let's talk about what does change and this is actually mostly for the benefit of my team who's watching this, but you guys might as well be in on it. The biggest change is in reporting. No one will report directly into me anymore. If there's an issue with salary transparency, or the snacks in the lunchroom, or the warranty on the backpack or whatever, I promise you, I give you my personal guarantee. Trust me, bro, whatever it is, there is somebody else who's in charge of that and that is by design. Yvonne and I have laid out a clear set of guidelines for how we want this company handled, with integrity and compassion, people first. We wanna make strong investments in building something that's gonna continue to offer growth opportunities to everyone who's part of our team. Beyond that, though, the buck stops with the new CEO. I'm not gonna be stepping in to undermine him and this is a big shift, that's gonna mean we're all gonna need to break some really old habits. With that outta the way then, who the hell is this guy, right? The keen eyed among you might have noticed that the picture I showed you, is actually from the roast a few years back, so this isn't your first exposure to Mr. Terren Tong. He was my boss when I worked at NCIX, which makes him kind of uniquely qualified for this position, because managing me is a challenging task. I am everywhere. Even the most skilled of administrators have struggled with it, and he's one of the only people to ever successfully do that and teach me. He, and I mean, if I'm being honest, really one of our other colleagues, begrudging shout out to Jack, (bleep) the two of them taught me most of what I know about business, both what to do and what not to do. Shout out Jack. In the years since his departure from NCIX, Terren has done stints at Corsair and Dell, both of which have been successful enough that they've thwarted all of my previous attempts to hire him, seriously since pretty much day one, I've been looking for an excuse for us to work together again, and every single time I would talk to him, he was worth so much more than the last time, that I'd go, dammit, I guess we're not really ready for this yet. But now that the deal's inked, I'm really excited. I'm excited to work with my friend again. I'm excited to have a steady hand that I can trust on the tiller of this ship. A second steady hand. I haven't forgotten about Yvonne, who's the only reason I've lasted this long at all. And I'm also excited about the mentorship that he can provide to me again and also to the rest of our team. We are headed into a really exciting new chapter, guys, better videos, better products, new investments, that are gonna make us just the primo source of tech information on the web, I'm sure of it. Now, I don't wanna say too much more about him for now. Once he's onboarded, I'm sure he's gonna wanna prepare a little thing to talk to you guys about, you know, it'd be kind of fun. Should I interview him? Is that as funny as I think it is? You know, it doesn't matter. We'll figure it out. In the meantime, I can assure you, that he is zero bull (bleep). He's a super hardworking guy with great attention to detail and not only a ton of experience in the computer industry. He actually has a background in media as well. He formally wrote at Neo Seeker, if you wanna go dig up some of his old articles for fun. Sorry, Terren, sorry for bringing that up, and sorry for turning your introduction here, into this segue, to our sponsor, Micro Center. This summer marks the opening of their first store in eight years in Indianapolis, with two more stores set to open by 2025. And if you visit the Indianapolis store, you can get a free 128 gig flash drive just for stopping by. If you wanna shop online, you can still take advantage of the $25 discount that they have on all processors, for all new customers. During May, Micro Center is featuring desktop deals all month long, with pre-built desktops available for purchase. And if you prefer to build your own pc, Micro Center has you covered with a wide range of PC parts and knowledgeable associates to help you with your build. You can even use their online PC builder tool to ensure compatibility and to get your parts in store in just 18 minutes. If you're proud of your build, submit it to their Build Showcase, for a chance to receive a coupon for your next in-store purchase. With over 25 stores across the US, Micro Center offers amazing selection and prices, on laptops, computer components, monitors, TVs, networking equipment, and more. And if you need service and repairs, they have a dedicated department to help you with that as well. So why wait? Visit Micro Center today or click the link in the description to see why they're the go-to destination for all your tech needs. If you guys want some more context for this big change, I would suggest checking out the \"I'm Thinking of Retiring Stream\". I still can't watch it, just to find the timestamps, for what I'd put in the video earlier, I had to just download a transcript. It's just rough, but it might give you guys a better idea of the head space that ultimately led me to give up the reins, so that I can focus just on my love of tech and bringing you guys the best content that I can.",
    "transcript_keywords": [
        "companies eventually outgrow",
        "Linus Media Group",
        "Float Plane Media",
        "Micro Center",
        "successful companies eventually",
        "companies eventually",
        "eventually outgrow",
        "Creator Warehouse",
        "Float Plane",
        "change",
        "Ridge",
        "guys",
        "Micro Center offers",
        "Center",
        "Micro",
        "make",
        "years",
        "Media Group",
        "Linus Media",
        "Plane Media"
    ],
    "transcript_entity_values": [
        "10 million",
        "40%",
        "the years",
        "second",
        "128",
        "Ridge",
        "Float Plane Media",
        "first",
        "25",
        "May",
        "Linus Media Group",
        "a hundred million dollars",
        "Neo Seeker",
        "Second",
        "Terren",
        "First",
        "zero",
        "User Benchmark",
        "Corsair",
        "another 10 years",
        "over 25",
        "Indianapolis",
        "pretty much day one",
        "just 18 minutes",
        "Yvonne",
        "today",
        "Dell",
        "the last six months",
        "only four",
        "10",
        "NCIX",
        "Jack",
        "US",
        "July 1st",
        "the next week",
        "Build Showcase",
        "2023",
        "the early days",
        "This summer",
        "2025",
        "60%",
        "Terren Tong",
        "a few years",
        "two",
        "Micro Center",
        "eventful years",
        "eight years",
        "Terren",
        "the year",
        "Creator Warehouse"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "FAC",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERCENT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG"
    ]
}