{
    "id": "0w64KhTguWA",
    "title": "Steam Deck is a glorious mess",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-02-28T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=0w64KhTguWA",
    "category": "Science & Technology",
    "tags": [
        "valve steam deck",
        "steam deck review",
        "valve",
        "steamos",
        "steam deck",
        "valve steam deck trailer",
        "steam deck specs",
        "steam deck hands on",
        "linux",
        "gaming",
        "pc",
        "gaming pc",
        "nintendo",
        "nintendo switch",
        "steam deck games",
        "steam deck gameplay",
        "steam deck unboxing",
        "steam deck emulation",
        "nintendo switch lite",
        "first look",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 384006,
    "likes": 11551,
    "comments_count": 963,
    "description": "The Steam Deck is a Linux handheld gaming PC that runs Windows games like a Nintendo Switch, and its damn good at it  when it works. But the half-baked console gave us a lot of trouble, and we dont review gadgets on promise!  Heres why Sean Hollister thinks its more like an OG Game Boy than a Nintendo Switch, transformative despite not yet meeting its potential.  Read more:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  iFixit Steam Deck Teardown:   0:00 Intro 1:09 Steam Deck specs 1:16 Steam Deck overlay & customization  2:20 SteamOS software review 3:25 Steam Deck problems & issues 5:37 Missing games (PUBG, Destiny 2, GTA 5, Fortnite) 6:06 Attempting Star Wars: TIE Fighter 6:44 Steam Deck support & not supported games 7:20 Steam Deck Stadia configuration 7:35 Steam Deck hardware review (etched anti-glare model) 8:34 Steam Deck battery 9:27 Conclusion  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22718386",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://youtu.be/4T0RZ6ustKQ",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Let me tell you a story. When I was 12 years old, I got my first Nintendo Game Boy. It was a big gray brick, it only showed four colors of green on the screen, had a mono speaker, the cartridges didn't always work when you plugged them in, sometimes you had to blow on them. Actually, that's a myth, please do not blow on your cartridges, it'll make it worse. But I remember sitting in the back of the car and could not believe that I was playing Mario on the go. I couldn't believe games fit in this thing. Why do I bring this up? The $400 Steam Deck makes me feel the same way. I can't believe they actually made PC gaming portable but they did. (upbeat music) I am holding in my hands a computer that can capably play games released this year and games dating back decades. Games that were designed for mice and keyboards and dedicated graphics cards. But I can play them, because this is a gyroscopic gaming system. And this is a virtual mouse and 22 of the decks, 27 different controls can be customized for so many play styles. It boggles the mind. I can play them smoothly because the most powerful integrated graphics in a handheld yet are right here. I can change their graphical settings six ways from Sunday, load modes even command line arguments if I want. In fact, Valves gives you more to tweak here than in your typical PC. This glorious overlay helps you fine tune not only the performance, but the battery life of the deck in real time. Showing you how quickly you're draining the pack, and letting you change settings to gobble down less juice. My favorite part though is I can pause my games in any moment, right in the middle of a huge fight. Where in my case as a parent with two kids, I can finally complete games one bite size session at a time, like I did with my Nintendo switch. I can plug in a mountain of peripherals fire up a web browser, even do my job from here. I wrote a popular Verge story on this thing and watched a whole lot of Netflix. After firing up GameCube games on this thing via the dolphin emulator, I'm convinced it's gonna be an incredible retro portable too. It's the most fun I've ever had Beta testing, a piece of hardware. Oh, did I forget to mention the Steam Deck can be an unfinished, infuriating, unpredictable buggy mess? To give you a better idea, first, I need to show you the Steam Deck UI which we've never been able to show you before. Here's a quick tour. So here's the main Home screen for the Steam Deck. It's got a horizontally scrolling list of titles kinda like Netflix, even though it's still ripeness in the steam. There's also your vertical scrolling menu over here where you can access library store, media, and downloads. It also doubles as an app switcher which is something they just added the other day, if you want to run two apps at once. There's also a quick settings menu over here where you can access brightness, audio, some of your advanced battery options. But you can't do everything from this portion of the menu. If you wanna actually pair Bluetooth headphones or tackle auto brightness, you have to go to this settings menu instead where there's a lot of vestigial Steam stuff that I imagine is still getting figured out, hopefully in future revisions. Some of the transitions and animations can still be a bit jumpy too. And when I'm using the controls, whether I'm using a touch screen, or buttons, or even a mouse, sometimes it's not quite clear when I've got the handles of the devices and when I'm actually be able to toggle them on and off. I'm gonna level with you, this is one of the hardest reviews I've ever done, because the system kept on changing out from under us the whole time. Valve kept releasing new updates every couple of days, introducing new bugs, fixing old bugs sometimes generating entirely new features. That changed how we evaluated the whole system on the fly. In fact, there are enough issues. I made a list of some of them here for you. Bluetooth audio pauses and lags, Deck wouldn't detect my external microphones, friends could barely hear me in discord, forgot my wifi handful of times, and forgot to reconnect to my earbuds after waking up from sleep. That happens pretty often. Some games like Cyberpunk will be working one day, not working the next. Error messages, I've seen so many error messages, and a handful of black screens require reboot. Speaking of reboots, games magically disappear from the SD card until I reboot the system. Fairly often transferring games to SD can be slow, and you're locked out while you do. Most of my steam library went missing from the UI one day. UI elements missing or not scaling correctly particularly when using external monitors. I've lost track of how many times I've had to reboot reawake, and reconnect and disconnect things to fix all these issues. And the entire time Valve is pushing new updates to the system every couple days. Valve changed the entire way the frame limiter works like three times in two weeks, either with a giant update halfway through the review period that unlocked new games, happy to say persona for golden works. We couldn't browse the store verified games until today. The day we're filming this video. couldn't test Windows at all because we're still waiting on GPU drivers, and earlier there were network drivers. We couldn't try the 64 gigabyte model which has slower on board storage. Couldn't try the official dock and we couldn't try much cloud gaming because Google and Microsoft are still working on building support to their Linux browsers. Working with Valve on that, I was able to get Stadia working by emulating a mouse and keyboard, but still it's not quite there yet. When I spoke to Valve the team candidly admitted it's not all gonna be there by launch. The company will be shipping rapid fixes and features to early adopters for some time to come. I've got some faith in Valve. It never abandoned the steam controller where steam link HDMI streaming pack updated them long after it was clear they didn't meet Valve sales expectations. But you should know going in, this is not a console that'll flawlessly run every steam game the moment you hit play. Though Valve's done some incredible work to make Windows games seamlessly work on Linux. It still doesn't run some of the biggest hits like PUBG Destiny 2, GTA 5 in Fortnite due to conflicts over anti cheats, other games won't launch at all and won't tell you why. Some will need you to mess with settings or spend time figuring out a custom control scheme that works. And while Valve and Steam community have made things easier by verifying some games as deco compatible and preceding loads of old steam control or configurations, I still never know quite what to expect. Here's the original Tie Fighter. One of my favorite games ever made. It launches, the animations look great. Someone with the old steam controller even made a custom control scheme, but there's no cursor to navigate the menu. And this isn't really playable. - [Player 1] I got him the Tie Fighter, (fast paced music) and I'm spinning uncontrolled. - Meanwhile, Valve certified Death Loop is a game that plays great on deck, but the joystick controls are all stuttering, you can't just swap in an emulated mouse because that doesn't play nice with the game pad buttons. And if you emulate a mouse and keyboard, now the onscreen button prompts don't match up. Here's a list of games that actually worked on the Steam Deck for me and a bunch that didn't because some of them didn't have a good control scheme or in many cases simply crashed immediately to desktop or through some other kind of random error, when I tried to launch them via proto. My very first day with the Steam Deck, I wanted to play Halo Infinite, Back 4 Blood, and Duck Game with my friends, but none of them run on the deck. And when I tried streaming Halo from my desktop PC instead, I ran into a whole bunch of glitches. So that all sounds frustrating. And it is, and I'm still buying, I'm paying $400 because I don't mind being an early adopter. I'm the kind of guy who spent an entire hour building the perfect custom configuration to play Destiny 2 via Stadia, a platform where I don't even own any games. And I don't regret it for a moment. Also, the hardware is fantastic. The screen is good. I'm using the $650 version with the anti glare display which works. It also soaks up fingerprint oil. The speakers are excellent loud and clear without being shrill. (soft music) And the controls almost all feel like they're in the exact right places. The 1.47 pound heft distributed nicely across my hands. I even appreciate the top mounted USB C port cuz I always found the Nintendo switch's bottom mounted one getting in the way. And while some have complained about Valve's choice of a wifi five chip instead of wifi six I saw 580 megabit per second download speeds from gigabit fiber over a powerful wifi router. It'd be nice if the screen had smaller bezels and the steam and quick settings buttons actually clicked in. But the only things I wish Valve would change hardware-wise are the battery and the seriously noisy fan. (fan rotating) - [Player 1] Yeah, that's great. - My old annoying hum. As iFixit showed in a tear down that 40-Watt hour battery is not gonna be trivial to swap out and the Steam Deck hits it hard. It's easy to see the console drop 24-Watts in scenes that really tax the GPU which means less than two hours worst case on a charge. I saw just under two hours of control at 60 FBS and low settings but I got more than four hours in less intensive games with the frame limiters set to 30 FPSs. You should know Valve's taking pains to preserve that battery too. It took me two hours, 45 minutes to charge it from empty. And 15 of those minutes were just to get from 96% to full. And it doesn't charge any faster, if you've got a more powerful adapter. The good news is I was able to suspend a game shortly before the console was about to die. I still had an hour to get home and plug it in. And the bundled 45-Watt charger was powerful enough to charge and play at the same time. I was right back in my game. You should also know this is a big beefy system that's not gonna fit in pockets or even a mid-size purse, like that original Game Boy I wound up carrying it in its own custom tote bag. Now a patted back pack might work. I am buying a Steam Deck because I actually like tweaking PCs and I'm never too far from a charger or a beefy battery pack. It'll all but replace my Nintendo switch which my wife hasn't led out of her sight ever since the last animal crossing expansion. But if you were hoping for an experience where everything just works, you might wanna wait for the next one. Valve says, it's looking at this as a multi-generational product, which is a fancy way of saying that unless it flops a Steam Deck 2 is in the cards. Even today though as half baked as it might be, I already feel a lot of that original Game Boy magic. So you've read our Steam Deck review. You've watched our video. What do you still wanna know? We're gonna make an FAQ on www.theverge.com and at love your input.",
    "transcript_keywords": [
        "Steam Deck",
        "Steam",
        "games",
        "Deck",
        "Valve",
        "Game",
        "Steam Deck makes",
        "Steam Deck review",
        "Steam Deck hits",
        "Game Boy",
        "play",
        "Nintendo Game Boy",
        "steam game",
        "time",
        "settings",
        "original Game Boy",
        "system",
        "control",
        "steam controller",
        "Nintendo"
    ],
    "transcript_entity_values": [
        "less than two hours",
        "Game Boy",
        "Valve and Steam",
        "40-Watt hour",
        "Valve",
        "every couple days",
        "one",
        "Steam Deck",
        "30",
        "four",
        "GPU",
        "27",
        "$400 Steam Deck",
        "three",
        "two weeks",
        "Halo Infinite",
        "Windows",
        "more than four hours",
        "two hours",
        "45 minutes",
        "today",
        "Linux",
        "just under two hours",
        "650",
        "Google",
        "Stadia",
        "Mario",
        "2",
        "580 megabit",
        "SD",
        "22",
        "six",
        "60",
        "the other day",
        "12 years old",
        "45",
        "Fortnite",
        "My very first day",
        "96%",
        "15",
        "Tie Fighter",
        "UI",
        "FBS",
        "two",
        "the Tie Fighter",
        "an hour",
        "one day",
        "Nintendo",
        "every couple of days",
        "One",
        "1.47 pound",
        "Death Loop",
        "Sunday",
        "an entire hour",
        "24",
        "Valves",
        "this year",
        "SD",
        "64",
        "400",
        "back decades",
        "Halo",
        "second",
        "USB C",
        "five",
        "iFixit",
        "Netflix",
        "Microsoft",
        "first",
        "FAQ",
        "the Steam Deck",
        "Valve",
        "as half",
        "Linux"
    ],
    "transcript_entity_types": [
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "TIME",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE"
    ]
}