{
    "id": "0Xi2rurVAvs",
    "title": "Can You Play Fortnite on a $200 Laptop?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-03-27T18:55:43Z",
    "video_url": "https://www.youtube.com/watch?v=0Xi2rurVAvs",
    "category": "Science & Technology",
    "tags": [
        "fortnite",
        "fortnite battle royale",
        "fortnite pc",
        "gaming pc",
        "pc",
        "laptop",
        "xbox one",
        "fortnite xbox",
        "battle royale",
        "fortnite iphone",
        "fortnite mobile",
        "fortnite laptop",
        "gaming laptop",
        "fortnite gameplay",
        "cheap laptop",
        "budget gaming laptop",
        "austin evans"
    ],
    "views": 5551383,
    "likes": 77915,
    "comments_count": 13975,
    "description": "Fortnite Battle Royale is great on gaming PC but how about a cheap laptop? Building the Portable Xbox One:  Buy the HP Stream on Amazon:  HP Stream video:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=q9hbEIihYWs",
        "http://austin.tech/stream14",
        "https://www.youtube.com/watch?v=P0r9wR-Z2dc",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin. Fortnite is the most popular game in the world right now. Take one look at Twitch and you'll see hundreds of thousands of people watching streams at any given time. Now that actually got me curious, because Fortnite is available on such a wide range of hardware, everything from high-end gaming PCs to consoles to even smartphones. Can you actually run it on some slightly unusual things, like a $200 laptop? At first glance, things look pretty promising. Fortnite's minimum requirements only need an Intel HD 4000 GPU, AKA integrated graphics on a laptop from 2013, which I think should be pretty doable, but we're gonna be pushing the limits here. So, to start with, we're going to try Fortnite running on the iPhone X. Now what's impressive here is that it actually looks pretty much like Fortnite everywhere else. You've got your menu, you got pretty much everything else that you want to have, unlike a lot of other free-to-play games on the phone. (Austin coughing) Like, everything. (Austin coughing) Sorry, I was a little... (clears throat) My first impressions are that this is really, really good-looking for a game on the phone. Now, I'm sure as we take a look at some higher-end PCs, you'll be able to see more differences, but, I mean, this is pretty much the full game. You're not really losing a whole lot of anything here. Probably the biggest problem with Fortnite Mobile are the controls. Now, it's not that bad, especially if you can get used to some touch screen controls. You'll probably be fine, but it is definitely not going to be as nice as with a controller or especially with a mouse and keyboard. What's cool about this edition is that it actually does support cross-play, so in theory right now I could be playing with people on PC, on Xbox, or on phone. Next up, we have the full PC experience. So this is the Acer Predator Helios 300, a roughly $1,000 laptop with pretty beefy specs, including a Core i7, as well as a full NVIDIA GTX 1060. Immediately, you can tell there is a huge difference here. So not only are we playing it at 1080p on Epic settings, but we're getting a pretty respectable 70 frames per second or so right now. Don't get me wrong, there's nothing necessarily wrong with the mobile experience, but there is a pretty big difference when you jump up to the PC. Honestly, probably one of the biggest things is just the better controls for me, so even though you have the ultra PC experience doesn't necessarily mean you're actually going to be any good at Fortnite. But I will say that there is a big difference in playing on something like this versus the phone, or as you'll see in a minute, some of the lower-end systems. This really is the way that Fortnite is meant to be played. Next up, we have the Xbox One S, and this is going to give you a good idea of what the lower end of consoles are capable of. This is the least powerful. PS4, PS4 Pro, as well as Xbox One X are all going to give you better performance and especially better resolution, but you are still getting 60 frames per second on the console, and if this looks a little bit different to you, it's because this is our portable Xbox One S setup. You guys want the full information on this, link is in the description. So what you're getting here is that full 60 frames per second experience, but at lower settings. One of the most noticeable things is going to be the resolution. This is running somewhere in the neighborhood of 720p. It looks fine, but it's not going to be super-sharp, especially if you're playing on a high-res 4K TV. That being said, especially if you're playing on a smaller monitor like this, it looks totally fine. And I can't stress enough: that 60 frames per second option is a huge, huge deal. It really does add so much fluidity to the game, and it makes it feel a lot more competitive versus slightly less performing options. Not that I'm hinting toward what the other things in this video we're going to do. I'm really impressed with just how much optimization that they've done on this game. It's crazy that Epic has made a single title that can scale everything from a phone to an Xbox-- Oh, this is bad, this is... Why are we all in here? No! No! Next up, we have something a little bit more interesting. This is the Acer Aspire 5, and at $600, this is by far my favorite gaming laptop I've ever tried. So, for that money, you're getting not only a Core i5, but you're also getting a pretty decent NVIDIA MX150 graphics card. Performance-wise, this is actually pretty similar to what you're getting on Xbox. So, right now, we're running on Medium settings at 720p, and we're getting a pretty stable lock on 60 frames per second. Sometimes during the action, we'll dip a little bit below that, but it is surprising at how close you can get to a full console experience on what is a pretty budget gaming laptop. The only problem with a game like PUBG or Fortnite is that everyone is so good that I feel really, really terrible, so, um, yeah. Now, my friends, it's time to take a trip to the danger zone. So far we've been playing on things that are actually meant to play the game. However, Fortnite can be run on very, very low settings. This is the 2017 LG Gram. Now, the idea here is that this is by no means a gaming laptop. Instead, this is very much an Ultrabook, and it actually does have pretty decent specs, with eight gigs of RAM, and the brand-new 8th-gen Core i7 processor. However, graphics, not exactly the strong suit here. Now, no one is going to buy an Ultrabook for gaming, but it's interesting to see how something like this is going to perform. It might seem weird to try to play a game on an Ultrabook, but to be fair, a lot of people do have this class of hardware and might be interested in trying Fortnite. The good news is, it's playable. The bad news is, it's not going to be particularly pretty. First of all, you're gonna want to crank your settings down. All the way down. Right now, I'm playing on the lowest settings possible at 600p and getting somewhere around 30 frames per second. Like here, I'm walking around. Not even a particularly challenging scene. We're kind of hovering in the high 20s. It's gonna be playable, but it's definitely not going to be a great experience. So far, we've seen a pretty wide range of hardware to play on Fortnite, but my real question is, can we play it on a $200 laptop? This is the HP Stream, a $200 laptop with some incredibly low-end specs. We've got an Intel Celeron N3060 processor, four gigs of RAM, and exactly no dedicated graphics of any kind. Let's just see here, what have we got? We got 480p on Low. I'm gonna take a guess and say that that's going to be too high. One of the nice things about Fortnite, though, is that you can completely adjust it all the way down to 360p. I like how your avatar in the game is like 18 pixels right now. Really fills me with confidence. Join server. Alright. Time to play some Fortnite on a $200 PC! This is not gonna go well. Okay, we're actually in the game right now, and, (Austin laughing) that looks hilarious. But we're getting a solid 14 frames per second. Okay. I mean, the game is actually playing. It's not crashing, it's... There's some, like, pixels on the screen. There's, like, seven or eight of them. That's fine, no big deal. Uh-oh, here, we froze. We froze, that's fine. That's fine, I'm sure it'll come back. Uh, oh, okay, we're back. I guess it didn't freeze after all. Oh, what is this? Is this supposed to be a tower? Oh, it froze again. What's funny is that you look at something like this. This looks like a giant blob of pixels. However, this, the tree, actually doesn't look that bad. It's like any time I look at a tree, my frame rate immediately tanks. If I look down at the ground or something, it's fine, or look at this stupid shack, which, oh, wait, it just popped in a new texture. Oh wow, okay, so it's now no longer Garbage Town. Great, okay. So, can you play Fortnite on a $200 computer? Yes. Should you? Absolutely not. I'm gonna say that Fortnite actually runs pretty well, as long as you don't try to, you know, push its capabilities a little bit too far. I'm curious: what do you guys play Fortnite on? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Fortnite",
        "pretty",
        "game",
        "Xbox",
        "play Fortnite",
        "playing",
        "laptop",
        "frames",
        "fine",
        "things",
        "play",
        "Austin",
        "full",
        "experience",
        "settings",
        "phone",
        "guys play Fortnite",
        "gaming",
        "gaming laptop",
        "Fortnite Mobile"
    ],
    "transcript_entity_values": [
        "2017",
        "600",
        "PS4 Pro",
        "the HP Stream",
        "K TV",
        "Xbox One S",
        "hundreds of thousands",
        "first",
        "NVIDIA MX150",
        "RAM",
        "Ultrabook",
        "Fortnite Mobile",
        "Core",
        "eight",
        "Acer",
        "Austin",
        "N3060",
        "seven or eight",
        "around 30",
        "PS4",
        "Xbox",
        "four",
        "Celeron",
        "4",
        "60",
        "roughly $1,000",
        "second",
        "Xbox One X",
        "Garbage Town",
        "Fortnite",
        "$200 PC",
        "200",
        "8th-gen",
        "18",
        "Intel",
        "Fortnite",
        "2013",
        "Epic",
        "Twitch",
        "Fortnite",
        "the Acer Predator Helios 300",
        "70",
        "One",
        "Xbox One S",
        "NVIDIA",
        "the high 20s",
        "14",
        "GPU",
        "First",
        "Ultrabook",
        "360p"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "LOC",
        "PERSON",
        "MONEY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "FAC",
        "PRODUCT"
    ]
}