{
    "id": "0xT_2jfVaII",
    "title": "The $999 MacBook Air Alternative",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-11-15T19:06:16Z",
    "video_url": "https://www.youtube.com/watch?v=0xT_2jfVaII",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "asus",
        "zenbook",
        "macbook",
        "macbook air",
        "macbook pro",
        "alternative",
        "versus",
        "xps",
        "razer",
        "stealth",
        "13",
        "14",
        "best laptop for students",
        "best laptop",
        "best notebook",
        "notebook for school",
        "laptop for school",
        "best budget laptop"
    ],
    "views": 1305283,
    "likes": 27537,
    "comments_count": 1777,
    "description": "Dave2D review of the new Asus Zenbook 14 - one of the best competitors to the MacBook Air and it costs MUCH less. Available Here:   The new Zenbooks have a light up number pad and are rocking the new 8th gen whisky lake CPU the i7-8565U and a MX150. These laptops are thin and light while having good CPU and GPU performance.  Background Music: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2PXajHc",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it goin. Dave 2d here when I did my video about the MacBook Air I talked about how if you were on the market for a thin and light ultra book for like a premium well-built one, the Windows laptops just had better options right?! Better value right now at the end of 2018, and this right here is probably the best example of a well valued premium ultra book. This is the new Zen book from Asus. It comes in a 13, 14 and a 15 inch screen This particular model is a 14 inch screen And I think it's probably the best kind of form factor and best of the bunch So because this thing has such thin bezels this device has a very small footprint for a 14 inch screen because usually a device with this kind of footprint would have slightly thicker bezels and The screen would be a 13 inch screen, but thin bezels 14 inch screen. So this screen is a 1080p panel It's not super high res, but it's very crisp colors are good, brightness is good and despite having such thin bezels The webcam is still up top. So you get a normal-looking image. Another thing I liked about this laptop is the keyboard So when you open the lid, the keyboard on the back of it tilts up a few millimeters. They call it ergo lift And it's something that I like, but it's a very slight tilt I think it's only like 2 or 3 degrees If you don't like tilted keyboards for whatever reason, then you may not like it, but it also helps with thermals Which I'll get into later, but I personally like this typing experience .Keyboard layout is also nice and it's a keyboard I think most people will enjoy quite quickly. So this trackpad, it uses windows precision It's a great trackpad glass surface, but it also has this feature Where when you click the top right corner, this keypad lights up. Now Asus is showing off this feature in a lot of the marketing materials and it's cool Like it looks really cool, but functionally, I don't know if it's quite there yet. So the biggest issue I have with it is speed, because if you're gonna use a traditional keypad like this You're gonna use it because you want to input your numbers quicker and because it uses touch input you can only go so fast before it occasionally misses some of the buttons that you're pressing and I actually found it faster to just use the numbers at the top of the keyboard instead of this keypad I mean it looks really cool and the ideas neat and maybe with software they can tweak a few things but in its current state it feels A little gimmicky to me not to say that the whole product is a gimmick but just that one feature is not as cool as I thought it would be. It has a decent selection of ports. The one I would say was missing is Thunderbolt 3 So it has a USB-C port But it just doesn't support Thunerbolt 3 and in addition to not supporting Thunderbolt 3, it also doesn't support Charging USB-C and I feel like on a device like this Like he really would've been awesome if it supported USB-C charging. The one that they include is a barrel plug But even if you have a compatible adapter that would charge USB-C devices like laptops and stuff It doesn't work on this port. On the inside We're looking at soldered on RAM and a Wi-Fi card But you can replace the NVME if you want. The CPU that they're using in here is actually the new whiskey-lake 8th Gen CPU, so this is a little bit better than the Kaby-lake ones. It's just a little bit faster clock speed That's like the big difference between this and Kabylake. So this goes to 4.6 gigahertz on boost The battery is a 50 watt hours I'm not sure what they're advertising, but I got eight, a little bit over 8 hours with the screen at 250 nits It's on a regular Wi-Fi test. Speakers! These are great speakers. A lot of the Zenbooks have surprisingly good sounding speakers. They're never in a great position Like they're always on the bottom of the laptops, but they sound good. The performance on the Zenbook is pretty good. It's running a 4 core CPU But it's also running an MX 150: a 2 gigabyte video card that's decent for light gaming Like you're not gonna get amazing frame rates with it But it's better than a lot of ultra books that are just using the integrated intel graphics And thermally, it's also a good performer. It doesn't get super hot. It doesn't get too loud It fits the Ultrabook genre quite well Like you can bring this to work, to school; like no one's gonna complain about noise or anything like that The build quality this machine is good, but it's not as good as a MacBook I still feel like the mac books have some of the best-looking and best finished laptops on the market, but this is quite good It's not a unibody construction. It's clearly panels, but it is well built. Now, this is a device that starts at $1000. And for that money, I feel like you're getting a lot of really good stuff It's great performance, well-built It's got that keypad thing If you're interested in that I think that it's hard to find this kind of value with this kind of build quality Anywhere else and if you look at the MacBook Air, not that I'm trying to trash that product or anything But if you're kind of like, \"you know, should I get a MacBook Air or something else?\", This is a very good alternative Just don't be drawn into that keypad because I mean it looks cool, but it's not that cool. Ok Hope you guys enjoyed this video thumbs if you liked it, subs if you loved it. See you guys next time!",
    "transcript_keywords": [
        "inch screen",
        "good",
        "screen",
        "premium ultra book",
        "thin bezels",
        "ultra book",
        "inch",
        "MacBook Air",
        "cool",
        "keyboard",
        "USBC",
        "light ultra book",
        "kind",
        "thin",
        "keypad",
        "bezels",
        "book",
        "Zen book",
        "device",
        "Air"
    ],
    "transcript_entity_values": [
        "2",
        "1000",
        "Thunerbolt 3",
        "Kaby",
        "Zen",
        "Ultrabook",
        "8th",
        "4",
        "Dave",
        "MacBook Air",
        "Zenbook",
        "CPU",
        "Wi-Fi",
        "Windows",
        "14 inch",
        "one",
        "USB",
        "4.6 gigahertz",
        "8 hours",
        "50 watt hours",
        "Kabylake",
        "the MacBook Air",
        "15 inch",
        "eight",
        "14",
        "2 gigabyte",
        "the end of 2018",
        "Zenbooks",
        "NVME",
        "13 inch",
        "a few millimeters",
        "MX 150",
        "Asus",
        "the MacBook Air",
        "RAM",
        "3 degrees",
        "13",
        "MacBook",
        "250",
        "Thunderbolt 3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "TIME",
        "GPE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ]
}