{
    "id": "18BqKMkoLcU",
    "title": "Giant Mystery Unboxing...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-12-15T22:24:07Z",
    "video_url": "https://www.youtube.com/watch?v=18BqKMkoLcU",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "nissan",
        "rogue one",
        "star wars",
        "star wars rogue one",
        "star",
        "wars",
        "nissan rogue",
        "nissan rogue rouge one",
        "nissan rogue star wars",
        "nissan star wars",
        "cool",
        "limited edition",
        "limited",
        "edition",
        "2017",
        "2017 nissan rogue",
        "nissan rogue 2017",
        "le",
        "nissan rogue one",
        "rouge",
        "one",
        "star wars rogue",
        "cars",
        "drive",
        "car",
        "awd",
        "test drive",
        "2016 nissan rogue review",
        "rogue one: a star wars story",
        "star wars: rogue one"
    ],
    "views": 5098526,
    "likes": 86402,
    "comments_count": 6242,
    "description": "DETAILS BELOW (SPOILER ALERT)   Nissan gave me the opportunity to check out the 2017 Nissan Rogue: Rogue One Star Wars Limited Edition. This Limited Edition model is 1/5400.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -   *This video is sponsored by Nissan.",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So today its a-it's a little bit of an unusual one I know there's a surprise component to it Jack has basically been feeding me the information I know he's partially behind it in collaboration with Nissan And I'm like... So anyway I gave him the keys to the new studio and now he asked me to come over there and visit Let's see what's up It's a very...very large box ...\"click me\"? This-this is more what I'm used to here \"To Lewis, From Santa\" ok.. I legitimately Do not know what to expect in here.. I feel like it's Christmas morning over here or somethin *Woahohohohohohohooo That is legit! This is like.. movie-realistic right here There's a little base for it as well Star Wars Death Trooper 1:1 scale helmet replica Wow! Check that out I'm not sure what's gonna happen when I hit this button, but, ehm... I mean, it says \"Click me!\", so you know we got to do it Whoah-hohohohoho Whoah. What?! I'm catching the theme now The Rogue 1 Theme, this thing looks like a Stormtrooper, right? With the- With the black grille and the black wheels Rogue One Star Wars LIMITED EDITION you've got some Star Wars emblems on the back over here right here to be reminded that you've got the limited edition Watch! Look at that! There's a light up Star Wars logo right here Oh, even and the floor mat is special, as well! Oooh! I got the glass roof on this one Real nice! Look inside the cup holders! Similar to the badges on the outside the reflected on the inside of the cup holders as well. What the...? Key chain, one in one thousand?! Oh, wow there's a matte 3D keychain and a glossy 3D keychain limited edition that's the rare one 1 in 1,000 get your USB, your auxiliary I know you guys going to be interested in that, power alright so the first one is the shade right and then you get the glass the full panel glass and then you got the sunroof as well as fit for a Stormtrooper right there I know it's over here we got us we got a Sport mode this is all-wheel drive SUV right as you know is the Eco mode as well so there's a display in between your speedometer i kinda like how they put the flat edge on the steering wheel your controls here for answering any phone calls of course it's got the bluetooth oh yeah i'm seeing the color now you see pinkish purple color coming in there you can change the color you can theme it out. You change that to red it's the instant darkside. Curious i want to see how big the trunk and then i just noticed got a backup camera, that's a must you got to have this The privacy... Yes! Check it out! We got the spare there, as well In case you are out on some kind of special mission Oh, you know what? Sometimes I get squashed in the backseat. This is decent Cup holders come down, there you go More cargo. We need check out the sound system right? Nissan Connect: \"The system is searching for your phone using your handset, look for a bluetooth device called 'my car'. \" OK OK Ooooh! *music lmao Picture us Jack! Huh? We're cruising! Star Wars style! So you get the multimedia controls on the wheel *more music lmfao So, what you guys are looking at here is a legitimately limited Nissan Rogue So if you're a Star Wars' fan and you're looking for your vehicle to somehow commemorate your love for the Star Wars Universe this is as close as you're ever going to get. And there's only 5,400. 5,000 in the US and 400 in Canada. This helmet which I unboxed first of this Death Trooper this thing in and of itself is completely limited the only way to get this is along with the vehicle so that's included you've also got the custom paint set up where you've got blacked out rims blacked-out handles as well as the roof rack LED headlights LED indicators and of course the entire interior if you've got a family member a friend anybody you know who's into Star Wars you got to share this one because this thing is incredibly limited and incredibly unique. *music all over the place Smash! Read carefully. Thanks for using the subtitles, IK.",
    "transcript_keywords": [
        "Star Wars",
        "Star Wars LIMITED",
        "Star Wars Death",
        "Star",
        "Star Wars Universe",
        "Wars",
        "today its ait",
        "surprise component",
        "basically been feeding",
        "Wars Death Trooper",
        "Wars LIMITED EDITION",
        "Star Wars emblems",
        "Star Wars logo",
        "Star Wars style",
        "limited Nissan Rogue",
        "LIMITED EDITION",
        "LIMITED",
        "cup holders",
        "Death Trooper",
        "Wars LIMITED"
    ],
    "transcript_entity_values": [
        "Watch!",
        "3D",
        "The Rogue 1 Theme",
        "Santa",
        "today",
        "USB",
        "1,000",
        "first",
        "Nissan Rogue",
        "Jack",
        "1",
        "Rogue One Star Wars LIMITED",
        "one thousand",
        "only 5,400",
        "5,000",
        "Nissan",
        "Christmas morning",
        "US",
        "To Lewis",
        "Cup",
        "1:1",
        "Canada",
        "400",
        "one"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "GPE",
        "WORK_OF_ART",
        "EVENT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL"
    ]
}