{
    "id": "1BLU-tnFOXk",
    "title": "CHEAP does NOT mean GOOD VALUE - Budget GPUs Explained",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-12-13T19:31:40Z",
    "video_url": "https://www.youtube.com/watch?v=1BLU-tnFOXk",
    "category": "Science & Technology",
    "tags": [
        "gpu",
        "video card",
        "graphics card",
        "cheap",
        "budget",
        "value",
        "performance",
        "price",
        "cost",
        "display",
        "GT 1030",
        "GTX 1630",
        "GTX 1650",
        "RX 6400",
        "RX 6500 XT",
        "amd",
        "nvidia",
        "naming",
        "misleading",
        "Pascal",
        "Turing",
        "RDNA2",
        "Radeon",
        "GeForce",
        "upgrade"
    ],
    "views": 2512331,
    "likes": 84377,
    "comments_count": 3632,
    "description": "Get Exclusive NordSecurity deals here   All products are risk-free with Nord's 30-day money-back guarantee!  Try Zoho One free for 30 days with no credit card required here:   Budget GPUs might look cheap, but theyre more expensive than you think for such low-end cards. When is it okay to buy one, and how can you tell if youre overpaying for yesteryears cards?  Discuss on the forum:   Buy a Radeon RX 6400:  Buy a Radeon RX 6500 XT:  Buy a GeForce GTX 1080:  Buy a GeForce RTX 2060:  Buy a Radeon RX 590:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:04 Good reasons to buy a bottom-tier GPU 1:30 But they're not a good VALUE 2:42 AMD and Nvidia choose deceptive names 4:59 How to determine performance from benchmarks 7:56 Bottom-tier GPUs are not VALUE GPUs 8:30 Alternative solutions you should try first 10:35 My favourite alternative - Buy USED 12:10 Why do these cards exist then? 13:50 Conclusion",
    "description_links": [
        "https://nordsecurity.com/linus",
        "https://www.zoho.com/one/lp/linus.html",
        "https://linustechtips.com/topic/1473799-cheap-does-not-mean-good-value-low-end-gpus-explained/",
        "https://geni.us/T15q9k",
        "https://geni.us/mcDA",
        "https://geni.us/XaXV",
        "https://geni.us/x6zH",
        "https://geni.us/eZSH",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- It's easy to look at a GPU that costs $1,000 and think, \"What, all of that for games? What a bad deal.\" But what if I told you that cheap GPU next to it is even worse? Don't buy it. I'm not shaming anyone for being on a budget, I've been there, which is why I know that the less you have, the more important it is to shop smart, and this video is gonna arm you with everything that you need to avoid the pitfalls of the extreme budget segment but without blowing up your budget. The best part is that you can use what you're about to learn for years to come because these principles have been valid for as long as this channel has existed, and it doesn't look like they're gonna change anytime soon. Like my cringe segways to sponsors like- - Zoho One. Zoho One brings together sales, marketing, finance, analytics, and support in a single unified platform to run your entire business. Try Zoho One today for 30 days using the link below. (upbeat music) (metal clinks) (laser bloops) (air whooshes) (energetic upbeat music) - Let's begin with a couple of good reasons to buy a basic GPU. Let's say your PC dies the night before a deadline and grabbing the cheapest thing on the shelf at Best Buy is your only way to get back up and running, I would do the same thing, or maybe you're hacking together a low-power Plex Box or a utility PC from old hardware. If you only need some form of video output, budget GPUs can end up being your only option thanks to their compact size and low power consumption, but if your main consideration is the cost, these good reasons start to disappear very quickly, because now what matters is the value of what you're buying, which for gamers fundamentally boils down to one thing, for every dollar I am spending, how much performance am I getting? And typically for a GPU that's measured in FPS or the number of frames that it can render per second. For many of you watching this channel this concept might seem downright intuitive but people who aren't enthusiasts might not have the context to interpret a graph like this, and they shouldn't be shamed for that. I mean, I don't know everything there is to know about tires, for example, and think about it, if you spent your whole life gaming on consoles, compatibility is binary, it runs or it doesn't run, you've never had to think about how well it runs and how that might vary depending on the rest of your setup and the games that you're playing. Making matters worse for new buyers, it's not obvious whether a given graphics card on the shelf will deliver an acceptable gaming experience, and I lay a lot of the blame for this firmly at Nvidia and AMD's feet, both use naming schemes that work a little something like this. Your first number or numbers is the generation of the product, the next one is its performance class, and the final is a placeholder that sometimes gets used to denote an in-betweener product. You've got your suffixes like XT or Super that typically denote a more better version of what is fundamentally the same thing. The issue is that neither of them treats their own conventions as anything other than rough guidelines, and both of them have shown that they're willing to break these conventions outright in the interest of making a subpar product seem more desirable. Take the GT 1030 and GTX 1630 from Nvidia, for example. From the numbering alone we might conclude that, while they're in a similar class, there should be a huge performance difference between these two cards, and there is, but it's not as much as you might expect. While the name suggests that the 1630s should be six whole generations newer, there's actually only one generation separating these two cards, and even within its own generation, I consider the 1030s naming to be very misleading. Consider this, a 1070 is roughly 80% as fast as a 1080, a 1060, roughly 70% as fast as a 1070, which kind of makes sense so far, right? But then a 1050 is only half the speed of a 1060, and a 1030 falls to just half the speed of that making matters more complicated. Nvidia has made headlines multiple times in recent years, in recent days, actually, for releasing GPUs that use the same numbering scheme but with downgraded memory configurations that are catastrophic for performance. As an innocent victim, I mean shopper, how am I supposed to infer that higher performance tiers have large price gaps and small performance gaps, while lower performance tiers have small price gaps with big performance gaps? Even as someone who does understand the numbers, I would be totally lost here, which is why the savvy shopper then always comes back to frames per second. Let's talk about how to read a graph like this. - This is a performance graph for in-game performance, it's the result of data collected over the course of the benchmark, and the bars you see here indicate how smooth the overall display is. Each item is split into three bars here, average, 5% low, and 1% low frame rates. Average is exactly that, the average performance, but it doesn't tell you the whole story, because how fast a game runs at any given moment differs depending on what's happening on screen, that's where the lows come in, and these represent the lowest frame rates that were recorded 5% and 1% of the time respectively, which paints a more complete picture of the performance that you can expect from scene to scene. What frame rate is acceptable or playable is very subjective, but generally speaking, gamers often want to see 60 or higher on these minimums in order to ensure animations and motion is as smooth as possible on the typical consumer displays that can display a new frame 60 times per second. Even then, a high average frame rate with low minimums indicates a wide swing in performance that will be very noticeable during gameplay unless both are well above 60. Console games will often lock their frame rate to 30 if they can't reach 60 to ensure those swings don't happen, and while that's often controversial for current gen owners, it crucially ensures that things feel consistent from frame to frame. But don't be fooled into thinking that you'll exactly match a GPU's performance shown in graphs like these. The system it's installed in will have a massive impact on the level of performance, and this phenomenon is often referred to as bottlenecking, where the maximum performance is held back by the weakest link, this is why you have to pay attention to the system that a reviewer is using to test a GPU. One piece of information you might notice is missing is the price, and that's something that we've tried and unfortunately failed to incorporate into our graphs in the past. The reason is that the actual price is often going to be very different from what the MSRP is, especially late into a product's life cycle, and the used price is going to change the calculus even further and is not consistent, but performance mostly is. This is where it's up to you to check the current market conditions and weigh the performance data against the costs today, it's also up to you to make sure that your performance data is as accurate as possible by using multiple different reviews. Well, no one wants to make an incomplete review, testing for reviews are often done in the span of a week or less, and none can be truly exhaustive, that means that each of us has to prioritize our testing and we'll all have different priorities. Some reviewers test different games at different settings, or compare different GPUs, and this is crucial for understanding the complete picture. Plus sometimes reviewers mess up, that's why you should always check multiple reviews before making a decision. - Now that we're familiar with how to interpret these numbers, there are a couple of things that are going to stand out. First and foremost is that the blank tees on lttstore.com are great quality and very reasonably priced. Second is that, like I've been saying for years, it should be illegal to call a low-end GPU value or budget, because it's people on a budget who can least afford to have their money wasted, and these things are just that, a complete waste of money across the board, but just pointing out problems isn't useful, what are the solutions? I'm glad you asked. The first one is the kind of thing that makes you kinda scratch your head and go, \"Really?\" Instead of buying an entry level GPU like one of these, buy the next tier up for almost the same amount. Yeah, you heard me. Look at the pricing for the GeForce 1630, while you could treat yourself to a polished turd in a box of KFC, the $20 price gap to get double the performance with a 1650 seems like a a no-brainer, especially if you consider that, even though both of these cards might run your games today, the 1650 is gonna last you a lot longer as new games come out. The $30 delta on the AMD side of things is a bit steeper, but we've also seen promotions that have brought the 6500 XT down to literally the same price as a 6400, and what goes down almost always comes down again. Option number two is a little bit outside the box, but can be an effective way to upgrade not only your GPU, but actually your whole system, without spending extra money. Let's say you're running a fourth-gen Intel CPU from about 10 years ago. Working motherboards from that generation are worth more than you'd think, selling for anywhere from 60 to $100. A fourth-gen Core-i5 is worth about 15 bucks, and eight gigs of DDR3 is worth anywhere from 15 to $20. As a kit, you might even be able to do a little bit better, so at minimum, you're gonna be left with $90 to spend alongside your $150 GPU budget. Well, guess what? You can actually upgrade to a Ryzen 5 5600G with 16 gigs of RAM and an A520 motherboard for about $240, that gives you six much faster CPU cores, double the RAM, and an integrated GPU that, guess what, will perform on par with that GT 1030 that you could have bought, you're also getting modern features like extra USB three ports, M.2 storage support, and the ability to run Windows 11 without any hacks. I mean, who doesn't like a fun little Facebook marketplace adventure? It's kinda like your own little \"Scrapyard Wars.\" Option number three though is my personal favorite. Why do you want a brand new card sealed in a box when a much better one is a bus ride and a quick dust cleaning away? A good rule of thumb is that for any current generation GPU there's probably going to be a previous gen one that is either faster for the same price, or cheaper for the same performance. For example, the 1630 is priced at about 150 to 190 US dollars, for that kind of money you could get a GTX 1080, I mean, sure, it's from 2016, and it will consume more power while you're gaming, but it runs at least twice as fast, and there are other options. Why don't you save some money on an RX 590 from AMD? That is a great performing card from 2018 that regularly sells for under 100 bucks. Option number three is also great if you don't care about gaming performance at all, since if all you're after is a basic working GPU so you can output video, those can be had for so little that even if they die, you could just buy another one and still have money left over, compared to buying a brand-new card. On that note, I get it, not everyone is comfortable giving up a warranty, but I would make the argument that much of that risk can be mitigated by using platforms like eBay with buyer protection, or doing what I used to do, and testing products when you meet up to buy them. With the amount I've saved over the years buying secondhand hardware, it has more than covered me for the odd failure. Which is all fine and good that we have these options, but there are still a couple big questions remaining, like, \"Why do these crappy products exist at all?\" And why don't AMD and Nvidia just price them fairly then? Do they hate poor people? Let's address that one first. It comes down to the steps involved in building a card and getting it to your door. Every GPU, no matter how low end or high end, has some fixed costs. The gold in the contacts, the copper in the PCB, the PCI bracket, assembly, HDMI port royalties, quality assurance testing, all of that stuff factors in before the cost of the expensive parts like the GPU chip itself, the memory, the voltage regulators, so the lowest end GPUs actually start to approach this fixed cost floor to the point where the manufacturing cost isn't significantly different compared to the step up, and this is especially true when, like the GTX 1630 and 1650, the two cards actually use the same physical chips. We'll have these better value cards linked down below. As for why they exist then, the chips in these bottom-of-the-lineup GPUs are most often created first as mobile chips. In a laptop the cost difference often really is a matter of just choosing which GPU to solder on, because almost all of the supporting components are already part of the final product. There's already power delivery circuitry, there's already a cooling system, there's no need for a PCI bracket, and the outputs are already there. A laptop is assembled and QD as a whole unit, so these GPUs can make economic sense in that market. What makes economic sense for me is to segway to our sponsor. - Nord Security. If you keep up with the tech news, you'll know that hackers are always looking for new ways to compromise everything, from tech giant servers to grandma's computer. Thankfully, Nord Security's well-rounded protection package is there to help protect your files, devices, and personal data online. Like NordPass, a password manager that helps you generate unique passwords across your devices and browsers, or NordLocker, a powerful file encryption and sharing service that's a great alternative to Google Drive. Cybercrime is everywhere these days, so make sure you're taking the right precautions when you surf the web. Right now you can get four months free on all of Nord's products. So what are you waiting for? Head to nordsecurity.com/linus or click the link down on the description below. - If you're looking for something else to watch, go check out the last time we did a video about how cheap GPUs sucked when, wait, Luke hosted it? That was six years ago? Time sure flies, eh.",
    "transcript_keywords": [
        "GPU",
        "performance",
        "GPUs",
        "GPU performance shown",
        "GPU performance",
        "price",
        "frame",
        "budget",
        "buy",
        "frame rate",
        "performance gaps",
        "games",
        "budget GPUs",
        "GPU budget",
        "thing",
        "card",
        "cards",
        "years",
        "current generation GPU",
        "performance data"
    ],
    "transcript_entity_values": [
        "DDR3",
        "the years",
        "one",
        "eBay",
        "NordLocker",
        "1060",
        "eight",
        "One",
        "Zoho",
        "GPU",
        "2018",
        "60 to $100",
        "about 10 years ago",
        "FPS",
        "AMD",
        "1080",
        "three",
        "590",
        "Facebook",
        "20",
        "CPU",
        "100 bucks",
        "only one",
        "years",
        "2016",
        "GT",
        "first",
        "1030s",
        "1630s",
        "the night",
        "First",
        "KFC",
        "Plex Box",
        "5% and 1%",
        "6500",
        "190 US dollars",
        "CPU",
        "six",
        "roughly 80%",
        "60",
        "Ryzen 5 5600",
        "only half",
        "Intel",
        "the span of a week",
        "30 days",
        "Nord Security",
        "six years ago",
        "just half",
        "Google Drive",
        "recent years",
        "30",
        "150",
        "6400",
        "MSRP",
        "about 15 bucks",
        "1070",
        "5%",
        "XT",
        "16",
        "Nord Security's",
        "15 to $20",
        "30",
        "roughly 70%",
        "about $240",
        "fourth",
        "two",
        "four months",
        "PCB",
        "NordPass",
        "second",
        "Second",
        "Nord",
        "1630",
        "Super",
        "90",
        "today",
        "1%",
        "1650",
        "Windows 11",
        "PCI",
        "RAM",
        "1050",
        "recent days",
        "1,000",
        "AMD",
        "GTX",
        "1650",
        "about 150",
        "Nvidia",
        "Zoho One",
        "A520",
        "Luke",
        "USB",
        "Best Buy"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG"
    ]
}