{
    "id": "1CBQM2X8BZQ",
    "title": "This is a computer - XDO.AI PicoPC",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-26T18:16:54Z",
    "video_url": "https://www.youtube.com/watch?v=1CBQM2X8BZQ",
    "category": "Science & Technology",
    "tags": [
        "tiny pc",
        "worlds smallest pc",
        "travel pc",
        "tiny projector",
        "nvme",
        "android projector",
        "intel compute stick",
        "kickstarter",
        "tech",
        "gaming"
    ],
    "views": 3411284,
    "likes": 95184,
    "comments_count": 3955,
    "description": "Subscribe to our Floatplane account for exclusive content today at   PDQ.com: Start your FREE trial now! At   This tiny PC is one of the coolest devices I've seen in a long time! I'm going to show you all the cool stuff it comes with (including the mini projector), what it looks like inside, and what it's like to game on it.  Discuss on the forum:   Check Out the Pantera Pico PC:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:40 look at this tiny pc 1:02 cute accessories 3:09 Teardown 5:31 Intel \"J-series\"?? 7:16 Testing NVMe compatibility 7:58 Booting up 10:48 Gaming on it 11:39 Can I stream 4K? 11:52 My thoughts",
    "description_links": [
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/PDQOct",
        "https://linustechtips.com/topic/1484077-this-is-a-computer-pantera-pico-pc/",
        "https://lmg.gg/ZLpTH",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Let me get this straight. This is a computer? - I'm a computer. - And this is its monitor? This raises a lot more questions than it answers. Like, what's a J Series Intel CPU? And how on earth did this raise over a million Canadian dollars on Indiegogo. People really need a PC this small? And a mouse this small? Look, it even looks tiny in my hands just like this tiny segue to our sponsor. - PDQ, Automate patch management and software updates with PDQ. Search their library of over 200 ready to deploy applications and install software zero touch from your desk. Start your free trial at pdq.com/ltt. - Holy crap, this thing is really small. It is apparently a fully featured Windows 10 compatible PC complete with USB-C power in, three USB 3.0 ports, a micro SD reader, HDMI out, and even a headphone jack. I know you can't take that kind of thing for granted these days. But it's not even the computer that impressed me the most. It's the accessory package. It comes to us from a company called xdo.ai who completed their Indiegogo campaign way back in 2021 but only now appears to be actually shipping units out to their backers. This thing in my hand is in accompanying PICO projector. That seems to have, well, everything you'd expect. HDMI input, power button, five volt power in, wow, a little cover for the lens, and even a built in speaker, if the audio controls are anything to go by. And it's not just that. It's one of those adorable retractable cord mobile mouses. Mouses. It's not gonna be a contender for world's smallest gaming PC. Shout out Basically Homeless. HDMI to mini HDMI cable. We'll be using that for our setup. Little tiny tripod. Wow. It comes with a remote. Okay, what else am I looking at here? Ooh. (package rattles) Some stuff they seem to be engineering themselves. Other stuff they seem to be pretty much putting a sticker on. And if you're wondering, what leads me to the conclusion this is simply a rebadged product. Well, for one thing, it's USB-C which isn't even compatible with the PICO PC's so it comes with a C to A adapter and for another why would you add a micro SD card reader to a product that has a trans flash card reader? I mean, hey, look, I'm not saying no to more expansion. This is a really nice little carrying case though. If the whole point is to have a little tiny computer, why am I carrying it around on this? There's a smaller version of the case. Whoa. Okay. This is more like it. I can have my whole computer, my mouse, my projector. Holy crap. We're gonna have a lot of fun with this thing. Oh, it's a battery bank. Oh, no way. I didn't even notice. Whoa, that is awesome. Oh, I'm loving this. Can I get my keyboard in here? I don't know if I would describe this as the the most cohesive ecosystem. This cable apparently allows you to power both the projector and the computer off of the battery pack. We'll take a closer look at that later. First, I wanna crack this baby open. Whoa. What a disappointment. I brought my lethal tiny prototype LTT storage screwdriver. I mean, it's still not really a precision driver. It's more intended for hard to reach spaces. Bummer. Instead of directing you to something you can't buy though I should direct you to the Shortcircuit Hoodie. Oh, actually, that would be way better. Oh, oh, oh, amazing. You guys ready for this? What? This is bizarre. They recommend configuring your Pantera PC, not that one different Pantera, with a larger SSD than you think you need, which seems to suggest that it's gonna be really hard to change after the fact if you end up need more capacity, but in fact that couldn't be farther from the truth. This is just about the easiest mini PC SSD swap that I've ever seen. Three plastic screws, one fairly easily removable rubber gasket, and then a single screw. It's right there. This is awesome. Yep. That is about as generic as it gets. It's called Solid-state Drive, lowercase state, capital Solid, capital Drive. You might say it's a solid drive. No company that I recognize on either the controller or on the NAND flash and it does not have a DRAM cache. Though, that doesn't really surprise me at the price point for this system. Aside from being extremely small in size, it's extremely small in price. It should be noted though that that's early bird pricing, if you gave them your money a year and a half ago. The actual MSRP for these things is gonna be $219 for the base model and go up to $399 for the eight gig RAM, one terabyte storage model. Oh, there's little plastic pins. No, this isn't so bad. I won't break it. Don't worry. I'm not gonna break it, Jake. Ooh. Hey. There we go. Oh my God, this thing is so cool. (nervous shrieks) Okay, there's our CMOs battery. It's got a mid frame to separate the two boards from each other. This appears to be the IO board. If the label is anything to go by. This appears to be a micro SD card reader controller. Right here, we're looking at a Real Tech chip of some sort. If I had to guess, I'd say that's to do with the onboard audio. USB three? No idea. Though, I suspect at least one of these ribbon cables is carrying a PCIe by four signal for this M.2 slot. It's SATA? Aw boo. That reminds me. What the heck is an Intel J Series CPU? What we're looking at in here is a quad core CPU that runs it up to 2.7 gigahertz burst, two gigahertz base meaning that this thing could actually be reasonably capable if only I could get at it. Ah, I see the screws. The specific model is the Celeron J4125 and it is obviously designed for extremely low power applications. It only supports a maximum of six PCIe lanes at gen two speeds in spite of being a actually relatively current product and it sips power at a 10 watt TDP in spite of its 14 nanometer manufacturing process. There are a couple of smart things I see in here. First of all, the wireless and Bluetooth chip set here has the antennas glued onto it. Not in a like malicious anti-right-to-repair way but in a, 'Hey, we really don't want these to come loose in shipping 'cause this is gonna be a real nightmare'. This is super cool. And then the air intake is basically handled through a grill right here that has a little stopper to make sure that it never gets compressed and blocks the fan from spinning. And then there's a tiny teeny tiny gap. Just enough, I guess, to get air to that 10 watt CPU that can then be exhausted out the side of the unit through, yes, this vent hole. I can't believe how much computer is in here. My gaming desktop, when I met Yvonne, was in a Silverstone Tj07 and had a quad core CPU and eight gigs of ram. (laughs) What? Is this for Lighting? It has lighting. Nice. This is awesome. It's shockingly service simple. You know what, Jake? This M.2 slot is not keyed for SATA only. There's no way that they would, they would just use a SATA keyed M.2 slot. (light music) - Wow. It's so little. Oh no. This is too small. You know what if I just put it in here, I put a little one terabyte sovereign gen four drive, it'll probably work. (light music) (gasps) I can't use the keyboard in the buy house 'cause it's Bluetooth. Holy (beep). No way. I'm putting into my windows installer, which is good. Whether or not it's gonna detect the NVME drive is a whole other story. (keyboard clicks) Come on. (light music) Ah. Drive not detected. Ah. Portable. Oh, look at that. It's got the blue lights. Got a little cooling fan in there. And watch this. Boom, taller tripod. Oh yeah. Oh yeah. It's got auto keystone. It's not the brightest thing ever. Oh, no way. The projector is also running, what? Android, I guess. Oh, there's no batteries in the remote for the projector. Thankfully. I have these handy dandy buttons on the top. Shut up. Is this a mouse? It's a mouse! It's a mouse, Andy! It's a track pad on the top. Are you kidding me? Yes. I have a focus wheel. - [team member] Cool! That's sharp. Oh, no way. I could rear project and then I could put this in front of me and point it and sit behind the curtain. Oh, there it goes. Given that it took a full minute to get to the sign-in screen, I think I'm done with the Android aspect of the projector. Let's switch to our HDNI input and try our PICO PC. Okay. I'm triggered by the fact that their USB ports are upside down of what is normal. We're having a very hard time getting clear text out of this projector. The issue is that the native resolution is 854 x 480 wide VGA. I'm imagining a D sub connector walking through the halls just getting wider and wider. This mouse wheel does not have a middle. Oh, it does have a middle click. That is the heaviest middle click. That's usable. That's usable. I mean, the enter key's not really where it's supposed to be, but it's usable. Would I take this to a coffee shop? Not unless I was trying to start a conversation with all the dudes with facial hair there. And the projector is way louder than the computer. Their Indiegogo is amazing. A new era of personal computer. New era, Jake, Why would you build a computer when you can have this? Perfect for work from home. User expandable storage. 4k UHD video output. Works as a game center. Note, they don't say gaming PC. Yeah, I don't think we have enough CPU to even like download. Oh, wow. Okay. Okay. We're looking at about 60% CPU usage downloading at 100, 150 megabit. And more impressively, our poor SSD is at 50% usage. Just downloading Counter-Strike. To be clear, if you wanted to use this as a thin client for streaming, say for example with Steam Link, I don't see any reason why that wouldn't work with reasonably current HD graphics. HD graphics, though. It's only downloading it 10 megabytes a second. - [Team Member] You hear that privileged talking? - Look, it's not about being privileged or whatever. It's about the capabilities of the product. It is only 10 megabytes a second, well, 16. When the cable it is plugged into can carry 115. Okay, 122 then if you want to be super pedantic about it. This SSD may be slower than a hard drive. Yikes. Okay, here we go. CS source. What kind of FPS. Let's go - [Jake] That's not bad. - [Game] Man. Look at now. You're all (beep) up. (crew laughing) - How did he know I was using this computer? Oh, come on, hack. (loud gunfire) Oh my God. I just got headshot. (rapid gunfire) - (mimics gunfire) I gotta be a shooter. I can't even see anything. Come on! The latency is actually not bad. Very usable. Oh my God. You can't be moving the display around while I'm trying to game here. - [Team Member] Now you're ultra wide. - I could get one kill. Okay. I'm gonna get one kill. No! Now come on, they're everywhere. I can't even tell what theme people are on though. Everything's just a moving black blob. (rapid gunfire) BBK TV. Like that BBK? Like OnePlus BBK? This is pretty slow for a wired connection. Can we watch a 4K video though? The answer is yes. While I can't say that I would necessarily recommend the projector as anything more than a toy for the kids or, I mean, I guess their pitch for it is it's for in an emergency doing a presentation or something like that. The computer itself actually kind of an interesting value proposition. Obviously it's underpowered compared to other small computers, but it's also under priced compared to other small computers. There are performance deficiencies. The SSD isn't great. The CPU leaves a lot to be desired and frankly the fan on it isn't exactly silent. But at the cost and size its competition is probably closer to an Intel Compute Stick than it would be to a full-size desktop PC or even a laptop. And if all you're gonna do is watch YouTube videos and do basic word processing, there is no reason that especially the Windows 11 compatible version couldn't last you for years. It's kind of compelling like this compelling message from our sponsor, FLOATPLANE. That's right, we're talking about floatplane.com our own streaming service that delivers you content from creators like us. We host a ton of special content there. Everything from behind the scenes to extras from the cutting room floor to highlights of our team members to travel vlogs. Basically anything that would algorithmically hurt our channel on YouTube goes up on floatplane. One of my personal favorites, aside from the extended four hour cut of the Call Me Chris collab, is the behind the scenes of filming the intro of the StarForge PC review. It's a really good look into how we actually film our videos and has gotten rave reviews from the community over there. Speaking of which, besides access to exclusive content you also get access to community integrations. So if you wanna see even more from us you can subscribe for five or 10 bucks a month at lmg.gg/lttfloatplane. If you guys enjoyed this video, maybe check out our review of the SPUD, the spontaneous pop-up display, which would be a great companion for your PICO PC.",
    "transcript_keywords": [
        "computer",
        "CPU",
        "thing",
        "projector",
        "small",
        "Drive",
        "tiny",
        "Series Intel CPU",
        "small computers",
        "mouse",
        "SSD",
        "HDMI",
        "power",
        "PICO",
        "core CPU",
        "Indiegogo",
        "Intel CPU",
        "Series CPU",
        "reader",
        "wow"
    ],
    "transcript_entity_values": [
        "one",
        "115",
        "100",
        "SSD",
        "eight",
        "One",
        "USB-C",
        "zero",
        "Solid",
        "CS",
        "BBK",
        "VGA",
        "Andy",
        "UHD",
        "Three",
        "Real Tech",
        "J Series CPU",
        "a year and a half ago",
        "Pantera",
        "only 10 megabytes",
        "LTT",
        "three",
        "YouTube",
        "two gigahertz",
        "2.7 gigahertz",
        "NAND",
        "219",
        "years",
        "HDNI",
        "FLOATPLANE",
        "lmg.gg/lttfloatplane",
        "First",
        "Windows 10",
        "10 watt TDP",
        "Indiegogo",
        "xdo.ai",
        "14 nanometer",
        "five volt",
        "854",
        "Chris",
        "Silverstone",
        "4",
        "480",
        "CPU",
        "150 megabit",
        "six",
        "over 200",
        "50%",
        "StarForge",
        "SPUD",
        "the Shortcircuit Hoodie",
        "Intel",
        "IO",
        "four",
        "2021",
        "SD",
        "10 watt CPU",
        "up to $399",
        "16",
        "jack",
        "five or 10 bucks",
        "a full minute",
        "HDMI",
        "OnePlus BBK",
        "four hour",
        "two",
        "PDQ",
        "these days",
        "Android",
        "122",
        "second",
        "Jake",
        "about 60%",
        "Celeron",
        "over a million Canadian dollars",
        "Yvonne",
        "10 megabytes",
        "4k",
        "Windows 11",
        "SATA",
        "at least one",
        "RAM",
        "BBK TV",
        "USB",
        "Intel Compute Stick",
        "Lighting",
        "NVME"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "DATE",
        "NORP",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "TIME",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG"
    ]
}