{
    "id": "1cX82-xN7b0",
    "title": "Insane $100,000 home lab!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-07-18T14:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=1cX82-xN7b0",
    "category": "Science & Technology",
    "tags": [
        "100gbe",
        "100g ethernet",
        "100 gigabit ethernet",
        "100 gigabit internet",
        "100gbe switch",
        "ethernet",
        "100gbe network",
        "25gbe switch",
        "25gbe",
        "network switch",
        "100 gig",
        "dac cable",
        "networking",
        "aruba",
        "aruba networks",
        "QSFP28",
        "qsfp",
        "100g",
        "100g qsfp",
        "aruba 8360",
        "aruba 6300m",
        "aruba 100g switch",
        "aruba 50g switch",
        "aruba networking",
        "ethernet switch",
        "qsfp+",
        "hpe",
        "dac",
        "sfp+",
        "ethernet cable",
        "arubaos",
        "mellanox",
        "mellanox connectx",
        "hp",
        "arubaos-cx",
        "hpn",
        "switch",
        "qsfp-sr4",
        "sfp",
        "abc networking",
        "managed switch",
        "10g network"
    ],
    "views": 60636,
    "likes": 2295,
    "comments_count": 256,
    "description": "This is one insane home lab = $100,000 worth of Aruba networking equipment that includes 8360 with 100 GbE and 6300M switches with 50 GbE, QSFPs, SFPs, CPUs, GPUs and more! See the physical connections used for 100, 50, 25 and 10 Gigabit Ethernet. 100 GbE // 100 Gigabit Ethernet is here! Big thank you to Aruba for sponsoring this video!  Menu: 0:00  $100,000 lab 1:09  100GbE QSFP28 1:25  MPO breakout cable 1:56  25GbE SFP28 3:04  50GbE uplinks 3:40  100 GbE Copper DAC Cable 4:12  200 GbE 4:56  50 GbE DAC Cable 5:36  100 GbE Mellanox Network Card 6:01  25 GbE  Mellanox Network Cards 6:50  10 GbE Copper SFPs 7:16  10 GbE MacBook Sonnet converter 7:55  10 GbE Fiber SFP 8:17  1, 2.5 or 5 Gbps 9:08  Difference between Multimode and Single mode fiber 9:43  Visual Light demonstration of light in cable 9:56  Multimode demonstration 10:40  Single mode demonstration 11:00  Light going through cable  Previous video:   ========================= Free Aruba courses on Udemy: ========================= Security:  WiFi:  Networking:   ================================== Free Aruba courses on davidbombal.com ================================== Security:  WiFi:  Networking:   ====================== Aruba discounted courses: ====================== View Aruba CX Switching training options here:   To register with the 50% off discount enter DaBomb50 in the discount field at checkout.   The following terms & conditions apply: 50% off promo ends 10/31/21 Enter discount code at checkout, credit card payments only (PayPal) Cannot be combined with any other discount. Discount is for training with Aruba Education Services only and is not applicable with training partners.  ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:     aruba aruba 8360 aruba 6300 aruba networks aruba networking abc networking qsfp qsfp28 sfp28 sfp56 sfp aruba 6300m 100gbe switch 50gbe switch 25gbe switch  10 gbe swtich 100 gigabit ethernet 50 gigabit ethernet 25 gigabit ethernet 10 gigabit etherent dac cable  aruba instant one hpe hp hpe networking aruba mobility aruba security training free aruba training clearpass clearpass training hpe training free aruba clearpass training python wireshark mellanox mellanox connectx mellanox connectx-4 aruba networking  aruba networks abc networking  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #100gbe #100gigethernet #arubanetworks",
    "description_links": [
        "https://youtu.be/Q0sxqze-8tc",
        "https://davidbombal.wiki/arubasecurity",
        "https://davidbombal.wiki/arubamobility",
        "https://davidbombal.wiki/freearubacourse",
        "https://davidbombal.wiki/dbarubasecurity",
        "https://davidbombal.wiki/dbarubamobility",
        "https://davidbombal.wiki/dbarubanetworking",
        "https://davidbombal.wiki/arubatraining",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- What you're looking at here, is a 100,000 dollars of equipment. On the Aruba website, these switches are listed at $25,900. These switches are listed at $18,400. I've got two computers, one over here, one over here, which I used in this video to demonstrate 100 Gig Ethernet. These two computers have 100 Gig Mellanox interface cards in them. I was using one of these 8360 switches to demonstrate 100 Gig Ethernet. I really wanna thank Aruba for sponsoring this video and sending me this fantastic equipment. Without their support I wouldn't be able to demonstrate what I'm gonna show you in this video. I'm gonna show you multimode vs single Mode Fiber. I'm gonna show you a 100 Gig QSFP28 25 Gig SFP 28. Show you network cards. I'll show you a copper SFP versus a fiber SFP. There's a whole bunch of stuff to cover in this video. Okay. Let's get started. (upbeat techno music) Here as an example is a QSFP 28. This supports 100 Gig ethernet. So, as an example, I could take this QSFP 28 and put it into a port on the switch, 100 Gig QSFP. The interface on this QSFP is MPO. That allows me to use a breakout cable such as this. So, MPO on the one side, I could connect that to the switch. But notice here breakout cable, this supports four 25 Gig interfaces. So on the single cable, it's broken out into four. You can see the numbers here, so as an example, I could take cable one and take a 25 Gig SFP 28 and I could plug that into this port on the switch as an example and take port one. These have LC connectors. So I'll take the connectors off and I can plug that into the switch. So I have a 100 Gig QSFP 28 going to 25 gig SFP 28. And I've got four of those here, so what I could do is take another one as an example, and simply connect that to another switch. So as an example, here is my 25 Gig SFP 28. Plug that into this switch over here, take for instance, port three on this cable and LC connector once again, multimode fiber and connect it to that switch. So, I could do that for all cables. So I've got multiple 25 Gig SFP 28 here. I could connect another cable to this switch and another cable to this switch so that I've got 50 Gig uplinks. So something like this. Put those two in disconnect this, this is two so put that in there. And this is four, and connect that like that. So, 100 Gig single SFP 28, going to two 25 Gig ports on this switch and this switch gives me 50 Gig uplinks to the core switch. Now, that's just one example. I've also got DAC cable. So this isn't fiber, this is copper. Twinax cable, direct attach cable, these are 100 Gig. So as an example, I could put that into there and put that into there. And what I've got now is 100 Gig ethernet. So 100 Gig ethernet between those two switches. I'll just move this so that I've got more space. But as an example, 100 Gig ethernet between those two switches. I've got a few of these, so as an example, if I wanted to, I could connect multiple of these to give me, say 200 Gigs. So put that one in there and put that one on there. So if I bonded those two together, I could get 200 Gig between these two switches. 50 Gig uplinks between these two switches, to the switch as an example, 100 Gig between these two. You may not wanna do that obviously and that's why I've got another one of these. So, here's another 100 Gig MPO cable. So what you may wanna do as an example, is connect it to this switch and then add additional connections to these two switches. What I've also got here is a 50 Gig DAC cable. So what I could do as an example is connect these two switches together using 50 Gig. So, as an example, let me pull these out just to make some space here. So rather than just doing that, I could, as an example, run 50 Gig directly between the two switches. I'll remove all of these. And once again, I could, as an example, run 50 Gig between these two switches. So, this is a 50 Gig DAC cable. What I demonstrated in my previous video is 100 Gig on the Mellanox connections on these PCs using DAC cable to these 8360s. So (metal thumping) I could run 100 Gig like that. I could, if I, if I preferred use fiber rather than copper. So as an example, put these into these two switches and then run fiber MPO connections between these two. What I've also got here is 25 Gig network cards. I could put fiber SFP pluses in them as an example. These are LC connectors once again. So what I could do, is connect a port on the network card to the Aruba SFP like this. So, that would give me 25 Gig from the PC to the switch. So in the previous video, I demonstrated 100 Gig using DAC cables from my PCs to the 100 Gig ethernet switches, but that's an example of using fiber. So these have dual port, so I could connect both to give me 50 Gig. But there's an example of 25 Gig. I also have 10 Gig copper SFPs. So, Aruba switches will allow you to run non-Aruba SFPs up to 10 Gig. So I could put that in as an example on that switch and this one on this switch and then I could if I wanted to, connect a copper cable, and connect those two switches together using copper. But what you could do as an example, is use a Sonnet converter. This is 10 Gig, ethernet, and this can connect to a USB-C port on a Mac. So I could connect this to my Mac and I could get 10 Gig on that port. And I could do the same here. Ethernet to another Sonnet converter, so 10 Gig to another Sonnet converter. So I could connect two max and I'll demonstrate that when I'm running 10 Gig, I perf between two max using the Sonnet connectors. So, that's copper 10 Gig. Now, you could also, as an example, use fiber. This is once again a none Aruba SFP. So I could connect that in here. So I've got fiber LC connectors rather than copper. So hopefully as you can see, SFPs, QSFPs give you a lot of options. Now here, I've got 48 ethernet ports. This is copper. They allow me as an example, to use one Gig such as this. So you, one Gig, to USB or I could use a connector like this that gives me five Gig. These ports support one Gig, 2.5 and five Gigabits per seconds. So I have 48 of those ports. One of the problems I've been having with the slab is getting enough end points to be able to send enough traffic to the network. I, once again, have too much bandwidth for me to be able to use 12 100 Gigabit interfaces is very difficult in a lab environment like this or home environment. I need a lot of devices. There's too much bandwidth here. But hopefully that gives you an idea of some of the connections on these switches. Let's talk now about the difference between single mode fiber and multimode fiber. And rather than just talking about this, I wanna show you practically by sending the light through the cables and show you the difference between the cables. So, these Aqua type cables, this is an LC connector. This is multimode. This LC connector cable is single mode. Notice yellow cable. So single mode versus multimode fiber. Okay. So in this example, I've got a visual fault locator. Fiber doesn't use visual light, so you can't see the light. So that's why he must never point it at your eye. But here I'll be able to connect this to the fault detector and I'll be able to see the actual light going through the fiber. So here's multimode fiber and what you'll notice it isn't just a single beam of light. Notice the light is bouncing around. In multimode fiber the core is a lot bigger than in single mode fiber. So the light bounces around. And what you'll notice is if I move this cable, so I bend the cable, the light moves in the cable. So notice how it's moving there. I can adjust the light by just bending the cable slightly. So slight bend in the cable, light as being moved around because this is multimode fiber. The light is bouncing around in the cable. So any movement there adjusts the light going through the cable. So that's multimode. Single mode. So I'll connect this to the visual light fault locator. And what you'll notice there is the pattern is very different to multimode fiber. Notice you see a solid light. And if I move this around notice it's still a solid light and what you can actually see, is you can see the light bleeding through the cable. So you can see there it's bleeding through the cable. Now that's obviously something you don't wanna do. You don't wanna bend the cable because it'll affect your throughput and you can break the cable. Once again, it's glass inside so you can break it. But notice there's light bleeding through the cable and notice, even though I bend it and I'm bending it a lot, I still have a single beam of light. It's not bouncing around in the cable. The core is a lot thinner in single mode. Very nice to see it visually I think. Much easier to understand multimode and single mode if you simply see it like this. And again, here's multimode. Notice you can see that there are multiple beams of light there. And if I move it around, you can see once again, all of them moving around. Just slight movement there. And if I bend it quite a lot, you can see it's adjusting. So slight movement there, lots of light beams being bounced around. Whereas with single mode, we don't see that. So I'll turn it off again and use single mode one last time. And what you'll notice is a single beam of light. Move it slightly, still single beam of light. It's not multiple beams like we saw with multimode. That hopefully shows you quite clearly the difference between single mode fiber and multimode fiber. Here we have a single beam of light going through the core center of the fiber cable. Here we have a bunch of light beams being bounced around the center of the fiber cable. So when you buy SFP, so QSFP is as an example, SFP 56s, you need to make sure that you're using the right cable for the SFP. Is it multimode or is it single mode? Make sure you use the right cable type. (upbeat techno music)",
    "transcript_keywords": [
        "Gig",
        "Gig SFP",
        "Gig Ethernet",
        "cable",
        "SFP",
        "Gig DAC cable",
        "Fiber",
        "light",
        "Gig QSFP",
        "Gig single SFP",
        "single",
        "connect",
        "switch",
        "Gig DAC",
        "switches",
        "Gig copper SFPs",
        "single Mode",
        "multimode",
        "Gig MPO cable",
        "Gig uplinks"
    ],
    "transcript_entity_values": [
        "Gig SFP 28",
        "three",
        "USB",
        "Mac",
        "25",
        "200",
        "Gig DAC",
        "12 100",
        "the Aruba SFP",
        "18,400",
        "Aqua",
        "five",
        "One",
        "two",
        "four",
        "non-Aruba",
        "Mellanox",
        "Mac",
        "Aruba",
        "one",
        "100,000 dollars",
        "48",
        "Aruba SFP",
        "Gig MPO",
        "DAC",
        "Mode Fiber",
        "MPO",
        "25,900",
        "Gig Mellanox",
        "100",
        "LC connectors",
        "2.5",
        "10 Gig",
        "10",
        "50"
    ],
    "transcript_entity_types": [
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL"
    ]
}