{
    "id": "1DQn_n6jZNI",
    "title": "Amazon’s robot is just an Alexa on wheels",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-06-03T14:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=1DQn_n6jZNI",
    "category": "Science & Technology",
    "tags": [
        "amazon astro robot review",
        "amazon astro",
        "amazon astro robot price",
        "amazon",
        "amazon astro robot",
        "amazon astro bot",
        "amazon astro robot unboxing",
        "amazon astro robot release date",
        "amazon astro stairs",
        "amazon household robot",
        "amazon home robot",
        "amazon home robot 2022",
        "household gadgets",
        "household gadgets 2022",
        "best household gadgets on amazon",
        "the verge",
        "tech"
    ],
    "views": 95622,
    "likes": 2769,
    "comments_count": 217,
    "description": "Amazon Astro is a household robot that will cost $1499.99 when it goes on sale (you can request an invite to test it for $1,000 right now). Designed mainly as a mobile camera for home security, its also an Alexa smart speaker on wheels. While an innovative concept, without any arms theres really not a lot this robot can do. Heres a look at what its like to live with Amazons home robot Astro.  Read the full review here:   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the Amazon Astro Robot here:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3t1CDui",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3aBCW8P",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- [Jennifer] Astro do the robot dance - [Astro] Astro robot dance. (upbeat music begins) - A month ago, I welcomed a new addition to my household. Now along with my husband, my two kids, one dog, one cat, one bunny rabbit, and seven outdoor chickens, I've been living with an Astro, Amazon's first home robot. And it's designed to be a helpful assistant for your everyday life. It's essentially an autonomous Alexa on some souped up wheels, and when it goes on sale it will cost $1,450. But right now you can ask to road test the robot in your own home for the bargain price of a thousand bucks. As a very busy mom, wife, and full-time reviewer at The Verge, this robot has become that extra pair of eyes I've always wanted to help keep track of my brood. But if only it could be an extra pair of hands as well. Astro is a small robot, just under a foot and a half, and it roams around your house largely at will, tilting its face, which is a 10 inch echo show style touchscreen, up and down disarmingly, and winking, or smiling at you with its digital eyes. Which are two glowing circles that resemble the Alexa ring on an echo smart speaker. Two large white wheels make up most of its robot body, along with a small cargo area that yes can carry a beer. Like a regular echo speaker, you can ask Astro to play music through its two speakers, set timers, stream an episode of Buffy, lock the front door, or call your mom for a video chat using a built in camera. What's different, is it can do all of these things on the move. As I'm roaming around the house, picking up shoes, making dinner, feeding the dog, Astro could come with me keeping me constantly entertained. Well, in most rooms of the house. Dismissive Alexa on wheels comments aside, this is an actual robot. Not a quasi home robot like most robot vacuums are. And unlike most Alexa speakers, Astro does a lot of its data processing in its own little brain rather than using the cloud. This helps it be a lot snappier and a smidge more private. Astro is packed with navigation and obstacle sensors, that feed its visual simultaneous localization and mapping, and obstacle avoidance systems, which in English means that after it's mapped your home, it can mosey around easily without backing into chairs, tables or walls, or falling downstairs. And it can seriously move. It's way faster than robot vac. And while it's top speed is only one meter per second, that feels really fast in your living room. It also never once got stuck unlike every robot vacuum I have ever tested ever. And while a robot vacuum is the closest comparison I have to Astro, it uses similar mapping and navigation technology and I've spent a lot of time with robot vacuums, Astro is much much smarter. First off it doesn't bang into my feet all the time. Instead it's able to follow me around without getting in my way. It rarely gets stuck. Besides that one time it came face to face with my daughter's standup base and wisely sat motionless next to the $5,000 instrument, until I came and rescued it. It also maintains a respectable distance from dogs, backpacks, and any other stuff that happens to be lying on the floor in its path, and just reroutes. When it's got nothing to do, it goes and finds a spot to hang out, which used to be right in between my stove and fridge. And while it supposedly learns where you don't want it to be, it does appear to be something of a slow learner. When no one is around, it takes itself off to its charger to chill. All of this autonomous movement was actually the creepiest part of having Astro in the house. It's big glowing eyes would just suddenly appear over the couch, or I'd hear rumbling as it rolled over the carpet onto the hardwood floor. It does take some getting used to having a robot free ranging in your home. So what's the point of Astro? That was the main question I had during my four weeks living with Amazon's bot. While I enjoyed my entertainment moving around with me, I live in a three storey house and this robot can't do stairs. A pair of decent headphones, or apple airplay is a better slash cheaper solution. My kids enjoyed a few of the robot games and my husband loved the idea of Astro delivering him a beer, but the beer fridge is outside where Astro can't go and this robot has no hands. The dog and cat Gus and Smokey, who were both deeply suspicious about Astro's existence, did warm up a bit once it started throwing them treats from the Furbo pet camera we attached to Astro's USBC charging port. But Furbo works perfectly fine when it's not sitting in a thousand dollar robot. Astro definitely has more personality than Alexa which is not hard, but it's no Jibo. It's facial expressions are limited, and it rarely does more than just widen its eyes, which really feels like a missed opportunity. I also didn't like that mostly it was Alexa that answered when we spoke to Astro. - Astro show my ring doorbell camera. - [Astro] Okay. - [Jennifer] Astro itself has a very limited range and no voice beyond a small series of bleeps and bloops. When you talk to it, 80% of the time Alexa responds and does just normal Alexa stuff that you can do with a hundred dollars smart display. - [Astro] A few things share the name front door doorbell, which one did you want? - The things Astro does better than Alexa are limited but they do exist. When you set a timer or a reminder, it will come and find you to deliver it to you. And after we taught it to recognize every member of our household, it was somewhat useful in tracking them down, as long as they were on the right floor. But here is where Astro was most useful to me as a smart home camera. Not so much from a security perspective although that's a use case, but really as a second pair of eyes to keep track of my kids, the pets, and the home. If I hear the telltale creek of the kitchen snack cabinet opening before dinner, while I'm on a zoom call in my office, I can just open the Astro smartphone app and send the robot to pier over my daughter's shoulder with its camera that pops out of the top. And that can disrupt her ambition to eat five spoonfuls of Nutella. While I'm waiting in the school car line to drop my daughter off, I can send Astro to the bottom of the stairs and blare its siren at my son who still hasn't got out of bed. If I'm out of the house and my kids are home alone, Astro can go on patrol and alert me if it sees any unfamiliar teenage faces. It will also chase them around which is madly entertaining. If the family is out, I can send Astro to hang out with Gus and play him some music, maybe toss a treat or two. A lot of these things can be done with existing smart home cameras or smart speakers, but because Astro can move, it replaces all of them and means I don't need to have eight different cameras in my home, which is not something I have ever wanted. But there are always those times when you want to check in on something and that one camera you set up just doesn't quite show you what you need to see. Astro makes it easy to see everywhere on one floor without having multiple cameras. But Astro is not the home robot of my rosy the robot dreams. Despite the obvious association, after all Astro is the name of the Jetsons dog, for a start, it doesn't clean your house. Although if it were also a vacuum it would get stuck a lot more often but mainly because it really doesn't do anything beyond being a companion of sorts, and a very good mobile, smart home camera. If either of those features appeals to you, you'll enjoy Astro. But if you are hoping for a robot with actual robot utility, wait until they figure out how to add some arms or legs then Astro would be an entirely different experience. I will say though, despite being somewhat dispensable, when I pack Astro up to ship it back to that Amazon warehouse in the sky, I will feel a tinge of sadness but then I'll remember there are other things I'd rather spend a thousand dollars on. Thanks so much for watching my first video for The Verge. The thing about Astro is it's very much a solution in search of a problem. So I would love to know what you think you might use Astro for in your home. Leave us some ideas in the comments. I'd love to hear them.",
    "transcript_keywords": [
        "Astro",
        "robot dance Astro",
        "dance Astro robot",
        "Astro robot dance",
        "robot",
        "Alexa",
        "robot dance",
        "home",
        "dance Astro",
        "home robot",
        "camera",
        "house",
        "Astro robot",
        "send Astro",
        "dance",
        "smart",
        "smart home",
        "smart home camera",
        "lot",
        "things"
    ],
    "transcript_entity_values": [
        "a thousand dollars",
        "USBC",
        "one",
        "only one meter per second",
        "10 inch",
        "three",
        "Astro",
        "Alexa",
        "eight",
        "Astro",
        "a hundred dollars",
        "Jetsons",
        "Astro",
        "Alexa",
        "Buffy",
        "a thousand bucks",
        "two",
        "the telltale creek",
        "Amazon",
        "Jennifer] Astro",
        "Two",
        "English",
        "thousand dollar",
        "Smokey",
        "Furbo",
        "second",
        "five",
        "5,000",
        "first",
        "four weeks",
        "80%",
        "A month ago",
        "1,450",
        "seven",
        "Jibo",
        "The Verge",
        "Gus",
        "First",
        "Furbo"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "FAC",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LANGUAGE",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "DATE",
        "PERCENT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "ORDINAL",
        "LOC"
    ]
}