{
    "id": "1elmhH_nzwU",
    "title": "3 Cool Tech Deals - #14",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-03-28T23:22:46Z",
    "video_url": "https://www.youtube.com/watch?v=1elmhH_nzwU",
    "category": "Science & Technology",
    "tags": [
        "3 cool tech deals",
        "3 cool",
        "tech deals",
        "tech",
        "deals",
        "dbrand",
        "skins",
        "micro sd",
        "sd",
        "galaxy s7",
        "samsung",
        "apple",
        "iphone",
        "iphone 7",
        "iphone 6s",
        "iphone 6",
        "s7",
        "s6",
        "android",
        "blu",
        "blu studio energy 2",
        "zve",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "review",
        "comparison",
        "plus",
        "case",
        "6s",
        "funny",
        "unboxing",
        "best",
        "smartphone",
        "galaxy",
        "gadgets",
        "apple iphone",
        "android (operating system)",
        "iphone 6s plus",
        "cool tech",
        "galaxy s7 edge",
        "camera",
        "samsung galaxy s7",
        "apple iphone 6s",
        "s7 edge",
        "phone",
        "new",
        "edge",
        "cool",
        "amazon",
        "3 cool tech"
    ],
    "views": 1462589,
    "likes": 28368,
    "comments_count": 1552,
    "description": "dbrand -  128GB Micro SD -  BLU Studio Energy 2 -  Netis WF2116 Wireless N300 -  ZVE Multifunctional iPhone Case -   BLU Studio Energy Video -  ZVE Multifunctional iPhone Case Video -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://dbrand.com",
        "http://amzn.to/20QzWFa",
        "http://amzn.to/1U8I1jS",
        "http://amzn.to/1TTtPiH",
        "http://amzn.to/1U8Icf9",
        "https://youtu.be/VBYDZ6htGwc",
        "https://youtu.be/PQEP-2KGTWc",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Do you think these deals come easy, folks? Jack is working day and night Whats up, guys? Lew here, back with another video and today it's a fresh installment of 3 Cool Tech Deals Today, I'm bringing you the latest and greatest in the world of Tech and Deals combined, like this: BOOM! To kick it off, we've got something from our good friends at dbrand skins. If you don't know what those are, I am not sure where you've been, because they've been here, on the channel before. Today, is a very special day, they are launching a new pattern. You see this in front of me? This is BAMBOO! And because of that, to celebrate, The entire site is 30% off for the next 48 Hours! 30 off for the next 48 And that goes for all skins, all patterns, all devices. So, speaking of devices... ...I have been using the Galaxy S7 from Samsung. \"Oh, look. So pretty.\" And I've got a matte black skin on it. You might wanna pick up some of this bamboo before it all sells out, cause that what happens. You talk about it on Unbox Therapy, and the world runs out of it. Cause the world is right here. On the other side if this lens. YOU are the World! Can we have a cut? Okay! Now into the Amazon Deals Speaking of the Galaxy S7 or S7 Edge, you now have your Micro SD card slot back. I know you guys were clambering for it. So, I am bringing you some Micro SD HEAT! to kick of this episode. 128GB EVO Class 10 Micro SDXC from Samsung. $39.99 Original list price: 97 bucks. There are other sizes available depending on what you need, and depending on what you need to store. If you're a guy like Jack* you can never have enough storage. You guys know why! ;) You guys know why. Samsung card for your Samsung phone. If you've picked up some of these new devices, or any device with a Micro SD card slot. I wish more manufacturers had expendable storage. Apple, I am looking at you! I know it will never happen but I am looking at you. NEXT UP! There is a deal on the BLU Studio Energy 2. $129 instead of $179 Now, If you don't know anything about this phone, It's got a giant 5000mAh battery in it, which could give you up to four days of battery life. Can use this device, also, to charge up other devices. If you choose to. If you wanna be friendly like that. I did a video on this exact device, so if you want some more comprehensive information, Go, watch that video! I will link it in the description. But, essentially, you are looking at a pretty substantial value here. At a 129 bucks. That's 50 bucks off an already cheap price, for a phone of this caliber. NEXT UP! This one is a little bit more. I mean, it's not for everybody, but, I feel like, if this is for you, you probably know it. This little guy here plugs into any USB port on your computer. Could be a Mac, could be a PC. It sort of extends the WiFi capabilities of your device. So, there are many ways to improve WiFi performance, If you've got a weak signal, wherever you are. But, in many cases, you can't go in and really adjust the network setup. You can't replace the router, you can't put an extender on there. I don't know why. I am not here to judge you. But, if you can modify the reception. The WiFi reception of your actual computer, laptop, or otherwise, That might be, that might be just what you need. One of the little guys plugged into a USB port, can substantially improve your WiFi reception. Maybe, you are way up there and the router is all the way in the basement, cause, your dad said so. Well, i don't know But this little guy for 16 bucks should help to improve the preformance of your network. I went through, I've read some of the reviews, this one guy talking about grabbing internet connection from across the street. LAST ONE of the day You have seen this product! The LEGENDARY IPhone lighter case, with multi-function God knows what. You have seen it here on Unbox Therapy. If you haven't seen this video, you have, you have really missed out. It's got a bottle opener, a lighter, It's incredibly rugged, It's got a tripod mount on it. This is like, I need the kitchen sink. Look at this thing. You are opening a beer. And than you are like \"I need to light a cigarette\". I don't smoke, for the record, but I thought It was cool for like survivalists type dudes. Outdoor type guys. Anyway, if you want to see it in action, go, watch the video. This thing is on SALE right now. Anywhere from $17.99 to 19.99 for the IPhone 6 and 6+, 6S and 6S+. WOW! PTEEWF! If you want to show off a little bit or maybe, you just want to get a gift for somebody. This is a cool, little gag gift or whatever. It's like: \"Look, I got you the IPhone case with everything in it, cause that's how much I care about you\". Don't Smoke! But, open a bottle here and there. Rear-facing selfie game! Look how quickly! Look how quickly it gets focus on me! Maybe I am to excited about this, I certainly don't look excited in this frame right here.",
    "transcript_keywords": [
        "Tech Deals Today",
        "Cool Tech Deals",
        "guys",
        "Tech Deals",
        "deals",
        "Micro",
        "Samsung",
        "guy",
        "video",
        "world",
        "Amazon Deals Speaking",
        "devices",
        "device",
        "Unbox Therapy",
        "Deals Today",
        "Tech",
        "today",
        "Cool Tech",
        "WiFi",
        "bucks"
    ],
    "transcript_entity_values": [
        "17.99",
        "Lew",
        "four days",
        "16 bucks",
        "Unbox Therapy",
        "Mac",
        "30%",
        "179",
        "128",
        "today",
        "Micro SDXC",
        "USB",
        "19.99",
        "30",
        "6S",
        "Today",
        "the Galaxy S7",
        "Jack",
        "Apple",
        "5000mAh",
        "One",
        "BLU Studio Energy 2",
        "6S+",
        "IPhone",
        "Micro SD",
        "39.99",
        "129",
        "129 bucks",
        "3 Cool Tech Deals",
        "the next 48",
        "50 bucks",
        "S7 Edge",
        "WOW",
        "Samsung",
        "10",
        "97 bucks",
        "the next 48 Hours",
        "a very special day"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "TIME",
        "DATE"
    ]
}