{
    "id": "1EpN91z1OeI",
    "title": "Reacting to OLD Austin Evans Videos",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-05-08T16:28:56Z",
    "video_url": "https://www.youtube.com/watch?v=1EpN91z1OeI",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "tech",
        "mystery tech",
        "reaction video",
        "technology",
        "sara dietschy",
        "jayztwocents",
        "jonathan morrison",
        "tldtoday",
        "luke lafreniere",
        "gaming pc",
        "scrapyard wars",
        "editing pc",
        "ask me",
        "samsung",
        "galaxy",
        "s9",
        "is it worth it",
        "duncan3303",
        "how to waste",
        "the test drivers",
        "pc gaming",
        "mysterytech",
        "cool tech",
        "ios",
        "iphone",
        "youtube",
        "gaming",
        "smartphone",
        "amd",
        "nvidia",
        "intel",
        "chromebook",
        "old videos",
        "react",
        "gpu",
        "cpu",
        "phone",
        "chrome os",
        "unboxing",
        "budget gaming pc",
        "ken bolido"
    ],
    "views": 207199,
    "likes": 8190,
    "comments_count": 267,
    "description": "Only the OG fans are gonna remember a few of these... Does Austin Evans ACTUALLY Know Phones?  Is It REALLY Time to Ditch Chrome?  This Tech Is Older than You Think:  110 year old DVD!?  Trying the $166 iPhone 11 Pro from Wish:   Links to videos:  1. 2015 Tech! Ask Me #022  2. Jailbreak iPhone 5  3. Craziest Gaming PC Build? Ask Me #028  4. Build a Gaming PC for $350  5. Is a Q&A Worth It?   6. Rebuilding the $50 Gaming PC  7. Build an Editing PC for $800  8. Chrome OS Boot Test  9. How Real is Virtual Reality?  10. Dell XPS 13: The Most Powerful Thin Laptop?  11. The Samsung Galaxy S9 is Here   Subscribe! \r Twitter: \r Instagram:",
    "description_links": [
        "https://youtu.be/Ltq96nc-64M",
        "https://youtu.be/Uo8-ko2cfcs",
        "https://youtu.be/TBAp3YFcWBY",
        "https://youtu.be/fElUqZHWpUw",
        "https://youtu.be/P5aEi6WGxOs",
        "https://youtu.be/IFLdH8tEzF0",
        "https://youtu.be/ueTUIN3QrCE",
        "https://youtu.be/4T9EOdl3smQ",
        "https://youtu.be/S6FD1b-tYkk",
        "https://youtu.be/i4VceH-yvlU",
        "https://youtu.be/iafKB8Gixcw",
        "https://youtu.be/eiml6FxkWHo",
        "https://youtu.be/LESiYQ9oVCI",
        "https://youtu.be/zZiM-8TTkmM",
        "https://youtu.be/BA9Zvx22Ejw",
        "https://youtu.be/194URg0tkSg",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is. Today we're gonna figure out how well Austin Evans knows Austin Evans videos. And I'm gonna guess not well because Austin Evans happens to have the memory of a goldfish. - Look Matt, I'm gonna be completely real with you. There've been many cases in my life where I have been looking up information on a product stumbled on a video that I made on that product and watched it with zero memory of making that video. - So let me explain to you the rules of the game. I have selected a handful of videos completely at random using the help of a bot. I threw your channel name in there, it just gave me a handful of random videos. I'm going to show you roughly five to ten seconds of these videos, and you have to tell me two things in order to get them right. You have to tell me the subject of the video and the year that it was created. - Okay, thanks for not trying to make me remember the title. - No, you do not have to remember the title. However, if you get the majority of them wrong, what you have to do is take a big old bite of this guy. - I don't do that. - This is the world's hottest chip. You don't have to eat the whole thing, you just have to take a bite. - I don't like anything that I'm hearing right now. Let's play the game. - Here we go. The first one. - I know I like to joke around sometimes, but I mean, it's definitely not a real thing. I would not know of any hypothetical organization called the Illuminati. And even if I did, I mean, to imply that I would be a part of them is just, that's just irresponsible. - So my first question there is, are you actually part of the Illuminati? - No, I remember this. So that was from an Ask Me in 2015. And one of the questions for that video, the context was literally are you part of the Illuminati and I just thought it'd be a dumb joke because if you watch the videos of old Ask Mes, it was full of like gags and like I did like skits and all kinds of stupid stuff. But yeah, that's as far as I know. I definitely don't remember the exact title of this one. - All right. I'm gonna give you the correct you got the correct answer. This is 2015 Tech exclamation point Ask Me. - Oh 230,000 views not bad, not bad. - I do like that your numbering system is three digits. That was pretty ambitious of you to think that there's going to be a like a triple digit amount of Ask Mes. - There were like 30 or 40, it wasn't that far off. - So you are one for one my friend. Well done. - Okay, I like it. Thank you very much. Thank you. Thank you. - All right. (Matt laughs) Next one up. - [Austin] If you use iCloud just hop into Settings and select Back Up Now to make sure everything is safe. I mean I know for almost positive that it's either 2012 or 2013 but on the exact Jailbreak I mean it was an iPhone 5 Jailbreak of some variety. All right, I don't get any like leniency right if I guess like one year, like I have to be dead on. - For the year you have to be dead on, yes. - Okay, I am going to say 2013. I'll just say Jailbreak of some variety probably not all that accurate. - [Matt] So this is Jailbreak iPhone 5. - [Austin] That title is pretty accurate. That's Jailbreak iPhone 5, pretty good. - [Matt] Yeah so I'll give you that one. - I'm actually, I don't get you know sort of cocky here. I am pleasantly surprised that I've gotten two right. I thought I would get two right period but I don't alright so far. - If you go ten for ten we're doing hard mode for the next one. So... - Nope I'm good, I'm good. - All right next one up. - So do you will do? - Yes I do will do, a crazy high-end PC build. And that was the compensator. - Oh! - Not a logical computer. - Oh no (laughs) This is very bad. I don't remember doing this video with Luke. I probably should. I don't remember that. Ah, Oh wait! Wait! Wait! Now I do remember this. Luke and Brandon were in town. This is immediately shot, this is late 2015. This was shot right after I had done Scrapyard Wars, and it just so happened that Luke and Brandon were coming to town, so they crashed at my place for a couple days and I think I looped in Luke in to do an Ask Me. So I'm gonna say 2015 for sure. It's an Ask Me of some variety. - All right, I'm gonna give you... - Yes! - Both. - Yes! Yes! - That's 100 % right. Craziest gamings PC build Ask Me 28 in 2015. - Wow! I'm really happy I got that. When I first saw the video I'm like, I did a video just with me and Luke, but I remember it was right as I had moved out to Pasadena. - Three for three, three for three, next one up. - So basically the way you can think of it is instead of having to spend an extra 100, $200 on a graphics card, you're getting what's basically a $50 graphics card built-in for free. So this is a little bit spottier. I feel pretty good about this being like 2012, 2013 I'm gonna guess probably 2013. Obviously it's a PC build of some variety, although I don't think this is actually a PC tutorial. I think this is more so 'cause I said something along the lines of like, you get like a $50 graphics card built-in for free. And it looks like there's an AMD APU box. So, maybe this is like an early like A10 processor or something. I'm gonna say that this is build your game PC for $500. - 2013, build a gaming PC for 350. - What! Ooh! Oh my God, that was at a million views. - I'm impressed man. I'm impressed. All right, next one up. - I got a surprise. - Surprise? Oh boy, tell me what. - Close your eyes. - Okay. - Don't close your eyes. - Okay. (laughs) - Oh, I think I know what this is. Why you gotta do this to me man. This was the honor 6x slot and this would have been probably 2016 I think. I don't remember the title of this probably isn't like the greatest phone that's ever faced the other face of the planet or something I don't remember. But yeah, it was the honor 6x and it was 2017 final answer. - So this was a trick question. This was from Is a Q&A Worth It? (groans) - I think what I had to do is that video was sponsored. So the fact that I did that thing with John and Sarah. And that was like a sponsor video. And then this was the video I shouted out that video and... - So you got it wrong. - All right, I'll take the L on that one. - You know you're still doing pretty good. One wrong so far you're still doing pretty good. All right. - So last time, Jay and I may or may not have made a little bit of a mistake, but today we're here to redeem ourselves. - What are we gonna do? - So I did two videos with Jay around this time. There was one which we call Junkyard Battles, which was literally just Scrapyard Wars, but our knockoff. And then there was a second video I did with Jay which I seem to remember was like, we tried to fix the PC we had built or we tried to do it better. I think that's that because in the clip I mentioned that this was like me fixing it. So this is 2017. I'm gonna say Junkyard Battles is like what the overall thing was. - You got to the topic right. So this was rebuilding the $50 gaming PC, which was the Junkyard Battles in 2017. - I feel good about that. At least I remember like that was the one because we built that Junkyard Battles PC and then I guess this is a follow-up video. - All right. - Now for a build like this we can absolutely use as much raw power as we can get our hands on. And the 8350 definitely delivers here with an eight core design quoted up to 4.2 gigahertz. Did I just recommend an FX 8350 in the year 2013? Definitely gaming PC build. It's got to be 2013. 'Cause this was I'm in my apartment here. I think about that PC. I feel that built that PC in 2012 or 2013. I would just guess building a gaming PC for like 750 bucks or something. - I'm not gonna give you this one. - Ooh! - Specifically because you said it's definitely a gaming PC. Because no you specifically said editing on this one, so I'm not going to give you that one. - And that's why I recommended the 8350 because you got a lot of cores for not as much money 'cause that was a legit eight core processor. - In 2013, that was a (bleep) load of cores. - I'm actually really proud of how many of these videos I've gotten right, which might not sound like a big deal because obviously I made all these videos But I have like almost 2000 videos I have made. So I forget about these things all the time. The fact that you're showing these is bringing me right back. I'm really happy that I'm able to kind of guess so accurately. - No, you've been, I think you've been 100% on every one of the year. Let's go on to the next one. - So as you can see that was not too bad. Definitely not instant, but certainly not half bad. - Yeah, Sierra 48. So that's definitely the very first Chromebook ever. I just got selected for the developer program, which is why I had this. You know what I'm gonna actually say it was I'm gonna say Chrome Sierra 48 or Google Sierra 48 review in 2011. - That's incorrect. - Ooh! No! - You got the year right, but this was specifically a video, the Chrome OS Boot Test. - Ah! - I would like to point out a couple things on this video. You said, \"Hey guys, it's Sam.\" - What? I did? - Yeah, you you introduce yourself as Sam. - [Austin] Hey guys, it's Sam here with a little bit of a speed test on Google Chrome OS. I don't remember that. Oh, wait! I do remember this. I do remember this. In fact, if I remember correctly, it was actually No One Man who is still active in the Twitch chat. Who like dared me or told me like, hey you should introduce yourself as your dog in your next video. So I just said, \" Hey guys, it's Sam,\" without acknowledging. - I just thought you were going around saying, you know \" Hey, it's Sam Duncan.\" All right, we're cutting it close here man with a you might have to eat a chip. - I feel confident. We got this I got this. (car engine roaring) - Hey, what do you need me to do? - Yeah, haha! Whoo! We're flying man (laughs). This is a very special video. So this is when actually two videos like this, this was definitely the first one. This is a collaboration with Castrol EDGE. And essentially the concept of the video was I was just there to make a video on it. But they had enlisted a crazy idea where they had built a course, this was like I think like I'm in an airstrip down like Orange County or something. They built it where they essentially you would be driving the Mustang. And you would actually have a VR headset on and you'd be seeing the game. So like all the inputs would be mapped to the game. So essentially, as you're turning the car in real life is being like mapped into the VR world. This was probably 2014. I think this was before I had moved to California. - [Matt] It was 2015 though I got the thumbnail. - [Austin] I got the thumbnail. I got the thumbnail Matt, come on surely that outweighs the fact that I was off by a year. - So that wasn't part of the rule. - What's my score right now Matt? Am I about to be underwater by chance? - If you get the next two wrong, you are in trouble. - Okay sweet. Having that Thunderbolt 3 port is nice. It's not just a double as a USB-C port, but you can also do stuff like connect a 4K monitor to it except power-in. And in theory you could connect it to an external GPU for better gaming performance. Okay, let me think about this. So on the old set the Window set, which was 2016 the real Window. It was 2016 and 2017. I think this is the... we used all the way through 17. And that looks like a little bit later 'cause I've seen the Everybody album in the back. This was definitely like the more evolved version of set so I'm gonna definitely say 2017. I think you might have me on this one just 'cause I don't know what laptop it is. I'm certainly doing a video on some laptop I'm explaining why Thunderbolt 3 is great, which 2017 that was a pretty cool feature. If I'm going to take a guess I'm going to say a MacBook. But yeah, I think we're going to take the L on this one. I know it's 2017 I don't know what I was talking about the video. - [Matt] It is the Dell XPS 13. - [Austin] Ken that's your fault. Ken made me buy the stupid XPS 'cause he's like, oh, everyone likes XPS's so I spent been like $1,000 on this laptop. - I'm pretty sure you've had every version of the XPS since then. So... - First time, this was the first time. - Yeah, well you should thank Ken then for getting you hooked on that because you've had you've gotten a lot of them. It does come down to this. Let me... This the only video that I've been around for. So I'm gonna give you a hint there. - Amazingly enough, something else that carries over is the headphone jack. Yes my friend, you heard correctly. Oh no! Something carries over is the headphone jack. Hold on let me see what this is. Something carries over is the headphone jack. So then that puts this at what mid 2018 or later? What phones surprisingly had a headphone jack? Galaxy S9? I think it's OnePlus my guts telling me go OnePlus. I'm going to say the OnePlus 6T 2018 final answer. - [Matt] Your deductive reasoning skills are always really impressive, however, this answer... - No! No! No! No! Not you liar! You are a liar! You're not here for this. - Wait, you're right, you're right. - You lied to me which means that I by default win because you gave me incorrect information. - I wasn't there for the the OnePlus video either. - But you weren't here for this one. And you told me you were. I'm gonna say that I don't have eat the chip now. - You will eat that chip. - I can just hit, I can just turn off the camera now and that's the end. Thank you very much for watching. I'm ending this video now I'm gonna stand up and I'm gonna walk away. I wiil eat this chip when Matt cheats next time, but this time I'm gonna claim victory. Thank you very much for watching.",
    "transcript_keywords": [
        "Austin Evans videos",
        "Austin Evans",
        "video",
        "remember",
        "videos",
        "Evans videos",
        "Junkyard Battles",
        "Austin",
        "Evans",
        "pretty",
        "yeah",
        "Jailbreak",
        "Hey",
        "Sam",
        "good",
        "build",
        "Luke",
        "year",
        "guess",
        "time"
    ],
    "transcript_entity_values": [
        "zero",
        "iCloud",
        "Twitch",
        "2013",
        "28",
        "6x",
        "Mustang",
        "Sam",
        "Mes",
        "three",
        "FX",
        "Illuminati",
        "Three",
        "Jay",
        "4.2 gigahertz",
        "a couple days",
        "jack",
        "1,000",
        "One",
        "Chrome",
        "100 %",
        "a million",
        "500",
        "mid 2018",
        "OnePlus",
        "2015",
        "Google Sierra",
        "Jailbreak iPhone 5",
        "230,000",
        "the next one",
        "GPU",
        "Chromebook",
        "Chrome Sierra",
        "John",
        "8350",
        "Austin] Ken",
        "2017",
        "100, $200",
        "Matt",
        "Austin",
        "Castrol EDGE",
        "Orange County",
        "2014",
        "MacBook",
        "2011",
        "the year 2013",
        "first",
        "350",
        "2012",
        "Today",
        "Dell",
        "Luke",
        "30",
        "Sarah",
        "California",
        "roughly five",
        "50",
        "2016",
        "100%",
        "OnePlus 6",
        "AMD APU",
        "4",
        "750 bucks",
        "XPS",
        "second",
        "2018",
        "Sierra",
        "the year",
        "Google Chrome",
        "ten",
        "First",
        "an extra",
        "Austin Evans",
        "one",
        "late 2015",
        "today",
        "XPS 13",
        "48",
        "eight",
        "17",
        "a year",
        "3",
        "half",
        "A10",
        "two",
        "Sam Duncan",
        "Galaxy S9",
        "Pasadena",
        "40",
        "Ken",
        "Brandon"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "FAC",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON"
    ]
}