{
    "id": "1F9TOJ951xo",
    "title": "Can you Safari in a Wheelchair?! - Motorized Chair Mod!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-02-11T18:33:13Z",
    "video_url": "https://www.youtube.com/watch?v=1F9TOJ951xo",
    "category": "Travel & Events",
    "tags": [
        "wheelchair accessible",
        "off road wheelchair",
        "electric wheelchair",
        "wheel chair",
        "diy wheelchair",
        "Africa safari",
        "animals",
        "cambry",
        "jerryrigeverything",
        "african safari animals",
        "off road wheelchair with tracks",
        "handicap off road wheelchair",
        "elephants",
        "monkeys"
    ],
    "views": 827821,
    "likes": 25196,
    "comments_count": 1621,
    "description": "Today we find out if Cambry's chair can go on a Safari! Check out the Bill and Melinda Gates Annual Letter here!:  And thanks to Bill and Melinda for sponsoring this video.  We knew we were headed to Africa, so we decided to check out this electric wheelchair mod called the Firefly. Its super expensive, but if it helped Cambry get around on rough roads and dirt trails, it would be totally worth it! Come with us as we check out this strange wheelchair contraption. Spoiler alert... its a bit over priced for what it can accomplish:  But it is really good in specific scenarios.   Check out Dan's video here!   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.inflcr.co/SH1jf",
        "https://amzn.to/2w7nHAg",
        "https://youtu.be/YFwcD-mEYWk",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "This might be the coolest or the dumbest thing I've done. [Zack] This video is sponsored by Bill and Melinda Gates. Every year they release an annual letter discussing global issues. This year they talk about climate change and energy, and some very unique ways we can reach our goal of zero emissions. In today's video, we'll be showing one very creative mode of adaptive transportation that already has no emission. [Cambry] I'm so dizzy! [Zack] So we are currently in Kenya in the middle of Africa, and we have this little adaptive motorized electric wheelchair thing for Cambry's wheelchair. [Cambry] And today we're going to use it while we go on a safari. [Zack] We haven't actually attached this and tested it longer than, you know, just around the field and this hotel. [Cambry] But what better way to test it than out on an African safari! [Zack] Let's hope we didn't bring it all the way down to Africa for nothing. This video is sponsored by Bill and Melinda Gates. We're going to talk about energy a little later on. [Cambry] Let's get started. [Intro] [Zack] So you know Hakuna Matata is an actual phrase that people use here in Africa. I just always thought it was something from the Disney movie. But Hakuna Matata actually means no worries. And now Cambry's back there Hakuna Matata-ing. (Laughing) So this guy is called the Firefly and it's actually rather expensive on Amazon a little over $2,000 I think. But what it does is it raises the front wheels off of the ground right here. And the front wheels, since they're so small, those are what get caught on all these cobble stones, or like little lips. So replacing those smaller wheels with a bigger wheel is going to help, you know, go over uneven terrain. And usually Cambry does like a wheelie to get over those little bumps, but now she doesn't have to work very hard and it's kind of doing all the work for her. But does it justify the price? Still unsure. [Cambry] Alright, you ready? [Zack] Yep [Cambry] That's full speed. [Zack] Burnout! [Cambry] The turning radius on this thing! I should be wearing a helmet! [Zack] Okay, that's actually pretty cool. [Cambry] It is pretty cool. But now we need to tone it down so that the wildlife doesn't get afraid. [Zack] So since we're in one of Kenya's largest national parks, we can't actually leave this electrified fenced-in compound because, you know, that's where the lines are at. But there's still plenty of room inside of here to test out this machine. We see a monkey...there are two monkeys over here. We're going to go sneak up on them. You ready Cambry? You going to try to sneak up on them? [Cambry] This isn't quiet enough! This might be the coolest or the dumbest thing I've done. I'm nervous. [Zack] Oh there's two of them. Monkey approved. [Cambry] I didn't want to like have one bite me and then be 6 hours away from some medical attention. [Zack] Sure. (Laughing) So the Firefly wheelchair accessory has a range of about 15 miles and a top speed of... [Cambry] 12 miles per hour! [Zack] Alright, now we are off of the paved trail, coming through some grass and dirt. [Cambry] This is pretty easy to drive. It's got 5 different gears. Although I haven't really noticed a difference in each one. It says how much battery life you have. This is really nice. There's a little sticker that tells you which little throttle is reverse. This one is acceleration go forward. Brakes on both hands which is nice cuz you might be using one for reverse or one for acceleration. And then a little bell (ding). And then an extra little safety lock. I've found that this machine doesn't really like going up hills. It doesn't have as much traction. [Zack] So the front tire is spinning out a little bit because the tread is kind of weak. But it's still moving on flat ground. One of the big things that makes this possible is the introduction of lithium ion batteries in the last couple of years that can store the same amount of energy as, you know, like a gas tank in a gas powered vehicle, but puts it on the front of a wheelchair very silently, which allows us to go a lot more places. This particular nature reserve or national park probably wouldn't appreciate a gas powered vehicle because it's so noisy. But, you know, we can get away with driving this electric vehicle around kind of wherever we want. These kinds of innovations only happen when people take big risks, or you know, swing for the fences. Bill and Melinda Gates talk about it in this year's annual letter and they make a lot of good points. Two of which I think are pretty interesting. One is using the energy from molten salt, you know, as kind of like a battery storage, but thermal energy. And the other is using underground pressurized wells that can store the pressure underground and use it to spin turbines or something else as also a large underground battery. The ideas might sound outlandish at first, but only by taking big risks can big innovation happen. And it's definitely time for some big innovation when it comes to energy storage and renewable energy. The Bill and Melinda Gates letter is worth a read. They explain it a lot better than I do, so I'll leave the link for the Bill and Melinda Gates annual letter down in the video description. Alright, so we found an obstacle that the chair can't get over. Cambry, explain what's going on. Are you stuck? So if Cambry didn't have the added weight of the motor batteries and front wheel, she could have gotten up that hill just fine in her normal chair. Oh wow. And wet, slick rock. So there are some definite advantages to having the front motor, but there's also advantages to not having it. [Cambry] It's pretty good in different terrains, but like this terrain is not doable. And I don't feel like you can really be independent. You need someone with you so that you're not getting stuck. [Zack] But if we had the off-road wheelchair here with us...the two bikes that we built...that would have handled the hump just fine. So we've added this, which always stays on the wheelchair. Just two bolts on either side and these mounting racks. Then I can take this portion, latch it into the back, lift up on the chair and then clamp on the first one. And when it clamps on the top one, it holds everything secure. So she can motor off into the sunset. Just try not to end up in the pool. [Cambry] Whoa! [Zack] (Laughing) You really almost did it! [Cambry] Not on purpose Zack! [Zack] Ooo, wow. [Cambry] One wheel. [Zack] Almost. Alright Cambry, pros and cons. [Cambry] Cons are you can't go up slick surfaces. You can't really go up hill very well either. It's a little tricky getting in and out of it if someone's not there to like lock it one for you. It's tricky to do yourself. So those are my cons. Pros are: the turning radius is amazing. And then I think it's also a great tool if you are like going to a museum or an amusement park. Somewhere where the terrain is not too difficult and you don't want to wear out your shoulders by pushing the whole time. And it's nice that you can push your wheels for most of the time if your front wheel gets stuck, you can get yourself out of it, but not all the time. [Zack] Right. Flat concrete with like the texture on top surfaces...I feel like that's what this was made for. Cons for me: I feel like all the power is on the front and that's not where the weight is. If you look at Cambry's chair, all the weight is going straight down over the axles. And so we would have to move the motor to where the weight is to get the most effect. But moving the wheel to the back would add a lot more complexity with the turning and the steering. A pro for me though is actually traveling with it. The first airport that we were flying out of did give us a little bit of grief about the battery size. But it turns out that it fits an adaptive accessory. You can go up to 300 watts. And this particular battery I think is like 270...260...so it can fly as a wheelchair accessory in a checked bag, otherwise we would have to put the battery inside of a carry-on. [Cambry] But it is a wheelchair accessory. [Zack] So it works out pretty well. [Cambry] Are these donuts?! I'm so dizzy! Sorry! [Zack] Now hopefully it's time to get up close and personal with some real animals. [Cambry] You might have seen the What's Inside Family with us. They are on the safari as well. [Zack] They are with us because Dan and Claire are the ones who kind of started this whole movement towards funding the school with Coins for Kenya. [Cambry] Let's see the animals! [Zack] OK! [Music] [Dan] What are you filming in there? [Zack] Look who it is! So right now we're inside of a van with an enormous hole cut out the top. And the top just lifts up into this sun shade. But we can also stand inside of the van and look out. Works out pretty well. [Music] [Zack] Cambry, what are you on the lookout for? [Cambry] I really want to see elephants closer. We saw them in the distance earlier and I'd love them closer. [Music] [Zack] That is it. A successful ride. What was your favorite part? [Cambry] The elephants. [Zack] Yeah. By far. Those things were awesome. Anyway, we will have a link up here for Dan's video. He went into a lot more detail about what went on during this trip. But he's better at communicating than we are at the moment. [Dan] I don't know about that! (Laughing) [Zack] But we're working on it! [Dan] That's not true, they did a great job. [Zack] He has a safari hat and everything. He's doing a great job. [Cambry] We were just really excited about it and didn't talk a lot. [Zack] Yeah. [Cambry] Are we doing it? [Zack] Mm-hmm. [Cambry] Thanks a ton for watching. We'll see you around. [Zack] Perfect.",
    "transcript_keywords": [
        "Melinda Gates",
        "Bill and Melinda",
        "Cambry",
        "front",
        "wheelchair",
        "Melinda",
        "Gates",
        "pretty",
        "energy",
        "Bill",
        "Hakuna Matata",
        "Melinda Gates talk",
        "Melinda Gates letter",
        "lot",
        "video",
        "battery",
        "wheel",
        "Melinda Gates annual",
        "kind",
        "inside"
    ],
    "transcript_entity_values": [
        "Firefly",
        "Zack] Cambry",
        "2,000",
        "Kenya",
        "Every year",
        "Zack] Mm-hmm",
        "Zack]",
        "300 watts",
        "Zack] Okay",
        "Cambry",
        "two",
        "12 miles per hour",
        "the last couple of years",
        "Zack] Almost",
        "Africa",
        "Two",
        "Bill",
        "up to",
        "Zack] Perfect",
        "270",
        "Melinda Gates",
        "African",
        "6 hours",
        "Firefly",
        "Zack] Alright",
        "Amazon",
        "zero",
        "This year",
        "about 15 miles",
        "260",
        "year",
        "5",
        "Zack] Ooo",
        "first",
        "Disney",
        "Zack] Sure",
        "today",
        "annual",
        "Dan",
        "Hakuna Matata",
        "Zack",
        "One",
        "one",
        "Claire"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "LOC",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "NORP",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON"
    ]
}