{
    "id": "1fKoBigWEAk",
    "title": "Your Next Monitor Is A Keeper! - AdaptiveSync Explained",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-06-10T17:04:35Z",
    "video_url": "https://www.youtube.com/watch?v=1fKoBigWEAk",
    "category": "Science & Technology",
    "tags": [
        "VESA",
        "Certification",
        "Monitor",
        "Display",
        "Performance",
        "Movie",
        "Film",
        "Frame Rate",
        "Sync",
        "VRR"
    ],
    "views": 426799,
    "likes": 22132,
    "comments_count": 413,
    "description": "Answer your emails faster, in the appropriate tone, and with confidence with Grammarly! Go to  to sign up for a FREE account and get 20% off Premium!   Learn about VESA's new AdaptiveSync standard and how it could make picking a display much simpler.  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://grammarly.com/TechQuickie",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- The scourge of gamers everywhere is screen tearing, or at least it was until tech like G-Sync from Nvidia and FreeSync from AMD came along to save the day. Unlike the old fix, Vsync, these technologies don't sacrifice frame rate, and actually improve responsiveness. But, unfortunately, these variable refresh rate technologies are both still pretty inconsistent in terms of how well they work and are pretty confusing, with both sides offering three different performance tiers for a feature that, really, should be pretty straightforward. To be fair, Nvidia and AMD do keep lists of certified monitors. But if the monitor you're considering isn't on one of those lists, it's a crapshoot as to whether variable refresh rate will even work, leaving you to rely on trial and error or on a secondhand account from some rando online. And you can't trust those guys. (chuckles) So maybe it isn't surprising that VESA has swooped in to try to both clear this whole mess up and also make sure the tech actually works as intended. And if you don't know who VESA are, they're not the credit card people. Thank goodness. It's an industry association that defines display standards for everything from DisplayPort to HDR to those holes that let you wall mount your screens. Love those guys. But how are they gonna fix variable refresh rate? Like many problems in life, they're trying to solve this one by slapping a spiffy logo on displays that actually do play nicely with VRR and, fittingly, the logo will say VESA Adaptive Sync and look a little something like this, with a number indicating the display's maximum refresh rate. But how is this different from the lists of monitors you can already get from AMD and Nvidia? We'll tell you right after we thank Grammarly for sponsoring this video. Whether you're job hunting or just trying to get all your work done before heading out on vacation this summer, Grammarly is here for you. Grammarly is an all-in-one writing tool that helps you with grammar and spelling suggestions that helps professionals save time. Simply install the free desktop app, log in and start typing. There's also Grammarly Premium, which provides more in-depth feedback on your writing. We recommend checking out the tone, transformation and clarity tools. They help you by rewording sentences to make you sound more confident and by removing unnecessary jargon to help you get your point across clearer. Go to grammarly.com/TechQuickie to sign up for a free account and get 20% off Grammarly Premium today. One huge distinction between the VESA program and the lists provided by AMD and Nvidia is that VESA is requiring that displays get sent to an authorized independent testing facility in order to earn the badge. Neither the GPU nor the monitor manufacturers can put the logo on a specific display's box until it passes verification, AKA basic training. And the testing is quite stringent, partly to ensure that it actually does give gamers an Adaptive Sync experience that works as the good Lord intended, but also partly because there are key specifications that monitor manufacturers are notorious for fudging. A big one is pixel response time which affects how much the display will suffer from artifacts like ghosting. VESA's procedures require that monitors are tested at room temperature and default settings, criteria that were chosen precisely because display makers, unfortunately, use high ambient temperatures and aggressive overclocks to achieve a response time figure that doesn't always reflect reality. On top of this, the VESA standard also ensures flicker, jitter and dropped frames are well within limits. In short, the VESA Adaptive Sync badge means the monitor is good and that the actual Adaptive Sync functionality will work within a reasonably wide range of frame rates. Something that isn't always guaranteed on many displays marketed as gaming monitors. (groans) But if you're not into gaming, there's another badge for displays that you should know about. This MediaSync logo means that the screen should show most kinds of video content without tearing, flicker or other artifacts, whether it's 24 fps movie content or the buttery smooth 60 fps video we've gotten used to seeing on social media. This testing procedure is a little more lenient than the one for Adaptive Sync, so it shouldn't be too hard for well-built, mid-range displays to pass. Note, though, that even though an Adaptive Sync badge means the display is also MediaSync certified, I'm sure you'll see some manufacturers slap both logos onto the box to make it look more impressive. It might work with me. Although these programs are very new, there are already a couple of displays from LG that earned the badges at the time we wrote this video. Hopefully, we'll be seeing more in the near future, so our monitor buying lives can be a little easier. But do keep in mind that these VESA tests don't cover brightness, HDR quality or viewing angles. So be sure to read reviews and the rest of the spec sheet for any monitor that you're interested in. You don't wanna end up with a display that runs your games flawlessly until you move your head a little bit to the left and then it's, oh, it looks horrible. That's it for this video, guys. Thanks for watching. Like the video if you like it. Dislike it if you disliked it. I'm cool with both. Check out our other videos, comment below video suggestions and don't forget to subscribe and follow Techquickie because if there's a pipe and the content is coming outta the pipe, then this pipe ain't blocked, I'll tell you that much.",
    "transcript_keywords": [
        "VESA Adaptive Sync",
        "Adaptive Sync",
        "Adaptive Sync badge",
        "VESA",
        "VESA Adaptive",
        "variable refresh rate",
        "Adaptive",
        "Sync",
        "refresh rate",
        "display",
        "Grammarly",
        "Nvidia",
        "monitor",
        "AMD",
        "displays",
        "video",
        "Grammarly Premium",
        "variable refresh",
        "rate",
        "Sync badge"
    ],
    "transcript_entity_values": [
        "24",
        "VRR",
        "the day",
        "Techquickie",
        "Grammarly Premium",
        "Adaptive Sync",
        "three",
        "One",
        "60",
        "one",
        "20%",
        "G-Sync",
        "Grammarly",
        "LG",
        "Adaptive Sync",
        "DisplayPort",
        "AMD",
        "Nvidia",
        "Vsync",
        "AMD",
        "MediaSync",
        "GPU",
        "VESA",
        "FreeSync",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE"
    ]
}