{
    "id": "1Fs4SfVSsLk",
    "title": "How to Make a Battery Protection Circuit (over-discharge protection)",
    "channel": "DIY Perks",
    "channel_id": "UCUQo7nzH1sXVpzL92VesANw",
    "subscriber_count": 4640000,
    "upload_date": "2014-11-05T20:47:09Z",
    "video_url": "https://www.youtube.com/watch?v=1Fs4SfVSsLk",
    "category": "Science & Technology",
    "tags": [
        "battery",
        "protected",
        "circuit",
        "lipo",
        "life",
        "lipo protector",
        "lithium",
        "li-ion",
        "cut off",
        "low",
        "voltage",
        "alarm",
        "display",
        "relay",
        "3v",
        "80%",
        "rc",
        "model",
        "protection",
        "cutoff",
        "protected battery pack",
        "safety",
        "diy",
        "homemade",
        "projects",
        "buzzer",
        "beeper",
        "over discharge",
        "discharge",
        "balance",
        "2s",
        "3s",
        "4s",
        "5s"
    ],
    "views": 550597,
    "likes": 8785,
    "comments_count": 451,
    "description": "In this video I will show you how to build a simple lithium battery protection circuit, so you can power your homemade projects without ever worrying about over discharging your battery.   Circuit diagrams:    How to use lithium batteries safely:   More info on battery measurements:    Parts links:  Disclosure: These are affiliate links. If you click them and make a purchase from the various merchants they link to, DIY Perks may earn a commission. Affiliate programs and affiliations include, but are not limited to the eBay Partner Network and Amazon Associates.  Alarm circuit:   Relay: DSP1a-L2-DC5V    (select one of the distributors - price is around $5)  OFFICIAL LINKS:  Support me on Patreon:   Official Website:   Discord:   Forums:   Twitter:    Music by Kevin McLeod and Lhstana David",
    "description_links": [
        "https://www.dropbox.com/s/5e0otr2dg7uf14x/DIYPerks%20Battery%20Protection%20Circuit.zip?dl=0",
        "http://www.maxamps.com/lipo-care.php",
        "https://www.youtube.com/watch?v=cxkVxi9P0EA",
        "http://www.ebay.com/sch/i.html?_from=R40",
        "http://www.google.com/search?q=dsp1a-l2-dc5v",
        "https://www.patreon.com/DIYPerks/",
        "https://www.diyperks.com/",
        "https://diyperks.com/discord-server/",
        "https://diyperks.com/community/",
        "https://twitter.com/DIYPerks"
    ],
    "transcript": "Powering homemade projects with rechargeable batteries is actually more difficult than it sounds. This is because most battery types cannot be over-discharged, as doing so may damage the battery and make it unstable. Consumer electronics overcome this issue by using clever battery protection circuitry that constantly monitors the battery's voltage, automatically switching the device off if it gets too low. Unfortunately these protection circuits are not readily available separately, so in this video I'm going to show you how to construct one yourself, allowing you to make your own protected battery pack to use in your own projects. To make the circuit you'll need the following items. The finished circuit is compatible with most lithium based batteries, which is a very common battery type used in devices from smartphones to radio controlled models. I'll be using a 3 cell 8000mah battery pack for this project. It cost only $42 from Hobby King, so it's a lot of power for the money. It's intended for use with RC models, which means it has an extremely high current capability, making it ideal for use with high power projects like my 100w LED light panel. One thing to keep in mind is that lithium batteries are usually wired in series to increase their voltage. Each battery is referred to as a cell, usually having a nominal voltage of 3.7v. As mine has got 3 cells, and each cell has a voltage of 3.7v, the total pack voltage is 11.1v. Lithium batteries like this usually have balance connectors. They're basically little wires going to the positive end of each cell, and are required for this build. If you want to learn more about battery packs and how to calculate how long they'll power your project for, Afrotechmods has an excellent video on the subject, a link to which is in the description. To keep the project simple we're going to use a battery voltage alarm as the circuit's base. This alarm beeps loudly when the battery drops below a value you select, so we're going to repurpose this action to trigger a latching relay, which when triggered will disconnect the load from the battery. Before we begin it's important to note that lithium batteries if abused can be dangerous and even catch fire in some circumstances. You must always use a proper charger and set it up correctly for your battery pack, and exercise extreme caution against short circuits, using a multimeter to check everything before you hook it up to a battery. I've put a link in the description to an article all about how to care for these batteries correctly, so I highly suggest giving it a read if you're new to them. So, with that out of the way, let's begin! The circuit has two options. One is the simple option, which just includes the cutoff circuitry, while the other adds an on-off button, which is ideal for self contained packs but makes things more complicated. Many of you will be fine working of this diagram, which you can also find in the description, but for those of you who are less confident I'll walk you through it step by step. So the first thing to do is prepare the battery alarm by removing the two buzzers. To do this without any desoldering tools, grab the buzzer and touch your soldering iron to each of its contact points whilst pulling the buzzer away from the circuit board. You'll need to alternate between each contact point until it comes free. Now it's time to solder some wires to these contact points. As the buzzers were wired up in series, we need to use these two contact points. So solder on a black wire to the negative pad, and a red wire to the positive pad. Next trim down your breadboard to measure 13 holes wide by 28 holes long, with the traces running the longer length of the board. Now you can bend the pins on the alarm downwards using a pair of pliers and insert it into the breadboard. Make sure that its far left pin is in the third hole from the bottom and the fourth hole from the left, and solder it in place. Now we need to break nine pins off our PCB header strip and solder it inline with the alarm but on the bottom row of holes. Because the alarm beeps when it's first plugged in, we need to add a push button to act as an on trigger. This pin on the left is the negative pin of the alarm, so we'll push the momentary push button in line with this pin above the alarm. We can now flip the board over and use a knife to break the copper strip between the button's pins, and then solder it in place. Now it's time to add the latching relay. This particular relay has six pins. Two are the switched contacts, and the others are coils. If either of these coils is given brief power, it will switch the relay either on, or off, depending on the polarity. As we want the push button to turn the relay on, we need place the relay on the board above the alarm, with the second set of coil contacts in line with the push button. When the button is pressed, a circuit will be made with the second cell, sending a current to the coil and switching the relay on. So we'll again scratch the copper off between these pins, extending the cut right to the edge of the board, and solder it in place. To complete the circuit we need to bridge to the third pin of the alarm, which is the positive contact of the battery's second cell. As the relay is rated at 5v, but the second cell is 7.4v, I used a diode to drop the voltage down slightly. You can also use a 10 ohm resistor, or even just a wire bridge if you want, as it should still be able to handle it for brief periods. We can also cut through the four copper strips below the switched contacts, but we won't solder them quite yet. Now we can wire up the alarm to the other coil, so trim down the wires we added earlier and poke them through the board, with the positive wire going next to the upper coil pin, and the negative wire going next to the lower coil pin. We can now bridge the wire contacts to the adjacent coil contacts. To smooth out the alarm's voltage pulse, we need to add a 100uf capacitor. It just goes parallel to the coil, with the polarity matching the wires we just added. So now we can give it a go. So if we plug the battery's balance connector into our circuit, we should hear a little click as the relay switches 'off', assuming that it was on to begin with. This is because the alarm beeps when it is first given power, and we've configured the beep pulse to trigger the relay off. So to switch the relay on, we can press the push button. Again, we can hear a little click as it switches on. So with the basic circuit complete, we can now solder a power wire to each side of the relay's switched contacts. One of these wires connects directly to the battery's negative terminal, and the other can continue on to the device that needs the power. The battery's positive wire can just be connected directly to the device without anything in between. So we'll plug in the battery's balance lead, and press the push button to trigger the relay on. The alarm has been set to trigger at 3.7v, and sure enough, as soon as the alarm detects that one of the cells has dropped below this value, it trips the relay and the battery successfully disconnects from the load. For general use you should set the voltage cut off to 3.5v, at which point you can simply disconnect the battery and recharge it. So this is a really practical circuit that will protect lithium based batteries from being over-discharged. But what if you want to take it to the next step by adding a switch to turn it on and off, rather than having to unplug the battery? Well, to do this we need to add a six pole latching changeover switch between the balance connector and our circuit. The idea is that when in the off position, it disconnects all of the balance leads from the circuit, and also triggers the relay off so that the battery is also disconnected from its load. So to add a switch for this we need these extra components, the most important of which is the six pole latching changeover switch. A six pole latching changeover switch basically has six completely separate on-on switches inside it. Each switch has three sets of pins. When it's turned on, the middle pin of each set is connected to the pin just behind it. When it's turned off, the middle pin gets connected to the pin just in front of it. The first thing we'll do is break off five pcb pins and solder some coloured wires to them, preferably matching those of your battery's balance lead. Why five pins? Well, as we've only got six poles, or switches, to work with, it means we have to limit the switch to work with four cell batteries or less. You can always use a nine-pole changeover switch if you need to use it with a higher cell count battery. To keep it neat we can use some heatshrink to cover the joints. Now we can solder the other ends of these wires to the middle pin of each pole on the latching changeover switch. Now we can get the pcb socket and solder five coloured wires to it, taking extra care to use the same wire colours in the same order as the previously made connector, with the black ground wire on the outer edge. Just like with the previous connector, we can we can wrap some electrical tape or heatshrink around the joints to protect against shorts. The leads of this new connector can then be soldered to the latching changeover switch. They need to be wired up to the rear pin of each pole, so that when the switch is on they are connected to the wires of the previous connector. We need to match the colours too. So the finished switch should look like this, and when connected to the alarm and balance lead, it should turn the circuit on and off. However, once the relay is on, turning the switch off doesn't turn the relay off, meaning that the battery is left connected. What we need to do is get the switch, when turned off, to trigger the relay also off. We'll do this by reversing the voltage applied to the second coil. To do this, all we need to do is solder a new wire to the circuit's ground output. This is the one that goes to the device that needs the power, rather than the one that goes to the battery. This new wire can then be soldered to the middle pin of the last remaining pole on the switch. Another wire of the same colour can then be soldered to the first pin of the same pole, so that when the switch is off it is connected to the other wire. Here you can see that I've actually soldered it to the top pin of the switch - this is because these pins just go straight through, so it doesn't actually matter which you solder them to. The other end of this wire can then be soldered to the circuit, above the relay and in line with the second coil. Now we have one last wire to add. This wire needs to be inserted between the push button and the relay's second coil. The other end of this wire needs to be connected to the last cell of the battery to trigger the relay off. As I'll be using a 3 cell battery, that means I'll have to connect it to the balance lead's fourth wire, which in my case is red. If you're using a 4 cell battery, it would have to be connected to the balance lead's fifth wire. Again, I'm going to connect it to the upper pin as it's getting a bit cramped on the other side. Remember, it needs to be connected to the pole's front pin, so that it only carries current when the switch is turned off. To avoid overloading the coil, we can use an 82 ohm resistor to drop the voltage, which is around 12v for a 3 cell battery, to 5v which the coil is rated for. So now the circuit is complete! Let's give it a test. We'll turn on the circuit with the multi pole switch, and then trigger the relay with the push button. When the voltage drops below the set value, the battery disconnects just as before. But now if you want to turn it off beforehand without unplugging the battery, it's just a case of turning the circuit off, which also now disconnects the battery. So the last step is to build it into a custom hardcase to protect everything. I used 6mm MDF to make mine, and as you can see, I've also added an additional balance lead and power connector, so that it can be charged easily. These are basically extensions of the original connectors on the battery, before any circuitry. Now you can safely power your projects without worrying about damaging your batteries. If you've found this video particularly helpful, I've actually set up a PayPal donation account if you feel inclined send a tip my way. All donations go straight back in to buying the resources needed to make more videos like this one, and are warmly appreciated. So, thanks for watching, and I hope I see you in my next video where I'll be showing you how to build a solder fume extractor to help keep you safe when soldering. Bye for now!",
    "transcript_keywords": [
        "battery",
        "wire",
        "relay",
        "pin",
        "switch",
        "circuit",
        "alarm",
        "solder",
        "cell",
        "wires",
        "pins",
        "coil",
        "voltage",
        "push button",
        "cell battery",
        "button",
        "changeover switch",
        "battery balance",
        "balance",
        "latching changeover switch"
    ],
    "transcript_entity_values": [
        "first",
        "six",
        "12v",
        "three",
        "6mm",
        "Hobby King",
        "third",
        "five",
        "PayPal",
        "One",
        "Afrotechmods",
        "two",
        "four",
        "11.1v",
        "4",
        "nine",
        "second",
        "3",
        "8000mah",
        "PCB",
        "3.7v",
        "5v",
        "only $42",
        "one",
        "3.5v",
        "13",
        "RC",
        "100w",
        "82",
        "Two",
        "100uf",
        "fifth",
        "28",
        "fourth",
        "pcb",
        "10"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL"
    ]
}