{
    "id": "1g3eurcG0Fc",
    "title": "OnePlus 8T Unboxing and First Impressions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-10-18T13:16:46Z",
    "video_url": "https://www.youtube.com/watch?v=1g3eurcG0Fc",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 212659,
    "likes": 8948,
    "comments_count": 792,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- It's phone season, and it is time to unbox the media kit for the OnePlus 8T. I was so excited. I love unboxing OnePlus phones and I especially love their media kits, cause there's always like a really fun experience. Ultra stops at nothing. The most exciting thing about this is, I don't know what's inside of here. I haven't seen a media guide, I haven't seen a review kit. So you guys are witnessing me learning about this device for the first time ever. Me learning how to open a box for the first time ever. I think it goes like this. Whoa! And here it is. The reviewer's guide. All of the information that we need to know is in here. It's like a children's story book, for the past seven years, OnePlus has focused on delivering the best smartphone experience possible for our users. 120 Hertz Fluid Display, Warp Charge 65, performance, quad camera, system design, OxygenOS 11. Okay. This is the table of contents. 128 gigs, 256 gigs of storage. Oh yeah buddy. Snapdragon 865. We've got 5G, there's a new ultra wide camera. 123 degree field of view. 120 Hertz fluid AMOLED, Corning Gorilla Glass. Let's open it. Okay. This case, what the heck. Look how freaking cool this is. Super cool, I love this. This is called the quantum bumper case. Cyborg cyan. Let's get you out of here. Let's see what the fuss is all about. Ooh my gosh! (suspense music) I cannot be trusted. I'm thinking about a lot of things right now. When you think about it, I mean, this has been shipped to me. It's probably been all around the world. It has probably received a few more bumps than that but it's still the packaging. Let's open this up. (upbeat music) Oh yeah, yeah, yeah. lets see what's in here first. They do such a great job with all their packaging and look at all these stickers. They give you so many little stickers. So cute. You know what I'm gonna do, I'm just gonna wear this as a gentle reminder to myself. (upbeat music) Oh, is this color, look how pretty. Wow. What's this color called? This is the lunar silver. So smooth. It's also got the built in screen protector as well which is very nice. I've got our cable, I've got our Warp Charge 65, beefy boy or girl. I'm gonna set this up. Read a little bit more about the cameras and then we'll go outside and take some videos and photos. So this has a new 120 Hertz fluid display with the new flexible flow scape display. It's got a Qualcomm Snapdragon, eight 65 processor, 5G up to 128 gigs of Ram and up to 256 gigs of storage. This has the widest ultra wide camera ever and 123 degrees. Hi Matthew, you wanna sit on my lap? You wanna learn together? Hold on a second. I need to read this to you. We gotta learn something very quickly. We can do 4K, 30 and 60 and 1080 at 3060. You can do super slow-mo 720 and 480, 1080 at 240. Isn't that exciting? Hey, listen up. Be excited. Now we're gonna do 4K 30. We also do 1083. It's pretty exciting, you know. We've got optical image stabilization. The ultra wide has a field of view, 123 degrees. Can you believe that? You wanna see the cases? look, check this out. This one looks really cool. Very excited about this one. Look at that. Isn't that nice? Look at that. So are you gonna sit here the whole time, or am I gonna get a little bit of, a little bit of space? Okay. That has answered the question. Hey, wanna take a selfie? Let's take a selfie. Okay. Here we go. Okay. Well now I need you and you're... (upbeat music) Do you want down or like what's going on? All right. Now that I have some space, let's take some selfies. (upbeat music) It's so crazy coming from a display that's not 120 Hertz and then when you actually do get to 120 Hertz display, it's just the smoothness, the quick, that's so snappy. Ultra wide is so wide. My yard looks like a football field. I'm gonna really close to Matty and see what he looks like in the wide angle. What's wrong buddy? I think he's having tummy tickles. (upbeat music) Let's see if we can turn on, macro, let's get a super macro of this Apple watch band. Whoa. (upbeat music) That's so crazy. Look at Matty. We're now shooting our first video of a wild Matty boy in the wild. Hey, why do you look so sad? Everything's gonna be okay. Okay. So my neighbors are playing who let the dogs out. Can you hear that? Can you guys hear that? Here's the wide angle video. He looks a little overexposed. There we go. That looks perfect. Hey Matty, do you wanna go to the mall later? Too bad there's a pandemic. I know how much you wanted to go to the mall. We're now shooting front facing video on the new OnePlus 8T, This looks really good. I feel like sometimes when I'm doing front facing videos, I don't know like either the exposure isn't right, but this looks good. Skin tone's, look nice. The dog is still looking at me wondering what I'm doing. I mean, he's wonders what I'm doing but I also wonder all day, like what is he doing? This is 4K 30 here's wide angle of Matty. Hi buddy. And there's a little zoom in on your little cute face. And there's a real big zoom in on your face. Let's go back to wide and then we'll do a little selfie version of myself. Hello? Well, I guess it's kind of a selfie although it's the back facing camera, not the selfie camera. Are you eating a stick? You are. This is gonna be 4K, 30 21, 9 widescreen ultra HD cinema quality, feature film. Wow here, we have spotted, we have spotted a wild poodle Poochon Chihuahua mix. And we know that because we've got his DNA test. Hey Matty, let's talk about it. Where did you come from? Where did you come from? Where did you go? How do you like this cinema quality? What are you eating? Let's zoom in and see if we can see it. Oh, it's a stick. The dog is eating a wild piece of stick. Oh, we got to hop into some slow-mo. (suspense music) Now we've got some video. Let's take a few photos. Tyler, would you mind taking a few photographs? (upbeat music) Oh! Whoa! Did we just pop into like a professional photo studio? I mean my shirt's wrinkled, but wow, these look really good. It seems like it's doing a little lighting effects around the face. I'm super impressed with these photos. Well, thank you guys so much for watching. I hope you guys enjoyed this first look at the new OnePlus 8T. I am such a huge fan of everything that OnePlus does, and they really do make a quality phone. So hope you guys enjoyed this. Let me know if you guys have any other questions and I will answer those either on Twitter or on Instagram or here in the YouTube comments. I'll see you next time. Bye. I love this case. Like this is so, just look at it, just take a more and more look. It's cool. Okay. You're done looking now. (upbeat music)",
    "transcript_keywords": [
        "wide",
        "Hertz Fluid Display",
        "Matty",
        "Hertz Fluid",
        "Hertz",
        "ultra wide",
        "time",
        "Ultra",
        "OnePlus",
        "guys",
        "phone season",
        "Display",
        "ultra wide camera",
        "camera",
        "Hey Matty",
        "Hey",
        "selfie",
        "Warp Charge",
        "Hertz fluid AMOLED",
        "media"
    ],
    "transcript_entity_values": [
        "480",
        "all day",
        "Matty",
        "second",
        "Corning Gorilla Glass",
        "Snapdragon 865",
        "Apple",
        "Poochon Chihuahua",
        "30",
        "OnePlus",
        "256",
        "Warp Charge",
        "Hertz Fluid Display",
        "65",
        "123 degree",
        "4",
        "Instagram",
        "OnePlus 8",
        "240",
        "1083",
        "Twitter",
        "5",
        "YouTube",
        "30 21",
        "123 degrees",
        "9",
        "Matthew",
        "AMOLED",
        "OnePlus",
        "1080",
        "Hertz",
        "eight 65",
        "128",
        "60",
        "Tyler",
        "11",
        "3060",
        "first",
        "Qualcomm",
        "Ram",
        "120",
        "the past seven years"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE"
    ]
}