{
    "id": "1K9ByWPqYtc",
    "title": "The Handheld GAMING PC - GPD Win Max",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-05-27T14:48:16Z",
    "video_url": "https://www.youtube.com/watch?v=1K9ByWPqYtc",
    "category": "Science & Technology",
    "tags": [
        "PC",
        "Gaming",
        "Windows 10",
        "GPD",
        "Win Max",
        "Handheld",
        "Netbook",
        "Controller",
        "Intel 10th Gen",
        "Iris Pro",
        "Super Meat Boy",
        "Disassembly",
        "Indiegogo",
        "prototype",
        "touchscreen",
        "unboxing",
        "first impression"
    ],
    "views": 1085338,
    "likes": 37327,
    "comments_count": 3077,
    "description": "GPD releases their new laptop with a better keyboard, but it sure is a thick boy! Would you pick this up to play games on the go?  Check out the GPD WIN Max on their Indiegogo page at   Buy the GPD WIN 2 Handheld Gaming at   Buy the XBOX Elite Wireless Controller at   Buy the Apple Airpods Pro at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/pjcIR",
        "https://geni.us/b3xzyY2",
        "https://geni.us/YuHFoRx",
        "https://geni.us/mvbGA5",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I got an early one! It's here! The WIN Max promises to be both the latest and greatest from GPD, makers of incredible mini laptops. Why do I have my AirPods in? (AirPods clattering) Now, I have gone out of my way to expose myself to as little information about this thing, even product shots, so that my unboxing can be as raw as it can be. I'm really excited about this one. It's gonna be a lot of fun. They have really stepped up their packaging game. (shudders in awe) Here's what I know so far. It's got a Core i5, 1035G7 processor. Oh, it's a thick boy. Oh my goodness, look at these vents on the bottom. Okay, no, no, I'll finish the unboxing, I promise I'll finish the unboxing. So that's a 10 nanometer processor with four cores and eight threads, it's got 16 gigs of LPDDR4 memory, an nVME SSDE, a 1280 by 800 display, (box clattering) integrated controllers, and they claim it's got enough chutzpah for triple-A gaming. That is an impressively small dongle. So this is the wallwort for charging it, and then we've got a USB type-C cable in here. Type-C to type-C. That is a 65 watt charger, wow. That is really small. Boy, it really is kind of thick. One comment before I talk too much about the build quality, is that this is apparently not a final unit, so there will still be some tweaks. Feels pretty good. I will say, I think they went a little bit thin on the plastic for this grill down here. You can see there's a fair bit of give, but I also don't really have an alternative because, apparently, the cooling of this thing was a real challenge. So you can see these fans are basically completely exposed to open air, and then we've got, oh yeah, look at that, gigantic cooler all the way across the back. What else we got here in terms of I/O? Along the right hand side, we've got gigabit ethernet and a micro SD slot. On the front, we've got a headphone jack, and then just a little microphone port. Over on this side, we've got, ah, good, the classic GPD toggle switch between game pad mode for the controller that's built into it, and then mouse mode, so you can actually use it as a mouse pointer. They really have made a big deal out of the quality of the switches that they're using in these buttons. They feel good. Interesting, they've got kind of a really neat shape the them. So you can see, like a game controller, the R2 is actually significantly lower than R1, and it kind of flares out a little bit. I/O on the back is really impressive for a device in 2020. So we've got HDMI out, that is apparently HDMI 2.0, dual USB type-As, and then that, my friends, is a Thunderbolt 3! And a regular type-C. (shudders in awe) Wow, the screen actually, like, it feels bigger than eight inches sounds. Actually, when you think about how close, you know, a lot of phones are getting to seven inches, it's pretty substantial. So they've got a recessed joystick, kind of like... I think the first place I really saw this that was notable was on the Nvidia Shield Portable. Really good uniformity to these buttons. And then that's a PlayStation style D-pad. Xbox button, select, and start are up here. Touchpad is up on the top. We've seen this design compromise before with some of the first Nvidia Max-Q laptops, if I recall correctly, and the keyboard is a big question mark for me as well. I kind of want to boot it up, but I'm not sure where the power button is. Oh yeah, here we go. One of the struggles that I had with the, I think it was the Win 2, was that, as much as the keyboard was, like, getting close to usable, it wasn't quite there. And on this one, they claim they've got like desktop spacing for better usability. - [Computer] A little sign-in here, a touch of wi-fi there, and we'll have your PC ready-- - A Bit of mute right there, thanks for that, shut up. While it's firing up, I want to talk about the heft a little bit. It's definitely, obviously, heavier than a controller, but-- Oh, do I actually-- Oh, I do, I have an Elite controller right nearby, one sec. Okay. Yeah, compared to even an Elite controller, which is a heavy, that's a (controller thudding) beefy controller. It's obviously significantly heavier, but, it's, oh man, it's usable. Really good range of motion to the display, you can actually go all the way up to 180 degrees. So you can kind of sit like that with it in your lap, but it's not bad. We can talk button functions, here. So it looks like A is down, like it acts like an arrow key when we're in mouse mode. The D-pad acts as a scroll. Left seemed like it was kind of like a page-up, but I'm actually not sure anymore. And then for click, it looks like, yep, L1 for left click, and then, presumably, it would be R1 for right click. I still remember the first time I tried this controller scheme. I thought it was gonna be awful, but I was very pleasantly surprised by how good it is. Not particularly bright, but I also haven't tried to crank it yet. With how big the display is, I will say, it takes a minute to get across it, and I think I would find myself reaching for my touchpad more than I did on their first laptop that I tried this with. Little bit hard to reach some special characters, and the backspace is in a bit of an unconventional spot, so it's here instead of up here, where the delete is. I get it, I get it. You're working with a limited amount of space. I will say it would be a lot easier to get used to this one than it would be to get used to some of their previous ones, where they've had to hide special characters in super weird spots. It's interesting to me, they decided to put caps down here and tab up here, I actually would've left tab in its more traditional position and hidden caps lock away somewhere because, quite frankly, people shouldn't use that. Oh, those fans are going, eh? Wow, I can feel that air flow. Not super loud or anything, but they're really moving. Pre-loaded bloatware looks pretty acceptable. We've got-- Oh, it's not even pre-installed, this is just a Steam setup thing, okay. That's pretty good, I guess. Oh yeah, I said I wanted to do Super Meat Boy. Cracked 50 megabytes a second on wi-fi. This isn't even on a wi-fi six access point, although it does support wi-fi six. (whoops) I can really hear that CPU working for it though, eh? Remember, when you download a game from Steam, you're doing more than just stressing your network interface, you're also hitting your CP-- (gasps) 100% CPU load right now. Dang! Yep, even if we were on wired, I don't think we'd be downloading games any faster than around 50-ish megabytes a second. Oh, I had wanted to check out maximum display. Oh shoot, I don't have a controller. Oh wait, now I do, flick that switch! 60 hertz is a downer. High refresh rate display, that's a must for rev two of this guy. Goes nice and dim, too, which is something that I think a lot of people overlook as an important display spec. All right. Let's play some Super Meat Boy here, ladies and gentlemen. It's big! I almost feel like I have to sit back a little bit, you know? (singing nonsense) Oh, come on, baby! Just need more speed! Controller feels all right. Not like (chuckles) all right, but, like, all right. It's all right. I'm not gonna blame my performance on it, but it's just not an Elite controller or whatever, but I don't think anyone's gonna be expecting that. The buttons are pretty good, too. It's not bad. (singing nonsense) Okay, sorry, I'm getting distracted playing games. Let's open this thing up. (laptop thudding) (Velcro ripping) (tools clattering) (grunts) Oh! All right, there you go. Wow! Look at that battery! That is quite the situation they got up in there. So it's, like, a three cell, 57 watt hours. Dang! I'm actually expecting the battery life on this thing to be pretty darn good. (creaking) This is-- oh. This is a little flimsy feeling, so that explains why it felt like it had a lot of flex. No heat pipes or anything, they're just blowing (clicks tongue) straight out of the chassis. Got one M.2 slot right here. Oh, I lied! There's a heat pipe right there. Oh boy, there's a lot of different kinds of screws in here already. (sucks in air through teeth) Ruh-roh. Let's see, what else have we got in here? There's actually two heat pipes, so one of them goes over to this heat exchanger, and the other one goes over to this one. It's just a CPU, there's no dedicated graphics in here, but it is using Intel's Iris Pro Graphics, so that should put in on par with an entry level laptop graphics card. Curiously, they've gone with a soldered on solution for the wi-fi card. I guess that's just a space saving measure. Kind of makes sense. Okay, I sincerely hope I'm not breaking whatever this is. What on earth is this thing? What is on the other side? Oh, that's the joystick! Why did I take this apart? Okay. Let's just put that back together and hope we didn't ruin it. (laughs) Really gives you an appreciation for how small it is, to see how much space in here is taken up by things like the joysticks, the mechanisms for the shoulder buttons. Come to think of it, 512 gigs of storage plus micro SD is a lot of expansion in here. You're not gonna be putting a double stacked NVMe drive on there, though. Only enough room for the ones with chips on one side. I mean, still, not too shabby. Make sure it still works. (gasps) Okay. (sighs in relief) Okay, good, yep. Cool. So, the reason I was freaking out, these are not cheap. They are anywhere from around 780 US dollars to, I think, after the Indiegogo campaign, they're gonna be, like, mid 800s US dollars for one of these puppies, so yeah, not cheap. But there is just nothing else quite like this, so I'm gonna get some firmware updates rolling on it, spend some time with it, and I will see you guys on the LTT video for the full rundown. Thanks for watching Short Circuit. (bell ringing) I'm out.",
    "transcript_keywords": [
        "controller",
        "good",
        "bit",
        "kind",
        "Elite controller",
        "lot",
        "Super Meat Boy",
        "pretty good",
        "thing",
        "pretty",
        "display",
        "boy",
        "yeah",
        "wifi",
        "buttons",
        "super",
        "Meat Boy",
        "game",
        "typeC",
        "Super Meat"
    ],
    "transcript_entity_values": [
        "57 watt hours",
        "180 degrees",
        "65 watt",
        "Core",
        "Nvidia Max",
        "60 hertz",
        "LPDDR4",
        "R2",
        "the Nvidia Shield Portable",
        "Super Meat Boy",
        "SSDE",
        "One",
        "10 nanometer",
        "100%",
        "three",
        "one",
        "around 780 US dollars",
        "USB",
        "Ruh-roh",
        "50 megabytes",
        "micro SD",
        "Max",
        "sec",
        "50-ish megabytes",
        "Indiegogo",
        "Intel",
        "second",
        "LTT",
        "Elite",
        "2020",
        "seven inches",
        "1035G7",
        "first",
        "16",
        "two",
        "the Win 2",
        "HDMI 2.0",
        "wi-fi six",
        "four",
        "1280",
        "Velcro",
        "512",
        "wi-fi",
        "Short Circuit",
        "SD",
        "Xbox",
        "six",
        "jack",
        "CPU",
        "eight",
        "PlayStation",
        "a minute",
        "Iris Pro Graphics",
        "800"
    ],
    "transcript_entity_types": [
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "LANGUAGE",
        "LOC",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL"
    ]
}