{
    "id": "1L7JFN7tQLs",
    "title": "iPhone X + iPhone 8 Hands on!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-09-13T01:20:24Z",
    "video_url": "https://www.youtube.com/watch?v=1L7JFN7tQLs",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iPhone X",
        "iPhone 8",
        "iPhone X unboxing",
        "Apple iPhone X",
        "iPhone X hands on",
        "iPhone X review",
        "review",
        "unboxing",
        "iphone 8 plus",
        "iphone 8 unboxing",
        "iphone 8 review",
        "iphone 8 rumors",
        "iphone edition",
        "iphone 8 leaked",
        "iphone",
        "2017",
        "ios 11",
        "iphone 8 features",
        "apple iphone 8",
        "iphone 2017",
        "apple iphone edition",
        "iphone 8",
        "iphone 8 specs",
        "iPhone X official",
        "tld",
        "jonathan morrison"
    ],
    "views": 1176291,
    "likes": 28036,
    "comments_count": 4129,
    "description": "Apple iPhone X Review & iPhone 8 vs 8 Plus hands on coming soon! iPhone X or Note 8?  The iPhone X packs a 5.8\" OLED Display, A11 Bionic Processor, a Dual 12 megapixel camera with improved Portrait mode, Face ID, an wireless charging and more.   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/hCKMLoDswF0",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Johnathan here, and this is iPhone 10. Now to clear things up, yes it is spelled out iPhone X, but the correct pronunciation, Final Cut, just like Logic is iPhone 10, the number. Now this was the first Apple event at the brand new campus too, and it was a little bit crazy. Honestly, this was probably the hardest event to actually get your hands on a device with the iPhone 8, the 8 Plus, and of course, the iPhone X, so huge shout-out to Mark, Marques, Judner, Justine, this was kind of like this little collab tech team to get any kind of footage we can using all of our resources. I did manage to get some hands-on footage of both the iPhone 8 and 8 Plus, so if that's a comparison you want to see, let me know by dropping a like down below, and also, if you guys maybe want to see an iPhone X giveaway. Hit that subscribe button so you don't miss out on that. So, as far as the iPhone X, it is a really pretty phone. There's two colors, Space Gray and Silver. I'm kind of leaning toward Silver right now. It looks super classy, but regardless of whatever color you go with, both of them have black fronts, which makes sense with that edge to edge display. Now, as far as that edge to edge panel, it is a 5.8 inch display packed inside what is really closer to and iPhone 7, now, of course, iPhone 8 body, so you're getting a much larger display and much more screen real estate than even the iPhone 7 Plus or 8 Plus, but it's sandwiched inside a smaller container. So, that's a little deeper into this display. It's what Apple is calling their Super Retina Display. It's packing a resolution of 2436 by 1125, and for you pixel nerds out there, that is a ppi of 458. Nothing really groundbreaking here, as far as resolution goes, but what is pretty impressive is the fact that we finally have and OLED panel to the iPhone. That was maybe rumored to happen in 2018, so the fact that it's here now is awesome, and if you've ever experienced OLED, it is a beautiful thing. Now, the one thing you're probably thinking is that is a giant display, where is the home button? And unfortunately, or maybe fortunately, depending on how things work out, that home button is no more. Rest in peace. That is completely gone from the iPhone X. So, the way you unlock your iPhone X is simply just swiping up, and this also double functions to go back home, so if you're inside an app, swipe up, and it's going to bring you right home. Now on top of that, if you actually swipe up and pause slightly, that's going to bring you into multitasking mode. It's a little weird to get used to at first, but once you do, I can see it being pretty fluid. Conversely, if you now want to access Control Center, that is definitely a little different. It's actually a downward, diagonal swipe from the top right-hand corner. Again, definitely gonna take some time to get used to, but it works really well with the bigger form factor display. So, you're probably wondering, how do I unlock my phone, now that touch ID is gone? Apple's replacing that with what they are calling Face ID. Essentially, it is facial recognition to unlock your phone. (loud background interjection) Trust me, I fully realize this isn't anything new. I know Samsung pushed it last year with Note 7, then this year with the S8, S8 Plus, and now Note 8, but it does look like Apple took some time to really execute this well. They threw some number out there, like the change of breaking through randomly through touch ID was 1 in 50,000, and I believe Face ID, the chance of breaking that was like one in a million. So, if it is that accurate, it is definitely a good thing. Now, as far as what's packed inside the iPhone X, it's what Apple's calling their A11 Bionic Chip, which sounds -- (white noise) In a nutshell, that is six total cores, two and then four, and that's paired with a tri-core GPU, so this thing is supposed to be really, really powerful. What's interesting, though, is this is actually the same exact processor packed inside both the iPhone 8 and 8 Plus. So, even though you are kind of getting a downgrade there at a lower price point, it's still nice to know you do have that power packed inside those, as well. Now as far as the cameras on the iPhone X, this is a dual camera system laid out vertically as opposed to horizontally in the iPhone 8 Plus. Dual 12 megapixel sensors, but what's unique here and actually isn't new because Samsung just rolled this out with Note 8 is both lenses feature OIS. Now, why that's important is because it's going to help in stabilization, obviously, but more importantly, low-light and just getting an overall cleaner, better image. A really big thing for Apple at this event for both the iPhone 8 Plus and the iPhone X because of those dual lenses is Portrait Mode. On top of the improved optics, there's also improved software. So with both the iPhone 8 Plus and the iPhone X, Apple's introducing what they're calling Portrait Lighting. It's kind of hard to really explain and demonstrate with just a couple minutes with the phone, but the general idea is you now have control to mess with the lighting and adjust it, just like you would in a studio, and this applies both pre- and post-photo. Beyond that, there is now Portrait Mode on the front-facing camera, which I think is actually a huge deal. It's a seven megapixel shoot, so you're getting increased sharpness, but the big thing here is because of their True-depth technology for the facial unlock, that's going to reap benefits for the front-facing camera in photos, as well. So, this is also something that applies to the iPhone 8 Plus. Here's a quick demo of how that looks. You can see how you can adjust things post-photograph, and I'm actually really excited to check this out in more detail. From there, with the power of both the cameras and the actual power inside these iPhones, the big thing this year and the focal point was augmented reality. Got a little bit of a chance to check things out. It's a little bit crazy. I've never been a big fan of VR, but I can really see myself digging in and having fun with augmented reality, and both the iPhone 8, 8 Plus, and the iPhone X seem to pull it off really well because they are all using that A11 chip. Now, I don't have exact specifics as far as the battery capacity goes with the iPhone X, but Apple's claiming two more hours than the iPhone 7. So, it's nice to know that you're kind of getting iPhone 7 Plus, iPhone 8 Plus battery life on a much smaller form factor, but with that bigger display. You're getting the best of both worlds. Now, one huge implementation across the board, across all iPhones whether it's 8, 8 Plus or the iPhone X, as a wise man Dwayne \"The Rock\" Johnson once said finally, wireless charging is here through the wireless Qi standard. Now I get it, I am bracing myself for you keyboard warriors out there who are going to yell at me and say, \"What the hell? That's been around for 58 years. That's not new.\" For the record, I am not stating this is new or some kind of witchcraft or Apple invented it. I'm just simply letting you know it is now available across all iPhones. And again, the biggest thing for me here is minus Apple's slightly silly name, was their air-powered, wireless charging mat, which allows you to charge everything at once, your iPhone, your Apple Watch, surprisingly AirPods. So, it looks like there's a wireless charging case coming for that soon. Yes, sir. But aside from that, I think rather than looking at this like a negative, if you are on that side of the team, where you feel like you've had wireless charging forever, this is actually a good thing because this is going to open up a wider adoption, and that is always a good thing. Lastly, kind of round out everything as far as storage and pricing goes, the iPhone X is either coming in a 64 gig or 256 gigabyte flavor. Unfortunately, that means no 512, but it's going to start out at $999. Pre-order starts October 27th, and it will finally ship November 3rd. So, we got a little bit of time ahead of us. So, that is iPhone X in a nutshell. Thank you, guys, very much for watching. Hopefully, you enjoyed this hands-on. Again, if you have not subscribed, you probably want to do that. Turn on notifications because there's going to be an iPhone X giveaway very soon. I would love to hear your favorite feature on the iPhone X. Drop me a line down below. This is Johnathan, and I'll catch you guys later.",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "thing",
        "Final Cut",
        "display",
        "kind",
        "iPhones",
        "inside",
        "things",
        "big thing",
        "packed inside",
        "good thing",
        "Portrait Mode",
        "wireless",
        "Apple event",
        "edge",
        "Note",
        "Portrait",
        "Super Retina Display",
        "wireless charging"
    ],
    "transcript_entity_values": [
        "two",
        "Logic",
        "iPhone",
        "Final Cut",
        "Apple Watch",
        "256 gigabyte",
        "1125",
        "iPhone 8 Plus",
        "November 3rd",
        "the iPhone 7",
        "Johnathan",
        "Dwayne",
        "S8 Plus",
        "iPhone 7",
        "Control Center",
        "50,000",
        "2018",
        "October 27th",
        "999",
        "S8",
        "458",
        "Portrait Mode",
        "VR",
        "8 Plus",
        "Apple",
        "Judner",
        "just a couple minutes",
        "iPhones",
        "seven megapixel",
        "four",
        "Portrait Lighting",
        "AirPods",
        "2436",
        "A11 Bionic Chip",
        "iPhone X",
        "six",
        "two more hours",
        "512",
        "the 8 Plus",
        "5.8 inch",
        "1",
        "iPhone 7 Plus",
        "first",
        "Qi",
        "64",
        "one",
        "a million",
        "GPU",
        "58 years",
        "Justine",
        "Johnson",
        "Samsung",
        "last year",
        "the iPhone 8 Plus",
        "8",
        "Space Gray",
        "Super Retina Display",
        "12 megapixel",
        "this year",
        "Mark, Marques",
        "A11",
        "OLED",
        "iPhone 10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "EVENT",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "TIME",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT"
    ]
}