{
    "id": "1naFgA71F3I",
    "title": "iPhone SE (2020) Teardown! - Lets talk about Vibrators...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-05-05T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=1naFgA71F3I",
    "category": "Howto & Style",
    "tags": [
        "iphone se",
        "iPhone SE",
        "iPhone SE 2020",
        "2nd gen iPhone se",
        "iPhone SE teardown",
        "iPhone SE 2020 teardown",
        "iphone",
        "apple iphone",
        "new iphone",
        "best iphone",
        "cheap iphone",
        "take apart iphone",
        "iphone repair",
        "screen repair",
        "battery replacement",
        "iPhone SEe",
        "Taptic Engine",
        "Haptic feedback",
        "phone vibrator"
    ],
    "views": 3188424,
    "likes": 96532,
    "comments_count": 8559,
    "description": "The new iPhone SE is here! Show off the insides on the outsides with my Teardown skin HERE:  This 2nd generation iPhone SE has gotten alot of attention for being a super inexpensive iPhone while still being competitive with other 2020 devices. Today we are going to take apart the iPhone SE to see how it works from the inside, and how the vibrator functions. Apple has designed their own Proprietary Taptic Engine for Haptic Feedback, and its time we took a look from the inside.  Watch the iPhone SE 2020 Durability test here:  Watch the Laser back glass repair HERE:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://dbrand.com/iphone-teardown",
        "https://youtu.be/0oYdq6ri6eg",
        "https://youtu.be/Lj4Od9D4puc",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The brand new 2020 iPhone SE. Of all the crazy things to happen this year, Apple releasing an affordable iPhone is up there with the craziest. Today we're going to pop the lid, tear it down, and see what that proprietary taptic engine looks like from the inside. It should be interesting. Let's get started. [Intro] Like all the iPhones in the past 9 years, there are 2 pentalobe screws down at the bottom. The star shaped pentalobe screws are super common, so I'll link a tool kit that I use down in the video description. This iPhone is ip67 water-resistant, all while only costing $399. The screws even have a little black gasket under the head to help keep water out. Heat helps with getting the screen off the iPhone SE. There is a bead of sealant around the opening that will also help keep liquid out of the phone. Once it's warmed up I can use a large suction cup to lift up on the bottom edge, while popping it open with my razor blade. Taking special care, of course, not to put too much pressure on the metal frame because we'd hate to scratch it or anything. The top of the phone needs to come down ever so slightly before the whole thing can fold open like a book. I'm taking special care not to put any stress on those ribbon cables along the right hand side because they can tear just like paper...and, well, if you think this thing looks familiar, you're right. Pretty much all of the internal components of the 2020 iPhone SE are interchangeable with the iPhone 8, like the speakers, rear camera, and according to iFixit, even the screens are interchangeable. The battery however, while the same size and capacity as the iPhone 8, is not interchangeable The connector's different. Hidden under this metal plate with the 4 screws is the battery Lego-style connector. I can pop that off with my plastic pry tool and then work my way up to the top metal plate and it's 3 screws. Nearly every screw in this phone is a different size and shape and requires 4 different screwdriver heads to take apart. After the 2 protective plates are gone, I can pop off the three screen ribbon cables just like 3 little Legos. One thing I am happy about though is that the screen is the first thing to come off on the phone. And even better, the iPhone 8 replacement screens are currently selling for about $25 or $30 right now. So if they really are interchangeable, it's one of the cheapest third party screen repairs of all time. Today though, we're going to keep focused on that vibrator. First let's get this battery out. Another thumbs up to Apple is their magical battery pull tabs. Some manufacturers make battery replacements impossible by gluing their batteries permanently into the phone. I don't want to name any names, but it rhymes with Samsung. Batteries don't last forever. I'm glad we can get this one out without exploding anything. Even if the battery pull tabs do break sometimes. This battery's a rather tiny 1,821 milliamp hour. Now that we have the battery out, we can see that the internal frame of the phone is metal. And as we know, metal isn't very see-through which makes a transparent iPhone SE pretty difficult. What we did for the Teardown Skin was mirror the internal image so that when looked at from behind, everything lines up exactly where it should be inside the phone. And of course, I might be a bit biased, but I think it turned out pretty darn good. We even ripped off the metal plate covering the A13 processor so we could see the brains of the operation. I'll leave a link for my Teardown Skin from dbrand down in the video description. We already cover most of the new phones and just added the iPhone 8 and iPhone 7. One place where this phone does sacrifice a bit though is with the camera. There's only one. While most phones nowadays are shipping with 2, 3, or even more perspectives than that. After pulling away the two screws and metal bracket, the rear camera comes loose. It's a 12 megapixel unit and does have optical image stabilization. I'll pull the SIM card tray out next and unclip 3 more ribbon cables down here by the motherboard...just like little Legos. Apple's actually doing a pretty good job when it comes to the whole saving the planet thing. A lot of the components inside of this iPhone SE are made from recycled materials. For example, this motherboard, which is held in place by 10 screws, is assembled with 100% recycled tin in the solder. Apple does still like to be difficult though with 2 more random screws up here in the top that screw directly into the frame. I don't know what this thing does but it's probably important. After one more little ribbon cable connector, the motherboard comes free. And as always, even though this phone is water resistant, there are still water damage indicators inside that'll tattle on you if they ever get wet. No phone is waterproof and these stickers will turn pink if the phone senses any moisture internally. And here is the motherboard, with the same footprint as the iPhone 8. It has upgraded chips to still be relevant in 2020. Now that the motherboard is out, we can see more of the metal backing, along with the wireless charging coil in the center, and the long charging port ribbon that's tucked up underneath the motherboard with it's 11 different sized and shaped screws holding it in place. I can remove this small metal plate and keep it organized right next to the screws that it came out with. And now we get a good look at the loudspeaker. For a company who hates people getting inside of their own phones, they sure plaster their logo everywhere. You might have noticed the difference between most Androids and iPhones. Androids do tend to be a little more consolidated with less parts and screws inside. While iPhones have a lot more little parts, brackets, and screws all in a very specific order to remove. Finally though, it's time to take a look at this taptic engine. So haptic feedback is the way your phone communicates with you through vibrations. Normal vibrators that have a lopsided spiny bit to cause vibrations are called eccentric rotating mass vibrators. But Apple was disappointed in the split second it takes for a motor to spin up before it gets to full vibration capacity so they invented this guy: the taptic engine, which has no rotating bits. Peeling off the top of this electric sardine can, we can see that there are coiled copper wires, magnets in the middle, and metal springs on either end to cushion it's back and forth movement, along with quite a bit of oil. Which probably acts as the vibrator's internal lubricant. Apple says that this linear actuator is able to hit full power much quicker than the rotating mass vibrators found in other phones, which gives it more abilities. Instead of one power level, you know, on or off, this guy's copper coils allow a range of different levels of haptic feedback and can provide it instantly. Personally I think it's a little overkill, but Apple apparently feels very strongly about good vibrations. Apple also feels strongly about a complicated assembly apparently, with two more small screws drilled directly into the bottom of the frame. Getting a closer look at the water proofing inside of the phone, we see that the mesh for the bottom holes is actually pretty thick. It's like a whole filter instead of just one mesh screen. The red lightning charging port is capable of charging at 18 watts, if you buy your own charger. And does have a white rubber ring around the tip to help keep water out. Another good thing that Apple is doing, before I jump into some of the bad things, is that for the metal frame, Apple is prioritizing aluminum that is smelted using hydroelectricity rather than aluminum that is melted with fossil fuels. Unfortunately though, after all that effort to be green, Apple went and used permanent adhesive again on the back glass making it impossible for the average person to replace. And apple charges $269 to replace the back glass themselves, which is more than half the price of the phone, and completely unnecessary. Of course, where there's a will there's a way, and there's actually some really cool laser separator technology that let's third party repair shops replace the back glass cheaper. I'll link the laser video down in the video description. Apparently, Apple has a really cool machine of their own called Daisy that can tear down and recycle up to 200 devices an hour. Let me know down in the comments if you think Apple should let us come take a closer look at that thing. Personally, I'm glad that Apple is using their old phone designs with upgraded hardware. Phones are getting way too expensive these days and it's nice to see a phone this good with both water-resistance and wireless charging all for less that $400. At this price point, I bet that Apple is definitely going to steal away some Android users, and after a few more innocent purchases like Air Pods and an Apple Water, they'll never be able to escape. It's a slippery slope. Finally, with the screen connected and battery in place, the phone is able to turn on. I'll get the metal plates back in place to help keep the connections from popping off. And even without that taptic engine inside, the phone still turns on and functions like normal. Kind of cool. I'm curious though, if you're an Android user, does this phone tempt you into switching sides? Let me know down in the comments. I'll leave a link for my Teardown Skin down in the video description so you can have all the cool bits from the inside shown off on the outside. Come hang out with me on Instagram and Twitter. Hit that subscribe button if you haven't already. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Apple",
        "phone",
        "iPhone",
        "screws",
        "metal",
        "battery",
        "inside",
        "thing",
        "metal plate",
        "phones",
        "Teardown Skin",
        "screen",
        "water",
        "motherboard",
        "good",
        "iPhones",
        "Pretty",
        "video",
        "ribbon",
        "frame"
    ],
    "transcript_entity_values": [
        "more than half",
        "3",
        "Daisy",
        "A13",
        "just one",
        "iPhone",
        "399",
        "2020",
        "up to 200",
        "400",
        "8",
        "ip67",
        "Lego",
        "Instagram",
        "100%",
        "two",
        "1,821 milliamp hour",
        "about $25",
        "three",
        "the past 9 years",
        "one",
        "Legos",
        "iPhone SE",
        "only one",
        "4",
        "Androids",
        "SIM",
        "iFixit",
        "11",
        "10",
        "this year",
        "Air Pods",
        "Apple",
        "iPhones",
        "first",
        "second",
        "First",
        "Samsung",
        "12",
        "third",
        "Today",
        "these days",
        "Android",
        "3",
        "One",
        "269",
        "2020",
        "iPhones",
        "iPhone 7",
        "the Teardown Skin",
        "30",
        "18 watts",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL"
    ]
}