{
    "id": "1ndO3LkuiO0",
    "title": "LG Watch W7 Review: W8 For The Next One",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-12-08T14:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=1ndO3LkuiO0",
    "category": "Science & Technology",
    "tags": [
        "lg watch w7 review",
        "lg watch w7",
        "lg watch 2018",
        "hybrid smartwatch 2018",
        "smartwatch with hands",
        "analog smartwatch",
        "wear os",
        "mrmobile",
        "wearables",
        "michael fisher",
        "android central"
    ],
    "views": 126653,
    "likes": 4444,
    "comments_count": 298,
    "description": "The LG Watch W7 from LG aims to do for smartwatches what the hybrid car did for automobiles: combine the best of yesterday and today for a product that exceeds the sum of its parts. On paper, its a pretty cool idea  but on your wrist  well, you might want to \"W8\" for the next one. Get the full picture in MrMobile's LG Watch W7 Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S LG WATCH W7 REVIEW]  MrMobile's LG Watch W7 Review was produced following ten days with an LG Watch W7 review unit provided by LG. The device was tested with a Huawei Mate 20 Pro and an ASUS ROG Phone.    [MUSIC]  Escapade by Vincent Tone, available at Premium Beat:   Lets Get It by Eternity Bro, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #lgw7 #wearos #lg #w7 #smartwatch",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty-free-tracks/escapade",
        "https://www.premiumbeat.com/royalty-free-tracks/let-s-get-it",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Announcer] You know how a hybrid car takes the best parts of gas and electric and mashes them into one vehicle? Well, the Watch W7 from LG aims to do the same for the smartwatch. And on paper, it's pretty cool. On your wrist, though, well, you might want to wait for the next one. LG started developing the Watch W7 three years ago, and it's no wonder. I mean, think about how much had to go into this casing. The W7 has all the fundamentals of a traditional smartwatch, battery, processor, LCD screen. And stuck in the middle of it all, a big quartz mechanism that drives those analog hands. That takes some impressive engineering, and while LG isn't the first company to think of this design, this is the first such watch running Google's Wear OS. Where the W7 shines is in the ways the watch hands interact with the software. Click into Master Tools, and set a countdown timer, or open up the compass, and, well just look at it. The analog hands and the digital watch face beneath sync up perfectly. Use one of the preloaded watch faces, and it'll carve out little pie slices based on the hand position. This isn't entirely a gimmick. Credit to Russell Holly at Android Central for pointing out that every function that uses the analog hands is automatically easier to read than just a screen in direct sunlight. And when the smartwatch battery runs out, the W7 will automatically fall back on Just Watch mode, keep on giving you the time. And if you manually toggle Just Watch mode, you'll have about a hundred days before you need to charge your watch again. Now LG is clearly leaning heavily on that 100 day figure to wow you, but think back to other watches announced earlier in the year. Many of them, and even some from last year, have similar timekeeping-only modes when their batteries get low. What's more, they're able to do that without big analog hands that get in the way. And get in the way, these do. LG has worked with Google to help a little bit. You can hold the top button to force the hands to nine and three, and at the same time, the display will kind of bump up a few pixels to help you read your inbound messages. But even short messages are often cut off by the hands. So you need to scroll with either your finger or the rotating side button. And while that rotating side button is usually my favorite part of a watch, this one isn't. It's small and slippery, and makes a strange mechanical noise when you spin it. Now, let's factor in all the compromises that LG had to make to accommodate the analog mechanism. There's no heart rate sensor or GPS, so this isn't a workout machine, no matter how strongly the cheap rubber wristband might suggest otherwise. There's no NFC, so say goodbye to Google Pay. And the silicon driving the whole experience is the older Snapdragon 2100, not the newer 3100. That last point will probably go unnoticed by the end user, since the ability to fall back on analog hands for timekeeping means this watch will last two days between charges. And a solid two days, too. But that's still quite a few shortcomings, and when you combine them with the useability challenges, means this watch kind of has to stand on style as a differentiator. At least that's what LG said at the launch event in New York. And honestly, I find this design pretty forgettable. Small personal word, folks. This was a tough watch to review, because I really appreciate it when a company takes a chance on something. And there is more to like in the little details, from the IP68 dust and water resistant casing to the USB-C charging dock. But for me, those details only shine on a product whose fundamentals are solid. And the W7 just gets in its own way too much. If you do want it, LG is doing its usual thing, deeply discounting products soon after release so it feels like you're getting a great deal. But even at the discounted price, I'd really only recommend this one to someone who's buying it expressly for the purpose of wearing something different. You may have noticed, folks, that this video was shot in Hawaii, where I'm covering the Qualcomm Snapdragon Summit. Be sure you're following me on Instagram for all the news from this event, and remember to subscribe to theMrMobile on YouTube, so you don't miss another smartwatch review, running that newer 3100 platform, coming very soon. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Watch",
        "analog hands",
        "hands",
        "hybrid car",
        "gas and electric",
        "electric and mashes",
        "analog",
        "Watch mode",
        "watch running Google",
        "watch hands interact",
        "watch hands",
        "big analog hands",
        "smartwatch",
        "Google",
        "parts of gas",
        "running Google Wear",
        "watch face",
        "Google Wear",
        "watch kind",
        "watch running"
    ],
    "transcript_entity_values": [
        "last two days",
        "Instagram",
        "the Watch W7",
        "W7",
        "100 day",
        "last year",
        "YouTube",
        "two days",
        "Just Watch",
        "3100",
        "first",
        "Google",
        "three years ago",
        "Master Tools",
        "nine and three",
        "about a hundred days",
        "LG",
        "New York",
        "Russell Holly",
        "Wear OS",
        "Hawaii",
        "Watch",
        "NFC",
        "LCD",
        "one",
        "earlier in the year"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE"
    ]
}