{
    "id": "1RsaaPlwlkY",
    "title": "whats on my iPhone 12 - favorites apps + homescreen setup!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2021-01-10T20:47:15Z",
    "video_url": "https://www.youtube.com/watch?v=1RsaaPlwlkY",
    "category": "Science & Technology",
    "tags": [
        "iPhone 12",
        "iPhone 12 mini",
        "what's on my iPhone",
        "what's on my iPhone 12",
        "iPhone 12 tips and tricks",
        "iPhone 12 long term review",
        "best iPhone icons",
        "iOS 14",
        "iOS 14 icon pack",
        "best iOS 14 icons",
        "iOS 14 widgets",
        "iOS 14 tips",
        "iOS 14 aesthetic",
        "aesthetic",
        "minimal",
        "iPhone setup",
        "minimal iPhone setup",
        "incipio",
        "incipio iPhone",
        "best iPhone cases",
        "best iPhone 12 case",
        "iPhone 12 case",
        "iPhone accessories"
    ],
    "views": 188705,
    "likes": 8680,
    "comments_count": 4712,
    "description": "whats on my iPhone 12 mini - favorites apps + iOS 14 customization & setup tips! check out the Incipio case lineup!  AirPods Max Listen Experience Review!   Wallpaper Downloads!  Icon Pack:    why I switched to the 12 mini:  iOS 14 + iPhone 12 Battery Life tips!",
    "description_links": [
        "https://www.verizon.com/products/incipio-duo-case-for-iphone-12-mini/?sku=sku4020089",
        "https://youtu.be/oSaA9iB99kU",
        "https://app.box.com/s/nmdg3xikwfrsnbffeu2vj7h1fujid0km",
        "https://natewren.com/product/chroma-ios-icon-pack-for-iphone/",
        "https://youtu.be/u1hA3OXVrKw",
        "https://www.youtube.com/watch?v=Nb5viaWrU4Y"
    ],
    "transcript": "- Yo, Jonathan here. I recently switched to the iPhone 12 mini, and it's been forever since I've done What's on My iPhone? There were some pretty big changes to iOS 14.3 that specifically affects how shortcuts and app icons work, so I figured I'd cover that, and some of the most useful apps that help me on a day-to-day basis. Now, if you're thinking to yourself, \"Why are you using an iPhone 12 mini, and not a 12 Pro or 12 Pro Max?\" I dropped a video explaining exactly why that is with a very special guest, Peter McKinnon. He also switched, so I'll drop a link to that video down below, but since then, I have not switched. I'm still using the iPhone 12 mini as we speak, and with that extra time I spent with it, I've got a chance to customize some stuff, make some tweaks, and honestly, just kind of simplify and slim things down. (\"Exes\" by Loote) So I actually got my set up down to three pages, the stuff that I use the most, the stuff that I use the second most, and finally, the stuff that I have not finished organizing yet. On the main page, got a battery percentage icon/day and date widget from Color Widgets. From there, I have Photos, Maps, Weather, Camera, Notes, Twitter, Instagram, Spotify, Snapseed, Calendar, YouTube, and finally Apollo, which is hands-down my favorite Reddit app. Now because the iPhone 12 mini packs an OLED display, naturally I wanted a wallpaper that would take advantage of those OLED blacks. This is part butter dog, part vibing cat, which works beautifully if you wanted to go with a darker icon theme, and if anyone wants to rock this with me, I'll drop a download link to it down below. Hopping over to the second page, I have Files, GuitarTuna, Chord AI, the Apple Store. This here is a custom shortcut I set up through Safari to track and monitor coronavirus cases, so instead of opening up Google and typing in coronavirus tracker, it's one tap, it's there, and for those out there wearing their masks, and distancing and washing their hands, I see you, and I appreciate you. Next to that is a metrics and analytics app for Spotify when you release music, and I cannot wrap my head around the fact that \"MagSafe\" just passed 100,000 streams. You guys are bananas. Moving down the page, though, I have TIDAL, Settings, Apple Music, and automation to open and start voice memos, Best Buy, and I'll be the first to admit the experience there is usually a mixed bag, but they've been surprisingly pleasant throughout the pandemic. From there, Focos is a fantastic app to really fine tune your portrait photos, and then rounding out this page, I have YouTube Analytics, Dropbox, Box, and Chase. Now zero of these apps are sponsored, but with that, I do want to thank today's sponsor Incipio. They make some of the best accessories in the game, and you know it's no different when it comes to cases. Also, as a way to give back to you guys, let's give away a brand new iPhone 12 mini wrapped in one of their beautiful cases. To enter, all you gotta do is drop a comment, and it's not required, but if you're feeling like being awesome, make sure you guys drop a like down below. So they've got options across the entire iPhone 12 and 12 Pro lineup. Specifically, I'm rocking the Duo on mine. The Duo implies two layers of protection. You're gonna get drop protection up to 12 feet, which is awesome, just in case you happen to have a loose grip. What's nice on top of that is you're getting lip protection, so I think naturally we tend to just set our phones face down. The problem is, though, that's a surefire way to scratch up that screen. Also, I want you to know about anti-microbial properties, because this case packs that as well. It will prevent in combat the growth of, don't. Don't look at me like that. If you look at your phone under a blacklight right now, you're gonna tell me it's clean. Now, if you're thinking, \"Hey, I just bought this new iPhone 12. I love MagSafe, and the song. Can I use this case with the charger?\" Yes, Jimmy, you can. And beyond that, you pair things like a lifetime warranty, and I think this case just sold itself. You can grab these online or in store at Verizon, and I'll drop that link down below. Now the iPhone pack that I'm using is called Chroma by Nate Wren Design. It's a little bit ridiculous as far as the amount of stuff packed inside here, but in the best possible way, not only just icons, but you're getting wallpapers as well. So in terms of value, I would definitely say it's worth the price. What's a nice touch is it comes in four different color styles: black, blue, gray, and white, and I will say if you can, download this to a desktop or to a laptop, because it's much easier to sort through there. If you can't do that, and you're just using your phone, alternatively, I would say definitely take advantage of Files to sort through and sift and move what you need into a sub folder. That way you're not throwing 4,000 plus icons into your camera roll. Now, just in case you missed the whole app icon thing, and have no idea what's going on, this is done through shortcuts. I'll definitely drop a more detailed, customization-focused video down below, but the general step is to, in Shortcuts, hit plus. We're going to Add Action. We're going to type in open app. Go ahead and choose the app you want. Name the shortcut so it can then save it within the app. From there, you're gonna want to select Add to Home Screen. And here you have two options. If you want the text to show, name the app there, or if you want that minimal look, just kind of exit out. Finally, go to tap the icon to change it, and then you're gonna select wherever you saved that icon, and bam, you are customized. Now, as far as some of my most used apps, Snapseed is something that I've used for years. I will say it's probably a little less relevant now with the amount of control you have within the Photos app, but it's something that I still find myself going back to. At this point, I'm sure there are some better alternatives out there, so if you guys have any favorites, let me know in the comments down below. Again, Apollo is my personal Reddit app of choice. It's a real simple, clean way for me to catch up on tech news, the states of the crazy in the world, and really more so, as of the past week or two, pet videos, because that's what we all need right now. GuitarTuna is a really fantastic free guitar tuner that you always have on you. It is, of course, always nice to have an external option, which I featured in the latest 50 Under 50, but again, sometimes you misplace it. Sometimes you can't find it, so it's nice to always have an option on your phone. I ended up paying for the pro version, which unlocks multiple tunings, but for me, what's really useful is Chromatic Mode. So with guitar, for example, if you throw on a capo, it's going to tell you if you're in tune for that specific note, as opposed to a specific standard tuning. Also, if you're just starting out, having a tuner with you at all times is really helpful, even with basic things like playing chords. Your guitar could be completely in tune, but because of how much pressure or lack of pressure you're using with your fingers, it could sound out of tune, so with the tuner, what you want to do is play individual strings, and then with that, you can see if you're sharp or flat, and then release or add more pressure to get everything sounding just right. Next to that, the other music app that I use a ton is called Chord AI. This is a widely-used microphone on your phone, or you can open up a file or song within the app. It will then analyze that song, and then give you an educated guess of what chords are being played within that song. It's not perfect, but it's really freaking good, and it's especially helpful if you're just starting out, or you just want to quickly learn a song without looking up tabs or chords, especially if the song just came out, and they're not out yet. Over on Jonathan and Friends, the acoustic video that I did with Loote, this app is actually how I figured out and transposed how to play that song with them. I really liked that you can mess with the capo placement and find different ways to play that song. You can also choose from basic or advanced chords, and again, whether you're just starting out, or looking to step up and improve, for me, it's been an invaluable tool. Another app that I use a ton is the stock Voice Memos app, just to get a quick idea down, whether it's for video or for music. With the automation shortcut I have set up, instead of launching the app and then pressing record, with this, it's just one tap, and it instantly starts recording. Now from there, if you're saying, \"Yo, dog, you've been putting too much butter on your head. Why do you have TIDAL, Apple Music, and Spotify? The backstory behind that, I think first and foremost, my favorite app, as far as discovery is hands down, Spotify. Nothing else comes close. From there, though, I do appreciate TIDAL and its audio quality. Nothing else comes close, especially when you pair it with a good Dak and headphones. I will say Apple Music has definitely been my least favorite, and something that I really hadn't used until recently. The reason why I've given it a chance lately, though, in terms of wireless audio quality, not wired, it definitely sounds better compared to Spotify. (upbeat hip-hop music) When the low end kicks in right there, it's crazy. There's this little reverb on the snare. A lot of space with the vocals. That was a breakdown of some of my favorite tracks and how they sounded through AirPods Max using Apple Music. So if you're interested in that, or just want a playlist of some new music to listen to, I will also drop a link to that down below. Now, from there, if you take a lot of portrait shots on your iPhone, Focos, or Focus, is a really great way to really fine tune those. There's so much stuff you can do. If you unlock it, you can change the type of bokeh, the shapes to even things like stars, but at its basic core and foundation, it's really helpful just to fine tune and focus, especially if you didn't nail it the first time. So now that we've fixed the focal point, and Groot is in focus now, if we scroll through the lenses, we can actually change that bokeh, or should I say tone or type? They have a couple of fun options, so you can change the bokeh shape, as opposed to just changing the lens, so everything from a star, down to zooming in real close, we get that tone of heart. Apart from the battery life though, again, I have thoroughly enjoyed everything about the 12 mini: the size, how light it is. Going back to the bigger phones, you're like, \"Damn, how did I carry this before?\" My guy Aaron Zollo over at Zollotech has a really helpful video on how to get the most battery out of your iOS device, so I'll drop a video link to that down below. So for me, what I did was a combination of two things. As per Zollotech's video, I made sure to turn off background app refresh for all the apps that I don't need. That alone is super helpful, so definitely make sure to check out how many apps you have automatically refreshing in the background, because chances are, you don't need all of those, and then from there, what I did was create two automation shortcuts. So when my phone dips below 35%, it will automatically go into low power mode, and then from there, taking it one step further, once my battery dips below 15%, and if you're on Team Living on a Prayer dropping down below, it will then automatically dim the screen brightness below 20%, so those two things together have definitely helped a lot, and again, I would say as much as I've enjoyed the 12 mini, battery life is definitely the weakest point here. Hopefully, though, you guys enjoyed the video. Hopefully you found it helpful, and if you guys are over on Twitter or Instagram, I would love to see your setup. Send me those. Thank you guys so much for watching. This is Jonathan, and I will catch you guys later. (\"Exes\" by Loote)",
    "transcript_keywords": [
        "app",
        "Apple Music",
        "iPhone",
        "drop",
        "music",
        "video",
        "mini",
        "guys",
        "song",
        "apps",
        "Apple",
        "Spotify",
        "Reddit app",
        "stuff",
        "things",
        "case",
        "tune",
        "helpful",
        "Pro",
        "icon"
    ],
    "transcript_entity_values": [
        "two",
        "the past week",
        "iPhone 12",
        "Snapseed",
        "Incipio",
        "Team Living on a Prayer",
        "iPhone",
        "the Apple Store",
        "Safari",
        "MagSafe",
        "Focos",
        "Color Widgets",
        "12 feet",
        "AirPods Max",
        "iOS 14.3",
        "Chroma",
        "YouTube Analytics",
        "Verizon",
        "Twitter",
        "Dropbox",
        "Nate Wren Design",
        "Spotify, Snapseed",
        "Chromatic Mode",
        "zero",
        "Apollo",
        "Loote",
        "YouTube",
        "Notes",
        "Home Screen",
        "four",
        "Calendar",
        "Dak",
        "Groot",
        "the latest 50 Under 50",
        "below 20%",
        "Reddit",
        "below 15%",
        "Peter McKinnon",
        "Spotify",
        "4,000",
        "Google",
        "Focus",
        "second",
        "years",
        "three",
        "first",
        "Best Buy",
        "one",
        "Reddit",
        "Apple Music",
        "Friends",
        "12",
        "Jimmy",
        "Chase",
        "Aaron Zollo",
        "Chord AI",
        "today",
        "Zollotech",
        "100,000",
        "GuitarTuna",
        "Instagram",
        "Yo",
        "Jonathan",
        "below 35%"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERCENT",
        "NORP",
        "PERCENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERCENT"
    ]
}