{
    "id": "1toRvvOwZJU",
    "title": "Leopold Mechanical Keyboard Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-10-31T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=1toRvvOwZJU",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "mechanical",
        "Leopold",
        "Cherry MX",
        "keyswitch",
        "MX Brown",
        "MX Blue",
        "MX Red",
        "MX Black",
        "USB",
        "membrane",
        "Ducky",
        "Filco",
        "HHKB",
        "review",
        "n-key rollover",
        "This Does Not Compute",
        "FC750RPD"
    ],
    "views": 127201,
    "likes": 1498,
    "comments_count": 130,
    "description": "There are lots of options for mechanical keyboards these days -- so how does this 80% board from Leopold stack up?  Leopold FC750R keyboard series page (Korean):  US vendor link (no affiliation):   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Lakey Inspired ( Intro music by BoxCat Games (",
    "description_links": [
        "http://leopold.co.kr/?doc=cart/list.php",
        "https://mechanicalkeyboards.com/shop/index.php?l=product_detail",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.soundcloud.com/lakeyinspired).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? Most of us type on boring membrane keyboards. This time, let's take a look at an option that offers a much nicer experience. [ Music - Intro ] This is the FC750R PD from Leopold. It's a mechanical keyboard and a so-called \"80% layout,\" which means it offers 87 keys and no number pad. It connects through USB and comes with a six foot cable, but it uses a Mini-B port, which is becoming less common. It supports n-key rollover and a PS/2 adapter is included in the box. The build quality of this keyboard is simply excellent. Its plastics have a nice texture and are molded well. And the rubber feet on both the the bottom casing and the rear legs do a good job keeping it from sliding around. It has a really sturdy feel. It doesn't flex while typing due to a metal plate inside, which also gives it some serious weight. It's almost twice as heavy as an ordinary, full-size membrane keyboard. The keycaps come in a few different colors and schemes. I'm partial to this gray and blue look myself. And they're double-shot, which means the lettering will *never* wear off. There's also a sound-absorbing pad inside to help cut down on the noise, though the overall sound the board makes will really depend on which key switches you pick. Speaking of that, Leopold hasn't traditionally been known for offering many key switch options, though it seems to be getting better. Seven different kinds of Cherry MX switches are offered, Including the typical Blue, Brown, and Red varieties, but also Black, Silent Red, Clear, and Silver. All of these offer a different feel and I chose MX Browns on my board because they have a nice, tactile touch like MX Blues, but aren't quite as noisy. Here's what I mean. [Aukey KM-G3 Blue Switch Clicking] [Leopold FC750R PD Brown Switch Clicking] This is a typing-focused board, so in terms of extra features, there aren't many. There's a set of DIP switches on the back that allow for swapping the function of a few sets of keys without having to do it in the operating system. For example, it's common to exchange CapsLock and Control and one of the DIP switches lets you do that. There's even a spare pair of those keycaps included in the box. There are, of course, a few downsides. If you're hoping for LED backlighting, you'll be disappointed. There aren't any LEDs on this board at all, except for the Scroll and CapsLock indicators. Also, the language layout options for this board are quite limited. Just US English and Korean, which is where Leopold is based. Along with that, the included manual is entirely in Korean, though the table that explains the DIP switch options is easy enough to figure out. The seven key switch choices are nice, but really should include more, like MX Green and White. And finally, because Leopold isn't quite as well-known as other brands like Ducky or Filco, it can be hard to find places that sell its products. And some models tend to sell out quickly, like this one. But overall, I really like the FC750R PD. It's solid, well-made, and feels like it'll hold up over time. I paid about $120 US shipped, which is on par with, if not even a little better, than boards from its competitors. So if you're tired of dealing with a cheap mushy membrane keyboard or already have a mechanical keyboard and just wanna make a change, this Leopold is definitely worth a look. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Leopold",
        "Colin",
        "keyboard",
        "board",
        "DIP switches",
        "membrane keyboard",
        "DIP",
        "switches",
        "mechanical keyboard",
        "key",
        "membrane",
        "options",
        "boring membrane keyboards",
        "key switch",
        "Hey",
        "nice",
        "DIP switch options",
        "included",
        "switch",
        "switch options"
    ],
    "transcript_entity_values": [
        "USB",
        "Leopold",
        "Leopold",
        "Control",
        "Black, Silent Red, Clear",
        "CapsLock",
        "Korean",
        "about $120 US",
        "Aukey KM-G3 Blue Switch",
        "Instagram",
        "MX",
        "80%",
        "Scroll",
        "Seven",
        "Blue, Brown",
        "English",
        "US",
        "seven",
        "one",
        "Colin",
        "Cherry MX",
        "MX Green",
        "Twitter",
        "Ducky",
        "six foot",
        "87"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "MONEY",
        "FAC",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "LANGUAGE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL"
    ]
}