{
    "id": "1ueaqvpxQhE",
    "title": "How to Fix Joy-Con Drift on Nintendo Switch + JerryRig Studio Tour!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-11-21T14:15:24Z",
    "video_url": "https://www.youtube.com/watch?v=1ueaqvpxQhE",
    "category": "Howto & Style",
    "tags": [
        "joycon drift",
        "joy con drift",
        "joy-con drift",
        "jerryrig office tour",
        "jerry rig everything studio tour",
        "Nintendo switch",
        "repair joycon",
        "joycon drift repair",
        "joystick fix",
        "nintendo"
    ],
    "views": 936850,
    "likes": 46212,
    "comments_count": 2922,
    "description": "Today we repair some JoyCon Drift issues. For your chance to win a Tesla Model 3 Performance AND a dream house (or $1 million!) while supporting a great cause, enter at  (Unfortunately the code is not working - the Omaze team apologizes for the confusion.) Thanks to Omaze for sponsoring this video. The joycon drift has plagued many a gamer, and if warranty repairs or replacement joycons are in short supply.... sometimes you gotta just fix it yourself. Today my wife Cambry is going to show us how easy it is to replace the joystick inside if your JoyCon controller.   These are the replacement joysticks we used:  If you want to make your whole controller clear, check out this video:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://home.omaze.com/jerryrig",
        "https://amzn.to/2IQn9oY",
        "https://youtu.be/L3TeP1G5lO0",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So today we're going to do two things: one, we're going to fix the Joy-Con drift on our Nintendo Switch for about $15. It's super cheap and super quick. And the second thing is I'm going to give a quick little studio tour of where I film my videos. This video is sponsored by Omaze, but more on that later. But I'm not the one who is going to teach you how to fix the Joy-Con drift, we have a special guest today. You might remember her from our very difficult Black Shark phone. -[Cambry] Yep, still recovering. But willing to give it a shot. -Cambry, what is Joy-Con drift? -Okay, that is when this joystick kind of wears out and starts to drift to the left. Like it just kind of tends to lean this direction. Then your character, in my case Link, starts to drift, and it makes it challenging when I'm like going up a path, or I'm on the side of a cliff, or I'm trying to fight someone. It just messes everything up. -And we can't have that. So today we're going to fix it. It's actually very inexpensive. It's only like $15. And like we've gotten hundreds and hundreds of hours out of our Nintendo Switch. So we're not going to complain about it, we're just going to fix it. But first let me give you a quick little tour of the studio. I've never done like a little studio tour like this. It's kind of a cozy little room here. But I have my lights mounted up here on a DJ scaffold. All these lights I got for really cheap off of Amazon. And I think there's like five of them positioned in a circle around the room. And then the tripod, which is right here, goes up into some barn door rails, which I've attached to the DJ scaffold with some c-clamps...kind of, you know, jerry-rigging the whole thing together. Then I do have foam on the walls to kind of minimize the sound so there's no like echo in the room. We'll get to the camera in just a second. Inside of this closet I have a tool chest. And these are a collection of chargers that I've, you know, accumulated over the years. People always ask what I end up doing with all of my phones that are left over after my tests. And I turn most of them into big screen TVs for little squirrel houses. So coming around the desk...oh, actually, so this is a piece of paper in a giant roll that I just mounted to the side of my desk. I think I got this at like IKEA or something. So anytime the desk gets dirty, I can just unroll this piece of paper and have a new white clean surface to work on. You can see I've kind of collected some Mohs hardness papers. And then right here...so I use the GH5 to film. The lights in here are kind of bright. But what I want to show you is this screen over here gives me a live feed of everything that I'm working on. So if I move something here, it's moving on screen over here. And you can see it has some like green dots around the edges. That just is telling me that everything is in focus. And here is the back side view of the DJ scaffolding, the barn door rails, the tripod, which I can adjust up and down, and slide left and right, and then I can play with the lens right here on the end. And we have phones in various states of disrepair. Now this camera here is for the front facing, so you can kind of see what it looks like when I'm actually recording something where I need to be visible. When there's a camera back here, that's being displayed on the second monitor. Sometimes getting the perfect shot for your content is tricky, but this is the set up that works well for me, and it was relatively inexpensive. I didn't need to go out and buy tons and tons of tons of equipment. It's a DJ scaffold, some barn door rails, and a tripod hung upside down. So hopefully that doesn't ruin some of the magic for you. But I think we should get started with the Joy-Con. -Let's get started. [Intro] -So a long time ago I made a video on how to turn your Joy-Con Switch clear. So if you're wondering why mine's a different color, that is why. So this replacement kit surprisingly only costs $15, and it even came with a bunch of tools. So I'm not going to use my own tool set, we're going to use the tools that came with the joysticks and see if they are any good. There are 4 screws on the back cover, and these are tri-point screws, meaning they are not a Philips head, they are like a Y shaped almost. -Once you take out the 4 screws, then you open it up with your handy-dandy pry tool. Yes. And with this being transparent, it makes it a little easier to know you're not going to hurt anything. You can see exactly where your pry tool is. -You're welcome. -Then you open it like a book. There we go. And it looks like someone's been here before because the battery's already loose and that's the next step. Whoa. -Looks good. I always keep a bunch of extra pry tools here off to the side. And so I'm going to focus this right now to make sure that the charging port area is focused. And now she is good to go. -Okay, so then I'm going to slide this little guy like a little Lego. Then I take my Philips screwdriver and I get those three...see they are like gold screws. One, two, three. Now you're going to lift out this little covering that holds the battery pack. But it's still attached so you just open it up and keep it close by. -Phew. -Okay, then this part gets a little tricky to me, but I'm sure I'll be fine. You have to like unhook these ribbon cables. So you don't rip them. That would be bad. You have to unlock them. So this one, you like flip a switch. Flip the third switch This guy should be free. -It's been a while since I've done this so she's teaching me. -Free. Switching tools up. Okay, and now this one should come out. We're replacing this piece anyway. There we go. So there's this little ribbon cable that's like weaved across here with this little plastic piece. So I'm just going to gently get it back out a bit. And now, there are two more screws. This is the guy that was making me die. -Sure, blame it on the controller. There is a gasket underneath the joystick thing that we need to leave in there because the new joystick does not come with the same gasket. So we can just toss away the old one and, let's grab the new one. -Okay. So it actually comes with two which is nice because I play a lot of Zelda. Might be doing this again. -Right now only one of our joy-cons is drifting though, so we're just going to the left Joy-Con. The right Joy-Con is pretty similar, just a few different connections in a few different spots cuz there's different hardware inside each of the controllers. -Reverse the steps we just did. Fold this ribbon cable back a little bit. And by fold, I don't mean actually fold. Like just lift it. Alright, it's in place. Take your Phillips screwdriver, place the two screws back. Righty tighty. Okay, now that that's secure we can put our ribbons back in place. -The trick to getting the ribbon cables back in is making sure that the metal tweezers don't touch the gold contacts on the end of the ribbons because those can scratch off and make the Joy-Con nonfunctional again. And we have to line the little tiny ribbon up with the very small little slot in the board. And once that's done, we can take the black little latch and latch it down into place. -Okay. Cool. Is it killing you that it's taking me so long and you could do this in two seconds? -I mean...of course not! -Hey. Beginners gotta start somewhere. Okay. So much better than the Shark. -The spring can shoot off into oblivion, so make sure you know where that's at all times. -Snug as a bug. Put this little Lego back. Now, righty tighty. One screw. -Everything is installed. She has the final screws in place. Now it's time to see if Link still runs off cliffs or not. Is it working Cambry? -Sure is. -Not falling off any cliffs? -Nope. Going to the right. Going to the left. Going uphill. -I do have one question for you though. Why do you have two screws left over? -Did you plant those? -No! [Laughing] Where do they go?! -This had...you put these here. -I did not. We're going to have to re-watch the footage and see where those came from. But other than that, Cambry did a great job. Maybe they did roll across the desk because I do have a lot of projects going on, so we can't blame it entirely on Cambry. -I think it's a different project. -It is pretty funny though. Oh, they came from this. -Okay. Yeah, let's clarify that. You made me look bad. -You want to clarify Cambry? -Yeah, the screws came from the bag in case yours broke or something. Backup screws. Oh gol. -Still pretty funny though. Anyway, we were successful. Cambry, which was the hardest part? -Getting the ribbon cables in. That was tricky for me because I was so worried about scratching them. I didn't scratch them. Long live Zelda. -So like I said earlier, this video is sponsored by Omaze. Omaze works with creators while supporting non-profits and giving away super large prizes. And this time I've partnered with Omaze to give you guys, my viewers, a chance to win a Tesla Model 3 Performance. And that's not all. This time around there are thousands of prizes being given away, which lead up to the grand prize of a dream home in Orlando, or a million dollars. So for every entry you make to win the dream home or the million dollars in cash, you also get entered to win one of these other 3,000 prizes, my favorite of which being the Tesla Model 3 Performance. The taxes and shipping of course are always included, but you're not just getting an entry to win a prize, you're also supporting a non-profit. The great cause this time around is the Children's Miracle Network of Hospitals. They are a non-profit organization that provides support to children's hospitals across the USA and Canada, providing healthcare to more than 10 million children every year. So it's a win-win for everyone. You get entered to win a Tesla Model 3 Performance, a home, or a million dollars in cash, and a portion of the entry money goes to support a good cause, you know, providing healthcare to millions of children. To enter just go to Home.Omaze.com/JerryRig, or go to the link in the description. And if you use the code UNWRAP300 it will give you an additional 300 entries into the giveaway, all part of Omaze's Black Friday activation. Huge thanks to Omaze once again for sponsoring this video. If you have any questions leave them down in the comments. And Cambry will be happy to answer them for you. -I will not be fixing anyone else's. This is a one-time deal. -Remember how we end off? -Thanks a ton for watching. We'll see you around.",
    "transcript_keywords": [
        "screws",
        "back",
        "kind",
        "Cambry",
        "JoyCon",
        "Omaze",
        "JoyCon drift",
        "Tesla Model",
        "ribbon",
        "Nintendo Switch",
        "Switch",
        "drift",
        "left",
        "give",
        "ribbon cables",
        "time",
        "tool",
        "tools",
        "place",
        "win"
    ],
    "transcript_entity_values": [
        "Orlando",
        "Nintendo Switch",
        "Black Shark",
        "an additional 300",
        "Lego",
        "Omaze.",
        "Cambry",
        "Friday",
        "two",
        "the Joy-Con",
        "15",
        "hundreds and hundreds",
        "three",
        "Philips",
        "thousands",
        "only one",
        "4",
        "Phillips",
        "Amazon",
        "only like $15",
        "about $15",
        "jerry",
        "more than 10 million",
        "USA",
        "five",
        "Canada",
        "millions",
        "a million dollars",
        "first",
        "second",
        "3,000",
        "Omaze",
        "today",
        "Omaze's Black",
        "two seconds",
        "third",
        "-Cambry",
        "IKEA",
        "GH5",
        "One",
        "the million dollars",
        "Miracle Network of Hospitals",
        "Zelda",
        "every year",
        "one",
        "Joy-Con",
        "the years",
        "Tesla Model 3 Performance"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "FAC",
        "TIME",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG"
    ]
}