{
    "id": "1ugJ1BJx0HE",
    "title": "The SCAM of Wireless ESD Straps - Feat. ElectroBOOM",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-08T16:53:49Z",
    "video_url": "https://www.youtube.com/watch?v=1ugJ1BJx0HE",
    "category": "Science & Technology",
    "tags": [
        "ESD Strap",
        "ESD Bracelet",
        "ElectroBOOM",
        "Anti-Static Wristband",
        "Static Electricity",
        "Wireless ESD",
        "Wireless Anti-Static",
        "Don't get scammed by wireless ESD straps",
        "Static Prevention",
        "static discharge",
        "ESD Band",
        "Do ESD Straps work?",
        "do I have to wear an ESD strap?"
    ],
    "views": 4996865,
    "likes": 185532,
    "comments_count": 7109,
    "description": "Better sleep makes a better you! Check out Eight Sleep at   (code LMG) for $150 off the Pod Cover  For a limited time, download Asphalt 9 Legends and get a free Lamborghini Revuelto! Check it out at   We put wired and wireless anti-static wrist bands to the test with help from ElectroBOOM. Its not just about shocking Linus, its educational, too!  Special Thanks to ElectroBOOM, check out his channel here:   Buy an iFixit Anti-Static Wrist Strap:  Buy a DESCO Wrist Strap Tester:   Purchases made through some store links may provide some compensation to Linus Media Group.  Check out ESD Standard Documents: ANSI/ESD S20.20-2021  ANSI/ESD S1.1-2021  IEC 61340-4-6:2015  *Paid Downloads  Discuss on the forum:     GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:58 ESD Strap Design 2:28 Multimeter Test 4:47 ElectroBOOM's Tests 6:25 The Struggle is Real 7:25 More Testing 12:44 Feeling the Wind 17:22 What about wireless? 23:00 What's Inside? 28:49 Outro  #LTT #electroboom",
    "description_links": [
        "https://www.eightsleep.com/lmg",
        "https://gmlft.co/LTTA9",
        "https://www.youtube.com/channel/UCJ0-OtVpF0wOKEqT2Z1HEtA",
        "https://lmg.gg/4wNU0",
        "https://geni.us/15lUu",
        "https://lmg.gg/HYJU0",
        "https://lmg.gg/bl5Yo",
        "https://lmg.gg/ChRWr",
        "https://linustechtips.com/topic/1499534-do-wireless-esd-straps-work-feat-electroboom/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Ow! It is never fun to be on the business end of an unexpected shock from a door handle, ow, light switch, or masochistic electrical engineer. As many of you know, this is called electrostatic discharge or ESD. And it can happen when two differently charged objects are brought close enough together to overcome the insulating properties of the air between them. It takes a discharge of at least 2000 volts for us to feel a zap. But as little as a hundred volts could potentially damage sensitive electronics. That's where these come in. Anti-static wristbands are designed to prevent this buildup of static on your body. But if you've seen more than a handful of our videos, you'll know that we're pretty lax about actually using them because being tethered is kind of annoying. But there's a solution for that. This, actually these, wireless anti-static wristbands are supposed to keep you grounded without connecting to the ground. It sounds too good to be true, which is why we asked Mehdi from Electroboom to help us find out if these really work. I'm here to help Linus. Yeah, last time I was here, I couldn't feel anything for a week. Test Linus, I'm here to test Linus. I mean, not test him, test with him, whatever he wants to test. This is to roll the clip. Ah, damn it! Shut up! Okay, ah, ah, ah, ah, ah! Don't worry, I won't feel a thing. And you won't feel a thing with this gentle segue to our sponsor. Asphalt 9 Legends. Get behind the wheel of your favorite cars and race across 185 tracks in 13 real world locations. Asphalt 9 is giving a free Lamborghini Revuerto on Android and iOS for a limited time. So download Asphalt 9 today with the link in the video description. You might already know this, but the way these conventional anti-static wristbands work is pretty simple. The inside of the cuff has conductive threads woven into the elastic, which are physically connected through the buckle to the snap on the outside. With the cord snapped on and attached to ground, there's a direct path to discharge any static charge that would normally build up on my body. And a resistor in the cord protects you in case you accidentally come in contact with up to 240 volts by limiting the current to 0.5 milliamps. But how do we know they actually work? How can we test them? Before we get to our wireless options, let's test the traditional wired bands and make sure that we know what we're looking for. There are a couple of things you're gonna need. A multimeter and an electro boom. Intuitively, I would think a device that's designed to discharge static electricity would just be a wire, essentially. But when we do a continuity test on this, there isn't. Meaning that no current is passing, is my understanding? Current is passing, but it's so little that continuity doesn't show it. Continuity is made to test short circuit pretty much, right? Or very low resistances. But this guy has around one mega ohm of resistance in it, which we can probably check with that to see if it's there. I see. Okay, well, can we verify that? Yeah, I guess we press and check the ohm. And yeah, let's see. Oh, one mega ohm, exactly. Wow, good job iFixit. To two decimal places, your resistor is exactly what you say it is. We briefly touched on why the resistor's there. It's to protect you from high voltage. But why on earth would I ever encounter high voltage when I'm wearing an ESD strap? Well, the thing is that if we are working on electronics and accidentally touch live wires, for example, you don't want your body to be shorted to ground. Otherwise there will be a ton of current going through you. And the one mega ohm resistance in there is there to limit the current through your body. Got it. So this is just in case I screw up, not in case the laptop that I'm repairing, something happens. Yeah, but at the same time, the electrostatic on your body is so small that one mega ohm, although it sounds too big, it is enough to quickly dissipate the electrostatic. Hold on a second. What you're saying then, to quote there's something about Mary, is there's a chance. I'll just, I'll, I'll, I'll. Back to our conventional one for a second though. We've already measured that the strap works, but how do we know that the contact with me is good? Can we measure that? Well, actually, from what I understand, even this strap, even this band has a little bit of conductivity. I mean, everything is conductive for high voltage anyways. So there is some stuff in there that even when I touch that, my body loses charge. How do we test it though? Oh, we test it by charging you up with this thing, which, yes, puts enough charge on your body and we can see if the charge goes away with that. Okay. All right. Theoretically, I am protected from your contraption right now. Right. Do you, that? Wow, that was a long arc. That was nice, but we don't want to use this, do we? We want to use this one. Fine. One thing is that stuff I make are not made for production. So hopefully it won't fail. If it does fail, I hope it at least fails in an entertaining manner. That I can count on with you. Yeah. Okay. It's alive. It's really antsy. Now we can bring the back of your hand close to this thing and feel the charge. Whoa. You feel it? Good. Yeah. Okay, so it's working then. The panty hose is working. There you go. Okay. All right, but how do we build up a charge on me then? So should I be, oh God, should I be touching that? Cause we're trying to demo that the ESD strap makes it so that I can safely be rubbing my feet around on the carpet and work on my computer, right? Yeah, sure, yeah. Okay, well. Don't touch the computer first. How much is it going to hurt to touch that? Like if I touch it constantly. When you go close to it, it hurts. At some point you can't put your hand on it. Okay, that's really not encouraging the way you're, ow! So I have to do it on purpose and then hold it there. Right, yeah. Okay. Why do we collab with this guy? Oh, that's because it's fun. No! It really hurts. Okay. How fragile is it? Like, can I just like go in there? Not made for production, I already said that. You're going to destroy it. Just lightly touch it. Okay. You can do it. I believe in you. Ah, I'm sweating right now, I'm sweating. Okay. Damn it. Okay. Ah, I can feel it, I can feel it from here. It just arched me from that far away. Okay. There you go, there you go. Ah, yes, yes. Ah! Okay. Now your body is picking up charge from that. Right. And then if you touch your computer, your computer is grounded, right? Okay. There is no discharge. This ESD wristband works perfectly. The initial discharge was high voltage, low current, right? Yes. But then now that I'm touching it, you said the voltage stays? Very low, maybe close to zero even. Okay, but whatever it is, whatever voltage it's at, it's very little current, right? And it's going through my arm, through my wrist strap, through this cable, and then into the ground, into this doodad that we have plugged in. That means this is all safe. I could handle electronics all day. Get me something expensive. Okay, like this laptop. This is fine, what I'm doing right now, right? You better not disconnect your wristband from ground now because your laptop is not connected to ground. If you disconnect your wristband right now, your body and the laptop will pick up charge. When you put your laptop on the ground, there will be a huge discharge, killing your laptop in the process. Okay, so take this before I take off the, cool, which means as long as the strap works, everything is good. However. Okay, you should stand on some plastic or so you can't stand on that, it's solid, so that you actually pick up charge. Ah, no, ah, why would you do that? It works. Ah, okay, I'm letting go. Let's say instead of a pantyhose running through a motor, right? I'm walking around on a carpet and then I'm standing still for, let's give it a solid one, two, three, four, five steamboats, I go and touch my computer. Ah, and the hair stands on in my head. Actually, did your hair stand up when you were touching it? Yeah, I could feel it back here. You probably couldn't see it, but I could feel it. Now, do you want to try the same thing with my magic wand that is more powerful? I mean, not really, but I did drag you all the way out here. This looks like it does all kinds of interesting things. Yeah, well, I mean, I wiped it this morning, so you can use it. It had some suit on it. Just don't put it in your mouth, right? Burn marks and stuff, so. What have you done here? This is a flashlight, right? Yeah, I bought a flashlight at some point. At Home Depot, yeah, and I took the guts out and put my own electronics in it, pretty much. Ah-ha, and what is all of this? Are you stepping up the voltage, or what are you doing here? There is something here that makes, what, like eight to 10,000 volts AC, and this is like a network of capacitor and diodes that, yeah, steps it up to over 100,000 volts. It's not an extra static discharge level. Even in the standards, you test up to 20 kilovolts. So 100 kilovolt might be an overkill, but more fun. Can you just explain something to me real quick here? I saw you take the cells out of this earlier. They're just standard 3.7 volt lithium, whatever. So, but you pointed at this and said, blah, blah, blah, something AC something. Okay, can you explain that? Is this an inverter of some sort, or? It is a circuit called a ZVS. It's basically an oscillator and a transformer that increases the voltage of that oscillator. The oscillator makes like three times eight, 24 volts. And then that 24 volt AC is amplified through the transformer to say 10,000 volts. And the 10,000 volts, every step goes up to, it's like 15 there. So it should make 150,000 volts or something. So you said, your story keeps changing, sir. You said 100,000, now you say 150,000. What are you going to hit me with? I'm going to hit you with this. Well, the thing is that, yeah, no, the high voltage runs like you can turn it on. Don't point it at any of your devices. Just point it towards the ground or something and just turn it on. You will hear the electricity going on out of it. I don't want to turn it on. Well, don't point it to your face. You'll be fine here. And my face too. There you go. That's the sound of electrons jumping out of the tip of it. So. Explain to me what's happening there because we talk about static arcing through the insulating properties of the air, right? Yes. But this just jumps into the air. What is it jumping to? Air. Into the air. Well, yeah, I mean, the voltage is so high that it pretty much tears the charges away from the air and it just charges go, like, how can we, I mean. Because even lightning, right, has to go arc to something. Yeah. But I mean, that's what's happening with the lightning. The charges start going and until they say you reach a ground, they create a channel that is ionized and then the whole thing goes through. Yes. I see. So this is basically pre-lightning. So like, if I pointed at you at a distance, you will feel the wind coming out of it. It creates a wind when the charges go. Okay, now I want to feel that, actually. Nor do I. I mean, as long as you are from a distance. You feel anything yet? Well, maybe you should be connected to ground. Ground yourself, man. Should I? Yeah, because that way more charges come toward you and maybe I touch the ground as well. Feel anything? Whoa. Is it coming? Good. So that's the wind I was talking about. The charges are running away from it and, you know, it ionizes the air to the same charge that is on the tip of that and they try to get away from each other because they are the same charges and it creates a wind. So, yes, now that we are at that point, you stand on that thingy. Do you want to show that, actually, that what are you standing on? Yeah, sure. It's a milk crate because everyone on my crew and everyone who comes to visit likes emasculating me. So you can hold this, touch a ground with it, basically, touch the tip to a ground. Okay. And turn it on, disconnect it from the ground and then turn it off. So turn it on now? Yeah. Keep it on or I can already hear you discharging to something. Don't have your hand too close to that thing. Wait, am I charged now? A little bit. I can hear you. The charges are running away from you. Oh, yeah, you were too. Ow, now I am charged. Damn it. Wait, why am I charged? Well, this handle is ground of this thing and that side is the output high voltage, whatever. Is it a negative or positive? I don't remember. But yeah, so it is moving the charges from your body to the ground. So you get charged, so charge yourself. So what, whoa, holy shit. This ground wire. Did you see the, do you want me to, do I have to hold the button? I only pressed it. Yeah, if you press it once, it charges you to some extent. That wire like attracted to me. What? Yes, don't let that wire get too close to your parts. Okay, okay, and what are we testing now? What was the point of this? So now that you're charged, you can let go of the ground there. So just, yeah, now you're completely floating charged. Okay. Without a strap. And now with that, if you touch any electronics, you will discharge to it and hurt it. You can touch your computer now probably. Whoa, I hurt it. There you go. Okay, so what do I do? What do I touch it to? Touch it to, not yourself. Okay, so now I can put this down. Well, you're already discharged far gone. There is nothing. Okay, it works. Yes, wired strap works. Which means that even though Mehdi and I showed last time that ESD discharge onto a computer component won't necessarily kill it immediately. We know that companies like Intel, AMD, NASA, for that matter, follow these safety protocols because particularly during manufacturing, these components can be more susceptible to this kind of damage. And that's why the industry has standards for what these protections are supposed to look like. For example, this little guy right here from Desco, whoops, is a validation tool for making sure that your ESD strap is working without needing one of these, though, thank you very much. You should use that one, whatever. All you have to do is plug it into the wall, then plug in your anti-static strap, either directly or through an extension like this that you can then clip onto your ESD safe workspace. And then all you need to do is touch this right here and it says test good. That means that the resistance of your ESD strap is between 850,000 ohms. And I think, what was it, about eight mega ohms or something like that, which is the ANSI standard. With all of that in mind. No, I mean, my way is more efficient, quicker, and it's a little cheaper probably. It is actually cheaper. This thing is shockingly expensive and not useful for testing all types of anti-static straps. What with the magic wand. Let's talk about these. If you don't have a wire coming off of it to plug into your ESD tester, how can you validate if it is working correctly? That's where the magic wand comes in. That's what I'm talking about. This baby is good, yeah. That's actually the reason this collab got off the ground because we were trying to figure out how on earth to either validate or debunk these things. Yeah. What is our test? The test is you wear that, you charge yourself, you charge, discharge. I mean, you touch an electrical component or whatever and see if you survive. That's the test basically. No, I'm making you do a test too though. One of us is gonna do the bro- Haven't I suffered enough? No, I think I've suffered more than you today. One of us is gonna do the bro anti-static and the other is gonna do the made in Japan Livestrong bracelet. Which one do you want? Does it even matter? Sure, I'll go with the anime one. No, okay. Blue or black? Black. Okay. I don't even know how this stupid strap is supposed to work. What is in this piece of plastic even? It looks like there's some little metal, like kind of, like dust or powder or something in there. It looks more like glitter, really. It looks like a joke. Bro is on. Bro. Does it have to be that one? What about that one? That one doesn't look as threatening. No, it doesn't work anymore. We learn by pain. Well, wait, wait, wait, hold on, hold on. Cause this is not realistic. So we're not really giving this a fair shake unless we give it a more realistic charge, right? Well, I mean, yeah, sure. I mean, that even managed to zap me through this thing. Right? Fine. Okay. I'm trying to see if your hair is rising or not. No, not too bad. Are you charged at all? Ah, oh yes. You're charged. Good. I mean, spoiler, but. Ah. It did discharge. Okay. Hey, you have the wristband on you, so you should be fine. Yeah. Damn it. Just do, ah. Okay. Good. Okay. You can turn it off now. I can feel the hair rising on my arm. Good. Raising, excuse me. Now your body has charged. Theoretically, this is helping. I'm going to give it like five more seconds to dissipate into the thing. Into the, at least, or wherever. Don't come closer. Oh, that's not a good sign. Ah. Not a single electron left your body, it seems. Through that thing, at least. If you have other pointy parts on your body, you could probably run away. Okay, well, let's see if yours works. Oh, you could have started with your hand on it. There you go. It's done. I don't have any hair to raise on my head, so. Okay. I mean, that seems probably pretty good. Okay, now we let the country of Japan do its magic. I can hear him from here. Oh, it's, it's, it's my wires. See, do you? Oh, it's his, his lav wire is grabbing the table. Yeah, it's like, it's touching those wires. That's where you are hearing it. Thank God, they have some insulation on them. Ready? How was that? I heard it. I heard it in my butt. Okay, ready? Ow! Ow! Even my hair. I told you that, I got it on the hair too with that one. That was, that was a lot. Even, even you touching my butt didn't discharge it. Oh, I didn't touch it. I just got close and it was just, it was leaping across my brain. I felt something leaving me, so. Yeah, so yeah, there you go. The Japanese wristband, wireless wristband was. Is it still worth testing with this one? Sure, okay, you want to try that? Oh, okay, let's do it. All right. Let me move this thing away. Who knows, maybe it'll work even better with higher voltage. Whoa, I can feel myself powering up. I held it for a couple of seconds. Don't put it down. You may discharge yourself to something. Oh, I see. Like this. Oh! Did you catch that spark, David? I bet the editor will have it. Let me see if I... Whoa! I won't touch it, but if I'm close to you, I need to do that. Why? Probably you'll feel something. I don't feel it. What are you doing? What are you doing? Why are you doing this? We are going to both hurt. My hair is standing up. Oh yeah, your hair is... Ah! We should have a video of your hair that is raised, and as soon as you touch it, it drops to zero. Yeah, just... Okay, shake your... Oh, there you go. Yeah, yeah, yeah. It went up this time. Yeah. Yeah, you can have a scene. Okay! All right, your turn. Your turn. Team Japan. Me? I don't have hair, though. Team Japan. No, you don't have to do the hair thing. I just want to see if the Japanese one works better. Okay, fine. So-called made in Japan. It's still there. I feel it. Japan, come on. Ready? No. Okay, so what is their claim with these things? Should we take it apart and see what's going on here? I really like to see what is in these Japanese things with this glitter bomb at the bottom. Sure. Okay, so we'll use this one on the made in Japan thing to get it apart, and then in the meantime... Oh, yes. I also have... This one is already right? Well, yeah. A bunch of them, actually. Yeah. Oh, good, good, good, good. How do I open it without damaging the fancy contraptions inside the room? We want to see inside. We want to see them, though. Just go for it. Yeah, but it's so complicated. If I open it like that, we are going to damage it. And like people will say, oh, is that all the hair or something? No, it's just like the plastic. Yeah. It's just discoloring from being stretched. Let me cut maybe more of the centers. Yeah, cut a cross section. Yeah, yeah. I'll do it without cutting myself, maybe. Wait, that's it? Yeah, yeah. Where is it? It's just molded silicone. Well, it's pretty on your hand, I guess. What I mean? What? Is it conductive, maybe? Maybe you can use your multimeter to see if there is any conductivity inside of it at all. Or on the surface or whatever. Sure. Yeah. Why don't we do that first, then? And then we'll open this one up after. Okay. So show me how we... How do we test that? Even the here and there, is there any conductivity? Overload. Nothing. Oh, okay. So basically the resistance is very high, then. What if I get very close? No, there's nothing. Well, I mean, this thing is probably goes to giga ohms and it's not seeing anything and nothing inside, too. It does go to giga ohm. One giga ohm. Yeah. So this is just glitter embedded in silicone, then. Oh, this is the package. Germanium titanium. Shower. Shower. Okay. It's okay for shower. Oh, you can wear it in the bathroom. Well, when taking a shower. This guy has it around his neck. We have to connect the handle of this thing to one side and the top of this thing to the other side and see if it jumps between the whole thing or not. Oh, I see. We just need a piece of wire here. I have some stuff. Okay. So theoretically, what happens when I press the button now? Well, if those glitters are conductive, it might jump, you might see an arc or something. I don't see anything. It's going, but it's not arcing. Maybe you can get closer and closer. At some point, it may jump. I think it's just jumping directly. It's just going through the air. That glitter is not titanium germanium. Worse than air, basically. It's worse than air. It doesn't even bother going through the wristband yet. It's worth noting in all of the discussion of BS wireless ESD wristbands that even wired ones are not necessarily within spec. This one, for example, is not to spec, not because you won't be able to dissipate any electrostatic buildup on your body, but because it is conductive inside to out, meaning that in the event you were to accidentally rest your wrist against something that had a current flowing through it, you could easily cause a short. Yeah, I mean, I just wanted to say that that's true because even with my wedding ring, I accidentally touched some power lines and blew up some stuff. So you definitely don't want that around you. Now let's take a look at the bro. The bro may actually be the less snake oil of the two. And there is a resistor connected on one side to, I suppose, the metal underneath and on the other side, it's just floating. No, it is not connected to the metal underneath. It wasn't just sitting on the plastic. For God's sake, man, what was that? They just pour some electronics, sprinkle it in a box and say it's electrostatic discharge protector garbage. My God, it's not, it's not even adhesive backed. It is just, wait, oh, you know what? No, the screw must be connected to that side. Oh yeah. And then there's a resistor and then it just goes to a little piece of rubber. What's the value of this resistor though? Let's see if I can see. My old eyes. I can take a picture. There you go. There's a brown, black, and green means one mega ohm. Oh, okay. So you can probably check it with your meter too. Oh yeah. Let's do that. I mean, for all we know, this could be not even a real resistor. Maybe they burned it first and then put it into effective resistor. It's a magic resistor. The value doesn't matter. Yeah. It is one mega ohm. Yeah. Yeah. I mean, not as tight tolerances. Oh, actually that is. Yeah. That's how it works. Yeah. Okay. So I guess with the purchase of this rest band, what do you get? A one mega ohm resistor, a box you can hold your powders in. Your mega ohm resistors in. Your components. Yeah. Yeah. And it's so convenient because you can wear all the resistors that you need and they're just right there. Yeah. You just open it and solder it. It's convenient holder for your components. Yeah. And this is a convenient segue. To our sponsor, Eight Sleep. Trust me when I say sleep is important. You don't want to be like this guy waking up in the middle of the night. So try out Eight Sleep. Temperature is one of the most important factors in improving your sleep and Eight Sleep's products allow you to control the temperature on both sides of the bed independently. It's adjustable from 55 degrees Fahrenheit to 110 degrees Fahrenheit, which is perfect for partners with different preferred temperatures like me and my wife, all of their features such as temperature control, vibration alarm, and sleep pattern insights are easily accessible through their simple app. I've personally been using the pod cover and now you can get one too. Head over to the link below and check out Eight Sleep and use code LMG for a nice discount on the pod cover because sleeping better is living better. If you guys enjoyed this video, the obvious one to go check out is the last time we collab. There's actually two videos. There's one on our channel. There's one on Electroboom's channel. Both of them are awesome. Two kind of different perspectives on the challenge, which was our attempt to kill components with an ESD discharge gun. Now, how did that gun compare to this thing? Well, that one was regulated to be the least. This is nuts. I mean, if your device survives this, then you're passing everything with flying colors.",
    "transcript_keywords": [
        "Yeah",
        "thing",
        "touch",
        "ground",
        "feel",
        "Test",
        "ESD",
        "charge",
        "good",
        "discharge",
        "body",
        "charges",
        "hair",
        "ESD strap",
        "strap",
        "voltage",
        "ohm",
        "mega ohm",
        "works",
        "resistor"
    ],
    "transcript_entity_values": [
        "two decimal",
        "one",
        "240 volts",
        "iFixit",
        "second",
        "Home Depot",
        "100,000",
        "AC",
        "four",
        "a couple of seconds",
        "13",
        "185",
        "first",
        "100",
        "10,000 volts",
        "eight",
        "9",
        "One",
        "close to zero",
        "3.7 volt",
        "Eight Sleep's",
        "Two",
        "a week",
        "like eight to 10,000 volts",
        "Mehdi",
        "Japanese",
        "zero",
        "giga ohm",
        "Eight",
        "ESD",
        "0.5 milliamps",
        "all day",
        "Asphalt",
        "9 today",
        "150,000",
        "today",
        "Japan",
        "David",
        "Electroboom",
        "ESD",
        "five",
        "up to 20 kilovolts",
        "Livestrong",
        "a ton",
        "24 volts",
        "ANSI",
        "55 degrees Fahrenheit",
        "150,000 volts",
        "AMD",
        "24 volt",
        "Lamborghini Revuerto",
        "15",
        "LMG",
        "Mary",
        "three",
        "Eight Sleep.",
        "Team Japan",
        "NASA",
        "five more seconds",
        "Linus",
        "110 degrees Fahrenheit",
        "Desco",
        "this morning",
        "between 850,000 ohms",
        "two",
        "at least 2000",
        "Intel",
        "about eight"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}