{
    "id": "1VSAGy3-30I",
    "title": "Inside Byton's electric car with a 48-inch screen",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-01-09T14:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=1VSAGy3-30I",
    "category": "Science & Technology",
    "tags": [
        "byton",
        "m byte",
        "byton m-byte",
        "m-byte",
        "byton electric car",
        "byton m byte",
        "electric car",
        "ev",
        "electric vehicle",
        "tesla",
        "chinese startup",
        "startup",
        "electric",
        "car",
        "byton car",
        "first look",
        "first ride",
        "first drive",
        "ces",
        "byton ces",
        "ces 2020",
        "ces byton",
        "byton 2020",
        "2020",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge",
        "byton ces 2020",
        "byton suv",
        "suv",
        "electric suv"
    ],
    "views": 275431,
    "likes": 4257,
    "comments_count": 290,
    "description": "Chinese EV startup Byton returned to the Consumer Electronics Show this year with its electric SUV, the M-Byte. The Verge's Sean O'Kane got a chance to drive the M-Byte and see what it's like to be behind the wheel of a car with a massive 48-inch dashboard display.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2sT6oBQ",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everyone, this is Sean O'Kane from The Verge, and I'm about to drive the Byton M-Byte electric SUV. Let's go for a ride. (door closing) (upbeat music) Now in case you don't know who Byton is, they're one of the many EV startups around the world, that are trying to bring an electric vehicle to market. They're based in China and they basically made their public debut here, at the Consumer Electronics Show in 2018, where they showed off a concept version of this car. Now they've spent the two years since then, refining the car and getting it ready for mass manufacturing at their plant in Nanjing, China and the version that I got to drive here today, is the second pre-production prototype to have rolled off that factory line. Now Byton's whole thing isn't about really crazy performance or super high luxury, what they really are talking about doing with their cars, is changing the whole paradigm around user experience. And the focal point of that is obviously that massive screen. It's the first thing you notice when you look at this car. It's 48 inches long and it stretches from pillar to pillar. It's a very divisive thing and a lot of people have been really worried about what it would be like to drive with a screen that big, in front of you. And I gotta say, just from spending a couple minutes in the car, I can understand how you might be able to literally look past it. The screen is enormous, but it's sunken into the dashboard and Byton's also done a lot of work on the software side, to make sure that it's not so distracting. You can turn off all the widgets that make up the user interface, for example. And some things, like the news feed widget, won't update while you're driving. You also can't watch video while you're driving, which is probably a good thing. In fact the thing that I probably found more distracting than anything, is the screen on the center of the wheel. It was a little bright in the pre-production prototype and I'm sure you'd be able to turn that brightness down in the final version, but even if that's the case, it's just right there in front of your vision. There is another screen, coming off of the center console, but I never really noticed that. The weirdest thing about this whole experience is that we've just never had this kind of experience before, in a car. So it's hard to really get a sense of how all of this is gonna play out, 'cause there's just so much going on in this interior, in a way that no other car has ever thrown at a driver. That it really is going to take this car getting into the hands of people, before we understand what kind of impact all this technology is gonna have on people. The whole pitch that Byton is trying to make is that this technology will gain even more value, if and when it's able to come up with partially self driving technology or fully self driving technology. But that's a long way off, so in the meantime, Byton's gonna have to do a lot of work, as this car comes to market later this year, in convincing people, and honestly, just teaching them how to use this car, the right way. And the screen isn't the only thing that Byton's trying to sell as a new idea. They're also talking about doing a lot of health data integration, collecting a lot of information about the driver, and using advanced technologies like facial recognition. A lot of stuff that people are actually kind of wary about now. So in that sense, trying to sell people on the idea of a giant screen in the car, doesn't actually seem like that crazy of an idea. And Byton's not the only one trying to convince people of this idea. A lot of automakers, both start ups and traditional OEMs, are also moving in this direction of bigger screens. And so in a couple years' time, it's not just going to be up to Byton to answer the question of whether or not we should have big screens in cars. It's gonna be up to, basically all of us. To make sure that you can turn off some of the elephant. Elephant (laughing). Oh it is CES day two. Hey everybody, thanks for watching. If you wanna see more weird, electric cars, and everything else that we've seen here at the Consumer Electronics Show, go to YouTube.com/TheVerge and click subscribe.",
    "transcript_keywords": [
        "MByte electric SUV",
        "Sean O'Kane",
        "Byton",
        "Byton MByte electric",
        "electric SUV",
        "car",
        "Consumer Electronics Show",
        "screen",
        "thing",
        "lot",
        "Byton MByte",
        "people",
        "Verge",
        "SUV",
        "Sean",
        "Consumer Electronics",
        "Electronics Show",
        "MByte electric",
        "cars",
        "driving"
    ],
    "transcript_entity_values": [
        "Byton",
        "CES",
        "one",
        "today",
        "the Byton M-Byte",
        "Sean O'Kane",
        "a couple years' time",
        "EV",
        "two",
        "the Consumer Electronics Show",
        "Nanjing",
        "China",
        "a couple minutes",
        "the Consumer Electronics Show",
        "2018",
        "second",
        "later this year",
        "first",
        "the two years",
        "Elephant",
        "The Verge",
        "48 inches"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "FAC",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "EVENT",
        "GPE",
        "GPE",
        "TIME",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY"
    ]
}