{
    "id": "1y82uv1Rdp0",
    "title": "How Much Money Does Microsoft and Apple Pay Me? - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-06-02T18:53:54Z",
    "video_url": "https://www.youtube.com/watch?v=1y82uv1Rdp0",
    "category": "Science & Technology",
    "tags": [
        "How Much Money Does Microsoft and Apple Pay Me? - Krazy Ken's Tech Misadventures",
        "Microsoft",
        "Windows",
        "Windows 10",
        "PC",
        "Jonathan Morrison",
        "tldtoday",
        "Tech Influencer",
        "How much does Microsoft pay?",
        "How much does Apple pay?",
        "Mac",
        "macOS",
        "iOS",
        "Apple Keynote",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Computer",
        "Tech",
        "Computer Clan"
    ],
    "views": 29302,
    "likes": 1655,
    "comments_count": 150,
    "description": "How much money does Microsoft and Apple pay me? I've been asked this question a few times (especially recently) and I wanted to make a quick video about it! Let's take a look.  Join our channel and get cool stuff!   Watch my Windows 10 (Version 2004) tour   Learn about rare Apple prototypes   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - How Much Money Does Microsoft and Apple Pay Me?  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program. *not all Patreon tiers qualify for all rewards #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2JGWYhz",
        "https://bit.ly/clan35QSdMC",
        "http://bit.ly/clan2O2lYoe",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(computer mouse clicking) - I've received a lot of questions lately, particularly about money and being a YouTuber. Specifically, the questions are like, \"How much does Microsoft and Apple \"pay you as a tech YouTuber?\" I thought today I would break it down and give you the answer. (upbeat electronic music) (upbeat electronic music) Hey guys, how are you all doin'? Really, that's just great. You know, I'm doin' pretty great today too, because today, we're gonna talk about money. I've been asked this question a lot, and frankly, I haven't tracked down all of the comments where people have asked me this question, but there was a recent influx of them on the comments section of my Windows 10 version, 2004 video. I'm sure it's just people having fun, and maybe being a troll sometime on the YouTube comments section, but a lot of people were asking, or accusing me of making an ad for Microsoft. This isn't the first time this kind of thing has come up, and it hasn't come up just in regards to Microsoft stuff, it's come up in regards to Apple as well. The short answer to the question is, nothing. Absolutely nothing. Neither Microsoft or Apple has ever paid me a cent for any of the videos that I've done. Yes, I've done videos that have gathered millions of views talking about their products, but never once have they ever given me a cent. I hope that's a quick satisfactory answer for you. But, there is a little more to it that I'd like to talk about. Other tech YouTubers have been accused, and I say accused lightly, by the way. But, they've been asked and accused of the same thing. Jonathan Morrison actually did a good video about this recently too, where he talked about how Apple doesn't give him any money, even for expenses. If they invite him to a media event, for example, they don't cover his flight, they don't cover his lodging, they don't pay for jack. I don't know if that's typical practice in the tech community yet. Maybe I'll learn more once I get my name out there more, but I at least know that's the case with Apple. Me personally, I don't care. If I was invited to an Apple media event, I'd be totally okay with covering my own lodging and airfare, I don't care. But, I just wanted to let you guys know that even with bigger tech YouTubers, companies like Apple will generally not pay anything. Are there review units that are sent out sometimes? Yes, Apple does that too. I don't think they do it as often as other companies, but it does happen, they want other tech influencers to get a hold of things before the public does. Because, like the name suggests, tech influencers have an influence on people who buy the stuff, and Apple wants to make money, and make a good name for themselves. But, so do a lot of other companies. That's why review units exist. So, yes I do sponsorships sometimes, because yes, I gotta pay the bills, and I'm sure I'll do more as I keep growing the channel. Speakin' of sponsorships, today's episode is brought to you by, totally kidding. I'm not even doing a sponsorship for this episode. But yes, I do them sometimes because, I love makin' this stuff, but it isn't cheap. More importantly, when it comes to these videos, I make them because I want to. The tour videos showing off the Windows 2004 stuff, any other Apple, or Microsoft, or Linux related things that I do, none of that is an advertisement. I'm not paid to do any of that stuff. I just simply do that stuff because I want to. That's it. Also in the future, I plan to seek out more review units and things like that, because I'm starting to get a little more interested in that space of the tech world. As of today, I can tell you with 100% confidence that Apple and Microsoft combined have never given me a cent. So, there's that, every Thursday at three o'clock, generally every Thursday at three o'clock, I release a new tech video. Feel free to stick around for more of those, and subscribe so you don't miss them, and sometimes we do extra things throughout the week, including live streams and other fun stuff. If you wanna get other goodies from me and from the Computer Clan, and you wanna support the channel, go ahead and click the join button below the video, or use the link in the description. If you have any other questions for me, feel free to hit me up during a live stream. I do Q and A's about once a month or so on average. Or, just leave a comment down below, and maybe I'll make a separate video about that one day. Thanks for stickin' with me. Catch the crazy and pass it on. (slow electronic music)",
    "transcript_keywords": [
        "Apple",
        "Microsoft",
        "tech",
        "stuff",
        "video",
        "today",
        "videos",
        "lot",
        "received a lot",
        "people",
        "things",
        "tech YouTubers",
        "money",
        "questions",
        "question",
        "Microsoft stuff",
        "pay",
        "make",
        "comments",
        "answer"
    ],
    "transcript_entity_values": [
        "YouTubers",
        "Thursday",
        "the week",
        "2004",
        "month",
        "Apple",
        "the Computer Clan",
        "three o'clock",
        "YouTube",
        "today",
        "YouTuber",
        "Jonathan Morrison",
        "100%",
        "jack",
        "first",
        "a cent",
        "Microsoft",
        "Windows 10",
        "millions",
        "Linux"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE"
    ]
}