{
    "id": "200bl3A6sAw",
    "title": "Nokia McLaren: The Windows Phone That Never Was",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-07-20T17:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=200bl3A6sAw",
    "category": "People & Blogs",
    "tags": [
        "nokia mclaren review",
        "nokia mclaren hands on",
        "nokia mclaren",
        "lumia 1030",
        "lumia 1030 review",
        "unreleased smartphone",
        "prototype smartphone",
        "windows phone",
        "mrmobile",
        "michael fisher",
        "captain2phones",
        "windows central",
        "pocketnow",
        "secret phone",
        "nokia",
        "phone",
        "windows",
        "lumia",
        "microsoft",
        "oneplus 3",
        "mobile nations"
    ],
    "views": 465030,
    "likes": 12658,
    "comments_count": 809,
    "description": "Once upon a time, Windows Phone was a family of trailblazing smartphones with a style you couldn't find anywhere else  and the device in this video is the last remnant of that bold era. Fans would have called it the Lumia 1030, perhaps, but when it was canceled in July 2014 it hadn't even gotten past the codename phase. This is the Windows Phone that never was: the Nokia McLaren. Join Michael Fisher [MrMobile] for his Nokia McLaren hands-on ... and then check out the deep dive Nokia McLaren review at Windows Central!   [SUBSCRIBE]     [McLAREN DEEP DIVE]  The Windows Central Nokia McLaren review:    [ABOUT THIS HANDS-ON]  This video was produced after three days of hands-on time with a Nokia McLaren prototype obtained by Windows Central.   [SOCIALIZE]         [MUSIC]  \"The Ballad of MrMobile\" (Mobile Nations, 2016)  \"Financial District\" by Olive Musique, available at Premium Beat:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://www.windowscentral.com/nokia-mclaren-review",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/financial-district"
    ],
    "transcript": "- Today, Windows Mobile is a pretty but hobbled smart phone platform, extensively built for business. But about two years ago, Windows Phone was a family of trailblazing handhelds, with a style you couldn't find anywhere else. I'm Michael Fisher. And the phone I'm holding is a remnant of that brighter bolder time. This, is the Windows phone that never was, the Nokia McLaren. If you know anything about Windows phones, you can probably see where the inspiration for this design came from. Remember that phone that AT&T was pushing about three years ago? The one with the bumble bee paint job and the 41 megapixel camera? That was the Lumia 1020. And this, well this is what Windows fans might have called, the 1030. This is a prototype obtained by Windows Central. Pardon all the tape, but it's there to hide all the serial numbers. In the hand, it feels like what it looks like: A larger, metal-clad version of the 1020 with that immense camera crater around back, making things a little awkward, until you get used to it. The specs are unremarkable for at late 2014 device. Which is no surprise. The Windows phone ran very well on even low-end hardware, so there was no reason to spec it out. And even thought that massive camera suggests some intense obstacle stabilization, the sensor within was not 41 megapixels, but instead somewhere between 21 and 23. And since the camera's software was never completed on this device, we don't know anything more about it. The real stand-out feature of McLaren is its sensor package. Which would have made it a much more exotic Windows Phone than any we'd seen before. The five and a half inch display is self-capacitive, which means it detects your finger based on how it changes the charge of the electrodes mounted beneath the glass. That means it's capable of sensing your finger well before it touches the glass. And that would have made possible, a bunch of new interface options. This particular phone was programmed with only two. Mixed View lets you hover your finger over a tile and watch it explode into sub-tiles. Which is a neat party trick, but in my opinion, not terribly useful. We saw similar stuff from Sony and Samsung a few years back. Much more impressive to me is the fact that McLaren can sense how it's being held. So, if you're gripping the phone upright and lean it on to its side, it'll prevent that accidental rotation to keep the software at portrait mode. But if you hold it another way, that tells the phone you want to view things in landscape, it'll do that for you. That's the idea, anyway. This is pretty really software at it's buggiest. And that's just the tiny taste of the intuitive capabilities Microsoft was cooking up. And might still be working on. As recently as two months ago, I posted a video demonstrating all kinds of pre-touch features on what looks like another McLaren. I'll drop the link to that video in the description. Some will call this \"empty gimmickry\", incapable of ever pushing Windows Phone into relevance. And maybe the latter point is true. To me though, the McLaren stands for more than that. It's both a landmark to a once great phone manufacturer and an echo of a Microsoft that once embraced doing things differently. Boldly striking out in the opposite direction of the competition, not just for the sake of being different, but because in some ways its design choices made more sense. And it wasn't afraid to express that. It's a shame it didn't work out. Windows 10 Mobile, though superior in many ways, still lacks the vibrance and stability of the earlier versions. But I'm glad I got to share with you what might be the last remnant of that exciting era. There's a lot more to the McLaren, folks. And if you're looking for a true deep dive, be sure to hit up Windows Central for the full write-up and two more videos. Links in the description below. Also, subscribe to Mr. Mobile for more videos just like this. We'll see you next time.",
    "transcript_keywords": [
        "Windows Phone",
        "smart phone platform",
        "hobbled smart phone",
        "Windows",
        "phone",
        "Windows Central",
        "pushing Windows Phone",
        "extensively built",
        "built for business",
        "hobbled smart",
        "Windows phone ran",
        "exotic Windows Phone",
        "phone platform",
        "smart phone",
        "Windows Mobile",
        "Michael Fisher",
        "McLaren",
        "years ago",
        "camera",
        "pushing Windows"
    ],
    "transcript_entity_values": [
        "about two years ago",
        "Windows Phone",
        "Samsung",
        "Microsoft",
        "McLaren",
        "AT&T",
        "five and a half inch",
        "Mobile",
        "Windows Central",
        "two",
        "the Nokia McLaren",
        "two months ago",
        "bee paint job",
        "late 2014",
        "about three years ago",
        "Windows",
        "a few years back",
        "between 21 and 23",
        "41 megapixel",
        "Windows",
        "Windows Mobile",
        "only two",
        "41 megapixels",
        "Windows 10 Mobile",
        "Sony",
        "Michael Fisher"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON"
    ]
}