{
    "id": "20TEN5hYBQY",
    "title": "Should I hate or love Apple right now?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-08-18T00:53:07Z",
    "video_url": "https://www.youtube.com/watch?v=20TEN5hYBQY",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Apple",
        "repair shop",
        "independent repair shop",
        "Mac",
        "repair mac",
        "Mac parts",
        "fix macbook",
        "Epic Games",
        "Fortnite",
        "Unreal Engine",
        "App Store",
        "injunction",
        "lawsuit"
    ],
    "views": 684805,
    "likes": 40913,
    "comments_count": 1798,
    "description": "Get up to 30% off your entire order and free shipping at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 Linus' tech tip 0:14 Apple repair program 1:02 Chromebook shortage 1:57 A520 motherboards 2:46 Vincero 3:26 QUICK BITS 3:29 Apple, Epic still fighting 4:12 Xbox Series X price? 4:41 Nintendo Indie Showcase 5:06 Chrome battery life 5:26 EA Play Pro  NEWS SOURCES  iFIX, YOU FIX     NO-BOOKS     TIME TO CHEAP OUT?     QUICK BITS  APPLE BIT BACK    X MARKS THE PRICE   NINTEN-SHOW   ASKING FOR A SIP   EA PLAY, YOU SAY?  ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://vincerowatches.com/techlinkedsale",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://nypost.com/2020/08/17/apple-will-start-supplying-mac-parts-to-independent-repair-shops/",
        "https://www.reuters.com/article/us-apple-repair/apple-expands-independent-repair-shop-program-to-mac-computers-idUSKCN25D1F7",
        "https://9to5mac.com/2020/08/17/apple-independent-repair-program-macs/",
        "https://www.axios.com/coronavirus-education-laptop-shortage-f5990485-6277-4f4e-a37c-ec7f77d68241.html",
        "https://www.pcmag.com/news/remote-learning-leads-to-us-schools-facing-a-laptop-shortage",
        "https://www.engadget.com/school-laptop-shortage-233048355.html",
        "https://www.kitguru.net/components/motherboard/joao-silva/amd-a520-motherboards-leak-ahead-of-imminent-launch/",
        "https://www.hardwaretimes.com/amd-all-set-to-launch-a520-motherboards-up-to-64-gb-4600mhz-ram-turbo-m-2-wifi-ac-3168/",
        "https://hothardware.com/news/amd-value-price-a520-motherboard-launch-allegedly-imminent-as-asus-and-asrock-pics-leak-online",
        "https://twitter.com/EpicNewsroom/status/1295430127455596544",
        "https://www.gamasutra.com/view/news/368364/Apple_to_revoke_Epics_dev_tools_including_those_used_for_Unreal_Engine.php",
        "https://www.tomsguide.com/news/xbox-series-x-price-just-leaked-and-its-shockingly-high#:~:text=Microsoft's%20Xbox%20Series%20X%20could,on%20the%20Kinda%20Funny%20XCast.",
        "https://www.nintendolife.com/news/2020/08/nintendo_indie_world_showcase_announced_for_tuesday_18th_august",
        "https://news.thewindowsclub.com/chrome-will-allow-websites-to-switch-to-battery-saving-mode-102329/",
        "https://hexus.net/gaming/news/industry/144859-ea-access-origin-access-merged-ea-play/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://www.amazon.com/shop/linustechtips",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I used to be just like you, I didn't have a single tech news to my name, and now look at me. I've got so much tech news it's oozing out of my pores! - [Riley] Thanks, LTTStore.com! - I've got tech news zits! - [Riley] Oh. That's nice. - Apple is infamous for make it (clears throat) less than easy to go get your expensive iJunk repaired at a third-party shop, but that looks like it might finally be changing. Apple is going to start sending official parts to independent repair businesses, which will make it a lot easier for consumers to have their Mac serviced. Reportedly, Apple is even going to provide training resources and, you know, the only conclusion I can come up with here is that the Epic lawsuit hit them a bit too hard in the head, 'cause this is- - What is it? - This is not the Apple I remember! - [Riley] I like it, though. - The move comes on the heels of explosive sales growth for Macs, as more people are working and learning from home. Wow, Apple, you finally changed your ways, and all it took was a worldwide pandemic. On the subject of laptops, you may have noticed that it's been a little tricker to come by an affordable one recently. Because so many school districts in the U.S. are moving to online classes as schools start back up for the fall, there is apparently a shortage of lower-cost laptops in the United States. Chromebooks have been in especially high demand as many households and school districts require only a laptop with basic functionality for virtual lessons. Wow, that's like, kind of the opposite of a humblebrag. - [Riley] It's a humble-dis. - Yeah, a humble-dis, in fact, Acer's U.S. division said that they weren't even close to pumping out enough Chromebooks for all the students that want them, while another industry analyst has pointed out that laptop sales are up by as much as 40%. The good news, though, is you'll probably still be able to get that beefy $4,000 gaming laptop you've been lusting after, assuming that they ever give you another stimulus check. By the way, please, please don't use it on a $4,000 gaming laptop. Speaking of budgets, though, motherboards built around AMD's budget A520 chipset have recently leaked! Yes, my friends, we filled them with water and they did not hold the water. - [Riley] No! - The A520's big brothers, the X570 and B550, have already been around for a while, but the A520 will allow you to build a current-gen Ryzen system at a lower cost. Now, you will be giving up some features, notably CPU overclocking, PCI Express 4.0 SSDs and running your graphics card at x16 speed, but in terms of real-world performance, that last one shouldn't be too much of an issue. Rumors indicate that Asus, MSI and Asrock will all be rolling out A520 boards as soon as this week, so keep your eye out for them if the very idea of overclocking gives you anxiety. - Ooh! - Wait. What's up, Riley? You got something to say? - Yeah! Now it's time for Quick Bits, brought to you by Vincero, maker of high-quality timepieces at affordable prices. Vincero believes that you deserve to look good no matter your budget or what you did last summer. Their watches are all designed in-house and created with ethically sourced materials, like The Icon, a piece with automatic movement, and The Outrider, a watch for the rugged explorer. Vincero offers free shipping, 30-day returns and a two-year guarantee ensuring your watch can keep up with your daily commute. Right now they're celebrating their sixth anniversary with their biggest sale yet, so click the link in the description and save up to 30% off your entire order automatically at checkout. - The Jiminy Cricket Bites! After removing \"Fortnite\" from the App Store, Apple has responded to Epic Games' lawsuit by informing the studio that on August 28th Apple will terminate their developer accounts and remove access to Apple Developer Tools, which developers use to create and update games that run on Epic's Unreal Engine. Wow, the gloves are frickin' off now, aren't they! Epic has filed an injunction to stop this from happening, and it's clearly retaliatory, but if it does happen, Epic, and not just Epic, any developer that uses Unreal Engine would be left unable to modify their games. Now this fight has moved from summer entertainment to something with real-world potential impact. Like, can't they just settle this in-game? - [Riley] First to headshot! - Gaming personality Alanah Pearce says a retail worker sent her a photo of the Xbox Series X on their store's internal system with a price tag of 599. Meanwhile, other rumors are pointing to a 499 price point for the PS5. So the question remains then: would you pay $100 more for the most powerful console ever, that will play the games you can already play on your other machine you already own? (coughs) I guess we'll find out in November. Now, if you're interested in games you actually can't play anywhere else, Nintendo is set to stream the latest installment of their Indie World Showcase tomorrow at noon Eastern time, but don't expect any news on big-ticket first-party franchises like \"Zelda\", \"Smash Bros.\", \"Metroid\", et cetera, unless you really enjoy being disappointed. It's a strange kink, but, ah... Hey. - Hey! - I'll respect it. - To each their own! - Google has been making efforts to keep Chrome from sucking as much battery on your laptop, and the software giant is reportedly taking things a step farther with an experimental feature that will let websites tell Chrome to do things like slow down frame rates or scripts so that it won't use as much power. Hopefully it won't make your TechLinked viewing experience less buttery-smooth, though. - Processing! - And EA is rebranding some of its online services, because we know that's always gone over well for unpopular companies and their unpopular services. EA Access and Origin Access will now be known as EA Play, with Origin Access Premier becoming EA Play Pro. - [Riley] Ho! EA's also bringing updated aesthetics and new features. Hopefully, you know, one of those will be (snaps) cheaper content. - Hey! - Whoo! - Got 'em! - And that's our show for today. Come back on Wednesday for more 100%-free tech news, as long as you don't mind paying with your time. That's right, it's gonna cost you time, which as- - You got lots of that! - Time equals money though. - Yeah, but you got a lot. - So you got lots of money. - We're all rich right now. - We're all rich. - Clearly. - Unless, unless we don't have much time left. - Oh. - I'm afraid some of us are just out of time. Wow, this is- - Uh, stop. - Yeah, cut this off before it reaches the end.",
    "transcript_keywords": [
        "Apple",
        "single tech",
        "Epic",
        "tech",
        "time",
        "Apple Developer Tools",
        "laptop",
        "Epic Unreal Engine",
        "play",
        "access",
        "Origin Access",
        "Wow",
        "Unreal Engine",
        "Yeah",
        "Apple Developer",
        "gaming laptop",
        "games",
        "Origin Access Premier",
        "make",
        "Epic Unreal"
    ],
    "transcript_entity_values": [
        "Epic Games'",
        "Alanah Pearce",
        "599",
        "tomorrow",
        "X570",
        "Icon",
        "100%-free",
        "30-day",
        "Riley",
        "U.S.",
        "Zelda",
        "up to 30%",
        "two-year",
        "The Jiminy Cricket Bites",
        "Smash Bros.",
        "Metroid",
        "Origin Access",
        "EA",
        "summer",
        "Acer",
        "November",
        "Nintendo",
        "EA Access",
        "EA Play Pro",
        "Fortnite",
        "4,000",
        "noon Eastern time",
        "A520",
        "Asrock",
        "Quick Bits",
        "Chrome",
        "as much as 40%",
        "daily",
        "third",
        "Macs",
        "Ryzen",
        "PS5",
        "100",
        "AMD",
        "August 28th Apple",
        "Indie World Showcase",
        "first",
        "PCI Express",
        "Asus",
        "sixth",
        "MSI",
        "last summer",
        "Epic",
        "Wednesday",
        "Outrider",
        "TechLinked",
        "this week",
        "Mac",
        "Apple Developer Tools",
        "the United States",
        "B550",
        "CPU",
        "First",
        "Unreal Engine",
        "Epic",
        "the App Store",
        "Vincero",
        "Apple",
        "today",
        "499",
        "the Xbox Series X"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "WORK_OF_ART",
        "PERCENT",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "MONEY",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "DATE",
        "ORDINAL",
        "ORG",
        "NORP",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "EVENT"
    ]
}