{
    "id": "214XpDTTGEI",
    "title": "Should you buy the *NEW* $100 dollar Smart Lock?...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-06-27T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=214XpDTTGEI",
    "category": "Howto & Style",
    "tags": [
        "Tapplock one plus",
        "taplock",
        "smartlock",
        "padlock",
        "lock picking",
        "security",
        "best lock",
        "pad lock",
        "tap lock",
        "tapplock one +",
        "do not buy this $100 smart lock",
        "tapplock",
        "technology",
        "review"
    ],
    "views": 2340823,
    "likes": 77631,
    "comments_count": 3730,
    "description": "Tapplock is back with another version of the smart padlock. Is the Tapplock One Plus more secure than the Tapplock one from last year?  The only way to find out... is from the inside. Current pricing of the Tapplock is here:  With last years Tapplock One, some of the models had a flaw where the back panel was not latched on securely. This time around, with the New Tapplock One Plus, its time to see if the issue has been fixed.  This is not a sponsored video. I bought these locks with my own money, and my opinions are entirely my own.   Would you buy a smartlock? Or would you rather have a combination lock? Let me know down in the comments.   Tapplock One video:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://amzn.to/2Xy6YSQ",
        "https://youtu.be/RxM55DNS9CE",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "You might remember last year when I found a super high tech smart lock. That was pretty cool and had a lot of promises, a lot of cool features, but some of the models had a defect where you could rotate off the back panel and unlock the lock with just a small simple screw driver in only a few seconds. Not a feature you really want to have on something that's protecting your stuff. Well Tapplock reached out and said they did a total redesign of the lock and added a few more cool features, and invited me to retest this new version. This is not a sponsored video. I bought these 4 locks with my own money. The real question is, am I taking apart this smart lock because I actually care what's inside? Or is it because I want to use my brand new 18 volt, brushless, deep cup, portable bandsaw? Let's get started. [Intro] I bought 4 of these locks myself, in order to have a sample size large enough to analyze properly. A smart lock is kind of like a regular lock, except it has a fingerprint scanner. It can also hold 500 fingerprints and stay charged for up to a full year. With the app you can share access to the lock remotely, and it keeps a history of who's unlocked the lock. There's a lot going on. There's also really nothing wrong with owning a regular normal style combination lock, but it is cool to see how the technology is adapting into different industries. The main physical problem with the original Tapplock One that I tested previously was that the back wasn't latched properly on some units, and it could just twist off, exposing easy access to the internals. This time around I'm using the same super sticky GoPro mount to grab that circular back panel and try to rotate it off. And lucky for Tapplock, these back panels are all staying attached and in place. So far, the Tapplock One Plus has better construction than it's predecessor. So far, so good. But we still need to get inside. And now for the fun part. [Sawing sounds] My saw did a really good job of cutting through the regular zinc alloy metal body, which is to be expected. But when my saw reached the hardened stainless steel shackle, things got way more difficult. I flipped the lock around to the back side and started cutting again. [Sawing sounds] Getting somewhere. You can definitely smell the battery that's in there. So it looks like a back panel right here, and even with it cut in half, it's still not rotating off, which does mean Tapplock has solved that problem. It's definitely much more difficult to get inside of than last time. Let's see if we can pry this open a little bit. Nope. [Sawing sounds] Phew. Finally. Even after being sliced in half, the lock is still locked. You can see the cross section of the fingerprint scanner going to the motherboard which is separated by massive amounts of metal from the internal battery. The battery itself lasts for 3,500 openings, or up to a year without it needing to be recharged again. And the whole contraption is also ip67 water resistant, so using it outside in the weather should be just fine. It looks like Tapplock has also updated the internal screws which was another one of my suggestions in the last video. These screw heads are like nothing I've ever seen before. So even if someone does somehow manage to get inside, they still can't access anything without the proprietary hard-to-find screwdriver. That's a huge improvement. You can also see the charging port down here at the bottom with it's rubber sealant to help keep water out. That's another perk over the previous design. Here's a closeup look at the top half of the lock. We can see the same proprietary screw holding the front and back halves together, and how much metal is involved in the overall construction. Tapplock has done a much better job this time around with the redesign. Nice work. With the different internals, the screw redesign, and the added water resistance, the Tapplock One Plus is what a smart lock should be. But like with most technology, it is relatively expensive. I'll put a link down in the video description if you want to check the current pricing. And yeah, thumbs up to Tapplock for acknowledging a fault, switching up their design, and coming out with something better. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "lock",
        "high tech smart",
        "Tapplock",
        "tech smart lock",
        "smart lock",
        "super high tech",
        "high tech",
        "back",
        "cool features",
        "back panel",
        "cool",
        "tech smart",
        "smart",
        "screw",
        "inside",
        "locks",
        "super high",
        "lot",
        "panel",
        "regular lock"
    ],
    "transcript_entity_values": [
        "3,500",
        "the Tapplock One",
        "only a few seconds",
        "the Tapplock One Plus",
        "Tapplock One",
        "GoPro",
        "18 volt",
        "ip67",
        "Tapplock",
        "up to a year",
        "Twitter",
        "500",
        "last year",
        "half",
        "Instagram",
        "up to a full year",
        "4"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "LOC",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}