{
    "id": "2FwD9BNjAX8",
    "title": "😱 THE VOICE OF MARIO!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-06-17T14:56:16Z",
    "video_url": "https://www.youtube.com/watch?v=2FwD9BNjAX8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "e3",
        "2018",
        "mario",
        "nintendo",
        "call of duty",
        "e3 2018"
    ],
    "views": 263127,
    "likes": 9676,
    "comments_count": 668,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - We're here at E3 2018. I am so excited. We are heading in. This is my first time on the show floor. The first place that we're going is to Nintendo. Let's go. Oh boy, oh my. There's zombies. (laughs) Look at him! He's gonna eat that guy. Is it cosplay or just an activation? Oh, he's following me. He's following me. (upbeat music) Okay, so we made it to the Nintendo booth. Let's take a quick tour and then we're gonna head up for game play. Come on. (upbeat music) This is like a Nintendo museum. (upbeat music) - Hello, it's me, Super Mario, with Super Princess iJustine. Mamma mia, she number one. (laughing) - It just doesn't ever get old. And it makes me cry every time. It's okay, it's a good. - It's alright, happy cries. - They're happy cries. - Happy tears. Yay! (laughs) Brings back so many great memories, doesn't it? - It does like my childhood. Oh my gosh. - Yeah. - I can't handle it. Okay, okay. I'm composing myself. I'm sorry. (laughs) - It's okay, sure. - Thank you so much. I appreciate it. - My pleasure, thank you. - Oh my gosh, yes. Thank you, - Have a great time. - Okay. - See you. - Okay, I'm sorry. (laughs) You can stop filming now. - [Woman] You want a picture? - It's okay. Okay, sure, I'll get a picture. - Yipee. (laughs) - [Woman] You have tears everywhere. (laughs) - Aha! Whoopee. - I can't even handle this. (laughs) It's like one of those things like when you guys come up and meet me and I see you guys in tears, like you can't actually understand it until you have that same feeling. Like, this is crazy. Oh my god, I'm so, I'm an emotional mess right now. It's Mario! It's the voice of Mario! (upbeat music) - Hey, what's up? - Ah! - Good to see you guys. - We're back, can you believe we're here at another E3? Like this is crazy. - I know right? - I feel like this just happened like last week I saw you. - Oh no. - We were playing Mario Odyssey! I was right there. - [Man] That's right, you were. - Yes! - Here we are again. It feels familiar. This year, we're bringing on-- - What do we got? - Some Super Smash Bros Ultimate. Everybody is in there. Pokmon: Let's Go, Pikachu! Pokmon: Let's Go, Eevee! - Yeah. - Yes. - It's super exciting. - I know, right? - Yeah, but I'm excited about Smash Brothers, - Yeah! - Even though I'm not the best at Smash Bros, do not judge me. Even though you will 'cause this is the internet, and I know you guys. But that's okay. - Internet, be nice, come on. - It's okay, let's-- - What's wrong with you? - Do we get to play? - Yeah, let's play. - Okay! So our first demo that we're gonna be playing is Super Smash Bros, and I know all of you guys are excited because I've seen you on Twitter just going absolutely crazy, especially while the Nintendo Direct was happening. Well, guess what? It's here, we're gonna play it. We've got a Smash Brothers cheat sheet for the newbs, which unfortunately is probably gonna be me 'cause I haven't played in a very long time. - [Man] Activate it. It's a perfect little character. Oh, look at what you did. - Oh, this is so cute! Oh no! - I have, look at. (laughs) - We both did one. I saw yours, player two, as you see it was that bird that's coming out that's - Yeah. - kickin' the heck out of me. - And as you know, some of the levels are very easy, I guess, or safe. - Yeah. - [Man] And other ones really have elements, like dangerous elements. The levels will evolve as you're playing. Some are very small. He's got all sorts of weird little villager abilities. It's awesome. They take a while, but they hit hard. - Yeah. - Can I jump in on the tennis game? - Oh, most definitely. - Yes! - I'm not that good, so I won't be mean. - You guys keep saying this, - I won't be mean. and then you beat me. So, it's always, you know. - Is that what he did? He said I'm not good - Yeah, he was like, oh. - And then he beat you? - He was like, of course I'm not very good! - Yeah. Mario Tennis cheat sheet. (dramatic music) - Oh, I was looking at your screen. - Yeah! - I went the wrong way. - I keep, I know! We're standing on the other player's side, so I keep looking at his screen. (laughs) - Okay. - Okay. - [Man] Here we go. - Oh yeah, I'm gettin' the hang of it now. Aw, I almost spoke too soon. - We are real excited for Mario Tennis Aces because it's out the 22nd! - Oh, that's soon! - I know, like a little more than a week. - That's always the hard part about going to E3 is you see all these games that aren't gonna be coming out for a long time. - Yeah, you know, - So this is actually out. - that's kind of what we do. We have games that are gonna be out in a couple years, right? - Of course, yes. - We really like to show people what is coming out soon. What are you gonna be able to play now or before the holidays? - Fortnite. - Now! - Dude, I'm so excited! - I know, right? - When the announcement happened, I was like, yes, this is what I've been waiting for. - Yeah. - I can't wait. But this is so much fun! - Did you download your copy of Fortnite already? - I did. - Lot's of people did. - Yes. - Yeah. I haven't got a chance to play it 'cause I'm obviously here. - No, I know, right? - But it's ready. It's ready. (upbeat music) So the first two hours was media, so there weren't many people, but now they opened the doors and there are so many people everywhere. (upbeat music) Call of Duty! Did already get a chance to play when they did the multiplayer reveal. Jurassic World. Let's go. This is such a cool booth. Gotta get my dinosaur selfie. You guys wanna see it? Look at that. Dinosaur selfie. (upbeat music) Jen, how's your E3 been? - It's been good. How's yours been? - It's been overwhelming. You were in the program a little yesterday, right? - I was, I was for a little bit. But not as long as you there in that heat. - It was so hot. - But it looked really good. I was surprised, and you did a really good job. - Thank you. - I had to leave, but I was watching you in the car on Twitch, so that was lovely. - Thanks, Jen. You wanna go check out the mixer booth? - We should go say hi to Larry. - Let's go see if we can say hi to Larry. - Come on up, come on up. - Oh! - I need you to come up here. Okay. Hi, guys, I just crashed the stream. (electronic music) Okay, I actually crashed the stream. It was a joke, but the joke turned reality. - Hi, TJ. - Hi, Justine. - How's it going, cheers. - Cheers. - We can do a walk and talk 'cause Nick is now a Ronan Farrow. - Wow. - Look at us, just walking. - Walking and talking. - Hey, wait, don't run into the people. - [Cameraman] And, then pick up the conversation. - So we're gonna reenact, ready, okay. Hey, TJ. - Oh, hey, Justine. - How's it going? - It's going great, how are you doing? - Cheers. - Cheers. - How's your E3 going? - It's fantastic, I love it. So many great games here to check out. - Have you had any specific moments that have been your key highlights of E3? - Hideo Kojima walked by in front of me, and that was like full-body chills. - Did you cry? - A little bit. - Okay, so, I ran into the voice of Mario, and I actually cried. - Yeah? - The tears, they were real. If you guys remember this moment, Ed saw it. - Holy cow, friends at E3. - Let me get in the middle because I have a microphone. (laughs) This is a great chat, we're all professionals. - I'm gonna start crying. - Ed cried, so we've all cried. - Yes. - You cried, Kojima. I cried because of Mario. - Oh, you cried once, I cried twice. - Let's play those back. - [Ed] Yes! - I can't even handle this. I'm a mess. Here, let's reenact your tears. - Okay, Kojima is walking from left to right. My heart stops for a second and I'm like that's, that's Hideo Kojima. - Now, I just feel uncomfortable. Did you get a chance to see Nintendo? Did you go to the Nintendo booth, did you play Smash? - Tomorrow, yeah. - Oh, tomorrow. - I got to play Smash right when E3 opened up. 11 AM, yesterday. - Nice, what'd you think? - It was so much fun. It's really crisp, I played with the-- - Are you good at Smash? - No, I mean like I enjoy it, I'm probably medium. - Who did you choose? - First time, I chose Link, and then, second time, I chose Inkling because I wanted to play with the new character. - Me, too, yeah I played Inkling and I played Villager. - [TJ] Sick. - [Justine] 'Cause we played on the Animal Crossing one, and we played the Mario Galaxy Level. - Nice. - It was really fun. Did you play the, what's it called, battle arena star light thing, battle, star- - Star Fox, Link? - Yes, but Atlas Battle of. It's like that. - No Man's Sky? - Starlink? - [Justine] This is it. - [TJ] Battle for Atlas. - [Justine] Starlink: Battle for Atlas. - Yes. - Yes. - [Justine] Great game. - [TJ] It's like Destiny, No Man's Sky. - It was really fun. What we're trying to get to is the game was really fun. You should play it. - Okay. - It was great. - Is it the Nintendo booth? - It is the Nintendo booth, yeah. (guns firing) No, open back up. Fortnite on Switch. I know we've talked about it a million times, but I'm excited about it. - I'm excited to play it not connected to a chair. - I'm ready for Fortnite VR. Give me Fortnite VR. - Oh boy, now you're getting crazy. - That would be so much fun. - That's called real-life construction, so, going outside. - So, I just need to get a construction job. - Although yesterday at the Fornite Pro-Am, the Pro-Am was almost, sort of Fornite real life 'cause we were all outside. So I guess that's really the only aspect. That's a really bad analogy. Anyway, we're gonna be heading into the Xbox event. This isn't the showcase event we went to before. You been inside yet? - Yeah, yeah. - Oh, what can we expect? - [TJ] There's Forza, there is Sea of Thieves. Whole bunch of cool stuff there, there is, what else did we see? - [Justine] Ores, is Ore there? - [Ed] There's the adaptive controller in front of an adaptive wall. - [TJ] The wall is changing shapes. - The wall moves. - That's cool. - Kudos to Microsoft for that adaptive controller. - It's really incredible. I've heard so many amazing positive things that I feel like more game companies need to sort of address this. This is something that they need to start creating. It's really exciting. - I think it's quite a challenge because of how many ways that there are to interact, but creating one source for all it to go into, and then be compatible with stuff that people can easily just buy off the shelf. Like playing video games, and needing access to specific controller types. There wasn't compatibility there. Now, knowing that there's compatibility for all those different inputs is fantastic. - Yeah, they've kind of created that hub to make it accessible for everybody which is really awesome. Well, let's head inside, you guys wanna go in? You were already there, so let's go. Let's go see what they got. I don't know why I'm running. I'm running because we have a Ronan and we can. - Let's do it, hold the coffee very carefully. - Yes, ugh. - Justine, did you do tatoos, temporary tatoos. - What, at Sea of Thieves? - Yes. - Oh. (upbeat music) Never forget that chocolate lancer, it's life-changing. They've got the battle boss, oh I'm sorry. No way, this looks incredible. Does he know I'm here? Does he know that I'm here? Do you know that I'm here? 'Kay, I think he knows I'm here. He's getting closer, what if I go this way? Do you want some coffee? (upbeat music) Thanks shrub. Have a good day. This booth is so awesome. They actually won an award for best booth at E3. Rightfully so, they've got popcorn, they've got cookies. They've got a llama-bull-riding thing. They've got some fly drops, they've got the Battle Bus. (upbeat music) So, I don't wanna do this because the last time that I did something similar to this on a bull, I got severely injured. So, let's just live vicariously through that. It's my, wait, hey, look, it's my friend, my best friend. - Hello, I'm a beacon of attractiveness. It's good to see you, hi. - Hi, we were running around all day and just meet up at the Fortnite booth. - I'm just exhausted. - I bet you are. - Yeah, yeah. How's your brain after being fried outside for numerous hours? - Well, I've been drinking coffee and caffeine nonstop. So, I'm feeling great. We survived the Pro-Am. - We lived to tell the tale. - It happened. We did, but-- - We made memes. - We did make memes. - That was the funniest clip by the way. - I said, do you guys like memes, 'cause I think this is one. - Yeah and it became it, it was good. - It did. - It was good. - But the event was amazing. I was so lucky to cast with you. Well, I wasn't casting. Well, you guys were doing all the casting. - Hey, we're a team, team effort. - It really was. - Teamwork makes the dreams work. Even in a 1000-degrees heat. - Yes, and I couldn't have asked for a better team. You guys were amazing, it's so good to see you again. I hope we get to work together again soon. - Alright, always. (upbeat music) - That's it for today's E3 video. I had so much fun so far this year. There's been so many fun moments that hopefully I was able to capture some for ya. Well, I'm gonna go, and I don't know what I'm gonna do. Probably gonna edit or drink more coffee, or do something. I don't know maybe I'll boogie down. Probably won't, but maybe. Oh, I'm sorry. Am I doing it? - [Man] No, stop it. - Is it this way? - [Man] No, oh god, it's like watching scissors go the wrong way. - No? Still not? (laughing) (electronic music)",
    "transcript_keywords": [
        "Yeah",
        "good",
        "play",
        "guys",
        "Super Smash Bros",
        "Mario",
        "Smash",
        "Nintendo",
        "Nintendo booth",
        "Smash Bros",
        "booth",
        "Super Smash",
        "time",
        "battle",
        "play Smash",
        "fun",
        "great",
        "Fortnite",
        "Super",
        "excited"
    ],
    "transcript_entity_values": [
        "the Animal Crossing one",
        "Justine] Great",
        "Hideo Kojima",
        "the Fornite Pro-Am",
        "all day",
        "Tomorrow",
        "second",
        "numerous hours",
        "Nintendo Direct",
        "E3",
        "This year",
        "one",
        "Mamma mia",
        "Ronan",
        "a good day",
        "1000-degrees",
        "the Mario Galaxy Level",
        "Fortnite VR",
        "Justine",
        "First",
        "a little yesterday",
        "Nintendo",
        "Smash Bros",
        "Fortnite on Switch",
        "Pokmon",
        "Super Smash Bros",
        "Forza",
        "Kay",
        "Call of Duty",
        "Twitter",
        "Mario Odyssey",
        "Jurassic World",
        "Xbox",
        "Mario Tennis Aces",
        "Twitch",
        "TJ",
        "Jen",
        "E3 2018",
        "Destiny",
        "a couple years",
        "the Battle Bus",
        "Mario",
        "Ed",
        "Larry",
        "Justine] Starlink",
        "today",
        "two",
        "this year",
        "Smash",
        "Super Mario",
        "Nick",
        "Microsoft",
        "Sea of Thieves",
        "Battle for Atlas",
        "Mario Tennis",
        "first",
        "Smash Brothers",
        "tomorrow",
        "a Ronan Farrow",
        "11 AM",
        "Villager",
        "Super Smash Bros Ultimate",
        "Justine] Ores",
        "Atlas Battle",
        "Eevee",
        "Fortnite",
        "Kojima",
        "yesterday",
        "22nd"
    ],
    "transcript_entity_types": [
        "FAC",
        "PERSON",
        "PERSON",
        "FAC",
        "DATE",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "QUANTITY",
        "FAC",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "FAC",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE"
    ]
}