{
    "id": "2JJmmQqIV60",
    "title": "TODAY IS MY BIRTHDAY!!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-20T16:59:55Z",
    "video_url": "https://www.youtube.com/watch?v=2JJmmQqIV60",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "joshua john cakes",
        "man about cake",
        "man about cakes",
        "octopus cake",
        "ijustine birthday cake",
        "iJustine Birthday",
        "iJustines iPhone"
    ],
    "views": 393066,
    "likes": 10399,
    "comments_count": 3218,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it goin', so if you can't tell, I am not in my kitchen, where are we right now? - We're on the Man About Cake set. - Now, could you tell me a little bit about your show for people who have no idea? - Yes, every Tuesday, we bring the coolest cakes ever to YouTube. - And they are so cool, so if you guys don't know, I originally found you because I was on my sister's channel. - Yes. - And we were making a video, and I was talking about how cool your cakes were, and I told you guys to tweet him to come to my house and make a cake with me, and guess what, it happened. - [Joshua] I did, and it was super fun. - [Justine] We made a Nintendo Switch cake, it was amazing. - Two. - Two, two, yes, I made two! And now I'm here on your set, and I thought before we get into the questions, 'cause I asked you guys for some questions, which was probably a mistake because I said make them cake-related. - And you got a lot (laughs) of cake-related questions. - I did, but everyone says, what's the best cake you've ever made, so there's, like, hundreds of those. - That's true. - We can talk about that, but let's explore the set a little bit. - Yes! - Can we take a peek? So right now we have this beautiful party theme, and do you know why, because today is my birthday! - Yay! - And tomorrow is Joshua's birthday, (imitating crowd cheering) so we are having a great celebration. So what else do we have here? - So these are just some of my favorite cake plates. - Yes, let's talk about it. - This is my skull, I have to have something creepy always. 'Cause I make beautiful cakes all the time, - Mm-hmm. - So something creepy. Books that I love. - Oh! - That I've collected. - You're missing one. - Am I missing one? - Yeah, so I was cutting out fondant for a cake that I made you, and I used this. - [Joshua] As a template? - (giggles) Well, I just kinda went like that. (book slaps on table) - That works. - Used it as an edge, I'll put this back. - That's fine, we'll put that back. What else do I have, jars of stuff, I got sprinkles. Um, and this is my pantry. (objects clatter) - I'm so sorry, I hope those were not special. Are these, do you actually use them, or is this set? - I use them. - Oh, cool! - And then we have this because you're here. (both giggling) - We had this the whole entire time we shot. - (laughing) Just in case, we knew Justine was coming. - Because it's our birthday, we both made cakes on his channel if you wanna check it out, Man About Cake, I will put a link in the description. So we both made each other cakes for our birthday. - But surprise. - So at this point, we've already seen both of our cakes, and guys, I almost cried when I saw the cake you made me. - Did you really? - Yes! - It was so much fun to make, I loved it. - Oh my gosh, it was so, so incredible. I don't think I can fly back with it. Do you think TSA would be a little upset with that? - I'm not sure that would fit in a quart-sized resealable (wheezes) plastic bag. - Have you ever flown with a cake that big before? - I've actually never flown with a cake, I've flown with pieces of cake. But they were, like, all wrapped up and checked. - You checked, like, you put the cake into a suitcase? - There's ways, yeah. - Really? No, boxes, into boxes, and then it comes out over there by where the skis come out. - Interesting, so it was like the big, bulky items? - Yes, that's where, yeah. - Well, we've got some questions from you guys. - Let's do it. - Let's take a look. Oh, this is interesting, speaking of knives, somebody sent-- - Are those Joy-Cons (giggles) with knives in them? - Yes, they are Nintendo Switch Joy-Con knife blade holders. - I'm pretty sure you need those. - Okay, well that's not a question, that was just something. So Kevin wants to know what was our biggest fail in the kitchen? - My biggest fail in the kitchen, you go first. - Oh, well, (chuckles) where do we start, I don't think we don't have that much time. There was the home pod cake, there was the wedding cake, there was my Valentine's cake, um, jeez, let's just fill in the blanks. - [Joshua] The Valentine's cake wasn't bad. - Ah, well you saw last year's. - Oh, is there a new one, oh my god. (chuckling) - No! Oh, no, we didn't take any pictures of it! - I don't know if I've had, like, a really-- - Of course he doesn't have any, because your cakes are perfect and beautiful. - I mean, I've had times where people, other people, messed my cakes up. And then I had to go fix them. - (laughs) So it was not your fault. - It was not my fault. - Okay. - I went to a wedding, and I really wanted to make the wedding cake, and the person said no, their friend was already gonna do it. We were sitting there, the ceremony's about to start, and a mom comes over and says, we need your help. I go into the reception hall, and the cake is a mess, and the girl's crying. - Oh, no! - And I helped save a cake, but we literally went outside and cut flowers (laughs) and did the best we could. - Oh my gosh, that's so kind of you. - That was probably the most panicked I was, like, let's get this cake together, but it was not my fault. - Not his fault, so basically what he's saying is he's perfect and doesn't make mistakes. I will take all the cake mistakes for you. (both laughing) So this is interesting, Tom wants to know, is carrot cake a real cake or just a vegetable in disguise? - That's a good question. (snickering) - Because I feel like anytime I've had carrot cake, there's little chunks of carrot in it, so... - Carrots actually have a lot of sugar in them. - Really? - Yeah. So it gives a lot of structure to the cake, it kind of is like having zucchini bread, something like that, so it's more of a savory cake, like, say a marinara sauce, right, you could add carrots to that, 'cause it makes it a little sweeter. - What? - Makes it a little sweeter. - Really? - Yeah! - This is all new information to me. Honestly, anything good that I do on any of my cooking videos, I've learned from you or Ro, because you guys are pros. - We'll have to do a video where I come over and cook you and your sister dinner. - Yes, that would be so fun! - I can cook, like, groceries, like, real food. - Really, groceries? - Yeah. I went to, sorry, that's such a Southern thing. (laughing) I can cook groceries. No, I went to culinary school, so I learned how to, like, butcher chickens and stuff like that. - Oh my goodness, I was on Chopped, and lemme tell you how fast I got chopped, real quick. (chuckling) - I wouldn't even go on Chopped. - It's stressful! - They're like, here's a potato and a steak, make dinner, I'm like, I'm out. - Yeah, it's crazy, what do you do with these things, especially coming from a background of zero cooking, I mean, I Postmates breakfast. - So you did the Blue Apron thing, right, that was-- - I did, - It came out really beau-- - that actually worked out really well. - I wanted a bite of that, it looked really good. - Yeah, I was impressed, so Blue Apron, I can almost handle, 'cause it's basically done for you. Ty is asking, will you bake your iMac Pro a cake every year on its arrival day? (gasps) An iMac Pro cake. - Does it have to be standing up and stuff? - [Justine] That's something you should think about. - But they're, like, really thin, right? - I mean, I've seen you do some crazy things. - (sighs) Okay. - Think about it. - We'd have to rig it, we'd have to, yeah, there might be some rice cereal treats in that. - Sunfrog is asking, are you going to make a cake shaped like Mattie's head for his birthday? (inhales deeply) - You should, when is his birthday? - Well, I was just gonna say, like, I mean, I don't wanna do a spoiler or anything for your video, but guys, you have-- - Go watch our video. (giggling) - You have to see the cake that he made for me, it's so incredible. - It may or may not have Mattie on it. - It may or may not have him. - I also have 45 pictures of her dog on my phone currently. - Really, I have hundreds and thousands, you shoulda let me know, I coulda shared an album with you. - I didn't want you to know what I was doin'. - Where were the missing AirPods that you lost, and now they're found? They were in a secret compartment in my purse. (laughing) I was so upset. - That's right, I remember you had the Air... - Well, I've already lost one pair, and then I got a replacement pair, and then I got a backup pair to replace it because they were so hard to get, and I knew I was gonna lose them. - Can't you get somebody to sew a little pocket in your purse that says, earbuds, and then... - Well, it kinda was in that pocket, but I didn't (laughs) know it was there. So, yes, I found them, so, so far, I've only lost one pair of AirPods, but those things are great. Who has better cakes, Justine or joshuajohncakes? Guys, his cakes are so amazing, what was your favorite cake that you've made so far in the show? - Probly the octopus cake. - (gasps) That was really cool. - Just because I had a dream about that cake years ago. I dreamt that I made that, but I couldn't justify making it just for the, you know, just to make it, 'cause I don't have the time, so I had a friend who had a nautical wedding, and she loves octopi, and I sketched it out, and she was like, (gasps) that's my wedding cake! I was like, yes! - That's so awesome. - So obviously, I got to practice by making it for her, and then we made it on the show. - [Justine] Ah, that's amazing. - [Joshua] Yeah, it's probly my favorite. - Love it. - And James' wedding cake. - Oh, oh, he's... - Sorry, James. (laughs) - Oh, actually... - That was a really good cake. - Speaking of James, somebody here asked-- - [Joshua] How many pairs of shoes does James have? - Marcus wants to know, why is it that we never see the faces of the beloved #ManAbout crew? - Um, (laughing) they don't have faces! - [Justine] Hi! - [Joshua] There's Brandon, James is back there, on the ones and twos, DJin', this is Tommy. - [Justine] Hello. - [Joshua] And then culinary producer Lisa, she's woman about cake back there. - So awesome, well, guys, here it is. Well, that's really all the questions because everyone was just asking, what's the coolest cake you've made, or was your biggest fail, so... - So why don't we say, what should we do next. - Yes, what should we make! - Because I'm in L.A. a lot, this is your first time out here, right, in Denver, I'm in L.A. a lot. - Mm-hmm, I've never been to Denver, ever. - So you'll have to go explore after this. - Yeah! - Yeah. So next time I'm out in L.A., we'll figure out a time to, well, let's cook something. - Please, let's do it, guys, what would you like to see us make together? - It could be anything! - Should we try to make an iMac, like, is that a little aggressive? - It scares me. - Maybe... - I could figure it out. - Okay, you think about it. - It maybe will have to be a cake with, like, an iMac on it made out of pastillage or something like that. Can we just take your iMac put it (laughing) on top of the cake? - We could, we could. (chuckling) - Look how good we are, don't cut into that. - If you guys have any suggestions for things that you would like to see us make, please, please, please, leave 'em in the comments below, and I think we should go celebrate our birthday now. - Yes, we have cake to eat. - We do, ah, so good. Make sure you guys go subscribe to Joshua's channel, Man About Cake, it is the best, I love it so much. - Thank you. - Yes, well, thanks for having me, like, destroy your kitchen, 'cause this is something that... - Oh, this is every day. - Yeah, okay, good. (laughs) - Bye! - Bye! (soothing, delicate music)",
    "transcript_keywords": [
        "Cake",
        "cakes",
        "Yeah",
        "make",
        "made",
        "guys",
        "wedding cake",
        "birthday",
        "Valentine cake",
        "time",
        "good",
        "Nintendo Switch cake",
        "wedding",
        "James",
        "carrot cake",
        "questions",
        "put",
        "back",
        "lot",
        "favorite cake"
    ],
    "transcript_entity_values": [
        "Joshua",
        "zero",
        "TSA",
        "AirPods",
        "Ty",
        "one",
        "quart",
        "Denver",
        "Valentine",
        "Justine",
        "Tommy",
        "Ro",
        "Two",
        "Blue Apron",
        "iMac Pro",
        "James",
        "culinary school",
        "Brandon",
        "Postmates",
        "hundreds and thousands",
        "hundreds",
        "every year",
        "Justine]",
        "years ago",
        "Nintendo Switch Joy-Con",
        "last year's",
        "Kevin",
        "Nintendo Switch",
        "Mattie",
        "45",
        "L.A.",
        "today",
        "iMac",
        "two",
        "YouTube",
        "Marcus",
        "ManAbout",
        "the Man About Cake",
        "first",
        "Tom",
        "tomorrow",
        "Southern",
        "Justine] Hello",
        "Lisa"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "PERSON",
        "DATE",
        "NORP",
        "PERSON",
        "PERSON"
    ]
}