{
    "id": "2lAo3VFAYoU",
    "title": "Sega Genesis Clone with HDMI!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-08-22T15:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=2lAo3VFAYoU",
    "category": "Science & Technology",
    "tags": [
        "Sega",
        "Genesis",
        "Mega Drive",
        "video game",
        "console",
        "gaming",
        "retro gaming",
        "16-bit",
        "clone",
        "cartridge",
        "HDMI",
        "high-definition",
        "Sonic the Hedgehog",
        "Street Fighter",
        "Columns",
        "review",
        "This Does Not Compute"
    ],
    "views": 54411,
    "likes": 1543,
    "comments_count": 228,
    "description": "While this clone Genesis/Mega Drive console plays original cartridges, does it do the gameplay any justice -- even with an HDMI output?  Fei Hao console link:   (There are multiple sellers on AliExpress for this item, search for \"16-bit console\" to see more of them.)  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Epidemic Sound ( and Lakey Inspired ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.aliexpress.com/item/HAMY-Newest-HDMI-TV-Out-Video-Game-Console-For-SEGA-MEGA-Drive-MD-Computer-with-2/32827639508.html",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.epidemicsound.com)",
        "https://soundcloud.com/lakeyinspired).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone. It's Colin, how's it goin'? The 16-bit era is a perennial favorite among retro gamers, and there are more and more ways to enjoy those classic titles. This is one of 'em, and while it may look like an ordinary Sega Mega Drive, it's got a feature that sets it apart. [ Music - Intro ] This is a Genesis, or Mega Drive clone, from Fei Hao, called the, uh... \"HD Retro Game?\" I guess? Anyway, it looks just a version one model, though it has some functional limitations we'll get to a little later. It plays original game cartridges, and I didn't notice any compatibility problems with my admittedly limited collection. A pair of controller ports up front work just fine with original and modern reproduction game pads alike, and in the box, a couple of wireless controllers are included too. They feel pretty cheap and you need to break out a screwdriver to change the triple A batteries, but since they use RF and not infrared like a lot of other clone consoles, they actually work pretty well. Just like the original, there's a headphone jack up front, and it works as expected. Around back is an unlabeled switch which, it turns out, lets you change game regions. Both NTSC (North American and Japanese) games are supported, but the console apparently won't play PAL games at all. Clone consoles can often feel cheap, and, well, this one's no exception. It's really lightweight and uses pretty flimsy plastic. While the buttons and switches do work, they don't really give confidence they'll hold up over time. Inserting cartridges is finicky too, taking some effort to properly line up the game with the edge connector. A peek inside the console shows that there aren't *any* internal guides. Likewise, removing games is a bit tricky, as that edge connector keeps a pretty good grip. Pulling a cartridge out always made me worry I was gonna break something. The console's cheapness extends to peripheral compatibility. It's based on a simple system-on-a-chip, and it doesn't support the Sega 32X attachment. It also doesn't work with the Sega CD, because despite the expansion slot cover being there, the connector itself isn't. On the back, adjacent to the DC input jack, are the analog outputs for composite video and audio. I'm not sure why those are even there, because this console's one redeeming feature is its HDMI output. Games are converted to 720p at 60 frames per second and lag is quite tolerable. Unlike analog connections, there's practically *no* color noise, and the image is bright and vibrant. There are a few considerations. First is that its native output is in 16:9 format, so for the proper aspect ratio, you need to set the input on your TV to 4:3 mode. Also, the image isn't quite as sharp as it could be. It seems like the HDMI encoder softens the image a bit, which is apparent when compared to the composite output. This may not be that big of a deal for some though, since a 1080p or 4K TV is just gonna upscale the image again anyway. But its still a big improvement over composite video, even compared to an original Genesis. Color saturation is much better, and the overall image is noticeably cleaner. That said, while video is a strong point on this console, audio seems to take a backseat. The sound is certainly better than some other clone consoles, but it seems a little lifeless and worse, it only supports mono. Have a listen for yourself: [ Chemical Plant Zone (Sonic 2) ] (HDMI ver.) [ Chemical Plant Zone (Sonic 2) ] (Analog ver.) I paid $70 US for this Fei Hao console on AliExpress including shipping. All things considered, that's not terribly expensive, though it's maybe not quite an impulse purchase either. It's certainly a capable console, but its poor build quality really holds it back. In the end, if you're looking for perfect audio and video, you'll need to look elsewhere. But if you're a casual Genesis or Japanese Mega Drive fan, this might be a decent option to bring your retro cartridge collection into the modern era. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Mega Drive",
        "Sega Mega Drive",
        "Mega Drive clone",
        "Japanese Mega Drive",
        "console",
        "Mega Drive fan",
        "Game",
        "clone consoles",
        "Mega",
        "ordinary Sega Mega",
        "Drive",
        "Sega Mega",
        "games",
        "Fei Hao",
        "image",
        "Fei Hao console",
        "video",
        "work",
        "clone",
        "retro"
    ],
    "transcript_entity_values": [
        "Genesis",
        "Chemical Plant Zone",
        "Instagram",
        "4:3",
        "Japanese",
        "Sega Mega Drive",
        "North American",
        "AliExpress",
        "jack",
        "Sega",
        "one",
        "4",
        "NTSC",
        "1080p",
        "this Fei Hao",
        "Sega",
        "16",
        "DC",
        "Colin",
        "Mega Drive",
        "Twitter",
        "K TV",
        "First",
        "$70 US",
        "second",
        "60",
        "Fei Hao",
        "HDMI"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}