{
    "id": "2Nt3J4ZvkbM",
    "title": "Does the Oppo Find N *REALLY* have a 136 part Hinge? - Teardown!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-01-27T16:25:56Z",
    "video_url": "https://www.youtube.com/watch?v=2Nt3J4ZvkbM",
    "category": "Howto & Style",
    "tags": [
        "oppo find n",
        "folding phone",
        "ultra thin glass",
        "utg",
        "samsung",
        "fold",
        "flip",
        "new folding phone",
        "best folding phone",
        "fold 3",
        "flip 3",
        "andorid",
        "smartphone",
        "apple",
        "iphone",
        "teardown",
        "hinge",
        "find n",
        "oppo foldable",
        "find n review"
    ],
    "views": 759005,
    "likes": 33925,
    "comments_count": 1407,
    "description": "How water resistant is the Oppo Find N? Go to  or text jerryrig to 500 500 to start using Audible today, and get your free audiobook. Today its time we find out what the Folding Oppo Find N smartphone looks like on the inside. Running Android, we can see how Oppo added water resistance to the Oppo Find N, and how many components make up the flexible hinge holding the two halves together.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://audible.com/jerryrig",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to take apart the Oppo Find N Folding smartphone. Oppo has said there are 136 different components inside of this hinge, all with their own extreme tolerances of 0.01 millimeters. So today we're going to take this apart and see if we can find all 136...which means this teardown is probably going to be pretty destructive. Speaking of destructive though, you know Audible is a sponsor of my channel and over the summer I listened to an audio book called Project Hail Mary that I'm still thinking about. It's written by the same guy who wrote The Martian. Project Hail Mary is about a guy who goes to space to save our planet from destruction. So if you enjoy space, cool science, and jerry-rigging everything, I think you'll enjoy Project Hail Mary as well. It's probably one of my most favorite novels of all time. You can get this audio book for free along with a 30-day trial using my link audible.com/jerryrig. Plus you'll get full access to the Audible Plus catalog with podcasts, Audible Originals, guided fitness programs and tons of other stuff with new titles being added all the time. When you download the Audible app though, don't forget about Project Hail Mary because it's pretty awesome. And rumor on the street is it's being made into a movie and the best time to listen to an audio book is before the movie comes out so we can all complain about the movie together. Audible.com/jerryrig for your free audio book, 30 day trial, and you keep getting a free audio book with every month of your subscription. You can cancel whenever you want. Huge thanks to Audible for sponsoring this video and sponsoring the channel. They are the best. Now it's time to see if this hinge really does have 136 component inside. Let's get started. [Intro] Normally I like to be gentle when taking apart a smartphone with the hopes that I can assemble it back together in one piece and have it all still work. This teardown though is not going to be one of those gentle dis-assemblies. We have a lot of things to find out, none of which allow this phone to live. We know that smartphone screens are usually pretty fragile, even more so when encased in a thin sheet of plastic instead of hardened glass. Oppo has included black plastic bumpers around the edge of the screen like we've seen on the Galaxy Folds. I imagine this helps keep the pressure off the screen as well as keep a relatively tight seal around the edge so that dust and drops of liquid stay out. But mostly I think the bumpers are here to protect the super fragile edge of the screen since that is where it has the least amount of protection. And one simple poke in the wrong spot kills the whole screen immediately, effectively, and permanently. The exterior screen is still alive but that one tiny poke on the inner screen sent the flexible display to swim with the fishes. Fine with me though. Now that it's toast we can be a whole lot less gentle. The coolest thing that we can see while ripping off the screen is the rubberized metal mesh that helps add structure to the bendy bits. Super flexible and elastic with a breaking and ripping point far beyond whatever experience with normal use. Gonna be honest...looks way cool. We'll unplug this green ribbon later. Oppo says that the display of the Find N is made up of 12 different layers. The only one we're interested in at the moment though is the ultra thin glass layer, similar to Samsung. Oppo touts this glass layer as a benefit to structure, durability, and overall feel of the screen. That's open to debate, but we can still find it. On top we have the transparent permanent screen protector. No glass here. But under that, attached to the tempted polarizer, I think we have it, the flexible UTG. Getting up close and personal with what's left of this layer we can see that it bends well enough but if the radius gets too tight you can hear and see the thin layer of glass crack. Oppo has done a good job of making the curve of the Find N pretty gentle. They say it's an 80% reduction over the crease we see in the Fold 3 or Galaxy Flip. The gentler the curve the easier it is on the display and the glass. Very interesting tech. I don't doubt that there are 12 layers of screen inside of this thing, especially if they are counting the metal backing, the screen, the rubber, and glue holding everything together. There's a lot going on in here. Going back to the phone itself, there's no easy way to access the guts from this side. In order to do that and expose the hinge, we'll need to enter from the other side. The phone is still alive at the moment, but probably not for much longer. This dissection runs straight through the middle. The only downside to having textured glass on the rear exterior panel is that my suction cup now does not have a smooth surface to grip onto when trying to lift up. It makes slicing away the adhesive rather difficult. Today though, that doesn't really matter. Apparently no part of this phone is getting out alive. The textured glass breaks just like the ultra thin glass and glass in general. Glass is glass, and glass breaks. Finally, the glass is removed with only minor subdermal incursions. There are a total of 28 screws holding down the components in this half of the Find N. The coolest thing though is underneath this wireless charger and silver bracket. It's how Oppo has decided to add water and dust resistance to their hinge. While this thing, of course, doesn't have an official IP rating, this blue rubber behemoth indicates a decent amount of ingress protection. I'll pop off the top plastics and wireless charger to get to the second silver bracket. These cover up the ribbons that traverse between the halves of the phone. And once again we find lots of rubber filling up the whole hole. It's not the caulking that Samsung is using but rubber stoppers still do offer good protection. Underneath all the Lego-style connectors are additional rubber gaskets. A lot of times when devices get water damaged it's because these pins get wet and shorted out or corroded by liquid, so it's nice that each of these plugs has it's own layer of protection. Of course, I still wouldn't take your Find N swimming. You'll probably be finding out it's dead afterwards, but it's good that the splash protection is there. The camera module comes out easy enough. It's probably one of the only parts of this phone that will survive. The top lens is a 13 megapixel telephoto with no OIS. The main 50 megapixel main sensor in the middle does have OIS. And the 16 megapixel ultrawide camera at the bottom does not have OIS. The loudspeaker comes out next. It does have the waterproof screen over the opening which is more good news for the overall water resistance. It also has a little black sticker protecting the balls inside. The foam balls inside the speaker provide more surface area for the sound to reverberate off of so the speaker can sound bigger than it actually is. The charging port itself is on its own ribbon with a red rubber ring around the opening. The vibrator motor is one of the rectangular boys, and lucky for us the battery has a pull tab. Batteries that come out easy are the best. This guy is a 2085 milliamp hour. And right now in 2022, lithium batteries are 95% recyclable, but they can only be recycled if they are easy to remove. So nice work Oppo for making that possible with this Find N. There's one more screw holding down the motherboard. And when that's removed the board is free from the phone. It's double stacked and looks pretty sweet with it's blue accents. And that's it for this half of the phone. In order to separate this wing from the hinge, there's a few more screws and the halves can pull apart. The ribbons pull through the side of the phone so that they can stay with the hinge. We'll get a close up look at that in a second. We have some counting to do if we want to find 136 components. I'll heat up the smaller front screen so that hopefully it will come off in one piece instead of shattering everywhere like the rear panel did. Safety glasses on. This time since we can use a suction cup, things should go a lot smoother and indeed it does. Once the two more screws holding down the ribbon to the motherboard are removed, the screen is free from the phone. This side of the phone is very similar to the other side so we'll speed run through it in order to get to that hinge. There are another 21 inch screws surrounding this half, along with another loud speaker, which also has waterproofing mesh around the opening, and has balls of its own. SIM card comes out, Legos get unplugged. This side also has the same massive rubber stoppers plugging up the ribbon channel holes through the hinge. And the battery is easy to remove. Thumbs up for that. It brings our total milliamp hour count to 4500. And once again, one more screw holds down the motherboard. It's amazing how many parts have to fit so perfectly together to make folding phones work. The engineering that goes into this thing is mind-boggling. With the ribbons loosened and the screws removed, we can pull the hinge away from this half of the phone, leaving us with a mechanism that controls it all. With apparently 136 components in this sliver of spine. It's not that I doubt Oppo about their counting skills but it's still good to double check. Plus we can see how it works as we go. Let's start with the screws. Ready. Count with me now. One. Two. Three. For some reason I don't hear you counting. There's only 133 objects left to find and we need to do this together. Teamwork. Apparently each of these screws have a little washer bracket thing that's attached under them as well, which I'm sure Oppo is including in their component numbers. This screw should be number 11 and the washer would be number 12. I have a feeling that counting every little component might be harder than we think. I'm sure we can still get close though. With all the screws removed, that exterior visible designed by fine spine can be removed. This guy is just one solid piece of metal that traverses the length of the phone. Since it's only one part we'll just count it as one. But including the ribbons we are now up to about 22 items. It looks like the rest of the hinge is divided into very three similar, yet separate, springed mechanisms, each with their own sprints, each with their own set of gears. And I don't doubt in the slightest that there are at least 30-40 individual parts in each of these sections. This thing is an impressive work of art and Oppo was definitely not padding their marketing by saying there's 136 components in here. After seeing it up close, I'm sure they all exist. This bad boy is far more complex than your average door hinge, and it's fun to see what allows this phone to open and close an estimated 200,000 times without failure. Nice work, Oppo. I'm not sure which part is cooler though, the flexible screen or the hinge that makes it all happen. What do you think? Let me know down in the comments. Remember your free audio book is down in the description right next to the link for my Jerry Rig Knives. Hit that subscribe button if you haven't already. Come hang out with me on Twitter and Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Project Hail Mary",
        "Hail Mary",
        "Project Hail",
        "screen",
        "Oppo",
        "Find",
        "phone",
        "glass",
        "hinge",
        "audio book",
        "free audio book",
        "Audible",
        "screws",
        "enjoy Project Hail",
        "Hail",
        "Mary",
        "called Project Hail",
        "thing",
        "Project",
        "audio"
    ],
    "transcript_entity_values": [
        "Project Hail Mary",
        "the summer",
        "2022",
        "Audible Originals",
        "Teamwork",
        "an estimated 200,000",
        "21 inch",
        "95%",
        "at least",
        "30 day",
        "30-day",
        "Galaxy Flip",
        "80%",
        "Lego",
        "Instagram",
        "136",
        "two",
        "4500",
        "Martian",
        "Glass",
        "three",
        "my Jerry Rig Knives",
        "this half",
        "2085 milliamp hour",
        "Two",
        "Twitter",
        "the Galaxy Folds",
        "Oppo",
        "Three",
        "only one",
        "only 133",
        "number 11",
        "Project Hail Mary",
        "28",
        "Hail Mary",
        "second",
        "0.01 millimeters",
        "milliamp hour",
        "13 megapixel",
        "Samsung",
        "today",
        "about 22",
        "12",
        "Today",
        "3",
        "16 megapixel",
        "One",
        "Oppo",
        "Audible",
        "50",
        "one",
        "the Find N",
        "IP",
        "UTG"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "FAC",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG"
    ]
}