{
    "id": "2Q0bLo5nSsU",
    "title": "This server lives underwater! - Hypertec Immersion Cooling",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-17T01:59:57Z",
    "video_url": "https://www.youtube.com/watch?v=2Q0bLo5nSsU",
    "category": "Science & Technology",
    "tags": [
        "server",
        "immersion",
        "cooling",
        "dielectric",
        "mineral oil",
        "air cooling",
        "fans",
        "liquid cooling",
        "water cooling",
        "submer",
        "smartcoolant",
        "datacenter",
        "efficiency",
        "hvac",
        "pump",
        "loop",
        "cold water",
        "hot water",
        "environment",
        "submersion",
        "submerge",
        "rack",
        "xeon",
        "nvidia",
        "intel",
        "gpu",
        "compute",
        "siggraph"
    ],
    "views": 2190884,
    "likes": 75397,
    "comments_count": 2564,
    "description": "Learn more about MSI's back to school sale and giveaway here:   Cooling is an expensive business for servers and datacenters, often involving HVAC. As CPUs and GPUs pull more power, more exotic solutions are needed  Enter immersion cooling!  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:52 Mineral oil? No... 2:19 Why dunk your server? 3:18 No HVAC and no fans means lower power and better reliability 4:05 We're gonna need it real soon 4:43 Nothing goes to waste 5:44 Dunk the ports, too, it's all good 6:21 What about dust, dirt, and other problems? 7:19 Conclusion - Who's this for?",
    "description_links": [
        "https://msi.gm/3Q5BRWn",
        "https://linustechtips.com/topic/1449840-this-server-lives-underwater/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- There are six (attendants chattering) $10,000 computers (register dings) completely submerged in here. (water burbling) Like, no, really this entire rack is filled with a solution (air swooshing) that cools better than water, dissolves in water, and it's absolutely 100% safe. But how can fellow Canadians Hypertec get away with dunking in this very expensive gear like their Luke AKA Slick PC? I'll tell you how, right after I tell you about our sponsor. MSI! MSI's Back to School Sale is on now, where you can save on laptops, desktops, and components. There's also a giveaway to win some sweet prizes. Learn more at the link below or at the end of this video. (upbeat music) - Anyone who's been a fan (attendants chattering) of the channel will know that we've built several total immersion mineral oil PCs. So like what's new here? Well, this isn't mineral oil nor is it some flammable alternative. This tank, which is a show tank that's about half the actual length is filled with a dielectric or non-conductive mixture that's significantly lighter than most popular alternatives while also being better at conducting heat. Given that's pretty much it's only purpose, any improvement there is obviously welcome. To add insult injury, the mixture is also a lot better for the environment. It breaks down safely in water. Mineral oil by comparison is a petroleum byproduct with a laxative effect at best and is a carcinogen at worst. I'm told that this mix is straight up safe to drink. Not that I really wanted to try it after being on the showroom floor for three days but it did end up getting something splashed into my mouth so I can tell you that it doesn't taste great. That was warm, also, I tasted some. I'm assured that it's not 3M's Novac 649 as well. That stuff likes to boil and is dangerous to inhale. They wouldn't tell me what this stuff is exactly, but it's also not a hydrofluoroethane like Novec 7000 either. Your guess is as good as mine. Oh, and they're making the chassis out of ocean recycled plastics by end of year, as well, at least that's what they hope to do, but let's back up a sec. Server racks in data centers are already cooled by high end air coolers and even liquid coolers. So why are we even talking about this? Well, there's a few reasons. First and foremost, this rack has zero fans and is basically silent by comparison. It works by pumping the coolant through a loop to an exterior box that looks a bit like an HVAC unit. That box exchanges the thermal energy from the hot mixture to a cold water source in a single phase arrangement. That means practically all of the noise it does make, some pump basically, ends up well outside of the room. Because the installation doesn't require raised floors or a bulky chiller units inside the data center, it's relatively easy to retrofit into existing architecture. What's more, because all the heat is exchanged well outside of the rack, the rack itself needs no HVAC to cool it. Something we've struggled with in our own relatively tiny server room. That means significant power savings, because not only does HVAC, that's beefy enough to cool the entire server room or data center require a massive amount of juice, so too do the high performance fans that you hear screaming inside of those racks. Hypertec claims a 30 to 40% reduction in cooling costs compared to HVAC alone, along with a 60% better hardware lifespan and to achieve that, they painstakingly removed all of the fans from the hardware inside of the systems and replace their RPM sensors with sensors to monitor the temperature of the cooling solution as well as updating the BIOS to understand that. This results in far less moving parts, which are typically the most likely to fail, all while retaining the original warranty thanks to their partnerships with hardware vendors like our good friends at Nvidia. Speaking of Nvidia, they're part of the reason why Hypertec is here to begin with with this immersion rack. Rumor has it that the upcoming newer generations of GPUs and CPUs alike are gonna be designed to draw more and more power. Meaning that traditional cooling solutions will struggle to keep up without more exotic cooling solutions like Hypertec's. Hypertec says that their solution can handle basically any load they can foresee, up to nearly a hundred kilowatts, and they can tailor the installation to meet the demand if for some insane reason, that's not enough to dissipate all of the heat your rack's blasting out or I guess sucking out. Now, in a traditional data center, the systems inside it generate a boatload of waste heat, like effectively, a hundred percent of the electrical energy a computer consumes ends up converted to thermal energy or heat. Then we had to use even more electricity to get rid of said thermal energy, which we call cooling. Now, we've already told you how this takes the cooling electricity draw outta the equation, but what if I told you that the heat electricity draw, which there's no way around, we need that for computers to work could be used for something else? Hypertec claims that 99% of the heat generated inside the loop can be captured as water. They already have deployments that dump the heat into a building's hot water loops and inflow radiant heating to either provide extra thermal capacity to those systems or even power them outright. That works out to a significant energy savings because not only do you then not have to deal with HVAC, you're also not footing as big a bill for water boilers, especially if otherwise you'd have to upgrade a loop as you need to expand. One thing you might be wondering at this point is, aren't those ports submerged too? And yeah, I was wondering the same thing. When we built our mineral oil PC, we let the IO ports on the motherboard and GPU exposed but here all hardware maintenance is done with the dielectric mix already in the tank, and that includes plugging and unplugging connectors. I'm told that the mixture is thin enough that electrical connections can be made reliably, although fiber optic cables need to be plugged into their SFP transceivers first, because of how sensitive they are. A thin film of dielectric is enough to prevent reliable transmission if you were to just shove it in there. And speaking of shoving things in there, like, while you don't have to worry about dust buildup as you do on traditional air cooling, you're meant to work directly inside the dielectric. So that means oils, bacteria, and yes, dust particles will collect inside the loop from time to time. That's where the loop itself comes in. Because the coolant is constantly cycling, they can filter it later down the chain in the easy to access panel that makes cleaning much easier than a traditional rack where you'd have to dust them individually from time to time. They told me that you could theoretically drop a coffee in there and it'd be okay, thanks to that filtration, although I'm sure they wouldn't recommend trying it if you can help it. Under normal conditions, they expect that the coolant will last for about 15 years as compared to the two phase coolers that are available now that use evaporation that need topping up every two years because they're actually losing the coolant. And when the time comes for the solution to be recycled the solution can actually be reconstituted with a simple dialysis. You don't even need to drain it and replace it. On the show floor here, they're trying to attract media companies with render firms that need massive GPU horsepower. A full size tank of one of these can contain 144 Xeon Render Blades with GPUs and with the stuff that Nvidia has been showing off with photogrammetry and AI digital twin simulations, it's becoming ever more important for the even smaller outfits that have access to that kind of compute. If the TDP rumors are true of Nvidia's upcoming RTX 40 series, AKA Ada Lovelace, then achieving that will come at a significant cost to upgrade existing server racks. And that's to say nothing of the environmental impact traditional setups will have, not just running, but cooling all of that extra hardware. It's unorthodox, but it might just be a crazy like a fox kind of situation that makes more sense the more you think about it. Maybe I can convince Linus to submerge our server room so we don't have to stop filming every time the door opens. And maybe I can convince you to hear about our sponsor. MSI! MSI's Back to School Sale is on now. Looking for a new laptop for next semester? They got those, or what about a desktop PC that is totally for school and not for gaming, mom, I swear? Well, you're covered there too. And if you're into building your own PC, they even have components on sale. MSI is also doing a Gleam giveaway where you can win sweet prizes, like a full blown gaming desktop or an MSI GeForce RTX 3080 Ti Gaming X Trio graphics card. You can find out more about MSI's Back to School Sale and how you can win these prizes in the link below. - Thanks for watching guys! (upbeat music) We don't typically cover SIGGRAPH but this year we felt we almost had to. For more server room shenanigans, go check out our end game storage solution of 270 hard drives. Oh, right! I guess that means that it can't be submerged. Oh, well.",
    "transcript_keywords": [
        "MSI Back",
        "MSI",
        "Luke AKA Slick",
        "heat",
        "cooling",
        "rack",
        "School Sale",
        "Hypertec",
        "HVAC",
        "inside",
        "water",
        "mineral oil",
        "solution",
        "server room",
        "Server",
        "time",
        "end",
        "fellow Canadians Hypertec",
        "Nvidia",
        "Back"
    ],
    "transcript_entity_values": [
        "40",
        "nearly a hundred kilowatts",
        "one",
        "IO",
        "10,000",
        "first",
        "TDP",
        "Ada Lovelace",
        "One",
        "Novec 7000",
        "three days",
        "First",
        "zero",
        "HVAC",
        "every two years",
        "GPU",
        "end of year",
        "3080 Ti Gaming X Trio",
        "Canadians",
        "MSI",
        "SIGGRAPH",
        "AI",
        "Hypertec",
        "270",
        "100%",
        "3",
        "a hundred percent",
        "30 to 40%",
        "Novac 649",
        "next semester",
        "Nvidia",
        "Luke",
        "six",
        "about half",
        "sec",
        "60%",
        "Linus",
        "two",
        "99%",
        "this year",
        "about 15 years"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "DATE"
    ]
}