{
    "id": "2rjd_086U3A",
    "title": "I've Been WAITING For This!!! - Apple Watch 7",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-10-30T22:03:01Z",
    "video_url": "https://www.youtube.com/watch?v=2rjd_086U3A",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Watch",
        "Watch 6",
        "Watch SE",
        "Watch 7",
        "Always on display",
        "Time",
        "Apps",
        "Smartwatch",
        "2021",
        "Packaging",
        "Setup",
        "Pairing",
        "Bluetooth",
        "Activity tracker",
        "Heart Rate",
        "ECG",
        "EKG",
        "Gaming",
        "Fitness",
        "O2 monitor"
    ],
    "views": 848418,
    "likes": 35726,
    "comments_count": 1822,
    "description": "Get 10% off all Jackery products with code LinusTechTips at   Apple's New Watch 7 makes some modest improvements from the Watch 6, but there are some significant changes if you use an SE or older.  Sarah has been holding off upgrading from her Watch 3 and this version might be something she'll risk stealing from the office.   Buy Apple Watch 7  On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):   Buy Apple Watch 7 Accessories On Amazon (Paid Link):  On Best Buy (Paid Link):  On NewEgg (Paid Link):  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:12 - Unboxing 2:31 - Watch 7 differences 2:54 - Charging Cable 3:08 - Battery life and charging 3:24 - Sponsor - Jackery! 3:57 - Pairing 4:27 - Using the Watch 7 6:15 - New Watch Apps 8:15 - Hand Gesture Impressions 8:57 - Activities Addition 9:23 - Final thoughts",
    "description_links": [
        "https://www.jackery.com?aff=27",
        "https://geni.us/lCxeEr",
        "https://geni.us/OZZDX",
        "https://geni.us/IoGUSDq",
        "https://geni.us/trGCEYr",
        "https://geni.us/ixpiUb",
        "https://geni.us/Qic5b5",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Is it data, data or daddy? (laughing) - [Jono] Sarah! Oh my- (all laughing) I am so excited to be unboxing, the Apple Watch Series 7. I myself have an Apple Watch Series 3. So I'm hoping this is a good enough upgrade, so that in the future I can steal this one. - [Jono] No. (Sarah laughing) The packaging is super clean. That's exactly what I would expect from Apple, white, simple. It really helps feature the product itself, which is, it looks like the 45 millimeter green aluminum case. I do love how they feature these cute little illustrations on the packaging. I haven't seen that with Apple products before. It's embossed or de-bossed and everything, eh? - [Jono] Packaging nerd. (Sarah laughing) - All right. Oh. Oh, I ripped it. - Oh! I guess you have to take it now. - All right. The unboxing process... (laughing) it's a little trickier. Okay. It's turning on now. I prefer the black watch over the other options that they have. But if you want something a little more funky, they also have a green, a red, a blue, and the Starlight color. - [David] What color is Starlight? - [Sarah] Starlight, it's kind of a white-ish color. I don't know how else to describe it. They also offer two other finishes. They have the stainless steel options and the titanium options. - [Jono] I call those moneybag options. - Yes, exactly. They are quite a bit pricier. You know, I could un-box just the Hermes bands, because they are even more expensive than any of the watch bodies. - [Jono] Wait, wait. You pronounce it as Hermes? - [Sarah] It's Hermes. - [Jono] Isn't it Hermies? - [Sarah] No! - [David] 'Cuz it's French. - [Sarah] It is French. - [Jono] Okay. - I really do love this packaging with the watch bands. In previous generations, I don't recall them including instructions as to how to do it so clearly. So I will say, attaching the strap to the watch does feel a bit cheap or flimsy, but once it's in there, it's in there. The display of the new watch is IP6X certified, dust resistant. The crystal is the most crack-resistant that we've seen so far. First person, I thought of was my dad, 'cause he's a carpenter. He has like a Fitbit or something. It's always so dusty. And he gets dust in all of the little crevices. So this is really nice. The new Watch 7 is actually 20% larger than the Apple Watch SE, and 50% larger than the Apple Watch Series 3, which is why I'm most interested, because I would love to have a larger screen, so it's easier to see while I'm just living my life. Another difference between this generation and the last, is that the charging cable is actually USBC now. So you can plug it into your MacBook Pro, and not have to worry about using a dongle, which I always need to do. The cable feels thicker. I don't know if that's just me. My dog ate through my last one. The Watch 7 features an up to 18-hour battery power, which is the same as the Series 5 and 6. The only difference is that this one charges up to 33% faster, which means that for people on the go, this is way more convenient. While my phone is updating, might as well segue to our sponsor. Thanks to Jackery for sponsoring this \"Short Circuit.\" Their Explorer 1500 portable power station has enough juice to keep all your devices powered and connected. It's huge, 1500-watt hour capacity and 1800-watt output rate, allows up to seven devices plugged in simultaneously. Takes only four hours to recharge up from zero to 80%. Check out the Explorer 1500 at the link below, and use code LinusTechTips for 10% off. We're finally ready to set up my Apple Watch, and pair it with my phone. I will mention that the pairing process for the new Apple Watch 7 is very similar to the other series. Super, super easy and convenient. You could pretty much set it up anywhere. Pairing failed! Excuse me? - [Jono] So easy. - I would like to revoke my statement. My phone would not pair with the Apple Watch for the life of it. So I'm gonna be using Jono's phone instead. Hello? Oh, there we go. You're wondering if there's anything else really different with the internals of the Apple Watch Series 7? Well, there isn't. It shares the same 64-bit dual core processor as the Series 6. The connectivity specs are the same as the last generation when it comes to wifi, data and Bluetooth. Wow. Spiffy. This watch band is a little big for my wrist, but that's okay. Do you want to share the analytics with Apple? - [Jono] No! (all laughing) - Is it data, data, or daddy? (laughing) - [Jono] Sarah! Oh my- (all laughing) - Get to know your watch? We're gonna become friends. (giggling) I will say the watch band is quite comfortable. It feels like it forms to your wrist. The silicon one kind of did that as well, but this one is lighter, almost. I feel like my skin can breathe better. Yay. Oh, I don't want tips. You got to go to LTT for that. (laughing) This man's right here. Mr. Linus Sebastian himself. So one great feature that the Apple Watch 7 offers is the always on retina display, which I love because with my Series 3, I always find myself flicking my wrist towards me, and smacking it to turn it off. As a designer, I always like to match my Apple Watch screen to my outfit. So let's see what they have for new faces. It looks like they have added this one for the new Series 7, and I'm gonna change the color to match what I'm wearing today. So let's find a gray. Perfect, look at that. And you can also use your own photos. So if you want to be reminded of your cute dog every two minutes, then hey, so be it. You can change it to that, as well. The newest applications Apple has added to the Series 7, is the blood oxygen level detector and the ECG test, which are both not recommended for people who are under 22, which is myself. - [David] Why? - Maybe it just can't get an accurate reading. I'm just gonna test my heart rate, right now. (laughing) (Jono making a siren sound) (Jono clapping) (Sarah laughing) So this is how you can tell I'm actually nervous. I try not to show it, but this is literally what my heart rate is like all the time. As I got older, I started getting heart palpitations, and I didn't know why I was getting really bad pains in my chest, until I used my Apple Watch to check my heart rate, and it was at like 190. - [Jono] What, what? - Yeah And that would happen to me every like six or seven months. And it still happens to this day. So it is super-handy for me to have a heart rate on my wrist all the time, just so that if I can see my heart rate is up, I can use coping mechanisms or breathing mechanisms to help me bring it back down. Oh, blood oxygen. All right. Let's see how this works. \"Keep your watch facing up and try not to move, \"resting your wrist on the table can help.\" Okay. My wrist is indeed rested on the table. So my blood oxygen is at 95. This actually might be really good for someone with asthma. That's cool. There's a menstrual tracking cycle thing. - [Jono] Are you serious? - Yeah, there is. Oh, I have to open my health app, which is actually Jono's health app. And I don't think he's tracking his menstrual cycles. I'm just finishing up setting up the ECG, and there are some disclaimers, which is good. Thanks Apple, for telling me that I should not use this as a way to track whether or not I'm having a heart attack. (laughing) It's quite snug on my left wrist. You can see my skin is kind of popping out there. There we go. My heart rate is a 106 beats per minute average. So I saw this trick on TikTok that I would love to try out just to see if it actually works. So basically you can set your Apple Watch to open Apple Pay or Siri or some other features by simply just making a fist. So what I'm gonna do is go to assistive touch, and then hands gestures, and if I go into clench, I can actually change it to any of these options. Like, am I doing it wrong? What else is a clench? Like this is a clench, right? - [Jono] Yeah, you're clenching your fist. - Yeah. Hello? (scoffs) I'm sad about this. I really thought it was gonna work. So one last determining factor for me is Linus mentioned a little while ago that there was a fervorous intense, calorie-burning activity that is not in the sports app. I'm talking about badminton, by the way. Thanks. So I wanted to see if that is available now. Add work out. Okay, let's see. Oh, there it is. Look at that, badminton. So if you play badminton. While the visual aspects of this new Series 7 Apple Watch have changed quite a bit, the retina screen and the crystal display are really great new features. But if you're trying to upgrade from a Series 6 to a Series 7, honestly, I don't think it would be worth it. On the other hand, if you're like me and are stuck with a Series 3, then maybe you do want to upgrade. I'll leave that up to you and to your judgment, since I was having problems with a couple of the features. Maybe after time, they'll get easier and work better. But if you wanna learn more about the Apple Watch 7, and hopefully watch somebody who doesn't have as many issues as I do, then I suggest going over to our Mac Address channel and watching Jonathan go over all of the features and review the new Apple Watch 7. Or if you aren't an Apple user like myself, check out Jake's unboxing of the Samsung Watch 4, on this channel. Thanks for watching.",
    "transcript_keywords": [
        "Apple Watch Series",
        "Apple Watch",
        "Watch",
        "Apple",
        "Watch Series",
        "Series",
        "Apple Watch screen",
        "heart rate",
        "watch band",
        "heart",
        "rate",
        "wrist",
        "features",
        "Apple Pay",
        "options",
        "Samsung Watch",
        "love",
        "data",
        "Apple products",
        "packaging"
    ],
    "transcript_entity_values": [
        "USBC",
        "only four hours",
        "3",
        "Apple Watch",
        "LinusTechTips",
        "French",
        "6",
        "the Apple Watch",
        "TikTok",
        "Jonathan",
        "six or seven months",
        "Jake",
        "the Apple Watch 7",
        "the Samsung Watch 4",
        "106",
        "one",
        "20%",
        "this day",
        "zero to 80%",
        "under 22",
        "an Apple Watch Series 3",
        "64",
        "Siri",
        "French",
        "the Apple Watch Series 3",
        "LTT",
        "190",
        "the Series",
        "the Explorer 1500",
        "Apple Watch 7",
        "Sarah] Starlight",
        "Jono",
        "1500-watt hour",
        "Starlight",
        "Linus Sebastian",
        "45 millimeter",
        "18-hour",
        "two",
        "Sarah",
        "the Apple Watch Series 7",
        "Jackery",
        "up to seven",
        "10%",
        "Hermes",
        "7",
        "the Series 7",
        "the Apple Watch SE",
        "Mac Address",
        "Explorer 1500",
        "50%",
        "ECG",
        "the Series 6",
        "ECG",
        "MacBook Pro",
        "95",
        "Linus",
        "up to 33%",
        "every two minutes",
        "First",
        "Starlight",
        "Hermies",
        "Watch 7",
        "The Watch 7",
        "1800-watt",
        "Apple",
        "today",
        "IP6X",
        "Fitbit"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "LANGUAGE",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "EVENT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "TIME",
        "ORDINAL",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT"
    ]
}