{
    "id": "2rRyWUChTuw",
    "title": "Samsung CES 2019 event in 9 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-01-08T00:30:32Z",
    "video_url": "https://www.youtube.com/watch?v=2rRyWUChTuw",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "samsung event",
        "samsung ces",
        "ces",
        "ces 2019",
        "event",
        "samsung notebook 9",
        "notebook 9 pro",
        "samsung notebook 9 pro",
        "smartphone",
        "laptop",
        "samsung developer",
        "2019",
        "press conference",
        "tech news",
        "home entertainment",
        "first look",
        "hands on",
        "is it worth it",
        "2018",
        "consumer electronics show",
        "ces 2018",
        "tv",
        "tablets",
        "desktops",
        "new tech",
        "gadgets",
        "technology",
        "review",
        "tech review",
        "tech",
        "top 10",
        "led",
        "oled",
        "latest updates",
        "did you know",
        "apple",
        "google",
        "android",
        "iphone",
        "verge",
        "the verge",
        "vox"
    ],
    "views": 763495,
    "likes": 10839,
    "comments_count": 1125,
    "description": "The Samsung CES press conference opened with huge TVs and closed with adorable blinking robots, with plenty of additional screens, smart features, and bad jokes packed in between. Here's our trimmed down version of all the announcements.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2RzbE80",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Welcome to CES 2019. Let's move on to connectivity and speed. We start with 5g, which will transform every aspect of how we live, how we work, how we play with it's high speed and massive capacity and low latency. And in the first half of this year we will introduce 5G smartphones to the market. And we are also working very closely with Googles to bring Google Maps, Gmail, Google Play, and YouTube to the big speed platform soon. - And today I'm thrilled to introduce our brand new 98 inch QLED 8K with Quantum Dot technology and direct full array local dimming. This TV can deliver incredible color and enhance contrast that other competing displays simply can't. And when native 8K content is available, the new QLED 8K TV is ready to support HDMI 2.1. We're also leveraging the power of AI to upscale your current content to pristine 8K quality regardless of the native resolution. We use machine learning to create thousands of algorithms embedded in our Quantum Processor 8K, that precisely sharpen details, eliminate jagged edges and restore pixels. This processor is powerful enough to take any image and render 33 million high res 8K pixels in real time. In addition to the 98 inch TV here, we're also offering 8K in 65, 75, 82 and 85 inch screen sizes. And I'm happy to announce, starting today, select 2019 QLED 8K TV's will be available for pre order in the U.S. Samsung customers in over 100 countries will be able to enjoy iTunes, movies and TV shows debuting only on Samsung smart TVs starting this Spring. Our smart TVs will be compatible with Apple AirPlay 2, meaning you can effortlessly play content from your iOS and macOS devices directly to your Samsung smart TV. Our smart TVs will also work with Bixby, Amazon Echo and Google Home giving you another way to control your TV with your voice. - Today we're taking what people love about Family Hub and we're making it more intelligent and more intuitive. Families can share information and memories in more natural, interesting and personal ways. An AI cuts through the friction, leaving more time to do what you love. And now for 2019 we're introducing Family Board. A creative new canvas with new ways to personalize messages, leave photos and notes and even share art and music. Bixby really comes to life on Family Hub for 2019. Full voice activation, customized information, and new ways to do more in the kitchen by interacting with other devices across the home. I just got back from an amazing skiing vacation and we posted all of our favorite pictures right here to the Family Board. - So I'm gonna actually post a picture from my phone and share it with Family Hub. There you go. Bingo. - Wow, it's amazing how quickly you can get that photo. - Family Board is actually a lot of fun to play with. So for example, you can zoom in and out, you can rotate it around. I could also add, like stickers for example. You know, I'm gonna select the awesome sticker because it's awesome to have motorcycle riding experience and I'm gonna make this big because it's really awesome. - These new capabilities will come with all Family Hub models in 2019 and will be available to thousands of current Family Hub customers via automatic updates. - I'm excited to introduce our next great step, the Notebook 9 Pro. It comes with an 8 generation Intel Core i7 processor. Eight gigs of RAM and starts with 256 GB of storage. And it's lightning fast. Equipped with the latest cutting edge gigabit wifi technology. We also just announced a Notebook 9 Pen. With the Notebook 9 Pen you get all the same power and performance, plus the embedded S Pen that you've come to love in our Galaxy Note series. Connecting you to the mobile phone ecosystem you've come to expect from Samsung. And we did not forget about you gamers out there. We're excited to release the new Notebook Odyssey. Powered by the Intel 8 generation hexa core i7 processor. The new NVIDIA GeForce RTX 20 series GPU and coupled with a modern cooling system, the Odyssey let's you game on the go without compromising on performance. As how we work is evolving, our workspaces need to evolve too. And well, be more flexible. That's why we created the Samsung Space Monitor. The Space Monitor comes with a minimalist arm, that clamps to your desk to free up room. It's easy to set up and adjust. But when you aren't using it, you can store it flat against the wall. It even keeps the cables hidden in it's arm. - Digital Cockpit 2019 offers an in car experience that seamlessly blends with your smart lifestyle. Delivering in three key areas: connectivity, personalization, and safety. Fully integrated with Bixby, the 2019 Digital Cockpit gives you total control of your connected life. Not only can you control your home from your car. You can also control your car while you're in your home. Second, the 2019 Digital Cockpit is personalized. Using onboard cameras, the new Digital Cockpit, recognizes specific drivers and passengers and sets up the car space accordingly. We've also doubled the number of screens to a total of six so every passenger can enjoy a personalized experience and now all passengers can also connect to in vehicle Samsung DeX to get work done on the go. The new Digital Cockpit allows for a safer driving experience. With our middle replacement vision system and camera based safety solutions we can alert drivers of nearby moving objects, keep drivers from dozing off while on the road and help vehicles understand traffic conditions ahead. - Samsung Bot Care helps consumers manage their daily health routines. Samsung Bot Air uses sensors to detect the precise source of pollution and purify the air. Samsung Bot Retail personalizes the retail experience and streamlines ordering and paying. And Samsung Gems assists with walking, helps improve mobility and helps athletes train better. - Samsung Bot Care also gives daily health briefings, shares exercise guidance and tracks medication intake. It's a partner for every day tasks to help keep you healthy. - Samsung Bot Care can you take my vitals? - [Bot Care] Let's check your vitals. - [Man] Okay. - [Bot Care] Please place your finger below the screen. - Okay so I guess something like this. - Samgsung Bot Care can also monitor sleep cycles or provide a music therapy to reduce stress. And can sense an emergency, like a fall, and immediately notify 911. - [Bot Care] You have a normal blood pressure reading of 114/84. - Well thank you very much, it's been a pleasure. - [Bot Care] You're welcome. - Thank you and have a great CES 2019.",
    "transcript_keywords": [
        "Samsung Bot Care",
        "Family Hub",
        "Samsung Bot",
        "Digital Cockpit",
        "Samsung",
        "Bot Care",
        "Family Board",
        "Family",
        "Bot",
        "Hub",
        "current Family Hub",
        "Family Hub customers",
        "Samsung Bot Air",
        "Samsung Bot Retail",
        "Cockpit",
        "Digital",
        "Samsung smart",
        "Samsung Space Monitor",
        "Family Hub models",
        "Notebook"
    ],
    "transcript_entity_values": [
        "the Family Board",
        "Google Play",
        "Google Home",
        "K TV's",
        "Quantum Dot",
        "2.1",
        "Amazon Echo",
        "Samsung Bot Retail",
        "75",
        "Second",
        "Bixby",
        "U.S.",
        "GPU",
        "Samsung Gems",
        "Gmail",
        "Family Hub",
        "the Samsung Space Monitor",
        "three",
        "114/84",
        "AI",
        "Googles",
        "today",
        "Bixby",
        "the Notebook 9 Pro",
        "a Notebook 9 Pen",
        "the Notebook 9 Pen",
        "Family Board",
        "Samsung Bot Air",
        "K TV",
        "8",
        "5",
        "98 inch QLED 8K",
        "six",
        "98 inch",
        "the first half of this year",
        "33 million",
        "The Space Monitor",
        "20",
        "Notebook Odyssey",
        "daily",
        "Eight",
        "Samsung",
        "thousands",
        "Apple AirPlay 2",
        "Samsung Bot Care",
        "Digital",
        "82",
        "256",
        "911",
        "Intel Core",
        "this Spring",
        "2019",
        "Google Maps",
        "Samsung DeX",
        "65",
        "YouTube",
        "85 inch",
        "hexa",
        "NVIDIA",
        "100",
        "Intel",
        "2019 QLED 8",
        "Galaxy Note",
        "RAM",
        "every day",
        "S Pen",
        "Quantum Processor",
        "iTunes",
        "Family Hub"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "EVENT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "EVENT",
        "ORG",
        "ORG",
        "ORG"
    ]
}