{
    "id": "2S_9oTRjaoc",
    "title": "Dear iPhone Users...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-04-18T15:54:40Z",
    "video_url": "https://www.youtube.com/watch?v=2S_9oTRjaoc",
    "category": "Science & Technology",
    "tags": [
        "iphone",
        "ios",
        "android",
        "switch to android",
        "oneplus",
        "one plus",
        "oneplus 8",
        "oneplus 8 pro",
        "8 pro",
        "samsung",
        "galaxy",
        "samsung galaxy",
        "samsung galaxy z flip",
        "z flip",
        "samsung flip",
        "samsung galaxy flip",
        "iphone 11",
        "iphone 11 pro",
        "smartphone",
        "phone",
        "the test drivers",
        "test drivers",
        "myke hurley",
        "this is",
        "austin evans"
    ],
    "views": 998843,
    "likes": 41217,
    "comments_count": 6953,
    "description": "We need to talk: between the OnePlus 8 Pro and Samsung Galaxy Z Flip it's finally time. Listen to Myke and I on The Test Drivers!  Why you SHOULD switch to iPhone:  How to get iMessage on Android   Our second channel @thisis!  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.relay.fm/testdrivers",
        "https://www.youtube.com/watch?v=FFEexis10Ss",
        "https://www.youtube.com/watch?v=oqysv9Ft2LM",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- So no, this title is not clickbait. I really do feel like it's time to consider switching to Android from iOS. So just give me a couple minutes to make my case. So I've been primarily daily driving an iPhone ever since the 5S back in 2013. Now before that I pretty regularly use Android. I mean phones like the Galaxy Note II and the HTC One M7 really were way ahead of their time, especially compared to the iPhones of their day. But once I got my hands on that iPhone 5S I was hooked. Part of it was the camera was absolutely top of its class for back on its day. But on top of that, the performance, and especially the fact that iOS 7 was such a big step forward and the design really did draw me back over to the iOS side of the camp, and once I was in, I was in. FaceTime, iMessage, the lock-in that you find with these Apple devices is really real. And in the last seven years I really haven't had a huge incentive to go outside of the iOS ecosystem. Yes, I can and absolutely have continued to use Android devices as a secondary device, right? So when I'm reviewing something, when I'm spending time with it, I will absolutely switch over to that device. But after the week or couple of weeks or whatever the case is, that iPhone always has slid back but not anymore. All of this started to change with this, the OnePlus 7T. Now, like most other devices when I got it, I started to do my video on it, I spent some time with it. But the difference was this stuck around in my back pocket for most of last year, at least most of the end of last year, and for a couple of major reasons. First of all, I've always appreciated OnePlus phones for the very clean simple build of Android, with a lot of emphasis on performance. So that's one of the things have always drawn me to the iOS side of the camp. Because iPhones almost without fail since that 5S had been one of, if not the most powerful phone that you can get your hands on, and the 7T especially with its 90 hertz display, made some huge strides in really pulling me away from the iOS ecosystem. Because I realized, this phone had pretty much everything I needed except for a good camera. Naturally, that brings us to today where we of course have the OnePlus 8 as well as the OnePlus 8 Pro. Now these phones really do promise to deliver a full flagship experience. And specifically I spent a lot of time the last few weeks using the OnePlus 8 Pro. This display with a 120 hertz refresh rate and honestly excellent color, excellent resolution. The entire package has been one of the most appealing things that I have ever laid my eyes on in the phone space. But when you look at just how smooth this phone is, you look at how much work the OnePlus has done on optimizing all aspects of this phone, right? With Snapdragon 865, with the high end LPDDR5 memory, with the fact that they've done a lot of work on the optimization side of Android, and you pair that all with probably what is the best display on any phone out right now, it was immediately something that drew me away. Now that's not to say that you should overlook the standard OnePlus 8. Again, this is not only a cheaper phone and it does have a lot of major features including 5G, which we'll get into a little bit later, but this still does have an excellent KDP 90 hertz display, very similar to that 7T last year that really drew me over. Sure, if all you're looking for are benchmarks, then the iPhone still is an absolutely incredibly powerful device. Both the iPhone 11 as well as the 11 Pro have the incredibly powerful Apple A13 chip, and while yes, they may only have four gigs of RAM, a.k.a one third as much RAM as my OnePlus 8 pro here, there's something to be said for these sheer leadership that Apple has had and continues to have in the actual chip space. Where it starts to fall behind, is when you look at the overall package. For example, both the OnePlus 8 as well as the 8 Pro have full fat 5G built in. Now sure, Apple will likely bring out a 5G iPhone in six months or whatever, but I don't care about six months from now, I care about the experience I can get today. Not only do they continue to have their Warp Charge 30, which will charge the entire phone up to a 100% in less than an hour, but they also now have Warp Charge wireless. Now this is something that I've dinged OnePlus on many times in the past. While the 7T and the 7 Pro last year were very, very solid, they weren't the full package, right? The camera wasn't really there, there was no official water resistance and there was no waterproofing. When you look at the 8 Pro, pretty much all of those things have been addressed. It not only has that super fast wired charging, but you almost get the exact same speed using the wireless charging. Sadly, this is not a feature on this standard OnePlus 8, which still has that wired charging but doesn't have the wireless charging, and it also doesn't have the reverse wireless charging, which I find to be kind of useful. But one of the things that really does elevate these phones is the camera experience, especially on the 8 Pro, it is a major step up. So first of all, with the OnePlus 8 Pro, the 48 megapixel main camera is much better. So importantly just like a lot of others flagships this year, they've gone with a much larger sensor, which means that you actually get surprisingly good low-light performance within 12 megapixel mode, and when you're out and about with the sort of really nicely lit like daylight conditions, 48 megapixels actually looks pretty good. Unfortunately, the night mode really can't hang with something like the iPhone or the S20. And while I really liked the look of the 3X telephoto camera on the 8 Pro, that is sadly something which is missing on the standard OnePlus 8. Speaking of the OnePlus 8, it's similar, although it still has on paper, 48 megapixel camera, is a much smaller sensor. And generally speaking, I have found the results to be better on the 8 Pro. And if I'm being real, I still feel like while OnePlus has sort of stepped up the game, they're still behind something like the iPhone or the Galaxy. And specifically when you look at the iPhone 11 it's 700 bucks, it's kind of a little bit of a tough sell on the OnePlus 8, because it just simply cannot compete. Video is also somewhere where OnePlus have... Well, I mean they're trying, they're making some progress, but really the iPhone is the undisputed video champ as far as I'm concerned in smartphones, which is a problem, because obviously as someone who spends a lot of time working with video, the OnePlus is not really something I feel comfortable using, whereas I will use the iPhone to shoot video all day long for the channel. Is this OnePlus 8 Pro an expensive phone? Absolutely. But iOS is expensive, pretty much every other flagship out there, right? $900 is a lot of money, but so it was a $1,000, so is $1,400 for the Galaxy S20 Ultra, and so is the other phone that has really tempted me away from iOS. Look, I have absolutely no problem recommending the OnePlus 8 or the 8 Pro. There's certainly many people who will be very happy with these phones, but if you've listened to the Test Drivers, you will know that I am a proud member of the Z Flip gang. Yes, that's well we call ourselves. - I'm Mike Hurley and I'm Austin's new podcasts co-hosts on the Test Drivers. When I saw that first Galaxy fold, I felt like I knew that I'd seen a future. I think the jury's still out if folding phones could work for everyone, right? But I think I could see in that device, this was something else, this was something different, this is something we hadn't seen before. And since then there's been a lot of interesting stuff, and nothing has caught my attention in the same way that the Z Flip has, which I know is exactly the same for you. I pick up the Z Flip just to play with it after having owned it for months. Not in a, \"Oh let me check out what's going on, \"on Instagram,\" kind of way, but like, \"Let me just hold this device,\" kind of way, because it's so much fun. - For all the faults of this phone, and they're many starting with the absorbent $1,400 price tag. But if you could look past that for a second, I have found that I have fallen in love with this phone in a way which is not particularly irrational, but it's also not a way that I've fallen in love with a piece of technology in a very, very long time. Now, if you can ignore me being a Z Flip weirdo for a second, there are many, many downsides to this phone. It doesn't have 5G like the OnePlus does. It doesn't have water resistance like the iPhone and the OnePlus does. It only has a 60 hertz display like the iPhone, and unlike the excellent display on the OnePlus, it only has a single mono speaker as opposed to the Stereo speaker on those other two devices. I mean there are many, many reasons why this falls behind. It also has an older 855 verses 865 Plus. So I mean, there's a lot of sacrifices that you make. But the thing is, all those sacrifices in my opinion are totally worth it. Now, am I recommending you to go out and buy a Samsung Galaxy Z Flip? Absolutely not, right? It is a very niche product, it is very much for early adopters. The thing is while it might be behind in some areas, there's no deal breaker. And that's usually what I look for in something like the Moto Razr for example, which while it had that awesome flipping design, fell short in most other aspects. But with this for example, I have reasonably fast wired, fast charging, sweet. I also have wireless charging, reverse wireless charging, doesn't really matter that maybe this is a little bit slower because I can actually fit it in my pocket, unlike the giant OnePlus 8 Pro. I've always appreciated something which is a little bit smaller, a little bit easier to carry, and that's really where the idea of a foldable has made a lot of sense for me. Being able to unfold the phone and getting much larger display, I fold it up and not have something massive in my pocket all day, that's what she said, is really, really helpful. If I shouldn't have said that. But you know what? This is quarantine content I can say whatever I want, because Ken's not here to stop me. When it comes to the Z Flip for example, the reason why this is still remained my daily driver is because on top of the small size it has some legitimately really cool features. Well, yes, it does have a whole punch selfie camera and I've used it for stuff like video chats, like you've already seen this video, but if I want to actually take a selfie, all you do is flip it around and turn on the cover display, it makes it really easy to frame up a shot. So I could just do this, and boom, (camera clicks) I got a much better looking photo that is taken on the real legitimate camera on the back versus the tiny selfie camera. All right, I'm going to say that's not my best selfie, but we're going to ignore that for a second. There's also the fact that the phone stands up on its own, which I really appreciate when I'm watching video, when I'm scrolling through something or if I'm on a video call and I don't want to have to hold the phone on my hands. And yes, of course there's the cool factor, right? This is what is new. Most people have never seen a folding phone. I can't tell you how many times before all of this stuff happened that people will be like, \"Oh, what's that phone?\" \"Hey, that's pretty cool.\" It's just something that I appreciate, because it still makes me smile, right? It still makes me excited about technology. It's like, \"Oh look at this awesome piece of thing, \"look at this piece of glass, \"slash plastic that folds in half, \"how cool is that, right?\" But this comes down to a really fundamental question about what kind of smartphone you want to use. I have the incredible luxury to use a wide variety of phones, right? I get to take a look at most phones that come out and so I kind of get to choose whatever that I personally like. And with that being said, there are some major advantages in Android right now. So for example, if you want a folding phone, now like could you go with the Z Flip, but you could go with the Galaxy fold. You could go with the Moto Razr, you could go with what I'm sure will be a large number of folding phones that will be coming out over the next couple of years. If you already use iOS, well you get a slightly smaller option or a slightly bigger option or maybe an older option and that's pretty much it. Apple has and will continue to make excellent hardware that works really well with the software. I mean there are many things that I feel like I would prefer to do on an iPhone, and the lock-in isn't entirely for no reason. While yes, there are workarounds for iMessage and FaceTime, but for someone like the Apple watch, there's no great alternative on the Android side. Yes, Wear OS exists. Yes, there are many very cool watches, but do any of them hold a candle to the incredible work that Apple has done over the last five years with the Apple watch? I would argue not really, this is still by far my favorite smartwatch. And realistically, many days I will go out with my LTE Apple watch and my Galaxy Z Flip with no iPhone in sight, because that just feels like even though it's a very odd way of living my life and it's not something I would really recommend, but it works for me, right? Because this device is so ahead of the game. While the current iPhones are absolutely the most complete package that Apple has shipped in years, and the iPhone 11 specifically is still a reasonable value, especially when you look at some of the competitions such as OnePlus 8, what it isn't is really exciting. And when you have these devices such as the OnePlus 8 which while expensive offer 5G and a higher refresh rate display at the same price as that iPhone 11, it becomes a harder and harder justification, especially if you were not already locked in. If you have all these Apple devices and it's difficult to get your entire family to get away from iMessage, that's difficult, right? And I will totally admit I'm in that camp too. I am not saying that you should toss your iPhone in the garbage, it is still a perfectly competent device, and in many ways it is better than what you can get on the Android side of the fence. But while yes, you can wait until this year or next year or the year after to get 5G and higher refresh rate and folding designs and maybe not folding designs, but all this stuff will come, but I've gotten tired of waiting. And honestly the Z Flip is really what has dragged me away from my iOS cocoon of happiness and safety for some more adventurous shores. So will I continue to carry my iPhone and use it for taking photos and answering family iMessage threads? Yup. Will I still carry my Apple watch and my Galaxy Z Flip most days? Yup. But you know what it is, I feel like is really time for me personally and maybe for you guys as well, to consider switching to Android. It really is a fun, brave new world of... I don't want to say it's different because obviously Android has been great for many years, but 2020 feels like the time where you're legitimately getting different experiences that simply cannot be replicated on iOS. Because of that, I feel that the grass really is greener this time. Subscribe, catch you guys next time. Bye. Don't get yelled at by Ken for making very long dumb videos by myself, always happens anyway, so it's fine. (soft music)",
    "transcript_keywords": [
        "OnePlus",
        "Pro",
        "phone",
        "iPhone",
        "Apple",
        "Flip",
        "Android",
        "phones",
        "Galaxy",
        "time",
        "iOS",
        "lot",
        "camera",
        "Apple watch",
        "year",
        "display",
        "video",
        "Apple devices",
        "device",
        "absolutely"
    ],
    "transcript_entity_values": [
        "48 megapixel",
        "5",
        "half",
        "iPhone",
        "700 bucks",
        "30",
        "iMessage",
        "first",
        "two",
        "2020",
        "four",
        "120",
        "OnePlus 8 Pro",
        "the Galaxy Note II",
        "iPhones",
        "the last seven years",
        "one",
        "60",
        "Samsung Galaxy Z Flip",
        "last year",
        "Warp Charge",
        "its day",
        "the last few weeks",
        "secondary",
        "7",
        "many years",
        "the last five years",
        "next year",
        "iPhone 11",
        "the week or couple of weeks",
        "the Galaxy S20 Ultra",
        "the end of last year",
        "G iPhone",
        "Ken",
        "about six months from now",
        "Austin",
        "Instagram",
        "90 hertz",
        "5S",
        "1,400",
        "90",
        "the 7 Pro",
        "Galaxy",
        "1,000",
        "less than an hour",
        "FaceTime",
        "900",
        "today",
        "Android",
        "Stereo",
        "daily",
        "48 megapixels",
        "OnePlus",
        "OnePlus 8 Pro",
        "Galaxy Z Flip",
        "855",
        "Apple",
        "100%",
        "the next couple of years",
        "years",
        "11",
        "A13",
        "all day",
        "First",
        "a couple minutes",
        "S20",
        "KDP",
        "the Test Drivers",
        "this year",
        "12 megapixel",
        "OnePlus 8",
        "months",
        "RAM",
        "3X",
        "HTC",
        "the OnePlus 7T. Now",
        "8",
        "six months",
        "second",
        "the year",
        "Galaxy",
        "2013",
        "the Test Drivers",
        "one third",
        "the iPhone 11",
        "Mike Hurley",
        "LTE Apple"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "NORP",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "LAW",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "LAW",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "QUANTITY",
        "EVENT",
        "PERSON",
        "ORG"
    ]
}