{
    "id": "2T7u_IR98n0",
    "title": "The NEXT STEP for GAMING mice?!? - Razer Viper 8K",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-01-28T16:01:16Z",
    "video_url": "https://www.youtube.com/watch?v=2T7u_IR98n0",
    "category": "Science & Technology",
    "tags": [
        "PC",
        "Razer",
        "Gaming",
        "Mouse",
        "8000hz",
        "8K",
        "Polling",
        "Rate",
        "Refresh",
        "DPI",
        "Sensor",
        "Optical Switch",
        "Wired",
        "Accuracy",
        "Performance",
        "FPS",
        "Siege",
        "Rainbow Six",
        "eSports",
        "Professional"
    ],
    "views": 367434,
    "likes": 18616,
    "comments_count": 1284,
    "description": "Sign up for Private Internet Access VPN at    All the recent gaming mice are usually the same. They're light, have accurate sensors, and use nice clicky buttons. So is having an 8000hz polling rate the next trend???  Buy Razer Viper 8K Mouse (PAID LINK):   Buy Logitech G PRO Superlight Wireless Mouse (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://geni.us/IeGL",
        "https://geni.us/gjdew",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Does an 8,000 Hertz polling rate matter. Are we entering the next gen of gaming mice? Can Razer make a mouse that I'll actually want to use? Let's find out, in this unboxing of the Viper 8KHz. If you follow mice, you probably know that pretty much everything is capped at a 1000Hz polling rates. So that means that, when you're using your mouse it reports to your computer a thousand times per second. It's not perfectly divided into millisecond chunks depending on your system and workload, it can be inconsistent. And so when I first heard about the 8,000Hz polling rate mouse, the first retail one, I was kind of like do we really need this? Or is a thousand enough? But the more I thought about it the more it started to make sense. And so I'm really excited to get into it. So let's start the unboxing. All right. So before we get into the kind of nitty gritty of does 8,000Hz matter? Let's just take a look at the mouse. All right. It's kind of like an Amazon basics packaging, but I like it. I haven't used a wired Razer mouse in a long time. It's a message from Razer CEO, Min-Liang Tan, who loves to make gamery things. It's stickers, it's an instruction manual plug it in and it works. It looks like it gives you a breakdown of what the buttons are and what they do. And that's cool, but enough looking at paper let's look at this mouse. All right. Yeah, I'm a fan of that bag. So it's nice. They have a little cable management thing built on, the green razor. It's a braided cable. I mean, this is a pretty good cable. It feels like it wouldn't catch on anything. It feels sturdy. So this is the Viper. So it's pretty similar to the Viper Ultimate or the Viper you can get right now. It has buttons on both sides, which is kind of nice. I'm not a big fan of these buttons. I find that they're kind of easy to press in. It's got the textured side, which is pretty nice. These are the Razer gen two optical switches, they're supposed to be faster. And what I've seen online is actually, is pretty quick to click. Scroll wheel, that's pretty good. It doesn't like build momentum. It just feels like it clicks as many times as you're turning it. I think the textured plastic doesn't feel super premium but it's not bad. Overall, It feels pretty light, it's 71 grams. So it's not the lightest mouse there's a lighter wireless mouse with the G Pro X but 71 grams is it's still pretty lightened. With this minimal cable drag, that's a pretty smooth experience. They've done a good job having a fair amount of glide pad including around the sensor. And so it's a pretty smooth experience. And it's $79.99. This is pretty par for the cost. What's really exciting is, the polling rate. And so it's got a 20K sensor, it's considered a flawless sensor, so that's great. But the fact that it's reporting 8,000 times a second is a pretty big deal. So if you guys have used a mouse, it currently is probably using a 1000Hz polling rates. And if you went down to 500, you could tell the difference, 250, 125, huge difference. The amount of micro stutter, not even micro stutter, macro stutter you'll feel is insane. And a mouse is one of the most kind of like extension of your body, kind of peripherals. Like you can use a controller and using your thumbs but that's not like a big part of your body. Here you're doing big sweeping movements, big smooth movements. So you can feel anything. I don't want to get too far into the science of 8K and how that works. We actually did an LTT video covering that. So you can check that out in one of these fingers. This is like the first time that like the mouse I measured is actually it's not even 70 grams. - [Jono] Put all the cable on it. Oh, it'd be more than that though. Just like the USB end will be a lot more 100 grams. Thank you to our sponsor, PIA. Private Internet Access is a VPN that lets you access services and websites as if you were in a different country. Hey, you're in the U S and you want to watch the office on Netflix. You can do it, go to Canada, dog. It encrypts all your internet traffic and uses a safe, protected IP. You connect up to five devices at once. There's clients for Windows, Mac OS, Android, iOS and Linux. And right now, if you buy a one-year plan for $39.95 you get three months free at the link in the video description. Perfect! So for this setup, we're using a high-end gaming PC but more importantly, we're using a 360Hz monitor to see if we can see a difference. This is like the highest refresh rate you can get on a retail monitor. Yeah, it's a smooth experience. The cable, I mean, I would have a bungee if I was using this long-term. So that's kind of cool, you can change all the buttons, which I think is.. If you don't have that, then I don't know what you're doing. Switch it between left-handed and right-handed mode. Choose your DPI, I play at 800. Yes, this thing is so good. Let's jus do two and they're both going to be 800 just in case. Here we can change the polling rate. That's super cool. I mean, like let's just try it right now. (chuckles) That's not a good sign that I can't tell. I'll probably feel more in game. So let's, let's start at 8,000, let's see how that feels. Right off the bat, it's really smooth. I'm excited to compare it though, to see if it's like noticeably smoother than a thousand. Really it's going to be one of those things that like in day-to-day use, it's not really going to matter. It's really for high refresh rate game. So games like Esports games like shooters, especially. That's why they released this mouse which is kind of designed for FPS. First is that this is where you're going to see the most advantage. So for things like tracking in a game, if you see a head and you want to track, there's so much more reporting in between the mouse and the computer for that smooth motion. So it should make tracking a lot easier. The difference will be way bigger in high refresh rate games. Like I did the calculation. If you're getting 69 frames in a game, nice! You would be getting like at a 1000Hz, the mouse can report like 15, 14 times every frame. So you're getting a lot of mouse reporting back and forth well mostly to the computer. And then at 8,000 you'd get like 116, 115 like poles per frame. You probably not going to notice much of a difference but if you're playing at 420 frames, nice! Yeah at 420, at a 1000Hz you're getting like two or three like that's two or three poles per frame versus the 8,000, which would be like 19, 20. It's not going to be a one-to-one thing where these numbers show you exactly the difference between the two because there's other factors like your computer and your load that are actually coming into play. But it gives you an idea that at high refresh rates, this could make a difference. So I'm going to turn G-Sync off, because apparently G-sync is a crutch for a 1000Hz mice, but Razer said, yeah, turn off G-Sync if you want to feel the difference. So what I expect to really feel in terms of difference is the tracking. So I'm going to take a little bit more time than I normally would. And kind of just like see if... What? That doesn't feel right. I don't know if that's a mouse thing or what's going on but I keep the same settings everywhere I go in between mice it's always been about the same but 10 feels right today. You know what? It feels smoother, but yeah, this is smooth. Yeah I'm not sure what's going on with my sensitivity. I know exactly what my sensitivity is. It's still, it's like now the difference for smooth is like min. And like, I have a bad habit, I drag my finger on the thing. So like that creates resistance and kind of like a lack of smoothness. What I'm gonna do now is I'm going to change the polling rate. Let's go all the way to 125 so I can feel the difference. Oh, oh God (laughs) I could not feel it before, I can feel it now. Yeah, yeah, yeah. You have to be in game to really feel the difference. This is Savage. This is awful. Okay, it's not, not a huge difference. It's definitely like, it's there, it's one of those things you probably won't really notice unless you're looking for it. And you're like, oh I just bought this 8,000Hz mouse feel how smooth it is. And it's like, wow. And if I wasn't looking forward I probably wouldn't immediately be like, whoa this is a smoother experience. In the same way that like like 360 over 240, isn't that much smoother, but it is. And if you're looking for every edge you can get like I'm expecting pretty much every Esport mouse to have an 8,000Hz like polling rate probably by the end of next year. Cause like what are Esports gonna... If I was gonna use the absolute best, the absolute fastest and like I'm feeling this difference. I'm kind of like a little surprised. It's small, but it's perceptible. It's more perceptible than I thought when I saw people online doing, yeah it's totally smoother. I was like, uh huh yeah, sure for sure it is. Is this the 8,000Hz mouse you're going to want to get? Probably not. I have a hard time recommending Razer products, they don't have a great reputation for lasting a super long time. These new switches seem to be better. I mean, I like the way they click and it's fast. I've seen reports of it being a faster click than even like key pro. But in terms of build quality, let's do the same terrorist hunt with what I think is the absolute best gaming mouse. The G Pro X, it's super light. Is this a good experience though? Yeah, this is a good experience. Is it a better mouse? Yes, absolutely, in every way, except the polling rate. And so like, I'm not going to be sad for a while until 8,000Hz mice are really more standard in the same way that when a thousand Hertz started, there was a lot of issues. Like the OS had issues, games aren't really like optimized to take that kind of signal. Like right now a thousand is the normal and once everything, every bottleneck is kind of dealt with to handle 8,000 better, it's going to be an even better experience. Yeah, if you're looking at other Razer wired mice, it's a good option. In my opinion, other than the shape like there's not a real reason not to get it. It's priced at a delicious $79.99 price point. But having a wire, the Razer build quality, like there's things that are compromised and so it's a pretty cool, but it's not done yet, unlike this video, which is done. Now. Now. Thank you for watching this video, I really appreciate you guys sticking with me enjoying the 8000K ness in 4k, now.",
    "transcript_keywords": [
        "mouse",
        "pretty",
        "kind",
        "feel",
        "difference",
        "polling rate",
        "Yeah",
        "Razer",
        "rate",
        "polling",
        "feels",
        "smooth",
        "good",
        "experience",
        "pretty smooth experience",
        "Viper",
        "polling rate mouse",
        "cable",
        "time",
        "things"
    ],
    "transcript_entity_values": [
        "1000Hz",
        "FPS",
        "Razer",
        "8,000Hz",
        "20",
        "Viper",
        "79.99",
        "one-year",
        "15",
        "Hertz",
        "Razer",
        "Private Internet Access",
        "116",
        "420",
        "three",
        "8",
        "8,000",
        "one",
        "USB",
        "100 grams",
        "360Hz",
        "14",
        "4k",
        "Savage",
        "the end of next year",
        "the U S",
        "G-Sync",
        "Amazon",
        "125",
        "IP",
        "Min-Liang Tan",
        "second",
        "G-Sync",
        "8,000Hz",
        "LTT",
        "PIA",
        "115",
        "today",
        "Windows, Mac OS",
        "Linux",
        "10",
        "first",
        "Esport",
        "the Viper Ultimate",
        "Netflix",
        "Razer",
        "two",
        "the Viper 8KHz",
        "up to five",
        "Razer",
        "Canada",
        "Android",
        "500",
        "a thousand",
        "71 grams",
        "69",
        "8000",
        "70 grams",
        "250",
        "19",
        "First",
        "VPN",
        "39.95",
        "20",
        "three months"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "DATE"
    ]
}