{
    "id": "2Ynr0Tar5-s",
    "title": "Power Mac G5 Wheel Installation (Suck it, Apple) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-05-21T19:56:30Z",
    "video_url": "https://www.youtube.com/watch?v=2Ynr0Tar5-s",
    "category": "Science & Technology",
    "tags": [
        "Power Mac G5 Wheel Installation (Suck it Apple) - Krazy Ken's Tech Misadventures",
        "Mac Pro Wheels",
        "$700 Mac Pro Wheels",
        "Apple",
        "Mac Pro",
        "Power Mac G5",
        "Mac",
        "MKBHD",
        "Snazzy Labs",
        "Unbox Therapy",
        "Braille Skateboarding",
        "Mac Mod",
        "Caster Wheels",
        "DIY",
        "Computer",
        "Tech",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Computer Clan"
    ],
    "views": 69400,
    "likes": 2664,
    "comments_count": 272,
    "description": "Apple's $700 wheels are a bit too pricey for me (so is the $6,000 Mac Pro). But can we install cheap wheels on Apple's Power Mac G5 tower instead? And will they work? Let's find out.  Join our channel and get cool stuff!   Watch the episode where the G5 \"explodes\" on me   Subscribe for more tech videos!    Like us on Facebook   Follow us on Twitter    Krazy Ken's Tech Misadventures - Power Mac G5 Wheel Installation (Suck it, Apple)  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Thanks, Steve, for donating the Power Mac, and for donating so much more! Check out his eBay store here:   Also, thanks to Snazzy Labs, MKBHD, Unbox Therapy, and Braille Skateboarding for inspiring this episode!  Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program. *not all Patreon tiers qualify for all rewards #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2JGWYhz",
        "http://bit.ly/clan2MXi0LN",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://bit.ly/clan2k4UEHY",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Everyone's talking about the Mac Pro wheels, you know the $400 wheels Apple sells as an upgrade option to the Mac Pro. And if you wanna buy them separately they are 700 bucks. People are even making skateboards out of them for crying out loud. So I can't afford a Mac Pro but I do have this Power Mac G5 and I want to install some wheels on to it and I'm gonna do it for under 50 bucks, let's go. (energetic music) Hey guys how are you all doing, really that's just great. You know I'm doing pretty great today too because we're about to go to the hardware store to get some wheels for this thing. This is gonna be the best hardware store trip ever, all right let's go. That was the worst hardware store trip ever. Okay so first of all. Two steps away from the register, my bag rips. Everything goes all over the floor. And you know I'm gonna date this episode right now but we're going through a pandemic right now and I was wearing my glasses out in public on this particular lovely rainy day. So you know wearing a mask, wearing glasses, everything was foggy, I could barely see anything. So I ended up grabbing the wrong washers as well but to make things even more complicated, out of the eight washers I grabbed, one of them was actually correct. I remember trying it out on the stem of the wheel and it fit just fine. I get to the check out and the lady who was very nice by the way is like, \"Hey you have this one ALC and this are AKCs, \"do you wanna go swap them out?\" So I thought, okay I'll swap out the one to match the other seven. Wrong, I needed to swap out the other seven to match the one. So none of these washers fit, good. So that's out of the picture. But at least the wheels are good. All right so in more detail, what exactly do we have here. Pretty basic caster wheels, three inches, each is rated for a low bearing capacity of 175 pounds. The stem is 1 1/2 inches long, now that technically wouldn't clear the computer but if we put a like another nut in there or something we should be fine, we might loose some of the stability but overall it should be fine 'cause the computer is only about 40 pounds itself. And this little thing here Apple, I know you're not really familiar with what a brake is because your $700 wheels don't have those but that's what this is, it's a brake mechanism, so the wheel doesn't spin anymore. Yeah, so I know your wheels look pretty but you might wanna check into that. So we have that and the washers again that do not work but may be Crazy Carl has some spares. And I also bought some nuts. (nuts clanking) And hopefully that will work. So before we actually mob the G5 and drill a few holes in here. I just wanna say thank you to Snazzy Labs and MKBHD and Unbox Therapy for being my inspiration for this amazing experiment. MKBHD actually did a really good video that explains why the wheels from Apple are $700. It is kind of a perspective changer, so go check that out too. So you remember Crazy Carl, no of course you don't because he was in an episode like a billon years ago. Anyway he is my personal carpenter and he helped me sow off those legs of the computer desk I bought a long time ago. Well, he is the man with the plan and with the tools and all ten fingers. So we're gonna have him drill a few holes in here and we're gonna then come back and install these wheels in the layer. All right let's go. All right so I'm at Crazy Carl's place now and it just won't be a Crazy Ken's Tech Misadventure episode without more ridiculous stuff happening. So before I went to the store to pick up the parts, I went to the website just to browse things and make sure I had the right stuff. Well I did a terrible job. When I found this wheel, the website recommended a 3/8 inch nut which is pretty typical. I thought whatever, 3/8 inch nuts are used everywhere, even a lot of my camera gear stuff is all 3/8 inch diameter. But the recommendation on the website was wrong, when I read the spec sheet for this of course after buying the nuts, I found out this is actually 7/16 inch. So this actually will not fit at all. So we swung back to the hardware store and picked up a new bit for the drill, 7/16 so now that will work. And we've got some new nuts as well. But now I just realized a new problem thanks to the help of Crazy Carl. These wheels are a little big, I don't really know why I got such big ass wheels. So you know if they're like here and they spin into each other, they're not gonna clear. So they kinda need to go on the outside but I'm really not sure if I wanna put wheels to close to each other on the inside anyway because balance. I kind of forgot how much this thing curves, so you know the wheels gotta go like here, so we don't have crazy balance issues. So we're gonna try it out, drill some holes, see what happens. Hey, if worse comes to worse I have another one of this. (upbeat music) So we prep the aluminum for drilling, we're doing this free hand because we don't have a press. (drilling) After the first hole we busted out the rat tail file, actually the same one I used to fix the iMac Pro stand and we filed away those pesky bars. We also put a cloth down to prevent the bars from entering the Mac's cheese grader holes but that was a terrible idea. We tested the wheel and the stem didn't fit too well so Crazy Carl drilled a little bit more and it fit perfectly. So then we switched to good old cardboard instead of the cloth and finished drilling. (drilling) All right the drilling process is complete, thank you Crazy Carl, you actually didn't do too bad of a job, considering you were drilling free hand. And of course I don't wanna forget to thank Steve for donating this awesome machine to my layer. And guess what, Steve actually has an eBay store where he sometimes sells other vintage computers and other goodies. So the link is in the description, thank you Steve. All right wheel time. So now that we have the holes, well we need to put some wheels on this thing, right. That's kind of the point. You know it's definitely not the most pretty but it works and it's cheap, so basically what we're doing is we're just doing a three, no excuse me a 7/16 inch nut on the bottom just to give it a little more space 'cause otherwise the stem is gonna stab the bottom of the computer and then we have a washer. Then I will thread the stem through, put a small washer on top and then another 7/16, 16th-inch nuts, can we just use the metric system come on. And that will tie it all together and it should work great. Let's try it out. Okay this should be pretty straight forward but with the way this day has been going, I wouldn't be surprised that some sort of nuclear explosion bursts out of this computer as I'm trying to put the wheel in. But hey, it at least can't be as bad as the other G5 I worked with. Remember when that thing literally exploded on me. Yeah that was a good time. This will go to the G5, wow. (bang) Wow. Okay that looks pretty good, yes it is gonna kid of stick out over the curve a little bit. Washer and nut. Now it's time to burst out my handy dandy wrench which is flatter than week old beer. This thing is actually handy to get into those tight spaces between (laughs) this area right here. (wrench clanking) All right got a little snug there, perfect and yes it is tilting outward a little bit but again I think that looks cool. And actually might work out just fine. Okay, let's try one more. Sneak attack, I actually did two more back here. You just weren't looking. But I saved the last one for you and this way you'll be able to get a better view of the nuttiness. Insert stem, secure the washer, you're gonna love my nuts. Good old Vince from Slap Chop, just gotta get my nuts in there. (nuts rolling) And then bust out, flat Stanley And there we go, the wheels do clear and actually now that they are tilting out a little bit we have a little more space than we did in the original planning phase. So that actually ended up working out quite all right. So now the real test, we gotta put it on the ground or on the floor and see if it rolls. Unfortunately I just remembered I can't afford a floor so we'll have to go somewhere else later. But for now we can just use my desk which is probably the worst thing to use because it's not perfectly flat. Fun fact all right. Holy crap guys. Oh my gosh, it rolls. It actually moves. Holy crap, this is amazing, this thing actually works. Okay let's take it for a little bit more of a test spin. (energetic music) All right I brought you back to Jony Ive's white room. This is where you're gonna learn to walk for the first time, I know you can do it, you're doing it, hey you're doing a pretty good job. All right keep going, I said keep going. Why don't you keep going. (groans) Son of a foul cake, dog. (sighs) Oh I think it's solid. (cheerful music) (beep) you Apple. (cheerful music) Wow, this thing makes me feel really small. Anyway the wheels work great, may be I should start selling $700 Power Mac G5 wheel kits. If you want one, get one now. They're cheap, so thanks Steve for donating the computer and thank you Crazy Carl for helping me put the wheels on and if you guys want any more cool stuff from my self or the computer clan, feel free to hit the join button beneath the video or with the link in the description and you can get some of that cool stuff. This was a lot of fun. The crazy Ken curse definitely struck a little bit but it all worked out in the end. Thank you guys for sticking with me. Catch the crazy and pass it on (energetic music)",
    "transcript_keywords": [
        "Crazy Carl",
        "wheels",
        "Mac Pro wheels",
        "Mac Pro",
        "Crazy",
        "wheel",
        "Carl",
        "thing",
        "Mac",
        "Pro",
        "Pro wheels",
        "nuts",
        "put",
        "pretty",
        "good",
        "remember Crazy Carl",
        "computer",
        "Crazy Ken",
        "hardware store",
        "bit"
    ],
    "transcript_entity_values": [
        "700 bucks",
        "700",
        "Ken",
        "Jony",
        "eight",
        "all 3/8 inch",
        "G5",
        "MKBHD",
        "7/16 inch",
        "Apple",
        "eBay",
        "two",
        "Power Mac G5",
        "Power Mac",
        "Carl",
        "50 bucks",
        "16th-inch",
        "Vince",
        "ten",
        "Snazzy Labs",
        "1 1/2 inches",
        "Mac",
        "today",
        "Mac Pro",
        "the Mac Pro",
        "ALC",
        "Slap Chop",
        "Stanley",
        "seven",
        "this day",
        "first",
        "one",
        "Crazy Carl",
        "175 pounds",
        "7/16",
        "three inches",
        "only about 40 pounds",
        "Two",
        "400",
        "a Crazy Ken's",
        "3/8 inch",
        "three",
        "Steve"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON"
    ]
}