{
    "id": "32NWI-tyaPc",
    "title": "Unboxing Every iPhone 6S / 6S Plus",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-09-26T01:30:34Z",
    "video_url": "https://www.youtube.com/watch?v=32NWI-tyaPc",
    "category": "Science & Technology",
    "tags": [
        "iphone 6s unboxing",
        "iphone 6s plus unboxing",
        "6s unboxing",
        "6s plus unboxing",
        "iphone 6s",
        "iphone 6s plus",
        "unboxing",
        "iphone",
        "6s",
        "6s plus",
        "iphone 6s rose gold",
        "iphone 6s pink",
        "rose gold",
        "gold",
        "rose",
        "space gray",
        "silver",
        "review",
        "unboxing iphone 6s",
        "apple iphone 6s",
        "iphone 6s review",
        "unboxing iphone",
        "6s rose gold",
        "6s rose",
        "iphone 6s rose",
        "6s iphone",
        "rose gold iphone",
        "gold iphone 6s",
        "unbox therapy",
        "apple",
        "unboxing rose gold",
        "rose gold unboxing",
        "iphone unboxing",
        "apple iphone"
    ],
    "views": 3724795,
    "likes": 92185,
    "comments_count": 71785,
    "description": "iPhone 6s Unboxing (Rose Gold, Silver, Gold and Space Gray) Subscribe here:  dbrand skins:   Which color do you like best? Would you rather have the standard iPhone 6s or the iPhone 6s Plus? Let me know in the comments!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/SubUnbox",
        "http://dbrand.com/iphone-skins",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys Lew here, back with another video and today it is iPhone day. It's an official holiday. There are a lot of videos in your subscription box and on YouTube and so on about iPhone 6s And iPhone 6s Plus. This is every single variation of the iPhone 6s and 6s Plus Yes, these are a lot of phones. I will probably go ahead and give one of them away, at least one so make sure to subscribe. This one is all about a comparison of every single variation the colors and whatnot and also just to do a mega unboxing, but let's do it for the sake of internet. Sup internet. We're going to speed things up and I'm going to be as efficient as I possibly can in successfully unboxing these eight different brand new Factory Fresh iphones let's go okay, so We have all the devices out [wow] look at that. Look at that right isn't that pretty? Inside each box is going to be identical [you] have a little bit of paperwork from apple as you expect Sim tool as well as the ear Pod earbuds a charging brick and of course the lightning cable now you may recognize the fact that They have plastic on them still if you are in unboxing, Aficionado That plastic pull is one of the most satisfying things to do so let's go ahead Give you some nice audio on these plastic bowls. I'm gonna shut up Can you hear that? Well the microphone Just grabbed hold of the plastic, okay? That's a lot of phones. Wow let me line these up alright This might be the most phones. I've ever had on this table at the same time Just a stupid amount of iPhones, whoa This is the entire Iphone 6's lineup here now let me know down in the comments Which color combination you would go with as well as whether you're more of a 6s guy or a 6s plus? Now let's flip these over Give you guys a better idea of the colors You can see visually this is pretty much identical To most people's eyes. I would assume when compared with the regular six as most s iterations are concerned. You're basically just getting a Faster Unit Always camera improvements And whatnot but physically you're dealing with something that is mostly the same looking with the exception of the new color Dimensionally these are a little bit bigger than the previous version for a couple of different reasons But it's, it's minuscule though If you do wear a case on your phone or for that matter a skin I have a skin here from my good friends over at D. Brand skins you can see it wraps around the entire Iphone now they are available for order now for all of the 6s And 6s plus so check them out through a link in the description But you can customize the appearance of your device while getting a little bit of protection as well. Let's do the famous Tower of Phones watch this Why does that look so? Incredible sir probably snap an Instagram photo real quick Live live on the air okay, so I have this space Gray 6s. Plus booted up and Activated and I'm going to show you guys just a couple of the new features real quick Of course the thing that many people are talking about is this 3D touch Previously called Force touch the way that it works is You press a little bit harder so like I can launch the camera app just like that Or I can press longer or harder depending On how you interpret it and as you can see I can launch into various features within the camera a little bit more quickly for example take selfie because as you know when you need that selfie It better happen quickly. That's one of the scariest selfies I've ever taken from that angle camera still protrudes a little bit but it is improved this time around now shoots 4K video, so This is the 4K video Nothing has been touched here. This is completely automatic. Give you guys an idea of what to expect if you were shooting Handheld With 4K so anyways, this is the forward facing camera At 4k. You know what there is something incredibly? Satisfying about having all these phones here. I don't know what it is. Yeah, you almost want to use them like Lego bricks You know to build different. This is incredible anyways listen I had access to all these devices for the purpose of this video I want to give a shout out once again to D Brand skins for helping me to get all of these I think it made for an [interesting] video I've got a lot more planned and coming up. There's going to be some durability stuff I don't know if I need to be more specific than [that] so lots planned. Make sure to subscribe for that Oh and obviously I don't need all these phones so a giveaway to so subscribe for that as well anyway So there you have it Thanks very much for watching appreciate your guy's viewership, and I'll catch you very shortly on another video about these devices specifically I Promise very soon all right later guys",
    "transcript_keywords": [
        "guys Lew",
        "iPhone",
        "Factory Fresh iphones",
        "iPhone day",
        "phones",
        "bit",
        "Lew",
        "give",
        "video",
        "guys",
        "entire Iphone",
        "camera",
        "lot",
        "Fresh iphones",
        "plastic",
        "iphones",
        "Brand skins",
        "brand",
        "single variation",
        "unboxing"
    ],
    "transcript_entity_values": [
        "6s",
        "Iphone",
        "Lew",
        "iPhone 6s Plus",
        "at least one",
        "D Brand",
        "today",
        "Force",
        "4k",
        "eight",
        "D. Brand",
        "Lego",
        "six",
        "4",
        "YouTube",
        "6s Plus",
        "Factory Fresh",
        "Instagram",
        "one",
        "iPhones"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP"
    ]
}