{
    "id": "33THbvTODdM",
    "title": "Razer Nari Ultimate Gaming Headset Review",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-09-27T15:13:20Z",
    "video_url": "https://www.youtube.com/watch?v=33THbvTODdM",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "razer",
        "nari",
        "headset",
        "best gaming headset",
        "best headset",
        "fortnite",
        "counterstrike",
        "overwatch",
        "audio",
        "best speakers",
        "subwoofer"
    ],
    "views": 1075833,
    "likes": 27156,
    "comments_count": 2655,
    "description": "Dave2D review of the Razer Nari Ultimate Gaming Headset. The best gaming headset from Razer for the ultimate immersive experience. Razer Headset -   More info -   Background Music: Fili  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2QdV6ho",
        "https://www.razer.com/gaming-audio/razer-nari-ultimate",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going D2D here So Razer just launched a new line of headphones, the Nari headphones. And this one here is the Nari Ultimate, it's their top-of-the-line one. And this is a product that does stuff that I've never seen headphones do before. So a while ago they hit me up, they were like: \"Hey, we got some headphones, where you can actually feel the game that you're playing. You can feel the music that you're listening to. You can feel the movies that you're watching.\" And I was like, show me. Show me how this works, because this actually sounds pretty cool. So I've had these for about a week and it does some of the stuff that Razer claims it will do, but at the same time, it's a bit of a miss in some other areas. Now first thing's first, this is a pre-production or kind of like an engineering sample, So some of the experience I had with this particular product may not be the same in the retail version. I feel like the retail version will probably be a more refined version of this. But I feel like I got a pretty good sample of what this product will be like. It's pretty well built [with a] metal headband, but the yokes are plastic, and I would have liked to have seen metal yokes on a product like this, just like a flagship headset from Razer. I understand they might have used plastic to keep the weight down, and it's not a poorly made plastic or anything, but metal would have been nice. The earcups are plastic as well and the ear cushions are really comfortable. There's foam on the inside, gel-padded to keep things cooler. And it looks like there's a cut out for people who wear glasses, so if you have any kind of eyewear, The arm of your frame will kind of sit through that slot to make things a little bit more comfortable. The fit of this thing is very Razer like to me, like these actually feel very similar on my head compared to the older Kraken, but it doesn't have a user adjustable headband. It just automatically adjusts to your head depending on the size. Okay, so it's wireless, it has a dongle, it has RGB lighting, but the main feature of the Nari Ultimate is the haptic feedback. Now Razer is calling it Hypersense. And the difference between this kind of haptic feedback compared to the older stuff, is that it supposedly, it activates on a wider spectrum of frequencies. You don't have to program anything, it just automatically detects the sound going through the drivers and it will activate the haptic response. And this will work wirelessly or through the analog cable that's connected with the 3.5mm jack. So, this is a product that should theoretically work with any kind of device out there, and well, from what I've tested, it does. Now here's the real question though: How good is it, right? Like, how good is this especially for gaming? And well, for some games, it's awesome. For other games, it's less awesome. So let me explain. When you have a multiplayer game with a ton of sound effects and a ton of players that are just actively going ham at the same spot at the same time, it can get a little overwhelming. So something like Overwatch, there's a lot of stuff happening at once, 5v5 with 10 players in a match, and when there's a team fight, there's a ton of sound effects going on. There's guns, there's explosions, there's voice lines from the different characters, there's just a lot of sound. And the vibrations from the headphones can get a little bit distracting and if you have music on top of that, it's like sensory overload. But there are other games, even multiplayer games where it's not as crazy, like Fortnite or CS:GO or Rainbow Six Seige, where there aren't like tons of sound effects happening at the same time. In games like that, this is an awesome experience. Like all the little sound cues, you just feel them. You feel the vibration, you feel the feedback. You have better positional audio of where the players are and what things are happening, It's really cool! Now it's hard to describe because it's not just vibrations in your ear, the strength or the intensity of the vibration will change depending on the sound or the type of sound. I'm not sure exactly how the software does it, but it doesn't feel like some cheesy vibration. The haptic kind of amplifies the sound and just makes it feel more visceral while you're playing. And then there's other games that are more environmentally based like Subnautica or Tomb Raider, where you're just in these massive environments and the sound effects in those games are very deliberate, right? Like you might here a groan from a monster or your steps or your weapons - all very deliberate and clean sounds. And in games like these the Hypersense really adds that whole immersion effect. So what else is it good at? For certain movies, they're awesome - it's like you're own personal sub. Like action movies in particular, there's usually big sound effects that accompany strong visuals And it's just a really cool experience in these headphones. And same thing with music. Certain kinds of music, especially bass heavy stuff just feels and sounds awesome on these. It's a really cool experience. Now, there are certain types of music and certain movies and shows that don't work that well with this. Like classical music sounds and feels really weird with these. It's just not a good fit. And same with certain videos, like if you're just watching a YouTube video and the person on the screen is just talking really loud. Like if you're watching Lou from Unbox Therapy and is volume goes up a little bit, these things will start to vibrate, which is a little bit strange. But you can turn it off in the software. You have pretty decent control of the haptics in their software. So you have that option. Here's my take on these: they're not cheap. They're $200 which is a lot of money for any kind of headphones, but if you consider what these do, like if you compare it to other products on the market, they may not be the best sounding headphones out there, but they deliver an experience that is completely unique I've never experienced haptics like this on any headphones. They bring a certain element of immersion to the games, immersion to movies, and that's cool. That's unique. I think that if I was on the market for high-end gaming headphones, I would strongly consider these. I wouldn't get these if you just want the absolute best in sound quality. You're probably going to find something else for this kind of price with better sound quality, but the experience is unique and I think it's definitely worth checking out. One thing I don't love about them is the battery life. So these are rated for 8 hours, which is okay, but the thing is if you play a lot of games or if you watch stuff a lot, and if you use the haptics frequently, The 8 hours is for if you're using RGB lighting with the haptic feedback. And I actually getting around a little over 8 hours actually from my testing. But that means you have to charge this thing really frequently. If you don't, like if you kind of forget to charge one night and you want to play, you lose out on the haptic feedback, which is a bit of a bummer. 8 hours is kind of on the edge of what I would consider a long battery life. It's kind of, I'd say it's short actually for headphones. Okay, hope you guys enjoyed this video. Thumbs if you liked it, subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "sound",
        "Nari Ultimate",
        "feel",
        "kind",
        "games",
        "headphones",
        "sound effects",
        "Nari",
        "Razer",
        "Nari headphones",
        "thing",
        "haptic",
        "haptic feedback",
        "bit",
        "stuff",
        "sounds",
        "experience",
        "product",
        "music",
        "effects"
    ],
    "transcript_entity_values": [
        "Razer",
        "Subnautica",
        "Kraken",
        "Fortnite",
        "about a week",
        "the Nari Ultimate",
        "Nari",
        "Rainbow Six Seige",
        "200",
        "8 hours",
        "Razer",
        "5v5",
        "RGB",
        "YouTube",
        "Razer",
        "Overwatch",
        "a ton",
        "first",
        "The 8 hours",
        "10",
        "a little over 8 hours",
        "3.5mm",
        "Hypersense",
        "Lou",
        "one night",
        "One"
    ],
    "transcript_entity_types": [
        "NORP",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "TIME",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL"
    ]
}