{
    "id": "33Tvwr3CSIc",
    "title": "Desktop vs. Laptop GPUs Explained",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-05-31T21:38:29Z",
    "video_url": "https://www.youtube.com/watch?v=33Tvwr3CSIc",
    "category": "Science & Technology",
    "tags": [],
    "views": 550778,
    "likes": 27623,
    "comments_count": 674,
    "description": "Get 20% off the 3DEXPERIENCE SOLIDWORKS for Makers Offer at   What's the difference between a desktop graphics card and a laptop GPU?  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://lmg.gg/SOLIDWORKSTQ",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- I don't care what Gandalf says. You can't shove a full-sized graphics card into a laptop without pulling some kind of crazy wizardry. But even so, modern gaming laptops still include discreet GPUs that can run demanding titles nearly as well as desktops in many cases. So how exactly are laptop makers pulling this off? Well, GPUs have benefited from the same things all processors have benefited from over the years, shrinking transistor sizes. Meaning more computing muscle while simultaneously consuming less electrical power. You see, about 10 years ago, mobile GPUs were far weaker than their desktop counterparts. But as the years went on, performance per watt increased to the point where manufacturers could start fitting GPUs with some serious horsepower into laptops. A good example is NVIDIA's GTX 1080 from 2016, where the desktop and laptop versions were basically the same chip. But hold on a minute. Even with smaller transistors, how does this make sense? Desktop graphics cards are still as beefy as ever, and gamers are still putting 700-plus Watt power supplies into their rigs. How in the world can a slim laptop support all that power? There are a couple things going on here. First, part of the reason desktop graphics cards are so large is because they don't really need to be very small to fit in a standard mid-tower case. They do require support components such as VRAM and power delivery, but you can actually fit these things into a relatively small area if need be. Just look at some of the mini graphics cards designed for smaller cases. The extra bulk of a desktop card provides power delivery and cooling that's superior to what you'll find in a laptop, but it turns out many modern GPUs don't need huge amounts of power to function. For example, the mid-range RTX 3060 only has a TDP of 170 Watts. The reason you see so many desktop power supplies offering between 600 and 800 Watts is to support other high-wattage components, particularly the CPU, and because desktop power supplies operate most efficiently around 50% load. So a savvy builder isn't going to buy a power supply that she's constantly maxing out. So just how much power do gaming laptops need? We'll tell you right after we thank our sponsor, SOLIDWORKS. SOLIDWORKS is offering their 3DEXPERIENCE SOLIDWORKS for Makers software package right now for a great low price of $99 per year, but viewers of our channel can enjoy an additional 20% off. This offer includes 3DEXPERIENCE SOLIDWORKS Professional 3D Creator, 3D Sculptor, Visualize Connected, NC Shop Floor Programmer, and more. It's a great value for anyone creative, so what are you waiting for? Get an extra 20% off the 3DEXPERIENCE SOLIDWORKS for Makers offer at the link below. Oftentimes, even high-end gaming laptops can get away with having an external power brick that can deliver somewhere between 200 and 300 Watts of power, especially as even though a laptop maker might use a GPU that's nearly identical to a desktop variant, the mobile version usually runs at a lower clock speed with a lower power limit. While this means you do take a little performance hit with some very high-end chips still drawing too much power to ever make it into a laptop, the lower clock speeds on mobile allow you to get near desktop-quality results when paired with a lower power mobile CPU. Power bricks for these gaming laptops do tend to be chunkier than the compact ones you might get with ultraportables that aren't built for gaming, but they're still small enough that it's practical to take them with you. But wait, you still need to pay very close attention to what you're buying. GPU manufacturers are notorious for not keeping their branding consistent between generations. You know how earlier we mentioned that the desktop and mobile GTX 1080s were extremely similar chips? Well, this isn't the story for the mobile 3080, which has fewer cores along with less VRAM, and NVIDIA simply refers to both of them as RTX 3080. And this is just one example of confusing branding, so make sure you read reviews so you know exactly what level of performance to expect. It would be great if the powers that be could just make this clearer, but why do that when you could mislead the consumer instead? It's just like how the Big Mac never actually looks like the picture. Thanks for watching, guys! Hey, Like the video if you liked it. Dislike it if you disliked it. Check out our other videos and comment below with video suggestions. But don't forget, and I can't say this enough. Don't forget to subscribe and follow. I miss you.",
    "transcript_keywords": [
        "care what Gandalf",
        "power",
        "desktop",
        "laptop",
        "SOLIDWORKS",
        "Gandalf",
        "GPUs",
        "gaming laptops",
        "laptops",
        "mobile",
        "gaming",
        "Watts",
        "Desktop graphics cards",
        "graphics cards",
        "desktop power supplies",
        "power supplies",
        "desktop power",
        "graphics",
        "lower",
        "makers"
    ],
    "transcript_entity_values": [
        "about 10 years ago",
        "GTX",
        "3DEXPERIENCE SOLIDWORKS",
        "Visualize Connected",
        "one",
        "20%",
        "Gandalf",
        "NVIDIA",
        "an additional 20%",
        "between 600 and 800",
        "Makers",
        "GTX 1080",
        "Watts",
        "3080",
        "Watts",
        "Watt",
        "around 50%",
        "3DEXPERIENCE SOLIDWORKS Professional",
        "mid-tower",
        "99",
        "SOLIDWORKS",
        "3D Creator",
        "the 3DEXPERIENCE SOLIDWORKS",
        "700-plus",
        "the years",
        "GPU",
        "3060",
        "CPU",
        "2016",
        "First",
        "between 200 and 300",
        "170",
        "a minute",
        "the Big Mac"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG"
    ]
}