{
    "id": "3aprtINvClw",
    "title": "iPhone 14 Satellite is live 🆘🚨 Interview with Apple Executives!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-11-15T19:04:15Z",
    "video_url": "https://www.youtube.com/watch?v=3aprtINvClw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 61303,
    "likes": 3005,
    "comments_count": 146,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Thank you guys so much for joining me. Actually, I'm joining you here. - Oh, my goodness. Thanks for having us. Thanks for coming here. - This is so exciting. So you guys wanna do a quick little intro for everyone to know, - Sure. - Set the stage here for us all? - I'm Kaiann. I work on the worldwide product marketing team here at Apple for the iPhone. - Hi, I'm Arun Mathias. I'm responsible for our wireless software here at Apple. - So this is super exciting because this year, with the iPhone 14, you guys announced this new satellite technology. How does this actually work, and how is this gonna benefit people? - Sure. Well, I'll start, and, Arun, feel free to chime in. As you know, when you need help, you need help wherever you are. And with the emergency SOS via satellite capability, we created this groundbreaking service on all iPhone 14 models to allow the iPhone that you have with you in your pocket all the time to connect directly to a satellite, and get you help when you're off the grid. Now, of course, the satellite connectivity was a key part of this, and we saw that as important to allow Apple to expand our offerings as far as safety features. And now satellite connectivity is important because even though ground cellular connectivity has improved over the years, there's still some places, such as national parks or winding roads, where cell towers don't quite reach yet. And, maybe, in most cases, these limitations are okay, but when there's an emergency, that can be a problem, and so we worked to bring this capability to the iPhone 14 models that you have with you all the time. And we're really excited because it's coming really soon. It's coming November 15th to the US and Canada. And, in fact, we're going to be rolling out to four new regions next month, with the UK, Ireland, France and Germany. So we're really excited. It's gonna be included, for two years, free, starting at the activation of your iPhone 14. And we can't wait for people to be able to use it. - I think this is incredible because my sister and I, we used to hike so much, and we would go off the grid into these places, and it was really scary. So then I ended up going and getting a satellite phone, and it's this big, chunky device, and then I would forget to pay the bill for it. Then I was like, \"Wait a minute. This isn't actually working when I need it.\" And just to know that something that I do have with me always is something that could potentially save your life. So now when you're actually using this, so what does that look like? So say my sister are out, and I either fall or we realize that we're lost and we need help, so how does that all work? - Yeah, so our aim is to make this as simple and really familiar for you. Today, with your phone, if you wanna call for help, call 911, you can attempt to make a call to 911, or, in some places, you can send a text to 911. Now, that's in some parts of the US, not everywhere, but in a lot of parts of the US. And so our goal with the experience was to really make it so that if you went to make that phone call to 911, your iPhone will try its best to make that phone call. It'll try and get on any available carrier. If it cannot find any carrier because you're out in the middle of nowhere, it will now give you an option to be able to use the satellite to send an emergency SOS via the satellite. From a user perspective, it's right there. The option shows up when you need it, and once you hit on that button, it'll kick you into the experience. - So the phone obviously knows when you don't have connection. So you're saying if I actually needed help, I call 911, it'll automatically connect me to satellites? - Yeah, so when you call 911, it will realize that it's not able to actually make a phone call, so it'll give you an option on the screen now to actually text message with 911 via the satellite. - And something I thought that was so cool that you guys were doing is there's this compression algorithm so that you're making the file size really small so that it's actually able to reach the satellites. Because I think that's a misconception a lot of people don't understand. You're communicating with satellites very far in the sky that you really cannot see. So how does that all work? - Yeah. That's a great point. As you mentioned, the satellites are moving really fast. It's like 15,000 miles per hour, 800 miles above earth. We are creating this interface that Arun described that really allows you to get connected really easily. And Arun can speak to the short text compression algorithm, but one of the things even ahead of that is we created this questionnaire that surfaces the most common questions during a real emergency so that you can very quickly tap and select those answers. And we compress that and send that up much more efficiently than having to do all of that through back and forth texting. - The amount of data that we can send is fairly minimal because it needs to get up to 800 miles above, and so we built this questionnaire so we can really reduce the amount of data that needs to be sent and this text compression algorithm by identifying that a user is actually communicating with 911 for the purpose of trying to get help. We trained an algorithm where we, basically, trained the algorithm using words that the user naturally would use with 911. - When you think about satellites, you think about a satellite hanging off the side of your roof or something like that. I think that's what a lot of people's misconception of what a satellite really is. In the demos, I was like, \"So you have to move around and find the satellites?\" How does that all work? - So it's stepping back. As you mentioned at the start, a satellite device today has a huge antenna often protruding out of it. And, of course, that wouldn't work for iPhone. So we had to design something that would work within the constraints of iPhone, support all the different capabilities that iPhone already supports. So its communication with the satellite is built in a way that we identify how a user can orient towards the satellite but they hold it in a very natural way. It's not like they need to be reaching this thing towards the sky. - You don't actually have to stand like this. - Our goal with the experience is to give you very clear guidance in the moment, and so with both visual and haptic feedback, it lets you know you may need to turn a little bit, and then you're holding it in this natural way, it'll show you when you're connected, and once you're connected, it's in a very familiar messaging thread. So once you can fill out that questionnaire, it puts you in a familiar messaging thread just like you're sending text messages back and forth. - And so you have these relay centers all set up. Now what was that process like, setting up these centers to intercept this new way of communicating for emergencies? - So, first of all, a lot of emergency service providers don't accept text messages off the bat. Some of them do, in which cases when you're texting you'll communicate directly with those emergency service providers, but for the many that don't, we had to set up these relay centers and build out this ground infrastructure so that we had highly trained specialists there who, basically, take your text message in and they place a phone call to emergency services on your behalf, and they'll relay your conversation back and forth in a very efficient manner. And then, to the user, it's the same experience either way. What's happening in the back end is what's different, but we are gonna get you that help, and connect you with the emergency services providers. - And working with also the new Apple Watch, which I am obsessed with, how is this all working with crash detect, fall detect? Because what if I'm in a car accident and you don't have cell reception? So how does that gonna, Is that the same technique? - Yeah. So once the phone or the watch detects that you've been in a crash, it would, again, try and call 911. If it's unable to call 911, it will then now use this capability to try and get the message out via the satellite. In that situation, the phone actually probably does not have a clear view of the sky, and might be between the seats or in the trunk, so we keep the data extremely small in that situation, and we have really good confidence that it will still be able to get that message out and get you help. - Something else that my friends and my family we all use is Find My. So I have Find My on for all of my friends, especially for my mom because she doesn't even have to ask where I am. At any time we go out on a hike, we always let her know when we're leaving. But now are they gonna be able to see using the satellite? Sharing locations? - Yeah. So one of the things we realized was this technology could probably be used in a situation like that as well. When you're off on that hike, Find My is no longer updating your location. So now we give the users an option to be able to manually update their location. So, for example, if they get to the campsite, or at certain periods that they want to keep their loved ones up to date on where they are, they can now manually do that, and it will guide them through getting the location updated. - This is great. My mom's gonna be so excited now. But I feel like this is gonna help so many people. So how do you see this really changing the future of safety and security for people? - Sure. Well, as you know, we've been developing safety features over the year. We had fall detection on Apple watch, the regular emergency SOS and crash detection and now this capability through satellite. And we're being really thoughtful about how all the learnings that we've had through these other safety features, and really being able to build upon and expand it in a way that never before was possible before we built in the satellite connectivity. And so that was a piece that we were pretty excited about, being able to bring this in. But, as you see, it requires not just, \"Hey, we're gonna connect to satellites.\", but it requires us to do all this custom work on the iPhone hardware side, the work on the software side, with the algorithms and the connectivity, but also how we connect to the satellites themselves that are very complex infrastructure that are moving high in the sky, and then building out that sophisticated ground infrastructure to go with it. And all along the way, we've been taking learnings from the past things that we've done and other connectivity areas of iPhone, but being able to take this to this new category of safety to bring more users that additional peace of mind of having the safety features. Because even though some people are really great about learning and paying for these dedicated satellite devices, for a lot of people, they're just casual weekend hikers, and they may not even realize they're gonna end up off the grid and find themselves in an emergency situation. And so now having this on the iPhone that you're gonna have to take your videos, to take your photos, just brings you that additional layer of safety and, of course, that peace of mind. - Yeah. And the satellite phones were great except, like you said, most of the time when you need it, you don't have it with you. So every time I was actually on a hike or even just in a remote location where you would actually need this, you don't have it. So I guess going back to the software, and what does that whole process look like, I guess, from start to finish? Saying, \"I'm out there and I need to use it.\" Is there anything that we would need to know going into it or it'll automatically start working? - I was gonna just remind people. They should update their medical ID because that's also something we send up in addition to the questionnaire, which can include critical information like your age, if you have any allergies or any medication if you choose to fill that out. And so that's also a very quick way to get that up there. So that's something you can do ahead of time so that when you're in an emergency, all that works effectively. - So now does this alert my medical people that I have listed like my emergency contacts and then also go to the relay centers as well? - If you do have your emergency contacts set up, it can. You do have the option to choose to notify your emergency contacts during that questionnaire that you send up to the emergency service providers. And so what will happen is, if they're on IOS 16.1 or later, they will actually get an alert that says, \"Hey.\", that someone they know has had an emergency event and using emergency SOS via satellite, and, \" Would you like to see the transcript?\" And then they'll be enabled to see a live transcript of your conversation, two way, with that emergency service provider or relay center including your location and the nature of your emergency. - So does this pop up like a separate app or is it, basically, just in iMessage? So like I would be texting a friend but now I'm texting for help. - Yeah. Just in iMessage. Just like you would text a friend. You have a message thread with 911, and then your emergency contacts will actually be able to see that live transcript that Kaiann mentioned. And we built the live transcript because your emergency contact can't really contact you at that point. You're not available to receive a phone call or send a message to them, so this keeps them informed on what's happening. - Is there a way to let the emergency responders know once someone has arrived? How does that all work when the situation goes down and then you're okay? - Well, you can see the transcript, so you would be able to see, for example, if they said, \"Okay. Help is on the way.\" So you'd be able to follow alongside the same time as the emergency. - Yeah. And in many cases, you'll actually continue that emergency session until the actual responder shows up there. And so they'd see that all the way through to that. - Now, obviously, these satellites have been up there for a really long time. So what was it like, I don't know, I guess wrangling the satellites, figuring out how this all was gonna work? - Well, certainly, I mean, there's a sophisticated network of satellites that are already in orbit. They have regulatory approval. They've been built with redundancy, capacity, and so it's a really reliable infrastructure that we had. And so we did an additional level of technical work, both on the satellite side as well as our device side and how we connected, but it's already a really great robust solution that allows us to bring this capability to so many people pretty much on November 15th when it starts going live. One of the other things that we considered was we looked at a band. When we picked the technology, we picked a single band that allowed it to work in many places around the world, so that even if you are traveling, let's say to another location where we eventually enable this or vice versa, you'll be able to have access to the same emergency services capability via satellite. - Yeah. And so it was really important to us to actually use a satellite constellation that was actually fully mature and built out. And so, as you identified, the challenge became, how do we make the iPhone actually be able to interact with this thing that's already launched and up there and been up there for a long time and is mature. And so we had to make the necessary hardware modifications to allow us to optimize that communication back and forth, and then build an entirely new communication stack that included a whole new wave form, and all the layers above. A custom link layer, custom networking layer. And so it's really, really, very, very much custom for this purpose, and be able to put the system together. - It's really wild just picturing all of this and even getting a demo of it. So how does my phone know that it's pointing to a satellite? It's so wild. I can't really wrap my mind around it. - Yeah. And so given that these satellites are orbiting, we actually have information on the phone for it to be able to know what satellites it should be expecting to see at that point in time. And then, also, it's gonna see multiple of them. It's gonna know that there are multiple of them, being able to identify which one's the best one. And as it's guiding the user to possibly turn a little bit, it might identify that another one might be the better one or have a better strength for it to be able to connect. So it'll guide the user, and in a very simple way. So the user really doesn't really need to know any of this. It just tells them that they need to turn a little bit, and then gives them clear indication that they've connected to the satellite. - It's really cool. And it's such amazing technology. And I feel so lucky to be able to be in this time where that's gonna be helping so many people's lives. Hopefully I never have to use it but just knowing that that is in my pocket or in my purse or on a hike with me just gives me that peace of mind. So now we're joined with Mike. Welcome. - Thank you. Yeah. So my name's Mike Trela. I lead the satellite connectivity group at Apple that's helped enable these new, great, amazing features on iPhone 14. - So how did you go about figuring out which satellites you were gonna choose? How does this all work? - Well, we partnered with a great company in Globalstar. Globalstar has been offering mobile satellite services for decades. And we utilize their satellites because they have some really unique characteristics. One of them being they have a single global frequency that is approved for use for satellites to communicate to mobile devices like iPhone 14. So regulatory approval for these satellites has been key in implementing and being able to launch this service this fall. - And I think the cool thing is, obviously when you're using Apple products, they just work. If you're out and you need this, you want it to work, so choosing the satellite partner I think was, obviously, a key component to that. For you, I mean, working from hardware to software to these satellites up in the sky, what was the most challenging part of all of that? - Well, really these satellites were not designed to operate with iPhones. They were purposely designed to work with dedicated satellite communication devices that have large, bulky antennas, which wouldn't have worked for iPhone. So we really needed to develop new technology, optimize the iPhone, optimize the satellites to really make this link possible. So, on the phone, we enabled the dedicated frequencies that were approved for satellite usage, as well as on the satellite, we worked closely with Globalstar to implement a new high power mode that allow us to maximize the opportunity for connection with the iPhone, but to do so within the regulatory limits. - So how do you scale this? Because there's so many iPhones, there's obviously, only so many satellites that you can put into orbit. - Yeah. The scale that iPhone brings, obviously, was a big question, and that we wanted to make sure that we were gonna deliver a high quality service. So we built a very sophisticated geolocation model that defined where all of our users would be when they're off grid. We were able to build this model using anonymous private centric data from our current phones. With that model, we were able to overlay the network behavior of the satellite to ensure that we had enough capacity, both for those everyday usages as well as those peak times, where the users are gonna be needing to get help. - That's really cool. So, basically, you know where there's the dead zones, and already had those marked out. Is that what that means? - Yeah. We have a, We have a general idea. Obviously we wanna maintain privacy and be anonymous but we do want know where we expect to have hotspots, and will the satellite network serve it. And we've done an extraordinary amount of testing to be able to ensure that these satellites are ready to go to provide help. - So, obviously, so much went into this. So how was that working with so many different pieces of technology and new technology to work into the new iPhone 14? - First of all, I'd love to just say how great it was for all the teams coming together to collaborate on this because, as you can see, we have a couple of people here but there's really tons of people behind them and all the work that had to happen on the software, the hardware, the infrastructure side. But we also have to look at what else is the iPhone used for. We don't wanna put giant, bulky antennae to the point made or else you wouldn't wanna carry that around, and you wouldn't wanna use that as your everyday phone, so we wanted to make it work within the beautiful design of iPhone, have it coexist in harmony with the other connectivity features like wifi and Bluetooth and all the 5G bands and everything else that your phone has to do for you every day. And that was part of a lot of the hard work. But then at the end of the day, as said, is just a very simple interface and a very simple experience to guide our users to be able to use the emergency services. - A very super simple interface for a very complex problem to solve. - Totally. - Extraordinarily complex. - Looking at this all now that it's out there, what are you most proud of? - I think, with iPhone 14, we're taking satellite connectivity which has been for dedicated users, and we're bringing it to a whole new user base. People that find themselves occasionally off grid, not expecting to be off grid, and now we got this new technology that's really gonna be out there, available for all of iPhones I 14 users. - Yeah. I think just satellite connectivity felt like something that was so futuristic and far off that was not attainable to anyone, and now, pretty much everyone can have a satellite in their pocket. It's really, really cool. Well, thank you so much. Is there anything else that you wanna add about this new feature coming out? - Well, we're really excited to have it come out today. I know millions of users will have that benefit pretty soon, and so we're just looking forward to getting it out there, and hopefully helping people when they need it. - Now, is there a demo that people can try this out, or how can they actually see if this is gonna work? - There is a demo. You can do that ahead of time without a real emergency. You just wanna go out to a clear, open sky because that's how the feature works best, but you'll actually be able to connect directly with a real satellite in the same way you would in a real emergency. And we'll guide you through that intuitive interface just so that you can familiarize yourself a little bit with how that's gonna work, and so that in a real emergency, you'll be more ready. - That's great. I think everyone should definitely try that out just to be prepared because I feel like when you're actually in the moment when there is an emergency, you don't wanna be figuring something out like that. But I think what's great is you guys have made the interface so simple, which is so impressive. The way that you were able to compress the data to make it super small to be able to get up to the satellites. That's something else that's interesting, is I think people don't understand how long it takes for data to actually transfer up to satellites. Do you wanna talk a little bit about what that actually is like? - The communications, actually, with the iPhone and the satellite, is very similar to what you would expect terrestrially, on grid. We built and worked closely with Globalstar to put the custom protocol stack not only in the iPhone but we put an Apple proprietary radio system in each of Globalstar's ground stations. That enabled we had the highest quality communication link between the iPhone and the satellite network. - Well, thank you guys so much for joining me. This was really fun, and I can't wait for everyone to check it out. - Thank you. - Thank you. - Thank you so much. (thematic music)",
    "transcript_keywords": [
        "satellite",
        "satellites",
        "emergency",
        "iPhone",
        "work",
        "satellite connectivity",
        "people",
        "phone",
        "Yeah",
        "Apple",
        "call",
        "time",
        "make",
        "emergency service",
        "phone call",
        "user",
        "connectivity",
        "great",
        "users",
        "emergency contacts"
    ],
    "transcript_entity_values": [
        "iMessage",
        "this fall",
        "Globalstar",
        "millions",
        "a minute",
        "one",
        "Canada",
        "14",
        "Apple",
        "next month",
        "Kaiann",
        "iPhone",
        "Today",
        "orient",
        "UK",
        "up to 800 miles",
        "Bluetooth",
        "the years",
        "800 miles",
        "5",
        "Mike",
        "two years",
        "the year",
        "France",
        "four",
        "iPhones",
        "Mike Trela",
        "the end of the day",
        "Ireland",
        "Kaiann",
        "today",
        "this year",
        "911",
        "two",
        "November 15th",
        "decades",
        "like 15,000 miles per hour",
        "US",
        "SOS",
        "iPhone 14",
        "first",
        "Germany",
        "Apple Watch",
        "Arun Mathias",
        "Arun",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "GPE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}