{
    "id": "3Cosd_nAsAI",
    "title": "Tech Closet Tour!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-12-21T22:10:19Z",
    "video_url": "https://www.youtube.com/watch?v=3Cosd_nAsAI",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 888506,
    "likes": 24393,
    "comments_count": 1840,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys. Today, we're gonna be doing a gear closet tour, but unfortunately, it's a little bit messy right now. Before I show you guys everything that I have in here and how I have it organized, I just wanna say a huge thank you to CleanMyMac for sponsoring this video. I have been using CleanMyMac for so long. It's one of the best apps ever for clearing up storage on your Mac. While I tell you about that in the other room, I'm gonna clean up here. Boy, do I wish I had two Justine's in real life. I also wish I had a CleanMyMac app for my life, but I don't. Let's do this. Time to clean my Mac. I'm super excited to see what this is gonna be able to clean off of my new Mac Pro. Obviously, it is a new computer so I can't really imagine how much stuff I have hidden on here that needs to be deleted. A lot of times, also my older computers when I use CleanMyMac, it finds all these massive, large files that I completely forgot about. What's great about this though is it will find those old files, it'll find unused apps, it'll find old archive things that you definitely forgot about. It'll bring them all to the forefront here in the app. First, if we go up here to CleanMyMac, you guys can see I just emptied my trash so thankfully I have nothing in there. I'm working on a really big project so I need to have as much space as possible, so I'm gonna see if I can free up any of this space. When I click that, that opens up CleanMyMac and it automatically does a smart scan of my system. They are saying that I can delete three gigs, three tasks, so let's run these. Right now, it's cleaning up the system junk. Three gigs gone. Now we're running our maintenance script, done. Flush DNS cache, free up some RAM. Definitely need to free up some of that 384 gigs of RAM that I have on this machine. Definitely necessary. And there it is. We cleared three gigs, we found no potential threats for malware, obviously, and two tasks were performed. Let's see what else we could do. This is where we can actually see what's taking up the most space. There's probably some things in here that I can delete. Sony color test, that can give me eight gigs back. I've already saved that somewhere else. This is cool 'cause I can go through and just delete whatever I don't want. Bye bye. Probably don't have that many old files since this computer's only a few weeks old. You can see there's all the files from the red camera, which are taking up a lot of space. There's malware removal, privacy, remove your browsing history, there's optimization as well so let's view all 17 items. This will manage what automatically opens up when you log in. I feel like I'm into all of those things. Got an uninstaller which is great, easy to uninstall apps, updater, it looks like this needs updated. I'll put a link in the description if you guys wanna check out CleanMyMac, and now, let's head back into the gear closet and see if Justine is done cleaning yet. I'm Justine. This is weird. Come on in friends. Here it is. We're gonna start on this side and then we'll kind of work our way around, but this is sort of the main centerpiece of everything because these are most of the things that I use most often I guess you could say. Everything is pretty nicely labeled. There's a bunch of Nintendo Switch accessories, there's some Nintendo Switches obviously that are custom ones that I don't use on a daily basis, but at least I know where everything is. Some of these things also are labeled as videos that I plan on shooting. This is one of the Sega Genesis Mini's. I'm so hyped about this. We've got gaming accessories, we've got some old school Nintendo's, we've got one of the old PlayStation accessories, we got our PlayStation VR up here, XBOXs, XBOX accessories. I collect a lot of the limited edition XBOX controllers. I know, can't ever actually use them all. Collector, hoarder, call it what you will. This is just a few little decorations. If you guys remember the video that I did with Best Buy, I did a print test with the printer. I'm looking for paper. I'll use that. Little Wall-E, a little 3D printed Maddie. Can you believe it? This is kind of going into the drone world over here. I've got a bunch of drone cases, more miscellaneous drone pieces. You guys have seen me review a lot of these and I don't ever really get rid of them because a lot of times, I like to be able to resort back to them so that I can use them for comparison to newer drones. I've got all of those here labeled, we've got the new Mavic Two drones. This is mislabeled. This should say Polaroid, but I haven't got a chance to change it. I have more cameras here, camera cases, camera lenses, which usually they do have another home, but they're here for now, so I don't know. We've got old MacBook chargers, we've got accessories for my TV, we've got Microsoft Surface accessories, camera straps, Insta360. They have so many cameras and so many accessories that it needed its entire bin. New GoPro, old GoPro, mobile tripods, tripod attachments, and a lot of these are really full. This is the mobile tripod section. This is everything that has to do with mobile tripods. We've got actual tripods, we've got some attachments, there's also a whole nother section here. More tripods, these are for bigger boys. The problem's once you take something out, sometimes you can't shut it again. You just gotta give it a little shake! Good enough. I don't really ever use GoPro anymore, but I do like to have them for obviously all of the accessories because these work on a lot of different cameras. Those are always nice to have. Here's some more DGI stuff. We've got the Rotor Nest C, the new Mavic. This is my little charging station. It's really not that great, but it gets the job done. When I have a lot of things charging, I will just kind of set everything up here. This is usually what you would use for laundry if you were using this closet for clothes, but I use this for extra bags. These are some of my Apple badges. How exciting. These are some other laptops that have either been reviewed or need to be reviewed that are not Mac, non-Apple. Some of this stuff is just old boxes that I haven't gotten rid of. This is where I usually put tripods, laptop cases, keyboards, am always needing different keyboard setups depending on which computer I'm using. We've got a bunch of different things up here. This is some of the Apple boxes that I have, we've got headsets, more headsets, those are usually for VR. Looks like we have more keyboards up here, we have some more Apple stuff. This is actually one of my really old MacBooks. An old friend. We've got lights, little small camera lights, remote controls. If you're not sitting down, I would suggest sitting down for this one because it's so exciting! First two drawers, this is almost all USB chargers. There's also some SIM card ejectors here. Does anybody need an Apple charging brick? I've got so many of these because I always end up using the bigger bricks. More adapters, more dongles, some of these things aren't entire labeled correctly. I've just kind of been throwing things sort of back in the general area that they should be in. Over here, it's a little messy, but these are a bunch of pins. I was collecting Fortnite pins from all of the events from E3, things like that. This is an old Apple logo little patch I was gonna put on my bag, but then I never did. Lots of things. More pins. (woman gasps) Camera Camp pin! This used to be a system that I had of dead and not dead batteries, but clearly it's not working out because there's just dead ones. There's just a lot of random things. Here's the original Apple watch. I mean, it actually says Apple watch on the back of it. Honestly, it's just a bunch of freaking cables. I've got them all labeled though, USB-A to USB-C, micro USB, we get the point. This is the drawer that I love. (woman hums) This is the phone drawer. We have got a lot of phones here. Obviously a lot of iPhones, but we have a lot of Android phones as well. I don't like to get rid of them because I do need them sometimes for reviews and comparison to other phones. It's just a drawer of phones. We've hit Apple Watch land! This is all the Apple Watch bands, we've got old generations of Apple Watches, shattered Apple Watches. It's a really sad little place over here. We've got some older cameras like this Google one, which I never really ended up using very much, old Samsung 360, webcams, hello! I also have a place for my Kindle and that's where it stays, some mice, pencils, this says Apple pencils, but there's not a single Apple pencil in here. This is the audio section. We've got wireless packs here, more wireless here, other just Shotgun mics, HDMI cables, power adapters. We have hit the iPhone and non-iPhone cases, most of these are iPhone cases. I'm not really sure what all this is. It's kind of just a bunch of batteries. I did used to keep my lenses in here, but I only have a few in there now. Battery chargers, MD filters, you know, the goods. What's over here? Looks like some ethernet cables. What's this? Is this an HDMI? No, I'm not gonna ever need an HDMI cable that's that long. I guess that's it. That's all of those. Now let's take a look at the other side. It's less exciting. We've got a bunch of tech and travel bags, backpacks, tons of backpacks because I basically am always on the go so there's a backpack for every situation. This is just a bunch of stuff, there's a fan. This is where I have all my old hard drives, boxes that are empty. Oops. That's it. I mean, it's usually pretty messy because we're always doing back-to-back shoots and always traveling so I just kind of come in here and throw stuff around, but I do like when it's nice and organized so if there's anything that we ever need to find, we know exactly where it is. This office was organized by professional organizers and I have definitely professionally messed it up. A huge thank you though to them because they have done such a great job. I showed you guys a video before of how they did completely redo my entire house. If you guys haven't seen that video, I'll be sure to link it below, but it's so amazing. Anyway, that's it. A huge thank you to CleanMyMac for sponsoring this video and I really do feel like in both scenarios when you do have a clean Mac or a clean office or a clean workspace, you just feel so relieved. Well, see you guys in my next video. Don't forget to like, subscribe and comment and do all of those things. I'll see you later. Bye! (upbeat R&B music)",
    "transcript_keywords": [
        "Apple",
        "things",
        "lot",
        "Apple watch",
        "CleanMyMac",
        "guys",
        "Mac",
        "bunch",
        "accessories",
        "Apple Watches",
        "clean",
        "camera",
        "video",
        "kind",
        "stuff",
        "tripods",
        "gigs",
        "clean Mac",
        "cases",
        "cameras"
    ],
    "transcript_entity_values": [
        "Mavic",
        "non-iPhone",
        "MacBook",
        "Shotgun",
        "one",
        "E3",
        "SIM",
        "Camera Camp",
        "USB-C",
        "R&B",
        "PlayStation VR",
        "DGI",
        "Samsung 360",
        "Fortnite",
        "17",
        "Mavic Two",
        "Justine",
        "Apple",
        "Nintendo",
        "Sony",
        "Mac",
        "XBOX",
        "Today",
        "Mac Pro",
        "iPhone",
        "three",
        "PlayStation",
        "XBOXs",
        "Microsoft Surface",
        "Kindle",
        "only a few weeks old",
        "iPhones",
        "Google",
        "Maddie",
        "the Rotor Nest C",
        "New GoPro",
        "Nintendo Switch",
        "DNS",
        "RAM",
        "daily",
        "MD",
        "eight",
        "MacBooks",
        "two",
        "Three",
        "Polaroid",
        "384",
        "Apple Watches",
        "Android",
        "HDMI",
        "Nintendo Switches",
        "Apple Watch",
        "non-Apple",
        "GoPro",
        "Mac",
        "First",
        "USB",
        "VR",
        "GoPro"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "NORP",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT"
    ]
}