{
    "id": "3cQJiQ0AkW8",
    "title": "Video Games Getting WAY More Expensive?!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-08-23T16:30:42Z",
    "video_url": "https://www.youtube.com/watch?v=3cQJiQ0AkW8",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "video games",
        "trade war",
        "chicken tax",
        "gaming",
        "trump hates video games",
        "tariffs",
        "china tariffs",
        "tech",
        "microsoft",
        "sony",
        "nintendo",
        "switch",
        "playstation 5",
        "playstation 4",
        "sega genesis brazil",
        "gamescom 2019",
        "us china trade war",
        "economy",
        "us china trade",
        "video game tax",
        "video game tariff",
        "trump trade war",
        "tariff",
        "subaru brat",
        "us tariffs",
        "trade talks",
        "ps4",
        "chassis cab loophole",
        "minecraft",
        "gamescom",
        "ps5 news",
        "ps5 leaks",
        "ps5 rumours",
        "trade deal",
        "news",
        "matt ansini"
    ],
    "views": 85106,
    "likes": 4063,
    "comments_count": 373,
    "description": "Microsoft, Sony, and Nintendo all agree on one thing... Twitch Is KILLING Twitch:  The END of Loot Boxes?!:  Fortnite is BEATING Minecraft:  Why Minecraft is BIGGER Than Ever:  RAIDING Area 51?:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/734b1TdKR90",
        "https://youtu.be/WLtG2Ed5uP4",
        "https://youtu.be/zckuX8NFoxM",
        "https://youtu.be/Lx6K35Acm-w",
        "https://youtu.be/HmW2MUiIIcI",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, and welcome to \"This Is Now.\" While video games are cheaper than ever, the consoles themselves have gotten super expensive, and there's a very good chance that they might be getting even pricier. A few months ago, Trump announced that the U.S. had plans to implement new tariffs on 200 to 300 billion dollars worth of goods that are being imported from China. If you're not familiar from your economics class, a tariff is essentially just a tax put onto a good which is being imported into the country. This is certainly not anything new. Countries set tariffs on goods all the time. However, included in this new proposal is a massive 10 to 25 percent tax hike on video game consoles. And considering that a whopping 96% of all consoles are manufactured in China, that could be a big, big problem. So, as an American company, isn't this an absolute win for Microsoft? Get ready for those cheap, cheap Xboxes, right? Well, no, the tariff actually has nothing to do with the country that the company is from, but instead, where the country is importing the product from, in this case, China. So, even though Microsoft is an American company, they're still importing their Xboxes from China and thus are subject to a tax. Now, that tariff is based on the value of the good that is being imported, so say you have a $300 PlayStation Four. Well, now I could have up to a $75 tariff and that's for every single unit. If that's the case, it means Sony essentially has two options: either they lose that $75 per unit or they raise the price accordingly which, of course, is then passed on to you, the wonderful consumer. The tariff is based on the value of the good that is being imported, so say you buy a PlayStation Four for $300. Well, now, we would have a tariff of up to $75 for every single unit. That means Sony has two options: either they lose that $75 or they raise the price accordingly which is, of course, passed on to you, the dear consumer. Oh boy, taxes and tariffs, fun, fun. Now, traditionally, video game consoles sell on a razor-thin profit margin as is or even at a loss, the idea being that you basically make the consoles cheap as possible so more people buy it, and then Sony or Microsoft make their money back on game licensing, accessories, Xbox Live, PSN, Xbox Game Pass, PlayStation Now, all the wonderful other things, very much like razor blades or printers with ink. It gets you on the back end. - [Ken] Who buys ink when the printer is-- - Ken, not everyone throws away a printer when you're done with it. I have had the same $50 printer for, like, four years now, and I bought ink for it three times. - [Ken] Yeah, but like, I basically kept getting new features by-- - Ken, you literally are destroying the environment by throwing away a printer every time it runs out of ink. - [Ken] Well, maybe they should stop making (beep) printers. - For consoles like the Xbox One and PS Four, which are, of course, at the end of their life cycle and therefore a little bit cheaper, they're easier to produce, it's probably more likely that both Sony and Microsoft will eat the costs of any tariffs or, at the very least, they won't continue to discount the devices when they go end-of-life. However, what about the next generation of consoles? Take the PS Five, for example, which is estimated to launch with a $500 price tag or, with this new tariff, that'll be a $625 price tag. Now, in many countries, this is nothing new. For example, when the PS Four entered the Brazilian market, it cost $1800 due to similar tariffs. Probably, I guess why they're still playing the Genesis, not PS Four (chuckles). Man, it sucks to be in Brazil. I'm, I'm sorry. I'm sorry, we have it very good without having to pay $1800 for our PlayStations. Now, consoles are not the only things affected either. Most accessories, such as controllers, headsets, chargers, they're all produced in China. Now, in their letter, the Big Three of Sony, Nintendo, and Microsoft claim that this tariff has the potential to cripple the entire gaming industry. If console prices get too high, the price will put it out of reach for many homes which mean, of course, less people can buy them. Now, if less people can buy them, there'll be less games sold, and if less and less games are sold, that means studios, especially the smaller ones, can't afford to operate and thus shut down. Now, obviously, that is a very doomsday take on the entire situation which Sony, Microsoft, and Nintendo are, of course, using to maximize their point. However, tariffs like this do have an effect on industries, except we just don't know exactly what that effect will be yet. As of right now, a large chunk of electronic tariffs are scheduled to go into effect on September 1, but things like video games and cellphones have been delayed until at least December 15, presumably to give those manufacturers enough time to stock up for the holiday season. Now, a huge side effect to this is that Nintendo has already started looking into moving the production of Switch consoles away from China and into other parts of Asia, specifically, such as Vietnam. By doing this, they would circumvent the tariff and then, of course, could start a domino effect where all these manufacturers take their business elsewhere. Now, when you get into world trade and economics, obviously, it is an incredibly complicated subject, specifically when it comes to things like tariffs which can come and go and... It gets messy, right? But the general gist is this: so far, we've been incredibly fortunate around the world to have super strong global trade where PlayStations can be sold for a couple hundred dollars everywhere except Brazil. However, those days do look like they're coming to an end. Now, it would be unfair to make it seem like this is all some kind of unprecedented move by certain U.S. presidents. In fact, tariffs and trade wars are a lot more common than you might think, and some of them have pretty insane effects on the global trade that are well beyond just the mere video games, such as the chicken tax. Matt, what is a chicken tax? What, you hosted last week, what? I can't host one... I wanna host one episode! - In the late 50's and early 60's in the United States, advancements in both animal husbandry and agriculture led to a massive increase in the amount of chickens being bred and thus meat being produced. At the same time, Europe was recovering from World War II, and the availability of chickens was scarce and thus super expensive, especially in France and Germany. U.S. farms started to export their surplus to Europe, and the consumption of chickens skyrocketed worldwide and everyone was happy. While European consumers were happy, the farmers accused the U.S. of putting them out of business, so in 1962, Europe imposed a 25% tariff which was 10 times higher than the average tariff on chicken imported from the U.S. Of course, this massively hurt the U.S. market which led to America increasing tariffs on other goods from Europe and thus led to more retaliation back and forth. Does this sound like a trade war you've heard of? Like video games, maybe? - [Austin] What? Oh, is that how you're shoehorning this terrible segue into the video? - Wow! This was a big deal and it grew to include things like potato starch, dextrin, and brandy, among other things. How are those related to chickens? And all falling under this nefarious \"chicken tax.\" Since then, pretty much all of those tariffs have been eliminated except for one: commercial trucks, because the trade war totally makes sense, right? Like, yeah? - [Both] No, no. - [Ken] Wars are bad. - Okay. - [Ken] Don't advocate for Matt. - While the U.S. chicken market was booming, the U.S. auto market saw a steep decline, and this was caused by an increase in the number of foreign trucks and cars being imported, especially the VW cargo van that had become super popular in the 1960's. - [Ken] Damn hippies. - Yeah, it's definitely the hippie van. - [Austin] War is not the answer, okay?! - So, to get back at Germany for their tariffs, the U.S. imposed a 25% tax on the import of all foreign trucks or vans directly affecting the sale price of those VW buses. And more taxes equals higher-cost vehicles. However, only cargo vans were affected by the new tax. Passenger vehicles were not. Are there seats in the back? If so, you're good to go with a relatively small 2.5%, maybe 4% tax, but if there're no seats in the back, chicken tax! - [Ken] Chicken tax! - Enjoy your 25% tariff. - [Austin] What?! - Yeah. - [Austin] 25%?! - Go directly to jail. Do not collect $200. - [Austin] Matt, trade wars are bad! Why are you doing this to me? - Obviously, foreign automakers still want to sell their trucks in the U.S., so they came up with a clever way around the tariff known as the chassis cab loophole. Essentially, automakers would just add the cheapest possible seats to their small trucks before exporting them directly to the U.S. When they arrived, they would immediately remove the seat before sending them off to dealerships. One of the most famous examples of the chassis cab loophole was the Subaru Brat, which was super ugly. - [Austin] How dare you. - Ha ha! Similar to the El Camino, the Brat was half car and half pickup truck because it did not have a back seat. It fell under that small cargo truck tariff, so basically, what they did was they took two of the cheapest, crappiest seats that were rear-facing, and they had these little handlebars. The chicken tax was implemented to protect the U.S. market, but ironically, it made things way more difficult. Like we said before, the tax applies to not the country of origin for the company, but the country from where they're importing goods from. So, actually, that same exact thing happened with Ford. The Ford Transit was originally made in Spain and then Turkey and then imported with those rear seats. Alternatively, Mercedes-Benz imports all their Sprinter vans into the U.S. in pieces and then assembles them in Charleston, South Carolina. Thank you for watching this episode of \"This Is\" and you can check out some of our other episodes right here. Be sure to subscribe and ring that notification bell 'cause if you don't, Matt's kids won't get into college. - The most important thing here is that you clicked on a video all about video games, and now you're learning about tariffs. Congratulations, Matt, you're teaching the kids new information every day. - What's this about my kids not getting into college?",
    "transcript_keywords": [
        "tax",
        "tariff",
        "tariffs",
        "video game consoles",
        "chicken tax",
        "China",
        "good",
        "imported",
        "video",
        "consoles",
        "back",
        "country",
        "game consoles",
        "game",
        "chicken",
        "seats",
        "trucks",
        "video games",
        "Matt",
        "American company"
    ],
    "transcript_entity_values": [
        "Brazil",
        "American",
        "is-- - Ken",
        "those days",
        "three",
        "4%",
        "PSN",
        "the El Camino",
        "This Is Now",
        "300",
        "Mercedes-Benz",
        "Nintendo",
        "One",
        "four years",
        "Asia",
        "Microsoft",
        "September 1",
        "500",
        "75",
        "every day",
        "the PS Four",
        "U.S.",
        "the late 50's",
        "Xboxes",
        "France",
        "10 to 25 percent",
        "at least December 15",
        "Germany",
        "up to $75",
        "Brazilian",
        "Matt",
        "the Big Three of Sony",
        "Austin",
        "Xbox One",
        "25%",
        "VW",
        "PS Four",
        "1960",
        "Ford Transit",
        "China",
        "Xboxes",
        "Genesis",
        "Spain",
        "Charleston",
        "10",
        "the holiday season",
        "Sprinter",
        "PlayStations",
        "$300 PlayStation Four",
        "South Carolina",
        "A few months ago",
        "50",
        "Xbox Live",
        "Turkey",
        "last week",
        "the PS Five",
        "200",
        "625",
        "a couple hundred dollars",
        "PlayStations",
        "Brat",
        "Ford",
        "1800",
        "200 to 300 billion dollars",
        "one",
        "Subaru",
        "1962",
        "Europe",
        "2.5%",
        "Trump",
        "half",
        "World War II",
        "the United States",
        "America",
        "two",
        "96%",
        "Xbox Game Pass",
        "Sony",
        "PlayStation Four",
        "European",
        "Vietnam",
        "Switch"
    ],
    "transcript_entity_types": [
        "GPE",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "LOC",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "FAC",
        "GPE",
        "PERCENT",
        "DATE",
        "GPE",
        "MONEY",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "GPE",
        "DATE",
        "MONEY",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "EVENT",
        "GPE",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "GPE",
        "ORG"
    ]
}