{
    "id": "3CsQo4f5m7E",
    "title": "NEW OnePlus Pad Durability Test - This is awkward...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-06-01T12:11:00Z",
    "video_url": "https://www.youtube.com/watch?v=3CsQo4f5m7E",
    "category": "Howto & Style",
    "tags": [
        "OnePlus Pad",
        "OnePlus tablet",
        "oneplus ipad",
        "ipad",
        "apple",
        "new ipad",
        "ipad killer",
        "android tablet",
        "mobile device",
        "technology",
        "OnePlus",
        "OnePlus durability test",
        "oneplus pad review"
    ],
    "views": 485309,
    "likes": 25302,
    "comments_count": 763,
    "description": "Today we durability test the new OnePlus Tab - the Apple iPad Clone. Grab your new LTT Orange or Matte Black JerryRig Knife HERE:  And thanks for supporting the channel. OnePlus is venturing into the tablet market - but with how fragile their phones have become, their new iPad killer has me worried about durability. Will the new OnePlus Pad survive a durability test? There is only one way to find out.   Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/ACnP4TvUoTN-kdVzL6dT8g?pm=link",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today we're going to be durability testing the new OnePlus Pad and the OnePlus Stylo. I'll just use my official Linus Tech Tips orange JerryRig Razor Knife (link in the description) to slice through the plastic...subtly as possible of course. Then we can inconspicuously use the new Matte Black Everything JerryRig Razor Knife (just $15 also link in the description) to open up the Stylo. I've been practicing subliminal product placement. Let me know how you think it's going. The Stylo at first glance appears to be very similar to the new Apple pencil, but there are a few differences. Inside the box is an included replacement tip, but we'll get to that more in a second. OnePlus Tab is OnePlus's first venture into the portable tablet space. With how fragile their phones have been the past few years, I really hope their ducks are all in a row this time around. This is the Halo Green color tablet. They're trying really hard to dip into the 2006 millennial gamer market. It'll be interesting to see if the cyclops looking camera on the back can hold its own...you know, during any stressful events that might occur. Let's get started. [Intro] Inside the box, would you look at that, we get a 67 watt charging brick, and a USB-C cable. Kind of nice in this day and age. One thing that I think is super cool is the metallic brushed lines radiating out from the camera circle. I guess this is where the halo part comes in. It's actually a very difficult finish to perfect so thumbs up to OnePlus for nailing it. I'm not going to lie, I don't actually own any tablets so I can't tell you a whole lot about what they do. I just know it has a big screen and keeps kids quiet. So let's move on over to the Stylo. OnePlus Stylus is white, plastic, and magnetically connects to the sides of the tablet. And when placed on the top right it can also wirelessly charge with the current charge percentage appearing on screen. Kind of fun. The magnetic hold is very secure and I don't see it falling off on its own with normal jigglings. It's not immediately apparent how the tip of the style can be replaced. Turns on it's threaded and just needs to be twisted. I can, however, be sharpened fairly easily for a more finer point. If we take a look inside the Stylo we can see that the exterior is indeed plastic all the way around. And the copper coils for charging and the copper rectangles for the screen sensing location look extraordinarily exquisite. Why this technology is hidden on the inside of boring plastic covers, I'll never know. The back of the OnePlus pencil is a bit harder to get into, but with a bit of persuasion we find that instead of a capacitor like we found inside of Samsung's s-pen, here we have an actual lithium battery - 82 milliamp hours which is about 1/3rd the capacity of an Apple watch. Normally we would see some more copper coils around the tip of the pen so that the digitizer or display can tell where the pen is located and which of the 4,000 different levels of pressure it's applying to your artwork. But this time around we have copper pads instead. OnePlus doesn't say a whole lot about the style of technology on their website, but it does indeed look pretty cool inside. If OnePlus is trying to wiggle its way into the iPad market, of which Apple sells like 60 million units every year, they'll need to be manufactured from similar materials and have similar build qualities. If you remember the most recent iPad, amazingly it did not snap in half during my bend test. Here on the OnePlus Pad we see no markings between one and five, but we do see scratches at level 6, with deeper grooves at a level 7. So far right on par with Apple's iPad. OnePlus has also put the front facing camera on the long side of the tablet. Kind of nice for video chats and landscape mode. The selfie camera is 8 megapixels. On the long side we find the volume buttons are made from metal, along with metal sides and an offset 5G antenna location filled in with plastic. So far so good since this 5G antenna location is not in a structurally significant position and it should not be affecting the durability. The top of the Tab has two of the 4 stereo speakers recessed with metal speaker grilles on the inside edge of the housing. The other long edge of the tablet has 3 small gold circles, just like the iPad, for when it's cosplaying as a laptop. The magnets are pretty strong. The bottom of the tablet has the remaining 2 stereo loudspeakers, as well as our 67 watt fast charging USB-C port. Flipping the tablet over to the back, we can get a better look at a singular, circular 13 megapixel camera, protected with glass and slightly raised up from the green brushed middle surface. We know it's metal because of the way that it is. One interesting fact that I've learned over the years is that color is extremely hard to recreate across mediums. For example, IPS and OLED screens display colors differently. Different cameras record colors at slightly different shades and hues. And don't even get me started on printers. Besides the fact that you can't print black and white when you're out of yellow, getting color accurate images is extremely difficult. And that's exactly the story behind why the Hulk is green. Turns out he was originally gray but the comic book printing the story couldn't get the gray shades consistent across all the pages so they switched them over to green, which I think is a good move since it matches the OnePlus Tablet a bit better. I don't think I'm going to be hired as an artist by Marvel anytime soon, but it is nice seeing other colors of technology besides just black and silver. The 11.6 inch display of the OnePlus Tab is 144 Hertz. With 500 nits and can display 1 billion colors. It also has a 7x5 screen ratio to appear more like a book instead of a TV screen. And as we can see, after about 10 seconds under the heat from my lighter the pixels do go black and turn off. OnePlus is using an IPS LCD and the screen does recover. Now, when I first started bending tablets I thought all of them would break, and it's true, we have had a few iPads fail. But we have had other iPads live. The Galaxy Tab S8 lived, and the Surface Pro lived. And now with a bend from the back, surprisingly, it looks like this OnePlus Tab might just live. There is some flex, but the frame and glass remain intact. Bending from the side, the screen does ripple a bit but there are no cracks, creaks, or fatalities. The screen flexes out from the frame but it is very safe to say that the OnePlus Tab does survive my durability test...probably because there's an invisible Hulk on the back. But I do gotta say it is a very awkward moment when OnePlus's tablet is stronger than their phones. Congrats OnePlus. If you want to see the insides, go ahead and hit that thumbs up. One like and I'll do it. And if you want to carve the Hulk into the back of your own technology, I'll leave a link for my new razor knives in the description, JerryRigKnife.com. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "JerryRig Razor Knife",
        "OnePlus",
        "OnePlus Tab",
        "Linus Tech Tips",
        "Razor Knife",
        "official Linus Tech",
        "tablet",
        "Stylo",
        "Linus Tech",
        "OnePlus Tablet",
        "JerryRig Razor",
        "Tab",
        "screen",
        "OnePlus Stylo",
        "Inside",
        "Tech Tips orange",
        "orange JerryRig Razor",
        "OnePlus Pad",
        "Razor",
        "back"
    ],
    "transcript_entity_values": [
        "7x5",
        "OnePlus",
        "Marvel",
        "just $15",
        "the past few years",
        "Tab",
        "OnePlus Tab",
        "about 1/3rd",
        "OnePlus",
        "IPS",
        "67 watt",
        "JerryRig Razor Knife",
        "two",
        "this OnePlus Tab",
        "Stylo",
        "6",
        "Hertz",
        "144",
        "this day",
        "OnePlus Stylus",
        "2006",
        "half",
        "4",
        "iPad",
        "the OnePlus Tablet",
        "1 billion",
        "the Surface Pro",
        "iPad",
        "5",
        "11.6 inch",
        "Apple",
        "OnePlus Pad",
        "USB-C",
        "five",
        "Linus Tech Tips",
        "8 megapixels",
        "Hulk",
        "iPads",
        "500",
        "first",
        "second",
        "82 milliamp hours",
        "the OnePlus Tab",
        "13 megapixel",
        "Samsung",
        "JerryRigKnife.com",
        "Today",
        "the OnePlus Pad",
        "Hulk",
        "4,000",
        "One",
        "the OnePlus Stylo",
        "3",
        "USB",
        "every year",
        "The Galaxy Tab S8",
        "60 million",
        "about 10 seconds",
        "the years",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "LAW",
        "LOC",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "FAC",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL"
    ]
}