{
    "id": "3Eeyfk05X-Q",
    "title": "Apple's doing it AGAIN",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-24T01:08:08Z",
    "video_url": "https://www.youtube.com/watch?v=3Eeyfk05X-Q",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Apple",
        "M1X",
        "Mac Mini",
        "M1X Mac Mini",
        "Apple M1X",
        "M1X Macbook",
        "M1X Macbook Pro",
        "Apple Silicon",
        "M1X specs",
        "M1X release date",
        "M1X leaks"
    ],
    "views": 750986,
    "likes": 37343,
    "comments_count": 801,
    "description": "Get the right tool for the job at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEW SOURCES:  ---------------------------------------------------  Timestamps: 0:00 PFFFF 0:09 Razer is hacking Windows 1:00 Apple M1X Mac Mini 1:50 Google shutting down Android Auto 2:40 iFixit 3:09 QUICK BITS 3:13 Smaller PS5 3:47 Microsoft exposes 38M records 4:13 Hacker returns Poly Network funds 4:41 Paypal supports crypto in UK 5:07 Barrowch CPU cooler w/ screen  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://iFixit.com/TechLinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/wUuAv",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh! You would, you would love if I just gave you the tech news, wouldn't you? Oh yeah! You would love that! Pfft! You probably wouldn't think a mouse would be responsible for a major security issue. But that's just what happened with Razer's mice over the weekend. That's right, Razer is training their growing cyborg mice. A security researcher on Twitter posted screen cap footage of how the vulnerability works. You plug in a Razer mouse or it's wireless dongle, then Windows update will fetch the installer program and run it with system privileges. Uh oh! Which allows you to open up File Explorer and Powershell also with elevated privileges, making it easier for a bad actor to install malware. The good news is that this attack can't be carried out remotely. You need actual, physical access to a computer, and a Razer mouse to do it. - [James] Look out libraries! - It's kind of weird there, at the, at the local library, everyone's bringing in these gaming mice? Razer is working on a fix, but in the meantime, if anyone shady shows up at your door with a Razer mouse, just don't answer it. It looks like the Mac Mini is going to be getting some big changes soon. Merry Christmas ya filthy animal! - [James] And a Happy New Year. - And a Happy New Year! It looks like the Mac Mini is gonna be getting some big changes soon. It's going through puberty. Although, we've already gotten a Mac Mini with Apple's new M1 chip inside, it didn't feature many other changes from the previous Intel models. However, signs are pointing to a new Mac Mini that not only has the updated M1X processor. But other significant modifications that will make it more high end. Louis Vuitton's involved. - [James] Ethernet ports! - Oh my gosh, can you imagine? With the new Mini expected to feature more ports, and a different design with maybe a magnetic power connector and a plexiglass top surface? We'll probably end up seeing these M1X models this fall, around the same time Apple is expecting to debut it's new MacBook Pros. If you're a fan of Android Auto, but you've already upgraded your phone to new Android 12 beta, you might have noticed you can't use Android Auto on your phone screen while driving any more! - [James] Take these training wheels off Google! - Ah! Let me live! The move comes as Google tries to get users onto Google Assistant Driving Mode instead, which is actually quite similar, except it's more of a feature set that integrates into existing apps, rather than a separate app. This change will only really affect those who don't have an Android Auto compatible screen built into their cars and instead use it directly from the phone with a clamp to go on your dash or wind shield. The new driving mode is supposed to simplify the experience for drivers, as many found it easier to just interact with the phone via voice, than use the phone app's clunky UI. I'm just waiting for the time when we don't even have phones and we just think things. And they happen. - [James] Take me to the consulate. - *Laughs* Now it's time for Quick Bits, bought to you by iFixit! They make compact tool kits with all the essential bits you need to fix your electronics. From mini kits with 16 bits, to full repair tool kits to start your repair business even. iFixit has you covered. They've also got over 70,000 repair manuals with photos and step by step instructions, so you can work worry free knowing you've got quality parts, also backed by iFixit's lifetime warranty. So fix your stuff today, by checking out iFixit.com/TechLinked Quick Bits, what?! After everything we've been through? A new PS5 model is going on sale, and similar to past revisions of the PlayStation, this one is well... Small station. That's what I usually call the second one. It weighs 300 grams less than the original model, which James tells me... - [James] It's about a third of a keyboard. - And there's also a base stand that can be adjusted with a thumb screw, instead of needing to bust out your old screwdriver. Which actually isn't that bad to do if you got iFixit like I said. Of course it doesn't look like this PS5 will be any easier to get your hands on than the old one, so what's the point? Just... kick the wheel around. Microsoft has some egg on it's face today, after 38 million sensitive records were breached, and the default settings of it's Power Apps are apparently to blame. These records included COVID vaccination status, social security numbers and home addresses stolen from American Airlines, government bodies and Microsoft itself. - [James] No-o-o! - Wait, what apps had all that information? The Power Apps... they're holding onto power. Earlier this month, the Poly cryptocurrency network was hit by a hacker that stole over $600 million dollars worth of digital coin. Well, the hacker finally returned the rest of the money today, and Poly has even offered a bug bounty reward and a job as it's chief security advisor. So who said crime doesn't pay? Disclaimer: don't actually go out and commit crimes as a way to get a job. Although that's what, that's what white hat hacking is. Hackers are stealing our jobs! Speaking of crypto, PayPal has finally started offering the ability to buy and sell crypto on it's platform outside of the US. With customers in the United Kingdom seeing the feature roll out. BitCoin, Ethereum, Litecoin and BitCoin Cash, will be supported, along with transaction amounts between 1, and 15,000 of Her Majesty's pounds. Soon we'll be saying Her Majesty's... NFT's. She's got, she's hoarding them. [James] Just go. And CPU AIO coolers with little screens on them are nothing new, but one manufacturing is really pushing the limit here, as Barrowch, I don't know if that's what you're saying, i-if that's what you say? But they released a model with a 1440p display. The idea is to display tons of data from Aida64, offering users a lot more detail than just current temperatures, and because it uses HDMI, you can even use it as a very, very small monitor. - [James] I would love to bend over and look at my PC, rather than just opening Aida64. - We don't even have enough laptops for 1440p screens, but we're getting them from freaking coolers? I'm upset! What about the gamers?! Come back on Wednesday for more tech news! And subscribe? We never tell people to do that. [James] Tabs are wide open on Wednesday! Hot and cold. - It's a party.",
    "transcript_keywords": [
        "Mac Mini",
        "Razer mouse",
        "Razer",
        "Android Auto",
        "Mini",
        "Mac",
        "Happy New Year",
        "Android",
        "phone",
        "Power Apps",
        "apps",
        "Quick Bits",
        "Bits",
        "mouse",
        "Razer mice",
        "power",
        "love",
        "Auto",
        "Google",
        "security"
    ],
    "transcript_entity_values": [
        "MacBook Pros",
        "Mac Mini",
        "38 million",
        "Intel",
        "Razer",
        "James]",
        "the weekend",
        "James] Take me",
        "BitCoin",
        "US",
        "one",
        "American Airlines",
        "iFixit",
        "NFT",
        "Louis Vuitton's",
        "Google",
        "Earlier this month",
        "300 grams",
        "James] No-o-o! - Wait",
        "Windows",
        "James] Look",
        "$600 million dollars",
        "Majesty",
        "over 70,000",
        "second",
        "Pfft",
        "File Explorer",
        "15,000",
        "today",
        "Android 12",
        "Twitter",
        "Ethereum",
        "Mini",
        "Microsoft",
        "Quick Bits",
        "the United Kingdom",
        "this fall",
        "Driving Mode",
        "Litecoin",
        "New Year",
        "Mac Mini",
        "PS5",
        "M1",
        "16",
        "the Mac Mini",
        "Razer",
        "Razer",
        "between 1",
        "Wednesday",
        "about a third",
        "Barrowch",
        "PayPal",
        "James] Tabs",
        "Power Apps",
        "Poly",
        "James",
        "Android Auto",
        "PlayStation",
        "digital coin",
        "Apple",
        "UI",
        "Powershell"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "EVENT",
        "FAC",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}