{
    "id": "3F0tSL8oVJI",
    "title": "Galaxy S22 Ultra hands-on: just call it a note",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-02-09T15:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=3F0tSL8oVJI",
    "category": "Science & Technology",
    "tags": [
        "s22 ultra",
        "galaxy s22 ultra",
        "samsung",
        "samsung galaxy s22 ultra",
        "samsung s22 ultra",
        "s22 ultra impressions",
        "galaxy s22 ultra unboxing",
        "samsung galaxy s22",
        "samsung s21 ultra",
        "samsung unpacked 2022",
        "samsung unpacked",
        "s21",
        "s21 ultra",
        "best phones 2022",
        "best phones",
        "hands on",
        "first look",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 151668,
    "likes": 3449,
    "comments_count": 227,
    "description": "The Samsung Galaxy S22 Ultra has shaped up to be everything that leaks, hints, and speculation indicated it would be: a Samsung Galaxy Note, minus the Note branding. It offers a 6.8-inch screen, a built-in S pen stylus, a boatload of cameras, a $1,199 price tag, and a boxy shape straight from the Galaxy Note series.   Samsung Galaxy Unpacked 2022 in 8 minutes:   Read more:     Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3rBcKB5",
        "https://www.theverge.com/e/22681056",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This is the brand new Samsung Galaxy S22 Ultra, in name at least, but in look, feel, and function, it's really a Galaxy Note that's now sitting on top of the S22 lineup. It's got the same squared off corners as a Note, the same S Pen silo, the same pretty much everything. It's a Note, and it looks every bit like an evolution of the Note 20 from two years ago. But Samsung is sticking with the Ultra brand instead of calling this say the S22 Note edition. Okay then. (bouncy music) Here's the deal. Samsung tells us that it used the Note is more of an overarching experience nowadays more than a singular device. That makes some sense when you consider that the S Pen works with the Z Fold 3 and some of Samsung's tablets and laptops. Even so, I think it was a dumb decision. The Note brand is iconic and has more cache with consumers than the Ultra. But, oh, well, here we are. But if you are one of those loyal Note fans and you've been waiting for a new model with modern specs, the S22 Ultra doesn't disappoint. It's got a gorgeous 6.8-inch 1440p display with 120 hertz max refresh rate. Just like the rest of the lineup, the screen is brighter than ever before with a peak brightness of 1,750 knits. Samsung says there's a new vision booster algorithm that adapts the color and contrast to ensure everything on screen stays visible even in direct sunlight. And now the display can drop all the way down to one hertz when there are static items on screen to save battery. Inside the S22 Ultra is Qualcomm's latest Snapdragon 8 Gen 1 processor, its first 4-nanometer chip, up to one terabyte of storage, and up to 12 gigabytes of RAM, a 5,000 milliamp hour battery with 45 watt fast charging, reverse wireless charging, Wi-Fi 6E, and every flavor of 5G. No matter whether it's called a Note or Ultra, this thing is still a specs beast. And it's also IP68 dust and water resistant like always. Those top tier specs extend to the camera system too. Before we go any further, I wanna give a shout-out to the discontinued S21 Ultra, which had one of the coolest looking camera designs ever. That black model was so damn sleek. But since Samsung has switched over to a Note influence style this year, the novel wraparound camera module is gone. Now, there's a bunch of different lenses sticking out, which looks fine if a bit boring. For the main camera, Samsung's using 108 megapixel f/2.2 sensor that's larger than the S21 Ultra's. It's still pixel binning all that data down into 12 megapixel files. The telephoto camera still offers 10 times optical zoom and the gimmicky 100 times space zoom that's more of a stunt than anything else. There is a secondary telephoto lens with three times optical zoom and a faster f/2.4 aperture for your portrait shots as well. Samsung's big focus this year is making everything look great no matter your photo skill level. The S22 Ultra and other S22s have a new auto-framing feature for video that can detect up to 10 people in the scene, keep everyone in the shot with the right focus. Samsung's super steady stabilization was already impressive, but that's also getting better this year as well. You can shoot 4K video up to 60 frames per second or 8K and up to 24 frames per second. As for stills and night mode shots, Samsung says it's making a lot of AI improvements to increase detail, reduce noise, and optimize the shot based on what's in the scene. But maybe the biggest upgrade this year is for portraits. Samsung claims that it can now separate individual strands of hair on your subject and blur out the background. Now, hair and things like glasses are usually tricky for phone cameras. So if the S22 can deliver on those big words, that'd be a huge deal. Portrait modes also now accurate for pets as well. As for software, the S22 Ultra runs Android 12, so you've got more control over privacy and things like your camera and microphone than ever before. There are a few new tricks here and there like the option to share your screen in Google Duo but not in Teams or Zoom, which is kind of a bummer. And then there's the S Pen. Samsung says its handwriting latency is now dropped all the way down to 2.8 milliseconds. To achieve that, Samsung is using AI to predict which direction you move the S Pen next for handwriting and drawing. That little difference really felt great in the short time that I had to test out the new S Pen. So that's the new Galaxy S22 Note Ultra. It's coming in late February for a steep starting price of $1,200. And look, this is a phone for people who want a productivity powerhouse but maybe aren't ready for foldables just yet like the Z Fold 3. It's the best of Samsung in a traditional dependable form factor. And the S Pen feels fundamentally more useful and important when you've got a place to put it. The Note is dead but also very much back at the same time. And I think a lot of people are gonna be very happy about that. So if the phones weren't enough, Samsung also introduced a new Tab S8 Ultra that has a notch on the screen. Check out the verge.com for our full impressions of that.",
    "transcript_keywords": [
        "Note",
        "Samsung",
        "Ultra",
        "Note Ultra",
        "Pen",
        "Galaxy Note",
        "Note brand",
        "camera",
        "Ultra brand",
        "Samsung Galaxy",
        "screen",
        "Note edition",
        "zoom",
        "Galaxy",
        "year",
        "loyal Note",
        "Note fans",
        "Note influence",
        "brand",
        "Ultra runs Android"
    ],
    "transcript_entity_values": [
        "Ultra",
        "one",
        "up to 12 gigabytes",
        "4-nanometer",
        "late February",
        "three",
        "Google Duo",
        "AI",
        "108 megapixel f/2.2",
        "2.8 milliseconds",
        "the S22 Ultra",
        "Wi-Fi 6E",
        "S Pen",
        "Snapdragon 8 Gen 1",
        "5,000 milliamp hour",
        "60",
        "120",
        "1,750",
        "8",
        "the S Pen",
        "Qualcomm",
        "6.8-inch",
        "Samsung Galaxy S22 Ultra",
        "1,200",
        "Samsung",
        "the Z Fold 3",
        "the S21 Ultra's",
        "the S Pen",
        "S21 Ultra",
        "12",
        "24",
        "4",
        "12 megapixel",
        "this year",
        "the S Pen",
        "second",
        "Tab S8 Ultra",
        "the S Pen",
        "first",
        "100",
        "45 watt",
        "Teams or Zoom",
        "two years ago",
        "Galaxy S22",
        "RAM",
        "S Pen",
        "10"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "LAW",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL"
    ]
}