{
    "id": "3g_oelqhULw",
    "title": "Destroyed Macintosh Replica (Canceled Project) - Krazy Ken’s Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-08-18T15:59:48Z",
    "video_url": "https://www.youtube.com/watch?v=3g_oelqhULw",
    "category": "Science & Technology",
    "tags": [
        "Destroyed Macintosh Replica (Canceled Project) - Krazy Ken’s Tech Misadventures",
        "Macintosh",
        "Apple",
        "Mac",
        "Mac Plus",
        "Mac Replica",
        "ITX",
        "Motherboard",
        "PC",
        "Damaged",
        "Destroyed",
        "RAM",
        "CPU",
        "Windows",
        "Linux",
        "macOS",
        "Alibaba",
        "AliExpress",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Funny",
        "Tech",
        "Computer",
        "Computer Clan"
    ],
    "views": 54617,
    "likes": 2917,
    "comments_count": 199,
    "description": "You can support this channel on Patreon! Link below This Macintosh replica could have been used for some fun projects! But everything changed when the Fire Nation attackederm I mean The Krazy Ken Curse.  See rare & retro tech   Canceled Windows 8 episode   Download our epic wallpapers   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Did you like the wallpaper on the iMac in the background? There's a whole pack designed by Ian Zelbo (RendersbyIan)   (affiliate link)  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://patreon.com/posts/deleted-scenes-8-70568244?utm_medium=clipboard_copy",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://gumroad.com/a/209727315/vaxwm",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- So, I found this replica Macintosh on AliExpress and I thought it would be a fun project to tinker with. But when it arrived, it was in a thousand pieces. (upbeat electronic music) Hey everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And recently, I was in the middle of working on two other episodes, an installation sensation and a scam-buster follow up. But The Krazy Ken Curse struck hard. The installation sensation project went up in flames and the scam-buster product still isn't here even though I ordered it seven weeks ago. So because of those problems, I have nothing else to do this week. So I figured I would let you guys know what's going on with this replica that I ordered back in February. Now just to manage expectations, I do not have any plans to do anything project-wise with this product. I'm canceling all that due to the unfortunate circumstances. But I would still like to talk with you today and tell you the story of how we got to this point. So here's where it started. I saw tweet from ViolenceWorks on Twitter and he said, \"Hey, there's this ITX Mac on AliExpress.\" Okay, that sounds right up my alley. He said, \"Somebody buy it and tell me how it goes.\" Giving into peer pressure of Twitter, of course I bought it because that's just what I do. And the listing photos looked promising. Visually, it looked like a rather well built product. I mean, you're looking at it right now. It doesn't look too bad, right? Well, just wait and see. There's two versions. There's a version that just functions as a monitor. You can plug in, I believe HDMI, and you can get your video output on the screen. But the other version, the version I purchased, has a full featured computer on the inside. And there's this amazing comic sans font in the listing too. Oh, I feel better already, but don't worry. It comes with original God stress free. And I can confirm that's BS, because this project has been anything but stress free. 360 degrees around stereo attack and \"high fideity\" sound. That's right, deity. These headphones have Jesus built in. So anyway, I sent in the payment, it went through, and now we wait. But then I got a notice saying that the charge for the shipping wasn't enough. Okay, I get it. Sometimes that happens with international stuff. It's coming from China all the way to my lair here. It's far away. So it ended up costing me an extra 100 bucks that I wasn't expecting to spend but I was like, \"Whatever, just pay the guy and move on.\" And it arrived. It was well packed. It was in this really thick foam. So I thought, \"Okay, great. You know, the box wasn't damaged, the foam wasn't damaged. Looks good.\" Take it out. Visually, it looks okay. Audibly, (computer rattles) not so much. So I inspect it a little bit closer. I checked the back and I see a little crack on the IO panel and I thought, \"Ooh, okay. A little bit of damage, nothing too serious so far.\" But then I noticed the motherboard was crooked. Now I'm a little more concerned. That's a lot more serious, but I kept investigating. Hopefully the electronics were okay, right? But then I see loose screws on the inside. Now, typically screws don't just unwind a bunch in shipping and fall out. Something else must have happened. The structures that hold the screws in were all cracked. All of the internal plastic structures inside this thing were destroyed. Everything was shaking inside of itself and breaking. This plastic, I'm not an expert, but it was probably 3D printed. I don't know exactly what material composite it is. I'm afraid I'm gonna break it just by touching it a little too hard. It's not good construction, which is probably why it couldn't survive the shipping very well, despite it being packed really well inside the box. And also when I was inspecting the inside a lot of powder came out and I'm guessing again that's that cheaper plastic composite material whatever it is just grinding. And it's so fragile, it just grinds into a fine powder. So essentially none of the structural components inside this thing were intact and all of the electronic components were loose except for the screen and the power supply unit. Those were actually secured okay. So I contacted the seller to try to fix this problem and thank goodness he spoke English. And I say that because again, I'm using AliExpress. And for those who aren't familiar with AliExpress, it's a China based retail service owned by the Alibaba Group. And a lot of the sellers are Chinese. Now in the messaging system there is a translator built in, which is nice. But again, thankfully this guy spoke English. So I didn't really need to use that feature. However, keeping up with the messaging was kind of annoying because we're on complete opposite sides of the planet. And time zones are a bit of a problem there. I'm awake, he's asleep. There's sometimes 12 to 24 hours between messages. And anytime you wanna go check your messages on the web app, you have to do this annoying sign in code thing which is ridiculous 'cause you get like 60 seconds to type it in and it takes like 30 seconds for the email code to get to you. So you really only have 30 seconds to type it in and you have to do that every single time. Now you can use the app, which is much more convenient because you don't need to constantly re sign in and it has push notifications. So when the seller messages you, you get notified, however, you also get notified about a lot of other things. Maybe there's a setting for it, but I got a lot of advertisements from AliExpress when I installed the app. So many push notifications, it just annoyed me. And sometimes I would totally lose track of the real message notification that I needed to tap on. But on the bright side, I got an ad for this amazing bikini. I think it would look good. It's better than the AirPods one I did. Let's forget about that. The initial solution was to get a new case and keep the electronics. Okay, that could be a fun episode, right? Doing some surgery, just taking the guts out of this and putting them in a new case. Brilliant. But before we do that, we need to check to make sure the electronics actually works. So I did a test. I plug it in, power it up, and the fan spins up and it spins down and it spins up and it spins down and it just keeps doing this. It doesn't do anything else. When the seller watched my video, he noticed there's supposed to be a blue light that turns on the front, but it wasn't showing up. So he suggested check all the connections. Okay, maybe something was loose. Actually, when Dongle was over and we were filming those other episodes, he tinkered with this thing and thanks to his help, boom, the light turned on this time but the fan still was stuck in that loop. So Dongle suggested to pull the RAM. We took the RAM out, powered the thing up and guess what? The fan stayed on. It didn't keep turning off. This was great. But guess what? Nothing else happens. So one little problem got solved but the thing still didn't work. So at this point it just seems like the juice isn't worth the squeeze anymore. The structural components are broken and the electronics aren't working and there's plenty of other projects that deserve my time and energy, right? So I contact the seller trying to start a return. Thankfully he said yes. So once this gets returned, I should get a refund but I'm probably not gonna be refunded for the initial shipping, maybe. And I'm likely not gonna get reimbursed for the return shipping. So I'm gonna be out about 200 bucks or so, but whatever, live and learn. It is a bit of a bummer because I wanted to put Linux on here and skin it to look like macOS. I also wanted do a Hackintosh with it and I wanted to have it at my booth at vintage computer festival Midwest. But again, I have plenty of other cool things I'm working on and I'm gonna have plenty of other cool things at that booth too. So it's just time to move on from this. So as I'm prepping this thing to ship it I then realized, \"Wait, I don't have a return address.\" I looked on the box, that's sitting down here but I don't see a return address on there. And even if there was a return address on there, I probably couldn't read it because it's in Chinese. Sorry, I don't know how to read that. So I message him. And he gives me the address I need to send it back to, but he sent it as one long line and I don't know how to break that up because typically an address is like four lines or something like that, but it was just one long line. And I'm like, \"I don't understand how to format this for a Chinese return address.\" So I message him again. And he reformats it. It looks a lot more feasible. So hopefully when I pack this thing up, put the label on it, it actually arrives. I've never shipped anything to China before. So hopefully this works. I will follow up about this. Hopefully it's good news. I'll post about it on my Twitter. So make sure you're following me on there. And yeah, fingers crossed that The Krazy Ken Curse doesn't strike and it gets back to the place. Well, I would say in one piece but we already know that can't happen. So that's the status of this project. Sorry, it didn't work out, but stick around for many more fun things because I like to make new episodes about rare and retro tech, new tech, and of course, scam tech. And I release them usually on Thursdays every week. And hey, if you like this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (upbeat electronic music) Let's see China, China, where's China? It's the one shaped like a boot, right?",
    "transcript_keywords": [
        "Krazy Ken Curse",
        "Krazy Ken",
        "replica Macintosh",
        "thing",
        "China",
        "inside",
        "Ken Curse",
        "Macintosh",
        "return address",
        "lot",
        "return",
        "Macintosh on AliExpress",
        "address",
        "time",
        "Krazy",
        "Ken",
        "things",
        "shipping",
        "AliExpress",
        "Twitter"
    ],
    "transcript_entity_values": [
        "February",
        "Hackintosh",
        "ITX Mac",
        "this week",
        "Linux",
        "two",
        "China",
        "the Alibaba Group",
        "IO",
        "Chinese",
        "30 seconds",
        "an extra 100 bucks",
        "Dongle",
        "Macintosh",
        "about 200 bucks",
        "seven weeks ago",
        "today",
        "Krazy Ken",
        "AliExpress",
        "English",
        "Chinese",
        "360 degrees",
        "RAM",
        "one",
        "four",
        "60 seconds",
        "thousand",
        "Jesus",
        "12 to 24 hours",
        "Twitter",
        "Thursdays every week",
        "like 30 seconds",
        "Midwest"
    ],
    "transcript_entity_types": [
        "DATE",
        "LOC",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "NORP",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "LANGUAGE",
        "LANGUAGE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "TIME",
        "LOC"
    ]
}