{
    "id": "3GNoelvk6S4",
    "title": "What am I Supposed to Recommend Now?? - The Problems With OnePlus",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-26T17:31:34Z",
    "video_url": "https://www.youtube.com/watch?v=3GNoelvk6S4",
    "category": "Science & Technology",
    "tags": [
        "oneplus",
        "android",
        "iphone",
        "ipohne",
        "adnroind",
        "google",
        "goggle",
        "googgle",
        "oneplus 10 por",
        "oneplus 10",
        "oneplus 9",
        "oneplus 9 pro",
        "oneplus phone",
        "carel pei",
        "phone",
        "not working",
        "bugs",
        "apple",
        "phone bugs",
        "phone not working",
        "malfunction",
        "i hate my phone",
        "i hate oneplus"
    ],
    "views": 2370312,
    "likes": 99317,
    "comments_count": 9011,
    "description": "Sign up today at  or learn more about Lakeside Software at   Create your build at   From flagship killer to dead flagships, OnePlus has taken a plunge from grace. Where did it all go wrong for the brand who once promised they would never settle?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:19 Storage Problems 4:29 Problem 1 4:51 Lil Linus' Problems 5:42 Yvonne's Problems 6:11 Brandon's Problems 6:54 OnePlus Problems 10:45 Outro",
    "description_links": [
        "https://lmg.gg/LakesideWebinar",
        "https://lmg.gg/LakesideLTT",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1439582-what-am-i-supposed-to-recommend-now/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I've added up to here with this. (swoosh effects) With what? With this! Being old enough to remember when OnePlus stood for well designed phones with clean software, at rock bottom prices. It's been painful for me watching their slow descent into mediocrity. And it's high time that I share my thoughts. The one-time flagship killer has been plagued by hardware issues, software glitches, and, most damningly, lackluster support for the enthusiast users who made them what they are today. What the heck happened? I used to rely on OnePlus as my recommendation go to for friends and family alike. The one company, shh, other than that one, that I could count on for years of intuitive software updates and trouble free operation. Then in the last couple of years, I've ended up in the doghouse twice over OnePlus recommendations. First, with my son, which is bad enough. Then with my wife, which is much, much worse. So now to make it up to her, I'm gonna have to buy her something nice with this money from our sponsor. - Build Redux. Build Redux makes it easy to configure your new build with support guides to help you along the way. They also offer competitive pricing as compared to building a PC yourself. So head to buildredux.com/linus and start your new build today. - While I've been personally frustrated for a while, it was an exchange with our good friend, Steve, from GamersNexus that pushed me from I'm not recommending these to friends anymore to I need to make a video about this. It appears that certain models of OnePlus phones have been afflicted by a strange bug that causes their storage to fill up at an alarming rate, intriguing. Now the obvious solution would be to delete some cat pictures, but if user reports are anything to go by not even a complete purge of precious memories of Snowball I is enough to free up the space. And in fact, there's no indication within the UI of what is consuming all of the storage. Even factory resetting these devices yielded no improvement. So to diagnose what's going on here we need to go to the device logs. Logs are a record of diagnostic data and they can include information about operating system updates, app crashes, physical errors, anything that could help to troubleshoot a device that isn't functioning correctly. Only, we've got a problem. This log data, on Android, isn't available to end users, at least not out of the box. Thankfully, OnePlus has still got one thing right. They're one of the only Android phone makers who still allow adventurous users to tinker under Android's hood by rooting their device. This process comes with enough risk that most manufacturers will actually void your warranty just for attempting it. But it also has some benefits, including granting complete access to the phone's file system. And it was in these typically hidden system folders that a few brave enthusiasts came across some modem log files or dumps that were pretty suspicious. For starters, they were big, hundreds of megabytes in some cases, which is a lot of text. But your phone generating big log dumps isn't itself a problem. It's when it doesn't clean up after itself. And that's exactly what happened here. Affected users discovered that OnePlus' historically well managed OxygenOS was simply leaving these logs to pile up until there was no storage left for anything else. Well, great. Now that we know what the problem is, it's an easy fix, right? Mm, not exactly. While rooting is an option for OnePlus users, it comes with a plethora of inconveniences. First and foremost, being that many apps, including banking and entertainment apps, will simply refuse to run if they detect a rooted device. Not a great workaround. It also doesn't change the fact that your system is still dumping these large files into storage on a consistent basis. It's like, okay, there's a hole on your ship, but don't worry. This bucket will save the day, dumb. We tried reaching out to OnePlus about the problem. And a couple of weeks later we finally got a reply indicating that they are aware of the issue and have been working to fix it, which I mean is okay, except that there are complaints about this going back as far as mid 2021, with OnePlus reps at times giving users the runaround or even ghosting them entirely. We would never ghost our floatplane.com subscribers. Check it out for behind the scenes and outtakes. Now, in fairness to the reps, if my recent experience is anything to go by, OnePlus' software team has plenty of other bugs to squash. Here's one that persisted on my wife's phone for months. Okay, in fairness, the arrow is within about the same area code but she's gonna need a bit more accuracy than this if she's gonna end up on the right off ramp, hey? My son's deal breaker issue was an even stupider one. His phone got an update that completely broke data access on the Telus mobile network. Oh, no problem, I thought. I'll just go edit the APN settings and, nope, OnePlus actually grays out these buttons, making them impossible to click on. The most ridiculous thing about this seemingly arbitrary interface decision is that the functions behind the grayed-out buttons still work. So the workaround for me was to use this third-party shortcut manager app to jump to those settings directly, bypassing the grayed-out button. Et, viola, the settings can be changed. I mean, come on. Even Apple gives access to APN settings, OnePlus. It is basic functionality, like the wan hoodie's super secure phone pocket. Get yours today at lttstore.com. - I can't recommend putting one of these in it though. Since Linus gave me this phone a year ago, I've had my camera app refuse to open until I restart, but then it breaks again the minute my kids do something cute. I've also had problems with picture messages for three months before they finally patched that. And probably the weirdest one was that I couldn't answer phone calls. It's intermittent. So I couldn't catch it on camera, but the green button to answer calls just wouldn't register, which is pretty important for, you know, a phone. They are losing me too. I can't say I've ever had my actual phone app not work, but I've got my own problems. The most maddening one is the app switcher. Look at this. If I go to click on the previous opened app, it reopens the app I was just using, instead of opening the app I clicked on. I use the switcher dozens of times a day. So if you're starting to notice gray hairs that could be it. My ambient light sensor can take ages to adjust in dark areas. And I've had camera problems too. After the Android 11 update, I noticed that the images were being overprocessed to the point where pictures of my son looked like he had the life sucked out of him. And I also noticed some odd fingerprint scanner behavior where it sometimes won't even pop up. - Of course, every phone has bugs, some of them lots. So why are we picking on OnePlus? It's because they promised to be something different. And their fall from grace has left a hole both in the market and in our hearts. (bell dings) Okay, as cheesy as that is, we're not the only ones who have noticed. In early 2021, MKBHD uploaded a video titled, What Happened to OnePlus? His ultimate conclusion was that they didn't really change but rather they outgrew their initial role as the enthusiast focused flagship killer subbrand for parent company BBK. He lamented their price creep and the design compromises that they've made to appeal to the mainstream. But he understood that business units have to be profitable and expressed a careful optimism about a potential return to form. And he could still be right. All the right ingredients are still there. And many of their big announcements since then around pooling resources between OnePlus and OPPO have been, yeah, and, moments for people like me, who knew that co-founder Pete Lau's previous role was as a VP at OPPO, and also that (laughs) they never really left. OPPO and OnePlus are both subsidiaries of BBK. So with all the pieces still in place and nothing really changed, why are they struggling? My diagnosis is that it's a matter of focus. OPPO and OnePlus phones have run similar hardware since day zero. I mean, BBKs different brands are literally only separated by curtains on the production floor. So it was always the software that set OnePlus apart. It was that obsessive attention to system responsiveness and to meaningful modifications, to an otherwise mostly stock Android experience. So why has that changed? Well, there was a leadership shake up, and while neither has addressed the alleged conflict that caused fellow co-founder Carl Pei to leave, he ended up founding his own company, Nothing. It was pretty clear during the awkward transition period where Mr. Lau gradually took on a more public facing role, that the rift between them was a long time brewing. If I had to guess what happened, I would say it was probably over controversial ideas like merging OPPO's, from my personal experience, worst ColorOS software with OnePlus', really excellent, OxygenOS. But as an outsider, it's hard to say for sure. After all, it is Pete Lau, not Carl Pei, who is credited with bringing Cyanogenmod, the clean, mostly stock open source Android skin, that eventually became LineageOS to OPPO in the first place. Bottom line, like Marques, I'm still rooting for them. And there is tons of time left to write the ship, but it's clear that they need to get their head in the game, especially when it comes to software. And it's clear that I'm gonna tell you about our sponsor. Lakeside Software. Lakeside Software is a digital, employee experience management platform that your whole business will love. Their solution collects over 10,000 data points, about every end point in your IT estate, every 15 seconds. Neat, right? Even better. All of that data is used to automatically resolve IT tickets and issues. This data can even fuel next generation root cause analysis, proactive IT, and, most importantly, improved digital employee productivity. On June 29th, you can join Lakeside for a webinar to discuss their 2022 Digital Workplace Productivity Report. You'll learn about IT's impact on organizational productivity, downtime and turnover. The webinar summarizes the experiences of 600 executives, IT leaders, and employees regarding their digital employee experience. So sign up today or learn more about Lakeside Software at the link down below. Thanks for watching. Let us know in the comments how your experience has been with OnePlus. Has it gotten better or worse over the years? If you're looking for something else to watch, check out our recent TechLinked videos, where we discussed how apple still has no USB-C on their upcoming iPhones, but how the European union may force them to within the next couple of years. (upbeat music)",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "software",
        "app",
        "Android",
        "OPPO",
        "Lakeside Software",
        "OnePlus phones",
        "users",
        "experience",
        "data",
        "problem",
        "system",
        "Build Redux",
        "Lakeside",
        "Pete Lau",
        "device",
        "Build",
        "phones",
        "happened"
    ],
    "transcript_entity_values": [
        "the years",
        "one",
        "the next couple of years",
        "Snowball",
        "UI",
        "Apple",
        "first",
        "a couple of weeks later",
        "iPhones",
        "2022",
        "Pete Lau",
        "600",
        "Carl Pei",
        "the European union",
        "First",
        "Lakeside Software",
        "a year ago",
        "BBK",
        "Telus",
        "early 2021",
        "today",
        "10,000",
        "11",
        "OPPO",
        "OnePlus'",
        "Marques",
        "GamersNexus",
        "June 29th",
        "Lakeside",
        "months",
        "hundreds of megabytes",
        "three months",
        "APN",
        "the last couple of years",
        "dozens",
        "mid 2021",
        "Cyanogenmod",
        "MKBHD",
        "Build Redux",
        "OnePlus",
        "every 15 seconds",
        "TechLinked",
        "Pete Lau's",
        "third",
        "Linus",
        "the day",
        "OnePlus",
        "Lau",
        "VP",
        "Mm",
        "Steve",
        "OnePlus",
        "years",
        "Android"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "NORP",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "FAC",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG"
    ]
}