{
    "id": "3IEDFC8NZqA",
    "title": "Motorola Razr hands-on: the foldable phone we’ve wanted",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-11-14T04:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=3IEDFC8NZqA",
    "category": "Science & Technology",
    "tags": [
        "moto",
        "motorola razr",
        "moto razr",
        "motorola",
        "razr",
        "motorola razr 2019",
        "moto razr 2019",
        "razr phone",
        "android 9 pie",
        "2019 razr",
        "oled",
        "android 9",
        "android",
        "moto phone",
        "moto phones",
        "razr 2019",
        "tech news",
        "phone",
        "phones",
        "new phone",
        "new foldable",
        "new phones",
        "smartphone",
        "smartphones",
        "flip phone",
        "foldable phone",
        "foldable",
        "foldables",
        "foldable phones",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 2033316,
    "likes": 29519,
    "comments_count": 3180,
    "description": "The Motorola Razr flip phone is back, but now its an Android smartphone with a foldable display. The 2019 Razr keeps the same general form factor, but replaces the T-9 keypad and small LCD with a 6.2-inch, foldable plastic OLED panel and Android 9 Pie. Itll cost $1,499 when it arrives in January of next year.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2qa37wk",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey it's Chaim with The Verge and I'm here with the new Motorola Razr. It's back. The original Razr's maybe the most beloved phone ever. It's been around for years. It basically was like the first cell phone that people had and now it's back and it's got a cool modern twist. It's foldable. So, Motorola's seen a really different approach with this foldable than we've seen on basically anything else so far. Instead of making a phone that unfolds into a tablet, it's a regular size smart phone that folds up into something much much smaller. It's got this little screen on the outside which is super fun, it shows notifications, you can use to control music, respond to text messages, and then you just flip it open and you have this full, giant, regular size Android phone. It's got a 21 x 9 resolution, so it's a little taller than what you'd expect from a normal phone, but not that much taller and really, holding it just feels like holding any other phone in your hand. Now, the screen is made of plastic, but Motorola seems really confident about the durability. They say that they're not really concerned, they're not telling anyone don't push too hard on it. There's a coating on it and we'll honestly just have to wait and see if that holds up. They've seemed pretty confident about the hinge and we need to talk about the hinge because it's really cool. A lot of the other foldable we've seen have had these weird gaps or spaces, but Motorola's doing some weird, cool sliding stuff. There is multiple hinges, there's plates that slide and support the two halves of the screen. But, the end result, is that it's basically perfectly flat and then you fold it up and it's still just perfectly flat. It works really the way you want it to. Now again, we don't know if this hinge is gonna let dust in or whatever, it's honestly too early to say, but it looks really cool. One thing that's not here, at least so far, there's not really a visible crease which is a sign that's shown up a lot with the other foldables and Motorola's done a good job. And just let me be honest guys, opening and closing it feels so good. You can just like, flip it open and there's your phone. Snap it shut, hang up on calls, it's amazing. Like, this is always how I wanna hang up a phone. So, what does make it a Razr? Well, Motorola says that it's focusing really big on design. It wants it to have that classic Razr look and feel, so it's got the chin. It's got the chin, it's got like the same curves and radius, it's got the same radius for the top ear piece, there's a big speaker hidden down here, the antennas are all there, and it's just something to hold onto. More modern, there's also a fingerprint sensor there, because this is an Android phone in 2019 and it needs to have one of those. There's a downside to this design though. In order to get it as thin and it's folding as it wants, Motorola's going a little soft on specs. The processor's only a Snapdragon 710, which is fine, it runs fine in our brief hands-on, but it's not a Snapdragon 855. It's not a flagship processor and that kinda sucks to see. It does have six gigabytes of RAM so it's not a total loss, but there are better phones out there, especially for what you're gonna pay for this. Another sacrifice to the design is the cameras. There are two cameras on here. There's the main camera which is on the front lid, for lack of a better term, which you can use to take selfies when it's closed or you can flip out and use as a regular camera. It's just not very good. It's a single lens 16 megapixel camera. Honestly, if you go back five years ago, it was probably fine, but compared to the iPhone or the Pixel or any of Samsung's stuff, it's just, it's not gonna hold up. The camera does have some of Motorola's other improvements. There is a night-mode. It does have some smart AI optimization stuff, but we haven't really been able to test that out yet. There's a really cute little Easter egg that Motorola has hidden here. It's hidden deep in the settings menu, but if you go and edit it, you can actually find there's a retro Razr mode, which turns the whole thing into a giant version of the classic Razr interface. It's basically just a fancy-skinned Android launcher that doesn't do a whole lot, but honestly, just looking at it on this thing, just made me smile. Previews start in December and it's not shipping until January, which means that you're still gonna have to wait awhile before you can even buy one. Which is especially disappointing, considering all the great phones that are already out on the market right now. It's gonna be exclusive to Verizon at least in the US. Motorola's not talking about any unlocked versions right now, which means that if you're not on Verizon, you're probably not buying one of these either. I mean honestly, it feels great to hold, it looks great, there's just nothing else like it on the market right now. Scrolling stuff on the giant screen is fantastic. Just reading articles, can fit so much more text on the display and because the screen is so similar to regular Android screens, you don't have a lot of the weird wonkyness you have where apps don't fit. We loaded up a game and it just looked normal, which is great. Foldable technology is still really new and there's still a lot of questions. We just saw Samsung have a ton of issues with its phone and I'm just not fully convinced that Motorola has figured this out and short of putting it out in the world and trying it out for ourselves over a longer period of time, there's just no way to know if they have. There's also the questions about specs again. This is a $1500 phone that has you know, a mid-range processor. It's a good mid-range processor, but it is a mid-range processor. You can buy a Samsung phone for half that, that has the latest and greatest. And that's just rough to see. On the other hand, there's just nothing else like it on the market. You can't do this on a Galaxy S10 or an iPhone 11. And honestly, maybe that's worth it to you. And if you really love the Razr, and I know there's a ton of people out there who do, it was my first phone, it was plenty of other people's first phones too and if you just want that old school feeling, well, Motorola is offering that. It's something that runs modern Android that has all the smartphone features that you'd ever want and it just looks super cool. This looks and feels like the future of phones. I'm just not sure at $1500 with the specs that it has, that it's quite there yet. Thanks so much for watching. For more great video content like this, check out The Verge. This never gets old.",
    "transcript_keywords": [
        "Motorola",
        "phone",
        "Razr",
        "Android phone",
        "Motorola Razr",
        "Android",
        "Chaim",
        "phones",
        "size Android phone",
        "honestly",
        "screen",
        "cool",
        "lot",
        "processor",
        "classic Razr",
        "great",
        "regular Android screens",
        "foldable",
        "camera",
        "basically"
    ],
    "transcript_entity_values": [
        "1500",
        "Android",
        "S10",
        "16 megapixel",
        "five years ago",
        "six gigabytes",
        "US",
        "years",
        "night",
        "Razr",
        "Samsung",
        "half",
        "two",
        "December",
        "Motorola",
        "One",
        "9",
        "2019",
        "21",
        "January",
        "Verizon",
        "first",
        "iPhone",
        "RAM",
        "a ton",
        "Chaim with The Verge and I"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "GPE",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART"
    ]
}