{
    "id": "3J_SM3ICVxw",
    "title": "What's in My Tech Bag! v4.0",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-01-30T19:01:57Z",
    "video_url": "https://www.youtube.com/watch?v=3J_SM3ICVxw",
    "category": "Science & Technology",
    "tags": [
        "What's in my bag",
        "What's in my bag tech",
        "what's in my bag 2016",
        "What's in my Tech bag",
        "tldtoday setup",
        "tld setup",
        "Best Travel Tech",
        "Best Travel Tech 2016",
        "What's in my bag 2016",
        "Best Travel backpack",
        "jonathan morrison",
        "hershel supply co",
        "herschel supply co heritage",
        "heritage backpack",
        "heritage bag review",
        "2016",
        "MacBook Pro",
        "Space Gray",
        "Space Gray MacBook Pro",
        "2016 MacBook Pro",
        "Review",
        "Unboxing",
        "AirPods",
        "Apple",
        "Apple AirPods",
        "airpods unboxing",
        "airpods 1 month later"
    ],
    "views": 779417,
    "likes": 18898,
    "comments_count": 973,
    "description": "Check out my previous what's in my tech bag!  Kingston MobileLite Wireless Pro:   MobileLite giveaway:    Apple AirPods - 1 Month Later:   Herschel Supply Co. Heritage Backpack -  Incase MacBook Sleeve -  2016 MacBook Pro -  AmazonBasics Travel Case -  Anker Lightning Cable -  Kingston MobileLite Wireless Pro -  HooToo Shuttle -  Sony Hear.on Wireless -   Apple AirPods -  Westone UM Pro10 -   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=5Pj_HisQagg",
        "http://kings.tn/TLDMLW",
        "http://kings.tn/TLDGiveaway",
        "https://youtu.be/w7bk1L6XMeU?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "http://amzn.to/2jOrLev",
        "http://amzn.to/2kkacpn",
        "http://amzn.to/2kk1AOU",
        "http://amzn.to/2juffzI",
        "http://amzn.to/2kLcbUb",
        "http://amzn.to/2j24OHF",
        "http://amzn.to/2k039SI",
        "http://amzn.to/2ktWD36",
        "http://www.apple.com/airpods/",
        "http://amzn.to/2k077KY",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, and today we're taking a look at what's in my bag. Now it may be curly, but I think sometimes being into tech leads us down the path of bags and backpacks that are maybe too tech heavy. Sometimes it's nice just to forget about the bags that have the built in battery, the eight million compartments, the 30 print connector, and focus on one that actually looks good. What I'm rocking right now is the Heritage by Herschel Supply Company, I believe this is the raven crosshatch color. It's got a really nice blend of both gray and black, which, if you haven't noticed yet, is something I am really drawn to. I think the color combos of this bag work really well with something like the LunarEpic Flyknit Oreos to free runs, or in my case, huge shoutout to Mr. Daniel Popovic for eyeing those Kobe 11 Oreos in the last video. But really, more than anything, there's something about this bag that kind of just turns heads. The one thing you may notice with this backpack, is because it's not super tech focused, you kind of got to bring some of those elements back. There is a laptop sleeve in here, but you notice there's not a lot of padding, so what I did I actually bring an in case sleeve to my MacBook Pro just to add a layer of protection. This, just like the backpack, is also rocking that gray and black theme, so by now, you should start to see a trend developing with me. Inside this guy is none other than the 2016 space gray MacBook Pro. This is the top specced MacBook Pro, which might seem a little insane, but for me, what was a big deal is actually having two terabytes of storage internally, because that allows me to do most of my projects and editing all from within the MacBook Pro. Now, the other day I got a question on Twitter asking if I were tired of my Mac Pro, for this MacBook Pro, and funny enough, I haven't actually used the Mac Pro in over a year now, so to answer that question, yes, I have been exclusively editing all of my videos off this MacBook Pro. What's awesome with this is when I'm at home or at the office, I've been docking this into LG's UltraFine 5K display so I could take advantage of a larger screen, keyboard, mouse, dedicated speakers, and then conversely, when I'm ready to pack up and go or I'm out traveling, being able to take that MacBook Pro and having that kind of continuity off a single machine is kind of awesome. Next, continuing along with the theme of bringing some tech elements back to the backpack, this traveling case from Amazon Basics is super useful if you've got those smaller tech items that float around freely and run around wreaking havoc in your backpack. Plus it's going to add a layer of protection just in case you drop it. Within this guy, first up, is the Kingston MobileLite Wireless Pro, and a huge shoutout to Kingston for not only sending this out, but also sponsoring this video. This guy essentially is the Russell Westbrook of tech accessories, in the sense that it is a multi talented triple threat. First off, it is a 6,700 milliamp hour external battery, second, there are 64 GB of storage built in that you can use to access wirelessly or back up to. Lastly, there's an SD card slot and USB port that you can use to not only expand the storage of this, but also transfer files from things like a DSLR to your smartphone wirelessly. Beyond that, we can also access files either internally or off an SD card which we're going to do in this case, so I can hop into the pictures and scroll through them just like I normally would in my camera roll. These are from the SD card and not from the phone. More than anything, it is a really nice way to access files, whether you want to load it up with music, movies, pictures, or alternatively, a really nice way to back things up. I can see it being really helpful if you're out in the field recording with something like a Zoom H5. Maybe you don't have access to a computer. This is a really convenient way to instantly back something up. Next is the Hootoo Shuttle USB dongle dock, whatever you want to call it, this is what I use alongside of my MacBook Pro. This gives me three USB 3 ports, and the USB-A flavor, an SD card slot, HDMI right here, and then a USB-C pass through, which is actually more useful if you're using a 12 inch MacBook. Next is nothing super exciting, I've got the charger to my MacBook Pro USB-C along with the cable, and a lighting cable from Anchor here. If you haven't checked these out, these are actually some of my favorite. They're super durable, super sturdy. If you've had problems with your lightning cable breaking, this might be a great solution for you. Lastly, inside the case, these are probably a rarity in terms of what you'd see as far as headphones go. These are the UM 10 pros from Westone. They're actually in ear monitors. Surprisingly, they have become my go to in ear headphones for editing on the road. They're a little intimidating at first, simply because of how you have to put them in your ears. Normally, with ear buds, you'd just pop them in. But with these, you've kind of got to wrap them around your ear, almost to the point where they feel like they're upside down, but once you lock them in, they're not going anywhere, and the sound isolation you get from these is crazy. Where I find these especially useful is when I'm editing on a plane, battling the outside noise of the engine and people usually doesn't work out so well with most headphones, but with these, I'm able to focus on what I need to hear. The downside with these, though, is because they work so well, if they're in your ears, then you have music playing when someone's trying to talk to you, you are not going to be able to hear them. Now, the one thing that has remained consistent from my last what's in my bag video are these Sony HearOn wireless headphones, which I'm including for a couple of different reasons. One, these are legitimately my favorite pair of wireless over your head phones. I would even go as far as to say I would take these all day over the Bose QC 35s. Too, since my last video, these headphones have dropped about $100 in price, so if you're on the fence about picking these up, I initially thought they were worth every penny, but now with the price drop, it is a no-brainer. Lastly, rounding out my bag is, surprise, surprise, Apple AirPods. Now, yes, those Sonys that I just talked about are still my favorite headphones, but the convenience, the simplicity and how well AirPods work have seriously cut into how much I use them. By no means are the AirPods audiophile quality, but they don't sound bad, and I find myself using them more and more often. For me, it really just comes down to the simplicity, I pull them out of the case, I don't have to worry about turning them on or connecting them. As you saw in my one month later video, small things like taking them out of your ear to pause a song or putting them back in to play a song is really nice, and since that last video, Apple actually rolled out Find My AirPod, which I something I thought would be really useful. That's all I really got to say. I like Apple AirPods, if you're going to hate on them, you're going to hate on them. Obviously, they have not replaced all of my headphones, which you clearly saw, but at the end of the day, they are just a really cool piece of tech. Aside from that, hopefully you enjoyed a look at what's inside my bag. If you guys dug this video, make sure to smash that Like button, links to everything we talked about including the backpack are down below. This is Jonathan and I will catch you guys later. - Shoutout to all the pear",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "MacBook Pro USBC",
        "MacBook",
        "Mac Pro",
        "gray MacBook Pro",
        "Herschel Supply Company",
        "bag",
        "case",
        "tech",
        "specced MacBook Pro",
        "video",
        "headphones",
        "back",
        "backpack",
        "Pro USBC",
        "kind",
        "nice",
        "ear",
        "super"
    ],
    "transcript_entity_values": [
        "UltraFine",
        "DSLR",
        "LG",
        "MacBook",
        "6,700 milliamp hour",
        "Westone",
        "One",
        "Apple AirPods",
        "SD",
        "10",
        "2016",
        "Twitter",
        "Amazon Basics",
        "Anchor",
        "this MacBook Pro",
        "AirPod",
        "30",
        "one month later",
        "USB",
        "every penny",
        "Apple",
        "Kobe",
        "about $100",
        "Oreos",
        "the MacBook Pro",
        "Heritage",
        "AirPods",
        "the Kingston MobileLite Wireless Pro",
        "the Mac Pro",
        "the eight million",
        "MacBook Pro",
        "Kingston",
        "Sonys",
        "Russell Westbrook",
        "second",
        "three",
        "a year",
        "first",
        "64",
        "12 inch",
        "First",
        "the end of the day",
        "one",
        "Daniel Popovic",
        "Herschel Supply Company",
        "MacBook Pro",
        "two terabytes",
        "Apple AirPods",
        "today",
        "MacBook Pro USB-C",
        "Sony",
        "the Bose QC 35s",
        "Hootoo Shuttle USB",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "PERSON"
    ]
}