{
    "id": "3KTyQjXG6d4",
    "title": "Synology DS916+ NAS Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-02-21T16:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=3KTyQjXG6d4",
    "category": "Science & Technology",
    "tags": [
        "Synology",
        "DS916+",
        "DiskStation",
        "DSM",
        "NAS",
        "network-attached storage",
        "RAID",
        "SHR",
        "data",
        "storage",
        "hard drive",
        "network",
        "server",
        "Plex",
        "media",
        "files",
        "backup",
        "cloud",
        "review",
        "This Does Not Compute"
    ],
    "views": 30105,
    "likes": 679,
    "comments_count": 36,
    "description": "Let's take a look at the DS916+ network-attached storage unit from Synology -- a personal server that can do way more than just keep your files safe.  Synology DS916+ product page:   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Epidemic Sound ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.synology.com/en-us/products/DS916+",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.epidemicsound.com).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? As more aspects of our lives go digital, we're increasingly relying on hard drives to store it all. This time, let's take a look at a product that connects to your network and promises to keep your files safe and sound, while also doing much more. [ Music - Intro ] This is the Synology DS916+, which the company kindly sent me to review. It's what's known as a NAS, or Network Attached Storage. It features four hot-swap bays for hard drives, with a pair of quiet fans to keep 'em cool. Around back, there are two gigabit Ethernet ports and they can be set up for redundancy or load balancing. There's also a couple of USB 3.0 ports for external hard drives or a Wi-Fi adapter, along with another one on the front. Finally, there's an eSATA port for hooking up an external drive enclosure, should you want to expand your storage beyond the four internal bays. Overall, the unit is solidly built and very compact. Internally, the 916+ is powered by an Intel Pentium processor, specifically the N3710, which is a quad-core part at 1.6 gigahertz and can turbo boost up to 2.5. The unit can also be had with your choice of two or eight gigabytes of RAM. With data storage being an important focus for the 916+, you have a lot of options. For starters, the NAS is typically sold without hard drives, so you're free to pick which kind and how many are right for you. Synology has an extensive list of compatible drives on its website to help with that decision. Next, the unit offers a number of options for setting up drive redundancy, like typical RAID levels such as 1, 5, 6, and 10, and also Synology Hybrid RAID, or SHR. This keeps your data safe in case a drive fails, but still lets you increase storage capacity over time. You can start with a pair of drives and add more later on or swap 'em out one at a time for larger ones. In either case, the 916+ will move your data around as necessary in the background so you can keep using it while taking advantage of the extra capacity. Finally, you have a choice for the file system on these drives. Either the common Linux ext4, or btrfs, which is much newer and offers a lot of advanced features. Suffice to say, exploring btrfs in-depth is probably saved for another time, but the key thing to understand is that it's excellent at protecting data by automatically finding and repairing file corruption. Synology's NAS products run an operating system known as DiskStation Manager, or DSM. It's very feature-rich, yet intuitive and easy to use. Everything can be configured through a web browser. The most obvious feature is file sharing. It supports any combination of Windows, Mac, and Linux clients, along with multiple network shares, user permissions, and quotas. It can also store backup copies of data from other computers, and supports acting as a target for Apple's Time Machine software. The 916+ can also function as a robust media server. It supports multiple platforms, like iTunes, DLNA, and Plex, and because of its Intel processor, it can do hardware-assisted video transcoding at up to 4K resolution. Synology's DS video app supports a number of playback devices, such as Apple TV, Chromecast, and Roku units. There are a ton of other apps and services that this NAS offers, *far* too many than can be covered here. But some of the more common ones include acting as a FTP, web, or email server, running a BitTorrent client, and handling VPN connections so you can access your network when you're on the go. It can even record footage from network security cameras and send you an alert if it detects motion. With all the built-in protections the 916+ offers, it's still a good idea to have a backup copy of your data. Thankfully, there's a bunch of options here too. The system can copy data to an external USB hard drive, or to another Synology unit on the network. Or, for off-site backups, it can directly upload data to services like Amazon Cloud Drive, Backblaze, Google Drive, and more. Perhaps it's some of the little things that makes the 916+ so nice to use. It keeps an eye on drive health and can send email alerts as to what it finds. Software updates take only one click to install. You can also connect it to a compatible battery backup, and the unit will shut itself down safely if there's a power outage. And speaking of power, it's quite efficient. Synology says it only consumes 13 watts at idle, or 30 watts when all four drives are in use. Overall, the Synology DS916+ is more than just network storage. It's really a full-featured server. The DSM interface is really simple to use, and it takes very little time to set the unit up or turn on features. The price for the model with 2 gigs of RAM is $550 US, with the 8 gigabyte model going for about $50 more, and both come with a three-year warranty. Some may be wondering if they can build their own server for less money. Probably, but it wouldn't be nearly as intuitive or straightforward to set up or maintain. As the saying goes, \"Time is money.\" and with that in mind, the DS916+ offers solid value. I owe a thank you to Synology for sending out a 916+ for me to review. I'll include a link to it down in the description for you to check out. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Synology",
        "hard drives",
        "drives",
        "drive",
        "time",
        "data",
        "network",
        "Colin",
        "unit",
        "hard",
        "NAS",
        "USB hard drive",
        "Storage",
        "Synology Hybrid RAID",
        "Network Attached Storage",
        "offers",
        "Synology NAS products",
        "external hard drives",
        "Synology NAS",
        "Apple Time Machine"
    ],
    "transcript_entity_values": [
        "USB",
        "Network Attached Storage",
        "Linux ext4",
        "three-year",
        "Chromecast",
        "1.6 gigahertz",
        "2.5",
        "8 gigabyte",
        "1",
        "6",
        "only one",
        "DiskStation",
        "two",
        "Apple",
        "Instagram",
        "up to 4",
        "2",
        "BitTorrent",
        "916",
        "30 watts",
        "Windows, Mac",
        "NAS",
        "iTunes,",
        "5",
        "eSATA",
        "Time Machine",
        "Time",
        "Apple TV",
        "about $50",
        "DLNA",
        "four",
        "RAM",
        "10",
        "Plex",
        "Roku",
        "13 watts",
        "the Synology DS916+",
        "two or eight gigabytes",
        "Ethernet",
        "DSM",
        "Colin",
        "Intel Pentium",
        "Twitter",
        "a ton",
        "SHR",
        "Linux",
        "Synology",
        "Intel",
        "$550 US",
        "Amazon Cloud Drive"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG"
    ]
}