{
    "id": "3KYZ5yEqvY4",
    "title": "Best Hacking Laptop 2023",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-10-09T14:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=3KYZ5yEqvY4",
    "category": "People & Blogs",
    "tags": [
        "kali linux",
        "parrot os",
        "mr robot",
        "parrot os vs kali linux",
        "parrot vs kali",
        "parrot",
        "kali linux vs parrot security os",
        "kali linux vs ubuntu",
        "kali linux vs linux",
        "kali linux vs windows 10",
        "kali linux vs blackarch",
        "parrot os review",
        "hacking",
        "ethical hacking",
        "hackers",
        "nsa",
        "ethical hacker",
        "hacker",
        "hacking tutorial",
        "ceh",
        "oscp",
        "ctf",
        "how to become a hacker",
        "ethical hacking career",
        "learn ethical hacking",
        "cybersecurity",
        "best laptop",
        "best hacking laptop",
        "kali",
        "best laptop 2022"
    ],
    "views": 945610,
    "likes": 26940,
    "comments_count": 1183,
    "description": "Get Proton VPN for free:  or get Proton Mail here:   OTW and I get asked this question all the time: \"What's the best laptop to buy for hacking?\" In this video we answer that question and more.  // Menu // 00:00 - Coming up 00:32 - Intro 00:38 - Sponsored Segment 01:41 - \"The perfect laptop for hacking\" 04:50 - Getting the right CPU 06:52 - The importance of RAM 07:49 - WiFi adapters for WiFi hacking 09:45 - \"Gear doesn't matter\" 12:57 - Virtual Machines for beginners 15:40 - What OS do I need? 16:23 - VM issues with M1 & M2 chips 19:27 - Kali bare-metal and Kali VM 22:10 - Which Linux is better? 23:30 - Dragon OS // New OS for SDR 24:19 - Know your Linux! 25:26 - Don't waste money on the greatest and latest tech 26:34 - Desktop vs Laptop 27:51 - Learn hacking on a phone 29:48 - The Raspberry Pi // Effective learning environment 32:23 - Linux can work on old computers 33:01 - Conclusion  // Videos mentioned // Best hacking laptop (2021 edition) with Neal Bridges:  SDR hacking:  Kali Linux install on Raspberry Pi:  Kali Linux install on Android (rootless):  Kali Linux USB boot:  Kali Linux WSL install:  Kali Linux WSL2 GUI Apps:  Kali Linux Windows install:  Kali Linux macOS:   // Mr Robot Playlist //   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // Occupy The Web social // Twitter:   // OTW Discount // Use the code BOMBAL to get a 20% discount off anything from OTW's website:   // Occupy The Web books // Linux Basics for Hackers:  Getting Started Becoming a Master Hacker:   // Recommended WiFi adapters // Alfa AWUS036NHA:  Alfa AWUS036ACM:  Alfa AWUS036ACH:  or   Others: Alfa AWUS1900:  Alfa Long-Range Dual-Band AC1200:  Alfa AWUS036NEH:  Panda PAU05:  Panda PAU06:  Panda PAU09:  WiFi Nation 802.11ac AC600:  WiFi Nation Atheros AR9271:   // Other books // The Linux Command Line:  How Linux Works:  The Car Hackers Handbook by Craig Smith:  Hacking Connected Cars by Alissa Knight:   kali linux parrot os kali hacker hacking  hack best hacking laptop best laptop for hacking best hacker laptop hacker laptop hacker laptop setup best hacking laptop 2022 best hacking laptop and os best hacking operating system best hacking os vmware virtualbox bare metal hacker cybersecurity nsa nsa hacker nsa hacking ethical hacking ceh oscp ine try hack me hack the box hacking ethical hacker oscp certification ctf for beginners  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #hacking #kalilinux #parrotos",
    "description_links": [
        "https://go.getproton.me/SHWN",
        "https://go.getproton.me/SHWO",
        "https://youtu.be/jsMp65-piIc",
        "https://youtu.be/5LvqU3-iINk",
        "https://youtu.be/PqRVo2niA_8",
        "https://youtu.be/KxOGyuGq0Ts",
        "https://youtu.be/n2olKupv9fY",
        "https://youtu.be/UXyS-xofGNM",
        "https://youtu.be/mp5DdgZP7ns",
        "https://youtu.be/W6_nBr8SbPE",
        "https://youtu.be/fcrSmbUIHuo",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKNYR8uvEXSAzDfKGAPIDB8q",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://twitter.com/three_cube",
        "https://davidbombal.wiki/otw",
        "https://amzn.to/3JlAQXe",
        "https://amzn.to/3qCQbvh",
        "https://amzn.to/3wnyVen",
        "https://amzn.to/3fCL4WT",
        "https://amzn.to/3rLAjny",
        "https://amzn.to/2PxkkMV",
        "https://amzn.to/31E0AtH",
        "https://amzn.to/34UUCEL",
        "https://amzn.to/3sK2iW8",
        "https://amzn.to/3ue23Da",
        "https://amzn.to/3wwqRZ8",
        "https://amzn.to/3wosx6X",
        "https://amzn.to/3cLQddm",
        "https://amzn.to/3u8JUqm",
        "https://amzn.to/3ihGP3j",
        "https://amzn.to/3qeCHoY",
        "https://amzn.to/3pBESSM",
        "https://amzn.to/3dDUZN8"
    ],
    "transcript": "- Without having been said, a lot of people think that they need the latest and greatest laptop that's out there to be a hacker. - I think what's so great about the world today? There's so much free stuff out there, or low cost stuff. The barriers to entry are lowered. - What's the perfect hack laptop to use for hacking. You know, you and I get this question all the time and so let's, let's try to address this and in that way people can get a better idea of what they should be purchasing to start their career in cyber security. (upbeat music) - When I read stuff like this, it makes me really worry. The UK is secretly testing a controversial web snooping tool. Congress just voted to let internet providers sell your browsing history. VPN providers flee India. They are pulling their physical servers from the country as a mandate to collect customer data goes into effect. There is massive surveillance in Australia. It makes me really worry about the level of snooping and data collection that governments are implementing. If you worried about privacy, you probably want to get a VPN, based on books that I've read such as this, How to Hack Like a Ghost, written by a hacker or Extreme Privacy written by a privacy advocate. Based on the interviews that I've had with hackers, with privacy experts, with OSINT experts and the like, I have come to the conclusion that the VPN provider that I can recommend is ProtonVPN. This is a VPN provider that I actually use. It's based in Switzerland. I think that's a great thing. Their software is open source. If you wanna enhance your security, I would recommend ProtonVPN and I really want to thank them for sponsoring this video. Hey everyone. David Bombal back with Occupy the Web, Welcome, Occupy the Web. - Thanks David. It's always good to be back on your show and talking to you about hacking and IT issues. - It's great to have you back. Just for everyone who hasn't watched our previous videos, we've done quite a few, I've put a playlist below, Occupy the Web is the author of this book, Fantastic book if you wanna learn Linux from a hackers perspective, he's also got this book Getting Started, Becoming a Master Hacker, both fantastic books. Go have a look at the reviews on Amazon. You'll see that people really like the books. So Occupy the Web. What are we gonna be talking about today? We're not gonna be continuing a Mr. Robot series in this video. What are we gonna be talking about today? - Well we're gonna try to answer a question that both you and I get very, very often, which is what's the perfect hack laptop to use for hacking? You know, you and I get this question all the time and so let's, let's try to address this and, and that way people can get a better idea of what they should be purchasing to start their career in cyber security. - Now, Occupy the Web, I've got a whole bunch of questions here, but before we get into sort of my list of questions, do you want to like start the conversation? - Yeah, I've got a few comments that I want people to keep in mind in terms of trying to buy a laptop for cybersecurity hacking, and the first comment I wanna make is that hacking is 80% the human and 20% the machine, right? So don't focus so much on the machine as much as the skill knowledge that is required to be a good hacker. With that, having been said, a lot of people think that they need the latest and greatest laptop that's out there to be a hacker. It's not like a gamer machine. Gamer machines are very demanding and they need to be the latest and greatest and have the best graphics cards and the most memory and what have you as hackers. We don't require that. Our applications are generally relatively small and simple, and so you don't need the latest and greatest machine. What I would tell people as a starting point is that if you can't afford the newest and best machine, go out and buy yourself, you know, a five year old machine. That's if you can buy for half price and get started. It's more important to get started than it is to wait for the perfect machine because really what you need to do is to develop your knowledge and skills, right? That's 80% and only 20% is the machine. A older system that will cost you maybe a third of what a brand new system will cost you will build your skill set and do almost as well as a brand new state of the art machine. Remember once again, you know, we're running Linux and Linux is relatively lightweight and the scripts that we're running and the tools that we're using are not demanding. So let's try to get away from the idea that I need to go out and spend an exorbitant amount of money for a biggest in best machine, right? What you need is a machine that's more important in developing your skills. So let's focus on that. Now, having said that, let's talk a little bit about what you need in that machine. So the CPU, the brain of the machine, the intel, the AMD, is really not that critical for hacking, it's important, you know, it does, this does what it has to do. We're running your machine, but the speed of it is not that important, the faster those CPUs are, the more expensive they are and it's an exponential curve, you know, the faster, So just to get a little bit more speed, you have to pay twice as much, right? But you can easily use a system that's just a few years old and not quite as fast and a lot cheaper and get just as much performance. And the CPU is really not that critical to most hacking applications except password cracking CPUs are not ideal for password cracking, right? You're, you're much better off using say a GPU or using a GPU farm or using a cloud server unless there's a really small, simple password. So, you know, even though the CPU is used for password cracking, say cracking wifi passwords or, or going ahead and trying to crack some hashes that you've gotten from another system, if it's a complex password at all, your CPU is just not an efficient way of doing it. So investing a lot of money in a CPU, okay? The fastest and best CPU is not a good investment. It's not a good investment. A better investment is to take that money and use it to buy a GPU or rent a GPU or rent a cloud service that can really crank out hashes really, really fast. I seldom, if ever use my CPU to crack passwords. And I also should point out that my go to machine for penetration testing and hacking is probably four or five years old, it's not brand new, it's been around a while. I like it. I use it every day. And so that kind of, I wanted to reemphasize that point that you don't need the latest and greatest, okay? What you need, you need is a system. You need a good system. If I could emphasize a few aspects of that machine, it would be that I would emphasize RAM because you need to oftentimes run multiple processes, multiple applications simultaneously. And I sometimes I'm running multiple VM and so the more RAM I have, the less problems I'm going to have. Things are gonna run smoother. Now, how much is enough RAM? Well, you know, a bigger minimum is probably gonna be four gigs, right? I run 32 gigs, okay? And so four gigs, I think is a bare minimum, 32,64, you know, if you're a pro, but that's expensive, right? That's expensive. So if you're gonna put your money someplace, I would put it into RAM. Then of course you're gonna need, if you want have any idea of doing some wifi hacking, which lots of people like to do. I mean, that's a real, one of the most popular activities of newcomers to hacking is to hack the wifi, right? Well, you're gonna need to invest a little bit of money into a good wifi adapter. And you know, there's a, almost all of the wifi cracking tools at their heart are using aircrack. Yeah, we have lots of different tools, but they're all using largely aircrack at their heart. And aircrack has what's called a compatibility list on their website. If you go to aircrack ng.com, you go to their compatibility list, but they list the compatible adapters by chip set. And most people don't know the chip set that's in their wifi adapter. So if you don't know that tried and true is go with an alpha. - Do you have a special, a specific one that you like? - Well, I mean, I've got several that I have, and once again, password cracking is, is not one of those that is a function of speed. The important part for password cracking is getting the hash, and that's not a function of speed. You could be using an old adapter and it'll work just as fast as a brand new adapter because it has nothing to do with the speed of transmission, right? Very little there actually does make a small amount of difference, right? I would say go out and, you know, if you're on a budget, buy a used one, you can buy 'em on eBay. Other places don't, don't go out and buy the latest and greatest. I have several of the latest and greatest, and quite frankly, they don't work that much better than my old ones that I've had for 10 years. If you're on a budget, go to eBay or other place where you can buy used equipment and look for an old alpha and that'll do the job for you. And I've got some even cheaper ones that I have purchased over the years and tested 'em out and, and they work out pretty well. - I'm glad you said this because, sorry, I just wanted to say this before we continue. I really, I'm really glad that you emphasize this because you see it in any domain just being on YouTube, you can see it with YouTubers who spend fortunes on equipment and then you get someone who's a really great YouTuber and all they have is a phone or an old camera. The tool doesn't make you better. It - Exactly. - It's the person who determines the quality or the, you know, the output, not just the tool. So I'm really glad that you emphasized that, sorry, I didn't wanna interrupt you. - Hacking's 80% the person, 20% the machine. So let's focus on the person and not the machine. And the other question I get a lot also is that, well, if I'm gonna be a hacker, I've gotta go out and buy all those toys, you know, I mean, I've got, I've gotta have all those toys I see in the YouTube videos, you know, like, no, you don't need all those toys, right? You can do a really good job and be very proficient without all those toys, and I refer to 'em as toys, I mean the wifi, pineapple and airgeddon. - Like rubber ducky, that kind of stuff. - Rubber Ducky. That's what I was thinking of. Thank you. - Yeah, - Yeah. You don't need all those things. I mean, if you're just starting out, right, you don't need those things and you can do almost all of those things that you can accomplish the same thing without those toys, but it's a little bit more time consuming, maybe a little harder, but you'll, you'll have learned a lot by going ahead and trying to do the same thing without all the toys. And certainly, I mean, I had a young person come to me the other day and say, you know, I've got a good laptop, but I can't afford to buy all the rubber ducky and the wifi pineapple and you don't need those things. But they have been left with this impression that they can't be a hacker without those things. Those things are nice and Hack five makes 'em, and, you know, and I've done a number of tutorials and, and classes on SDR. And SDR is a lot of fun and it's very important area of hacking, but one, most of what we do, or just to get started, you can start with a very inexpensive RTL SDR which costs like $30 or you can buy 'em used for even less than that, you know, once you get proficient, then you can go and move up to the hack RF or some of the other more expensive SDR devices. But really what I am want to emphasize here is that it's more important to invest in yourself in developing the skills and the knowledge than it is in the hardware. The hardware is is only an extension of the hacker behind them, so get yourself a machine, get started and start developing your skills. And don't worry. So much about the hardware that's involved, although there are some essentials, right? I mean we do need, you do need a laptop, you do need a wifi compatible adapter, an aircrack compatible adapter. If you're gonna crack the wifi, you do need a enough RAM maybe to run some virtual machines to get started, okay? You don't even need that. But to get started, you wanna be hacking in a safe environment. And virtual machines are a good, safe environment for you to hone your skills. And the more RAM you have, the, the more virtual machines you can run. - That gets to one of my questions is, and I'm sorry to if you were going for it, but it's bare metal versus virtual machines and you kind of mentioned virtual machines, so I'm assuming for a beginner you would recommend, correct me if I'm wrong, like a virtual machine is the way to start, right? - Yeah, I think the best way for a beginner to start is through virtual machines. That way, you know, you're, you're self enclosed. You don't have to be dependent upon the, you know, a website, what have you. You've got your, you got a target, okay? You've got your attack machine, everything's internally enclosed. You don't have to worry about having an internet connection and you can practice all your skills all day long as much as you want, okay? Even with the internet down on your virtual machine. So that's the way to start. Now that's maybe not the way that is, is the best way once you become a professional. But once you're starting out, those virtual machines are really the way to go. - So you start like a Kali Linux or something and a virtual machine and then like a device that you're gonna attack. You build your own little like network on your Windows laptop or something. And that's how you practice initially, right? - Yeah, exactly. So with either a virtual box or VMware's workstation, and I have both of 'em, I use both of 'em. I prefer VMware's workstation. I think it's a little bit more stable. It doesn't crap out as much. It's networking is easier to work with and more stable, but it is more expensive. I mean, once again, if we're thinking about trying to build this on a budget, virtual box is free and it works pretty darn good. Okay? I've been using it for years and it's gotten a lot better, right? It's gotten a lot, used to be much quirkier than it is now, but it works pretty darn good. So if you're on a budget, go free virtual box and then Kali of course is free. And then you can go ahead and download any number of virtual targets that you can work with. You know, if you even have an extra copy of Windows, you can build yourself a virtual windows and, and try attacking your Windows 10 or Windows seven or Windows 11 system in a virtual environment where you don't have to worry about any possibilities of breaking any laws or sending malicious packets over the web that might, you know, might in different countries is going to be illegal. Keep it enclosed, keep it self contained. And I think that's a really good environment to start practicing and developing those skills. And you can do that with a relatively inexpensive system. - So I'm gonna put you on the spot. Just push back. I'm gonna ask, I've got, Yeah, I'm gonna ask all the questions. I like to say that people are either too ashamed to ask or too scared to ask or too embarrassed to ask or whatever, but I get a lot of these questions, I'm sure you get them as well. So do I need a Windows laptop? Linux laptop or Mac or doesn't it matter? - Well, if you're running virtual machines, it doesn't really matter. So if you're running virtual machines, your host system, okay, the, the physical system that you're running on doesn't matter if it's a Mac, if it's a Windows or Linux system, because you're all gonna have these, these virtual machines inside of that operating system. So I would say doesn't matter. - I will say this just, I'm sure this will be, will be commented below with the M ones and M twos, it gets a lot more complicated. I dunno if you've used them, but I have them and it becomes a nightmare. So I would personally say rather get an Intel or something else because there's issues running VMs on a M one, M two at the moment. Cause you have to use on, you can't use like all the Intel X 86 stuff on, on M ones, M twos. - I didn't know that, I don't run Mac. So that's why. - Yeah, so I'm actually, I've got. - A lot of my students do and they've never expressed to me any problems, but I don't run Mac at all, so I run Windows and I run Linux. So. - Yeah, so you run Linux natively, I'm assuming that's when you're doing a attack, like proper stuff and then you run Windows for like demos and like teaching stuff, right? - Yeah, exactly. Yep. - Yeah, that's great. I mean I'll, sorry, go on. - Well thanks for putting that out there. I didn't know that there was a problem with the M ones and M twos. - In my experience. And this is just my opinion. So, you know, please comment below anyone who's, who's found it otherwise, but the only way that you can get it to work kind of is like you can use something called UTM which is like a free QU emulator if you wanna run X 86 on Mac one M twos, if you use a VMware Fusion, which is like virtual, sorry, which is like VMware workstation player or pro, you need to use Intel and Parallels allows you to virtualize as well, but you stuck with arm so you can't use Intel. Sorry, you can't use X 86 or 64, X 64 on M one, M two very easily. You have to emulate that and it's doesn't work very well. So yeah, my recommendation would be, I don't think M ones M twos are there yet. So I would avoid a Mac if you want to do a lot of VM stuff. 'Cause a lot of the VMs that you can download from, you know, different places you're gonna be wanting to run X 86 or oh 64, sorry, go on. - Yes. So that new M one, M two is the one that Apple has built based upon the arm architecture? - That's right, yeah. - Yeah. And that makes sense, okay. - Yeah. So you can get Kali, one version of Kali, but a lot of people have said that either, even though you can get it to run and it runs fine, some of the apps still don't work as well because some of the apps weren't written originally for Arm. - My recommendation if we get that part is that one, as a pen tester, hackers, you don't run Apple. But that's a different story versus creating a, a testing environment. - [David] Like a lab, right? - I would, I strongly recommend because the Apple operating system is, is proprietary, okay. And it's opaque. There are certain applications that require access to the operating system that simply don't work well in an Apple environment. - Some people will say the same about Windows, right? - Oh, I would definitely say that about Windows. - So in other words, what you're saying is you're gonna go bare metal for Linux? Yeah, for like real deployments and stuff, right? - If you wanna make sure that all of your Kali applications work as they should, it should either be Linux bare metal or Linux in a virtual machine. But you can't run, I don't think you can run all, I know you can't run all the applications in an Apple or a Windows environment and have them work. And the last thing you want as a hacker is to not understand why something doesn't work. And it might just be your operating system. So you know, you're going through and things aren't working, things aren't working and you're trying to diagnose why they're not working. You don't want to add the complexity that it's, the operating system won't let you do that. I strongly recommend using any other operating system other than Linux. Okay. For hacking and pen testing. Although I have seen people running Mac's in pen testing environments and I always scratch my head when I see that it's like, you know, that's, I don't recommend it. I've never seen a Windows, I never seen Windows in a pen testing environment. I have seen Mac's and I don't recommend either one of 'em. It has to be a Linux environment if you want to make certain that your application are gonna work as they're designed. - So give me, just summarize, if I understand correctly, you would run Linux in a VM for, for labs and Linux bare metal for real deployment, right? Or would you. - Yes, that's my recommendation. Yeah, that's my recommendation is that you run Kali, and different versions of Kali. It doesn't matter, which in my opinion, doesn't matter which one you use, there's gonna be different strengths and weaknesses that are different versions of Kali, you know, the, the latest Kali isn't necessarily the best Kali, right? Some of the older Kallies have features that work even better than the new Kallies do, right? And you can go all the way back to the old backtracks and they had features that in some cases work better than the new Kallies. But yeah, for a pen testing environment hacking, run it bare metal for training purposes, you can run Kali in a virtual machine and hone your skills there before you go out into the real world. - I like what you said though, you know, if you've, I think if you've got a Mac ready for whatever reason, then you can build a lab and it works. I find it works fine on Intel even though I have had issues sometimes with networking with VMware on Mac Intel. - We all have problems with, with networking no matter what the platform is, right? - Yeah. And then, but I really like the suggestion, you know, you can start. So if you've got a, if you've got a Mac or if you've got a Windows, then you can start if you haven't got a laptop. I love what you said about like just buy something. It's not the hardware that's important, it's you as a person. But let's address some of the questions 'cuz I know, we'll I'll get this all the time and you know, we are older so I mean I'm not so into the flaming war type stuff. It's like Carly Parrot versus some other flavor of Linux. 'Cuz some people are really adamant that you have to use a certain flavor of Linux to be a hacker. - I would not agree with that. I would say that either, either one of 'em are excellent tools. Okay. And they have different strengths. I'm not a flamer, either one of those. - Yeah, exactly. - And I would say, you know, choose one or both, you know, I have both of them and I find that, you know, sometimes I'm using Parrot and sometimes I'm using Kali in my classes, I always use Kali just to be consistent. But yeah, the people who are, you know, screaming at each other over which ones a better platform don't have, have too much time on their hands and not enough things, other things to worry about. - Yeah, it's exact right. I mean I often say use the tool that's right for you 'cuz people have different tastes, so you use what works. So I'm glad you you've addressed that. So you use both, You use, I've seen you use Kali in all your demos and that's just to be consistent. It's not because it's better, right? - I wouldn't say it's better. I'd say it's just to be consistent. And I do use, I'm gonna put a plug in for Dragon OS, which is a, a new operating system for doing SDR, which is really, really good. I think it's the best operating system for running SDR for hacking and excellent tool. I can't remember, remember the fellow's name who put it together, but he's done an excellent job. You got all the tools in one place and they all work well rather than having to constantly download and, and find the dependencies. So it's Dragon OS and great operating system. So I use that after having gone through a number using Kali for SDR and using Parrot for SDR and a number of other specifically designed operating systems for SDR. I've settled on Dragon OS, so. - No, that's great. I mean we covered that actually in another video, so I'll put that below where we, where we did some SDR stuff and you showed Dragon, so that was great. Now I think the, the moral of the story is if you know Linux you can jump from one to the other, right? - Exactly, I mean, they're all Linux. I mean, both Parrot and and Kali are both Debbie and Linux, right? So if you know Linux and another plug for knowing Linux, right? If you know Linux, yep. If you know Linux, this, you know, it's, it's kind of a foundational skill, you know, and you can take it, you can take it to a Ubuntu you can take it to Red Hat, you can take it to any of those operating systems, but you gotta know Linux first. And you know, there's so much, you know, one of the hottest areas of hacking right now is IOT hacking, hacking the internet of things, which simply means all the devices that are now digitally connected in the world, including refrigerators and baby monitors and garage door openers and what have you. But all of those devices have small Linux kernels in them. They're all being run on Linux. And so if you wanna be able to hack those things, which is kind of the leading edge of hacking, then you need to know your Linux, right? Because when you get inside, you're gonna find Linux. - So let's summarize RAM minimum of four gig. But I like what you said, don't spend lots of money trying to get the best CPU, rather save money and use that to buy more RAM. - I would agree. Yeah. In other words, you know, don't go out and spend all your money on the latest CPU because that's not that important. Take that money and put it towards RAM on the system. - You don't need a GPU in your laptop. It doesn't need to be some fancy gaming laptop because you're gonna use the cloud or some other device to do the cracking using the GPU anyway, right? - I would say so, I mean, you know, a GPU's are much faster at password cracking, hash cracking, but even at that, unless you have a really high end GPU it's not going, it's not ideal to crack passwords on your own GPU, right? There's lots of better ways to be able to do it. And one of 'em is simply to go out and send it out to the cloud and have a massive machine be able to crack those hashes, which can do it much faster than you can. - And I mean, it's so cheap these days to, to rent the GPUs anyway. So you might as well use the cloud. Another question, desktop or laptop? If I had to choose. - Well, if I'm moving into a pen testing as a professional environment, I usually want to have everything on my own machine. I wanna be able to bring it with me, right? So that pretty much argues for a laptop and that's what I do, I mean, when I go into a pen testing environment, I bring my laptop, everything's there and ready to go. I can't imagine hauling around a desktop, but for a training environment, you know, desktop is great. That having been said, I know people do hacking pen testing on phones, but in all honesty, I don't know how, I mean, I, I understand that some people, that's their, you know, that's a limit to what they can spend, but it's pretty darn hard to really do much. Hacking on a phone one is not powerful enough and it is pretty hard to run multiple applications on the phone simultaneously. But if it's all you have and it's a way for you to learn, then great, you know, go for the phone. But if you can afford to get a used laptop, take that one step up and get a used laptop, I think you're gonna be much more effective in a used laptop than a trying to hack from a phone. - I'm glad you said that because I think depending, you know, who's watching this, but I think a lot of the audience in certain parts of the world, they don't necessarily have the money for a, for a laptop, but they might have a phone with them. So I've had this question recently, can I start learning Linux? Can I start learning hacking if I don't have a laptop? Can I use a phone or the cloud? What can I do? I mean, you've kind of alluded to the fact that I can do some stuff with a phone, but it's limited, right? - Yes. I would say that, you know, if you're at that point where you're just learning the basics, I think of phone is a good, is if it's all the option that you have, you know, use the phone. But you know, I know that in some parts of the world, phones are the only option. And so I'm saying yeah, those Android devices, okay, and even the the Apple, but unlikely, it's unlikely to be an Apple in those countries. Android is a version of Linux, right? So you can do all your Linux stuff on your phone, you can learn Linux on your phone. Can you actually do your hacking? Well the answer is yes, but it's not very practical. If that's all you have, go for it. Right? If that's all you have, I'm not gonna say you can't do it. I'm saying it's not really practical, but I know that, you know, some people, you know, you can buy phones for 20, 30, $40 and that's what people are using. And if that's all you have, let anybody tell you you can't do it. But it's just gonna be harder. - Funny, when you're talking about that. Yeah, I've got a pine phone and I'll link a video below, I'll show you how to crack a wifi password using a pine phone. Pine phone basically runs Linux. But yeah, I agree with you. it's kind of hard. It's nice but it's, it's lost resort I would say. And I agree with you, you can, you can root a Android and, but it's, yeah, laptop's just so much more powerful. - Even the smallest, cheapest one is gonna be much more effective than a phone. So. - What about a raspberry pi? Sorry, if you wanted say one first. - No, I like the raspberry pi. Raspberry PI is, is an effective tool I think that you can run, you can run Kali on it or you can just run the PI operating system and download the tools onto it. I find it to be a good, a good and effective hacking environment. So I would recommend that as long as of course you have a television set right to act as a monitor, right? And you, you know, you can get, even if you're talking about old pi's, you know, you can buy old pi's for 20 and 30 bucks, you know, the new ones are more expensive, but the old pi's will do the job and it's a good learning environment and I think it's, it can actually be used as an effective hacking environment. It's just maybe not as portable as you would like. - I think what's nice about the newest pi's is the wifi card supports monitoring and injection mode. So I'll put a video below where I'll show you how to do that with a pi. - Okay? - It's nice that you don't have to buy an external adapter, but it's slow. It's a small little computer. It's a, you know, if it's all you got, it's great, but it's slow compared to a laptop run. - Yeah. But if you, you know, it's costs a, a fraction of what a laptop costs. So I've been there, I know what that's like to have, you know, that's all that you can afford. - Yeah. - And you know, so I'm not saying that you've gotta go out and have, you know, spend thousands of dollars on a laptop, you know, if you can put together 50 bucks, right? You can go out and get yourself a PI and connect it to your TV set and, you know, start learning what you need to know in terms of Linux and Kali and get yourself and hone your skills until you know you can go out and spend more money on something better. - I think what's so great about the world today, there's so much free stuff out there or low cost stuff. The barriers to entry of are lowered and there's so many options when it comes to devices like the pi, stuff like that. And I mean, like you said, like don't try and buy the latest gaming rig or laptop. There's a lot of older laptops that you get on eBay and places that can get you started. - Right, I agree. And you know, if I were to have to choose between a PI and a phone, I would choose the pi. The PI is a, is a more effective device than trying to hack from a phone. And you can get them for approximately the same price. You know, maybe just a little bit more for the PI than the phone. But still it's, you are gonna be much happier working with a PI than you are with trying to hack with a phone. I would find hacking with a phone to be very, very frustrating. - And I think, I mean, we need to make a point. Again, Linux can run on really old machines, like crazy old machines. So I mean if the goal is to learn Linux and learn the tools, then there's nothing stopping you, like you said, getting an older laptop if that's all you can get and install Linux on it and you know, start learning. - Exactly. You know, there's Linux is much more forgiving than Windows or Mac is and it can run really well on older systems. So don't let the hardware become a barrier to get started in hacking penetration testing. Go out and get yourself a cheap used laptop and get started. - That's great, Occupy the web. Are there any closing thoughts or anything else you wanna add before you wrap up? - No, I just wanna repeat that, you know, in hacking 80% is the human, 20% is the machine, don't allow, you know, anybody to tell you that you need the latest and greatest machine to become an effective hacker. You can be an effective and great hacker with an old machine, with, you know, one of the older CPUs. Put Kali on it and away you go and you can do anything, almost everything and anything that even the, the latest and greatest machines can do for a fraction of the cost. - Love it, thanks so much for sharing. - Thanks David. (upbeat music)",
    "transcript_keywords": [
        "Linux",
        "machine",
        "Yeah",
        "Kali",
        "run",
        "virtual machines",
        "hacking",
        "Windows",
        "laptop",
        "run Linux",
        "system",
        "virtual",
        "phone",
        "machines",
        "people",
        "Mac",
        "Occupy the Web",
        "lot",
        "run Kali",
        "buy"
    ],
    "transcript_entity_values": [
        "YouTube",
        "these days",
        "Australia",
        "30",
        "Linux",
        "airgeddon",
        "Kallies",
        "Debbie",
        "32",
        "Apple",
        "Congress",
        "four",
        "two",
        "Red Hat",
        "40",
        "OSINT",
        "a VMware Fusion",
        "PI",
        "Linux",
        "five year old",
        "80%",
        "Intel",
        "UTM",
        "Raspberry PI",
        "David Bombal",
        "Mac Intel",
        "Windows",
        "Extreme Privacy",
        "Parrot",
        "Android",
        "Getting Started, Becoming a Master Hacker",
        "the years",
        "India",
        "64",
        "Dragon",
        "10 years",
        "today",
        "Mac one M",
        "one",
        "20, 30",
        "RAM",
        "a third",
        "Windows",
        "YouTube",
        "a Kali Linux",
        "four or five years old",
        "20 and 30 bucks",
        "first",
        "UK",
        "Carly Parrot",
        "Mac",
        "VPN",
        "Amazon",
        "years",
        "AMD",
        "Windows",
        "thousands of dollars",
        "David",
        "Linux",
        "Switzerland",
        "SDR",
        "VMware",
        "32,64",
        "Windows 10",
        "Dragon OS",
        "20%",
        "50 bucks",
        "VM",
        "86",
        "RTL",
        "half",
        "seven",
        "YouTubers",
        "five",
        "intel",
        "CPU",
        "Kali",
        "Mac",
        "Robot",
        "GPU",
        "IOT",
        "only 20%",
        "eBay",
        "Occupy the Web, Welcome",
        "Windows 11",
        "VPN",
        "VMs"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "GPE",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "ORDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "NORP",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT"
    ]
}