{
    "id": "3l1p98oeYfA",
    "title": "PlayStation VR2 Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-02-10T13:01:31Z",
    "video_url": "https://www.youtube.com/watch?v=3l1p98oeYfA",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 98542,
    "likes": 4034,
    "comments_count": 271,
    "description": "Thanks to Sony for sending me this PSVR2 to review!   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today, we're unboxing the brand new PlayStation VR2. I am so hyped about this. I remember unboxing the first PlayStation VR, which was back in 2016, which feels like in tech time is pretty much an eternity. So today, we are here with the new PlayStation VR2. This is purely just an unboxing, so I'm not gonna be able to post my review until later. I also have a charging dock here, which is pretty cool. This is the VR2 Sense charging dock for the controllers. One of the biggest upgrades though is, of course, with VR is obviously having a better display. So this is a 4K OLED display, and you'll have 110 degree field of view. So obviously as VR tech progresses, it's gonna be such a more comfortable viewing experience for consumers. You might have to stand up... Oh no, I ripped the box. I was gonna try to do this and not rip it. Oh, okay. I didn't realize that the top just folded open like that. Open like that. So I just dumped everything. Anyway, now that we conveniently have everything out of the box, so here is the headset. Can I actually pick it up? I mean, it feels pretty light considering. Like this cable actually feels almost as heavy as the headset, which is kind of wild. So we've got this nice little headband here, which does have a very squishy feel, which is good for... Actually it's, oh, it's squishy all the way around. That's really nice, 'cause that's kind of where it's gonna be resting on your head. And that's the thing that makes it really difficult when you spend a lot of time inside of VR, you want a headset that's gonna be very comfortable. I also like that these eyes are also adjustable, so you'll be able to adjust the eye placement where you need your eyeballs. You can just use this little scroll. Oh, it's got this nice little crank here on the back to make it tighter or looser, and you can just press it to give you more space. Super cool. I hate putting this on with makeup on, but well, we're doing it. Oh, I love that crank. That's awesome. It's kind of like when you put on helmet, I know some biking helmets have a little crank on the back, which allow you to kinda just get a nice snug fit. And so far, this actually feels really good. It feels like it has a very even distribution around my head, which is very nice. I also like that there's not a lot of pull facing forward, so because this is kind of sitting a little bit lower right here, which is really cool, that's giving it kind of that equal distribution. So it's gonna be awesome when I can actually turn this on and plug it in. But this is purely the unboxing, so I can't do that yet. And this probably has makeup all over it. So another thing that I like is, that this kind of has this little space right here, so that's gonna give you some nice air flow. So I'm not gonna feel super suffocated. And it also doesn't really rest on your nose, because I've definitely tried some other headsets before where it's a very uncomfortable feeling because they're really relying on your nose bridge being kind of like an anchor for the device. And that is a no way no in my book. I mean, it might be for like the first five minutes and then you're like, \"Oh, there's a lot of pressure, not great.\" So I do feel like this had very nice equal distribution. Another thing that's kind of cool about this is it does have 3D audio, so it's gonna give you a much more immersive experience and it has eye tracking. That is something that until you really spend time in VR, that's something that's gonna kind of give you that more realistic experience because in real life, you're not gonna be moving your head every single time you wanna look at something. You're just gonna move your eyes, and with that, it's gonna feel way more natural. And that's the whole thing with VR is you want it to feel real. Another thing that's really great about the new PS VR2 is it really only has this one connector, whereas the other one before, you had to have this separate little processor unit. Once you used it like you got used to it. But now having way less hardware, like everything is already built in, you have one single cable. The original PlayStation VR also relied heavily on external cameras, whereas this has pretty much everything built in. This has four cameras plus that motor, which is gonna be giving you that eye tracking movement. Not only the eye tracking, but having that eye tracking work together with the head tracking, it's gonna be so cool. Let's check out the controllers, shall we? They have adaptive triggers, they have haptic feedback. They also have finger touch detection and tracking rings. So this is gonna really give you a much more accurate representation of your hands in space. And that is something that also is so disoriented when you're in VR. You're like, \"My hands aren't quite matching up with what I'm doing, so I can't wait to actually see how this all really plays out. Like is it gonna feel normal? Is it gonna feel more like my hands are attached to my virtual body?\" And having that haptic feedback is way more important than I think you would think if you've never tried this before. Because if you go to touch something in real life, you'll actually feel a sensation of that thing in your hand. So with this, while you might not be able to feel the item in your hand, you kind of virtually will be able to with that fake haptic feedback touch. So that's definitely something that I think is gonna really make a big difference. Of course, it has the straps right here that you can attach to your wrist so that you don't drop them because that's also something that is problematic, 'cause if you drop one of your controllers, like, \"Where did it go?\" This has a see-through view, so you can actually see what's going on around you without having to take the headset off. And that's pretty nice. I mean, maybe sometimes you should take the headset off to have a little break if you will. But it is really nice that you don't have to actually take the headset off to be able to see. So now let's check out the PlayStation VR2 Sense controller charging station. This is nice. I can't wait to get this all set up and get a chance to really try it out. You just put these little inserts into the controller and that allows you to dock it. How neat. Power adapter. What else is in here? I didn't open this from before. Oh, we've got the headphones and another USB-C cable. These are very, very tiny little adapters. Check those out. So small. Look at them so little. Here we go. And then these just rest right in there. Just like that. That's cool. That's so nice. Let's take a look at the headphones. Well, like I said, these do give you that 3D audio, which is gonna be so fun. Extra earbuds. So here's everything that comes in the box. I look forward to actually getting a chance to power this on and try it out. But again, this is just the unboxing so you guys can see what it looks like and I can tell you what it feels like. I'm definitely hyped to play some games. I'm really excited to play the new Resident Evil Game VR. That's gonna be really fun. I remember playing like a Resident Evil game super, super early at E3 years and years ago. Like this might have been even one my first E3's that I'd ever been to. And just getting a chance to really play that game and now actually play it many, many years later on this upgraded hardware is gonna be... I mean, it's gonna be night and day. So I can't wait to test it out. Thank you guys for watching. If you haven't already, please subscribe and hit the bell. Be notified when I post new videos, and leave me some comments below and let me know what you guys think of a PlayStation VR. Have you ordered one? Do you want one? What do you guys think of VR in general? I would love to hear it. So I'll see you guys there and in my next video. Bye. (upbeat music)",
    "transcript_keywords": [
        "kind",
        "nice",
        "feel",
        "feels",
        "Justine",
        "unboxing",
        "headset",
        "PlayStation",
        "give",
        "eye tracking",
        "thing",
        "cool",
        "tracking",
        "guys",
        "eye",
        "pretty",
        "Resident Evil Game",
        "time",
        "play",
        "head"
    ],
    "transcript_entity_values": [
        "E3 years and years ago",
        "VR",
        "one",
        "2016",
        "E3",
        "USB-C",
        "PlayStation VR",
        "PlayStation VR2 Sense",
        "Justine",
        "4",
        "PlayStation VR2",
        "four",
        "110 degree",
        "many years later",
        "the first five minutes",
        "today",
        "VR",
        "first",
        "PS VR2",
        "VR",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "FAC",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}