{
    "id": "3L2j_pFgEuk",
    "title": "Valve Steam Deck hands-on: $400 Switch-like portable gaming PC",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-08-06T17:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=3L2j_pFgEuk",
    "category": "Science & Technology",
    "tags": [
        "valve steam deck",
        "steam deck",
        "valve steam deck trailer",
        "steam deck specs",
        "valve steam deck pre order",
        "SteamOS",
        "SSD",
        "steam deck price",
        "nintendo switch",
        "nintendo switch oled",
        "new nintendo switch",
        "nintendo switch 2021",
        "valve",
        "valve console",
        "valve switch",
        "handheld gaming PC",
        "PC",
        "gaming",
        "pc gaming",
        "pc gaming setup",
        "gaming pc",
        "pc gaming for beginners",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 768158,
    "likes": 14731,
    "comments_count": 1448,
    "description": "Don't call it a Steam Machine: this is the Steam Deck, a 7-inch handheld gaming PC from gaming software giant Valve. We flew to Valve's HQ in Bellevue, Washington, to spend about an hour with the machine and compare it to Nintendo's Switch and other portable systems.  Read more:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3rXQSys",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(chiming cheerful music) - A funny thing happened a few years back, I started buying my PC games for the Nintento Switch. Nintendo's portable became my primary pick for all but the biggest games because it's the place I would actually finish them. What if there were a PC that I could take with me just as easily on the go? That's why I flew to Bellevue, Washington this week to Valve's headquarters to see the new Steam Deck. The Steam Deck is already sold out through the middle of 2022 and it's not hard to understand why. Valve is promising you can take your entire Steam PC game library with you for roughly the price of an iPad. While it might just look like a thicker Switch with touch pads, there's a lot more going on under the hood. It's got AMD's latest ZEN 2 cores an RDNA 2 graphics cores, the same kind you'd find in the Xbox Series X and PS5, just far fewer of them. In terms of raw oomph, it's slightly less than half as powerful as an Xbox Series S, Microsoft's $300 console which has to deliver 1440p game play to a big screen TV. The Steam Deck, meanwhile, only has to deliver 720p to a seven-inch touch screen, like the Nintendo Switch. How does that translate to actual games? Well, here's the Witcher 3 running on a Nintendo Switch and here it is on a seven-inch Aya Neo, a Windows gaming portable that comes in at about $700. Now here it is on the Steam Deck. Not only does it easily blow the Switch Port away, I'm running the Witcher 3 at medium spec, a whole graphical tier higher than the Aya Neo can manage. Here's Control, another seriously demanding game, again managing medium spec where other portables struggle to run down low. I'd rather max it out if I could, but it doesn't feel like it'd be a gigantic compromise to take games like this on the road. (electronic music) There's no question about it, the Steam Deck is a big one, nearly two inches thick at the grips, it weighs half a pound more than the Nintento Switch, and it's not a thing I'd choose to carry around in my pockets, even though I do wear cargo pants. But it's also bristling with controls that feel like they're in the right places, at least for average-sized hands. With the bulbous Steam controller, I always felt like the grips were digging into the fleshy meat of my palms, but not so much here. I was a little skeptical when I saw the true size of this thing. It's wide and tall enough you can practically fit the entire Nintendo Switch between its grips. But my fingers just kind of sunk into its ready-made grooves and I think I might already prefer its soft, easy triggers and meaty thumb sticks over the tight clicky ones on the Switch. The smooth tops of the joysticks do feel like they take a little getting used to. I had to rely on their gripping edges to avoid slipping off. But that flat surfaces houses a pretty neat trick. When you touch it or the touch pad beneath, you're tripping a capacitive sensor that activates gyroscopic aiming, just tilt to aim. That's a feature I loved on the PlayStation Vita, an original Steam controller, and it only took a tiny bit of DOOM Eternal to convince me I'd love it here, too. It's not to say the hardware isn't without its wrinkles, at least at this early stage. Valve warned us the EV-2 units we're testing aren't final-build quality and it shows. The case had a rough seam and looks like it easily scratches near the charging port. I actually heard something rattling around when I shook one of them. And though Valve has been remarkable open about battery life, promising four hours of Portal 2 on a charge, our unit got a little warm during our roughly hour and a half demo and looked to be nearly empty by the time we were done. I also don't know whether I'd really prefer the etched anti-glare screen that ships with the most expensive configuration of the Deck. It does reduce glare and definitely has a premium silky feel, but like a lot of mad options, it doesn't feel quite as vibrant as the glossy display you get at the 400 and $530 price points, here. Also, we weren't able to take it outdoors to truly put it to the test. Okay, let's talk about the elephant in the room. The Steam Deck runs Linux. It comes with Linux in the box. Technically, it's a version of Steam OS, a new version that'll also bring some of its new UI features to other versions of Steam, as well. But it's Linux under the hood. Linux means it simply won't run every game in your Steam library out of the box. For the majority of games, you'll be relying on a proton compatibility layer that makes your Windows games work. Even then, some of the biggest games like Fortnight, Destiny 2, Apex Legends, and PUBG are a question mark. They rely on anti-cheat software and Valve has said it'll try to get it in Proton ahead of launch, but it hasn't said for sure if it'll work. The good news is the Steam Deck isn't locked to Linux if you want it to be. It's a fully-fledged PC, so if you wanna throw Windows on there, Origin, the Epic Games Store, heck, anything you wanna plug into the USB-C port that would work on a PC, or anything you'd wanna connect to the Bluetooth chip. I've got a set of Bluetooth earbuds and they're gonna work with the Steam Deck, unlike the Nintendo Switch. There's a lot we weren't able to do on our demo like installing our own games, swapping multiple SD cards, or spending quality time creating custom controller configurations to make the most of the Steam Deck's touch pads and rear buttons. I wasn't able to dive through the new Steam OS as much as I'd like or thoroughly test compatibility, though I did notice that Dead Cells, typically a pretty easy game to run, felt a bit jerky. I also ran into some bugs that Valve warned me I would, like the occasional freeze when stopping or starting apps. Apparently, Valve's still deciding whether you should be able to swap between more than one game at a time, and this pre-release build doesn't like it when you try. But after seeing how well Valve built and supported the Steam controller, the Steam link, and the Valve index through their life, it's not hard for me to imagine the wrinkles in these pre-release units getting ironed out. (playful music) Valve believes it'll sell millions of Steam Decks and that it may not be alone, suggesting other PC manufacturers may jump on the portable craze, too. It's willing to share its learnings with other companies. The company told me it's looking to license Steam OS for free to interested PC manufacturers. Me, I think Valve just noticed the Switch was eating into it's Indie game sales, but I like the idea. I bought one, myself. We'll see how it works out. Would you buy a PC gaming portable like this knowing it'll never be quite as powerful as a desktop? Let us know in the comments and thanks for watching.",
    "transcript_keywords": [
        "Steam Deck",
        "Steam",
        "Nintendo Switch",
        "Steam Deck touch",
        "Steam Deck runs",
        "Switch",
        "Deck",
        "Valve",
        "Steam controller",
        "games",
        "entire Nintendo Switch",
        "funny thing happened",
        "game",
        "Deck runs Linux",
        "Nintendo",
        "years back",
        "started buying",
        "Xbox Series",
        "Linux",
        "Aya Neo"
    ],
    "transcript_entity_values": [
        "four hours",
        "this week",
        "Steam Deck",
        "one",
        "AMD",
        "millions",
        "Washington",
        "half a pound",
        "nearly two inches",
        "Linux",
        "2",
        "Xbox Series S",
        "a few years",
        "the middle of 2022",
        "EV-2",
        "400 and $530",
        "300",
        "less than half",
        "iPad",
        "the Switch Port",
        "3",
        "Aya Neo",
        "the Nintento Switch",
        "Apex Legends",
        "the Nintendo Switch",
        "UI",
        "Origin",
        "the Epic Games Store",
        "Nintendo",
        "Valve",
        "about $700",
        "Fortnight",
        "Steam Decks",
        "SD",
        "Bellevue",
        "Witcher",
        "the Xbox Series X and PS5",
        "The Steam Deck",
        "the PlayStation Vita",
        "Microsoft",
        "roughly hour and a half",
        "Dead Cells",
        "the Steam Deck",
        "Valve",
        "the Steam Deck's",
        "Nintendo Switch",
        "seven-inch",
        "max",
        "more than one",
        "Switch",
        "Steam OS"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "EVENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}