{
    "id": "3LmaCkczLcU",
    "title": "You've Never Seen Bananas Do This...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-25T23:23:47Z",
    "video_url": "https://www.youtube.com/watch?v=3LmaCkczLcU",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "makey makey",
        "makey",
        "diy",
        "bananas",
        "keyboard",
        "music",
        "music production",
        "2017",
        "iphone 7",
        "cool gadgets",
        "best",
        "cool",
        "vs",
        "apple",
        "new inventions",
        "iphone",
        "cool gadget",
        "video",
        "smartphone",
        "iphone 7 plus",
        "innovation",
        "awesome",
        "invention",
        "android",
        "products",
        "futuristic",
        "new gadgets",
        "technology (industry)",
        "future",
        "cool technology",
        "crazy",
        "amazing",
        "test",
        "inventions",
        "things",
        "new technology",
        "7 plus",
        "iphone 8"
    ],
    "views": 1487217,
    "likes": 52722,
    "comments_count": 3644,
    "description": "Makey Makey -  Full Sail University -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -   Sponsored by Full Sail University.",
    "description_links": [
        "http://amzn.to/2mx7vxY",
        "http://fullsail.edu/unboxtherapy",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Ohh! No! Aah..yeah! Today is gonna be a fun one because I've got something in front of me called the Make Makey if that doesn't sound fun not sure what does. This right here let's you turn everyday objects into touchpads Wait! Lew break it down for us. What does that even mean? These bananas over here can turn into keys.They could turn into button. This could be left click right click on your computer I'm saying you could make all kinds of unusual contraptions triggered by everyday objects using something like this. We are going to do something very exciting. I will be making a very quick little Beat using nothing but these bananas as my touchpads. Just plug it clip and play you can see on the top they have a layout you're showing you how you'll clip them to the bananas I don't know what to expect but let's crack it open and have some fun. There we go, okay, going to keep those. That's it, it all fits in this little guy right here. Who would have thought. A cool-looking little tin to keep everything in. You can show your Makey Makey pride right there. The very important connection wires. These are called alligator clips because they bite down and so these will clip to my independent instruments like this. You can see that the top part of it is in the shape of the gamepad , space and click. If I were to connect this clip right here now my spacebar is all of a sudden a banana. A banana spacebar. And then if you want to get a little more intense on the back of the unit. I want to go to the wasdfg because I'll use musical typing in garage band and attempt to play some instruments. Connect yourself to earth. Banana bongos maybe we should just go with that.I have got a laptop over here. Oh!! I'm getting lights, going to space here.--laugh-- Now first these banana's . Alright! and then I need to connect myself to earth now let me see something.. Oh!! If i take another clip connect it to this other. Wow!! Those are some groovy bananas right there. Let's take it to the next level and even my first album the banana beat maker it could be the start of something fresh who knows get it with the fresh bananas, these aren't that fresh to be honest.Here we go! alright so now those guys are in there oh why does that feel so satisfying. let's keep it moving here let's get a few more going. Should I hit them with the wu-tang jack, should I hit them with the wu-tang?! I bomb atomically, Socrates' philosophies and hypotheses Can't define how I be dropping these mockeries Lyrically perform armed robbery Flee with the lottery, possibly they spotted me Battle-scarred Shogun, explosion when my pen hits tremendous Ultraviolet shine blind forensics I inspect you, through the future see millennium Killer Beez sold fifty gold, sixty platinum I mean, they're you're bananas, you can do what you want with them. Get yourself a Makey Makey and make somethin' this episode of unboxing happy has been brought to you by Full Sail University big shout out to them this is a place you can go to start a career in technology gaming entertainment and so on. You could do courses online or you can actually physically go to their campus which has all these incredible facilities set up whether you want it getting to multimedia maybe you want to develop your own apps or games in either iOS or Android or for the web you might want to do web development they've got all those different programs over there they're designed to be flexible to go along with the various changes that happen in emerging tech. Thanks again to today's sponsor full sail university to find out more head over to full sail dot edu / unboxtherapy that link will be in the description as well",
    "transcript_keywords": [
        "Makey Makey",
        "Makey",
        "bananas",
        "banana",
        "Makey Makey pride",
        "clip",
        "Full Sail",
        "Full Sail University",
        "connect",
        "Make",
        "turn",
        "fun",
        "Full",
        "Sail",
        "Sail University",
        "Ohh",
        "click",
        "fresh",
        "everyday objects",
        "touchpads Wait"
    ],
    "transcript_entity_values": [
        "Makey Makey",
        "fifty",
        "Socrates",
        "sixty",
        "Android",
        "dot edu",
        "Lew",
        "Flee",
        "first",
        "today",
        "the Make Makey",
        "wu-tang",
        "Today",
        "Shogun",
        "wu-tang jack"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON"
    ]
}