{
    "id": "3oPBtjGlIps",
    "title": "I fired myself from YouTube",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-06-01T16:02:50Z",
    "video_url": "https://www.youtube.com/watch?v=3oPBtjGlIps",
    "category": "Science & Technology",
    "tags": [
        "fiverr",
        "youtube",
        "channel",
        "austin evans",
        "big man tyrone",
        "gone wrong",
        "fiver",
        "linus tech tips",
        "mkbhd",
        "marques brownlee",
        "jake roper",
        "vsauce3",
        "uravgconsumer",
        "judner aura",
        "the test drivers",
        "test drivers",
        "this is"
    ],
    "views": 702446,
    "likes": 40097,
    "comments_count": 2271,
    "description": "I probably shouldnt quit my day job. Big thanks to @UrAvgConsumer, @Vsauce3, @LinusTechTips and @mkbhd for...reacting to this Fiverr masterpiece.     My new podcast The Test Drivers!  Our second channel @thisis!  I stream on Twitch now!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://www.twitch.tv/austinevans",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- So I have been making YouTube videos for over 11 years now. Today I've got a video that should be pretty interesting. And while it's been a great run, I think it's about time to do something a little different. I am going to give away my YouTube channel. So what does that exactly mean? Well, obviously we have a ton of fun toys here, right? I mean, I like shooting videos on an 8K RED, but the thing is, I don't need it. I'm shooting on my phone right now, and it is just fine. But I wanna take it a step further, by letting a bunch of strangers on the internet make my video for me. - Samsung Galaxy Note 7. - And while, yes, it may or may not be an entertaining, well thought through masterpiece, like obviously all of my normal videos are, (box thudding) - [Matt] It's fragile. - (throat clearing) But you know what we got going for us, is the fact that I don't have to make it. So, it's a big plus there. So what happens when we let a bunch of internet strangers take over my channel. Probably not good thing, if I'm just gonna be real with you, but this is probably a bad idea. Now I think the first thing we need is someone to actually do some research for us. (laughing) Or someone can write our paper. Now I do wanna be clear, this video is not sponsored by Fiverr. I have been sponsored by Fiverr in the past, however, they have no affiliation with this video whatsoever. What! I will assist in medical and nursing research being a doctor? Did my doctor learn how to be a doctor on Fiverr? I will write a tech article, tech blog, or tech review for you. Perfect, and $5 for 350 words. Well, I feel like with this project, I'm going to have to think about it in stages, right, because someone has to research, someone has to then write that up into a script, then at that point I can send it out to like a voiceover artist, or an animator. Extremely cool voice over, okay. Well if it's extremely cool. No, wait, hold on. - [Morgan Freeman Impersonator] Hi, I'm not really Morgan Freeman. - I could have, if we're gonna do five of the worst tech products, we could split them up and have a different voiceover animator to do each one of them. Okay, so some of these might get a little expensive. I don't want Fiverr to make a boring video for me, I want something cool. - Hi there Fiverr's, Big Man Tyrone here, internet celebrity - This guys such a legend! Okay, I think we have all the basic research we need. Now it's time to actually start sending out some of these jobs to Fiverr and see what we actually get back. I'm not worried. I'm sure it'll be fine. I'm sure I'm not gonna be sucked into a black hole of trying to make this video for the next six months getting all this done. So the first thing I did was I sent out a very simple note asking, \"please give me five of the biggest tech failures.\" What I got back was essentially a paper. What are my five big tech fails? Well it is the first generation Peloton, it is the launch of Apple Maps, actually, that's a pretty solid one. Flammable hoverboards, very reasonable. The Amazon Fire phone, which I had almost forgot, I think I actually did a video on that. Classic, the Samsung Galaxy Note 7 which famously exploded. And that's it. Wait, was that five? So with my five tech fails chosen, next step is to send it over to someone to actually write up into an article. And this is what I received. Now this is actually pretty well done. I mean just scrolling through here, there's notes, there's bullet points. So now that we have our tech fails, now that we have our list written, let's actually get these things voiceovered. And the very first thing I have to do is get Morgan Freeman to do my intro, and to do one of the tech fails. The next issue is what do we actually put on screen, right? So normally if I'm making a video on the top five tech fails, I'm showing you footage and photos of the product. - And today I'm here with the top five tech failures. - So I'm gonna have to get a little creative cuz I don't know if I can find enough animators to do all these. What I may need to do is I may need to find someone to get me stock photos. Oh, yes. So I can just get someone, if I get the Morgan Freeman voiceover I'll just get someone to find me a bunch of stock footage with like phones and like Apple Maps. Oh God! What am I doing right now? What is this even gonna look like? How much is this gonna be? Alright, so it has been a couple of weeks and it is time to take a look and see what our Fiverr masterpiece looks like. So at this point, we have all of our voiceover, we have all of our edited clips, we have all of our A-roll. So the main question, really is just to watch it and see what kind of masterpiece Fiverr's made for us. - [Narrator] Hey guys, this is Austin. Just kidding. Here are some of the biggest tech fail the world has.. - What have we done? I'm so happy right now. I've been working on this video for a while and I've been very unsure of what it actually looks like. Am I just wasting my time and donating to a bunch of weirdos on Fiverr? Anyway, before we watch it, I actually have a couple of people who made a video or two in their day to watch it along with me. So let's begin. All right, three. - Two. - one, play. - [Narrator] Hey guys, this is Austin. Just kidding. Here are some of the biggest tech fails the world has had the misfortune of witnessing. - Samsung Galaxy Note 7. - Hoverboards were a hot item back in 2016. - [Lady] Peloton, how they managed to disappoint its customers. - [Man] The Amazon Fire Phone was doomed to fail from the beginning. - [Narrator] Propelled by the launch of iPod followed by iPhone and iPads. Apple has arguably revolutionized modern mobile computing. - So someone worked on this as in like to create. - [Narrator] The unique design, great hardware and customer satisfaction has set the bar for its products very high. However, it has also brought the company into just one mistake away from public scrutiny. - Ah, okay, so I see. So the whole video is basically about how Austin Evans became corporate America and just outsourced everything to cheap labor, and then collects all the money. - Designed to make traveling over shorter distances easier the boards featured complete foot control, where pressurized pads were used as foot rests to control the movement. Popularity didn't last long after people started reporting incidents of the gadgets exploding. There were a total of 99 reports and 18 injuries, including burns to neck, legs or arms. Oh oh. While some exploded during recharge others simply burst into flames while people were actually riding them. The problem turned out to be the not so high quality rechargeable lithium ion batteries they utilized. - It is like Dumbledore meets Hagrid meets Jesus meets Lumberjack. - [Lady] There were a number of reasons why Peloton bikes didn't take off in the market. To begin with, the bikes come with an extremely high price tag, which generally starts at $2,245. That's a pretty big investment for something you might not even use that often. - I mean, I have a lot of thoughts currently about this Peloton argument that's happening right now. - [Lady] The indoor bikes come with a Wi Fi enabled touchscreen tablet that's streams live and on-demand classes. It also gives you the option to work out alone or compete with other participants virtually. Even though all the features are great, it does pose a problem when you run into an issue and you have no idea how to solve it. - Uh oh. - Samsung Galaxy Note 7 was probably one of the most anticipated phones of 2016. However, it didn't live up to the expectations soon after the release. - I do love that I can't tell where the real set starts and ends with this guy. The table seems to be real, but I don't think the iMac is real. - Customers started complaining of overheating, and the phones eventually exploding. After 35 reported incidents worldwide, Samsung decided to recall every single one of the phones that was sold. The company stopped all sales and shipments of Note 7 and worked to provide refunds. (laughs) - Okay, I'm into this now. - Or exchanges. However, it still wasn't enough. Following the exchanges, the supposedly safe replacements also started catching fire, leading to Samsung recalling all of them as well. - Uh oh. - So wait, old dude and Mr. Black Vegeta, they are... are they like Fiverr employees, like what is this? this all looks like old footage I don't... - [Narrator] The release of iOS 6 for iPhone and iPad brought with it just the mistake. The upgrade featured Apple's own version of a Maps application. Instead of the one that relied on Google Maps technology. This step didn't pay off as expected, and led to major backlash from the public. Some people also described it as a disaster. The application was flawed to begin with. The mapping technology was complex, giving wrong directions and lacking turn by turn navigation. - Maps.mp4 (laughs) - [Narrator] Making the overall experience lackluster as compared to Google Maps. The criticism was so intense that Apple's CEO had to issue a public apology, and even suggested using Google Maps as an alternative. - Uh oh. - [Man] Leading to a 170 million dollar loss to the company, the Amazon Fire Phone was doomed to fail from the beginning. The device was referred to as forgettable and mediocre, causing Amazon to drastically change its price from $200 to 99 cents just after a month of its launch. Now, why did the phone fail? To begin with, it was overpriced, essentially the same as an iPhone or Samsung Galaxy. This was a major drawback, since most of the people weren't ready to choose it over the other alternatives as it used a proprietary App Store tailor-made for the company's phones and tablets, which meant that developers had to make different versions of their applications specifically for the Fire Phone. - Uh oh. - That's it? That's the end? - I just watched the longest four and a half minutes of my life. - So what have we learned today? Well, yes, there are certainly many channels that are very successful by basically being content farms. And the problem there is that, at least for our video that we made today, it's not quite as cohesive as I would hope, right? Like it doesn't really tell the story. It tells a lot of individual stories, but if I was going to do this again, I think I would approach it in a little bit more of a overarching sort of way versus just letting the internet go completely wild with things. If I've learned anything from this video though, is I should probably just fire Ken, I mean, really, what is he bringing to the table? So how much was our Fiverr video to create? Well, let's just see, shall we? So first of all, we have our animated whiteboard explainer. So this is the person who did the Peloton animation, and including tip it was $60 and 50 cents, and I did tip pretty much everyone on here. Next we have the stock footage commercial which was the most expensive video we got at $170. Elmer drinking coffee and reading about the hoverboard was $74. - Uh oh. - And Tyrone talking about the Note 7 was a full 152 bucks. The voiceover for the Fire Phone was $50. The voiceover for Peloton was $56. Morgan Freeman's voiceover was a bargain at 34 bucks. And the research was done for 34 and the actual script itself was written for $17, which comes out to a grand total of $647 and 75 cents. So this is what happens when I run out of ideas and I'm stuck inside my house for too long. Thanks for subscribing to Austin's Fiverr corner. (mumbles) Could have done a Mystery Tech but instead I did a Fiverr video, mmh. Oh great, love that I look homeless, I actually didn't realize you were gonna use this footage, that's fine, it's all good.",
    "transcript_keywords": [
        "Samsung Galaxy Note",
        "Fiverr",
        "video",
        "Amazon Fire phone",
        "tech fails",
        "tech",
        "Samsung Galaxy",
        "Galaxy Note",
        "Fire phone",
        "Fiverr video",
        "Morgan Freeman",
        "Note",
        "Amazon Fire",
        "Fire",
        "Morgan Freeman voiceover",
        "Samsung",
        "Google Maps",
        "Maps",
        "phone",
        "Peloton"
    ],
    "transcript_entity_values": [
        "5",
        "America",
        "152 bucks",
        "three",
        "iPhone",
        "Classic",
        "Austin Evans",
        "iPad",
        "Samsung Galaxy",
        "first",
        "Black Vegeta",
        "Morgan Freeman's",
        "Amazon",
        "four and a half minutes",
        "Ken",
        "Samsung",
        "Two",
        "Amazon Fire",
        "170",
        "647",
        "the next six months",
        "Austin",
        "two",
        "over 11 years",
        "2016",
        "Apple",
        "Matt",
        "99",
        "34 bucks",
        "50",
        "App Store",
        "75 cents",
        "60",
        "Austin",
        "8",
        "YouTube",
        "K RED",
        "one",
        "Apple Maps",
        "Dumbledore",
        "iPads",
        "Peloton",
        "iMac",
        "170 million dollar",
        "the Amazon Fire Phone",
        "18",
        "200",
        "a month",
        "five",
        "a ton",
        "Big Man Tyrone",
        "Jesus",
        "50 cents",
        "Tyrone",
        "iPod",
        "34",
        "2,245",
        "17",
        "the Fire Phone",
        "Morgan Freeman",
        "the Samsung Galaxy Note 7",
        "350",
        "iOS 6",
        "Mystery Tech",
        "Fiverr",
        "Morgan Freeman Impersonator",
        "Morgan Freeman",
        "35",
        "today",
        "74",
        "56",
        "Hagrid",
        "a couple of weeks",
        "Google Maps",
        "just one"
    ],
    "transcript_entity_types": [
        "MONEY",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}