{
    "id": "3qYNUquXxco",
    "title": "The ups and downs of being a political TikToker",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-06-27T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=3qYNUquXxco",
    "category": "Science & Technology",
    "tags": [
        "under the desk news",
        "Vitus “V” Spehar",
        "tiktok",
        "creators",
        "politics",
        "news",
        "the verge",
        "full frame",
        "becca farsace",
        "verge",
        "tech news"
    ],
    "views": 18177,
    "likes": 653,
    "comments_count": 79,
    "description": "I met Vitus V Spehar  the face behind Under the Desk News  a year ago in Washington, DC. I was on location with The Verge filming the TikTok senate hearing along with interviews with Senators and content creators for a Verge video about the looming ban. And when we interviewed V outside of the Capitol Building, V said that TikTok was useful for channels like their own  a news channel that was started because they didnt believe traditional news sources were accessible enough to younger audiences. Vs TikTok now has 3.1 million subscribers.  So I spent a day with V to figure out why the hell they continue to do it, and more importantly, how they feel about the looming ban that threatens their main subscriber base.  Link to Matty Benedetto of Unnecessary Inventions episode:   0:00 Who is V from Under the Desk News? 01:39 The White House Correspondents Dinner is a big deal 02:20 The beginning of Under the Desk News 03:53 The struggle of political journalism 05:23 The TikTok ban 06:18 Under the Desk News Studio Tour 07:17 How Vitus V Spehar makes their content 09:42 Beccas final thoughts  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://youtu.be/6Qj52BUkbpU?si=w445sMJLF34nDbrW",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://link.chtbl.com/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "(upbeat music) - Good morning from Rochester, New York, which happens to be in my hometown. Today, I am spending the day with V Spehar. They are a independent journalist, slash influencer, who posts daily news updates to their TikTok account, which has over 3 million subscribers. - It's Tuesday night. It's Wednesday night. And here's what happened. Super Tuesday turned out to be more of a super snooze day. Nikki Haley went to Israel to sign bombs. - I actually met V a year ago down in DC. We were covering the TikTok Senate hearing, and when we interviewed V, they said this thing about news not necessarily being accessible. - So one of the reasons why I started doing \"Under the Desk News\" is 'cause I didn't feel super included in, like, academia and in news, right? You have to be super smart to be a journalist. You have to be super smart to understand things. And so I started \"Under the Desk News\" to be like, \"You are smart, you definitely understand it.\" - It really resonated with me, so when I launched this creator-focused series about why creators do what they do, and how they do what they do, I knew I wanted to talk to V. (camera reel whirring) And it all starts at a barbershop. (upbeat music) Good morning! - [V] Good morning. - [Becca] Do you always start your day with a haircut? - Yeah, every day. - The hot towel. - No. (all laughing) - [Becca] The Tuesday I was visiting V wasn't just any old Tuesday, it was the Tuesday of their very first perm. - You don't see Katie Kirk out here like this, gettin' her hair done. I've never seen Kamala Harris getting a silk press talking about the nation. - This is true, but the perm smells really bad. It smells really bad in here. - It is so bad. - [Becca] But more importantly, it was also the Tuesday, right before the White House correspondence dinner. - [Becca] To get a perm on this week. - The week of White House correspondence week? - [Becca] Yeah. (laughs) - It's a high level of trust with Anna and friends. (upbeat music) - [Becca] The White House correspondence weekend and dinner is a full weekend of events that brings all of the journalists who cover the White House, and celebrities, and even the President together. It's a very high-profile event in Washington DC, and it requires an invite. A few years ago, the idea that a TikTok star like V could attend a political event as prestigious as this would've been insane. But while working for the Washington Post TikTok channel, they were given the ability to go. And now they've attended three years in a row. But in no way was a ticket to one of Washington's hottest parties a plan for V. The origins of their TikTok channel looked a lot more like this. - Hey, today I'm gonna show you how to make a coffee soda. Okay, let's get this over with, I just woke up. Vanilla syrup and just a touch of cinnamon. - So as the director of \"Impact with James Beard Foundation,\" which is like big food foundation, and the pandemic came, I got furloughed, so I started making TikToks with all my \"Chef Bro\" friends because it was, like, something to do. Then January 6th came, and I just dove under my desk. Mike, Michael, Michael Pence, you can invoke the 25th right now, and then you could be president, You could be president for 14 whole days. President! And it went super viral, and my friend Randy was like, \"You better get back under that desk \"and explain to people what's going on again.\" - [Becca] And since January 6th, 2021, V has continued to make videos under their desk. Which has led to more followers and big collaborations with politicians. - [Barack] What are you doing under my desk? - Well, under the desk is kind of my thing. - [Becca] Not to mention partnerships with major news networks. - All right, we are here live at the Macy's Thanksgiving Day parade. I am live streaming for NBC. - [Becca] And even a short role as a correspondent for the Washington Post TikTok channel. - Hey there, V Spehar for the Washington Post, And today we're gonna teach you how to administer Narcan. - [Becca] All of which has helped them become a recognizable face in the world of political discourse on TikTok. - We are here on the south lawn of The White House, like the actual White House. I think what we've been able to do is change the way that people see the news, and kind of return it to this idea of it being a community activity, and not an authority at a desk telling you what to think and how it is. - But it's this community-based approach that has also caused some trouble for V. See, \"Under the Desk News\" occupies this sort of strange space between news anchor and internet personality, meaning that first they aren't held to the same journalistic standards that traditional news media outlets theoretically have to meet. And second, as a community member, they often give advice or guidance. You couple that with the huge divide in US politics, and it is a recipe for negative feedback, which came to a head when V posted a good news only TikTok the week following Hamas' attack on Israel, which was October 7th, 2023. In the now deleted video V encourages folks to log off and take a break from the news for the weekend. And this resulted in a flurry of stitches on TikTok. - Let's stay off social media for the rest of the weekend, checking in when we need to, but remember when you see really dangerous. - No, no, actually, this is the exact kind of apathy that we cannot afford, that Palestinians cannot afford. - I'm disappointed, but I'm not surprised that \"Under the Desk News\" did not take any accountability for what they said in their last video. - To not pay attention, to turn it off will only embolden those committing the oppression. - [Becca] V told me that the clips of folks were stitching were taken out of context and didn't include what they had been covering that week, which was how to explain difficult or painful news to kids. V believes this led to the wrong impression and added, \"I'm not the same person I was before October 7th, \"and the five weeks that followed, none of us are. \"But I continue to learn and try, and do the best I can \"to trust myself and my community.\" But this isn't the only problem facing V's content these days. - Another big story tonight, what next for TikTok? - The Chinese-owned company is threatening to go to court to challenge new legislation that could effectively ban the platform sometime next year. - The TikTok ban is hard. I feel like it's been a slow death because it started last year. I'm gonna get another job, I'm gonna be okay, right? I've established myself, I've broken that ceiling to kind of be able to be successful in the real world, in the traditional industry. The people who are making 300 bucks, 600 bucks on TikTok, where you gonna make that up? It's really callous of Congress to be saying in six months to a year, we're gonna get rid of this with no economic prospect for these people to make that extra couple hundred dollars that is life changing to many people. - [Becca] V has been able to take their success on TikTok and use it to create a business that almost entirely does not rely on the app. And after we left the barbershop, it was time to cater to that. It's easy to group successful creators with lavish lifestyles, but V actually lives quite a modest one. They drive an older car that they bought off of Hertz in the peak of the pandemic. They don't have the latest and greatest in terms of technology, and this small purple room is their office and studio. It could not be more different from the studio I was in a few weeks ago while profiling creator Maddie Benedetto of \"Unnecessary Inventions,\" whose episode I'll link down below. Unlike Maddie, V's space is anything but sprawling. Instead, it's just enough room to do what makes them a living, which is podcasting, consulting, and doing speaking engagements. - Hi, pals. - [Becca] On the day I was following V, they were recording two segments for their podcast with \"Bettcha's Media,\" called \"American Fever Dream.\" That covers politics and pop culture. - Until next time, I'm Vita Spehar, and this is \"American Fever Dream.\" - [Becca] But they also travel the country, speaking about everything from social media, to politics, to digital journalism. - Let's go back in the air conditioning and under the desk though, huh? (laughs) - [Becca] After six hours of watching V do everything but create content for \"Under the Desk,\" we ride arrived at their home. One so recently moved into, that moving boxes were still scattered about, and I finally got to meet their dogs. But also watch them create. (peaceful music) - Let's see what else is going on in the world. - [Becca] An \"Under the Desk\" TikTok starts with a lot of sifting. - [V] These are my most visited sites. - [Becca] I saw them visit loads of different websites while I was with them, but their top picks for news include the Washington posts, Axios, AP, and Politico to name a few. - I think it's good to look at, like, the collective of what's being reported and then try to read between the lines on it. - [Becca] V's goal in this first step of making their daily content, is to find six to eight stories, or as many stories that will fill 90 seconds to tell their audience about. But there's one rule. - I don't like to just tell 'em stuff that's bad and there's nothing they're gonna be able to do about it. I think it needs to be something that like, hey, this is happening, I want you to be aware of it, be conversational about it, and there's something we can do about it. - [Becca] We sat in V's dining room together for well over an hour as they listened to an ongoing Senate vote, read loads of news, and scripted what they wanted to cover before it was finally time to record the content they're best known for. Do you ever regret starting this \"Under the Desk?\" - I was so much younger when I started doing this, and now I have like sciatica, it's amazing. I don't even care, I'll do it for you forever. - [Becca] To film their content, V records directly to the TikTok app using an iPhone 13 Pro. - Look at this perm, the perm is permin', all right. It's Tuesday night, and here's what happened. - [Becca] And just like that V was off. - No, the Senate has not done the final vote to pass the spending package for foreign wars and the TikTok ban. One in five Americans, okay. And if you are one of the one in five Americans who works under a non-compete, well, there's some good news for you. Today, the FTC overturned a rule. They didn't overturn the rule, hold on. Voted to ban, okay. Now, earlier today, the Senate advanced this legislation to a final vote by 80. Now, earlier today, the Senate advanced this legislation to go. You're a lawsuit and nothing will change about your TikTok experience immediately. That's the news for tonight, I will see you in the morning. Yep. Are you ready? - [Becca] You doin' it? - [V] Here we go, post. - [Phone] He didn't know I spoke Japanese. - [Becca] So after V posted that TikTok, my time with them was up. And what I took away from spending a day with them and editing this entire piece is that, I mean, reporting on anything political in 2024 is going to be tough. And V is definitely fighting an uphill battle with the TikTok ban, and just the huge divide in US politics, and the community-based approach that they take. But the thing that I can't stop thinking about is that no matter what we were doing that day, V showed up to it and gave an 110% effort. And in terms of them being a creator, and having a business as a creator, I think that that is what makes them successful. And that's something I'm gonna take with me. Anyway, thank you so much for watching, I'm Becca, this was another episode of \"My Creator Series.\" Let me know who you want me to spend time with next. I appreciate, Bud, and I'll see you in the next one.",
    "transcript_keywords": [
        "White House",
        "TikTok",
        "Desk",
        "Washington Post TikTok",
        "White House correspondence",
        "Tuesday",
        "Washington Post",
        "White",
        "House",
        "Post TikTok channel",
        "day",
        "Washington",
        "Tuesday night",
        "Post TikTok",
        "House correspondence",
        "TikTok ban",
        "American Fever Dream",
        "Super",
        "Senate",
        "TikTok channel"
    ],
    "transcript_entity_values": [
        "Randy",
        "New York",
        "Thanksgiving Day",
        "Unnecessary Inventions",
        "Hamas",
        "White House",
        "300 bucks",
        "Under the Desk",
        "the day",
        "morning",
        "25th",
        "Israel",
        "American Fever Dream",
        "600 bucks",
        "A few years ago",
        "January 6th, 2021",
        "the White House",
        "the five weeks",
        "Barack",
        "Bettcha's Media",
        "earlier today",
        "2024",
        "Michael Pence",
        "One",
        "110%",
        "TikTok",
        "Mike",
        "Michael",
        "that week",
        "this week",
        "Rochester",
        "the Washington Post",
        "Narcan",
        "Anna",
        "Bud",
        "Wednesday night",
        "the weekend",
        "daily",
        "Senate",
        "The White House",
        "Kamala Harris",
        "Japanese",
        "Palestinians",
        "first",
        "Washington DC",
        "a year ago",
        "over 3 million",
        "Chinese",
        "three years in a row",
        "Nikki Haley",
        "next year",
        "last year",
        "Today",
        "Katie Kirk",
        "Americans",
        "FTC",
        "James Beard Foundation",
        "Washington",
        "US",
        "the Washington Post TikTok",
        "Becca",
        "Congress",
        "six to eight",
        "Tuesday night",
        "Tuesday",
        "My Creator Series",
        "AP",
        "DC",
        "second",
        "these days",
        "five",
        "six months to a year",
        "Politico",
        "Vita Spehar",
        "90 seconds",
        "a few weeks ago",
        "one",
        "80",
        "well over an hour",
        "TikToks",
        "Axios",
        "today",
        "Maddie Benedetto",
        "14 whole days",
        "NBC",
        "tonight",
        "six hours",
        "a full weekend",
        "Hertz",
        "January 6th",
        "2023",
        "two",
        "October 7th",
        "Macy",
        "a day",
        "the week",
        "Maddie"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "TIME",
        "ORDINAL",
        "GPE",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "FAC",
        "PERSON",
        "NORP",
        "NORP",
        "ORDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "NORP",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "LOC",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON"
    ]
}