{
    "id": "3RIp7CwkBeA",
    "title": "I Hope You Have a LOT of Money... RTX 4000 Announced",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-09-21T04:39:31Z",
    "video_url": "https://www.youtube.com/watch?v=3RIp7CwkBeA",
    "category": "Science & Technology",
    "tags": [
        "Nvidia",
        "4000",
        "4090",
        "4080",
        "Ada",
        "Lovelace",
        "RTX",
        "DLSS 3",
        "RTX Remix"
    ],
    "views": 1874888,
    "likes": 67359,
    "comments_count": 5922,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   Get 50% off on your annual Zoho CRM subscription at:   Nvidia just announced the RTX 4090 and 4080s.  Overall Ada looks great... but Nvidia left out some crucial details that have me concerned.  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro",
    "description_links": [
        "https://www.freshbooks.com/linus",
        "https://lmg.gg/ZohoCRM",
        "https://linustechtips.com/topic/1456484-the-rtx-4090-looks-sick/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Oh, heck yeah. I've got some brand new GPUs in the oven. Let's see what Mr. Jensen has in store for us. Wait, it's just, yep. Yeah, Nvidia finally announced the RTX 4090, 4080 and also the RTX 4080, but slower. To be clear, the RTX 4090 looks freaking incredible, and gamers have a lot to be excited about here, but Nvidia has also left out a lot of key details that have me very concerned about just how much of a performance increase you're gonna get if you're not willing to sell a kidney. I'm always willing to sell stuff, though. And that's why we're talking about today's sponsor. - Zoho CRM. Zoho CRM is a 360-degree solution that offers an intuitive UI, AI predictions, and a design studio to help you get your sales done faster. Get 50% off with code \"ZCRM50\" using the link down below. (electronic whooshing) (electronic beeping) (upbeat techno music) - Out of the gate, the RTX 4090 looks like a monster, and not in the way we thought it would, either. Although the details in Jensen's announcement were light, he did mention a doubling of rasterization performance and a quadrupling of ray tracing performance. And the specs back him up. With the RTX 4090 having 16,384 CUDA Cores and a boost clock of 2.52 GHz, even without architectural improvements, this thing buries the 3090. Going into the event, there were rumors that the 4090 would draw up to 600 watts of power, but impressively, Nvidia has been able to have this huge bump in CUDA Cores and clock speeds, while maintaining the same 450-watt TDP of the RTX 3090. Which, to be clear, is still a lot of power, but it's not an asinine amount of power. Given how much of a performance uplift the RTX 4090 offers, I'm impressed they were able to keep the price to $1,600. And yeah, that's a stupid amount of money for a GPU, but the $100 increase over the RTX 3090 is less than half inflation in the same amount of time. And before this announcement, I was very concerned it would cost closer to $2,000. That said, currently you can get a 3090 Ti for a bit over $1,000. So the actual value proposition on the RTX 4090 is a bit more difficult. With a release date of October 12th, hopefully we'll be able to properly test one out soon and figure out if it's really worth it. Now, we get into the more questionable side of the announcement, the 4080s. There are two different RTX 4080s, a 12GB model and a 16GB model. What is strange, though, is that these are completely different cards with completely different specs. Now, Nvidia did not give us any non-ray trace performance data, nor did they share with us the crucial memory bandwidth spec. But what we do know isn't promising. With 7,680 CUDA Cores, the 12GB RTX 4080 has 1,000 less CUDA cores than the RTX 3080. Ow. While the 16GB model falls behind the RTX 3080 Ti score counts. The saving grace here is the clock speeds, at 2.6 and 2.5GHz respectively. On paper, these GPUs are still ferocious, and that isn't even taking into account the raw architectural advantages that they get thanks to TSMC's 4N node, compared to Samsung's 8nm. You just get the faster 16GB 4080 then, right? Eh, not so fast. In Nvidia's own performance data, it shows the 12GB and 16GB versions are nearly tied in Flight Sim, while in Warhammer and Cyberpunk, the 16GB pulls an amount ahead. Given the $300 price difference, there is a good chance the 12GB model will be, just, the better buy over the 16GB, 'cause you're already in it for $1,200. You might as well just save up a little bit more for the much stronger RTX 4090. I am deeply suspicious that the 12GB 4080 was supposed to be the RTX 4070, but then the GPU market crashed, Ethereum went proof-of-stake, and they're sitting on months worth of stock of the RTX 3000 series. So, they cannot justify a $900 4070. Easy fix though, just call it a 4080 instead. All of this, though, is me speculating about the rasterization performance of these GPUs, AKA how it performs in non-ray traced games. If you care a lot about ray tracing, though, RTX 4000 series looks damn good. Nvidia claims a two- to four-times increase in performance with ray tracing on, and they achieve this through a couple different methods. First, throw more hardware at it. Like, so much that people might start actually turning ray tracing on. Next, you make it run better with Shader Execution Reordering. Nvidia didn't get into as much detail about this as I was hoping, so I'm just gonna make an educated guess, and if I'm wrong, correct me down below. Ray tracing is naturally a single-threaded task, because you can't calculate, like, the third bounce of light until you've already calculated the first two. This can lead to the shader engine, which figures out how light and dark various pixels should be. You just kind of wait around while the ray tracing is being calculated. But using the magic of Shader Execution Reordering, apparently Nvidia can make the process more parallel, leading to a two-times more efficient ray tracing, and an FPS boost of about 25%. The third way Nvidia improved ray tracing performance is by giving us DLSS 3. In the past DLSS would use AI to turn a lower resolution source into a higher resolution output. With DLSS 3, Nvidia is able to create a new, fully AI-generated frame without the intervention of the CPU by just using the motion information that was already there in DLSS 2. I'm not totally sure how I feel about this. In cinematic games like Cyberpunk or Flight Sim, I'm sure it works great, but I'm not totally sure I want to turn it on in a competitive shooter, since it kind of sounds like motion smoothing through the magic of AI, instead of actually adding more FPS. But I know what a lot of you are thinking right now. \"Ray racing doesn't matter, because the games you love don't support it, and the performance hit is just way too much.\" And honestly, I agree with you. The best ray tracing experience I've had is in Minecraft, and I didn't even use the RT Cores for that. Which is why I'm super stoked for another thing Jensen announced today, RTX Remix. In the past, adding Ray tracing to a game that was developed on, say, DirectX 8 or DirectX 9 was basically impossible for modders unless they had access to the tools used to develop the game and a metric buttload of time. Now using RTX Remix, modders won't need access to specialized tools, and will only spend an Imperial butt cheek of time to remaster your favorite old games. RTX Remix works by capturing the textures, geometry, lighting, and cameras by intercepting the draw calls, interpreting them as distinct assets, and then reassembling them all back into a scene. Nvidia went ahead and remastered Portal into Portal RTX using this tech, and it'll be available as free DLC in November. Honestly, this is probably my favorite thing announced today. Also, if someone could give Valheim the RTX Remix treatment, you'll be my hero. What creators will be excited about, though, is AV1 support, and Nvidia didn't even mention it in the presentation. But, it's there. RIP, Ark. You never even lived. One thing I wanna circle back on, though, the pricing. I've seen a lot of people in the comments respond to the pricing, accusing Nvidia of being super greedy. And honestly, I don't think that's the case. We know that TSMC's prices have risen by at least 20%, maybe even 30%, and Nvidia's 4080 and 4090 dies are massive. I think they planned on releasing these at potentially even higher prices, but had to rethink it after the whole GPU crash. Do you really think if this was a super profitable release EVGA would've jumped ship? What these prices definitely do, though, is leave the door wide open for AMD's RDNA 3, because Nvidia probably just can't make them many lower. I highly doubt team red will be able to take on the 4090, but the rumors suggest AMD could be very competitive against the 4080s in performance and destroy Nvidia in efficiency. We'll have to wait until November 3rd to find out, though. But what you can do now is find out who sponsored this video. - FreshBooks, FreshBooks is an easy-to-use accounting software that helps you do your business. That's it! Impress your clients with professional-looking invoices that detail the work you've done. Use automated payment reminders if invoices get past due date, and easily track expenses and use FreshBooks as time tracker to log every minute of billable hours, so you don't have to think about it later. FreshBooks helps you keep everyone on the same page with their \"Projects\" feature, which makes it easier for clients, team, and contractors to collaborate, share files, and comment. And FreshBooks has your back at tax time, too. With a ton of reports to choose from, you'll know exactly where your business stands, and you can easily hand the keys over to your accountant, so that they can take over when it's time to reconcile everything for the year. Choose the plan that's right for you, and start your free trial of FreshBooks for 30 days today, no credit card required, at freshworks.com/linus. - So, huge thanks for watching. And oh, one more thing. SLI, it's totally dead now. No fingers at all. Maybe you go and watch this video, where me and Linus try and get it working on the RTX 3090. It was also dead then, but not officially.",
    "transcript_keywords": [
        "RTX",
        "RTX Remix",
        "Nvidia",
        "ray tracing",
        "CUDA Cores",
        "ray",
        "ray tracing performance",
        "performance",
        "tracing",
        "RTX Remix works",
        "Cores",
        "RTX Remix treatment",
        "Portal RTX",
        "CUDA",
        "Shader Execution Reordering",
        "lot",
        "tracing performance",
        "time",
        "FreshBooks",
        "Remix"
    ],
    "transcript_entity_values": [
        "one",
        "1,000",
        "Imperial",
        "4080",
        "300",
        "One",
        "Ethereum",
        "about 25%",
        "EVGA",
        "GPU",
        "Flight Sim",
        "RTX Remix",
        "AI",
        "AMD",
        "FreshBooks",
        "SLI",
        "Zoho CRM",
        "Linus",
        "at least 20%",
        "October 12th",
        "the year",
        "DirectX 8",
        "3080",
        "first",
        "GB",
        "First",
        "Ark.",
        "3000",
        "Warhammer and Cyberpunk",
        "$900 4070",
        "3080 Ti",
        "months",
        "over $1,000",
        "Portal",
        "every minute of billable hours",
        "CPU",
        "16,384",
        "Minecraft",
        "third",
        "50%",
        "TSMC",
        "Samsung",
        "Jensen",
        "30 days",
        "UI",
        "4000",
        "2,000",
        "450-watt",
        "less than half",
        "CUDA Cores",
        "4N",
        "16",
        "a ton",
        "November",
        "3",
        "12",
        "4080s",
        "two",
        "2.6",
        "DLSS 3",
        "November 3rd",
        "Valheim",
        "1,600",
        "DLSS 2",
        "today",
        "up to",
        "30%",
        "4090",
        "CUDA",
        "Ray",
        "3090",
        "8",
        "2.5GHz",
        "a metric buttload",
        "7,680",
        "600 watts",
        "Nvidia",
        "100",
        "1,200",
        "2.52 GHz",
        "two- to four"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "GPE",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "DATE",
        "ORG",
        "MONEY",
        "LAW",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "CARDINAL"
    ]
}