{
    "id": "3rrrKEYY6Kg",
    "title": "Apple Watch - Is it actually Sapphire?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-04-28T04:48:27Z",
    "video_url": "https://www.youtube.com/watch?v=3rrrKEYY6Kg",
    "category": "Science & Technology",
    "tags": [
        "apple watch",
        "sapphire",
        "apple watch sapphire",
        "apple",
        "watch",
        "test",
        "apple watch review",
        "review",
        "scratch",
        "iphone",
        "tissot",
        "g watch",
        "unbox therapy",
        "unboxtherapy",
        "stainless steel",
        "apple iwatch",
        "apple sport",
        "iwatch",
        "space gray",
        "display",
        "iwatch apple",
        "scratch test",
        "ion x",
        "ion",
        "test scratch",
        "apple watch sport",
        "apple watch edition",
        "edition",
        "watch edition",
        "38mm",
        "42mm",
        "stress test",
        "durability",
        "durability test",
        "38mm 42mm",
        "tech",
        "technology",
        "sport scratch",
        "gorilla glass"
    ],
    "views": 6435142,
    "likes": 75446,
    "comments_count": 3594,
    "description": "Diamond testing the Apple Watch. $15 Diamond Tester -  Subscribe:   Various \"watch people\" expressed concern that the Apple Watch may feature inferior materials. I decided to test the Apple Watch in an effort to uncover the truth.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -   Sapphire Watch Links  -   -   -",
    "description_links": [
        "http://amzn.to/1U7A82b",
        "http://youtube.com/unboxtherapy",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak",
        "http://nickhacko.blogspot.ca/2013/06/watch-crystal-sapphire-or-mineral-glass.html",
        "http://www.rayotek.com/techincal_info_glass_sapphire.htm",
        "http://www.businessinsider.com/how-sapphire-glass-screens-are-made-2014-9"
    ],
    "transcript": "What's up guys *random noises* What's up guys, Lew here, back with another video And today I've got something that I think your going to be interested in If you've been following my channel recently, then you know... I've done a couple of videos about the Apple Watch. I did an unboxing of ... This Apple Watch right here which... Is the standard version - The Non Sport Featuring a higher quality... Or more expensive materials. But I also did a video before that... A scratch test on this component... Here which is the Glass from the Apple Watch Sport. It's called Ion X and it's not Nearly as hard as pure Sapphire. Apparently, up until This point, Sapphire Crystals Have been of a certain shape And a certain style, for Many traditional watches. So I went out and did a little Bit of my own research, I even went to A jewelry store and bought a Watch, so in front of me here, I have a Teso watch, now I've been told that Most, if not all Teso Watches feature Sapphire Crystals This one, for example, if you Turn it around and look at the back, you will see It is branded as stainless steel water resistant sapphire crystal So a legit 100 percent sapphire crystal on this watch I wanted to compare that To the sapphire crystal that exists on the Apple watch maybe Apple was using some unique material Or some kind of a process to get the Sapphire in the shape that it's In on the standard Apple watch or maybe That they weren't necessarily using the kind of sapphire crystal that we're used Too This my friends is a diamond tester This tests the conductivity of various materials. It's used mostly for evaluating Jewelry and fine stones like diamonds hence the name but it actually works perfectly fine on materials like Sapphire As well. Mineral glass will have no effect on this scale When tested when you touch this probe against it Whereas Sapphire or materials like it, diamond, so on and so forth which are very conductive materials will have a different type readout it will go as far as seven or this scale depending on the sensitivity so this is a definitive test for determining whether or not you are dealing with a sapphire crystal on a watch you have to have your hand on this metallic portion on the other side up the diamond tester and you also need to be holding the object that you're testing because it actually your body that will complete the circuit and allow for the test to be accurate so in front me here I have various devices I have my phone I have the Apple watch, the more expensive Apple watch. I have the glass from the Apple watch sport right here I have that tea so that I told you I purchased with actual verified sapphire glass sapphire crystal, sorry, on the front and then I have Elgg watch are on the far left so we're gonna go ahead and test all these different surfaces so we can find out once and for all if Apple is using legitimate sapphire crystal in the more expensive Apple watch so I'm gonna go ahead and turn on diamond selector two. How serious does that sound? Now you will need to set the sensitivity this is built in for various sizes of diamond stones that you might be testing in this case %uh put a relatively low sensitivity on their It will lead the reacting. You'll see the meter go up the scale or it won't at all. Let's start with the G watch R from LG. So you have no reaction here at all so we know immediately based on this test, that the conductivity of this material that we are dealing with glass now we can expect a similar readout from the iPhone 6 exact same effect now if I go ahead and test the glass from Apple watch sport once again glass No reaction at all. Certainly not sapphire or any kind of special material. So let's go ahead and move on to the critical stuff here I've got fifty so watch traditional style watch that I purchased for about three hundred dollars with a verified sapphire crystal by touching a you'll see the meter jump all the way up to the sensitivity setting and I have is presuming but this is diamond be as it is a really big surface of material and I have the sensitivity said for that kind of reaction. Now lastly we have the Apple watch which many have disputed whether or not its legitimate traditional watch dial sapphire because of the shape a bit and and the unusual manufacturing process that would probably take to make it here's the test and what you'll see is it gets pretty high flashing up to an 8. It becomes obvious that Apple is certainly using sapphire crystal here we're seeing something fairly innovative hear from Apple in their manufacturing process that they were capable of producing something so unusual in the watch World a sapphire crystal in this particular shape with this rounded edge. Believe it or not the production of sapphire crystals for watch it is a fairly complicated thing I will drop some links in the description to describe and explain more and once you do some reading or little bit of research understand why this is such an achievement and why there were so many people doubting that it could actually be that material, given the current production methods for sapphire crystal for watches Alright, guys. I hope that you enjoyed this video, if you did make sure to leave a thumbs up down below also share it with your friends. Anybody who's wondering, asking questions trying to decide between Apple watch sport or the Apple watch the next step up. I can tell you this is stainless steel in sapphire just as they say in this is one of the hardest materials on the planet so it should be incredibly resistant to scratches or at least as resistant as we could ask, for this is a great material Alright. Thanks again for watching and I'll catch you in the next episode later guys",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Sport",
        "sapphire crystal",
        "Apple",
        "Watch",
        "Sapphire",
        "expensive Apple watch",
        "crystal",
        "Watch Sport",
        "sapphire glass sapphire",
        "standard Apple watch",
        "glass sapphire crystal",
        "expensive Apple",
        "Glass",
        "test",
        "Lew",
        "materials",
        "material",
        "Sport",
        "diamond"
    ],
    "transcript_entity_values": [
        "Ion X",
        "Lew",
        "the Apple Watch",
        "fifty",
        "Teso",
        "Elgg",
        "100 percent",
        "as far as seven",
        "Apple",
        "about three hundred dollars",
        "World a sapphire crystal",
        "two",
        "the Apple Watch Sport",
        "LG",
        "Glass",
        "Watch",
        "Sapphire",
        "This Apple Watch",
        "8",
        "Teso Watches",
        "Sapphire"
    ],
    "transcript_entity_types": [
        "FAC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}