{
    "id": "3sooI3ZFw_Q",
    "title": "Can a $599 camera bring Polaroid back?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-09-07T12:30:02Z",
    "video_url": "https://www.youtube.com/watch?v=3sooI3ZFw_Q",
    "category": "Science & Technology",
    "tags": [
        "polaroid",
        "Polaroid I-2",
        "polaroid camera",
        "polaroid originals",
        "new polaroid camera",
        "polaroid now",
        "polaroid now+",
        "itype polaroid camera",
        "polaroid now generation 2",
        "instant film",
        "polaroid now plus",
        "polaroid now how to use",
        "polaroid film",
        "polaroid now+ generation 2",
        "instax",
        "film photography",
        "polaroid now review",
        "onestep 2 polaroid",
        "polaroid now+ gen 2 instant camera",
        "photography",
        "tech",
        "becca farsace",
        "the verge",
        "verge"
    ],
    "views": 108011,
    "likes": 3846,
    "comments_count": 313,
    "description": "The Polaroid I-2 is a $600 instant film camera that allows users to manually dial in settings. It took five years to develop and has an all new f/8 to f/64 lens plus a new integrated display in the viewfinder and a small screen on the back of the camera. But for as much innovation is present in the I-2 it still struggles to consistently produce great images. #photography #film #technology   0:00 What is the Polaroid I-2? 0:14 I-2 Hardware 1:54 What it feels like to use 3:06 I-2 photo samples 3:43 So what's the big idea? 4:08 problems with the I-2 5:31 Should you buy the Polaroid I-2?  Read more:   If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the Polaroid I-2 here:   Subscribe:  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/3RiOssO",
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/3PwsGkk",
        "http://goo.gl/G5RXGs",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- This is the Polaroid i-2. It's a $600 instant camera with manual controls from Polaroid and it took five years to develop. It's the company's biggest bet in decades. (calm music) The front of the i-2 mostly looks like a classic Polaroid camera, but with a new larger F8 F64 lens. The company claims that this is the sharpest lens that has ever made with better auto focus, using a lidar system. On top of that lens are two dials, one for exposure compensation and the other for adjusting settings such as shutter speed and f-stop. The largest change comes to the back of the camera though. First there's a new integrated display in the viewfinder that shows a light meter, F-stop, aperture, battery life and the amount of film left in the camera to name a few. Yeah, this is obviously very helpful, but with no diopter you're left to find the best viewing angle on your own. And at first it kind of feels like using a microscope or a telescope where if your eyes aren't perfectly aligned you just kind of see strange reflections. And the next big change is this tiny little screen. It's the company's first time including such tech on an instant camera. With only one button, navigating a small screen is annoying, but once I got to know this camera, I almost exclusively kept it in full manual mode, which one button was fine for but is two buttons or I don't know a touch screen, too much to ask for. Outside of manual mode, there is also multiple exposure and timer settings on the screen along with auto, aperture priority and shutter priority settings. Around the back, there's a 2.5 millimeter jack for syncing with external flashes and a USB C port for charging. The company claims a full charge can last about 15 packs of film and well, let's see, one pack of i-type film if you buy in a pack of five is about $14 for eight shots which means that you'll burn through $210 before you'll exhaust a battery. Which brings me to the experience of using this camera. It took me three packs of film to understand how to expose for Polaroid film correctly with the i-2. And during this time I was counting the money lost, $2 there for an overexposed rain another $2 here because I forgot to turn on the flash. And then the pressure of getting the right shot kept me endlessly wandering around looking for a good frame. Not to mention I was also trying to film B-roll so double framing pressure, but that last part's on me. I finally hit my stride on pack three of black and white i-type film. It was at the exact same time that I decided to use my own light meter because I was tired of the camera constantly overexposing which explains the dedicated exposure compensation dial. And although the built-in light meter on the i-2 has been mostly consistent with my light metering app, I never knew exactly what parts of the frame the i-2 was metering for. And generally it took longer to meter than my app. So I've just been sticking to my app. But when you do get a Polaroid properly exposed I mean the results are magic and they're best paired with a lonely guitar and ambient sounds of summer pass. The contrast is high, the colors look aged and the white Polaroid frame is timeless. And the F8 aperture allows for just a bit more depth of field. The problem is you will get a lot of this to get this, and also some of this to get this. Polaroid's native 640 ISO film with a max shutter speed of one 250th of a second has me totally turned around. I had to do a hard reset on my internal light meter to use this camera but I guess that's the whole idea with the i-2. You can set all your own settings and you can get to know the film and the camera and the blur you might get at lower shutter speeds and you can do all of that on a new system that you know is going to work as opposed to buying like a Polaroid 180 that yes has manual controls but also is 60 years old and may or may not work. And then if it does work well its film has been discontinued. But back to the i-2, yes, this camera is new and yes it does have manual controls, but the experience of using the camera still needs to be a bit more refined before I recommend it to others. I've had problems with the camera not spitting out the plastic protecting sheet that protects the top of the film pack. And then because of this the camera doesn't allow me to shoot the last photo of the film pack because it believes it took eight shots already but really it only took seven. That's $2 you're losing. And then the auto focus is hard to navigate because although it is using a single unmovable center point the only feedback you get is a measured distance at the bottom corner of the viewfinder. And if you can get around all of that, the learning curve to getting a properly exposed photo is steep. Like I need a YouTube video in the style of a middle-aged dude in his garage teaching me how to use a power tool in order to figure out how to get this camera to expose properly. Even with a light meter and five packs of film I have still not cemented the proper settings to memory and every shot, it still feels like an educated guess. And lastly, the whole experience of using this camera still feels a bit clunky which you know, most Polaroid cameras do. But for a device that has manual controls and is really like tuned for, you know, professionals to have something fun to use on the weekends I think it requires just a bit too much luck. All of that being said, I do want people to buy the i-2 because I want the next generation i-2. I want the i-2 that has a few more buttons for better navigation. I want the i-2 I can put on auto mode and trust to take a properly exposed photo and I want the i-2 that can count the damn film correctly. If we can get that for $600, it would be exactly the camera that photographers would buy to relax with. A camera that provides a different enough experience from the one we get daily with the system we use for work. And a camera that does it all on what I believe is the most beautiful instant film, Polaroid film. All right, who's gonna buy this camera anyway? I know you're out there. I know you exist 'cause you are me and I am you. Anyway, buds, I hope you're well. I hope you had a great summer and here comes the fall. See you on the next one.",
    "transcript_keywords": [
        "camera",
        "film",
        "Polaroid",
        "Polaroid film",
        "light meter",
        "classic Polaroid camera",
        "Polaroid camera",
        "film pack",
        "light",
        "manual",
        "meter",
        "Polaroid film correctly",
        "pack",
        "manual controls",
        "instant camera",
        "settings",
        "company",
        "packs of film",
        "screen",
        "shutter"
    ],
    "transcript_entity_values": [
        "one 250th of a second",
        "only one",
        "about 15",
        "Polaroid",
        "one",
        "five years",
        "2",
        "summer",
        "a light meter and",
        "three",
        "ISO",
        "eight",
        "F8",
        "two",
        "jack",
        "180",
        "600",
        "F8 F64",
        "60 years old",
        "210",
        "USB C",
        "five",
        "a light meter",
        "decades",
        "YouTube",
        "first",
        "seven",
        "640",
        "2.5 millimeter",
        "First",
        "about $14"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "MONEY"
    ]
}