{
    "id": "3sWxbIDuqTM",
    "title": "The Best Tech Under $500! - June 2017",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-06-09T19:42:27Z",
    "video_url": "https://www.youtube.com/watch?v=3sWxbIDuqTM",
    "category": "Science & Technology",
    "tags": [
        "Best Tech",
        "Tech Under",
        "Gadgets",
        "Cool Tech",
        "Best Tech Under $500",
        "best tech under $50",
        "technology",
        "gadgets under",
        "cool gadgets",
        "best",
        "apple",
        "tech under 50",
        "new gadgets",
        "tech",
        "2017",
        "top 10",
        "Apple",
        "Android",
        "Bluetooth Speakers",
        "top tech",
        "new",
        "tld",
        "jonathan morrison",
        "unboxing",
        "review"
    ],
    "views": 337650,
    "likes": 8621,
    "comments_count": 741,
    "description": "The Best Tech + Gadgets Under $500. Enjoy!  Check out the Ecobee 4 -   The $5,000 iMac Pro :o   Harman Kardon Aura Speaker -  OnePlus 3T Midnight Black -  Blue Satellite Wireless Headphones -  Lifepack Backpack -   Bluetooth speaker track - Carry Me by Sam Berson!   New Dream Desk!   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://amzn.to/2r3G81c",
        "https://youtu.be/CwpUIO8Jz1A?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "http://amzn.to/2sLN3xt",
        "https://oneplus.net/3t",
        "http://amzn.to/2s67J5r",
        "http://amzn.to/2scubdK",
        "https://open.spotify.com/track/5K9fQu1xWgUjZgwPb04jM7",
        "https://youtu.be/_nAL4NB58lA?list=PLqcaiHQwxA9iQ29GmJDV-spxGwp3b7BDt",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, and today I'm taking a looking at five really awesome gadgets that all fall under the price point of five Benjamin Franklins, 500 George Washingtons or if you want to break it down even further, 2,000 baby G.W.s. So first up, if you enjoy home tech, this is right in your wheel house. The Ecobee 4, essentially is what happened if a Smart Thermostat met the Amazon Echo, hit it off, did some things that I'm not really allowed to talk about on camera and out came this. So what I mean by that, is not only is it a really fantastic looking Smart Thermostat. Not only does it feature Voice Integration, it also feature Amazon Alexa functionality built right in. And huge shout out to Ecobee for not only sending this out, but also sponsoring this episode. So of course, being able to change the temperature of your home through your phone, whether you're there or not is awesome. But what if you want to know the weather outside? Now you can ask your Ecobee. Alexa, do I need an umbrella today? - [Alexa] No rain is expected in Pomona today. - Beyond that, what if you're out of toilet paper? Your laptops dead and you don't want to make a trip to the store, did you ever think you'd be able to order that through your thermostat? Well now you can. - [Alexa] Top search results for toilet paper is Charmin Ultra Soft Toilet Paper. 48 double rolls is $21.48 total, including tax. After a discount of $2.00, would you like to buy it? - Now on top of that, let's say you're hard boiling some eggs, you bring everything to a boil, you turn the heat up, but you want to be very careful you don't let those sit there for too long so naturally, you ask your thermostat to set a timer for 12 minutes and boom, you have some hard boiled egg perfection. - [Alexa] 12 minutes, starting now. - Now to take thing up a notch, later this year, Ecobee will be releasing Smart Lights, which also feature Voice Integration and what that's going to do is extend that Alexa Functionality built within the Ecobee 4 throughout the rest of your home. Now as far as the thermostat itself, it's got a big, beautiful 3.5 inch touchscreen that looks great, it's easy to navigate. What's also cool is there are built in room sensors. And what that's going to do is let the Ecobee know when your home and when your not and ultimately, save you money. So at it's core of being a Smart Thermostat, it works great and if it only did that it would be awesome, but because there is Amazon Alexa Voice Functionality built within this, it kind of takes things to the next level. So next up at number two, for those that caught my crazy Galaxy S8 desk set up video, one of the comments I saw most frequently was, what is that crazy looking Bluetooth speaker? This is the Harman/Kardon Aura and some would agree, it does look like a crazy futuristic Bluetooth speaker, while others might say, it kind of looks like a humidifier. Regardless though, I think it looks awesome. And beyond just being able to connect wirelessly through Bluetooth, this also features AirPlay, which is surprisingly hard to find in speakers these days. So if that's something you've been looking for, this might be a really solid pickup. Now because of that crazy circular design, one of the most attractive features of the Aura, is that it's going to output 360 degree sound, which they are claiming will fill an entire room. And for reference, I got it here behind me, which is about, I would say, six to eight feet away. I think it's only fitting we test that out. Warning, things may get loud. (fun music) That is about half way, just a little over half way right now, so we've got some room to go. (fun music) I mean I'm not going to lie, that is filling the room and I think the neighbors are going to hate me. But it does live up to the claim for sure. It packs a ton of clarity, a surprising amount of low end. And as you saw, it does fill the room with sound. I think the only deciding factor would be the looks. Some people are going to love it, some people, maybe it's not their thing. For me, I think it looks awesome, it sounds great. If you're looking to pick one up, I would definitely grab one. So next up at number three, is the OnePlus 3T, in a beautiful stealthy midnight black. And yes, before anyone yells at my face, I realize this came out a little while back, but I have yet to feature it here on the channel. And honestly this might be the best smart phone you can buy for under $500. So if you like specks, if you like ports, things are about to get exciting. This is packing in a Snapdragon 821 processor, 6 freaking gigabytes of RAM. A big, beautiful 5.5 inch display. It is 1080p but that is okay. It has a head phone jack, USB-C, which is also going to get you a crazy fast charge through One Plus's Dash Charge technology, which essentially is witchcraft. Now personally, I've also really enjoyed what OnePlus has done with their OxygenOS. It's clean, it looks great, which is important to me. And you combine that with great hardware, great specs, and a great price, and that is why I think this is one of the best phones under $500. So next up at number four are the Blue Satellite Wireless Bluetooth headphones and these are geared for those who care about sound quality. The same people who won't touch a pair of Beats by Dre headphones with a 10 foot pole because they sound inferior. If that is you, you probably want to check these out. Now hands down, the most unique thing about these headphones is that fact that they are a wireless pair of headphones with a built in amplifier and it does make a difference. Now if I had any complaints, I would say the noise cancellation isn't quite as good as Sony or Bose. It's close but it's not quite there yet. Sound quality is a different story though. I would hands down take these over something like the Bose QC35s. What I don't know is if that sound quality is good enough to take me away from my Sony Hear.Ons, those have been my favorite pair of wireless headphones for a very long time. But at the very least, it does have me rethinking life. Now I think the other big deciding factor for most people out there with these is going to be looks. I think the best word to describe these wouldn't be cool but more so classy. To me, these are the headphone you're going to wear while you're sitting in that relaxing chair, you've got the fireplace on. You've got you're glass of wine to your left. Maybe you're wearing a robe, but at the very least, you're enjoying some high quality music. What's definitely cool with these though, is even though they are a relatively big pair of headphones, they do break down nicely, which make them great for travel. For me, the only thing I would look out for, from what I've seen on Amazon reviews would be build quality, the pair I got is fantastic, but in case you do get one that's a little bit weird, don't be afraid to exchange them. So the audio quality is hands down the best thing about these headphones. Noise cancellation is good but not great and if you like how these things look, they are a really solid pick up. So last up is the Lifepack Smart Backpack, which is this super stealthy looking gadget bag that literally has stealth in the name. Now I'm not going to lie, smart backpacks or tech backpacks in general, sometimes don't always look the most visually appealing but this one actually looks good, also in the spirit of being honest, I tend to make fun of backpack with built in battery banks, especially those that are embedded and kind of attached in the backpack because once it dies, you've got to charge the whole freaking thing. With this guy though, it's actually unique and a little different and it starts with this guy right here. Not only is this the actual portable charger, it's also a Bluetooth speaker and if we flip things one more time, you can also charge it through the sun with the built in solar charger. It's a 11,000 milliamp-hours, so you're going to have a ton of power packed inside this guy. And the way it works is that it pops in the front here, or actually through the back if you want to be specific. Snap it in, right now we are in solar charging mode. But let's say you want to listen to some tunes, simply, oh that didn't sound good, but we're good. Flip things, pop it back in, button your pants up, and now you have a Bluetooth speaker in the backpack. Beyond that is the built in lock, which is going to help you protect your valuables. So if someone tries to take your bag in public, they're going to look pretty stupid. Lastly, the only thing better than pockets, are secret pockets and that is exactly what this backpack has. To the naked eye, this looks like your everyday, standard strap, but nope, there is a secret compartment inside, which is perfect to hid your World of Warcraft figures. Beyond the secret pockets, there is a ton of room for activity. You can store your laptop, your gadgets, your phone, your tablet, and a unless your name is Judner, more than likely, you're going to be able to fit everything you own inside this bag.",
    "transcript_keywords": [
        "Benjamin Franklins",
        "George Washingtons",
        "Smart Thermostat",
        "Alexa functionality built",
        "Ecobee",
        "Bluetooth speaker",
        "Smart",
        "Amazon Alexa Voice",
        "feature Voice Integration",
        "great",
        "Amazon Alexa functionality",
        "Bluetooth",
        "Amazon Alexa",
        "built",
        "Thermostat",
        "things",
        "thing",
        "feature Amazon Alexa",
        "Alexa Voice Functionality",
        "functionality built"
    ],
    "transcript_entity_values": [
        "500",
        "two",
        "Voice Integration",
        "21.48",
        "Smart Lights",
        "11,000 milliamp-hours",
        "these days",
        "the Amazon Echo",
        "Bluetooth",
        "AirPlay",
        "Alexa",
        "Ecobee",
        "six to eight feet",
        "One",
        "the Blue Satellite Wireless Bluetooth",
        "Bose",
        "five",
        "midnight",
        "The Ecobee 4",
        "Aura",
        "a little over half",
        "Ecobee",
        "Benjamin Franklins",
        "Alexa",
        "3.5 inch",
        "2.00",
        "a ton",
        "Galaxy S8",
        "about half",
        "48",
        "Dash Charge",
        "OnePlus 3",
        "10 foot",
        "three",
        "the Lifepack Smart Backpack",
        "first",
        "Smart",
        "OnePlus",
        "6 freaking gigabytes",
        "one",
        "Warcraft",
        "the Harman/Kardon Aura",
        "Charmin Ultra Soft Toilet Paper",
        "George Washingtons",
        "Amazon",
        "under $500",
        "jack",
        "number four",
        "5.5 inch",
        "today",
        "12 minutes",
        "2,000",
        "Amazon Alexa Voice Functionality",
        "Snapdragon 821",
        "Ecobee",
        "Dre",
        "later this year",
        "Sony",
        "Judner",
        "RAM",
        "Pomona",
        "Jonathan",
        "USB-C"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "ORG"
    ]
}