{
    "id": "3UQ8Wnm0On0",
    "title": "Samsung Galaxy Note 9 Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-08-29T18:58:46Z",
    "video_url": "https://www.youtube.com/watch?v=3UQ8Wnm0On0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "galaxy note 9",
        "samsung galaxy",
        "unboxing",
        "review",
        "photo test",
        "dom esposito"
    ],
    "views": 472893,
    "likes": 12358,
    "comments_count": 1819,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys! How's it going? Hi, Dom! - Hello! - How are you? - I'm good. - Thanks for joining the fun here. - Yes. - We had planned on doing another video, Well we are doing one on your channel also, it's about the Note 9 and I was like, well I don't have one yet, and you guys will not believe, this came in the mail today. So I said change everything, we're doing an unboxing. Here it is. Which one did you get? - I also have the same one that you have. - Is it the lavender or lilac? - I think it's lavender purple. - Were they calling it lilac before or am I just crazy? - I think they were, ya. - Okay. - You're not crazy. - I thought they were. - Ya. - I mean this color is amazing! - They're pretty similar. I think this one's a little lighter. - Oh, it is actually. - Maybe just slightly. - This is like a little more purple. So that makes sense. This is a little more lilac. - I like to call this Thanos purple. - Ahhh, yes! (laughs) - So good! So you've had it for how long? - A couple of weeks now. - Are you loving it? I like it a lot, ya. It's pretty cool. - Well I'm so excited that you're here to do this unboxing with me. - Yes, this is exciting. - Okay, so here we are. Oh you also have the Galaxy Watch too! - This guy, yes. - This is so awesome. - This is, ya, this is interesting. I'm actually excited to look at this. So let's see, I know I have a knife here somewhere. - Knife status. - Yes. - That's a knife. - It is. - I was trying to find a purple one, which is weird I don't have a purple knife. Do I even need this? - I just remember it was really hard to get mine out of the little sleeve that it's in. Cut away from yourself kids. - I know, don't cut towards yourself. This is a substantial box So this is the 512GB version. Did you get an SD card for yours? - I have not yet. I mean it's 128GB, like I have a 256GB iPhone and I haven't even used half of it yet. - No, my sister the other day she was like \"My phone's going, it's slow, I think my phone's full.\" And we looked at the storage and it was like, you have a 256 iPhone you've got like 200 Gigs left. - [Dom] And here it is. (Justine humming) - Oh. (both laugh) I was so excited. - I mean, it would have been better if they had it flipped over right? - That's true - At least show off the color. - I mean I would be more excited but I already saw yours and I've seen every single persons videos and unboxings, so this is really not that new information, but for me it is, this is my first touch. - Yes it is your first impressions. - Yes here it is, I do love the color. - The color is nice. - Have you seen anything so beautiful? - I have! - Yes you have! - It's just as beautiful. - It is really really nice. It is kind of crazy, the colors though. It's like, it is slightly different. - [Dom] Just a little bit, yeah that's more of a pink, that's more of a purple. - What else do we have in here? Do we have a pair of headphones? I'm not sure! We definitely got a charger and a little dongle. Adapter whatever you want to call it. - [Dom] Yeah charging plug, wall port. - Oh! Jeez have you guys seen these - Surprise. - AKG headphones! I actually like them a lot. - Yeah no, they're cool. - They're pretty nice - They came with the S9. - [Justine] Oh a nice little-- - [Dom] A cable. - Have you guys ever seen one of these? This is called USB-C, it's fantastic. Very new technology. - That's a little clip to remove the tips from the S Pen. And it comes with extra ones too. - I did not know what this was, when I first did a Note unboxing. Extra little, ear thingies. - [Dom] And that's it! - That's it. Okay, well now that we've got that taken care of, there it is I mean that's the unboxing. I will be doing a further test doing some photo stuff later on. - The camera is nice I have to say. - I'm excited, so what's been your favorite feature do you think? - (laughs) If I'm going to be super basic about it, that feature where you can take a selfie with the pen is pretty awesome. - That is kinda cool. - Like snap it and it takes a picture, like it's really cool. It seems so easy, I'm sure there's like a lot of intricate things. Did your phone just talk to you? - [Phone] Guiding you through the steps - I'm not ready yet, we're chatting about things (laughs) So what have you mostly been doing. Are you doodling? Are you taking notes? 'Cause I don't really think those are things that I would realistically ever really do. - So for me when I get a Note at first, it's always exciting right away and then the novelty wears off after like a couple of months and I'm like I'm not using this. So right now I'm using the heck out of the little selfie shutter button. - That is cool. - But I don't know you know. It could be in a few months and I'm like \"eh\" and just take like a regular selfie. It's cool that you can just take PDF's from your email and sign them. - 'Cause that is probably a struggle that I think a lot of people do deal with. Is trying to sign things, I have a PDF of my signature that I just copy and paste on to things but, what about the camera? So it has the variable aperture, the same as the S9+ which was really cool. I like that a lot. - I mean if you like the S9 camera, then it's the same thing basically. They kinda copied it over which isn't bad I mean you have to, the variable aperture is nice I like the super slow mo a lot. It was on the S9 as well, so that's pretty cool too. The camera overall, it's pretty good. - It is a really good camera. - It's up there for sure. - The live focus versus the portrait mode, in different situations and different hair colors so for blonde hair the portrait mode on the iPhone does not like it. (laughs) It works way better on my sister whereas this one it works pretty well with both hair colors. - I would say this is definitely top 5 for me. As far as cameras go, and even all around smartphone and I know the year is not finished and there's other stuff that's gonna come out but right now I mean, they've got it going on. - They do and this color is great. it's so good! - We do have this, should we jump into this real quick? - We might as well! - [Dom] Okay jump in, I'll let you do the honors. - [Justine] Ooh thank you oh my god! I won't cut anything. - I don't think you have to cut it, I don't think there's any tape. This one's much easier to get in to than the other box was. - So usually I never have to cut anything but I cut everything. (Dom laughs) Oh yeah this is way easier. Ta-da! Whoa! - See that's cool they actually give you the product right up front. - [Justine] That looks really good, do you want to take it out? - [Dom] Okay. It actually looks pretty cool. It's a little thick. - It's big. - It's a little thick. - So for the first few years of the Apple Watch I didn't realize that I should not have a large version. When I finally switched to the 38mm I was like, this is the perfect watch. I didn't even realize how massive it was. - The 42mm is pretty big. - It's huge and I had no idea. I just thought I needed to see the screen but no, that's unnecessary. - So I think these come in a few different colors so this is the silver one obviously but then they do have a black one, and a rose gold version as well. - Rose gold! - Yeah they have rose gold, I know. - What! - It looks pretty nice though, I will say one of my favorite things about the Samsung watches as of the last year or two I guess, is that you can navigate using the thing. - [Justine] That is cool. - You can go through the menus and stuff, using that. But this one actually looks like you know a real watch I guess, aside from the screen. - Let me see though, that's so nice. Whoa whoa whoa! We've got something happening! It's light, it doesn't feel very heavy either. It's big. - It is 46mm I think. - Wow! - Yeah 46 millimeters. That's even bigger than the biggest Apple Watch. I guess it just depends on the size of your wrists. - I mean yeah, it fits you. - Yeah. (both laugh) I do like what they, I dunno It just looks normal and from what I saw on the internet it actually makes little ticking noises, like an actual watch does. - Oh that's cute. - Apparently. - I'm in to that. - Yeah let's see, you can like I mean I have to set this up and stuff but you can move up and down and stuff with that little rotating bezel which is kinda cool. - That's cool, I love sort of the normalization of smartwatches like Michael Kors has them, I did a video about that and I was like, I love Michael Kors watches but since the Apple Watch this is basically all I've been wearing but with that it also works with Apple because using just like the Android Wear you can still use your iPhone too. Were there any health benefits was there like-- - It does track all the things, you know if you're sleeping or like your R.E.M. cycles and stuff like that. It obviously has a little heart rate sensor on the back there that can check your heart rate throughout the day. Actually when they sent it to me it came in like a Nike gym duffle bag. - Oh that's cool! - So like they're kinda pushing the whole health aspect of this thing a lot. They realized the trend of Fitbits and fitness bands are kind of going down, so they're trying to step up and take that spot with watches like this. - Yeah and the only way that I think those sort of bands will come back is if they start tracking things that these can not like oxygen levels, dehydration, like those types of things like blood sugar those are the only that I feel like those are going to take over the smartwatches. Especially if every brand is basically coming out with them a smart thing. - I would love if there was a fitness band that was specific to fitness that would help you track all those things. - Yeah that would be cool, yeah. - But there's not that I'm aware of actually. - Yeah, not yet. - I keep seeing all these crazy fitness things coming out and I'm like, where are we going to put this. They've got like fitness mirrors, like crazy things just sort of extend out of it to work out. - Technology is crazy. - It's amazing, I just wanna be a robot. - Yes, we will some day. - We will! - We'll all be robots, they'll take our brains out and put it in to like-- - The cloud. - Yes, the take us to the cloud. - I'm down, and I'm ready. Well thank you so much for joining me, thank you so much for bringing this. I'm excited to try out the new phone and make sure you go check out his channel because we're going to be doing another video on yours and it may have something to do with that. So we'll see. - Possibly. - Okay, I'll see you later and let's cut to some photo tests. (bright pop music) Hey! Welcome back to Santa Monica. We're here with the phone. Now that I've unboxed it, as you guys just saw, we're gonna do some photo tests I'm just gonna run through a few things. One of the highlight feature for me for this phone is you can store up to a terabyte of data which is kind of incredible. I got the 512GB model but you can upgrade it to another 512GB which will give you so much space that I'm not really sure if you're going to even know what to do with it. You can probably see Jenna in my glasses there, say hi Jen. (laughs) We also got our Super 73 bike, so we're going to be riding around town getting some photos and some video tests. I'm excited to try out the slow mo. The super slow mo. Should we try that out? Do you want to super slow mo me on the bike? - [Jenna] Oh yeah. - Okay cool, let's get started. (bright pop music) So here the front facing video I hope that the wind isn't too loud, but so far really really into the video. If you guys liked the Samsung S9 video camera this is basically, I think it's very very similar if not exactly the same. There's Jenna. Now let's switch to the back camera and see Jenna here in a second. There she is everybody, there's Jenna. - Hello! - What's going on? - Filming. - So I'm gonna zoom in and see what this looks like 2X's zoom. She looks great. (bright pop music) One of the things that I like about this camera is it'll identify what it's taking a picture of. So when I was at lunch it noticed that I was taking a picture of food, so it kind of auto generated settings that would look best for taking photos of food. Shall we cruise on? Maybe we head home and... Take some photos in the backyard? (laughs) Because it's too hard to do things out and about. Especially on a bike. 'Cause people keep wanting to stop and talk about the bike. And then they see we have a big camera, and then they're like what are you filming and then a lot of things happen. I just I don't think I should ever leave my house again. Let's go home. (bright pop music) So we made it back home, I should just shoot all of my videos out of here because (laughs) it's the perfect lighting, no people are bothering me, and I'm in very uncomfortable position. - [Jenna] Did you spill? - I spilled, I'm a hot mess. Matty who's a good boy? So you can turn the background focus off or on. Who dropped their bone? Good shot, and you can go back in and adjust the background focus afterwards. I will say sometimes these photos look way better on this Samsung phone and then you share them out and they don't look as good, because the screen on this thing looks so incredible. See here's another one, you can also do the closeup or you can switch back to the other camera because there are two cameras in here. So this would be the wide angle, this would be the closeup with the background focus blur. Look at this dog! - [Jenna] Is he gonna post it on his Instagram? - I think he will. Hey are you digging? Let's see what else we can do. The super slow mo looks really good. Oh ho buddy, you're so cute Matty. So you guys remember the AR emoji. These things, I'm sorry, they're extremely creepy there's no doubt about it. If anybody disagrees you're crazy because lets make one of myself. Ready, so smile with my lips closed and give it a whirl (laughs) Wow okay, here it goes! (laughs) Oh my god I'm going to be that in a crop top. (laughs) Wow, okay I'm going to save it. - [Jenna] I don't love it. - I don't love it either. Okay, so this is my AR emoji. Uh, wow. I mean I definitely think that I might not be okay. What's happening, oh look I can show you my feet. No tongue detection. Wowee, this is a look. Like half of my mouth is working, my eyes aren't working properly. Are my eyes blinking right now? Okay well that's good, I got a lot of eyeliner on. I don't ever want to see that again. Okay so here, ooh look at that that's the breakfast pic. Wow that bacon looks super crispy. And these photos are very very detailed. That looks very nice. There you are. - [Jenna] I don't look happy but I know I was. - You don't but that's okay. Here's the super slow-mo bacon These look really good, oh look at you I think that's cute. Oh man I'm re-living this meal, this is delicious. Yeah these look pretty good. I feel like the coloring does not, like the skin tones on here do not look very good. Another cool thing that I like is that you can make GIFS from videos which is so easy to do. All you have to do, so find the video that you like, you swipe over here on the little panel, you click animation, you pick the section that you want to make into a GIF, click record, and then stop. Guess what, you've got yourself a GIF and you can save it, share it, do whatever you want. That's not really a new feature, you could do that in the S9 as well but I think it's pretty fun, so here it is there's my GIF. They see me rollin' - [Jenna] That's a good one I like it. - It is a good one, I made that in 2 seconds. I'm so talented it's shocking (laughs) Okay thank you so much for watching, make sure you go subscribe to Dom's channel and go tell him that I said hello. Huge thank you to him for coming over and doing this unboxing with me. I will probably be posting some more photos on Instagram and Twitter. Oh I forgot to try out the selfie! The remote's pretty cool, anyway I forgot what I was saying. Subscribe to Dom, subscribe to my channel, click like on the video, hit the bell, I don't know. I'll see you guys in the next video, bye! Let me know what you think of the Note 9, I'm into it. I don't know where I'm going actually I was just, I gotta go this way. I was trying to exit the video and you called me out. - [Jenna] You're like, where are you-- - I don't know! (laughs) - Okay bye, I gotta go out of this video now (laughs)",
    "transcript_keywords": [
        "things",
        "cool",
        "good",
        "yeah",
        "pretty",
        "video",
        "pretty cool",
        "camera",
        "lot",
        "nice",
        "thing",
        "Watch",
        "guys",
        "super",
        "Apple Watch",
        "kind",
        "excited",
        "Cut",
        "crazy",
        "phone"
    ],
    "transcript_entity_values": [
        "ho",
        "a couple of months",
        "Super 73",
        "Matty",
        "A couple of weeks",
        "Gigs",
        "Nike",
        "one",
        "One",
        "second",
        "USB-C",
        "S9",
        "Like half",
        "Apple",
        "Justine",
        "38mm",
        "256",
        "Thanos",
        "iPhone",
        "Instagram",
        "the last year",
        "46 millimeters",
        "the Android Wear",
        "2 seconds",
        "Michael Kors",
        "the day",
        "Dom",
        "2X",
        "5",
        "Twitter",
        "Justine]",
        "Samsung",
        "the first few years",
        "46mm",
        "the Galaxy Watch",
        "half",
        "S9",
        "Wowee",
        "Adapter",
        "Jen",
        "256GB iPhone",
        "200",
        "SD",
        "Ta-da",
        "today",
        "128",
        "two",
        "Dom",
        "42mm",
        "the S Pen",
        "first",
        "a few months",
        "Santa Monica",
        "Apple Watch",
        "PDF",
        "Jenna",
        "512",
        "some day",
        "GB",
        "R.E.M.",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "EVENT",
        "ORDINAL",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "ORG"
    ]
}