{
    "id": "3vorrcoJWnQ",
    "title": "The CPU You Pay For Twice",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-12-03T18:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=3vorrcoJWnQ",
    "category": "Science & Technology",
    "tags": [],
    "views": 490578,
    "likes": 24330,
    "comments_count": 1647,
    "description": "Learn through problem-solving, and the first 200 people can save 20% today on Brilliant at   Intel once tried to get consumers to pay to unlock additional CPU features. Could they be doing it again?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Secretlabs Gaming Chairs:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  TechLinked:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/SecretlabLTT",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/GMGLTT",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- When you think of upgrading a component in your PC, you probably think of something pretty straightforward. Take out the old one, insert the new one, and then just carry on computing as usual with better performance. But unsurprisingly, companies have long schemed to sell us upgrades by making us pay again for stuff we already have. Just ask anyone who's ever purchased a Tesla. But did you know that Intel was actually guilty of this not too long ago and that they might be doing it again? Back in 2010, Intel launched a program called Intel Upgrade Service, and it might sound like they'd send someone out to your house to swap out the CPU, but no. What it actually entailed was the user paying extra money after they bought the PC to unlock certain capabilities of the processor. Originally, if you had a system that came with a Pentium installed, you could pay 50 bucks to buy an upgrade card, which kind of looked like a gift card from a major electronic store. The card had a pin on it that you'd enter on your PC, which would enable additional cache on the CPU that was already there, as well as turn on hyper-threading, effectively turning the Pentium into a slightly lower clocked Core i3, with a few other CPUs added to the program later on. Needless to say, this did not sit well with a lot of tech industry observers. Some saw it as a blatant money grab, and that isn't surprising because that's kinda what it is. There's just something about paying more to unlock a product you already physically have that intuitively doesn't sit well with a lot of people. I mean a heated seat subscription, really? Others weren't quite as upset, but pointed out that just buying a Core i3 was only $15 more than one of the Pentiums that were supported by the program. But to be fair to Intel, the program was aimed at folks who were buying lower end PCs. Many of which were laptops with CPU's that were permanently soldered in. Those customers may have wanted to upgrade later when they could afford it instead of buying a whole new machine. But regardless of whatever Intel's intentions were, the program was never very popular, especially considering the upgrades were tied to a specific motherboard, making moving an upgraded CPU to a new system a pain and the program was discontinued a year later in 2011. But could it be making a comeback? Intel recently announced a new program called Software Defined Silicon, an undoubtedly fancier name than Upgrade Service, but it's a relatively similar scheme for Xeon processors. In case you weren't familiar, Xeon is Intel's workstation, server, and data center CPU line and team blue really tries to sell the scalability aspect of Xeon. In other words, Xeon CPUs are supposed to easily handle significant workload increases, whether it's through running more virtual machines or simply adding more processors to a multi socket board. With machine learning becoming more and more important, Intel is touting Xeon's flexibility as AI becomes more complex. So it would make sense, at least from a business perspective, for Intel to try and sell upgrades for Xeon that you could just unlock with additional money rather than having to go out and buy more silicon and send someone down a long hallway and crack open a server, and oh, it's just too much work. But why are they doing it now? Well, Intel is building quite a few new chip fabs and getting into an entirely new product lineup, discrete GPU's. And those things cost money. Going to this quasi subscription model for some of their CPUs, brings Intel a more consistent revenue stream than just the processor sales themselves. Not to mention it's cheaper to just make one model of a product and have the buyer pay for a built-in feature later if they want it. (sigh) Economy of scale. But it still isn't clear exactly when we might see Xeons with software fine silicon hitting the market. Nor is it clear if this kind of program will rear its ugly head again in the consumer oriented CPU market. But with so much of the tech world moving into the buy now pay forever model, it might not be the most far-fetched thing. Thanks to Brilliant for sponsoring this video. Brilliant is a website and app that makes learning accessible and fun. They use active learning with problem solving and interactive visual concepts that don't rely on grades or long lectures or strict time limits. There are over 60 courses on everything from astronomy to programming with Python. One of the courses we suggest is Calculus In A Nutshell. That course gives you a clear sense of the major pillars of calculus, limits, derivatives, integrals, and infinite sums. Now with more interactive sections. Using Brilliant, you can master subjects instead of just memorizing the answers. Join a community of 8 million learners and educators today. The first 200 people who head to Brilliant.org/techquickie will get 20% off an annual premium subscription. Thanks for watching guys. Like, dislike, check out our other videos, maybe comment with some video suggestions and don't forget to subscribe and follow.",
    "transcript_keywords": [
        "Intel",
        "Intel Upgrade Service",
        "pretty straightforward",
        "Xeon",
        "upgrading a component",
        "CPU",
        "program",
        "Upgrade Service",
        "Xeon CPUs",
        "called Intel Upgrade",
        "program called Intel",
        "Upgrade",
        "CPUs",
        "Intel Upgrade",
        "upgrades",
        "long",
        "pay",
        "money",
        "program called",
        "Brilliant"
    ],
    "transcript_entity_values": [
        "over 60",
        "Software Defined Silicon",
        "Intel",
        "Python",
        "One",
        "one",
        "Tesla",
        "20%",
        "Core i3",
        "Intel Upgrade Service",
        "Nutshell",
        "AI",
        "200",
        "annual",
        "Xeon",
        "only $15",
        "first",
        "2010",
        "Upgrade Service",
        "8 million",
        "Pentium",
        "Xeons",
        "a year later in 2011",
        "GPU",
        "CPU",
        "50 bucks",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE"
    ]
}