{
    "id": "3VSkUMDJzfQ",
    "title": "Building a LEGO Luigi set with Ro!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-08-21T21:48:32Z",
    "video_url": "https://www.youtube.com/watch?v=3VSkUMDJzfQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 147590,
    "likes": 4822,
    "comments_count": 261,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Oh, boy is this an exciting unboxing? So the Lego Super Mario Lego kits, are honestly like a dream come true from my childhood. And I actually got to make a dream video come true where I turned my entire living room into a Super Mario Lego course like it's the coolest thing ever. If you guys missed that video I'll put a link in the description. But I just wanted to quickly show you guys the new, Luigi Starter Course you basically need one of these starter courses. But then from there you can expand into all of these expansion sets. And there are so many. This is one that I was very excited to check out. This is Bowser's Airship. This is going to be so fun to build. And now they release Luigi. You can actually team up for new adventures. So you can connect them together to play with a friend. There's a pink Yoshi in this starter course. No way. Oh, that makes me so happy. So cool. My favorite thing about these sets is that it connects to an app. So you do all of your building there and it's cool because it's all 3D. So you can kind of spin your little bricks around and you can see where things are supposed to be placed. Here's Luigi's little body. Oh, there he is, look at him. Look at him. Look at him. That is so cool. Are batteries included? Because- Is this is going to fit in there? Yes. - [Luigi Toy] Lego Luigi time! - Ah! Lego Luigi time! Here's his little pants his hat his ears. His suspenders. He's all set. Look how cool. (Lego Luigi beeps) - He got dizzy. Okay. Lego Luigi is super cool. Now let's open up Mario. Here he is. - You look great, Mario. (toys beep) God, I'm so excited about this. Like honestly, I oh, it's going to be so cool. Have you seen the Lego Mario? Like the actual Lego sets? - Well, I've seen them online, not in person. - Well, guess what? There is now a player two. And they have a Lego Luigi. - No! - So I already did the unboxing already. - Okay. - So here's the Lego Luigi and here's Lego Mario and I'd love that they like, okay like Luigi's a little bit taller but like he's barely, barely taller. - Luigi is taller. I really appreciate that. It's just like a little bit more but he is taller. - So I already started this video. That's why they're - Look at this! - They're in these pre-packaged Ziploc bags. This is going to be so much fun because the best part about this is you can actually link this to an app. And you know how like old school Lego sets you used to have to actually use the paper instructions? - Yes, yes. - No, you link this up now to the app and you can go through step-by-step and you build the sets virtually. And this entire Lego Mario universe is really expansive. Like there's tons of sets, but to do all of it you have to have the starter pack. - And this is it? - This is it. - This is the starter. - Okay. And what's so great about this app like, check this out. We just like, go through and it'll give you all of the pieces, digitally. Like, look how much- - This is awesome. - Easier this is. Okay. Oh, this makes it a lot easier. - So much easier. So there's these little QR type code things here which are really cool because this is how Mario and Luigi know what enemy this is. - This symbol? - Yeah, it just scans it. So check this out. - Oh. (Lego Luigi beeping) - And you get coins. - The noise. - I know! So now we need to put the pipe together. - Oh, I did this wrong. It's okay. - Then green. - Okay. Here we go. - Put it on the sides. (Lego Mario snoring) - He's tired. - It's motion activated too. So like it'll, it can tell whenever you move it and stuff. There's so many different steps. So this is the flag. And I think we just jam that in there. Let me just snap the flag on. - Look at that. - So we have our start and end. So here it's showing you how to do it. So they've got a little connector thing here. So this is kind of a super basic course. So we're going to start with this. Look, they have little flowers. You can make little flowers. - Oh my gosh, I want to make one! - Yeah, this is cool. - Oh my gosh. These are so cute. Oh, where do I put them? - You can put them wherever, really. - Boop. - Okay. Now, this is the real demo. Okay. Start. - [Lego Luigi] Here we go! (Super Mario Bros theme music) - I love it. - And it's got the music and everything. I love this. - It's so great. Okay, check this out. So now we're going to be opening up. Let's see, number three - Three. It blows my mind, how far Legos have come from when I was growing up to now. - I messed up. - Oh, oh oh. - There we go. - We can fix it. - Fix it, fix it, fix it. Did it. I just can't wait until you see how cool the courses are. - They're so excited. Look, they're partying over here. They're like, yay! - They are set. Okay. Next up. We are going to be making pink Yoshi. - Yay! - This might be my favorite. Okay, so do you have- - What is Yoshi, a lizard? A dragon? What comes out of an egg? - Is he a dinosaur? - A dinosaur? Some kind of a reptile. - I've never thought about what Yoshi is. I think he's a dinosaur. - He's probably make believe. - Wait, I put the eyes on. I don't think I was supposed to do that yet. No? Yoshi has a lot of parts. Yoshi has a lot of parts, and then we put Yoshi body. So Yoshi is all put together. Now, it's great because all of the stuff obviously works together. (toys beep) - [Lego Luigi] Okey-dokey! (Lego Luigi playing music) - Coin box. (Lego Luigi laughs) - Are you awake? It's so great. - Okay. So there's still more to put together. So let's, you're setting this up and then we'll get our course all ready. - Here is good? - That's nice. That's perfect. Cool. We've got all these little connector pieces. - Okay. - So we can do like, one of these. So now this is kind of fun. - I love it. So you can make your own course any way you want it. - And what's neat is this little contraption here will allow you to like, go like this so you can collect points when he's on here. - Look at this, does it do this? Woo, woo. But it's spins. - Maybe let's switch this. - Okay. - To like, this little small one so that I can put that here and connect. How's that look over there? Is that nice? - That's really cute. So the cool thing is, when this first came out there was only Mario. But now with the addition to the Luigi set you can actually sync these all together. So there's a bunch of different things that you can do. When you go into the two players so you can connect them together. You can move them together. You can defeat enemies together and then you can just do like the different platforms. And it's so cool because you can actually play with two people. Here's our start pipe. - Okay. - So I'm going to go through the course. And as soon as we hit the start it's going to put 60 seconds on Luigi and Mario's clock. And then you collect as many coins as possible. Okay? I'm going to go first. And then after I run the course then you can go with Mario and we can see who gets more points. - Okay, cool! - Ready? - [Lego Luigi] Here we go! (Super Mario Bros theme song) and then he's gonna fly over here. Basically, you just want to tap on it a lot so you can get a lot of coins. And then look, it shows up on the app. - Oh, yeah! - So I only got 15 coins but this shows you everything that I ended up getting. Go for it! - Ready, set, go! - [Lego Luigi] Here we go! - Yeah! (Super Mario Bros theme song) Boing, boing, boing, boing, boing. Somersault! Oh snap! Whoa, whoa, whoa, whoa, whoa, whoa - [Both] Oh no! - You're running out of time! - Wow. - You got 35 coins. That's incredible. - I love this. - Another cool thing which we didn't even show you yet, is this there's different outfits that you can put on Mario and Luigi to change, their whole not only their look but how they interact with things. This is the Bee. - You think he's going make a new- - Look! (Lego Mario buzzing) - I wonder if they have that cool fireball outfit - They do. - Overalls? - Yes. It's white and red. - It's white. - Yes. I almost brought that one but I thought it might be a little aggressive. Well, that's it. We put it together. They have so many more sets that this is honestly like, just the beginning. - I wanna do a whole room of this. I want to do a whole we can make a whole video game. - We could because- - We can make every level. - You have so many different sets and you only need the start and the finish and you can build everything in between. It's so, so, so, so cool. We might need some friends to help us put these sets together. - Ro, thank you so much for building with me. This was so much fun. - Thank you for bringing these over this blew my mind. Literally, smart Legos. Justine shows me smart tech all the time with I already said coffee, mugs, gadgets, but now Legos. - It's so, so, so cool. Well, thank you so much for building and thank you guys for watching. Make sure you go check out Ro's channel. We have done so many fun videos on hers and I'm so glad that there's now a player two. Yeah, now we can play together. - Will you be my player two? - Will you be my player? - Will you be my player one? - No, you're player one. I messed that up. I will be your player two. (mellow techno music)",
    "transcript_keywords": [
        "Lego Luigi",
        "Super Mario Lego",
        "Luigi",
        "Lego",
        "Lego Mario",
        "Mario",
        "Lego Luigi time",
        "cool",
        "Mario Lego",
        "Lego Super Mario",
        "put",
        "Mario Lego kits",
        "Yoshi",
        "sets",
        "Lego sets",
        "make",
        "Super Mario",
        "entire Lego Mario",
        "Lego Mario universe",
        "Legos"
    ],
    "transcript_entity_values": [
        "Yoshi",
        "Justine",
        "Luigi",
        "Yoshi",
        "Bee",
        "Lego Luigi",
        "Lego Mario",
        "Boing",
        "Lego",
        "Bowser",
        "Luigi Toy",
        "Legos",
        "Lego Luigi",
        "Mario",
        "Lego Mario",
        "two",
        "60 seconds",
        "first",
        "Yoshi",
        "35",
        "Ro",
        "15"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}