{
    "id": "3XI6W-soL6A",
    "title": "Nintendo Switch Charger!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-04-10T15:14:45Z",
    "video_url": "https://www.youtube.com/watch?v=3XI6W-soL6A",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "nintendo switch",
        "switch charge",
        "nintendo switch portable charger"
    ],
    "views": 199387,
    "likes": 6250,
    "comments_count": 665,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going, it's Justine, and today I'm doing an unboxing video, and yes, I'm in my kitchen because I was shooting cooking videos, but this is something that just came in the mail. I ordered this over a year ago. This is a Nintendo Switch battery charger. Nintendo Switch came out March third, 2017, and shortly after one of the things that people were really, really wanting was a battery charger. So, I saw this on Indiegogo, this is the Switch charge. I ordered this on April fifth, 2017. And I guess there was some production issues, because it was supposed to come out very shortly after, but now, a year later, it finally came. I actually forgot about it. And to be completely honest with you, I never really had that many issues where I was like, shoot, my Switch is dead, I don't have a charger. I always have a charger. What's great is that Mofi has tons of USB-C chargers. So this right here, USB-C charger. If my Switch was dead I would always have one of these as a backup. So it has a kick stand, 10,000mAh battery, additional cards slots, LED charging indicators, and phone charging. So since I've been pretty invested in this, I was really excited when saw that it finally had shipped. Obviously, when you fund Indiegogo or Kickstarter things, they never come on time, and usually the product inside ends up not being to your expectations. Since this did take longer than expected I'm hoping that because of that they made sure that they ironed out all the kinks and everything is working properly. I do like the packaging, and the blue and the orange from the original Joy-Con colors. (grinding) (rattling) Kay, let's open this thing up here. (popping) (clatter) Oh I have a a little note. \"Dear Switch Charge Backers, It's been a long hard journey to get here, but we finally have a product with we are proud, and we hope you will enjoy. We want to say a massive thank you for backing our project, without all your support, The Switch project is blown away by your patience.\" A lot of patience. But I would rather wait for this project up to some high quality standards, than to receive a product that is crap. Here it is, so, (clunk) (crinkling of plastic) I love this carbon fiber case, I am already super into it. Oh man, I wish it had little straps, so that I could carry it. Like a little handle. If this was a handle, this would be the perfect case. (zipping) Wow. This actually looks really good. This is almost identical to the case that I have already. It has a nice little place here to put some games. Here, wow, this is definitely way nicer than I thought it was going to be. So already I am super excited. This looks really, really good. It's got a USB-C cord here, and they have also included some nice little screen protectors. Which I think is very important. I already have one on here, but I did a very bad job of putting it on, so for the past year I've just been staring at these bubbles and questioning my life's existence. One of the things I already like about this, I haven't even showed it to you yet, but has a kick stand. The kick stand on the Switch (click) that comes with it is very, very flimsy. I play my Switch a lot when I'm on flights, and I like to play it like this, and I like to have my remote controller here, so as soon as turbulence, there was a time I was heading back from Hawaii last year and this thing just went, (rattle) (clink) And just folded onto itself. And I was in the middle of a Bowser boss battle. Excuse me, I'm doing very important things. I can't be having this happen. Here's a little LED indictor that will show you how much battery life your Switch charger has. It also has two USB ports, here's USB-C, and here is a regular USB. This will not only charge your Switch but it will also charge anything that is USB powered. So, you can charge your Switch and your phone at the same time. So we lift this upright here (snap) put our Switch in. It is definitely heavier with this battery charger on it. Oh this is absolutely perfect. (creaking) So it does seem like if it gets too far, it's gonna kinda of get flattened. This is probably my favorite hidden feature, there is a little card slot holder so you can hold your cartridges, most of the games I download, but there are a few like Mario Cart, and Zelda that I do have on cartridges. So, there's two slots here for games. You'll definitely get an arm work out if your gaming with this charger on, because this is a little bit of added weight. I'll put a link in the description if you guys want to check out their Indiegogo link. It's nice because you still have access to everything up here at the top. You have the game card, you have your headphone jack, and also the fan is exposed too, so that will allow this not overheat. You've got your volume buttons, and your power buttons. This is pretty well designed. It was definitely worth the wait. But I also forgot about it, so kinda didn't really even effect me that much. Well, Ladies, thank you so much for watching, and thanks for a bunch of you guys, because I remember when this first came out, you guys tweeted me this so many times, you were \"Justine, you have to get this.\" And I did and it's finally here, so I wanted to give you guys an update. And yes, I do see you guys in the comments saying \"Justine, please make more Switch videos.\" I'm really sorry. I do plan on making a few more for you guys. I am so excited because Nintendo Lava was coming out very soon. Well that's it, I'm gonna go charge my Switch. And I will see you guys later. Thanks for watching. Bye. (techno music)",
    "transcript_keywords": [
        "Switch",
        "Nintendo Switch",
        "Nintendo Switch battery",
        "Switch battery charger",
        "charger",
        "shooting cooking videos",
        "Switch charge",
        "battery charger",
        "shooting cooking",
        "guys",
        "Dear Switch Charge",
        "Switch Charge Backers",
        "charge",
        "USBC",
        "Nintendo",
        "battery",
        "Switch battery",
        "Dear Switch",
        "Hey guys",
        "USBC chargers"
    ],
    "transcript_entity_values": [
        "Kickstarter",
        "Mario Cart",
        "USB-C",
        "Switch",
        "a year later",
        "Justine",
        "Hawaii",
        "Zelda",
        "Indiegogo",
        "Kay",
        "jack",
        "last year",
        "Bowser",
        "March third, 2017",
        "Switch",
        "Nintendo Switch",
        "Mofi",
        "the past year",
        "two",
        "Indiegogo",
        "April fifth, 2017",
        "Dear Switch Charge Backers",
        "this over a year ago",
        "first",
        "Nintendo Lava",
        "10,000mAh",
        "USB",
        "Joy-Con",
        "One"
    ],
    "transcript_entity_types": [
        "LOC",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "LOC",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}