{
    "id": "3yEP4ooj1WI",
    "title": "OnePlus 11 Review: They're Back?!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-02-07T15:15:15Z",
    "video_url": "https://www.youtube.com/watch?v=3yEP4ooj1WI",
    "category": "Science & Technology",
    "tags": [
        "OnePlus 11",
        "OnePlus",
        "MKBHD",
        "flagship killer",
        "OnePlus vs",
        "OnePlus 11 vs",
        "OnePlus 11 review"
    ],
    "views": 4111223,
    "likes": 124682,
    "comments_count": 7464,
    "description": "OnePlus 11 is a flagship for $699  MKBHD Merch:   OnePlus 11:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Phone provided by OnePlus for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://geni.us/xJWn9XK",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- I was kinda wondering how long it would be before I could say this again, if I'd ever say it again, but OnePlus is kinda back. So this is the new OnePlus 11. Now people who have been following the industry for a little bit already know the story behind this phone, which is OnePlus starting out hot as a fan favorite, with A-plus bang-for-the-buck, flagship-killer type of phones, peaking, I'd say, around the OnePlus 7 Pro, which is my phone of the year, and then slowly descending into the very generic expensive flagship that they swore to kill. Their last attempt at a phone, the 10T, is literally the worst phone that came out last year, one of my bust of the year, and they got a trophy for it. And apparently, they've used this as motivation. They keep saying, oh, now they wanna redeem themselves. Now they're gonna turn it around, and great. Like I think we all know the next phone was already in the works by the time they got that trophy. But if you wanna gimme some credit, I'll take some credit, sure. But the point is, they're sort of reflecting shades of old OnePlus, which is a really good thing cause this phone is really good. So this is a flagship smartphone right now for $699 in a world where the Galaxy S23 just came out, it's $799. That's a sort of a defacto default for a lot of people. My semi hot take is this could be a better phone for a lot of people. Now it's not perfect, and they still do some classic corner-cutting things to pull this off, and there are still some software behaviors that I really do not like, but here are the basics. So if you want just a classic spec sheet bang-for-the-buck summary, this phone has a Snapdragon Eight Gen Two with eight gigs of RAM, a 6.7-inch 1440P 120 hertz OLED display, triple cameras and a 5,000 milliamp battery with 80-watt charging for 699 bucks. That's pretty damn good. So I think because the phone has like the nice screen, the big battery and the newest chip, it begs comparisons to like the $900,000 other flagship phones. But like I said, it does cut some corners. The big one being no wireless charging, huge. And then the other, it's IP64 rated instead of IP67 so it'll survive a mist better than a splash. But on the design front, I'd call this a mixed bag. It definitely is taking a step away from the ultra generic last generation. The Hasselblad branding is back, and we'll talk about the cameras in a minute, but also the alert slider is back, literally an iconic OnePlus feature that they somehow thought getting rid of last time was a good idea. This one also has a very slightly textured matte black finish on the back. Not quite sandstone level but enough to be interesting. So I like it. And the camera bump. The camera bump is kind of a weird hybrid of smoothly wrapping around the side like Samsung used to but then turning it into a big circle plateau that looks like a generic not seamless thing anymore at all. It's whatever, I don't mind it, it's fine. But you're not here for the back of the phone though. Like honestly, if you just saw the back and saw the lack of wireless charging and a slightly awkward camera bump, it feels like a $699 phone, sure, but the front is where it gets way more impressive. 6.7 inch corner to corner, thin bezzles with a slight curve over the edges. I wish it was flatter but it's not too bad. 1440P resolution, 120 hertz LTPO OLED, 1000 hertz touch sample rate and 1300 knits peak brightness that's visible outdoors in all but direct sunlight and that little corner cutout for the selfie camera, that's nearly as good as you can ask for these days. And actually using a phone, it's very snappy and smooth. It's got the fingerprint reader on the display in just the right spot. It's fast and OnePlus went a little over the top with like the future proofing of the highest end fastest internals. It's good details like this phone has not just wifi six or wifi six E, but the brand new wifi seven. Not just UFS three but UFS 4.0, the fastest storage and not just LPDDR five, but LPDDR five X, the fastest memory available. So this is legitimately very snappy and it's a quick phone brand new, but then because of those high end internals, I do expect the headroom to age pretty well. The Snapdragon Eight Gen Two has proven to be a pretty good chip. Like the other phones that have had it so far have been really good phones and this is too. It's a powerful chip and the GPU is great, but also it's been pretty efficient and that's affecting the battery situation. And I think for battery on this phone, this is where it feels the most like old OnePlus. So the OnePlus 11 has a 5,000 milliamp battery, great battery life. So if I use it like normal maxed out high brightness 1440P and 120 hertz on, I'm making it to the end of the day fine, no problem. When I go 1080P and still 120 hertz, I was able to get two days outta this phone. Matter of fact, I'm on the second day right now, it's almost noon, I have 31%, that's pretty good. I'm getting to the end of two light days with like seven, eight hours of screen on time, fine, that's really good. And then for charging in the US, this one has 80 Watt charging. I think in China, other versions have 100 watt charging and there's a difference in electrical standards but super fast charging. So if I ever found myself thinking oh, I need a little extra battery, it's kind of low right now, it was rare but I could plug in for a few minutes and have more than enough. It is that Oppo Super V charging tech so it's still the brick with USBA instead of USBC. But hey, at least it comes in the box plus the cable. So I know also having wireless charging would be really convenient and it's kind of annoying going from a phone that does have wireless charging to one that doesn't, but I think OnePlus is counting on people who have other phones now that don't have wireless charging moving to this one and finding it's like a awesome battery experience. So that's what they're counting on. But lemme talk about the cameras in this phone because these are also a throwback to old OnePlus, which if you remember those phones means not as good as the flagships, but really solid. So it's got that 50 megapixel main camera that bends down to 12 and a half megapixels and it gives me images that are generally pretty sharp and nice if you don't zoom in. I mean I was pleasantly surprised that in most different types of shooting scenarios, it was at least capable of giving me a solid shot even in low light. When it does miss, it tends to overexpose a bit and even more so with darker skin tones. Also, focus is a little suspiciously slow sometimes. So I found myself taking multiple shots of moving objects just to make sure I got a good one. But you know what, if the bar is being set at just a good enough camera that it's not a dead giveaway that it's a cheaper phone, it clears that bar for sure. I couldn't tell you how much that Hasselblad partnership is actually doing for photos here. I mean color science maybe, it seems like there's pretty balanced colors and nice optical characteristics, but like that's about all I can say about that. I mean the photos look fine. The ultra wide is definitely soft near the edges of the frame, but at least it matches colors pretty well with the main and it does do macro when you get super up close to things, but it's not good macro. I mean it does the macro, but yeah, not great. The only reason I'm not gonna keep dailying this phone though, aside from other phones that I have to test very soon, is the software. There's just some things that... I mean the software is fine, lots of people use this software all over the world that have no problem with it but there's so many little quirks and things that they just add up and they get annoying. So here, if you're gonna be like old OnePlus, OnePlus, let's have some feedback. Let's listen to some user feedback here. So I'm an Android user who spends a lot of time in the notifications. It's a very important part of the phone. A lot of other people spend a lot of time there too. In every other Android phone that I've used, when you have a notification, you can swipe left or swipe right to clear them, but for some reason on this phone, you can only swipe away to the right. If you swipe to the left no matter how fast your swipe is, it pulls up settings and then you have to swipe again to clear. So this is slightly annoying every single time. And then in every other Android phone, if I have multiple notifications from the same app, then I can swipe down with one or two fingers to view each one. And if I just wanna open the app, you click it. Or if you wanna open a specific instance of that notification, you can do that when it's expanded. On this phone for some reason, you can't swipe to expand the group of notifications, you can only click it, which expands it. But then in the apps where there's a single notification and you want to expand it like a camera preview or a message preview or something with more information, you can't just swipe like every other Android phone, you have to tap this tiny bar at the top of the notification around that arrow to view the preview. That is even more annoying over time. And then in every other Android phone, if you pull down your notifications and you have a lot of them, you can always go, you know what, nevermind and then pull them all the way back up to close. On this phone, it takes multiple swipes to get through all your notifications and close them every time. That's a little more annoying. And then if you have music playing in the background, say on Spotify or podcast or something, you wanna get to to that app, on every other phone it's a swipe and a tap away. On this phone, it's a swipe, a tap and another tap to get to the app. There's a bunch of little things like that from coming from almost any other Android phone that doesn't use Color OS or this version of software. And it would be fine if that's the default behavior, but there's at least a toggle to let me not have that happen every time, but it happens every time. But the good thing is, other than that, there's a lot of nice things like in this software, it's very well thought out and laid out I think especially with the haptics and the combination of visual and haptic touches throughout it like pulling up and down the brightness slider, you get this nice haptic feedback or going up and down in volume, it's the same thing. It's very well thought out in that way. So I think if OnePlus really wants to sort of redeem themselves and they look back a little bit at what was so successful with Oxygen OS, I know they eventually did this merge thing with Oppo and Color OS, but look at what people loved about Oxygen OS and really think about bringing some of those things back. So this one's competition. At 699, it's kind of interesting. I think today you'd probably consider buying a Pixel Seven for 599. But what this phone will have over some of these other phones in its price range is some of the highest end specs. The Snap Dragon Eight Gen Two and the 1440P display specifically. It'll always have some of those spec things if you're interested in that. There's even a 799 version that has 16 gigs of RAM and 256 gigs of storage too. So yeah, that's what feels like sort of classic redemption OnePlus. Is this a full redemption? No, I'm not gonna give them full redemption status yet. But if the character arc of OnePlus was kind of like this and then like this, it does feel like this is an inflection point. It feels like this is a little bit of a shift in the right direction at least. So now I just hope they keep it going. They might be past their peak, but the performance and price of this phone show potential. Thanks for watching. Catch you guys in the next one, peace.",
    "transcript_keywords": [
        "phone",
        "Android phone",
        "OnePlus",
        "good",
        "phones",
        "charging",
        "swipe",
        "time",
        "back",
        "Android",
        "things",
        "camera",
        "pretty",
        "battery",
        "wireless charging",
        "lot",
        "kind",
        "people",
        "thing",
        "fine"
    ],
    "transcript_entity_values": [
        "599",
        "today",
        "799",
        "three",
        "Spotify",
        "eight hours",
        "50 megapixel",
        "China",
        "Color OS",
        "Oppo and Color OS",
        "120 hertz LTPO",
        "one",
        "USBC",
        "UFS",
        "Oxygen OS",
        "6.7 inch",
        "a few minutes",
        "256",
        "seven",
        "900,000",
        "the second day",
        "120 hertz OLED display",
        "80 Watt",
        "USBA",
        "eight",
        "5,000 milliamp",
        "80-watt",
        "10",
        "the year",
        "IP67",
        "LPDDR",
        "seven,",
        "100 watt",
        "799",
        "Android",
        "five",
        "12 and a half megapixels",
        "699",
        "1440P",
        "6.7-inch",
        "a minute",
        "OnePlus",
        "GPU",
        "two days",
        "120 hertz",
        "almost noon",
        "US",
        "RAM",
        "31%",
        "1080P",
        "six",
        "699",
        "Hasselblad",
        "these days",
        "1300",
        "699 bucks",
        "Oppo Super",
        "two",
        "the end of the day",
        "OnePlus 11",
        "last year",
        "Seven",
        "Samsung",
        "120",
        "16",
        "1000 hertz"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "TIME",
        "GPE",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ]
}