{
    "id": "3YFQu8jcPF4",
    "title": "Galaxy S10 Lite and Note 10 Lite hands-on: but why?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-01-06T02:30:57Z",
    "video_url": "https://www.youtube.com/watch?v=3YFQu8jcPF4",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "samsung galaxy",
        "samsung s10",
        "s10 lite",
        "samsung s10 lite",
        "galaxy s10 lite",
        "samsung ces 2020",
        "samsung ces",
        "samsung galaxy s10 lite",
        "galaxy note 10 lite",
        "samsung galaxy note 10 lite",
        "note 10 lite",
        "samsung galaxy s10 lite review",
        "samsung galaxy s10 lite unboxing",
        "samsung lite",
        "galaxy lite",
        "galaxy s10 lite review",
        "hands on",
        "first look",
        "review",
        "galaxy s10",
        "galaxy note 10",
        "samsung galaxy note 10",
        "price",
        "features",
        "phone",
        "new phone",
        "technology",
        "gadgets",
        "tech",
        "verge",
        "the verge"
    ],
    "views": 691727,
    "likes": 13113,
    "comments_count": 782,
    "description": "Samsung announced two new Galaxy phones: the S10 Lite and the Note 10 Lite. S and Note, in Samsung parlance, usually mean really high-end. These two phones are not that. After spending a half-hour poking around at both of them, I am able to understand why Samsung made them. But I am still deeply confused about some of the decisions Samsung made here.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2rWb1dF",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So I'm here at CES and I just got hands on with two brand new Galaxy phones from Samsung. But they're weird. It's the Galaxy S10 Lite and the Galaxy Note 10 Lite. And they're something completely different for Samsung. (upbeat music) So usually for Samsung, the S-Line and the Note Line are the very high end premium phones and they take their low end phones and call 'em A-something or other. But this is different, it's a relatively low end phone but with the premium branding. It's also strange because Samsung literally just announced the next Unpacked Event. Where it's going to ask the Galaxy S11 or maybe the S20. The rumors are really weird right now and they're also gonna probably announce their folding clamshell phone. So that's really exciting and it sort of took the wind out of the announcement for these Lite phones. But, let's talk 'em anyway. So the specs on these things are relatively uninspiring. Which starts with the screen. They're both 6.7 inches but they're only 2400 x 1080p resolution. Which isn't that much. But that makes them big, cheap Android phones and you might think Samsung already makes a cheap Android phone under the Galaxy line, S10E. But it's relatively small and Samsung needs to make big phones that don't cost too much 'cause that's really what people want. So that's one reason these phone are kinda weird but the other reason is the cameras. And like, what is going on here? They're different in both phones. Let's start with the Galaxy S10 Lite. It has a 5 megapixel macrocamera. That's cool. It's also has a standard ultra wide 12 megapixel camera. We like ultra wide, that's cool. It has a selfie camera that is 32 megapixels. Okay, but them the main sensor is a 48 megapixel sensor with super steady OIS and that's a first for Samsung, which doesn't make sense. Except when they had super steady before that just applied to video and now it applies to also photos. And it might be built into the hardware. So completely new, completely different camera system for Samsung. Why that got introduced on the S10 Lite is beyond me. And then you get the the Note 10 Lite and it has a completely different set of cameras. It doesn't have a macro lens and it doesn't have the super steady OIS. So like, what is going on? All right, so why are these Galaxy phones-- Yeah, I know that low end phones are also called Galaxy. What I meant here was S and Note, I'm an idiot. I mean Samsung also announced the A71, which spec-wise really isn't that different from these phones. Well, one reason I think is the processor, the Galaxy S10 Lite has a Snapdragon 855, which is right now the best you can get. And the Galaxy Note 10-- Yeah, got it wrong here too, sorry. Has a pretty good Exynos Processor in it. Honestly though, I think the reason that these are Galaxy phones is people like the Galaxy brand and it sells better than just the A and a number after it. So Samsung wanted people to get it. We don't know when they're getting released. We don't know where they're getting released. We don't even know their price yet. So all this stuff is up in the air, but they seem fine to me after using them for just a few minutes. Look, they might just be parts bin phones, but if the parts are good, who cares? Hey everybody, thank you so much for watching. We're obviously here at CES 2020. We obviously have a ton of stuff going on. So keep it locked to the Verge to see all our new gadgets.",
    "transcript_keywords": [
        "Galaxy",
        "Samsung",
        "Galaxy phones",
        "phones",
        "Galaxy Note",
        "Lite",
        "Galaxy phones Yeah",
        "Note",
        "low end phones",
        "phone",
        "low end",
        "end",
        "Galaxy line",
        "end phones",
        "Lite phones",
        "completely",
        "reason",
        "low",
        "Unpacked Event",
        "Note Line"
    ],
    "transcript_entity_values": [
        "Exynos Processor",
        "the Galaxy S10 Lite",
        "CES",
        "Android",
        "6.7 inches",
        "one",
        "Galaxy Note 10",
        "5 megapixel",
        "S10 Lite",
        "the Galaxy S10 Lite",
        "Verge",
        "the S-Line",
        "A71",
        "2020",
        "the Galaxy S11",
        "only 2400 x 1080p",
        "just a few minutes",
        "Samsung",
        "two",
        "Galaxy",
        "12 megapixel",
        "32 megapixels",
        "Lite",
        "S20",
        "first",
        "48 megapixel",
        "a ton"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY"
    ]
}