{
    "id": "3YwUoeUpRHM",
    "title": "These keyboards are getting GOOD! - Zoom65 EE Keyboard",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-02T19:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=3YwUoeUpRHM",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "zoom65",
        "Ee",
        "keyboard",
        "enthusiast",
        "entry level",
        "budget"
    ],
    "views": 260474,
    "likes": 9276,
    "comments_count": 787,
    "description": "Thanks to MANSCAPED for sponsoring the video! Get 20% OFF + Free Shipping at   Plouffe has taken a look at a LOT of keyboards here on SC, but at this price point, is this the best budget enthusiast keyboard you can get?  Buy Zoom65 EE:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Is Zoom65 still good? 0:25 Unboxing all the accessories and keycaps 4:24 Unboxing the barebones keyboard 7:25 Sponsor - Manscaped 7:49 Looking at the fully assembled keyboard 8:26 Trying out the keyboard ft. ASMR 9:14 Typing test 9:27 Pros and cons 10:13 Overall thoughts 11:25 Outro",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://geni.us/xF8q",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Meletrix sent us a box. They made the Zoom 65 about a year ago now. I've got it at home. Great keyboard. This is the Essential Edition. I think the main differences are it comes in a bunch of different color waves and it's got Bluetooth now, I'm pretty sure. Let's take a look! Is it still the king of the budget boards? 'Cause the nice thing about this guy is that it's only, like, $165, which is pretty cheap for the build quality that you get. Well, it was a big box. They got a lot of stuff in here. What'd they send us? What is this? (cardboard crinkling) Whatcha got? Whatcha got for me? Oh. It's a little pink bag? (Plouffe gasping) It's one of their bear key, it's one of their bear switch openers! Check this thing out! Oh, and Prism! - [Bell] Dibs!. - [Plouffe] Look at this! Yeah. I have the red one. Yeah. This one. - [Bell] Lets gooooo. (Host chuckling) - [Plouffe] So this is great! If you gotta open switches, you just, like, press it down on these little guys here. Pretty sure they sell these on the site. I don't know how much they are, but this is the Prism version, which is pretty nice. What else we got? We got. (box contents rattling) Probably switches. Okay. These are nice. I don't know what switches these are. They're not labeled in any way, but they're these clear boxy guys. (switches rattling) Let's see if they are linear or tactile. Linear! We got another box. What is this? (cardboard crinkling) What is this guy? Oh, a key cap! - [Bell] Yep. - [Plouffe] Little bear key cap. Prism. Oh. Sorry. It's metal, so it's a little heftier, but it's honestly not that heavy. I'm surprised by the robustness of the case that it comes in. This is like a rubber material and it's kind of heavy all on its own just for this tiny little key cap, but hey, I'm not complainin'. We've got, okay, now I'm gonna stand up a little bit. There's this guy. There's another box. There's (cardboard rustling) another box. (box pounding) Another box. (box pounding) Another of these guys. Probably another Prism or whatever. And then we've got a bunch of the accessories here. I'll just pull all these out. (boxes rustling) I think that they've sent us a fully assembled version and then a, like, kit that you can assemble yourself, a bare bones kit. (plastic crinkling) Also Prism, if you like the Prism stuff, this is for you. I got one of these already. You want one? - [Bell] Dibs in all these kits. - [Host] Yeah. These look like stabilizers. Oh, I broke the box. That's not good. Yep. So we got a little stabilizer kit. This is for, it's either extras for the fully built one or they are for the assembling the bare bones kit. Ooh, these are pretty, like little gold, I mean, they're probably not real gold, but they're nice little gold stabilizers with a clear housing and then for these, you've got all of our, I don't know what to call them. They used to just be called band-aid mods, but basically, you take these guys, you put 'em on your PCB underneath your stabilizers, and they just don't make it, like, scratch and clack when you press 'em all the way down as much. And the great thing about these is you no longer have to cut out little strips of band-aid. They're sticky on one side so, and they're perfectly sized, so you literally just peel them off, put them on as part of the build process. Really great little feature here. Ooh! What's in here? (cardboard crinkling) Hey! It's another Prism bear, probably. Just for clarity, this is stuff that they sent us. This is, I don't think it's part of the kit when you buy it yourself, but I'm not 100% sure, so don't go expecting a nice little Prism (snapping noise) switch opener or the, like, anything like that. What else do we have? (metal clanking) What's, okay, what's in these two boxes? (box contents shifting) (paper crinkling) What the hell? (box contents rustling) Ooh! Key caps! Wow! This is a really nice key cap box! Yeah, this is great because it lets you put, like, whatever size key cap you want in here. A lot of the time when you order them, they don't come in the best, especially when you're ordering cheaper stuff. They'll just come in bags or they'll come in these little plastic, like, flimsy plastic holders. This is great though! It lets you put them in, like, whatever order you want 'cause there's no separation, but they're nice and, like, separated by row. Bell was curious about how to open the switches and how to use the switch opener. So you just line up the tabs. Sometimes they're a little finicky. There we go. And then you just (snapping noise) press down. Look at that. Switch up and done. Easy peasy, lemon squeezy. Oh, they're GR Irish! WS GR Irish key caps! I don't know that set personally, but they look nice. I kinda like 'em. Andrew, what's your take on these? You like 'em? They're Irish apparently. - [Andrew] it's 'cause they're super white. - [Plouffe] It's. (Plouffe laughing) What's in this box? This is probably our actual keyboard to build. (cardboard rustling) Packaging's pretty good. It's called the Zoom 65 and it's like a telescope, you know? You zoom in on stuff. You'll see it. They've got it on the weight on the back too, which is nice. (plastic crinkling) So if you buy the kit, you get a little carrying case like the other one we have. (plastic crinkling) And when I got mine, everything was inside this little case here. This looks like PCB foam or something. This is, oh, what's in here? Want a little envelope? Eh! Oh, it's the battery! Yeah, so it's Bluetooth wireless and it's got a 2250 milli-amp hour battery at 8.325 watt hours. What else do we got? It comes with a cable too. (plastic crinkling) Here is our PCB, or plate maybe. Hold on. I'll take a look. Oh! Polycarb plate! Real nice. I kind of like polycarb. I'm not like. (foam rustling) I think I still prefer brass, but polycarb's pretty nice too. This looks like the PCB. Yep. Yeah. It's for a knob. So it's a 65% with, like, a knob, which is great. Here's your USB. It's a center USB, so if you have a keyboard cable that's meant for the left or the right, instead of having a center one that, like, goes straight out or it goes to the right or whatever, first, you might have to get a new cable for this if you don't already like the one that comes included 'cause they're pretty decent, actually. I really like these. It's just a simple braided, coiled cable, but it's braided and coiled. You're spending $165 and you're getting a braided, coiled cable with your keyboard. That's not bad. I like opening this like this (censored)! Like, this is a nice (censored) keyboard for $165! It's just, this is why I get frustrated when I have to unbox Corsair stuff and Logitech stuff and whatever. It's like, those are, like, $200, $250, and, like, just look at the quality comparison. Do I have to build this one myself? Sure, but I'm pretty sure you can also buy these not in bare bones. Yeah. This looks like the knob. The one I've got is like a gold one to go with the pink Olivia stuff. This looks like silver. I think this one's silver and white for the most part. Ooh! (plastic crinkling) The big difference with these ones, aside from the wireless features, is the color ways. So I went with the dark navy blue, or whatever they're calling it on the website, and I love it! So there's, like, a silicon pad that goes in here and then you've got another one that goes around the outside if I recall correctly, and then on the bottom here, I don't think they've included it with this guy, but you can fit a weight in here, no problem, unless it's just somewhere else and I haven't found it yet. We'll keep looking. Fortunately for us, (foam crinkling) since I don't have, like, two hours to build this thing on camera for you guys, we've got a second one and it should be fully assembled. We haven't looked at it yet, but it should be fully assembled. (paper crinkling) They've also got pretty good build guides on their site as well. So, whether it's your first keyboard or you've built a few and you just want to be able to follow along with something to make sure nothing goes wrong, they've got you covered. This should be our fully assembled board and I'm gonna open it in a sec here, but not before a word from our sponsor today. Manscaped! Grooming below the waist is made easy with their performance package 4.0 kit, designed to contain everything you need. It includes the IPX Seven-Rated Lawnmower 4.0, convenient for wet or dry operation, the Weed Whacker ear and nose hair trimmer, plus other goodies like the Shed travel bag and Manscape's anti-chafing boxers. Get 20% off and free international shipping at the link in the description below. Aah! Oh, it's clean and yeah, they've got the plate on the back here. (plastic peeling) Here we go! - [Andrew] Great. - [Host] You know I had to do it to him. That's that really nice mirror finish though. Holy crap! I can see myself so cleanly in this thing! Oh, that's beautiful! The one I've got at home is just black. One thing I really like about these keyboards is the texture. It's an all-aluminum case, but they've done something to the texture so it's not super smooth. It's kind of rough in a way, but I really, really like it. I wouldn't call it rough. I'd just call it textured. Cool. Yeah. So it looks great. (keyboard buttons clicking) Oh, it sounds so good! (keyboard buttons clicking) But seriously though, that's really great! You can tell that they've done a great job with the stabs, with the lubing and everything, and even with the switches. I'm not sure what's in here right now. Let me take a key cap off and take a look. It's those same box whites that they've sent us and, yeah, it's hot swap because, why not? And the knob has a tactility to it that is very satisfying. Let's plug it in and do a typing test. This is like my ideal sound for a keyboard. This is, like, perfect already. I love it! I don't think, even if I tried to lube these switches myself, I could do a much better job. All right. Here we go. (keyboard buttons clicking) Oh, no! (keyboard buttons clicking) Oh, I (censored) up so bad! This one's gonna be terrible. (keyboard buttons clicking) I still got 115, 96%, but I made a huge mistake early on. I love this thing! Oh my god! It's just, don't get me wrong, there's better keyboards out there and, especially if you don't like 60%, 65%. The reason I'm actually pretty big on this one in particular is the layout is just kind of almost exactly what I need. The only thing that would really push this one over the top for me personally is if it had a function key row. The reason I don't prefer smaller layouts is because I don't like having to hit the function key and then hit, like, a number to hit, like, for example, Alta 4. You wanna quit out of a game? Now, it's not just two buttons. It's a whole (keyboard button clicking) three key presses to get your Alt F4 on the go. It's not the end of the world. I can deal with it. I have been dealing with it and I've really been enjoying a smaller form factor on my desk. Just kind of taking up less space. This keyboard, the Zoom 65 Essential Edition, starts at 159 and you're gonna add some more costs, something like 50, $60 if you want the Bluetooth wireless version. I'm not sure if this one is Bluetooth or not. We've got a cable, but no sort of documentation or anything saying, \"Hey, here's how you enable it.\" So we haven't tried that. However, I still think at 159 for a cabled keyboard, this thing is a pretty good value. The only problem is that it's basically already sold out everywhere. The biggest problem with the whole mechanical keyboard custom market is that a lot of the time you've gotta get in on group buys. You've got to wait for a product to go live for, like, three days and try to score it while you can. It can be very frustrating and that's kind of why I tend to push companies like Keychron or Glorious when I'm suggesting keyboards to friends, family, or anyone messaging me on Twitter. I think that if you can somehow snag the Zoom 65 or the Zoom 65 Essential Edition, I think it's a great buy. I think the value for what you're getting is just solid and honestly, I don't think you can go wrong. So the answer ultimately is yes. I would totally buy this thing. Thanks for watching everyone. This is Short Circuit. This is the Zoom 65 Essential Edition and if you wanna check out another video on keyboards, check out the Vissles one I did. That one came with a waifu and it was a lot of fun checkin' that out. (keyboard buttons clicking) See you later!",
    "transcript_keywords": [
        "nice",
        "key",
        "pretty",
        "Great",
        "Prism",
        "key cap",
        "keyboard",
        "box",
        "Yeah",
        "thing",
        "Zoom",
        "Essential Edition",
        "stuff",
        "kit",
        "kind",
        "cap",
        "guys",
        "switches",
        "build",
        "pretty nice"
    ],
    "transcript_entity_values": [
        "the Zoom 65 Essential Edition",
        "Polycarb",
        "a year ago",
        "100%",
        "Plouffe",
        "Prism",
        "250",
        "Manscape",
        "Andrew",
        "unbox Corsair",
        "One",
        "three",
        "one",
        "20%",
        "USB",
        "Andrew] Great",
        "sec",
        "Bell",
        "Logitech",
        "60%",
        "159",
        "second",
        "Vissles",
        "Shed",
        "115",
        "60",
        "the Essential Edition",
        "Irish",
        "Twitter",
        "two hours",
        "three days",
        "Alta 4",
        "2250 milli-amp hour",
        "Olivia",
        "Keychron",
        "96%",
        "first",
        "Bluetooth",
        "165",
        "two",
        "200",
        "4.0",
        "Short Circuit",
        "Bell",
        "8.325 watt hours",
        "Linear",
        "PCB",
        "65%",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "NORP",
        "DATE",
        "PERCENT",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "NORP",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE"
    ]
}