{
    "id": "3zMfxOCkm9k",
    "title": "Chrome REALLY Messed Up... (Browser Extensions)",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-07-21T17:07:07Z",
    "video_url": "https://www.youtube.com/watch?v=3zMfxOCkm9k",
    "category": "Science & Technology",
    "tags": [],
    "views": 842644,
    "likes": 48443,
    "comments_count": 2009,
    "description": "Pre-Order the DROP THX Panda Wireless headphones today at   Are serious threats lurking inside Chrome extensions?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dro.ps/tq-july20-panda",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- One of the most useful things about modern web browsers is their support for extensions, whether it's automatically finding coupon codes. - It's not coupon, it's coupon. - Cleaning up your experience on social media, auto-magically filling in passwords or blocking ads and cutting into our revenue. There's a ton of extensions out there that can make your life a little bit better, but with so many extensions floating around and trying to get you to install them, security is a legitimate concern, especially since many extensions aren't exactly from big name developers that you would immediately recognize and know whether or not to trust. So to address this, Google uses security vetting for extensions with both manual human review and automated methods based on algorithms, similar to how smartphone apps from the Play Store have to be approved before they're available for public download. But with over 180,000 extensions currently available through the Chrome web store, certain poorly and maliciously coded extensions slip through the vetting process from time to time. Again, LOL, just like the apps. Attackers who want to use extensions to steal information know this, and in fact, back in 2018, Google announced that it was going to beef up its review practices after it was found that one in 10 submissions to the web store contained malicious code. The idea was that Google would make its approval process more stringent by cracking down on obfuscated code. In other words, when developers made the code deliberately hard to understand, possibly to hide some sort of seedy functionality. Google also reigned in how many permissions extensions were granted by default in an attempt to prevent them from reading or modifying user information in a surreptitious manner. However, the web store still has problems. In June 2020, it came out that one particular form of spyware that hidden browser extensions had been downloaded nearly 33 million times. That's almost one download for every person here in Canada. These extensions secretly contained key loggers and other code that harvested login credentials as well as information copied to the Windows clipboard, and ironically, many of these extensions claimed to give users a heads up when they were visiting risky websites. Others masqueraded as file converters, and it can indeed be tricky to convert from one file format to another, so it's easy to understand the appeal. So what can you do to protect yourself when you're hunting for a useful extension? Number one is to keep in mind that most of those 180,000 plus extensions have very small user bases. In fact, over 85% of extensions have fewer than 1000 installs worldwide, and it's far more likely that compromised extensions will be part of this mass with very small user bases to pick through them and monitor them and figure out if there's something wrong. So if you're trying to pick between several extensions that all appear to offer very similar functionality, it's not a bad idea to stick with the ones that have lots of positive reviews as a quick way to avoid problems. Another sound strategy is to limit your exposure by asking yourself whether you really need a particular extension in the first place. Like don't get me wrong. Some extensions that manage your tabs or give added functionality to specific websites are extremely useful and can't really be replicated, but if you just want to be served inspiring quotes or get reminders or convert files, like we mentioned before, those are things that can all be accomplished through just browsing the web or using a program that you can download to your computer. Again, please make sure you find a reputable one. Additionally, be sure to have a good hard look at the extensions page before you download it. Extensions that are really just vehicles for malware can often have clunky looking interfaces and poorly written descriptions riddled with grammatical errors, similar to what you might see in a spam email or on a phishing page. Now, of course, we expect Google to improve its vetting procedures, especially because it's kind of a bummer that we're gonna lose some of those diamonds in the rough if we say, hey, just make sure you only install mainstream extensions. But sometimes in life, you've just got to put your own safety first, lest, you end up like that poor fellow who lost over 100 grand worth of Bitcoin thanks to a shady crypto client extension. Maybe I should just go back to stuffing all my cash into my mattress. It's very comfortable. Speaking of comfortable, check out the DROP THX Panda wireless headphones. Don't let the fact that they're wireless fool you. These are audio file grade cans and Drop Inc. THX say the world's most distortion free wireless headphones. I actually did try them out. They sound freaking awesome. With a community centered close back design, you can get closer to your music than ever before. They have THX triple amplifier technology, and surprisingly, they manage to sound the same, both wind powered and just running through a jack. You get 30 hours of wireless life with Bluetooth and compatibility with home assistance. So what are you waiting for? Pre-order today at the link in the video description. Thanks for watching guys. Like, dislike, check out our other videos or leave a comment if you have a video suggestion for something that you'd like to see here on Tech Quickie. If you haven't already subscribed, make sure you do that because, otherwise, ants are gonna bite you.",
    "transcript_keywords": [
        "automatically finding coupon",
        "extensions",
        "finding coupon codes",
        "finding coupon",
        "automatically finding",
        "web store",
        "Google",
        "Chrome web store",
        "coupon",
        "modern web browsers",
        "web",
        "Store",
        "modern web",
        "make",
        "coupon codes",
        "code",
        "extension",
        "download",
        "Play Store",
        "wireless"
    ],
    "transcript_entity_values": [
        "Panda",
        "over 180,000",
        "Tech Quickie",
        "a ton",
        "one",
        "Drop Inc.",
        "30 hours",
        "Google",
        "2018",
        "the Play Store",
        "100",
        "Windows",
        "180,000",
        "Chrome",
        "nearly 33 million",
        "10",
        "June 2020",
        "first",
        "Canada",
        "fewer than 1000",
        "over 85%",
        "Bitcoin",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "PERCENT",
        "NORP",
        "DATE"
    ]
}