{
    "id": "40hJStzsBm8",
    "title": "LightScribe: HP's Clever Twist on the CD Burner",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-11-10T14:08:23Z",
    "video_url": "https://www.youtube.com/watch?v=40hJStzsBm8",
    "category": "Science & Technology",
    "tags": [
        "LightScribe",
        "light scribe",
        "CD label",
        "label maker",
        "DVD",
        "CD-R",
        "DVD-R",
        "DVD+R",
        "compact disc",
        "engraving",
        "etching",
        "hewlett packard",
        "HP",
        "optical disc",
        "optical media"
    ],
    "views": 1468115,
    "likes": 44352,
    "comments_count": 4906,
    "description": "You can support this channel on Patreon! Link below    I remember when LightScribe was first marketed, and let me tell you I thought it was *the* *coolest* *thing* to ever happen. Burning labels with lasers? No way! Well, it worked amazingly well. LightScribe wasnt without its flaws, though, and in this video well discuss a bit of its history, how it worked, and why it wasnt a runaway success.  Some links and stuff! Basic info and some details of operation came from here:   This is a patent you can look at for a LightScribe drive made in 2011 (kinda near the end of the run)   If you happen to have a LightScribe drive and some media, but youve never installed anything to let you use it, check out Steves website. Some notes on compatibility--Apparently his free labeler doesnt work with Windows 10. The LightScribe utilities do, and so does Nero 8 for what its worth. But if youre desperate to get your Win10 PC into the LightScribe universe, you may face some challenges.   Technology Connections on Twitter:   The TC Subreddit:   You can support this channel on Patreon! Through the amazing support of people just like you, this channel has gone from my weird hobby to my full time job! Thank you for making that possible. With your help, the channel is growing while at the same time staying free of outside influence. If youd like to pledge some support to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons!Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, T.J. Steckbeck, Pavlo Pravdiukov, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Staval, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr  Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://www.pcworld.com/article/121297/article.html",
        "https://patentimages.storage.googleapis.com/f1/5b/55/752ceaa7c6f109/US8040367.pdf",
        "https://lightscribesoftware.org/",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections/",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Do you remember this little marketing slogan? No? Well, I cant say Im entirely surprised. But Im also a little sad. That was one of the taglines of LightScribe, a direct-disc labeling technology developed by Hewlett Packard and first released commercially in 2004. What is it? Well, its a really clever twist on an already common technology. LightScribe used existing optical drive technology to burn monochrome images onto the label side of optical media, either CDs or DVDs. Thats right, its optical media time again here at Technology Connections, where our mission is to stay timely and relevant. *beeper noise* Oh, excuse me I need to take this. [to non-existent assistant offscreen] Uh, can I borrow your phone? Jokes aside, I actually really, really like the idea of LightScribe, and I think its an absolute shame that it didnt take off. Well soon see that its not too surprising it didnt, but let me explain why I like it so much. LightScribe is a perfect example of my favorite kind of innovation. Take a thing that currently does a thing, and make it do more things or different things! At their core, LightScribe enabled optical drives are pretty much identical to any ordinary CD or DVD burner. See, you already have a high-powered laser thats able to write readable data on a little plastic frisbee, so why not use that same laser to burn images onto the other side of that plastic frisbee? And thats roughly the exact question that Daryl Anderson, lead engineer of the LightScribe project, probably asked when he first thought up the product maybe. The bottom side of any writable optical disc is already a marvel of engineering, with heat-sensitive dyes or even advanced polycrystalline alloys that darken when exposed to the heat created by the laser light, therefore allowing tiny little marks to be burned into the surface. These translate into the data that is actually on the disc. If weve made materials that will get darker when exposed to intense laser light, whats to stop us from doing the same thing on the top side of the disc, for making an actual label? Well, not much. In fact, only a small modification was needed to turn an ordinary optical drive into a Lightscribe drive. And you can see it just here. This little doo-dad allows the drive to see the rotational position of the disc. See, for writing data to a disc, its geometric position is pretty much irrelevant. Molded into the plastic of the disc is a spiral pregroove containing the ATIP, which stands for Absolute Time In Pregrrove. This not only guides the laser as it writes data to a blank disc, but it also keeps the disc spinning at the correct speed relative to the data being blasted onto it by the writing laser. And staying at the correct speed is all that matters, really. The data can be placed arbitrarily along the disc as far as its physical location goes, and so long as it reproduces the correct sequence of zeros and ones, the correct data will be read. However, to make an image using a single light source on a rotating disc, the discs exact position needs to be determined. This little guy works with the LightScribe media to do just that. A LightScribe disc looks just like a regular disc, except the top is almost entirely devoid of writing, save for a little bit of brand and format identification in the center ring. But youll also see this little barcode looking thing between the spindle hole and the writable portion of the disc. When the disc is placed upside down in a LightScribe enabled drive, the barcode will line up with that scanner thing. Now the drive can know the discs absolute rotational position so it creates a proper image, and not a spirally mess. That barcode also encodes information about the label surface, which is pretty important particularly because of the difference between CDs and DVDs. Ah, lets talk a little bit more about the disc itself. The top surface of most lightscribe discs is this light tan color. The color comes from the material used in the top coating, developed by Dr. Makarand Gore. Just like the dye coating on the underside, this coating will get darker when it is heated up by the laser. But, it differs from the dye layer down below in that it gets much, much darker, almost black. Through a simple labeling utility, you can create simple text listings, or even beautiful monochrome pictures like this one. [pregnant pause] Well now, this is beginning to highlight the problems of lightscribe, but before we get too far down that particular rabbit hole, lets take a look at how this works. Ive taken the cover off of this slim drive so we can see it in action. Im having it make a simple label with the word Test. First, you can see the scanner activating to read the barcode on the inner ring. Once I started the printing process, I was extremely surprised at how slowly the disc spins when its being labeled. Look at this! This is nuts. Luckily, we can see the laser shining through. Notice how it flashes briefly at a higher intensity. This is it burning the letters onto the disc. Whats interesting here is that the laser is switched on at all times. Im not sure if any LightScribe drives were made that could only burn CDs, so Im wondering if were seeing the red laser diode for DVDs burn with a steady glow, and the flashing is the high intensity infrared laser diode blasting the disc with energy. low fidelity guitar music Perhaps were only seeing one or the other, the music returns briefly but in either case, this suggests that the drive is actually looking at the surface of the disc, perhaps simply for focus, or maybe it actually checks what its laid down. Whatever its doing, I still cant get over how slowly the disc is spinning! Thats a surprise. But maybe not. Ill explain in a bit. With the disc completed, we can now take it out and sure enough, theres the word Test just like we expected. But theres more weirdness in the LightScribe universe. Like the stark difference between CDs and DVDs. Ive created a basic label and Ive burned the same thing onto a CD-R and a DVD-R. You might notice that they look mostly similar, but the DVD label is almost... blurry looking. This is an odd quirk in the Lightscribe universe, as DVDs and CDs were made very differently. Well, OK, all DVDs and CDs are made differently. In a CD, the data layer is actually barely below the label side of the disc. The laser in a CD player is shining through almost the entire thickness of the disc before the reflective surface bounces it back. But in a DVD, the data layer is actually in the middle of the disc. You can see this even with standard DVD movies--the disc has a seam down the middle, as its made in two halves. CDs dont have this seam, as they are a single sheet of polycarbonate. Now for some reason, in LightScribe DVDs, the label coating isnt simply placed on the top of the disc. Instead, its sandwiched between a top clear layer and the data layer beneath it. And this is why a LightScribe drive needs to know if this is a DVD or a CD--the drive will focus at different depths depending on which type of media is used. This always struck me as kinda odd, as whats to stop them from putting the same CD-style label coating on the actual top of a standard DVD-R? Putting it in the middle like this meant that all LightScribe DVD labels looked a little soft compared to those of CDs, however it does appear to increase contrast slightly between light and dark, but that could simply be down to the particular discs Ive got here. That said, there was an advantage to this. Firstly, the label surface is more protected in a LightScribe DVD because its not exposed. And secondly, a fairly common occurrence with LightScribe media is for a white powder to form on top of the black portions of the label. This was simply a side-effect of the burning process and it was purported to be a harmless crystallization of the label layer, however it would get on your fingers if you touched it and wasnt really pleasant looking on the disc. With a DVD, that happened much less frequently due to the protected and sealed nature of the label, and even if it did, at least the powder wouldnt get all over your fingers. So, how do you actually create a LightScribe label? Well first, you need to make sure that you have both LightScribe media and a LightScribe enabled optical drive, plus the necessary LightScribe system utilities and some sort of program for creating labels like this Nero Smart Essentials thing. You know, easy. But assuming you have all of that ready to go, its pretty simple. The Nero software is about as user-friendly as can be for 2004-ish, and it does something that at first seems really really weird, but you will quickly learn is totally understandable. Ill add a text box and as soon as I do so, that box becomes a crescent? Erm, OK. Well, from here, I have a pretty good degree of customization. I can choose my typeface, its font size, bold and italics, its justification and all that, just like a basic word processor. And then I hit OK, and it gets wrapped around that crescent thing. Well, I can turn that off by unselecting the Bend checkbox, and now things look a little more normal. Lets just do some quick customization here, maybe add a little something extra, and now I think thats a delightful design, worthy of a LightScribe label. So now, Ill grab my CD which already has my Awesome Mix 2006 on it, and Ill pop it upside-down into the drive. I can now burn the label. So, I hit the little button, and now I can select between Draft, Normal, and Best. I can even get a preview of what this will look like on the finished disc, a handy little feature. Of course, I dont settle for less than the best, so Ill hit Best, and now heres where LightScribes weaknesses really come into play. It tells me this will take about 15 minutes. Well, thats a lie right there. This is gonna take more like 23 to 25 minutes. Yeah, LightScribe is anything but fast. But thats not unexpected. Remember one of its design goals was to avoid reinventing the wheel and use existing optical drive technology. And for the most part it did. But, lets think for a moment how limiting that was. The laser in a CD burner is normally focusing its power onto a microscopic spot, so all of its power becomes concentrated and realistically the laser doesnt need to be all that powerful. But if were trying to draw with it, we dont want it to be focused onto a microscopic point that we cant see. When burning a label, a LightScribe drive actually defocuses the laser so that the point its burning is larger (and actually visible). But that means that the disc has to travel more slowly, as we now know, WAY MORE SLOWLY, because with a less concentrated spot, the energy is more spread out, and the laser cant heat the label as quickly. Bummer. And, because the drives were only lightly modified from standard optical drives, the discs could only spin in one direction. That might not seem like a limitation, but thats precisely why the label-making program would bend the text by default. See, the time it takes to burn a label is directly dependent on the range from the inside boundary to the outside circumference that is being used. And by being used, I mean AT ALL. Even if just a thin line is drawn from here to here, the label will take 25 minutes to create. This is because it cant just rock the disc back and forth to make that line. It burns the label just like it burns data, so it has to follow a spiral starting from the inside boundary and going all the way to the outside edge. Remember that Test label? It spent the majority of the time with the laser off, and because it cant just skip the blank parts of the label, it takes a long time to write just a single word. But the drive CAN skip blank sections along the discs radius. So, if you bend the text into a ring, then only this region is actually being used. So the drive can skip all this, burn from here to here, and then its done. And heres how that comes into play. This disc here, even though its just a small amount of text, took about 25 minutes to make. The text gets very close to the inside edge, and continues almost all the way to the outside edge. So even though none of this space is being used, the laser still had to travel over all of it. But this disc, with much more written information, only took about 10 minutes. All of the text is contained between these two boundaries, so the inside portion could be skipped, and the drive didnt need to burn anything past here. So, to save time, the program is always going to encourage you to bend the text like this, as these labels can me made in as little as 5 minutes. If youre OK with 12 point font, this can get down to 2. With that limitation, though, how attractive is the system, really? Sure, this is more legible than a sharpie, but if you want to make professional looking labels like this, youll be spending at least 15 minutes each go, and probably more. You could save some time by selecting either the draft or normal settings, but those sacrifice burn intensity and/or resolution and will produce a lighter image. And the lengthiness of the burn process isnt the only weakness. You may have noticed how low-contrast this atrocity was. Ignoring the fact that its a monochrome image (cmon, were not making miracles here) this is a rather low-contrast affair even when burned on the best setting. LightScribe looks pretty good with black text, but introduce images and things get less optimal. In order to look their best on a LightScribe label, the image should be adjusted to have borderline extreme contrast, an adjustment that is unfortunately omitted from this labeling utility. And the image quality concerns dont stop there. Look a little more closely at these labels and youll see that the text isnt entirely aligned right. There is a slight shifting going on at many points. Some of this is likely down to my particular LightScribe drive, but the format was prone to this happening from time to time. Ive even had a few discs come out as a complete mess, likely due to a dirty barcode ring. This is real, by the way, this is supposed to have words on it. And heres one image abnormality thats appeared on every single LightScribe disc Ive ever made. You can see the actual spiral pattern of the lasers travel in solidly dark portions. Of course, I think thats pretty neat but lets be honest, its a flaw. Youre probably thinking of another flaw to LightScribe that kept it from reaching mass popularity: Cost. LightScribe drivers were probably stupid expensive, and the discs? Pfft, waste of money. Actually, no. The drives themselves were barely any more expensive than standard drives. Even in the early days, there were plenty of LightScribe enabled drives that actually cost less than standard drives from some competing manufacturers. Remember, theres not much different about a LightScribe drive, and HP was happy to license it to many manufacturers. By 2005, 6 different drive manufacturers had signed on to make LightScribe drives. And the media was a bit more expensive than standard blank media, but honestly not by much. Assuming you were sticking to mainstream brands and not bargain basement specials, an equivalent LightScribe disc from the same manufacturer was only about 20 to maybe 50% more expensive. Its hard to make a comparison now because LightScribe is pretty much dead, but I recall that a spindle of 50 LightScribe DVDs was about $30, and CDs were between $22 and $25. Honestly that seemed very reasonable to me, especially because theres an added cost to either paper labels or inkjet-printable CDs. Oh, paper labels. Ugh. How I hated paper labels. That was the single greatest advantage of LightScribe in my eyes, as they worked great in cars. A CD with a paper label never behaves too nicely with the slot loading players in cars or many Apple products back when they included optical drives and headphone jacks. LightScribe discs just looked great without any compatibility issues, and everyone who I ever gave one to was impressed with them. So really, its just a little sad that no one cared to use them more. But, I understand. A sharpie and a cheap CD is pretty sufficient, particularly since so many burned discs were just throwaway affairs to begin with. And there were still more problems with LightScribe. The label surface is pretty susceptible to wear (in CDs anyway), and it can fade quickly if left in direct sunlight or exposed to extreme heat, and over a period of years the label will fade regardless unless cared for. They can last a long time if cared for, though. These backup discs for my netbook (thats right, netbook, remember those?) are around 7 or 8 years old now and the labels look fine. Granted, these are DVDs with the inherent protection of the top surface layer. Where is LightScribe today? Officially deceased. You knew it was coming, didnt you? HP officially ended LightScribe support in 2013 by removing its website and even going so far as to say you can find the software you need somewhere else, not here. And while you can still get LightScribe drives and media, its pretty much new old stock only at this point. Today, you can find the LightScribe utilities you may need at lightscribesoftware.org, a website run by Steve Nelson who is really going out of his way to keep LightScribe support going. And indeed, I owe him thanks, as I needed to download the system utility to make the discs for this video. But before it died, LightScribe was improved by offering discs in other colors, but that was about all the innovation it ever received. If they could have gotten a full label done in 5 minutes, I think it would have fared better. But then again, that would probably require a much stronger laser than whats in a garden variety optical drive, making the drive much more expensive, and further limiting appeal. Oh well, it was neat while it lasted. Thanks for watching, I hope you enjoyed this look into what I honestly feel like is perhaps the most underappreciated development in optical disc history. I dont know what could have been done to make LightScribe a little more popular because lets face it, how often did you even want to make a nice label for your angsty mixes? And if you needed to make discs professionally, its just far too slow and by that point you would be wiser to invest in some sort of screen printing setup or even just having ordering discs to be commercially pressed. It was always going to be a niche product, even though it was pretty neat. As always, thank you to everyone who supports the channel on Patreon, especially the fine folks that are scrolling up your screen. A lot of channels here on YouTube need to rely on outside sponsorships to stay possible. But thanks to the amazing support of people like you, this channel doesnt. If youd like to become one of these awesome people and help support the channel, and get behind-the-scenes access, sneak peaks, and other perks, please check out my Patreon page. Thanks for your consideration, and Ill see you next time. And now, the outtro music. suspiciously smooth jazz A bonus fact about LightScribe: Because of that barcode thing, the disc actually has a natural orientation. This means you can add something to an already labeled disc simply by burning something onto it in the unused area. So, my Awesome Mix 2006 can be amended with a warning for non-awesome people. Also, this allowed you to burn the same label again, which would make it a little darker, but with repeated burns slight alignment errors would compound and make the image increasingly blurry. LightScribe was not the first direct-disc labeling product, nor would it be the last. In 2002, Yamaha had developed the disturbingly named DiscT@2 (pronounced Disc Tattoo) --uh thats terrible-- which could etch a sorta-label on the bottom side of a CD or DVD in the unused data portion. Um, lots of problems there, you cant use it unless the disc isnt anywhere near full, the label is on the bottom side so not really a label, and also these werent radically easy-to-see because the dye layer isnt meant for that. Nevertheless, it was briefly a thing, but had very little support. NEC would later use Yamahas patent on DiscT@2 (seriously, thats an awful name) to create LabelFlash, which was a direct competitor to LightScribe. This came out in 2006, with the discs having a bright blue label on top. It fared even worse than LightScribe, probably because it was a later format with less manufacturer support, the discs were way more expensive than LightScribe media (like 2 or 3 times more expensive) and it also was limited to DVDs only. And Ill leave you with something that I cant demonstrate unless smell-o-vision takes off. LightScribe media has a very distinctive odor. Crack open a fresh spindle of LightScribe discs and youll be greeted with a not-unpleasant but certainly unnatural mild chemical smell. The best way to describe it is, I think, musty crayons. Yeah, its a little musty but also plasticy and like hot wax. Musty crayons. I actually kinda like it, but I have a feeling its not exactly healthy.",
    "transcript_keywords": [
        "LightScribe",
        "disc",
        "label",
        "discs",
        "Lightscribe drive",
        "drive",
        "LightScribe DVD labels",
        "LightScribe disc",
        "LightScribe label",
        "laser",
        "LightScribe media",
        "DVDs",
        "drives",
        "LightScribe DVDs",
        "DVD",
        "labels",
        "make",
        "optical drive",
        "make LightScribe drives",
        "data"
    ],
    "transcript_entity_values": [
        "Nero",
        "Lightscribe",
        "Firstly",
        "Lightscribe",
        "between $22 and $25",
        "this Nero Smart Essentials",
        "ATIP",
        "2004",
        "secondly",
        "25 minutes",
        "Absolute Time In Pregrrove",
        "the early days",
        "2005",
        "two",
        "Apple",
        "3",
        "7 or 8 years old",
        "Yamaha",
        "50",
        "6",
        "zeros",
        "about 10 minutes",
        "fidelity",
        "2006",
        "Draft, Normal",
        "2",
        "about $30",
        "2013",
        "Steve Nelson",
        "about 15 minutes",
        "HP",
        "today",
        "Patreon",
        "YouTube",
        "HP",
        "12",
        "2002",
        "Today",
        "Daryl Anderson",
        "first",
        "Hewlett Packard",
        "one",
        "DiscT@2",
        "Technology Connections",
        "LabelFlash",
        "at least 15 minutes",
        "maybe 50%",
        "LightScribe",
        "more like 23 to",
        "NEC",
        "Makarand Gore",
        "as little as 5 minutes",
        "frisbee",
        "First",
        "Yamahas",
        "only about 20",
        "cmon",
        "2004-ish",
        "5 minutes",
        "about 25 minutes"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "TIME",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "TIME"
    ]
}