{
    "id": "40zn4odfxyc",
    "title": "Dare Me to Take This \"Laptop\" to Starbucks?",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-05-26T16:58:59Z",
    "video_url": "https://www.youtube.com/watch?v=40zn4odfxyc",
    "category": "Science & Technology",
    "tags": [
        "Gaming",
        "PC",
        "Gaming PC",
        "DIY PC",
        "DIY Gaming PC",
        "PC Build",
        "4090",
        "RTX 4090",
        "RTX",
        "AMD",
        "Ryzen",
        "Noctua",
        "PC Gaming",
        "Asus",
        "EKWB",
        "Laptop",
        "Portable Gaming"
    ],
    "views": 1163373,
    "likes": 39099,
    "comments_count": 1647,
    "description": "Save up to 40% and get Free Shipping at Ridge by using the link   Have you ever thought \"Laptops sure are great, but I wish they had 3 monitors, desktop components, and weighed 20 times as much\"? Good news! With the MaCase B43 chassis your PC can go from a portable, reasonably powered slate that lives in your backpack to a monstrously huge Frankenstein machine capable of running several instances of Crysis. This thing games so hard you'll totally forget about the disc you slipped in your back while trying to get it up onto the table.  Discuss on the forum:   Check out the Macase B43 on Alibaba:  Buy an AMD Ryzen 9 7950X3D CPU:  Buy an ASUS Crosshair X670E Gene Motherboard:  Buy a Noctua HL-L12Sx77 CPU Cooler:  Buy KingBank SharpBlade 6400MTs CL32 16GBx2 DDR5 RAM:  Buy a Crucial T705 2TB NVMe M.2 SSD:  Buy a ZOTAC GAMING AMP Extreme Airo GeForce RTX 4090 Graphics Card:  Buy a Cooler Master Universal Vertical Graphics Card Holder Kit (V2):  Buy a Cooler Master V1100 SFX 80+ Platinum PSU:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Introducing the Case 3:47 CPU, Mobo, Cooling 5:55 RAM, SSD, GPU 7:24 Fitting the GPU and everything else in the case 9:55 Cooling with a custom side panel 11:22 PSU + GPU Stabilizer  13:22 Testing it out 14:31 Check out these monitors. They sure are monitors. 16:10 Gaming, yes. Temperature 17:05 Conclusion",
    "description_links": [
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1571612-dare-me-to-take-this-to-starbucks-triple-monitor-briefcase-pc/",
        "https://lmg.gg/6PM0S",
        "https://geni.us/WcR5y30",
        "https://geni.us/Vz6KIBD",
        "https://geni.us/D4tA",
        "https://geni.us/hi9zV",
        "https://geni.us/oik3",
        "https://geni.us/PHBK",
        "https://geni.us/xsg0rL8",
        "https://geni.us/93pYT94",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "If they let everyone else bring their laptop to the coffee shop, why not me? Believe it or not. They didn't ask me to leave but they probably should have the mock case b43 is unlike any other Laptop that we've looked at before for starters. It's got three monitors It weighs nearly 40 pounds fully loaded and it fits a full-size desktop PC parts At least it kind of does we ran into some Unexpected challenges while building it today. So surely with that in mind it must be reasonably priced then right Ha ha That is where you're wrong But hey, that's our job right to waste our money on this kind of stuff So you don't have to so you can spend your money with our sponsor dads are amazing But their wallets are not Make daddy a baddie again. Happy Father's Day. Just like with our last MA case briefcase PC build, this thing is flipping heavy. It's actually really front heavy too, if you look at how it sits when I'm holding in the handle. So putting it on our scale here, which I don't even know if it goes this high, 12 kilograms, which is somewhere in the neighborhood of 27 pounds. So don't expect to be commuting with this thing, that is unless your hobby already happens to be lifting heavy things and putting them back down. Now it's worth noting though that the additional weight does come with some benefits. There is. We'll figure that out in a moment. We've got the same ruggedized build with these rubber corner protectors on it. And there is considerably more room to build in here. That is actually a pretty reasonable amount of space. And this time, the keyboard folds out away from the tower, which is a very welcome change for my poor wrists. I mean, imagine if it was like the last one where you had to sit and use it like this. Not to mention my poor hands since the last case had the GPU inside venting directly up at the keyboard causing it to get hot enough to cook on. Unfortunately, the keyboard design hasn't changed and it still sucks and so does the teeny tiny little attached trackpad. The good news though is we get a nice monitor upgrade. Not only are there three displays now, but they've been sized up from 16.1 inches to 17.3, or 18.5, depending on which part of the product page you believe. No, 17.3. One thing the product page makes no mention of, one way or the other, is the ergonomics, and I gotta say, at a normal sitting height, I sincerely hope that these are IPS type displays, because otherwise, I'm not gonna be able to see anything on them. Also, wow, these hinges. Like most laptop displays, these use embedded display port or EDP, which means they need a controller board in order to accept desktop signals. So those are in here, which makes sense. But what doesn't make sense is the manufacturer opting for ancient VGA cables as the default to connect to them. Modern GPUs don't support VGA natively at all. And these boards have HDMI inputs. Also, it would probably just make even more sense to use DisplayPort since EDP is functionally compatible with it. But I guess that would have made things too easy. Enough about the case for now though. Let's turn our attention to the PC that we'll be building inside it. Now normally AMD's 16-core Ryzen 9 7950X3D wouldn't be our first choice. The 7800X3D performs roughly the same in games at a much lower price. However... The extra cores should help us in non-gaming tasks like video editing, while still maintaining the same 120 watt TDP. Besides, we already spent a ridiculous amount of money on this case, so we might as well do it out. Which is exactly why we went for the ASUS Crosshair X670E Gene. It's got two USB 4, 40 gigabit per second ports, Wi-Fi 6E and 2.5 gig ethernet, allowing high-speed access to everything from... a portable storage drive to a high-capacity network storage appliance. Now look, realistically, any board with a compatible chipset would have been just fine, but this motherboard happens to have the CPU socket just a little bit higher up, which we hoped would help us fit a better cooler into the system. Too bad it didn't. Cooling ended up being quite the journey for this machine, because originally we wanted to go for liquid cooling, but... Any radiator that was big enough to result in an improvement over air-cooling, stubbornly refused to fit anywhere. And while we could have mounted it to the outside, does this thing really need to be even sillier? So we tried to assassinate our thermal troubles with one of these fine coolers. The problem is that our case was just barely too short. Relatable. After a bit of searching we came across the RZ620 from PC Cooler. They sent this and a few other coolers to us for the all-China PC, but when we assembled it in testing it got in the way of our GPU. So after all of that we went with the NH-L12SX77. It's not really designed for a high-powered chip like ours, but according to Noctua it is better than its predecessor while offering higher clearance for RAM. So, good luck. On the subject of RAM, we're going to be using this kit from King Bank, of all people. It's a Sharp Blade 32 gigabyte 6,400 megatransfer per second kit that King Bank explicitly lists the ICs for, which can be really helpful when it comes to compatibility and performance on AM5. It has no issues fitting under the L12s cooler, even with a bottom-mounted fan, and the white heat spreaders match our SSD, even if nothing else in the build is white. On that subject, we've gone with the Crucial T705 with white heatsink. Okay, PCI Express Gen 5 makes no meaningful difference to real- world performance, but hey. Under ideal conditions, this thing can hit read and write speeds in excess of 10 gigabytes a second. And since we're going overkill, we might as well include Tom's Hardware's fastest SSD on the planet to go along with our fastest GPU on the planet. I see. Fastest I get, but is there a reason we went for the biggest GPU on the planet? It's not... The biggest. The biggest is the Zotac PGF4090D, but that one is a China exclusive and we can't get it out very easily. Ah, I see. So I have the second biggest 4090. But this was about more than just eping. See, our last MA case build thermal throttled pretty spectacularly, and we hoped that by having a very large cooler, we could avoid the same issue this time. Of course, we need to figure out... How the devil to get this card packed in here? Oh. Oh, good. A Universal Vertical Graphics... Oh, that explains why we couldn't just use a regular C-type downdraft cooler, and we needed the small form factor one. Oh, things are about to get tight. Now Linus, I can hear you saying, \"Why are you making such a big deal out of this? The card fits just fine.\" And that would be true if Nvidia, in their infinite wisdom, hadn't brought us the acclaimed 16-pin 12-volt high-power connector. Because at this case height, we either need to plug it in and then put on the side panel and mash it down and hope for the best, or we need to use a 90-degree adapter, either of which could lead to spontaneous combustion. Making matters even dumber, remember how our display cables need to connect internally to those little boards? Well, if we had the GPU here, we would need to run three HDMI cables, at least two of them, on these DisplayPort-to-HDMI adapters, through this tiny little hole in the chassis right here, that even one adapter doesn't fit through. Absolutely flippin' genius. Without further ado then, let's get our GPU installed on our Cooler Master vertical graphics card holder kit. Guess I got a little carried away talking. Let's go ahead and get this motherboard installed real quick here. Now this bad boy goes in here and this is gonna go in here. That is surprisingly tight. You're gonna have to take that out. What? I have to take the fan out? Yeah, you really gotta take the fan out because what you want to do is get this back a little way so that you can get the cables in there and you don't have to route them through the outside of the case. Oh no! I don't even get a cooling fan for this thing? Nope. Well, we've got some concessions. Just like this whole thing is a big concession. I'll take a hot dog. So we need to give this a little slide and then my poor one intake fan needs to come out. Now we plug in our poor cables that are about to get mashed I need to move this bracket or this brace This is clearly not going to be staying in Yeah, there's gonna be a lot of things you're gonna have to remove there. But what now do we have air intake coming in? No, that's where the handle is. What's the plan? We have a replacement side panel that we are going to cut a couple holes in and then make look kind of nice. I can see from how the side panel doesn't have holes in it yet that we have not tested this. No, no, but that's why we have Justin. Wow, this looks awesome. Now to simplify our cable management a little bit, we're gonna be using these Lian Li fans that clip together a little something like that. And then we're able to power both of them, including their RGB, with a single lead. Not going to lie, that actually looks kind of sick, and check this out guys. We are at least kind of pretending that this is for a long-term deployment. So we're going with a positive air pressure setup using these filters, right here and here, and we'll be using them to bring fresh air. Okay, I promise there's a method to this madness. Directly to our CPU cooler right here, and to our GPU right here. And the reason that we didn't put them exactly vertically mounted, is if you take two fans that spin the same direction, and put them one right on top of the other, you end up with a ton of turbulence and noise. They can kind of end up working against each other. But, if we take that fan, and we put it between these other two, so the blades are spinning in the opposite direction, the effect shouldn't be as bad, in theory. Not gonna lie, this actually looks as powerful as it is now, but on the subject of power, we're not powering any of it yet. For that, we are going to need a power supply. Now. This case is compatible with full-sized ATX power supplies, but now that our GPU is here, you can see that there would be a bit of an interference issue. So we've gone with an SFX power supply from Cooler Master, specifically the V1100, one of the most powerful small form factor power supplies on the market. I mean, I feel like I say this every time I open one of these, but really, 1100 watts in the palm of my hand? I mean, they cheated a little bit. This modular interface is not really inside the chassis, but now this is interesting. With the full size adapter bracket on here, you can see that this sits almost right up against the GPU, which hilariously, if you note, the feeder here is going to allow our power supply to act as a GPU support bracket. Before we plug that in, though, probably a good time for us to get these HDMI cables plugged into our little daughter boards here and then. Maybe hide them behind the GPU. Man, now that we got a window, it's gonna be tough to make this look good. Now, there was some debate about the orientation of our power supply and honestly, both ways have merit. If we had the fan facing this way, right here, it would be drawing fresh air in through our speed holes, which is obviously good for having lower temperatures in our power supply. But I wanted to try it this other way and see if that would be okay because then... The fan could help contribute to exhausting some of the hot air that is otherwise going to be, I mean, what, basically just kicked out by this tiny little fan right here and then passively through the holes in the case. Alright, time to wire this thing up. Now you might have noticed that our GPU power cable doesn't match the rest of our power cables. That's kind of the theme of the build, isn't it? Random white components that don't match the rest of the black ones. I'm just gonna put two screws in for a quick power-on test, but I gotta say, man, the fit of this acrylic panel is awesome! Considering all Justin did was what? 3D scan the case? We got life in there? Oh yeah, buddy! Did I plug the power supply side of that Molex cable in? I did not. Okay, that, my friends, is why you never close a side panel before you've actually verified that the system posts. Any luck? Yep, you got power. Nice! Oh, hey, look at that! There we go! Freaking awesome! All right, let's lose this. Wow! Let's turn on our memory overclocking profile, give it the old save and reboot. How glorious is it, you guys? It's pretty glorious. When I was doing a test run of it, I also set up NVIDIA Surround. They're not the brightest monitors, but hey, this isn't the brightest computer. The sagginess is very noticeable. I got frame view launched with the track pad so we can monitor our frame rates and temperatures, but I did notice a small problem. This track pad is even worse than I remember it being. So I was like, oh, I'll just plug in my, where is the front IO? Ah, how convenient. There we go. And what's great about this design is that it's not like you could just use the middle display on its own and not have these hanging out. Nope, nope, whole thing deploys or nothing. No HDR, these do not support HDR, in fact, we haven't really talked about this yet, but they are IPS type, which is nice, the viewing angles are okay, but they are 1080p, 60Hz only. Conceivably you could replace the panels with something else, but my goodness, would that ever be a lot of work. Tanner, quick question for you, is that, oh, is there an on-screen display for the monitors? So theoretically, there should be one for the actual controller boards that are in there, I looked at the spec sheet for the chip that's on there, and yeah, it seems like there should be a couple of buttons for some sort of OSD, but we don't have access to it. So no, there's a button at the front, I think that this bezel presses the buttons and tells it that, hey, the monitor should be off. Is that a reset button? Maybe it's just a reset button. A reset button would make a lot of sense. Let's see what the oh, yeah. Yeah. No that computer is definitely restarting. Oh, okay What I want to know is how our temperatures are gonna hold up I think the best part of those thermal results is we could totally do better. If we managed to squeak a bigger cooler in there, maybe a couple more fans, not only would our GPU manage to turbo to 2.7 gigahertz, I think we could prevent it from thermal throttling on the CPU as well. Though if we were to actually deploy the system for real, there's another major consideration, and that's that we would need to work in some kind of bracket to support that GPU. We had the system restart, not once, but twice. While just moving it around on the set from being on that PCI-E riser. Pretty minor issues overall though. Good proof of concept. Now one thing that I missed is we actually screwed in the holes for these little rubber corner reinforcement pieces. So we don't even have to give up a ton of ruggedness. Let's go ahead and pop these on, and then I think we're ready for our little trip to Starbucks. Of course you guys already saw that that didn't really go so well, so you've got to be wondering, what is this thing for? Well at about $1,500 US dollars with shipping and that's just for the chassis the peripherals and the monitors It's obviously a niche device, but for the folks who need something Kind of portable it ended up just shy of 40 pounds fully built And with this kind of performance like an on-location film crew or a scientific expedition It's actually surprisingly price competitive with pre-built solutions from specialty companies like this one Just be aware you're gonna have to be ready for some compromises Like the ergonomics completely suck unless you tilt it up about this much Otherwise you're looking down at the monitors and unless you're willing to get a little bit jank like we did You are almost certainly gonna have to be dealing with overheating unless you go with a more basic spec At which point you've got to be asking yourself. Why didn't you just buy a laptop? So yeah, it's kind of bad. Like this bad segue. To our sponsor. To Savory Fathers Day, Ridge sent me to find some dad jokes in Vancouver. We had a dad. Give me some dads. My neighbor gave me a new roof and he said that it was on the house. Is your dad funny? Where does the dad keep all his dad jokes? Pocket? In his dada base. What biscuit flies? Little plain ones. So a polar bear walks into a bar, says to the bartender, \"I want a rum.\" And coke. The bartender says, \"What's with the paws?\" The polar bear says, \"Well, I was born with those.\" Hmm. I've got the dictionary tattooed on my stomach. Adds definition. This is a Ridge new MechSafe wallet. You can put it on top like this. Do I have a gift for my dad? No, I'm not buying my dad anything, but I do call him. What's your catch? It's for your father. Okay, yeah, I'll give it to my dad. Do you have a wallet? No. You don't have a wallet? I have a rubber band. Oh, fancy. The future is here. Right now, Ridge has a 40% off for Father's Day. So there you go. Awesome. Check out the website at the link below. If you guys enjoyed this video, maybe check out our video on the 58 by 9 resolution signage display from LG. It worked about as well as this case. But managed to be even wider.",
    "transcript_keywords": [
        "GPU",
        "case",
        "power",
        "thing",
        "kind",
        "GPU power cable",
        "cooler",
        "power supply",
        "fan",
        "Yeah",
        "dad",
        "cables",
        "Make",
        "coffee shop",
        "GPU power",
        "good",
        "build",
        "things",
        "bit",
        "supply"
    ],
    "transcript_entity_values": [
        "ATX",
        "40%",
        "12-volt",
        "Starbucks",
        "nearly 40 pounds",
        "one",
        "DisplayPort",
        "second",
        "1080p",
        "the ASUS Crosshair X670E Gene",
        "Ridge",
        "first",
        "LG",
        "90-degree",
        "SSD",
        "10 gigabytes",
        "Cooler Master",
        "Tanner",
        "9",
        "One",
        "China",
        "RGB",
        "RZ620",
        "32",
        "6,400",
        "PCI Express Gen 5",
        "120 watt TDP",
        "IO",
        "VGA",
        "Noctua",
        "NVIDIA Surround",
        "GPU",
        "40 pounds",
        "today",
        "16",
        "Zotac",
        "58",
        "King Bank",
        "4090",
        "12 kilograms",
        "27 pounds",
        "PCI",
        "Justin",
        "RAM",
        "a ton",
        "1100 watts",
        "the NH-L12SX77",
        "AMD",
        "Tom's Hardware's",
        "18.5",
        "Lian Li",
        "Cooler",
        "MA",
        "three",
        "at least two",
        "CPU",
        "Ryzen",
        "40 gigabit per",
        "Wi-Fi 6E",
        "16.1 inches",
        "Sharp Blade",
        "Nvidia",
        "about $1,500 US dollars",
        "2.7 gigahertz",
        "Vancouver",
        "Linus",
        "60Hz",
        "2.5",
        "Universal Vertical Graphics",
        "two",
        "OSD",
        "EDP",
        "Molex",
        "17.3"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "LOC",
        "QUANTITY",
        "PERSON",
        "ORG",
        "MONEY",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}