{
    "id": "46C33cO4A3c",
    "title": "OLED Nintendo Switch Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-11-15T20:30:42Z",
    "video_url": "https://www.youtube.com/watch?v=46C33cO4A3c",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 907670,
    "likes": 25048,
    "comments_count": 980,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(energetic music) - Hey guys, it's Justine! And in front of me is the brand new Nintendo Switch. This is the OLED version, and I'm so excited about this. So a huge thank you to Nintendo for hooking me up with one of these. This thing has gone on a journey. So over the past couple of weeks, I was back visiting my family. We rented a cabin in Maryland, so I had it shipped there, but FedEx, for whatever reason, didn't deliver it on time. I'd already left that location, but then they decided to deliver it. I was no longer there. So then I had to have the Airbnb company ship the Switch all the way back to California. So this thing has gone all across the United States over the past couple of weeks. And it is finally here and I could not be more excited. Normally I play most of my video games over the holidays. So we're gearing up for video games season, and I can't wait for the new \"Animal Crossing\" updates. That also means I may or may not be live streaming on Twitch again. So stay tuned for that. Let's open this up, check it out. Ah! So beautiful. Like, look at this. The white version looks so good. We've got our first Joy-Con controller. We've got our second Joy-Con controller. Here it is. Oh boy. This is so exciting. Like the smile on my face, it actually is, my face is hurting from smiling so much. Look at that! Oh! Look at this display. Look at this new little kickstand for the tabletop mode. Yeah, this is a way better design than the previous version, that's for sure. Okay. Continuing on. We have the dock, and in the only white color. Look at that. This is nice. This little cut out there for your cables. This is all new too. Check this out, man! So excited about this. You've even got an ethernet cable for our local area network. And I like it the USB ports are right there on the side now. Okay. Now for the real test. Feels a little bit heavier, actually. Not like significantly, but like, it feels like it's got definitely some more substance and weight to it. Oh boy. It looks so good. (logo chiming) Oh, yeah. Okay. But just for the sake of comparing, like this is the, that's just, that is a huge difference. This looks so great. Oh, you're giving me a tutorial. I didn't understand what was happening here. Okay. Let me learn how to use this. (bright music) How to transfer your \"Animal Crossing\" island from one Switch to another. Oh my goodness. You'll only be able to transfer \"Animal Crossing\" onto a new Switch if both the new Switch and old Switch are present. Okay, we've got that. So I have a lot of set up to do on this new Switch. I'm currently downloading \"Mario Kart\", \"Animal Crossing\", and I have the island transfer tool on here. And I don't know if you guys can see up here, but you can tell already, like there's such a color difference. This one is so much more vibrant. The screen is obviously a lot larger. I am about to hop on a flight here very shortly and I cannot wait to take this with me and play on a plane. That's what I like about my Switch the most. I mean, I beat \"Zelda\" on a plane and I was all alone and I was like celebrating in my seat and I was so excited and like the person next to me was just like, \"Cool. Okay, good job.\" And I was like, \"Yeah,\" I was like, \"I just beat the game.\" And he's just like, \"Cool. Are you an adult?\" I'm like, \"Yeah, sure am.\" So I've been playing with the OLED Switch for the past couple of weeks now, and I am so obsessed. I took it on a trip recently, and using this on the airplane was so awesome. It's so hard to even explain how much better it is than the previous version. Even my friend Ed, who was a little bit suspect about getting it, 'cause he didn't think it was gonna be that much of a difference, after I showed him the difference, he was like, \"Okay, I need to get this immediately.\" Like it's honestly so crisp, so clear, and having the larger screen, especially if this is something that you do play handheld, you're gonna notice a difference right away. I mean, look at this \"Mario Kart\" gameplay. (traffic light beeping) (engines roaring) (exciting music) Oh gosh, it's so smooth. It's so much smoother than the previous. (coins clinking) That was an impeccable shot. (lively music) There's also something else that I just recently ordered and they just came in. So I thought I would include it in this video. These are the controllers for Super Nintendo. We have the regular NES, and hold on. The N64 controller. What's exciting is with Nintendo Online, you can have access to so many old school games and now you can actually play these games with the controllers that they were intended to be played on. How exciting. Like this is so great! I can't wait to play \"Mario 64\" using the Nintendo 64 controller. I can't wait to play \"Mario Kart 64\" or play \"Zelda\". I'm gonna play all of the things that I possibly can. (package rustling) This feels like my childhood. Ooh! Why I love Nintendo 64 so much, is because I felt like I was a little bit older. So I actually really understood video games so much more. And this controller is so iconic. Oh my goodness. What a controller. So I'm gonna dock my Switch, get this all synced up and play a Nintendo 64 game on my TV in 2021. All right. Here we go. I've got my N64 controller and we're about to hop in here. Look at the, oh, what are we gonna play? All right. Let's play \"Mario Kart 64\". (logo whooshing) Oh my God, the sound. (chuckles) This is seriously taking me back to my childhood. I freaking love it. Wow! Just want to preface this by saying this is an 8K television. Okay, here we go. It's happening. This quality is impeccable. (upbeat music) (engines roaring) Look at those blocks. Okay. Power sliding it's still a thing. This is where I learned a power slide. Okay. I gotta work on my controls a little. I'm like trying to power slide on all the places that I used to when I was a child. Ow, oh my God. I'm so bad. I'm so bad. If I don't come in first, I'm gonna be very upset. No! Second place. This is a bunch of lies. All right. Well, I'm definitely getting the hang of it. Playing \"Mario Kart 64\" on the actual Nintendo 64 controller it's pretty much the coolest thing ever, wow. (relaxing music) Thank you guys so much for watching. I'm so excited to keep playing the OLED Switch. It's been so much fun and it's almost the holiday season, which means I will actually have time for video games after this crazy tech season is over. Hope you guys enjoyed this video and let me know in the comments below what you're most looking forward to coming out this gaming season, and I'll see you guys in the next video. Bye!",
    "transcript_keywords": [
        "Mario Kart",
        "Switch",
        "Animal Crossing",
        "Nintendo",
        "play",
        "Mario",
        "OLED Switch",
        "controller",
        "Kart",
        "Justine",
        "video",
        "Nintendo Switch",
        "video games",
        "games",
        "Animal",
        "Crossing",
        "Yeah",
        "excited",
        "difference",
        "guys"
    ],
    "transcript_entity_values": [
        "second",
        "one",
        "OLED",
        "Switch",
        "2021",
        "Justine",
        "Nintendo",
        "Mario Kart",
        "N64",
        "Animal Crossing",
        "the United States",
        "the OLED Switch",
        "Nintendo Online",
        "Second",
        "Twitch",
        "Zelda",
        "Nintendo",
        "8",
        "Switch",
        "the holidays",
        "Maryland",
        "Nintendo Switch",
        "the holiday season",
        "Ed",
        "NES",
        "California",
        "the past couple of weeks",
        "Airbnb",
        "Super Nintendo",
        "first",
        "USB",
        "FedEx",
        "Joy-Con"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON"
    ]
}