{
    "id": "46vL5E8ILkM",
    "title": "This GPU will be PRICELESS...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-10-12T02:25:36Z",
    "video_url": "https://www.youtube.com/watch?v=46vL5E8ILkM",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "nVIDIA",
        "rtx 3090 tI",
        "GPU",
        "chip shortage",
        "graphics card",
        "leak",
        "geforce",
        "nvidia gpu",
        "rtx 3000 series",
        "refresh",
        "PCIe 5.0",
        "3090 Ti",
        "3090 ti leaks"
    ],
    "views": 607783,
    "likes": 31250,
    "comments_count": 1080,
    "description": "Check out the Volta GIGA today at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 Give Thanks Yo 0:11 RTX 3090 Ti leaks 1:06 Apple appeals Epic lawsuit 2:09 Pixel 6 Pixel Pass 3:06 Alex talks Volta GIGA charger  3:35 QUICK BITS 3:42 Sony + TSMC sitting in a tree 4:12 Ampere 128 core ARM CPU 4:39 China limits crypto investment 5:06 Instagram 'nudges' 5:35 Sony Play at Home   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/r91ag",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/Dt4h1",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Happy Thanksgiving! Yeah, Canadian Thanksgiving is a month before America's. We had, you know, we had different pilgrims arrived a month early, had beaver instead of Turkey, there's a few differences. Those rumors a few weeks back about NVIDIA releasing in RTX 3090 Super were apparently wrong. So what's NVIDIA actually doing? Producing more stock of budget and mid-tier cards for hungry gamers? Oh, no, no. It's just the name that was wrong. Okay. That rumored card is actually going to be the RTX 3090 Ti. Ti, not super. It's very different. This is all according to leaked specs, which claimed the 3090 Ti will unsurprisingly feature massive performance, thanks to more cores, a 450 watt TDP, that's a hundred Watts, more than the 3090, and a PCI express 5.0 power connector capable of delivering up to 600 Watts. The leaked information indicates a January launch, no pricing info yet, but I wouldn't worry too much about all that as I'm pretty sure you'd need to sell some vital organs in order to get one. (chuckle) Please do not do this. We don't need people selling body parts! Epic games appealed the judge's ruling in their lawsuit against Apple almost as soon as it came out. But Apple actually seemed pretty happy with it. They described it as a resounding victory. Well, Cupertino's had a while to think about the ramifications of the ruling, which requires Apple to allow app developers to include buttons or links to alternative payment methods, and the company has now decided, Yeah. You know what? We're all, we're all appealing. You guys appealing? You're appealing, Emily? - [Emily] Oh, yeah! - Okay. The new policy was supposed to take effect December 9th, but Apple's claiming that's not enough time to work through the complex and rapidly evolving legal, technological, and economic issues at play here. It's a button, Apple. Just let them put a button in. To be fair though, because the judge did largely affirm Apple's vision of the app store. Even if apple ends up allowing those third-party payment options, they might be entitled to a cut of the payment anyways, making the whole thing very confusing. And yes, I'm making a tech longer about this. It's just taking a very long time. It's the name, it's. Hey, more Google pixel 6 leaks. This time, where does spreading about a pixel pass subscription that not only would include the phone itself, but a bundle of Google services. YouTube premium, Play Pass and Google one with the latter, including perks like extra cloud storage and advanced photo editing. Subscribers would also get an extended warranty and the possibility of annual hardware upgrades. That way, Google gets more monthly revenue and makes it more difficult for people to switch phones, which I guess is a good thing, for Google. The news comes after more leaks from This is Tech Today claiming the Pixel 6 will be more of a value phone at an MSRP around 750 US dollars. Well, the 6 Pro will go for a $1,040. There's only one week to go until Google's official reveal, making it a race against time to see who will reveal everything about the phones first. At this point, it's like the marriage has already happened and that event will just be signing the certificate, which is kind of fun, but it's like. - Now it's time for Quick Bits brought to you by Volta GIGA charger, which can help you clean up your desk and declutter your workspace by charging four devices simultaneously. They're doing what the EU is trying to do to Apple. Consolidate. The GIGA comes with either 130 watt or 200 watt configurations, and it's compatible with all fast charging capable devices. Accordingly, for a device that's all about fast charging, Volta uses express worldwide shipping and comes with a 30 day money back guarantee. So check out the Volta Giga charger at the link down below. - Quick bits! Oh...oh, man. Aw...they are just so darn quick. Like if they could. Reports indicate that Sony and Taiwan's TSMC are thinking about taking their relationship to the next level and building a chip fab together in Japan, which would be subsidized by the Japanese government. Sony doesn't think that chip shortage is going to be over until 2023 at the earliest. So having that additional capacity in Japan would be helpful in case the geopolitical showdown between China, Taiwan and the US somehow affects TSMC operations in Taiwan itself. I'm guessing none of those powers are going to be invited to the wedding. This is an elopement. That's what this is. Chip maker Ampere has announced the successor to their ultra line of ARM-based enterprise processors. The new ultra max M128-30 with a whopping 128 cores seems to obliterate AMD's and Intel's competing chips in cloud computing workloads, but in other memory intensive situations, it actually does worse. So while arm chips are gaining ground, you might want to wait a bit before you install one of these in your server farm that you statistically don't own. China's crypto crackdown has no end in sight as the country may soon implement restrictions or bans on investing in cryptocurrency mining, in addition to its existing ban on mining itself. But the good news for investors is that Bitcoin is still surging at the moment, despite China's anti crypto maneuvers, because technology is only cool when you'd lets you control people more facial recognition, great install it everywhere. Blockchain stuff? Gross. - [Emily] Eww. - I want my fingers in there. Facebook and Instagram have announced it will take new measures to protect the younger users in the wake of a whistle blower's report, claiming that Instagram recommended harmful content to teens, such as content promoting eating disorders. Users will be nudged to look at something else or to just take a break from the platform completely apparently using the incredibly successful Don't Do Drugs campaigns from the nineties. Posting carefully curated pictures of the fancy hotel I'm staying in on my vacation. Nah, I'm good. Thanks. And do you remember Sony's play at home campaign last year, which gave away free games during the height of the pandemic. Sony recently revealed that over 60 million games were handed out without costs to PlayStation owners. Of course, it's pretty clearly a strategy to build goodwill towards the PlayStation brand, but on the other hand, free games. That's it for this episode, guys, come back on Wednesday for more tech news. That is if you're not still knocked unconscious from all that delicious Turkey and beaver mash. Don't eat beaver. Don't do that.",
    "transcript_keywords": [
        "Canadian Thanksgiving",
        "Apple",
        "Google",
        "Thanksgiving",
        "Happy Thanksgiving",
        "Volta GIGA charger",
        "Volta GIGA",
        "time",
        "Sony",
        "watt",
        "Volta",
        "Taiwan",
        "NVIDIA",
        "Yeah",
        "games",
        "GIGA",
        "Quick Bits",
        "China",
        "Google pixel",
        "month before America"
    ],
    "transcript_entity_values": [
        "Turkey",
        "a month early",
        "Volta Giga",
        "6",
        "Ampere",
        "December 9th",
        "America",
        "Volta GIGA",
        "Intel",
        "last year",
        "Cupertino",
        "3090 Super",
        "5.0",
        "US",
        "a hundred",
        "NVIDIA",
        "a few weeks",
        "EU",
        "2023",
        "over 60 million",
        "Google",
        "Japan",
        "the nineties",
        "3090",
        "450 watt TDP",
        "TSMC",
        "Watts",
        "Japanese",
        "monthly",
        "130 watt",
        "Instagram",
        "30 day",
        "Quick Bits",
        "only one week",
        "1,040",
        "128",
        "January",
        "annual",
        "third",
        "China",
        "a month",
        "first",
        "Tech Today",
        "AMD",
        "Sony",
        "Facebook",
        "Canadian",
        "Bitcoin",
        "Thanksgiving",
        "750 US dollars",
        "Wednesday",
        "four",
        "Blockchain",
        "Taiwan",
        "PCI",
        "MSRP",
        "GIGA",
        "200 watt",
        "Volta",
        "up to 600",
        "Emily",
        "YouTube",
        "PlayStation",
        "Apple"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "LOC",
        "NORP",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "GPE",
        "DATE",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG"
    ]
}