{
    "id": "48me0zS9Gk4",
    "title": "And STILL no USB-C iPhone...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-06-07T01:03:13Z",
    "video_url": "https://www.youtube.com/watch?v=48me0zS9Gk4",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Apple",
        "WWDC",
        "WWDC22",
        "WWDC 2022",
        "iOS 16",
        "iPadOS 16",
        "macOS Ventura",
        "M2",
        "Apple Silicon",
        "Apple M2",
        "Macbook",
        "M2 Macbook Air",
        "Stage Manager",
        "Passkeys",
        "M2 Macbook Pro",
        "watchos 9",
        "USB-C iPhone"
    ],
    "views": 507422,
    "likes": 28047,
    "comments_count": 979,
    "description": "Join us in War Thunder for FREE at  and get an exclusive bonus using our link - thanks for supporting the channel!   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 Riley is lying 0:05 WWDC 2022 Highlights: M2 0:38 M2 Macbook Air + M2 Macbook Pro 1:13 macOS Ventura 2:02 iOS 16 2:33 iPadOS 16 3:20 Google loses defamation suit 4:16 War Thunder 4:51 QUICK BITS 4:56 Intel Arc GPUs showing up 5:29 Elon Musk threatens Twitter again 6:01 Motorola software flaw 6:23 Russia to turn on German telescope 6:51 Shane Wighton's magic hoop   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://playwt.link/ltttl",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/8PdZM",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Whoa, I had no idea there was tech news in here. Turns out there's a lot. At Apple's annual Worldwide Developers Conference, the company announced its latest Apple silicon chip, the M1 Hyper Max which only manifests when you strap two Max Studios together. Just kidding, that's. They finally announced the M2. It's got up to 24 gigabytes of unified memory instead of 16, and two more GPU cores for a total of 10, although they're still keeping the old four powerful and four efficient CPU cores design, as well as those classic graphs comparing an apple silicon chip to the vague idea of some theoretical computer not made by Apple, weird. The M2 will show up first in the new MacBook Air design which throws out the old tapered look for something that looks like a MacBook Pro that was sat on by Thanos. It's faster, and it's got MagSafe, two USBC ports, and a headphone jack, and also has a power brick with two USBC ports. So I guess it's actually super easy to slap extra USBC ports on things. Remember the 2015 MacBook? You'll also be able to upgrade the 13\" MacBook Pro to M2, but only the small one. Apple will let you upgrade the bigger ones when you're ready. And running on those new MacBooks is the new macOS Ventura. I thought it was weird they didn't have someone announce this while manually moving their own butt cheeks, but hey, that's just me. Ventura's Stage Manager feature lets you group windows, and swap between groups while seeing app previews on the left. Spotlight now supports rich web results, and shared tab groups lets you share a web browsing session in real time with collaborators. But the coolest thing about Ventura was probably pass keys which will replace passwords with biometric authentication on an iPhone, even on non-Mac devices, hmm. Apple also announced their own take on a DLSS style feature with MetalFX upscaling, meaning you're gonna be gaming on a Mac now, whether you like it or not. Finally, Continuity Camera will let you use your iPhone as a webcam in a rare admission from Apple that their laptop cameras might not be amazing. What is happening? What's happening is we're not done. iOS 16, out as a developer preview today has lock screen widgets just like Android 12 which brought them back after not having them since Android 4. Innovation. Messages will let users edit and unsend messages as well as mark threads unread, all of which does not require RCS supports. Thank goodness. Here's another revolutionary feature. Are you ready? When using voice to text the keyboard will stay open. - [Man] Whoa. - Astonishing. Almost as astonishing as the iPad's brand new weather app, and background download API's which were not there before, somehow. Yep, that was sarcastic, but this next part isn't. Apple has gotten back to turning the iPad into a desktop class machine, so there's support for a new collaboration features using their version of Google's Workspace boards, new tools for developers to make more desktop class apps, and even display scaling, and virtual memory swapping to customize how the tablet looks and performs. But last but not least, iPadOS will have Stage Manager, resizable windows, and an expandable desktop when you connect to external monitors, it's happening. We don't- - [Man] It's just a laptop. - We don't know why it's happening, but that's just the defaults human condition, so it's fine. I want an iPad now. Okay now for some non Apple stuff. Google is being forced to pay Australian politician John Barilaro 715,000 Australian dollars, or about 515,000 USD, for failing to remove relentless racist and abusive videos, quote unquote, posted by YouTuber Jordan Shanks. Barilaro initially requested that Google take the videos down, but the company denied the videos were defamatory. Seems kind of weird, but this is Google's Australian branch we're talking about, things swirl the other way down there, I. So Barilaro took Shanks to court which ended up in a settlement requiring Shanks to pay $100,000, and to edit his videos which presumably gave Barilaro the confidence he needed to take on the tech giant directly. It's an interesting example of why tech platforms have scrambled to crack down on some potentially harmful types of speech, because even Google probably doesn't have enough lawyers to handle lawsuits from everybody that's been called something horrible online. Now it's time for quick bits brought to you by War Thunder. The free-to-play online military vehicle combat game available on a variety of platforms with Crossplay. It features an incredible arsenal of more than 2000 historically accurate playable tanks, aircrafts, and ships from the 1910s to vehicles still in service today. You'll compete in massive, combined arms battles on over a hundred major battlefields from World War II to modern environments. War Thunder's vehicles are implemented with a high level of authenticity and detail, but only the unclassified kind. Head to the link below, and start playing War Thunder for free. You'll also get a free bonus premium vehicle for signing up. Quick bits. It's never not a great time for quick bits. Find them in the snacks aisle. Intel's GPUs are still coming, okay? But just in case you're getting worried, Reference laptop manufacturer Clevo just announced the X270 gaming notebook, the first model confirmed to feature Intel's higher end Arc A770 M mobile GPU inside. And Intel just showed off a physical Arc desktop graphics card at the Intel Extreme Masters Gaming tournament. So rest assured, the GPU's are coming. I just hope their arrival doesn't feel like getting a cold Uber Eats order once they actually get here. But, Elon Musk is super serial about getting out of his Twitter acquisition deal, as the billionaire just sent Twitter a letter telling them how serious he is. It's an angry letter. Musk wants the platform to prove that it's users are less than 5% bots before he pays up. But, as analysts have pointed out there are a number of rules that might force Elon to complete the acquisition anyways putting critics of the buyout in a strange position. When you don't want Elon to take over Twitter, but you do wanna see him forced to do something against his will. Ah, what to do? Checkpoint Research has identified a software vulnerability in Motorola phones built with a Unisoc Tiger T700 SoC. That's a process, it's chip. But a patch has now been issued, so if you have a Moto G20, E30, or E40 make sure you update when you can, and check your parents' phones, just to be safe. They probably haven't updated, ever. They need you. Russia's space chief Dimitri Rogozin told the press that Roscosmos is going to try and turn the German operated telescope aboard its Spktr-RG spacecraft back on after Germany halted its cooperation with Russia Following the invasion of Ukraine. German officials have warned Russia against doing this as Russia may cause damage to this telescope. So, they should be careful. I mean, Germany sometimes takes longer to write the manuals than build the actual device. They're very detail oriented. And YouTuber Shane Whighton has created a basketball hoop that will calculate the trajectory of a thrown basketball, and move itself so that it's a swish, swish every time baby. Check out the video which unfortunately doesn't address the fact that you will still miss a hundred percent of the shots you don't take, that's the next level. But you should definitely come back on Wednesday for more tech news, because you'll miss the tech news from 100% of the tech news videos that you don't watch. You probably never even thought about that before.",
    "transcript_keywords": [
        "Apple",
        "Apple silicon chip",
        "Worldwide Developers Conference",
        "USBC ports",
        "Apple annual Worldwide",
        "War Thunder",
        "Hyper Max",
        "Max Studios",
        "Apple silicon",
        "Google",
        "MacBook Pro",
        "tech",
        "Ventura Stage Manager",
        "videos",
        "USBC",
        "Stage Manager",
        "latest Apple silicon",
        "War",
        "Barilaro",
        "MacBook"
    ],
    "transcript_entity_values": [
        "USBC",
        "YouTuber Jordan Shanks",
        "playing War Thunder for free",
        "iPad",
        "Arc A770 M",
        "Germany",
        "RCS",
        "non-Mac",
        "100,000",
        "Clevo",
        "Dimitri Rogozin",
        "YouTuber Shane Whighton",
        "Intel",
        "100%",
        "Ukraine",
        "Android 4",
        "Elon",
        "Motorola",
        "the Intel Extreme Masters Gaming",
        "Elon",
        "the 1910s",
        "M2",
        "715,000 Australian dollars",
        "Barilaro",
        "Moto G20",
        "Unisoc Tiger T700 SoC.",
        "over a hundred",
        "E40",
        "iPhone",
        "Google",
        "about 515,000 USD",
        "a MacBook Pro",
        "Shanks",
        "World War II",
        "Crossplay",
        "13",
        "John Barilaro",
        "Android 12",
        "today",
        "X270",
        "MagSafe",
        "API",
        "2015",
        "Twitter",
        "Thanos",
        "less than 5%",
        "Checkpoint Research",
        "Spktr",
        "M1 Hyper Max",
        "Australian",
        "10",
        "first",
        "E30",
        "16",
        "two",
        "War Thunder",
        "Elon Musk",
        "German",
        "Wednesday",
        "four",
        "GPU",
        "I. So Barilaro",
        "Mac",
        "Russia",
        "a hundred percent",
        "Shanks",
        "CPU",
        "Continuity Camera",
        "MacBook Air",
        "jack",
        "Roscosmos",
        "Ventura",
        "Apple",
        "MacBooks",
        "24 gigabytes"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "EVENT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERCENT",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "NORP",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY"
    ]
}