{
    "id": "4AJ3v9a61Ew",
    "title": "My NEW JerryRig Knife! - How did I get my scars?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-12-18T15:13:32Z",
    "video_url": "https://www.youtube.com/watch?v=4AJ3v9a61Ew",
    "category": "Howto & Style",
    "tags": [
        "JerryRig Everything",
        "JerryRig Knife",
        "Favorite knife",
        "best knife",
        "utility knife",
        "razor knife",
        "JerryRigEverything knife",
        "cool tool",
        "best tool",
        "survival tool",
        "DIY"
    ],
    "views": 774498,
    "likes": 37904,
    "comments_count": 2604,
    "description": "Grab your own JerryRig Knife HERE:   If you've been looking for the coolest Razor Blade Utility Knife ever, look no farther. I've made my own. The JerryRig Knife has an all metal design, and easy swap blade system that can change blades in seconds. Utility blades can be found all over the world for pennies apiece. I'm a huge fan. And I hope you like it as well.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.JerryRigKnife.com",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "You might have noticed that I kind of like using razor blade knives. I think they are pretty much the most versatile tool on the planet. Like, if I had to survive an apocalypse with only one tool, a razor blade utility knife would be it. I've been carrying one pretty much every day for the last 14 years. But not all razor knives are created equal. I've tested quite a few different styles over the years. Some are just built super cheap and have all kinds of wiggles...which is not really something you want while holding a razor sharp object. Other knives are large and bulky, with components, or the whole thing being made of plastic. And when I'm looking for a good tool, I want it to be solid, cheap, easy to use, but still look cool enough to carry every single day, which is why I've gone and designed my own. And, of course, I'm a little bit biased, but this really is my favorite knife that I've ever owned, and I think you'll like it as well. People have always asked me if I've ever accidentally cut myself with a razor, and I think today is a good time for that discussion. Let's get started. [Intro] I have a few scars on my hands from various projects over the years. This one over here was from accidentally dropping a big rock on my finger as a boy scout. But the one over here on my left thumb is probably the most noticeable. This happened when I was about 8 or 9 years old. I was using a coping saw, one that I got from my Grandpa Jerry, to cut flying pencil people out of wood...you know, because that sounded like a fun project at the time. I mean...it still sounds like a fun project. But the saw was really sharp and cut through that last inch of wood way faster than I anticipated...and went right into my finger. And I did have to go get a few stitches. But up to this point I've still never cut myself with a razor blade. I have, however, cut myself pretty bad with a dull metal pry tool while I was recording a video. But I've never shown that footage until now. It's not super gruesome. I do pull my finger out of the frame before any real damage gets shown, but if you get queasy you might want to fast forward about 30 seconds. I sliced myself during my floating Death Star speaker video about 2 years ago. If you watch the first half of the video my thumb is perfectly fine and in one piece like thumbs should be. And what I'm showing you now is for educational purposes since it's not always the sharp knives that get you...it's the dull knives. And this completely dull pry tool sliced into my thumb so deeply... It's not my lucky day. ...That I had to stop filming for a week while it healed enough for me to continue and finish the video. Long story short, don't mess with the Death Star. But I still have yet to take damage from a razor blade. Knock on wood. I've been working on my newest knife for the past year. You've probably seen it in some of my more recent videos. It's my own creation and I'm pretty excited about it. The first thing you'll notice out of the box is the striking tessellated hexagonal pattern that gleams differently in the light depending on its position. You might be asking, Hey Jerry, did you borrow that texture from dbrand's Swarm Skin? And all I'm saying is that these tessellations, found very, very commonly all over the place in nature, (and maybe on dbrand's website), provide excellent grip while still looking way cool. The JerryRig Knife has solid metal construction. The handle is cast from an aluminum and zinc alloy, giving it a heavy substantial feeling in the hand that will last for years. I've gotten pretty used to opening and closing my knives with one hand, but just like with any knife, if your fingers are in the way of the blade as it's closing, you can just say goodbye to your fingers...especially since razor blades are sharp. Razors are razors, and razors cut stuff. Like it will literally slice off your entire finger if you're not paying attention. And I don't want any angry emails from moms of 9 fingered kids. So use the knife at your own risk. With the solid metal construction, there is no wiggle between the handle and the razor holster, which is very important. My favorite part of this utility knife though is the quick release blade system. Any time your knife gets dull, the blade can be flipped over and put back in. Or just replaced entirely. The replacement razor blades are universal, found all over the world, and cost only pennies. There's nothing proprietary here...just like it should be. A spring-loaded locking mechanism holds the blade tightly inside the body of the knife when it's closed. And it won't be falling open on its own. And of course, this wouldn't be a Jerry Rig Everything video if I didn't show you how it all works from the inside. If you want to snag one of these for yourself, just head over to jerryrigknife.com, or click the link down in the description. The knife handle is held in place by a torx T7 screw. Torx screws are used a lot in cell phones because the extra fins give the screwdrivers more grip on the head, and more torque can be applied to the screw itself, meaning there's more grip on the parts being held together. We've got one beefy screw acting as the fulcrum for the locking lever. And two more screws down at the bottom holding the end piece with the solid metal rod acting as a spring. The metal rod pushes up against the locking lever to click the knife open, as well as holding it closed when the knife is shut. I'll give you a better look at that in a second. The pivot point for the razor holster is actually pretty interesting. And I'm not making this up, the joint we are using is called a sex bolt. I'll explain why when you're older. There are two parts: one part that is smooth and allows the knife part to rotate inside of the handle. And another part that's threaded which goes inside the other portion to clamp everything together. The smooth shoulder keeps the threaded screw from tightening too far and restricting the knife's movement. The white washers are also there to keep things rotating smoothly. The reason I'm showing you all of this is so we can see how it works, as well as if you ever want to customize the knife yourself you totally can. You know, life is a DIY project. The part that holds the razor is also pretty interesting. The top plate is held in place by three more of those T7 screws. And then we get a look at the all-metal quick release button for the razor blade. It's got two little springs on the back that push it up to lock the blade into place. And once that release button is pressed down, the blade can slide freely out to be rotated or swapped for a new one. It's like getting a whole new knife for only 10 cents each time you pop in a new blade. There's also a little stabilizing metal band along the bottom to keep the actual razor from jiggling from side to side in the enclosure. We've added a lot of details to make this a quality contraption. The belt clip can also be removed. Pocket knives can sometimes be really expensive, but I'm keeping mine cheap enough so that losing one won't break the bank. Over the years I've lost about 4 or 5 of these knives to the TSA when I forget it's in my pocket while traveling. Sometimes I can just throw out the razor blade part and they'll let me keep the knife handle. But other times they've made me get rid of the whole knife, which is annoying, but at the same time not a deal breaker since the knife isn't all that expensive to begin with. This is what the knife looks like inside of the handle. I did contemplate making a clear version, but I really wanted to avoid plastic and transparent aluminum, or aluminum oxynitride, would have raised the price of the knife by a few hundred dollars. So we'll have to wait a little while longer for that transparent edition. These knives are ready to ship though. You can set yours on a shelf like a trophy, and keep it all pretty as some sweet Jerry Rig Everything swag. Or you can get it all scratched up and dirty like the tool it was designed to be. Or maybe buy two and do both. Jerryrigknife.com. Whatever you do though, stay away from flying pencils and the Death Star they are both pretty dangerous. Show me your knives when we hang out on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "knife",
        "razor blade",
        "razor",
        "blade",
        "knives",
        "pretty",
        "razor blade knives",
        "Death Star",
        "years",
        "razor blade part",
        "tool",
        "cut",
        "part",
        "knife handle",
        "handle",
        "metal",
        "Jerry",
        "Razors",
        "video",
        "Jerry Rig"
    ],
    "transcript_entity_values": [
        "Death Star",
        "about 30 seconds",
        "only pennies",
        "9",
        "Jerryrigknife.com",
        "every single day",
        "about 8 or 9 years old",
        "the last 14 years",
        "Instagram",
        "Jerry Rig",
        "two",
        "a few hundred dollars",
        "only 10 cents",
        "three",
        "Jerry",
        "Grandpa Jerry",
        "The JerryRig Knife",
        "years",
        "a Jerry Rig",
        "only one",
        "T7",
        "DIY",
        "the past year",
        "about 2 years ago",
        "5",
        "first",
        "second",
        "the first half",
        "today",
        "TSA",
        "about 4",
        "a week",
        "one",
        "Twitter",
        "the years"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}