{
    "id": "4axuf8Qvotw",
    "title": "iPhone X Review: Great, But Not Grand",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-11-08T05:33:32Z",
    "video_url": "https://www.youtube.com/watch?v=4axuf8Qvotw",
    "category": "Science & Technology",
    "tags": [
        "iphone x review",
        "iphone 10 review",
        "iphone ten review",
        "iphone x vs note 8",
        "iphone x vs iphone 8",
        "mrmobile",
        "michael fisher",
        "imore"
    ],
    "views": 585351,
    "likes": 22316,
    "comments_count": 2273,
    "description": "By this point, you probably know that the iPhone X is the most expensive iPhone Apple has ever offered  and you might also have heard that its the best iPhone the company has ever made. Both of these things are true. The question, then, asks itself: is the best iPhone actually worth a thousand dollars? Come find out in MrMobile's iPhone X Review, brought to you by Tech21.   [SPONSOR]  This video sponsored by Tech21. Get your Tech21 iPhone X case from Verizon Wireless:    [SUBSCRIBE]     [ABOUT MRMOBILE'S iPHONE X REVIEW]  MrMobile's iPhone X Review was produced following five days with a retail iPhone X handset purchased from Apple by Mobile Nations. The iPhone X review device was tested on T-Mobile US in Eastern Long Island New York, with an additional iPhone X review unit tested on T-Mobile in Greater Boston, MA. Neither device was paired with a wearable.   [FURTHER READING]  iPhone X Review [iMore]:    [MUSIC]  Live Up by Cymatix, available at Premium Beat:   First Thing by JAM Studio, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://vz.to/2AqwxqC",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.imore.com/iphone-x-review",
        "https://www.premiumbeat.com/royalty_free_music/songs/live-up",
        "https://www.premiumbeat.com/royalty_free_music/songs/first-thing",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] By this point you probably know that the iPhone 10 is the most expensive Apple has ever offered. And you might have also heard that its the best the company has ever made. Both of these things are true, but to me the question is whether that phone is worth the 1000 dollar price tag. I'm Michael Fisher, and this is the Mr. Mobile review of the iPhone 10 brought to you by Tech 21. If you're unclear on the difference between a hands on video and a review, this is the perfect opportunity to clear the waters. Last week, when I had just a few hours with the iPhone 10, I found its gesture-based interface complicated, clunky. Its face-ID locking mechanism only on par with Samsung's similar system. Well it turns out, this is the kind of device that you have to live with for a while. I'm not saying they're flawless, the gestures are less intuitive than on the Blackberry and Palm platforms that inspired them and an unlock mechanic that makes you look at your phone is still less convenient than a fingerprint sensor. But after almost a week's use in the world, this phone's gestures now feel natural enough to make the old home button seem archaic. And I've discovered that in about four out of five cases, face ID is so fast, that I don't even notice its working, I just swipe to unlock. The occasional inconvenience of having to punch in a pin isn't great, but its also not a deal breaker. On paper, the side-keys on the iPhone 10 are so confusing that Apple included a cheat sheet right in the box. But again, you get used to it. Summoning Siri with a side-key feels natural enough if you've ever used a walkie-talkie. I think its worth the side-effect of now having to use two buttons to turn the phone off. As for Siri herself, well (sighs). You also have the option of mapping a five-click shortcut to 911 so you can call the police quickly in a sticky situation. Yes, I still notice the notch in day-to-day use but I've come to like it more, not less. No other phone looks quite like this. And when IOS calls attention to the notch, it does so in just the right way. Developers have been adapting their apps to accommodate it so rapidly that many of my complaints from a week ago no longer apply. Now practically speaking those looking for the maximum amount of screen area will still be better served by the iPhone eight plus. And that phone's LCD technology is also less prone to the burn-in that the iPhone 10s OLED panel might suffer over time. So the 10 is still the less practical choice, the phone for flashy folks. Maybe there's no better illustration of that flashiness than an emoji which uses face-mapping to do this. Yeah, this is a dumb feature, but its here to showcase Apple's emergent focus on augmented reality. So expect this tech to be used for more important features in the future. I was more excited for the portrait-mode capability on the front facing camera, but so far I got to tell you that's been a big let down. Edge detection just isn't good enough to reliably separate subject from background. So you get awkward artifacts and bleed overs. Just like we've seen since the first day's of portrait-mode over a year ago. Google, has Apple soundly beat here with its pixel two line. And it got there with far less trial and error. In more traditional photography the iPhone 10 brings the same great performance as the iPhone eight, now with optical stabilization on the telephoto camera as well as the primary. Also like the eight, the 10 can shoot 4K video at 60 frames a second. And full HD slo-mo at 240. That's something not many Android phone's can do yet. Since the current top of the line quark on silicon doesn't support it. But again, with the exception of those selfie portraits and animoji, both of which are terrible, you can get nearly the same output from the iPhone eight plus. And the competition from Samsung holds its own. Those who don't like the Galaxy Note eight's punchier colors and higher contrast have a full sweet of manual controls right out of the box. I'm using the Note eight as an example because of its price similarity to the iPhone 10, but between Samsung, Google, LG, HTC and Huawei the ranks of really good cameras in the smartphone world are getting crowded. To its credit, the iPhone 10 does really nail the fundamentals. Its voice calls are crisp with good side tone. Its dual speakers are clear and louder than ever. Its battery is big enough to get you through a long day with no problem, even with a few hours of hotspotting. And its glass and steel frame feels every bit the luxury indulgence its advertised to be. And yet, look I'm the biggest phone nerd I know and even I can't get over this thing's 1000 dollar price tag. The Note eight, I keep referring to, is up there in price too, but its 50 bucks cheaper and brings so many more features that comparing the two is, not even apples to oranges, we're talking apples to durian. Meanwhile the iPhone eight, which shares so much of the iPhone 10s DNA, starts at 700 dollars. That's a massive mark-up for a look. This is not the first time Apple has pushed the limits on price, back in 2007, the first iPhone ws expensive too and it lacked features like 3G and GPS, that even at the time were considered essential. But that iPhone, was a revolutionary rethinking of what a smartphone should be. The iPhone 10 isn't nearly as ambitious. The edge-to-edge screen, the dual-stabilized cameras, the wireless charging, the gesture interface, they're all great, but we've seen them before. And even on this 1000 dollar smartphone, Apple charges an additional 75 dollars to let you fast-charge it. A feature that comes standard on every Android flagship. Its kind of hard not to see that as a cynical cash-grab by one of the richest companies on the planet. Now, here's why none of that matters. Apple has a well earned reputation for excellent customer service and its got an ecosystem that people are willing to spend more to be a part of. In a country like the US where carriers let you spread the cost of a phone across one or two years, someone who wants to stay in that ecosystem, but doesn't want a boring old design, suddenly has the option of paying 40 or 50 bucks a month for this truly beautiful hardware. If I were a lifelong iPhone user, I'd definitely be one of them because there's so much to love about this device. But I come from the Android world where there's so much quality available for half or even a third of this phone's price, that I just can't get past it. The iPhone 10 is a great smartphone for rich people or for the Apple loyalist who wants to splurge to celebrate the iPhone's tenth anniversary. If that's you, you're gonna love this device. If that's not you, then almost any other option will be a smarter use of your money. One more thing, the iPhone 10 also seems to be no more durable than any other glass on glass smartphone. So if you do take the 1000 dollar plunge, set aside another few bucks to protect your investment with a protective case from today's sponsor, Tech 21. These folks have been building phone cases for over 10 years using scientific materials tested in partnership with the National Physical Laboratory. The Tech 21 Evo range with flex-shock material, gives you an ultra slim profile with 10 foot drop protection. Designed specifically for your iPhone 10 to keep it covered, drop after drop. Get yours, from Verizon Wireless at the link in the description below. Be sure to subscribe to The Mr.Mobile on YOuTube for more reviews just like this one. Til next time, thanks for watching And stay mobile my friends.",
    "transcript_keywords": [
        "iPhone",
        "phone",
        "Apple",
        "price",
        "Tech",
        "smartphone",
        "Michael Fisher",
        "dollar",
        "Note",
        "dollar price",
        "apples",
        "Samsung",
        "dollar price tag",
        "Android phone",
        "Android",
        "great",
        "time",
        "phone price",
        "time Apple",
        "features"
    ],
    "transcript_entity_values": [
        "10 foot",
        "Huawei",
        "50 bucks",
        "1000 dollar",
        "eight",
        "third",
        "40",
        "Michael Fisher",
        "half",
        "10 years",
        "10s",
        "Galaxy Note",
        "the National Physical Laboratory",
        "Samsung",
        "Apple",
        "700 dollars",
        "OLED",
        "the first day's",
        "60",
        "tenth",
        "10",
        "a few hours",
        "Verizon Wireless",
        "Mobile",
        "3",
        "today",
        "US",
        "iPhone",
        "just a few hours",
        "first",
        "LCD",
        "One",
        "five",
        "240",
        "Michael",
        "Google",
        "two",
        "4",
        "IOS",
        "2007",
        "Siri",
        "second",
        "Last week",
        "an additional 75 dollars",
        "911",
        "LG",
        "one or two years",
        "Blackberry",
        "HTC",
        "Tech 21",
        "almost a week's",
        "Evo",
        "about four",
        "a week ago",
        "a year ago",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}