{
    "id": "4bdwBjBaJvI",
    "title": "Google Pixelbook Unboxing - Could You Switch?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-10-29T18:50:17Z",
    "video_url": "https://www.youtube.com/watch?v=4bdwBjBaJvI",
    "category": "Science & Technology",
    "tags": [
        "google pixelbook",
        "google pixelbook unboxing",
        "pixelbook unboxing",
        "pixelbook",
        "unboxing",
        "review",
        "pixelbook review",
        "google",
        "google pixelbook review",
        "pixel book",
        "pixel",
        "google pixel",
        "pixel 2",
        "android",
        "chrome",
        "chromebook",
        "laptop",
        "notebook",
        "best laptop",
        "2017",
        "best laptop 2017",
        "unbox therapy",
        "unbox",
        "therapy",
        "unboxtherapy",
        "iphone x",
        "vs",
        "gadgets",
        "chrome os",
        "google assistant",
        "pixelbook pen",
        "chromebook pixel",
        "tablet",
        "keyboard",
        "computer",
        "pixel pen",
        "2017 chromebook",
        "samsung",
        "smartphone",
        "apple",
        "iphone",
        "iphone 8"
    ],
    "views": 2025293,
    "likes": 42413,
    "comments_count": 3459,
    "description": "Unboxing the new Google Pixelbook. The Pixelbook is Google's latest entry into the Chromebook space. It's got a premium build and premium price to match. The Pixelbook features a convertible design capable of switching between laptop, tent and tablet mode. Is the Pixelbook ready to stand up against the Macbook and the Microsoft Surface? ___________________________________________  DON'T Buy A Wireless Speaker Without Watching This...   Xbox One X Unboxing   The Most INSANE Dual 75-inch Screen Setup!   Unboxing The iPhone X Clone Edition   You've Never Seen A Keyboard Like This...   Samsung Galaxy S9 Concept   You've Never Seen Shoes Do This...   TOP SECRET SMARTPHONE UNBOXING   The Fidget Spinner Phone Is Real...   They Say It's The Fastest In The World...   Would You Wear This Thing In Public?   Google Pixel 2 and Pixel 2 XL Hands On!   Unboxing The Mind Bending Wallpaper TV...   iPhone Is The Most Successful Product Ever   DON'T Buy The iPhone 8, Buy The iPhone 8.   Using A Flip Phone In 2017...   Get The iPhone X Notch On Any Phone...   How To KILL The Samsung Bixby Button...   So You Want An S8 But You've Only Got $150...   iPhone X - Something You Should Know Before Buying   Unboxing The $5000 Massage Chair...   DON'T Buy This \"Mini\" Smartphone   The Most Ridiculous Purchase...   iPhone X Face ID Unlock Fail    FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/Db17w0DjDS0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/0CrwDj5zcT4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/LJMpjVx0xjQ?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Szuw_XJsv1w?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/8b0TenoBMTo?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/nTCsZFkK36o?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/1WnbD0YVAlE?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/ZRxenHv0oPs?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/DjKEZbe4V9M?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/JMZbfc9MFE4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/ICfeLG-yXH0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/N1Idlk4VgjA?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/JJ5WP2BKigc?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/voHKjE0tIDE?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/8ZRCdfaAIy0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/zYC0gw7g1zA?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/wWBI1j9l7BY?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/zlesUiYkp_4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Cc0WWP45plE?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/Vwm4ewiv5HM?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/po0wYKqmaSE?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/ibmKAhhsvz4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/AU-jn17V7zk?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://youtu.be/unIkqhB2nA0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "We've got the brand new Google Pixelbook in front of me today. And now it's got its own companion pen as well: the Pixelbook Pen. It also works for Google Assisstant... ...if you guys watched the keynote, you can circle somebody's face... ....it looks up that person and searches them and so on... ...and then you can also activate Assistant with your voice. If you look right over here... 7th generation Intel Core i5 processor. 8 gigs of RAM, a 256 gigabyte SSD. So what you are looking for... ...is a machine that can do what your smartphone does but potentially faster... ...and with an input method of a keyboard and with a bigger display. This could be your companion. Is it gonna be a replacement for your laptop though? That kind of depends on what you do on your laptop. If you're like me... ...and you do a lot of video editing... ...well, probably not. But if you're a person who's mostly inside of email and web browsers and so on... ...it might do a better job than what you're using right now. Nice little experience there. So what you're gonna see here is that the design cues are taken from the Pixel phones... ...with this striple on the top. This is quite thin and light. I think it's around 2.5 pounds. Metallic construction. On this side over here is a Type-C USB connector. And if I flipped it around to the other side... ...there's another Type-C connector as well as a headphone jack. Also here, is what looks like volume? And then, probably a power switch. Solid, surprisingly solid. Look it's bootin' up straight away. Okay now one thing I like about this... ...is the aspect ratio of the screen. Now everything on the desktop... ...and in smartphones is going taller. But there is a case to be made... ...for a more tranditional aspect ratio when it comes to productivity. Things like email and so on... ...work really well on the screen like this. The keyboard here is backlit. It's a Chiclet style. Kind of Macbook X. The trackpad is glass, it actually feels quite nice. And then where your palms rest is crazy soft. This could be a nice place to type. Now of course the magic happens when we flip this over like this. Look at that. All of a sudden now... ...you're in tent mode... ...and then of course we can fold it completely flat because it is a touch screen interface. It's capable of running Chrome apps, web apps, or Android apps. So it essentially turns into an Android tablet when you're holding it like this. Also inside the box... ...we have some slender paperwork there... ...a USB power brick Type-C connector there... ...and of course a relatively long USB Type-C cable. Now of course we've also got the pen... ...so I wanna crack this open. It's a quadrupel A. Oh my goodness. Feel like I need to revaluate my existance, my childhood. And of course, since it's using the Wacom technology in here... ...you have a pen tip similar to what you have on the Wacom drawing tablet. You might be thinking why wouldn't it just be rechargeable. Well, the battery lasts really long time. I don't know if you've seen pictures of the Apple pencil charging. But it's... it's a little awkward to say the least. Now would be a good time to mention... ...that Google claims that you can get 10 hours of battery life out of this. Of course that's gonna vary depending on your usage. So I've got it booted up now. You have your web apps, your basic ones down below. You know you got Chrome where most things are gonna happen. Gmails, Docs, and of course YouTube. Now it's chewing through this 4K video streaming like nobody's business. Alright, so if you're wondering the benefit of having more horsepower on a Chrome book... ...this is the kind of thing that can bog down some laptops just even doing a 4K stream. So you're looking at 2400x1600 pixels. It's a lot taller than you might be used to if you're using a tranditional laptop right now or a wide screen version. But at a 12.3 inch form factor... ...that's quite a lot pixels to play with hence the image quality. Look at that. I mean it is so responsive. Inside of Chrome, it's about as fast as I've ever experienced. Even when I go to just like load up a new video. It's like now obviously that takes into account my internet speed here... ...but I've used many laptops on this particular Internet. So now what's special here is there's a few different ways to launch into Assistant. I can do so with a dedicated Assistant button... ...I can do so with my voice, or I can do so with the pen... ...and the button that's featured on the pen. So for starters, I'm gonna try the key. From here, I can type in a request, a question or something like that... ...or I can hit the microphone button here... ...and use my voice as input. So that's probably the coolest way to be honest. OK Google. Who is Willie Do? Here is a matching video... Definitely not Willie Do. You need to step your internet profile game up, alright, sir? OK Google. What is Unbox Therapy? According to Linked in... ...Lewis Hilsenteger is the creator of Unbox Therapy... ...an online show dedicated to consumer products. OK Google... ...how much does the Pixelbook cost? According to The Verge... ...Google's Pixelbook laptop starts at 999$... ...and can be priced all the way up to 1499$. It doesn't end there... ...because I can use the pen for Assistant as well. So if I launch into the web browser here... ...and look at images, check this out. I can hold this button, circle my face, and it'll figure out who I am. Lewis Hilsenteger, Internet personality. Here's mountain Everest, now let's circle it. Oh mountain Everest, there he nailed it. You know this is a mountain. OK Google, play Unbox Therapy videos. Oh wow. OK. Now let's listen to a little bit of SoundCloud real quick to check out the speakers. It's firing up there. I mean, they're decent. They're not the best laptop speakers I've ever heard. I really don't recommend using speakers in general on a laptop if you don't have to. Maybe you can put your headphones on it's gonna be a lot better. This does have a dedicated headphone jack that you can utilize. But they get the job done. And if you quickly need to watch a video and so on. That's kind of cool, this button on the side; the power switch. If you just tap this button here, it kind of starts to fade away. And if you hold it long enough it'll log you out it, it's kind of like a quick dedicated log out button. Smart Lock for Chromebook Beta. Unlock your Chromebook with your Android phone. I'm gonna try to set this up right now. Your phone is locked. Unlock it to enter. Are you seeing this right now? OK here we go, I'm gonna do this. This could be magic. Fingerprint and click your photo. I'm in. So I'll sleep it again. And now it looks and it goes yellow. It stays locked, your phone is locked. Unlock it to enter. So i pick up the phone. Use my fingerprint, you saw the green immediately go to the unlocked position. OK, so there you have it. The brand new Pixelbook, unboxed, tested it out a little bit. Obviously, I need to use this more comprehensively before I make up my mind... ...about how much I like it and so on and if it can replace my other equipment. To be honest, I think at home, this could be convenient. I have a laptop and I kind of use it on the couch, and I put it on the coffee table... ...and all I really do is watch video, deal with email here and there... ...I'm not editing video on that machine... ...it's strictly for basic productivity, a document here and there... And that's where I could see something like this possibly being a step better. When you add in the pen, Google Assistant aspect... ...and most importantly the fact that this thing is convertible... ...it becomes somewhat compelling. But I know what you're gonna say, you're gonna say... \"But Lew, you can do that with Surface products\". And you're right, you can. And Surface products are really good. I-I'm not taking anything away from them. But, there is a customer out there... ...who doesn't need a full-fledged OS. At 1000$ I think a lot of people will still choose a Surface product. But I am happy that this thing exists for what it is. I'm gonna try to use my voice more frequently with it... ...and see if we're ready for the Google assistant future. Not just in our phones and our home devices... ...but maybe in our laptops. We'll see.",
    "transcript_keywords": [
        "Google",
        "Google Pixelbook",
        "Google Assistant",
        "pen",
        "Google Pixelbook laptop",
        "Assistant",
        "laptop",
        "kind",
        "video",
        "Pixelbook",
        "Unbox Therapy",
        "button",
        "Google Assistant aspect",
        "Chrome",
        "lot",
        "internet",
        "thing",
        "phone",
        "USB",
        "Android"
    ],
    "transcript_entity_values": [
        "Gmails",
        "Lew",
        "Docs",
        "RAM",
        "Surface",
        "256 gigabyte",
        "10 hours",
        "today",
        "USB",
        "SoundCloud",
        "jack",
        "Apple",
        "Everest",
        "Google Pixelbook",
        "around 2.5 pounds",
        "Android",
        "USB Type-C",
        "2400x1600",
        "Google",
        "7th",
        "Chromebook",
        "12.3 inch",
        "Willie Do",
        "4",
        "the Pixelbook Pen",
        "Lewis Hilsenteger",
        "8",
        "one",
        "Wacom",
        "Pixelbook",
        "Chiclet",
        "Chrome",
        "Intel Core"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}