{
    "id": "4ecN7yGcqcQ",
    "title": "M1 iMac Unboxing and Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-05-18T13:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=4ecN7yGcqcQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 884268,
    "likes": 33542,
    "comments_count": 2048,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and in front of me is one of the brand new M1 iMacs and we are going to unbox it. Not only am I going to be unboxing this one, but I'm also gonna be unboxing every single color combination. That's gonna be in a separate video, so look out for that one. Let's start with the pink one first, 'cause that's my favorite. This is the moment. Are you ready? Are you ready? Are you ready Jenna? Is everybody ready? - [Woman] I'm ready. I'm ready. I don't even think I need a knife. They make it very easy to open (laughs). I don't even know where to start. Like, this is so exciting! I'm so excited, I might cry. This is like honestly a dream that I had ever since I was little is like this, I'm living my dream right now. Not only do we have the iMac on the front but it's also on the back and this little handle is a nice complimentary color to the actual computer. (cardboard hitting ground) Oh, oh it say's hello! Oh my goodness. It's so beautiful! Let me spin this around for you guys. (cardboard scraping) Oh, here it is. Oh my goodness, it is so light! It's like I'm holding nothing. This is like a big iPad. (packaging sliding) Whoa! This kind of looks like a very similar color to the AirPods Max, actually. So this is the pink version, but this looks a little red to me. (paper peeling) Does this look familiar to you? The original \"hello\"? (upbeat music) Look, here's a little pull tab right here to just pull. (paper crinkling) This is so light! Let's see what else is in the box. I like that they match the keyboard and the mouse and all of the accessories to the iMac color that you choose. Look how pretty this is! Whoa, check this out! It's the ethernet port inside of the power brick. I hardly ever use ethernet, but now I will just because you're here. Whoa, this magnetic charging port is pretty incredible. I know they weren't calling it MagSafe but I'm just gonna go with MagSafe. No way, they even have the track pad! Look how pretty. Here's the new keyboard with the touch ID. (paper crinkling) That's exciting. Can't wait to edit this video on this iMac. This is so cool. It's a Lightning to USB-C. This is fashion. Wait, what about this? Oh, I wonder if there's anything else? Oh, there's a mouse! I can't believe how beautiful this is. I'm completely redoing my office. It is gonna be themed. I guess it's already themed in pink. So I'm just gonna go home and put this where it belongs (laughs). I do like that they've kind of made this contrasting color, so like the back of the computers is a darker color to go with the front, which is a very light. I know people were saying that they would prefer this to be a darker bezel around it. I like the white. Anything else in here? Oh yes! We have the actual power cable. Oh my goodness they gave you a sticker for the front and the back colors! I could almost hide behind it, can you see me? (Justine shuffling) - [Woman] Yeah. - Oh. This looks very, very good. So this is the 24 inch display, and the fact that this is so thin and light, it's really impressive. So what's great about the new iMac is the fact that they've been able to consolidate everything with the M1 chip. The thinness of these iMacs is so crazy. It is 11.5 millimeters thin and less than 10 lbs. So I'm gonna show you guys the comparison of how thin it is compared to the iPad Air. I mean, honestly, it's about two iPad Airs. Two, like it's wow, yeah, wow! Thin! The display is a 24 inch retina display. It's got a new upgraded camera, a new microphone. The 1080p FaceTime HD camera has a larger sensor and it has image signal processing to give you much better quality. There's a new studio quality three mic array with beam forming to help ignore background noises. It's 85% faster than previous 21 inch iMacs, 50% faster graphics, 3x faster machine learning. It's got four USB-C ports, two Thunderbolt. And of course, this new power connector, which is amazing. You could choose from one of the keyboards that has touch ID or one that doesn't. (relaxing music) So obviously you've seen how beautiful these computers are, but the one thing that is most impressive is how powerful they are. So I'm gonna be using this Envoy Pro FX Thunderbolt drive. This is made by OWC. I'm such a huge fan of their products. They are basically my main storage solution for everything. I edit directly off of these drives. I use them for backup. I'm gonna do a full video on that another day, but I have all of my content here that I'm gonna be editing. You can edit five streams of 4k and one stream of 8k on here, and on my M1 MacBook Pro I've been editing 8k videos and it's been running amazing. So I cannot wait to test that out. Let's open up my project. I'd already started this, it's kind of a rough edit at this point. This kind of looks like a very similar color to the AirPods Max, actually. So this is the pink version. So this is all 4k footage, 10Bit 4:2:2, right off of the Sony cameras. And it is running seamless. Like look at this. (fast-forwarded voice) This is actually a multi-cam timeline. So inside of here, I have two different angles, which is great because I can just go in and choose as I'm editing, which angle I want. So I just can go through press one, two, and it makes editing this video super quick. So I'm a huge fan of the magic mouse for editing because I do a lot of scrolling to be able to just scroll up and down the timeline is incredibly helpful. So this video is not quite done yet but the video that you're watching is obviously complete. So clearly, I did finish the video. So let's check out Lightroom. I have some photos here from camera camp. This is, oh my gosh, this is over a year and a half ago. So this is actually the launch of the iPhone 11. So, oh look, here's Tyler. Tyler, we miss you! Let's edit this little picture. I mean, this is running great. These are all raw images as well. Up that saturation. Give me some vibrance. That's a vibe. Add a little vignette. Oh my goodness! Do you want to print this out? I will, I'm gonna print this out for Tyler. Oh, look, there's Jenna! - [Jenna] That's my name tag! - That's you with your little name tag. Let's give Jenna a little bump there, turn those whites down, some of the shadows a little bit, (mumbles), there we go. Oh, look at that. You look great. This is when I dropped my iPhone the day that I got it. I mean, look how fast we're scrolling through all these photos too. One of the things that I also love about having the M1 chip is we're able to run iPhone and iPad apps simultaneously on here. So it's kind of giving you this whole new perspective of being able to use these apps. On your iPhone, you can really only run one app at a time, but I can open up multiple apps. So if I want to have something for like different recipes, if I want to have a meditation app open, or if I even wanna be doing yoga while I'm trying to cook and meditate at the same time with an iPhone app, I could do that, and so could you. So we're gonna download two (laughs) different meditation apps at the same time. So this is an app that is designed for iPad. Okay, we've got both of our meditation apps open. I feel like I'm gonna be so centered after this. Here we go. Let's play one. Let's play the other. (apps talking over each other) She wanted me to close my eyes. (apps talking over each other) I can't focus. What do you want me to do, do you want me to breathe or do you want me to open my eyes or do you want me to close my eyes? Let's play a video game. So I've been playing this game called Story Time. I got into this recently because I was on a flight that I didn't have wifi. And I didn't know what else to do. And I knew that some of the Apple Arcade games that I'd already downloaded don't need internet connection, which is incredible. This was one of the games that was available. I'm on like level, I don't even know. Like I'm over a hundred levels. Level 158 (button clicking). Another cool thing is you can also connect Xbox, PlayStation controllers to this. So you basically could be using this as a console. I already know how to play. I've already done it. (upbeat music) So here's the game, it's so fun. You just kind of like match colors. (game clicking) Oh, this is really fun with a mouse. (upbeat music) Oh, okay, I lost. I'll play that again later. Okay, so gaming feels nice. This doesn't seem to be like the most processor-intensive game ever. Let's crank these speakers. (upbeat music) Whoa! Always made me colder I don't plan to be a savior But I knew I was chosen - Surround sound speakers! Sounds, good to me! It feels like, and I ain't gonna believe - Now we need to test out doing a FaceTime call. Would you like me to, do you want me to do a FaceTime call? You wanted me to call you, call you maybe? Hi Jenna, how's it going? - Hey, good. - [Justine] I know you were just in here five seconds ago but it's really good to hear from you. - What you been up to? - [Justine] Well, we've been shooting an iMac unboxing video for two days, so, you know. - What's you favorite color? - [Justine] I like the pink and the purple and the blue. This is an all new, it's a 1080p camera. It has a larger sensor for better lighting, which I'm actually kind of, I would be back-lit right now. Since this is a new 1080p camera, let's test that out and see what some of the video footage looks like. (computer beeping) I mean, obviously it's not 4k. But, 1080p, I mean, I have some YouTube friends who upload in 720p and I don't think I want to claim that we're friends anymore. Do you remember when I used to make my YouTube videos using the eyesight camera - Yeah. - On my Mac book. - Yeah. - In 2007. - Yup, I do, actually. - And now in 2021, you basically can do everything right here. You kids don't know how great you have it. Back in my day. I love the new power brick that they have. It has an ethernet port, which is nice because that allows you to have a much cleaner workspace. So that's one less cable that you'll need if you do use ethernet. So I have my pink iPad Air here and I wanted to see how well it matches. 'Cause just in case you guys have a pink iPad Air and you want to make sure that it's gonna match your pink iMac, it's perfect. And you know what? Because this connects to Bluetooth, you could actually use the track pad and this mouse and the keyboard with your iPad Air. Got a lot of stuff happening back here. Oh, you look so nice. Looks good. I have already messed up my workspace. It's kind of like my desk. So this Mac obviously is equipped with the M1 chip. It also has 16 gigs of RAM. We have a 512 gig solid state drive, which is amazing because I do have this external drive which is 2 terabytes. If you do decide to get one of these computers and you are looking to save money, I always suggest kind of going a little bit less on the storage because you can always use external drives. So this does have the eight cores. We have the 4 performance and 4 efficiency, and it is completely specked out with the 16 gigs of RAM. I honestly can't say enough great things about the M1 chip. I've been using it in my MacBook Pro, my MacBook Air and the Mac Mini. So now having this new iMac kind of join the family, I'm so excited about this because it really is an all-in-one desktop solution. And these colors are amazing and they will look good in any room. I need to figure out where I'm gonna put these each, like in the house. Which one do you think will be the kitchen Mac? I think this'll be breakfast Mac. This will be my office Mac. If you guys have any suggestions of where I should put these in my house, let me know. And then I have to send them back. So that's sad, but until then, we'll give them a nice home. Thank you guys so much for watching. I hope you guys enjoyed this video. If there's anything else that you would like me to test out on this iMac, please let me know in the comments below. And of course, let me know which color is your favorite. Be sure to subscribe and hit the bell so you can be notified when I post a new video. And if you enjoyed this video hit the thumbs up and I will see you in the next video. (relaxing music)",
    "transcript_keywords": [
        "video",
        "color",
        "kind",
        "iPad Air",
        "iMac",
        "Mac",
        "pink iPad Air",
        "pink",
        "iPad",
        "ready",
        "Air",
        "Justine",
        "guys",
        "camera",
        "open",
        "great",
        "back",
        "good",
        "apps",
        "Jenna"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "4k",
        "one",
        "iPad",
        "3x",
        "USB-C",
        "iPad Air",
        "10Bit",
        "about two",
        "85%",
        "less than 10 lbs",
        "Justine",
        "2021",
        "Two",
        "Apple Arcade",
        "2007",
        "Sony",
        "OWC",
        "Mac",
        "MagSafe",
        "iPhone",
        "4",
        "M1",
        "three",
        "PlayStation",
        "158",
        "M1 iMacs",
        "11.5 millimeters",
        "the day",
        "16",
        "MacBook Pro",
        "FaceTime",
        "YouTube",
        "Xbox",
        "another day",
        "iMacs",
        "iPad Airs",
        "four",
        "1080p",
        "Lightroom",
        "five",
        "the Mac Mini",
        "M1 MacBook Pro",
        "RAM",
        "2 terabytes",
        "24 inch",
        "eight",
        "iMacs",
        "iMac",
        "two",
        "8k",
        "five seconds ago",
        "the AirPods Max",
        "the iPad Air",
        "Tyler",
        "50%",
        "MacBook Air",
        "first",
        "Mac",
        "Story Time",
        "Jenna",
        "512",
        "two days",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}