{
    "id": "4HX6R88QZB0",
    "title": "Original 2007 iPhone Unboxing!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-05-07T14:31:43Z",
    "video_url": "https://www.youtube.com/watch?v=4HX6R88QZB0",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "original iphone",
        "iphone unboxing",
        "original iphone unboxing",
        "first generation iphone",
        "iphone first gen",
        "first gen iphone",
        "iphone bill",
        "iphone x"
    ],
    "views": 5074288,
    "likes": 92453,
    "comments_count": 10570,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "Just follow every move Touch me Let me know you wanted to We don't have to leave We need It's a moment that I've been waiting for this is the original first generation iPhone. This is the 8 gigabyte model? I got it on eBay, and I don't even know if it's legit But I'm pretty sure it is I searched the serial number the IMEI number and everything Seems to have checked out it hasn't been activated the serial number has never been registered with Apple fingers crossed because I am doing today an unboxing of the first generation iPhone and it's crazy because I never Did do an unboxing over the first gen iPhone the only unboxing that I did do of the original iPhone? Was a phone bill you guys have never seen this. This is back in the day when I'd first got my phone It was a 300-page iPhone bill, so essentially in some sort of weird roundabout way. I did unbox this phone Just phone bill have an idea and I had to switch to AT&T okay. That's wonderful while I got my first 18d built In a box This phone means so much to me And there's a lot of sentimental value And the fact that I never really got a chance to unbox the original one may have been scouring eBay for the past couple of years trying to find one that was legit within minutes We will know I feel like this is such a big moment I don't even know what to do like I should I I don't know should I put on a party dress or something? I'm not I don't know I maybe I just open it hope for the best what knife would I have used in 2007? I don't even know some of the concerns that I have on this box that may potentially Lead me to believe that it's not real is this little packaging line right here There's a few tears of greater this has been around for 11 years, so it's trying to find some original unboxings and I saw some original photos and in those original photos of the original iPhone it looked like they used to have this type of Line in packaging, so I thought it's gotta be real. I think I'm putting too much. Hope and effort into boxing this one I just could open it and find out here. We go. We're gonna use this one. Wow. This is a lot of pressure. Oh Gosh I'm so signed so I might cry this is so stupid. Don't cry just seemed. Oh cried. Don't be a baby oh My gosh this is happening it's happening. It's happening. Oh wow Here it is What's my heart rate I caught my heart rate is that it's actually 92 right now Which is kind of crazy because that's not what my resting heart rate. Usually is. It's averaging of like oh my god It's 111 right now. My heart rate is 111 112 I'm getting so worked up. Please don't cry Like I'm actually getting a really teary-eyed right now and like whether this is real or whether it's not the fact that I'm here Unboxing this 11 years later, and I'm still doing something that I absolutely love to do is so incredible I'm so emotional right now. This is actually crazy, I oh So far this looks pretty legit There's like a little dad here. Oh gosh. No my baby my baby So far everything looks pretty good Before we get into the phone, let's see what else is in the box so has this clear little front I don't even remember doing this unboxing originally here it is everything is very snugly fit in here, which makes me believe this has never been opened before a Charging brick a Dock, I do not even remember this coming with a dog. That's crazy Here's our charging cable. Oh my gosh You are such a sweet, so it's all. I have not seen you in so long And last but not least Earpods Definitely having some flashbacks to this 30 pin connector. I mean I haven't seen one of these in such a long time I guess I saw on the 3GS, but still I honestly forgot that they even had this Now let's see what came inside of these directions you don't want to rip it. This is this is my baby? Fingertips, oh hello Came with a nice cleaning cloth Lay you down very very gently. That's what we're gonna put you here's our directions. I mean there's There's a lot We've also got the original white stickers I am putting this all back right where I got it from important product information This just looks like some safety things I think contain sensitive components do not bend drop a crush I felt your concern about scratching iPhone you can buy one of the many cases sold separately I should do a dramatic reading of this for a YouTube video. I might as well I'm gonna be milking these iPhone original views for a very long time Enjoy an unboxing and also re boxing because I don't want any of my things to get damaged so I guess this only leaves us With one more thing to do unwrap the phone and turn it on let's get our charging brick ready That is that is really on there You like it's gonna Rip this whole screen off. I guess this has been on there for Doesn't have a smell for like a what 11 years Do you guys think this will actually turn on do you think this will even work at all? It's charging it's charging. There's a charging if there's there's a charge look look look. It's charging. I am so excited I'm gonna let this charge for a little bit, and then I'm gonna come back And we will just do some investigating just see what we can do with this thing just been walking around the house patiently waiting for this moment let's see if it'll turn on Oh What you may have connected to iTunes That's a problem oh no I can't do that this version of iTunes has not been out for 11 years Okay, well if it wants me to connect it iTunes, then that's what I'm gonna do Know I know you know I know I'm Shh. Calm yourself opening up iTunes Itunes cannot connect to the iPhone because an invalid response is received from the device. It's valid Let me let show me. Oh god. How am I gonna even get this thing to work? oh Boy okay download full version of iTunes I can't use this Okay, so I'm good to go getting it a PC this is gonna work. I promise actually. I don't promise Supported systems Windows XP well on my own. This is not gonna work. Oh Gosh the real bottom line is the phone is legit. It looks brand-new. It's never been activated before I don't have to jailbreak it. Oh will I have to jailbreak it? I'm not sure this is gonna Take a lot more time than I have currently right now to dedicate to this but stay tuned because I will Get this phone to work. No matter what I have to do well guys. Thank you so much for watching I look forward to doing a little bit more of investigating with this phone. I'll see you guys in the next video I'm gonna get back to Working if you guys have any suggestions for me leave those in the comments below as of this point I have done Absolutely zero research on how to get this to work, so I have a feeling that between your comments My google searches and a little bit more investigation We will be able to get this thing up and running in no time. This is no that's not what I wanted to do Yeah, do whatever you want",
    "transcript_keywords": [
        "move Touch",
        "original",
        "iPhone",
        "phone",
        "original iPhone",
        "Charging",
        "generation iPhone",
        "follow every move",
        "unboxing",
        "Touch",
        "iTunes",
        "Gosh",
        "work",
        "heart rate",
        "iPhone original",
        "phone bill",
        "serial number",
        "years",
        "original photos",
        "guys"
    ],
    "transcript_entity_values": [
        "zero",
        "one",
        "iTunes That's",
        "this 11 years later",
        "iTunes",
        "Apple",
        "111 112",
        "2007",
        "300",
        "iPhone",
        "eBay",
        "30",
        "the past couple of years",
        "the day",
        "Windows XP",
        "YouTube",
        "minutes",
        "111",
        "8 gigabyte",
        "today",
        "11 years",
        "IMEI",
        "iTunes Itunes",
        "18d",
        "iTunes",
        "first",
        "92",
        "AT&T"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG"
    ]
}