{
    "id": "4ifjhApEYFQ",
    "title": "Is a $700 Gaming Laptop Worth It?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-05-05T15:00:35Z",
    "video_url": "https://www.youtube.com/watch?v=4ifjhApEYFQ",
    "category": "Science & Technology",
    "tags": [
        "gaming laptop",
        "asus tuf",
        "asus fx504",
        "asus tuf fx504",
        "laptop",
        "gaming pc",
        "$700 gaming laptop",
        "budget gaming laptop",
        "cheap gaming laptop",
        "best gaming laptop",
        "gaming",
        "notebook",
        "asus",
        "nvidia",
        "gtx 1050",
        "core i5-8300h",
        "intel",
        "is it worth it",
        "austin evans",
        "pubg",
        "rocket league",
        "fortnite"
    ],
    "views": 1674499,
    "likes": 34051,
    "comments_count": 2468,
    "description": "The $700 ASUS TUF FX504 gaming notebook on Amazon:  My favorite gaming laptop at $600:  One of the best gaming laptops at $800:   By using our Amazon affiliate links, you help to support the channel as we may receive compensation for purchases through those links.  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "http://austin.tech/asusfx504",
        "https://www.youtube.com/watch?v=BlMKftsnfWE",
        "https://www.youtube.com/watch?v=5lQB7F8mMW0",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. When it comes to gaming laptops when you go below $1,000 typically you have to deal with a lot of compromises. Take the Acer Aspire 5. It's $600, I've been incredibly impressed with this laptop. And sure it's not going to be the most powerful thing in the world, but it delivers a ton for the money. Step up to something like the Dell Inspiron 7000 series and for $800 you are going to be getting a ton more performance but you're still going to be lacking the fun toys at the higher end laptops. At $700 though the ASUS TUF FX504 looks like it could be the perfect sweet spot. At least on paper. Let's see how it actually stacks up though. At first glance it looks pretty decent so they're definitely going for the whole gamer aesthetic with the red accent and the fake brushed metal which I will mention is entirely plastic. Now something that ASUS claims on Amazon and well pretty much in all the marketing material this is a thin and light laptop weighing in at only five pounds and one inch thick. But I mean (laughs) thin and light this definitely is not. You're gonna notice this guy in your backpack. This is one of those cases where I actually feel like the laptop looks better on video than it does in person. Now the idea of having brushed metal is nice but honestly it feels very plasticy. And that comes across the stuff like the screen. So I mean if you just do a little bit of flexing here, it doesn't really inspire a lot of confidence. Especially considering that this is going to be a $700 laptop. Speaking of the screen, it's exactly what you would expect at this price point. So it's going to be a 15.6 inch 1080p panel and it's going to be pretty much mediocre. Now sure, the resolution is going to be decent. When it comes to the color and especially the contrast it's not going to be particularly accurate or particularly contrasty. And on top of that as soon as you get it even remotely off-axis the viewing angles fall off and even though it does get bright when you start to crank up that brightness it washes out even more. It's going to be fine but at $700, it would be nice to see a little bit of an upgrade. iPhone X is the most expensive iPhone ever. It has a bigger screen, smallest bezels. Speaker wise is actually going to sound pretty decent. It does have a pair of speakers that are going to be on these sides so it's not going to be quite as good as something that's going to be on the decklid facing directly toward you, but it's a lot better than most laptops that fire down into well whatever it is you're sitting on. Now the keyboard is going to be backlit in the same red that's all over the laptop and there's some good stuff with it. So I do think it actually has a really nice layout and I was able to get up to speed with it almost immediately. However there's a lot of key travel and it kind of feels a little bit mushy. It's maybe not quite as precise as I would like, but kind of splitting hairs here. For $700 laptop there's really no complaints. We've also got a decent track pad. So it is using Windows Precision drivers and while it's not going to be the biggest trackpad in the world, again it's totally fine. What isn't so great is the port selection. We have a pair of USB 3.0, one USB 2.0, HDMI as well as ethernet. That's going to be fine. Those are going to be the essentials. What you are losing are things like an SD card reader, USB-C, Thunderbolt support. It's going to be pretty basic here. Don't let the looks fool you, even though this does look like a premium laptop, the build quality is only going to be so-so. However it is clear that ASUS spent the money on the internals. What really drew me to the FX504 is the Core i5 8300H inside. Now this is one of the new eighth gen 45-watt H series processors that are coming out in laptops. If you guys caught my videos that I did last month where I took a look at all of the new chips including the new i7s and i9s, you know this is actually really exciting. This is the first time in a long long time that gaming PCs are getting a major update on the laptop side. Where the Core i7 and Core i9 are jumping up from four cores to six cores, the new Core i5s are adding hyper-threading. Essentially giving you four cores and eight threads. Very similar to what you used to be able to get in the last generation Core i7s. There that's simple right? The idea of having a cheaper computer that's on par with a Core i7 gaming laptop from last generation is exciting. And as you'll be able to see it is a step up, however it's not going to be perfect. Take a look at the benchmarks and you'll see this is going to be a step up over the last generation i5 although it's not going to be a massive leap. And what comes close to the i7, the low 2.3 gigahertz base clock actually does hold it back a bit here. Paired with the i5 is the GTX 1050 GPU. This is actually going to be a pretty decent performer at 1080p as you guys will see a little bit later in the gaming section and if you stack it up to some of the other competitors including the 1050 Ti in the Dell as well as the MX150 in the Acer, you'll see it slots right in there as you would expect at the price. Remove about 12 screws to get at the inside the laptop, and you'll see there's actually going to be a fair bit of space here. So first of all you're going to see our eight gigs of RAM. You can expand that to 16 gigs pretty easily or 32 if you really want to go all out, and you're also going to find an M.2 drive slot. Now that is because this only has a one terabyte hard drive. Mind you it is going to be an SSHD so it is going to be faster especially when it comes to things like Windows. However if this is going to be my everyday system, I would definitely install a full SSD in this guy. The battery is going to be a fairly small 48 watt-hour cell so don't expect to do hours and hours of gaming on this guy. What you can do is well, not overheat. This is going to have two cooling fans as well as a pair of heat pipes for the CPU and the GPU. That combined with the heat sinks on the back should keep this fairly cool under extended gaming sessions. Just remember to bring your charger. Get into some gaming and first of all we have Rocket League. Now here at 1080p on high settings we're getting a pretty impressive hundred frames per second. Rocket League is not exactly a demanding game especially with the GTX 1050 inside it is absolutely no problem. Next up we have everyone's favorite, PUBG. Not like people play any other game these days. So oh if I don't get shot. We have 1080p low settings here and with that we're getting somewhere between 50 to 60 frames per second. If you do want higher settings, you will sacrifice some framerate so if you're okay with 30 you can probably go up to medium. But for me I like having something that's going to be a little bit smoother and this is again totally playable. It's almost like when you spend $700 on a laptop you're able to play games at reasonable settings. Amazing right? Moving on to everyone's actual favorite game, we have Fortnite. Now here on 1080p on medium settings we're getting a still very impressive 75 to 90 frames per second. I think this is really a good example of the kind of game that is really meant for a system like this. I mean sure you're not running it epic settings like 300 frames per second, but for most people I would say the vast majority of people a medium 1080p experience that's going to be running at this high of a frame rate is going to be more than good enough. Moving on to a game that's going to be much more demanding, we have Middle-earth: Shadow of War. Now here at 1080p on low settings we're still hovering around the 60fps mark. Again you can bump some settings up to medium if you want a little bit of a better graphical experience but if you really do want to get that 60 frames per second, you're able to get it in pretty much any game at 1080p. Providing you turn things down a little bit. This laptop is kind of in a weird position. On one hand, for $700 the performance is really impressive. Getting that new eighth gen Core i5 processor paired with the GTX 1050 allows it to really handle 1080p gaming very easily. But at this kind of price, the trade-offs do start to add up. So stuff like the build quality and the screen I can mostly overlook, when it comes to the SSHD, that's where I start to have real problems. For $700, I don't want to deal with a slow hard drive making Windows feel super super slow. The fact that it's in SSHD helps some, but I would much prefer to find a full SSD like you would find in the Aspire or the Dell. At the end of the day, there are options that are going to be cheaper and better in some ways and there are going to be options than a little bit more expensive and better in pretty much every way. It's an interesting laptop, there's a lot that I like with it, but it's kind of hard to recommend at this price. If only, if only they had an SSD. I know you guys are really tired of me complaining about SSDs but you need an SSD in a computer in 2018 okay? Especially when you're spending $700. Anyway let me know what you guys think about the ASUS in the comments below, as always there will be a link to this guy to check it out over on Amazon, and I will catch you in the next one.",
    "transcript_keywords": [
        "laptop",
        "bit",
        "Core",
        "pretty",
        "settings",
        "gaming",
        "Austin",
        "laptops",
        "pretty decent",
        "game",
        "ASUS",
        "kind",
        "guys",
        "cores",
        "SSD",
        "lot",
        "frames",
        "decent",
        "guy",
        "Hey guys"
    ],
    "transcript_entity_values": [
        "six",
        "600",
        "Middle-earth",
        "75 to 90",
        "iPhone",
        "MX150",
        "2018",
        "USB-C",
        "800",
        "USB 2.0",
        "first",
        "RAM",
        "Amazon",
        "Core",
        "Windows Precision",
        "eight",
        "Acer",
        "Austin",
        "ASUS",
        "two",
        "30",
        "Windows",
        "Rocket League",
        "the end of the day",
        "four",
        "HDMI",
        "700",
        "48 watt-hour",
        "ASUS TUF FX504",
        "these days",
        "one",
        "FX504",
        "300",
        "last month",
        "second",
        "60",
        "32",
        "Aspire",
        "GTX",
        "Inspiron 7000",
        "hundred",
        "hours and hours",
        "15.6 inch",
        "one terabyte",
        "a ton",
        "Dell",
        "16",
        "Fortnite",
        "1080p",
        "SD",
        "CPU",
        "Shadow of War",
        "SSD",
        "45-watt",
        "2.3 gigahertz",
        "USB 3.0",
        "1,000",
        "between 50 to 60",
        "GPU",
        "about 12",
        "eighth",
        "only five pounds and one inch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "LOC",
        "CARDINAL",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY"
    ]
}