{
    "id": "4J2MGLKExRI",
    "title": "Retro Review: My First Mobile Phone!",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-01-05T20:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=4J2MGLKExRI",
    "category": "Science & Technology",
    "tags": [
        "old tech",
        "samsung sch-3500",
        "20-year-old phone",
        "1999",
        "throwback",
        "retro",
        "old cellphones",
        "samsung cellphones",
        "mrmobile",
        "michael fisher",
        "nostalgia",
        "sprint pcs"
    ],
    "views": 243553,
    "likes": 9742,
    "comments_count": 748,
    "description": "2019 marks the 20-year birthday of the Samsung SCH-3500, a sleek Sprint cellphone notable for its petite form factor and amazing (for 1999) voice-dialing feature. The SCH-3500 was also MrMobile's first ... mobile. So when a bunch of my most excellent tech-YouTube brethren told me they were getting ready to run videos about their first cellphones, I eBayed me a '3500 and jumped on that rocket faster than that Pizza Hut delivery hit the ISS in 2001. That joke go over your head? The video makes it clear, so jump on in to the latest Retro Review and take a trip back in time  in MrMobile's First Cellphone Retro Review!    [SUBSCRIBE TO MRMOBILE]     [OTHER FIRST PHONE VIDEOS]  JerryRigEverything:  iJustine:  LTT:  Erica Griffin:    [LINKS]  Rubber Reversion [Polymer Solutions]:    [MUSIC]  As Science Progresses by Aulx Studio, available at Premium Beat:   Lone Ranger by Gyom, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #throwback #retro #tech #samsung #flipphone",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://t.co/FOlFuNHPWV",
        "https://youtu.be/jJ2Ybl_U3Vc",
        "https://youtu.be/HREquvjw0eA",
        "https://youtu.be/sDnlNytiHJI",
        "https://www.polymersolutions.com/blog/stickiness-insulting-reality-rubber-reversion/",
        "https://www.premiumbeat.com/royalty-free-tracks/as-science-progresses",
        "https://www.premiumbeat.com/royalty-free-tracks/lone-ranger",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- I remember it like it was, well, 18 years ago. I had borrowed my mother's cell phone for a day for some reason, and being able to call anyone from anywhere gave me a sense of autonomy that not even getting my driver's license had. So I walked into RadioShack, we still had those back then, and talked to the only carrier that would sell a phone to an 18 year old with no credit. Sprint, $129 later, what I walked out with was Mr Mobile's first mobile phone. (light music) Straight from the Ebay box, the first thing that comes back to me about the Samsung SCH-3500, is how futuristic it felt when it was launched in 1999. Sure, the display was a monochrome LCD with pixels you could count with the naked eye, but the phone around it, that was unique. It made clever use of space by including a hole in the flip, so you didn't always need to open it to use it. Motorola had done this before with the I-1000 but this, this was almost as petite as the Star Trek communicator I devoutly wished it was. Sadly, there was no speaker phone on this model, but the Samsung software did let you customize the welcome banner, so I was able to sneak a little star fleet into this thing. And it packed a futuristic feature for the time, voice dialing for up to 20 phone numbers. Great for making calls while driving, which was probably outlawed in my state right after I bought this. Cool thing about dusting off phones this old is that it conjures up memories of old networks too. See the word Dual on the front of the flip here? That means the phone ran on Sprint's digital CDMA network, oh hey Qualcomm what's up? But, if it couldn't find that digital signal, it could also roam on analog networks. That's part of the reason for this extendable antenna here, and I remember using analog precisely once. A minute of staticky mestering which I heard fragments of a stranger's conversation, that's a phenomenon called cross talk. But couldn't hear the person I called at all. What order? Who is taking Genesis? Yeah, that call cost me a $1.29, and I never used analog roaming again. Now staying digital meant I got to use wireless data. Yeah, even in 2001, five bucks a month got me unlimited news, weather, text, and instant messaging delivered at a, hold on to your hat, 100 kilobits per second. And I used it too, I remember being on a sail boat race around Long Island and using AOL instant messenger to talk to my best friend by tapping out words on the keypad. And this was before any predictive text. Why not just call him? Well, back in these days, phone calls were more expensive than pizza deliveries to the international space station, that really happened in 2001 by the way. My $40 plan gave me only 350 week day minutes per month, which worked out to about 16 minutes a day. I had to wait until after sunset or after Friday to use my much larger pool of night and weekend minutes. And at this time, carriers would fight for customers by offering not just more minutes, but how early those night and early weekend minutes would start. If it sounds absurd, yeah, it really was. And the phone calls on this thing weren't even that great, Samsung had a reputation for poor reception on its phones until 2004 or so. And the earpiece on this model was also rather quiet. Thankfully the ringer was anything but. (cell phone ringing) Speaking of that earpiece, who woulda thought that this old phone would give me a lesson in chemistry? You've probably noticed how gross this flip is, and no, that's not something we blame on the previous owner. Some googling lead me to a site called Polymer Solutions, which explains that this is an example of something called rubber reversion. Basically, before Samsung molded this earpiece into an comfortable soft touch material, it started out life as a liquid petroleum product and it's gotten so old that it's now behaving more like a latex, slowly reverting back to its liquid state. Like Odo after too long away from his Bucket. So the next time someone scoffs at your new phone having broken too easily, they say they don't make them like they used too. You can remind them that none of this stuff was ever really built to last. Let's close out on that subject, lasting, this phone featured a removable battery. But, as a college student I was always too poor to buy another one, and because the pack was only rated for about two and a half hours of talk time, I remember spending several long calls with the phone still charging on its cradle. Could I be any more 2001? So, at the end of the day I'll always carry fond memories of my first cell phone. But I sure am glad I don't still have to use it today. (light music) but you may have noticed a bunch of other YouTuber's posting their first phones today too. I'll drop links to their channels and the description, and thank them for including me in this fun day of looking back. You can join the fun, share with me your first phone experience in the comments below and please subscribe to the Mr Mobile on YouTube while you're there. Until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "phone",
        "years ago",
        "Samsung",
        "day",
        "minutes",
        "back",
        "phone calls",
        "time",
        "Mobile",
        "calls",
        "thing",
        "phones",
        "remember",
        "called",
        "cell phone",
        "call",
        "Yeah",
        "Long",
        "flip",
        "digital"
    ],
    "transcript_entity_values": [
        "Long Island",
        "129",
        "1999",
        "a day",
        "2001",
        "AOL",
        "Qualcomm",
        "Samsung",
        "five bucks",
        "about 16 minutes",
        "CDMA",
        "YouTuber",
        "early those night",
        "YouTube",
        "RadioShack",
        "Polymer Solutions",
        "Mobile",
        "Motorola",
        "today",
        "Genesis",
        "first",
        "2004",
        "A minute",
        "100 kilobits",
        "Star Trek",
        "these days",
        "only 350 week day minutes per month",
        "18 years ago",
        "Odo",
        "40",
        "up to 20",
        "the Mr Mobile",
        "this fun day",
        "I-1000",
        "Ebay",
        "1.29",
        "about two and a half hours",
        "Friday",
        "LCD",
        "18 year old",
        "Sprint",
        "the end of the day"
    ],
    "transcript_entity_types": [
        "GPE",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE"
    ]
}