{
    "id": "4KEXauWZ17g",
    "title": "Are these any good? - OnePlus Buds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-21T18:11:20Z",
    "video_url": "https://www.youtube.com/watch?v=4KEXauWZ17g",
    "category": "Science & Technology",
    "tags": [
        "OnePlus",
        "Earbuds",
        "Audio",
        "Bluetooth",
        "Quality",
        "Dolby",
        "Fast Charge",
        "Wireless Charge",
        "Connection",
        "Lost Earbuds",
        "CD Shape",
        "Design",
        "Comfortable"
    ],
    "views": 550560,
    "likes": 20163,
    "comments_count": 1809,
    "description": "Sign up for Private Internet Access VPN at    It seems like everyone has their own branded earbuds these days, and OnePlus is no different. How do these stack up?  Check out the OnePlus Buds at   Buy OnePlus Mobile Phones On Amazon (Paid Link):  On NewEgg (Paid Link):   On BHPhoto (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://lmg.gg/TF96v",
        "https://geni.us/Vebx",
        "https://geni.us/boBLsoY",
        "https://geni.us/iWYXA",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Everybody's doing it, OnePlus Buds, truly wireless earbuds from OnePlus. They are not active noise canceling, so they're more analogous to Google Pixel Buds or original AirPods than they are to AirPods Pro or like Sony WH-1000XM3s or whatever those are called. They're simple. You can see, they look like the Google Pixel Buds, in the case anyway, pretty similar size. I'm happy with this case size. It's not too big. It's not tiny, but it's pretty good. It looks like there's an indicator light that could be for the case itself. There's no internal indicator light. Sometimes like on the Google Pixel Buds for example, there's light that shows the charge of the case and then there's a light that shows the charge of the actual ear buds, but this doesn't have that. Yep, they're AirPod clones. Okay, I mean, what did you expect really? I don't know how I feel about that though, because it's like an uncanny valley thing. People are going to be like, oh, you're wearing AirPods. They look different, those aren't, are those AirPods? No, they're not, they're OnePlus Buds. And people will be like, pft, okay. So I'd rather just have a design that was just its own unique thing. Funnily enough, in their product guide that they sent us, they specifically say that they have a unique design that is reminiscent of other OnePlus design language, notably the Bullets Wireless. So they're saying if they look like anything, they look like Bullets Wireless. They definitely don't look like AirPods. Yeah right, OnePlus, come on. Little eggshell thing again, exactly like the Google Pixel Buds box. Set your music free. Enjoy your new buds, buddy boy. It says user guide safety information. How do I not have head explode? How is babby formed? This box is empty now. Little USB cable. Red on the inside, little OnePlus flare, we're used to that. It actually looks pretty cool on the inside of a USBC 'cause the color wraps all the way around. That's kinda cool. And you've got the embossed kind of OnePlus iconography there. Neat, custom! Touch area, these are capacitive. You can swipe on this little silver portion there, cool. Look at that, USBC and the pairing button is on the case, which I prefer. Really similar to the Pixel Buds in that they have two different kind of pairing setups depending on what device you're using. So if you're using a regular Android phone, in my case a Pixel, it's just gonna be like any Android device or any Bluetooth headphones. You're gonna have to go into your Bluetooth menu and find the headphones and then pair it. Don't make this mistake. You do that while they're still in the case, okay? If you ah God, no! if you put them in your ears and then try to pair, it's not gonna work. Now, if you have a newer OnePlus device, you have to have a six or greater, then you get the special experience. In that case, you just open it and just like the Pixel Buds, you're gonna see a notification come up on your home screen, you tap that, you're paired and it's magical. James' OnePlus Buds, what? Because I connected these to my phone before they're just permanently named James' OnePlus Buds? Like I already forgot them on my device. So what? Why weren't they renamed Brandon's OnePlus Buds? Is that actually how it's going to be for everybody for all time? What if you buy these from a stranger? Please before you buy these, rename your device, Mr. Poopoo Head, so that when you resell these later on or hand them down to your little brother, they're called Mr. Poopoo Head's OnePlus Buds. You know, I'm pretty sure these have a factory reset and so I'm sure you can get them back to normal, but all right, we're paired with my phone again. (dramatic music) This can't be right. I'm reading about the controls and it's like double tap the left or right bud to play the next song by default. For OnePlus six on newer customers, you can customize the double tap function of the left bud or the right bud to perform different tasks like play and pause and next track and previous, okay. The the words matter here, people. It doesn't say you can customize the controls. It says you can customize the double tap function to whatever action you want. Hold on a second. Does this mean what I think it means? Okay, there's music playing. Single tap. Nothing happened. Double tap. Next song. Swipe. Nothing. Triple tap, next song. It just registered as a double tap. Long press, nothing's happening. These only support double tap. What! I can't even compute this. That is so stupid. Why are they even touch? Why not just have a button? Why even have a button? Why not have one of those like sliding toggles on a spring that just goes to thunk, 'cause it only has one function. That's insane. You can double tap, but you can't just tap. I can't pause. I mean, that pauses it and that's actually pretty responsive. Pause, play, but like I don't want to do that every time. And what if I want to go back to the last song and forget about volume controls, forget about the Google Assistant. This is insane! What were they thinking?! Who even cares what they sound like? Why would you buy these? That is junk. Have these guys made products before? That is insane. Okay. I'm going to pretend that I don't know that and I'm just going to continue the unboxing. Da-da-ding, the chime doesn't sound very premium. It's kind of like generic. James' OnePlus Buds, 100% left, 100% right. 60% case battery. Similarly to the Pixel Buds and others, there's kind of an integrated little mini app just in the settings, which is cool. This is way paired down. HD audio, AAC on and off, phone calls on and off, media audio on and off, contact sharing, ha, not for me OnePlus, not today. No permission for you. So not a lot of features there, but it does have find this device. It's ringing, that's cool. And actually that was way more reliable and faster than the Pixel Buds, which like took time to get going and ramp up in volume, so that's not too bad. Now what I understand from reading the instructions and stuff is that if you have a OnePlus device again, a six or newer, then you'll actually see more options in here. Those are gonna support Dolby Atmos, which I don't really understand on headphones or the phone, but anyway, they will. After another update, which is going to come a week after this video, they're also going to support being able to change the controls. Now that you get to customize what the double tap does. You, as far as I can tell, do not get to specify a tap for this, a triple tap for that. You just get to say, instead of going next song on my double tap, I want pause on my double tap. What the hell? (laughing) All right, let's give them a shot listening wise, right after this message from our sponsor. Private Internet Access is the VPN that helps you access services and websites as though you're in a different country. It encrypts all your internet traffic and uses a safe protected IP that you can connect up to five devices at once and clients for Windows, Mac OS, Android iOS, and even Linux are supported. You can buy a one year plan for 39.95 and get two months free at the link in the video description. So check 'em out. And you know, when you're on Canadian internet, you can see the American prices, that's what I use it for. I will be surprised if these sound decent. Let's start with something bassy. California knows how to party. Let's try something with some really harsh guitars. Wow, they're in there. Ow, they go loud enough, that's for sure, okay. They sound okay, they're not great, they're not outstanding, they're not that bassy, they're a little bit bright. I noticed that the high's like a high guitar solo in the song, \"The Pot\" by Tool, one of my favorite songs ever, could be pretty fatiguing. They kind of just stand out and ah, not great, but you know, these do not cost $180 or $160 like the other Google and Apple earphones I was comparing them to. These are $80, so I can't have too high of expectations. And they basically sound like they're $80. I think at the $80 price point, they're okay value, because just because of the case and everything like that. They do like basically all those earphones that I reviewed in my review of 50 earphones under a $100. They're just pretty basic. I am tempted to say that sound wise they're worth maybe only 50 bucks, but when you consider that, I guess they have this okay design, even though it kind of hurts my ears and there's no like fins or any adjustability on here, you kinda just get what you get and you hope that they work for you. But considering that they are designed and considering that they have this case with USBC fast charging and everything, I think 80 bucks is, 80 bucks is okay. Speaking of the charging, this is a 430 milliamp hour case. Each of these buds, I believe is 35 milliamp hours and they advertise 30 hours of battery life all told so that would be, I think, a full charge on the earbuds and maybe three additional charges from the case. From that 30 hours you're gonna get sevenish hours of music playback on the buds themselves. Then once this is depleted, you can charge it up to full in about 80 minutes. But if you charge for just 10 minutes, they say that you can get 10 hours of juice out of it. However, on the page, there's also this little spec that says that 10 minutes gets you just 100 minutes on the buds. So I stared at this for a while and I think what it's saying is that let's say this stuff is all dead. You plug it in for 10 minutes, okay. You've just gotten 10 hours of battery from the whole system, but like if you unplug it after 10 minutes and walk away and put these in your ears, you're only going to have 100 minutes on the buds because you can get power from the wall to this case faster than you can get power from this case to the buds. See what I'm saying? So 10 minutes charging in here, then wait for a bit while this charges the buds and all told, you'll have 10 hours, I think. These are available in white and gray and nord blue, which I think looks pretty garish. They also have IPX4 water resistance or ingress protection. The X means they're not rated for dust. And the four means that they can handle splashes of water and sweat and basic stuff like that. Don't wear them in the shower, don't go swimming in them, but sweat your butt off if you have to, you know? They also advertise environmental noise cancellation, which is not active noise cancellation, nor is it noise isolation. It actually has nothing to do with how they sound. This little marketing spec is for the microphones of which there are three on each earbud, pretty impressive. And now I'm gonna take a little video to show you what that sounds like. Hello, it's me again, but from a crappier camera and probably worse audio, but is it good enough audio since it's headphones? They also have Bluetooth five. They advertise 10 meters of range and they have something called Fnatic Mode, which gets the latency down to 103 milliseconds. I don't know you initiate Fnatic Mode or if it's just always on, but this is supposed to help you have synced audio between the video you're watching on your phone and the voice you're hearing in your ears 'cause there's nothing worse than seeing a mouth that moves out of sync with the voice. Did that work? So that's about it for these things. I don't know. If you get a deal on these, like if you buy the phone and maybe you get a discount, I think they're fine. It's weird because I don't even call like the real AirPods or the Pixel Buds high end audio, but they sound a lot better than these. These are pretty much your run of the mill, like random Chinese, Amazon, truly wireless earbuds, but in a kind of prettier package. So yeah, they're fine. If you want truly wireless ear buds or you don't have any, 30 bucks, okay. So thanks for watching guys. If you haven't seen the unboxing we did for the Google Pixel Buds the other day on this channel, check that out. If you're interested in more audiophile grade stuff, check out the Hemp Headphone from Grado that we looked at the other week. So, you know, this is a good fidget toy. That's why I'm not allowed to have one of these. Bye.",
    "transcript_keywords": [
        "Google Pixel Buds",
        "Pixel Buds",
        "Buds",
        "OnePlus Buds",
        "Google Pixel",
        "James' OnePlus Buds",
        "Pixel",
        "double tap",
        "OnePlus",
        "tap",
        "case",
        "Pixel Buds high",
        "Google",
        "Pixel Buds box",
        "Head OnePlus Buds",
        "double",
        "pretty",
        "Brandon OnePlus Buds",
        "kind",
        "ear buds"
    ],
    "transcript_entity_values": [
        "only 50 bucks",
        "USB",
        "Google",
        "Amazon",
        "AirPod",
        "50",
        "Chinese",
        "Da-da-ding",
        "just 100 minutes",
        "the other day",
        "Sony WH-1000XM3s",
        "one year",
        "80",
        "California",
        "James' OnePlus Buds",
        "VPN",
        "OnePlus Buds",
        "10 meters",
        "today",
        "a spring",
        "Grado",
        "Private Internet Access",
        "OnePlus",
        "American",
        "the Google Pixel Buds",
        "OnePlus six",
        "AAC",
        "100",
        "the Pixel Buds",
        "two",
        "up to five",
        "the other week",
        "Fnatic Mode",
        "two months",
        "Poopoo Head",
        "a week",
        "103 milliseconds",
        "100 minutes",
        "the Google Pixel Buds",
        "one",
        "nord blue",
        "30 hours",
        "Pixel Buds",
        "second",
        "that 30 hours",
        "35 milliamp hours",
        "the Hemp Headphone",
        "Poopoo",
        "Google Pixel Buds",
        "430",
        "160",
        "Windows, Mac OS",
        "Linux",
        "Brandon",
        "Android",
        "10 hours",
        "30 bucks",
        "80 bucks",
        "six",
        "Dolby Atmos",
        "five",
        "Apple",
        "USBC",
        "10 minutes",
        "AirPods",
        "about 80 minutes",
        "the Bullets Wireless",
        "IPX4",
        "100%",
        "three",
        "60%",
        "Android iOS",
        "39.95",
        "Canadian",
        "four",
        "hours",
        "Bullets Wireless",
        "just 10 minutes",
        "180"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "GPE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "NORP",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "LOC",
        "DATE",
        "PERSON",
        "DATE",
        "QUANTITY",
        "TIME",
        "FAC",
        "CARDINAL",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "TIME",
        "ORG",
        "LAW",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "MONEY"
    ]
}