{
    "id": "4KKsAb3piuY",
    "title": "I almost died (one year ago today) 🥺",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-04-01T13:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=4KKsAb3piuY",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 179457,
    "likes": 9252,
    "comments_count": 693,
    "description": "Here is the full video for all the information about what happened:   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://www.youtube.com/watch?v=hzE0eLu6bsw",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So that title is actually not click bait. I did actually in fact almost die a year ago on April 1st. I got a blood clot in my shoulder. I have something called thoracic outlet syndrome. It comes in three kind of variations where there isn't enough space between your rib and the vein, the nerve or the artery to kinda pass through. So your arm will then pinch on either of those three things and then it constricts the blood flow causing, well, a lot of things. If it's nerve, it could be pain. If it's a vein or artery, it's gonna be cutting off blood flow. And in my situation, it was actually the vein and it caused a blood clot. I have a whole video about that, but I feel like so many things this past year have changed. I even feel like my channel has kind of suffered because I kinda have gone through this weird something I don't even know. I can't even really explain it. It's like my creativity, my motivation, just inspiration, everything just kind of was all over the place. But over the past year, I feel like I've been doing more things, I guess, for myself. I have been going more places. I've been traveling a bunch again, and it's sort of like that combination of the whole entire world being shut down for several years and not being able to go anywhere. And now that things are back opening up again, I don't know, I don't even know how to explain it. I'm sort of still, I feel like kind of getting my old self back. I've been finding new hobbies. I started snowboarding. I started going back to jujitsu again. And the things that I used to do like a lot of my sword training and lightsaber training, I don't really do as much anymore because the doctor did recommend getting this first rib removed, but there are also a lot of side effects to that. So I decided to not get the surgery right away, but it is something that I would be willing to do down the line if something does come up and I decide to do it again. I've just been kind of being very careful about the movements. All of the sword stuff that I used to do, it's just a ton of repetitive motions, all kinds of things like that. Like I don't do a lot of overhead presses and I kinda try to keep down at this space level. I do still stretch and try to strength train a little bit in my back so that my shoulders and stuff stay open to try to help make more space over here. But really the only way to make more space is to get the rib cut out. And they did say that if I really wanted to keep the rib, I could. So that's exciting. I don't know, I just wanted to kinda give you guys a little bit of a health update. I feel like I'm doing well, but it's one of those things that's really hard to test for. And my side effects were mostly my entire arm just being super swollen. And thankfully, I kinda knew what it was and what was happening so I was able to kind of self-diagnose myself at the hospital and they were able to quickly get into action. But yeah, if you ever do feel like something is not right in your body and you know it in your heart, in your soul, in your entire being, make sure you advocate for yourself. Because sometimes a lot of doctors, not that they don't want to take care of you, they are also super busy. Like just seeing the amount of people and patience and things that they are going through, it's not that they're intentionally ignoring you. Sometimes they don't have the actual capacity to be able to really fully give you that attention. So you do have to be persistent and you do have to keep going. And if that person doesn't listen to you, then you're gonna have to find another one. And I know that can be difficult because a lot of insurances aren't accepted places. I am so grateful though, because I did get such incredible care when I was in the hospital. Everyone was amazing. And myself, I tried to be super patient and tried to listen and learn, but I didn't know what was going on. And when you're in sort of this basically life or death situation, it was such a crazy experience. But now kind of looking back over this last year, we made it through. There definitely isn't a day that doesn't go by that I don't think about it in some capacity. But the crazy part about blood clots is, it can come from a number of things, and I think for a lot of women, it can come from pregnancies, it can come from birth control, which is something that you potentially might read on the package and be like, \"That's not gonna affect me.\" Well, you don't know. It could. Or it's anatomical like my situation, where my rib is pressing on a vein. Some people also have an extra first rib so then that could also be a factor. I'm just super grateful to be here and I'm just so grateful that you guys were supportive through all of that. And I think you guys are all awesome. So thank you so much. But I just wanted say I'm doing well. It's also been a year since I've been off caffeine, and I think it's almost five years, maybe five, six, I think five since I've been off alcohol. But having an experience like that, it really does kind of change your perspective. But also it's strange because it doesn't even feel like it happened. It's something that I've kind of pushed outta the back of my mind and just I know those first couple of months afterwards, I was not well mentally, physically, everything that I used to be able to do, I wasn't even able to do anymore. So I had to find different things that I could do to just sort of fill that void. I'm very thankful that jujitsu still is something that I can do. And now finding snowboarding has been really fun. And even just like making videos and stuff is so therapeutic because I can create and I can actually have something to show and put out into the world. So all of this stuff is sort of the ways that I've been coping. Well, thank you guys for watching and always being so supportive. You guys really did help me get through a really tough time last year and I'm so glad to still be here making videos and getting to see all of you or I guess you seeing me, but me seeing you in the comments. You know what I mean. Well, thank you again, and I'll see you guys in the next one. Bye. (somber music)",
    "transcript_keywords": [
        "kind",
        "things",
        "feel",
        "lot",
        "click bait",
        "year",
        "back",
        "rib",
        "blood",
        "guys",
        "sort",
        "vein",
        "ago on April",
        "blood clot",
        "space",
        "super",
        "stuff",
        "blood flow",
        "past year",
        "years"
    ],
    "transcript_entity_values": [
        "several years",
        "this past year",
        "April 1st",
        "this last year",
        "a year ago",
        "a year",
        "three",
        "five",
        "first",
        "almost five years",
        "six",
        "last year",
        "the past year"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE"
    ]
}