{
    "id": "4PZSnN4u4jU",
    "title": "Could Epic ACTUALLY Win?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-14T02:28:06Z",
    "video_url": "https://www.youtube.com/watch?v=4PZSnN4u4jU",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Apple",
        "Google",
        "Epic Games",
        "app store",
        "competition",
        "antitrust",
        "congress",
        "senate",
        "lawsuit",
        "Play Store",
        "monopoly",
        "duopoly"
    ],
    "views": 329752,
    "likes": 25256,
    "comments_count": 1046,
    "description": "Try Pulseway for free and start remotely monitoring and managing your server or PC at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps:  0:00 the tech news heals all 0:11 Apple, Google bash app store bills 1:15 Nvidia CGI'd their CEO 2:13 Facebook shutting down researchers 3:12 Pulseway 3:52 QUICK BITS 4:01 Apple damage control 4:42 GPUs selling at MSRP!? 5:16 Gigabyte responds to PSU scandal 5:53 Tiktok privacy features 6:23 Poly network offers hacker reward  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/pulseway",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/0aNnT",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Misinformation, tribalism, diseases. So many horrible things going on in the world. And you might think tech news wouldn't help with any of that. - [Man] What? - Companion bills have been proposed in both the US Senate and Congress that would pressure Apple and Google to be more open to third-party app stores and sideloading. Like Epic Games' lawsuits against the two tech giants, the proposed bills hinge on painting Apple and Google as enforcers of a duopoly on mobile operating systems, and by extension, the apps in app stores available to users. But no sooner were the bills introduced Then a lobbying group called the Chambers of Progress decried them as a finger in the eye of anyone who bought a phone for the security of the app store. - [Man] That's why I don't buy phones. - The chamber also noted they don't see any consumers marching in Washington, demanding dumber smartphones. I totally would do that. Can you guess who funds the Chamber of Progress? Yeah. - [Man] It's Apple, Google. - Oh yeah. Really. The bills are a very early stage, so we'll have to wait and see whether Apple and Google's progressive group is any successful at keeping things just the way they are. NVIDIA has revealed that their CEO Jensen Huang, that correct too? Has actually been a computer generated AI construct this whole time. - [Man] I knew it. - Which is how he always looked equally cool at every major keynote he delivered. Okay, fine. Jensen is a real person, but he was completely CGI during a small section of the keynote for NVIDIA's GPU technology conference back in April. Team Green released a short documentary detailing how they used NVIDIA's omniverse suite of tools to not only recreate a photorealistic Jensen, but also to painstakingly construct his kitchen and every graphic shown, even the PowerPoint slides, in 3D. - [Man] Have you tried to make PowerPoint in 3D before? - I miss Word Art. Here at LMG, we're also big into computers. So it's only a matter of time before we do the same thing. Just kidding. We're doing it right now. (robotic voice) I'm a robot, and so are you. (robotic voice) Nothing's real. (laughs) (Man laughing off-camera) Facebook also wants to bend reality, but not by constructing CGI images. Though, aren't they doing that with Oculus or something? - [Man] Nothing. - But rather by bullying academic researchers into dropping their investigations of the company's problematic practices. Last week, Facebook banned NYU researchers who were studying how ads can spread misinformation. And this week a firm called algorithm watch was more or less forced to shut down its research into Instagram's algorithm after Facebook threatened a lawsuit. These stories are made more alarming by the fact that both groups of researchers reported some troubling findings. Like the fact that Instagram's algorithms encouraged photos that showed bare skin. - [Man] No, not your ankles! - I thought that was just cause everyone liked bare skin. - [Man] That's true. Who knows? - Ah, maybe we don't. Some US Senators are now looking into Facebook's actions, so they might not get away with banning anyone who dares look into potential problems on the world's biggest social platforms. I, for one need to know how my mom gets so many likes on her photos of like a sunset, which happens every day. Now it's time for Quick Bits, brought to you by Pulseway. The real-time remote monitoring and management software that lets you manage systems and support users from anywhere. Even if you're locked in the bathroom due to some crazy social situation. - [Man] I can think of a few. - Their app is compatible with Windows, Mac, and Linux, and lets you access real time status, system resources, logged in users, network performance, Windows updates, and more. You can also create, deploy, and automate custom scripts for patching security, making backups and generating reports. So generate some peace of mind by trying Pulseway for free today at pulseway.com, or through the link below. Quick Bits. If you don't let them out to play every once in a while, oh, we'll go a little stir crazy. - [Man] Yeah, you don't want to see it. - We had to deal with some here. Apple is doing some damage control after announcing those iPhone scanning measures from last week, Craig Federighi told the Wall Street Journal that it might not have been a good idea to announce one feature, which scans photos about to be uploaded to iCloud for child sexual abuse material or CSAM, and a separate feature that would detect explicit content in the messages app for children. I'm not sure that Craig is doing anything to calm people's fears about privacy though. Especially when flagged material will apparently go through multiple layers of auditability. That sounds like multiple people looking at stuff, Craig. - [Man] Yeah, don't worry about it. We'll all make sure that you're very private. We'll all take a look. - It's such a confusing system. Doth my eyes deceive me, or did Micro Center actually sell a bunch of RX 6600 XTs at and below it's MSRP of 379.99? - [Man] What? - It might be less of an indication that the chip shortage is completely over and more a result of China's crackdown on mining, which flooded the market with used GPUs, but still, it's like we've gotten a glimpse of the sun again through the clouds. And it reminds me that the sun is still there. - [Man] Gotta stay far away though. - That's true, but not today. It's very smoky here. - [Man] Yeah, yeah. Wildfire. - Gigabyte has responded to claims about two of its power supply models being faulty, a story that was deeply investigated by GamersNexus. Rather than issuing a recall, Gigabyte is lowering the percentage range by which the PSUs can exceed their power load by 10 to 30%, which is good, but not a great response to the fact that half of the PSUs GamersNexus tested broke during the stress testing. But hey, maybe Gigabyte knows that sometimes life is dangerous and you can't make an omelet without a few exploded power supplies. - [Man] I mean, have you ever tried to cook an egg on a power supply? - That's a good idea. - [Man] The case power, it explodes. - TikTok has enacted more measures designed to protect its teenage users, including setting videos to private by default for users aged 13 to 17 years old. They can then choose who can see their videos. And 16 to 17 year olds can also choose who can download their videos. Ah yes, 16. The year that we as a society have long decided is the age at which one can maturely make a decision about who else can keep a video of oneself for personal consumption. A wonderful time in human history, we are living through. - [Man] Figs are great. - And, the hacker responsible for the biggest crypto heist ever has returned almost all of the 600 million in cryptocurrency they've stolen. And the platform they stole it from Poly Network is so grateful, it offered them a $500,000 reward for pointing out a hole in its security. But the hacker reportedly refused, because they apparently made a butt ton of money off crypto already, making this maybe the weirdest, most twisty crypto story I've ever heard. Twisty crypto? Sounds like a craft beer. I don't like beer. Time to get ourselves a cold one and end this episode. Come back on Monday for more tech news. And I promise it will be refreshing. - [Man] Don't promise them that. - It will be. - [Man] You don't know. - It's the summer. - [Man] You have no idea what it's going to be. It's a public app.",
    "transcript_keywords": [
        "Apple and Google",
        "Apple",
        "Google",
        "app",
        "Yeah",
        "time",
        "app stores",
        "Facebook",
        "bills",
        "users",
        "power",
        "NVIDIA",
        "CEO Jensen Huang",
        "Epic Games' lawsuits",
        "Senate and Congress",
        "Jensen",
        "Craig",
        "Quick Bits",
        "make",
        "crypto"
    ],
    "transcript_entity_values": [
        "The year",
        "half",
        "Epic Games'",
        "600 million",
        "the Wall Street Journal",
        "TikTok",
        "iCloud",
        "CSAM",
        "500,000",
        "13 to 17 years old",
        "US",
        "LMG",
        "one",
        "NVIDIA",
        "Gigabyte",
        "iPhone",
        "April",
        "the US Senate",
        "Google",
        "RX 6600",
        "the summer",
        "the Chamber of Progress",
        "PowerPoint",
        "Micro Center",
        "Windows",
        "Congress",
        "last week",
        "AI",
        "Washington",
        "Windows, Mac",
        "Instagram",
        "Last week",
        "about two",
        "Linux",
        "Quick Bits",
        "379.99",
        "NYU",
        "China",
        "third",
        "16 to 17 year olds",
        "Pulseway",
        "Jensen",
        "Facebook",
        "the Chambers of Progress",
        "two",
        "Jensen Huang",
        "GamersNexus",
        "Monday",
        "Team Green",
        "GPU",
        "Craig Federighi",
        "this week",
        "Oculus",
        "Craig",
        "16",
        "Poly Network",
        "Apple",
        "today",
        "10 to 30%"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT"
    ]
}