{
    "id": "4QFlb55l-4M",
    "title": "Deep-Cleaning a Viewer's NASTY Game Console! - GCDC S1:E5",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2022-02-14T23:40:36Z",
    "video_url": "https://www.youtube.com/watch?v=4QFlb55l-4M",
    "category": "Science & Technology",
    "tags": [
        "console deep cleaning",
        "gcdc",
        "deep clean",
        "xbox cleaning",
        "how to clean a console",
        "tech",
        "computer",
        "pc gaming",
        "how to clean an xbox",
        "gaming pc",
        "dirty xbox",
        "console",
        "game console",
        "how to disassemble xbox",
        "xbox one",
        "how to clean an xbox one",
        "how to build a pc",
        "xbox deep cleaning",
        "gcdc s1",
        "season 1",
        "Game console deep cleaning"
    ],
    "views": 911500,
    "likes": 13193,
    "comments_count": 749,
    "description": "SPONSOR: Learn more about NZXT's Foundation Pre-Built Gaming PC:   Does deep-cleaning a nasty console in a hotel sound... weird? Perfect. It's exactly what we did! By the way, if you live in the Orlando, FL area and have a dirty system, send us an email with photos of your console so we can clean it for free: help@salazarstudios.org   Consider supporting us on Patreon!    My cleaning gear:  SYINE Respirator Mask:  Scott Shop Towels:  Electric Air Duster:  ONSON Cordless Vacuum:  Medical Grade 99.9% Isopropyl Alcohol:  Q-tips Cotton Swabs:  Xool 80 Precision Tool Set:  Hizek Black Disposable Gloves:    My troubleshooting gear: Pixio PC160:  FLIR C5 Thermal Camera:  Skybasic Digital Microscope:  YIHUA Soldering Station:  Helping Hand Soldering Board:  Xool 80 Precision Tool Set:    My studio gear: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #GCDC #Console #Cleaning",
    "description_links": [
        "https://nzxt.co/SalazarFoundationPC",
        "https://www.patreon.com/gregsalazar",
        "https://geni.us/V4uA",
        "https://geni.us/rIy5O6Y",
        "https://geni.us/RALt4",
        "https://geni.us/aABrFWE",
        "https://geni.us/tBVQ",
        "https://geni.us/nQhVVQm",
        "https://geni.us/1IfxDSw",
        "https://geni.us/MBCJaf",
        "https://geni.us/XH5CP",
        "https://geni.us/3ALEI",
        "https://geni.us/6zurf",
        "https://geni.us/DbjS",
        "https://geni.us/7DDrL",
        "https://geni.us/1IfxDSw",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "- [Greg] This is another viewer's nasty console. And as usual, it really doesn't look all that nasty on the outside, just because, yeah, there's not much to it just a few plastic panels. But inside that's where it gets pretty gross. And this one apparently, hasn't been cleaned in it's entire life. You can see this warranty sticker has never been removed, which means that the console has never been opened up. And while yes, there are some clear signs that this is a used console. There's a lot of dust in the top grill especially, some on the sides and just the plastic overall doesn't look like it's in the best of shape. Where we really expect to see this dust is again on the inside, in and around the fan, as well as the heat sink. I've taken apart about three or four of these Xbox's so far. So at this point it's pretty robotic. I know how to get into these very quickly. One thing that you should know going into this is that with respect to the competition, right, the PlayStation. These Xbox's don't have integrated AC adapters, right? So they have external power bricks that then plug into the wall, which I think is a bit more annoying. But another byproduct of that is that the interior of this console is a bit more open. There's a bit more room for air to kind of circulate, for dust to move around and collect on other surfaces. Whereas in the PS4's case, it's mainly just the like the external kind of housing will get really dirty on the inside. And then basically the fan and the heat sink. That's really about it. The power supply will get kind of dirty, but in my experience, I've seen way worse when it comes to the heat sink itself and the fan. In the Xbox's case, the motherboard also gets very dirty because it's rather exposed in here. There's not much covering it up because again, that large internal power supply is missing. So that just adds one more step to this process. And we have to be a bit more thorough there, but everywhere else should be pretty straightforward. I'm looking forward to getting inside of this thing and reviving it, making it look as close to new as possible. Stay with me. If you're looking to get into PC gaming without breaking the bank here in 2022, consider NZXT's BLD foundation prebuilt, you're reeling over 100 FPS in League and Valorant and over 60 FPS in Fortnite all with settings at medium and in 1080P, not too shabby NZXT. And perhaps best of all, this build is super easy to upgrade down the line with a discrete graphics card. Since you've still got six multithreaded Zen 3 cores to pair it with. NZXT's BLD prebuilt waive their $99 build fee since they're made in bulk. And you'll get a two year parts and labor warranty with every purchase. Learn more about BLD systems, including this foundation PC here via the link below. Hi there and welcome to GCDC, game console deep cleaning. Here we attempt to deep clean viewer consoles in and around the Orlando, Florida area for free. We do not charge a dime that's right, $0 and 0 cents. So long as you're okay with this taking on these consoles for a few days and filming these processes. In a nutshell, I make a bulk of my money, monetizing videos like these on YouTube and elsewhere. We also have help from external advertisers, some of the pre-rolls that you see in things, those are a big help. They allow us to continue doing what we're doing for free. So I don't offload any of that cost to the owner who is already gracious enough to loan us his or her system for a few days. And who typically ends up driving an hour or two, to get to where we need to get, to pick up the console and then drop it back off. Now, before we do any sort of cleaning with this console, we need to power it on and make sure that it functions properly as is, if for whatever reason, it arrives here, dead and I end up taking it apart, cleaning it and then reassembling it. How would I know that it wasn't something I did that caused the console not to work. So for peace of mind's sake, especially as a business, we need to verify everything is good to go upfront. Wow. That glare is pretty awful on the screen. By the way, this portable monitor here, is a PX160 from Pixio, I'll have it linked below. I'll try to include it from now on, in all of our troubleshooting areas of our video descriptions, where we have our troubleshooting stuff. So everything is plugged in now, we should be good for power. Sounds good. Just make sure that it posts. It's really all I'm worried about here. Yep. Looks pretty good. Alrighty. Okay. So we'll power this back down and we'll get to disassembly. By the way, while you're watching this, you can check out all of our cleaning gear and our disassembly gear. So things that we use for troubleshooting, as well as taking these apart, in the video description. If you are interested. To start, we'll turn the Xbox on its side. We'll pull this grill up. Just a quick little pry tool should be all we need. And we'll carefully remove this grill. Last little clip back there. (plastic cover clicking) There we go. And now we should be able to just slide this black piece here, back and out. We will need to remove this seal though. It's not gonna matter that it's missing because this console is so old. It's outside of its warranty period. Pull it up and we'll get rid of this gunk. Once we actually start cleaning the exterior. Now we can start prying these two shells apart. You'll notice that it separates into two. The top part here needs to come off first. We'll use our pry tool to kind of get in here. Yeah. Taking these Xbox's apart can be a bit of a pain. Just be patient. You don't wanna break any of the plastic. It sounds like I am now, but I promise that's just how it's supposed to come apart. Now, once you've got this part kind of hanging here, you'll wanna flip the console around to where the front is facing you. And this part here is a little more tricky. You're gonna wanna carefully pull this back and the top should slide out. Now be careful because we do have this little ribbon cable to take care of. What people will do is rip this thing apart because they think that there's nothing attached here and they'll just kind yank away the top panel, without heeding this warning. So don't forget that. All we gotta do is lift the blue section of the cable that wraps around the connector and should just pry on out like that. Here we go. And now we can pull away at the top panel. Also do pay attention to this clip here. I should have pulled this out first. Ours came out without issue, but what you're supposed to do is pull back on this retention clip and then lift up. And then you should very easily be able to slide out the ribbon cable. We're gonna leave it like this and that'll make the re-installation much simpler. Now we're gonna take care of these smaller boards. First off this one in the back is responsible for WiFi and Bluetooth. You can see its antenna runs all the way to this front board here, which powers this speaker and also is responsible for the power button. Which of course we just removed part of by removing the ribbon cable. So we'll start here. It's gonna be a T9 torx bit. If you have trouble with that T9 drop down to a T8. I don't think you're gonna strip anything. We'll get these two screws out here and then we will remove this antenna. Just pull straight up. We can pull these clips out of the metal housing, and then we can detach the other side of the antenna from the front board. Now this we're gonna wanna pull straight up on because it slots into a connector underneath. So be careful here, there you go. And you can see part of that connector will attach this speaker from the front board and the speaker itself should simply unclip from the metal housing. Now we're removing these longer torx screws, that thread all the way through the metal housing. Once we get these out, we'll be able to separate this housing from the plastic bottom shell. Just one more to go here. And then I think this should just pull on out. Wanna be careful of course sensitive stuff inside, (metal clanking) but yep, there we go. Now this actually looks pretty good. There is some dust collected here at the back and along the left side, but otherwise, yeah, not too bad a shape. Now we can take care of this front board with these three torx screws removed. This will just slide out like the WiFi board did. We're gonna pull straight out toward the camera. The connector's right here. It's wanting to be a bit stubborn. It's never been removed before. And there we go. Now we're gonna take care of three more torx screws. And these actually hold this cable that connects to that WiFi board against the top of the metal housing. So one, two and three. Now we can carefully lift up and all is revealed on the inside. You know, I've gotta say, for never being cleaned in its life. I am pretty impressed with this one. It's not that bad. I mean, it's definitely not new, but I've seen much, much worse in a console this old. We're gonna remove these cables. They all sort of just pull straight up from their connectors on the board. Just be careful. You don't wanna dislodge the connector itself in question, that could be pretty bad. Let's see, we're gonna pull up on this here. That's power for the hard disk drive, sata data for the same drive. And then this should just pull straight up and same goes for the optical drive here. So sata data cable pull back on, and then we'll also pull back on the board side and once more for power, pull back and pull back. Now this optical drive should also just pull straight up. Check that out. The last cable to tackle in this entire console is this one right here. And this is responsible for powering and controlling the RPM of the fan. Carefully wiggle this one out and yeah, pretty much it there. Now we can remove these plastic clips. This one here. And these two black standoffs don't use screws. They just kind of clip into the bottom side of the metal housing. Now there's only a couple more things holding this main board in place. That'll be these two screws right here and right here. And these two here, closer to the front of the console, or if I suppose further away from the camera. Oh, I almost forgot these four screws here holding the back plate of the cooler. Once we remove these four, then we should just be able to pull this little metal housing away. And now what I'm gonna do is flip this back over the main board should pull straight out. Just be careful because there are a few places where these connectors are actually touching the metal shell. Tight fit that is for sure. And look there. That's the bottom side of the inside of the Xbox One. Now there are only a few things left to tackle when you to flip this main board back over and gotta get this off here. So this is the retention bracket for the cooler and the way to get this off. It's a little sketchy. But if you get a larger flathead screwdriver, it shouldn't take too much force. You're gonna wanna carefully insert your flathead into the little U shape area where this retention bracket wraps around each of these standoffs. And you're gonna wanna rotate counterclockwise. It's a bit awkward doing it from this angle, especially for the camera. Yeah. And of course this is being stubborn. Remember, you've got a ton of SMDs around here. You wanna be very careful not to dislodge any of them or you'll have a bad time. If you find a side like mine, that's being stubborn. Don't fret. Move on to another corner. This one here came up fairly easy. I'm gonna go for the opposite side now. And that was just as easy. We'll go for this one here, which is the last one I haven't tackled yet. Slide it in and you can see I'm rotating. There we go. Whew, gotta be real careful with that. Everything looks okay here, but it could end a disaster folks. So just make sure that you're easy with this. I know you have to apply a lot of force, but you don't want to just go crazy yanking things cause you will dislodge these resistors and capacitors and you don't wanna have to re-solder if you don't have to. At this point, we can lift the motherboard away from the cooler and there we are. You can see the thermal paste here that has obviously not been changed since it's been manufactured. And I tell you what, the cooler actually looks pretty good for its age, it's not too dusty. You can see though how the main board is caked in a very fine layer of dust. It's not the dark true green that it should be. Check that out. See? So it looks pretty clean here, but it should be much shinier than this. And that's just because the dust is dulling things out. So when we clean the main board, we're gonna focus on pretty much every part of this, not just the APU. Last few steps of disassembly. Then we'll flip the cooler back over. We need to unclip the fan from the heat sink. We'll be cleaning this separately. There we go. Alrighty. And that's that, the cooler is now separated. We can clean these separately. This one here. We're gonna use a lot of IPA and Q-tips. This one here we can run under hot water and then blast with our electric duster. We've also got the small little platform that our hard disk drive sits on. We're gonna take this out, obviously not with a flathead screwdriver. We're gonna still have that on there. This is gonna be a torx screw head, just like what we use to take apart the shell. This thing also kind of latches into the cables, pull up like that and now we can disconnect the cables. Also, eww, what the heck is that? And the very, very last piece we'll focus on. This is the optical drive. We're gonna take this little black plastic cover off. This just helps situate it in the case. So there we go. And this here is just about every component in the Xbox One disassembled. Now we need to start focus on the cleaning part of this video. We'll take the plastics as well as these metal housings outside and blast these with water. Then we'll take 'em inside, dry them and move on to the smaller bits. Here we go with the shower setting on the nozzle. Just so the stuff doesn't blow away. Cause that would be yeah, not pretty. (water spraying) Oh yeah. (water spraying) Now these metal bits already look so much better. Next up are the plastic panels. These are a bit dirtier, but there're gonna clean up nicely. (water spraying) Oh yeah. Make sure to pay special attention to the grills because this is where a lot of the dust likes to settle. Now you'll notice I still have this front panel ribbon cable installed. I haven't removed it because it's okay to get this stuff wet so long as it's thoroughly dried afterwards. (water spraying) Now, if you noticed any hard on stains that don't come out with just water alone, you might need to take these inside. Use hot water and soap. That can also help with the plastic stuff. Last piece here. And then we'll dry everything inside. (water spraying) It's amazing. What water alone will do. Hey go, please buddy. Can you not? Okay, thanks. Watching my parents' dogs while they're on vacation. So bit of a handful, here I'd just like to use a towel. What you can do to make sure that things are dry thoroughly after this, you can hit it with some compressed air and electric duster, will get a lot of the water out of the smaller seams. And then you can set these outside if it's, you know, hotter so that this water can evaporate. That'll make sure that there are no traces of H2O remaining by the time you start reassembling these things. Moving on to the main board, I like to use isopropyl alcohol for these. Now what you could also do is just blast it with some air. But what you'll find is that, especially in these older boards, this dust will be kind of caked on. So it won't come up super easy. You'll see, I'll just touch it right here. There's some of that dust coming up, but you've gotta really scrub it to get it nice and dark green, right? That's the silk screen you wanna see. So just, you know, hitting it with some air is not gonna totally clean this up. Ask me how I know. And that's why I like to use IPA. What you can do actually is just carefully pour some over the board in a few areas. This stuff will not hurt the electronics. And then when you have these puddles, you can take some Q-tips and start running around the board and getting up all of this dust. Just make sure that you don't miss any areas because it will show up once this IPA dries. Comes right up with the Q-tip, you can also start rolling the Q-tip as you're sliding along the board so that you're not just smearing it. You will end up smearing it inevitably. But the idea here is to get most of this dust dislodged from the board. And then once this IPA dries, we can hit it with our electric duster after the fact. And that should take care of the rest. See this area here, watch how much cleaner it looks. Once we scrub it with IPA. There it's gonna soak up a lot of that dust up front. Oh yeah. There's that darker green we're looking for. Now the area over here. We're just gonna soak it all up. This is a very rewarding part of the, of the cleaning process. I love this part, even though again, it does take quite a while. It is so satisfying watching this dust get soaked up. You can also turn our attention to the APU, where this old thermal paste will need to be picked up. Again, IPA and Q-tips, pretty great combo for this. And would you look at that shiny mirror underneath. Looking super fine. Now, normally this paste around the dye could just stay here. It's not really hurting anything. But I like to make these GPUs or these APUs rather in this case, look as good as new. And to do that, we've gotta pick up all the thermal paste, we can see here. - [Narrator] 2000 years later. - [Greg] Okay. I think that looks pretty darn good. She's not perfect, but it definitely looks a lot better than what we started with. Now, we're gonna start air dusting the board. Got my new electric duster here and this will come in super handy. If you don't wanna keep buying cans of air to clean systems like these, here we go. (air blowing) And after cleaning the ports as well, you can see this board is looking so much better. I'll even give you a little side by side comparison here, so you can see just how magical the transformation was. And all we did was hit it with some isopropyl alcohol, Q-tips and a duster. You could choose a can of air to replace that. Moving on to the heat sink. Let's first get this thermal paste up and it's a bit chalky, definitely needs to be replaced. I expect we'll see a pretty healthy temperature drop as a result of just re-pasting this console here. I don't think we're gonna see a big temperature difference just from removing the dust, but re-pasting, especially after a few years of use will almost always lower temperatures to some extent. (air blowing) While we're at it, we can also tackle these black trim pieces and holders. (air blowing) Now we arrive at the only fan in this entire console. This one looks like a 120 mil. What you'd find in pretty much every Xbox One or first gen Xbox One, at least. But I like to spend a lot of time with these because restoring a fan properly, not really cleaning it, But we'll also lube it up as well, to make sure that the bearings are gonna be good for the long term. Means that this fan will last so much longer. Now we could just outright replace this. There are fan upgrades for Xbox Ones. Could just stick a Noctua fan onto the cooler and it'd probably run a lot quieter. But these fans are designed specifically for the console and they clip nicely into the heat sink, that we just cleaned. So we're gonna spend a lot of time with this. Like I said, I like to start first with Q-tips and a lot of isopropyl alcohol. We're gonna clean the fan blades as well as the inside of the frame. (Q-tip scrubbing) So check this out. You'll see this fan blade here is extremely dirty. Yeah. So I'm going to come in with the Q-tip and the IPA, the angle of approach for me with this, I'm trying to get this on camera here. Is a little awkward, but you can see just the huge difference already when this IPA dries, is when you'll see the true color of the plastic, which is a bit lighter than this. But still, we're picking up lots and lots of dust here. I mean, just look how dirty that Q-tip is already, right? Just soaking in the dust. That's what we want to see. And once it's about 70% scrubbed and dry, you'll want to hit it with your duster, that should get rid of the remaining dust, in the fan in question, here we go. (air blowing) And there we are. It's one much cleaner, nicer looking fan. There are a few scuffs that obviously we can't get up, that's just scratches, blemishes in the plastic or the composite that we can't do anything about. Cause it's just, you know, part of the manufacturing process, but obviously not gonna affect thermals in any way here. So those little texture variations just come with the territory, but all the dust is gone and the fan spins nicely. We even lubed it up for him and should be good to go for several years to come. We can tackle both the hard disk drive and the optical drive just by using IPA and some shop towels. Pour just a little bit on there, let that get soaked up and then we will scrub it down. And of course, we'll follow this up with a shot of air, just to get rid of the bits of shop towel that are kind of fraying everywhere. I like to use these instead of the Q-tips obviously because we can cover much larger surface area in a shorter amount of time. Plus, I mean, these are mostly flat surfaces, so it's not really that difficult to scrub. (air blowing) And that is one healthy looking hard drive. (air blowing) And there we have it. These boards are looking virtually brand new minus some remaining dried flux from the factory. I can't really get some of that stuff up. You can see it, especially on this side. There's just some lighter stains that are kind of sort of coming up with IPA. But again, I mean, scrubbing for like hours might get this stuff up. It's just really not worth it in the grand scheme of things. The board otherwise is totally free of dust. Technically we're not finished just yet. I do like to clean these screws, some call that a bit excessive. Obviously it's not really gonna hurt performance too much, but aesthetically, if you have really dirty screws but clean boards, I mean, you might as well just call the whole thing dirty in my opinion. So I like to soak these in some IPA, I'll even use some Q-tips to help out, especially with the heads of the screws. And just like that we are finished with the cleaning. Now we need to reassemble everything and it's all right here on the shelf behind me. I try to place it high up so that too much dust falls on it. But if it does, it's very easy to blow off cause it hadn't settled for too long. So let's get to reassembly. To start, we'll need our motherboard. But before I get ahead of myself, we also need to reassemble this cooler here. I will also need some thermal paste. We're gonna be using Thermal Grizzly's Kryonaut solution here. I love using this for all the builds that I work on here in the office. You get great temps and it's stuff that doesn't cure long term either. So it should be good for several years. So what we're gonna do first off, very simple, flip this back over and I need to remember the orientation here. So with the motherboard oriented, like so, we're gonna want the side with the two protruding copper heat pipes facing toward the rear IO, the rear ports in the console. So it'll sit like that. And then what we'll do, because this cable needs to be facing toward the header here, is we'll just sandwich, the cooler's fan on like so. (fan snapping) It's actually quite nice not having to use screws. So now we'll get the thermal paste here on the APU and we'll put quite a bit, a bit more than you might think we need just to be on the safe side. You'd rather add a bit more than a bit less. And then once we apply mounting pressure to the cooler, this will spread out. Now, what I like to do here is go ahead and position the cooler where it needs to be, thread it through and then holding both, we'll flip the assembly upside down and then you'll see the standoffs poking through. Now, this is where we need to get the little brace here secured. And you wanna be careful again because of how this is designed. You're gonna have to apply quite a bit of force to get this around the remaining two standoffs. You might need to resort to a flathead screwdriver, just like we used to remove this in the first place. So we'll bend it back and try to wrap it around. There we go. That one's good. And same thing for this last standoff. Just bend it back a bit, apply some force. Again, be very careful. Now this back plate is secure. Reconnect our fan cable just slides straight in like so, and now we can situate the main board in the bottom half of the metal shell. I like to start with the rear IO and the rest of the board should just barely fit. Gotta make sure we can see all of our ports through these cutouts. You then get these plastic standoffs installed and these black ones again, don't require any screws. They just kind of clip into the housing. And finally this white one closer to the rear. This one does require a screw, thread it through from the side and tighten it down. Now we're gonna flip the entire console over to the point where the cooler is pretty much holding everything up and we're gonna tighten down the little cross member, this little X brace here, with the four screws that we removed earlier. Don't forget these four silver torx screws. Two of them are gonna go up here and the other two down here. Once these are good and tight, your motherboard should now be fully secured to the metal shell. Our disk drive will sit right about here. Of course we'll tighten this all down with those longer screws later. Pretty much just as simple for the optical drive, in this case, it'll sit right about there. And with these cables connected, we have just a few more things to take care of and then this thing will be ready to go. We'll reconnect and lock down this front panel, just slots in like so, torx screws in. WiFi connector secured to the top of the metal shell. This connector is then connected to the main board. Just be very careful. And then with that slotted in, we can now reconnect the top panel to the bottom. Of course, this isn't the exterior of the console, but it is an important part because this helps fasten everything else down, thanks to these longer torx screws. With the plastic exterior housing in place, we can drop the metal shell in position. We can reference the cutouts at the rear to help us align this a bit better and then take these torx screws, thread 'em all the way through. And it's coming together. We'll slot in our WiFi card, push straight down, make sure you have a proper connection there. Two more torx screws, speaker and antenna. Now this next part can admittedly be a bit tricky. We need to connect the ribbon cable to this front panel here. And that is kind of like all one big unit. So yeah, it'll be fun. So figure out a way to connect this. I'm just gonna tell you how I'm gonna do it before actually trying to film it because it might not all show up on camera. But once you connect the ribbon cable, you're gonna have to kind of hinge it on the bottom and then fold it down and might take a few tries. If you haven't done this before, you will very quickly understand what I'm talking about. Once it's in position down there, you kind of gotta sort of squeeze this. There's a clip here. That's what really makes it difficult. - [Narrator] A few moments later. Wow. Okay. So I just found a way to do this so much easier. I have not seen this on any forum I've read. I'm sure it's out there, but so many folks have issues getting this top panel on. Like I said, it's a pain in the butt, so here's how I did it. I'm gonna go ahead and rotate this around for you so you can see better on camera. So what you wanna do is disconnect this top panel from the front panel. And it's very easy to do that. There's just some clips here and you pull back on these little clips and this just slides up, right? So now the top panel's detached from the front panel. Now the front panel hinges into place. This is very easy to get situated, once it's hinged. You wanna make sure that you're lining it up correctly, just like that. So, that right there is a fully situated front panel. Okay. No issues there. So this top panel slides straight down onto these clips here. And that was what created a lot of the problem, was that you had to hinge this front panel back toward me, but you also, at the same time had to slide this panel down and doing both was just near impossible. Cause you were missing these clips, especially this one up front. So what I'm gonna do is drop this front panel straight down. In fact, I'm actually gonna clip it totally into position or as much into position as I can. Now this front part, right, all I'm gonna do is slightly pull back on this front panel. I'm gonna lock the remainder of the top panel in place. And then this front panel will just push back straight into place. That is oh, leaps and bounds easier than the way I was doing it before. I did it this way. Well, I did it the wrong way in episode four. And so I'm sure, I don't know. In hindsight I might have been called out for that. I haven't seen the video yet because I haven't published it yet. So I don't know what the comments look like, but this is just so, so much easier. The last two steps then, we're gonna slide this plastic piece forward and then we're just gonna latch this grill. Push straight down. And there we go. So now that the console has been fully disassembled, deep cleaned and reassembled. The last thing we need to do is attempt to power it on and make sure that it functions the same way as it did when it arrived in the studio yesterday. So let's connect power at the rear and I can already hear the AC adapter starting to spool up. Whew, it's a good sign. The front power button works. Sometimes the ribbon cable can get snagged or it can break and that causes issues, but it is looking like it works. That is super good stuff. So I hope you all have enjoyed watching the cleaning process with this one. I know that some of you are a bit disappointed that you don't really get to see the insides of these once they are fully deep cleaned. And I get that. I understand that criticism and that's again, why we still are running at the same time, the PCDC series. So now if you want the best of both worlds, so to speak, they're both at your disposal. In fact, both playlists are running right now. We are currently uploading to both of them and I'm actively cleaning both computers and consoles. The thing about consoles though, in this, this day and age, right in 2022, it's just, it's bizarre that this is even a thing, but a lot of folks who were previously in PC gaming are kind of, sort of falling back into consoles or maybe you've been wanting to get into PC gaming for a while, but with graphics cards being as expensive as they are, I mean, it's a huge barrier to entry. So people are still gaming on consoles. And if you still are, especially with these older ones that have been in use for several years, consider cleaning them. I mean, that's what I want these videos to really do at the end of the day, is kind of like work as that catalyst to get you to be confident enough to take your console apart and clean it because it will definitely help keep it alive. Not only for the foreseeable future, but also help it run quieter and cooler. My goal with every one of these is to make them look as new as possible, as close to stock, as close to fresh out of the box as possible. And that's kind of sort of an unreachable goal because most of these consoles have blemishes and scratches and things, especially in these plastic bits, that just, you know, what can you do? And they won't obviously disappear just by scrubbing them with soap and water and whatnot. So those are the dead giveaways that these aren't new. But apart from that, I'd say this is a job well done. This console has more or less been restored. Should have plenty of life still left in it. With that, if you guys enjoyed watching this video, be sure to let me know by giving this one of thumbs up, that would be greatly appreciated. If you have not subscribed yet, get subscribed, what are you doing? Come on, get, click the red button already, click that bell too while you're at it. And consider leaving some feedback in the comment section below. Even if it isn't positive feedback. I mean, what's the point. If all I asked for is positive feedback and like filter everything else, I mean, what, just wanna make myself feel good temporarily by reading the comment section. I encourage you guys to be critical, to an extent, obviously don't be a total prick about it. Okay. Those I just ignore. And some of those people I hide their comments. They don't even show up. But if you have constructive feedback, suggestions, and how to make these playlists better, I am all ears. Ultimately I create content for you all to consume. And so at the end of the day, I need to keep you all happy. Just like I need to keep my advertisers happy. I wouldn't even have advertisers if not for you all. So that contribution, all of that feedback in the comment section is greatly appreciated. Again, minus the jerks, there are a few of those. Pretty much everywhere online. With that, thank you for watching this far into the video, especially. My name is Greg. Thanks for cleaning with me.",
    "transcript_keywords": [
        "board",
        "back",
        "console",
        "bit",
        "pull",
        "front panel",
        "pull back",
        "front",
        "panel",
        "pretty",
        "dust",
        "screws",
        "make",
        "kind",
        "IPA",
        "fan",
        "Xbox",
        "pull straight",
        "good",
        "main board"
    ],
    "transcript_entity_values": [
        "first",
        "the end of the day",
        "six",
        "Valorant",
        "PX160",
        "three",
        "Orlando",
        "FPS",
        "120 mil",
        "99",
        "Thermal Grizzly's",
        "a few years",
        "half",
        "about three or four",
        "AC",
        "about 70%",
        "several years",
        "APU",
        "PCDC",
        "Just one",
        "Fortnite",
        "One",
        "two",
        "four",
        "U",
        "this day",
        "0",
        "BLD",
        "3",
        "Florida",
        "YouTube",
        "2022",
        "Xbox Ones",
        "Xbox",
        "PlayStation",
        "IO",
        "0 cents",
        "Kryonaut",
        "one",
        "League",
        "Xbox One",
        "like hours",
        "1080P",
        "Greg",
        "Two",
        "two year",
        "sata data",
        "IPA",
        "First",
        "T9",
        "an hour",
        "PS4",
        "a few days",
        "yesterday",
        "Noctua",
        "Xbox",
        "NZXT"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "FAC",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "TIME",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "FAC",
        "ORG"
    ]
}