{
    "id": "4QrGdzYiNFY",
    "title": "The MacBook Pro Survival Kit [2018]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-02-03T18:23:40Z",
    "video_url": "https://www.youtube.com/watch?v=4QrGdzYiNFY",
    "category": "Science & Technology",
    "tags": [
        "macbook 2018",
        "dockcase review",
        "hyperdrive macbook pro",
        "anker powercore review",
        "anker powercore 26800",
        "microsoft arc mouse touch",
        "rain design mstand 360",
        "qwerkywriter",
        "lofree",
        "mrmobile",
        "michael fisher",
        "macbook accessories",
        "macbook pro 2018",
        "macbook pro 2017"
    ],
    "views": 978013,
    "likes": 14938,
    "comments_count": 482,
    "description": "Start your free trial today at  to get 10% off your first purchase.    [MACBOOK PRO SURVIVAL KIT 2018]  You know that feeling you get when you upgrade your tech  and it almost seems like as big a step backward as forward? Thats how I felt when I switched from the 2015 MacBook Pro to the MacBook Pro 2017: it gained some power and lost some weight, but it also lost a lot of ports that I needed -- and the battery life has been a wash. If youre in the same boat (and switching to PC is not in the cards) Ive found some accessories that can help. Join me for the MacBook Survival Kit for 2018, brought to you by Squarespace.   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  HYPERDrive USB Hub for MacBook Pro:   Verbatim USB Hub for MacBook Pro:   DockCase Hub/Sleeve for MacBook Pro [Amazon]:   DockCase Hub/Sleeve for MacBook Pro  [Dockcase.com, use code \"MFisher\"]:   Dreamvasion Magnetic USB-C Adapter:   Anker PowerCore+ 26800:   Anker PowerPort +5 with PD:    Anker Valentine's Day Promotion:   QWERKYwriter Mechanical Bluetooth Keyboard:   LoFree Mechanical Bluetooth Keyboard:   Microsoft Arc Touch Mouse:   Rain Design mStand 360:    [ABOUT MRMOBILE'S MACBOOK PRO SURVIVAL KIT 2018]  Sponsored by Squarespace.  This video was produced following several months acclimating to a MacBook Pro 2017 using a variety of accessories. The HyperDrive, Verbatim and Dreamvasion products were purchased by Mobile Nations, while the remainder are review devices supplied by the respective vendors for the purposes of this review.   The lone sponsor of this video is Squarespace; none of the featured manufacturers provided compensation for being included.   [LINKS]  TweakTown DockCase Review:    [MUSIC]  A New Departure by Vincent Tone, available at Premium Beat:   Glowing City by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://www.squarespace.com/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4iy",
        "http://mrmobile.tech/4iz",
        "http://mrmobile.tech/4j0",
        "http://mrmobile.tech/4jg",
        "http://mrmobile.tech/4j1",
        "http://mrmobile.tech/4j2",
        "http://mrmobile.tech/4j3",
        "http://mrmobile.tech/4je",
        "http://mrmobile.tech/4j4",
        "http://mrmobile.tech/4j5",
        "http://mrmobile.tech/4j6",
        "http://mrmobile.tech/4j8",
        "https://www.tweaktown.com/reviews/8337/dockcase-connectivity-dock-macbook-15-review/index.html",
        "https://www.premiumbeat.com/royalty_free_music/songs/a-new-departure",
        "https://www.premiumbeat.com/royalty-free-tracks/glowing-city",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [MrMobile] You know that feeling you get when you upgrade your tech to the newest thing and it almost feels like more of a downgrade? Yeah that's how I felt when I switched from the 2015 Macbook Pro to the 2017. Sure it gained some power and lost some weight, but it also lost a lot of ports that I needed and the battery life has been a wash. If you're in the same boat and switching to PC is just not in the cards, well I found some accessories that can help. I'm MrMobile and this is your Macbook survival kit for 2018 brought to you by Squarespace. (upbeat music) Up first, an accessory I use every single day, the Hyper Drive. The first time I saw this was in 2016 and I knew I had to have it even if it cost me almost a Benjamin, which it did. The good, it's small enough to disappear into a bag pouch, it restores all the ports and slots from the 2015 that I need and it's much more elegant than the Apple tongles. It's also got an LED to let you know it's connected, and I like lights. The bad, it's hard to keep it connected unless it's stationary on a tabletop. Moving the computer can easily jog it loose. And for some reason ejecting SD cards doesn't always work so you need to force eject which doesn't seem to hurt anything but it's still annoying. So why is the Hyper Drive still number one on my list? Well a lot of companies made variations on this product and most seemed to work better than mine. Andrew Martinek over at Android Central uses a smaller Verbatim branded dock that he says works perfectly. So I'll drop links to that and to mine in the description where you'll also find links for all these products by the way. If you still want the ports and you're also the type who carries a laptop in a sleeve, check out Dockcase. This is another successful Kickstarter gone mainstream and it takes the form of a big envelope made of synthetic leather. On its edge is an aluminum rail that includes all the ports we just saw on the Hyper Drive plus an extra USB-A and an ethernet jack. The idea here is that you lay your Macbook on top while you're working and a dedicated cable makes the connection to the port rail. On the plus side the case is thoughtfully designed, with a magnetic closure on the flap, some okay-looking stitching, and a little sleeve for the connector cable. On the downside, there's no mechanism that keeps the sleeve rigid so the laptop sits at a slight angle. Also you can't really charge your phone via the dock ports because of low output and Tweak Town reports inconsistent data throughput as well. That's a significant letdown, especially for the list price of this thing. The Dockcase did send over a code so that you can get a discount if you do want to order this, I'll throw it in the description as well. My favorite thing Apple ever brought to the laptop was MagSafe. The breakaway magnetic connector that saved my Macbooks from countless careless falls over the years. Well that's a feature Apple ditched with the switch to USB-C, but there is a way to get it back. Baseus or Dreamvasion is the best reviewed company I could find on Amazon making magnetic USB-C adapters. The good, it's dead simple. You plug one side into the charging port, you snap the other side onto your cable, and boom, magnetic charging. Pops off if you trip on the wire. The bad, it's not omni-directional so you need to decide which direction you want the cable facing when you install the computer-side jack. And removing that jack to realign it can be tricky. For all the complaining I've done about the ports on the new Macbook, they do enable a convenience for those times you can't find an outlet. You can charge your laptop with a battery pack as long as it has USB power delivery. Enter the Anker Powercore 26800. Its big capacity is right in its name. Its metal casing makes it durable and it is USB PD compliant. Those are the pros. The cons, well that metal casing also makes it heavy and you need to use a PD charger to top it back up otherwise it takes forever. Anker sent me the Powerport+ 5 for the purpose which has also been my travel charger for a few months now. Keep in mind that the Macbook is a huge battery drain compared to a phone so you're only gonna gain something like a half a percent per minute, but at least it's going in the right direction. And of course you can use the pack to recharge phones or tablets as well. By the way this isn't a paid Anker sponsorship or anything, they just happen to be a brand I've been using for a long time. If you're looking for an altervative, I've also had good luck with RAVPower products. And finally there's the issue of the new butterfly keyboard. After about three months, I finally got used to it, but if you long for the tactility of keys that actually, you know, move there's a glut of bluetooth keyboards out there to choose from. I covered these two a long time ago on the Instagram channel. They're called the Qwerkywriter and the Lofree. And my favorite mouse is still Microsoft's Arc Touch design, which got a refresh last year. The new thing I'm showing off here is this Lazy Susan kind of thing. Actually it's called the mStand by Rain Design. And its whole purpose is to raise your laptop up high so you don't get that crick in your neck while you work on it. If you're like I was, trying to muddle through with a laptop stand made of stacked shoeboxes so your computer clears your microphone, the mStand is well worth a look. Especially now that the price is down to $40 bucks on Amazon. Oh and Rain Design makes smart phone stands too. One last time, all these products are linked in the description below, folks. And if you find a better deal on similar stuff elsewhere, drop a line in the comments. And before you get out of here, please also check out MrMobile Sponsor. This video is brought to you by Squarespace. I bet you didn't know it, but we at Mobile Nations have a few sites built on Squarespace. They're fresh, they're flexible, and if anything ever goes wrong, we get 24/7/365 customer support. You can build one too, whether you're an artists, a musician, a designer, anything. Click on through to squarespace.com/mrmobile for 10% off your first purchase. And hey, if there's something missing from my site that you'd like to see added, let me know in the comments and we'll see what we can do. Meantime, get your own site started at the link in the description squarespace.com/mrmobile Well, it's time for me to get back to trying to figure out this touch bar, folks. Until next time, thanks for watching. Please subscribe and stay mobile my friends.",
    "transcript_keywords": [
        "Hyper Drive",
        "upgrade your tech",
        "Macbook",
        "ports",
        "laptop",
        "time",
        "thing",
        "newest thing",
        "Hyper",
        "Drive",
        "Rain Design",
        "Apple",
        "long time",
        "cable",
        "magnetic",
        "description",
        "find",
        "Squarespace",
        "Macbook Pro",
        "makes"
    ],
    "transcript_entity_values": [
        "Macbooks",
        "Dockcase",
        "the Anker Powercore 26800",
        "the Hyper Drive",
        "mStand",
        "2017",
        "Macbook",
        "Instagram",
        "Anker",
        "USB-C",
        "Mobile Nations",
        "a few months",
        "RAVPower",
        "Microsoft",
        "Apple",
        "2016",
        "every single day",
        "the years",
        "Anker",
        "2018",
        "last year",
        "Arc Touch",
        "10%",
        "USB",
        "$40 bucks",
        "Android Central",
        "the 2015",
        "first",
        "One",
        "Macbook Pro",
        "jack",
        "Kickstarter",
        "two",
        "Benjamin",
        "MagSafe",
        "Qwerkywriter",
        "Squarespace",
        "MrMobile",
        "PD",
        "2015",
        "SD",
        "about three months",
        "Andrew Martinek",
        "Macbook",
        "Amazon"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "FAC",
        "ORG"
    ]
}