{
    "id": "4RmyXRggTN0",
    "title": "They Are Finally Here! - Apple iPhone 13 and 13 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-09-28T03:55:09Z",
    "video_url": "https://www.youtube.com/watch?v=4RmyXRggTN0",
    "category": "Science & Technology",
    "tags": [],
    "views": 1099039,
    "likes": 35479,
    "comments_count": 2018,
    "description": "Get the Anker Nano Pro charger for your smartphone at   Our Apple iPhone 13 devices finally arrived at the office, and well it's a bit of a toss-up between this and the Pro and Non-Pro version. Which one will you get?  Get a new skin from dbrand today at   Buy Apple iPhone 13 On Amazon (Paid Link):  On Best Buy (Paid Link):  On Newegg (Paid Link):   Buy Apple iPhone 13 Pro On Amazon (Paid Link):  On Best Buy (Paid Link):  On Newegg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://ankerfast.club/3z6ys0p",
        "https://dbrand.com/shortlinus",
        "https://geni.us/o3msYNV",
        "https://geni.us/PG9YcC",
        "https://geni.us/ThTLOJc",
        "https://geni.us/3Z0vodc",
        "https://geni.us/wfww",
        "https://geni.us/husgNa",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Little care package arrived from the good folks at dbrand. I'm kidding, of course, there are no good folks at dbrand, but dbrand did send us both the iPhone 13 and iPhone 13 Pro. And I got to confess David, I'm at a bit of a lost on this one, because most of the phones we've covered recently have either been ones that I'm expecting to love, or ones that I'm expecting to hate, and everything I've seen about the iPhone 13 hasn't inspired any emotions for me whatsoever. It's an iPhone, you kind of know exactly what to expect, but that's also not entirely fair because the 13 improves over the 12 lineup as a whole, in a couple of big ways. So number one, we've got their new A15 Bionic chip, which Apple no longer advertises as X amount, faster than last generation, because the improvements appear to be relatively small, but rather they advertise as X amount faster than competitors, which is still a big, fat, impressive number. It's still built on a five nanometer process from TSMC. I don't think we've nailed down whether it's their N5, or N5P for performance process, but the general assumption is that it's N5P, they've got improved displays and cameras, and this is a pretty big deal for me, anyway, they have reduced the size of the notch. The same ceramic shield glass from last time makes a return. We've got the same four gigs of RAM in the non-pro models and six gigs of RAM in the pro-tier models. Apple has maintained the same 12 megapixel resolution of all their rear cameras, though it should be noted that the ultra wide has a faster lens to allow for better low-light performance, not to mention all of the software improvements that they've made there. And Apple still has not done a way with what is now a classic, the Lightning port. Now, speaking of the Lightning port, some people are expressing disappointment that the iPhone 13 range supports only seven and a half watt charging over the Qi standard, 20 Watts over the Lightning port, and 15 Watts using a MegSafe compatible accessory. Now, included in the boxes are only a Lightning accessory cable Type-C to Lightning, no charger, nothing like that, which I guess we've come to accept at this point. And now I wanna touch them. (romantic music) I don't know what the feelings are like online, but I am loving the look and hand-feel of the 13 Pro. It might be exactly the same as the 12, but my only point of comparison is this really ratty dbrand skin that I have on my 12 Pro. So I'm actually gonna go ahead and remove it now. okay. It feels the same. (laughs) But it doesn't look the same. Look at how much bigger these camera elements are like, damn, that's crazy. - [Siri] I don't know how to respond to that. (cameraman laughing) Oh, I'm so glad you brought that up, Siri. So cool feature that Apple has added to iOS 15, which of course you can access by a long pressing the power button is Siri can now operate at least for simple tasks offline, that's thanks to the A15 Bionics NPU, or Neural Processing Unit. I don't think Apple brands it that way, but essentially it's an AI processor. And it's one of the ways that Apple has dramatically increased performance over the last gen because CPU, and well, actually GPU was a pretty big improvement as well. But word as marked it as the, oh, neural processing improvements. - Oh-oh, before Linus gets to talking about what he was just gonna talk about, we gotta thank Anker for sponsoring this video. The Anker Nano Pro can charge your iPhone 12, or 12 Pro to 50% in just 25 minutes. That's three times faster than the original five watt charger and 45% smaller. Anker's PowerIQ 3.0 works seamlessly with your iPhone, and other smartphones, and has got an active shield technology, which monitors charging temperatures for safety and stuff. There's also a power tuner chip, which adjusts the current to get the fastest charge. And it's available in four new awesome colors, glacier blue, cool lavender, arctic white and black ice, ugh, so check it out at the link below. - Whoo, photographic styles. Now this is a cool new feature. This is supported on the entire 13 lineup. I was expecting there to be a flatter one that sort of Lightroom ready. But the point is it's effectively applying a, like a preset or a lot to your image that will give it a certain look right out of the camera. So let's oh, okay. So you can go in and it'll actually tell you, as you scroll through here, what presets you're applying. Wow, vibrant is awful. I'm not even going to take a picture of vibrant. (camera clicks) I could see people getting into like that rich contrast look, I like your shirt, David. It's very cowy. How stable is this, you know. Man, the iPhone is so good for video, like you can just, you can tell right on the display. There's a little bit of judder cause it's at 30 FPS, but you don't have to shoot at 30, in fact, they've added 4k 60 FPS recording now. So look at that, clearly and obviously more detail in the 4k capture. Now, one thing that is not here yet is support for ProRes capture, I am super jacked about that. We're expecting it sometime later this fall though. So for those not familiar, ProRes capture basically means that you're capturing data from the sensor at a much, much higher bit rate that makes it easier to manipulate in post in video editing software. Now I just realized that I hadn't even really talked about the notch, yeah, it's smaller, you know, if it had been up to me, I would have preferred that the notch was just as wide, but not as deep, but now that I think about it, I think Apple probably got this right, because this allows them to have much better spacing, and potentially more room for icons up at the top of the screen. Obviously, they're not gonna be able to do away with it entirely because they haven't brought back Touch ID on the iPhone, in spite of the fact that a lot of people would like them to, like, even just, if the Apple logo was a touch sensor, people be pretty, be pretty into that. But so they have to have room for the dot projector for Face ID, and there's, you know, that's just how much space it takes up, apparently. I'm really not feeling the 120 Hertz display, it doesn't oh, felt pretty smooth there. Now, hold on a second. Oh yeah, nevermind, nope, nope, I feel it. I feel, it I've just gotten so used to it on my daily driver phone that I forgot how crappy 60 Hertz looks. That is a big improvement. And honestly, is one of the biggest reasons that I would consider the iPhone 13 Pro over the iPhone 13 is that smoother animations that you get. I mean, you've already paying for the A15 Bionic processor, right? Why not draw more frames per second? It's costing you nothing in battery life. Apple's rated battery life for these devices is higher than last gen across the board, even for these 120 Hertz models. And part of the reason for that is that they've made the 120 Hertz adaptive. So it'll only kick in when it actually benefits from the additional smoothness. Oh, I guess now's a good time to talk about connectivity. So the iPhone 13 lineup has full support for Wi-Fi 6. It has support for 5G, UI Ultra Wideband chip for location stuff, you can check out our Techquickie on that if you wanna learn more about it. Sorry, I'm just playing around with the cinematic recording mode. It's supported on the front camera, which is super cool. Look at this live preview depth of field effect. Not bad, now can it manage to blur something that's close? Yes, it can like very, obviously not perfect, but it's not bad. On-board speakers are so good, man, Apple has gotten really good at having great audio on tiny devices lately. Wow, that's a really big bezel still. That just kinda jumped out of the screen at me. I mean, everything else about the screen, cutting edge, but that bezel though, I mean, sure. The Galaxy Z Fold3 has maybe even a bigger bezel, not by much though, but it's foldable. Like it's it's got a, like a stopper for when you close it. Let's play that 120 Hertz game, I'm interested. (phone whistles) Sounds really good. I believe it is running at 120 Hertz. I gotta say less noticeable on such a small screen for gaming, like I'm not much of a mobile gamer. For me, the 120 Hertz refresh rate experience is really about navigating the phone, touch inputs, just feeling way more responsive. I mean, I did a whole video about this back when the iPad Pro first got 120 Hertz support, and it's very noticeable to me on a desktop size display, but here it's, I'd say less of a big deal. (cheerful music) - [David] I've heard laptop with worse speakers. - Yeah, me too. In case you guys couldn't hear him over the sound of crab rave, David was saying he's heard laptops with worse speakers than this phone. Enough about the 13 Pro though. Let's change our focus to the iPhone 13 for a little bit, because realistically with how much cheaper it is, so it starts at $200 cheaper than the 13 Pro. This is the one that I see way more people buying, it still got improved battery life over last generation. The screen is not as good. So it tops out at 800 nits peak brightness instead of 1200 nits peak brightness. But the camera is I'm going to expect is gonna be good enough for the vast majority of people and really that, and not quite having as good battery life are the main differences between the 13 and the 13 Pro. Oh, I guess there's also the depth sensor on the camera. And you know what I did use that once. I had to use the depth sensor on the iPhone 12 Pro for a bit part that I had in a movie, they wanted me to get a 3D scan of the room that I was shooting in so that they could use that for VFX later, very niche use case, it came up once in the entire year I've had this phone. So your mileage may vary, who knows it might be the kind of thing that comes up for you all the time. You know what the difference in weight is quite noticeable between the two, I wanna see the difference in HDR here. You know, the interesting thing, once you get up to these crazy screen brightnesses, like 800 nits is very bright. Is that in any HDR content that's not specifically mastered to take advantage of that range, you might not get any benefit out of it. Now it's more likely that we'd see kinda, you know, eye searing specular highlights in something off of Netflix compared to, I mean, this is an older HDR upload to YouTube, which has only HDR 10, but the difference between these two to my eye is just so negligible that I just couldn't imagine carrying. I think the fold is a touch brighter that may just be down to metadata interpretation of that. It's probably not because it's actually a brighter display. I do not think that's the case. Larger screens can also have the perception of being brighter, even though dbrand didn't sponsor this video, they did ask if I'm planning a full review of the iPhone 13 or 13 Pro, and I kinda said yes, because I didn't bother doing a full review of the 12 Pro, but honestly, I feel like I've kind of said everything that I have to say about it. If you want the best camera that fits in your pocket, then get a 13 Pro series. If you want almost the best camera that fits in your pocket, get a 13, and if you don't care about iPhones, then there's going to be nothing here that's gonna make you suddenly start caring about iPhones. Like what do I? Subscribe to ShortCircuit. They need a foldable. They need their AR glasses that pair to it. They need a paradigm shift here because this is like, if I was like David, (mimicking shuffling) which one's a 13, which one's a 12? You'd be like, oh my God, who cares? Smaller notch, I mean, I got to give credit where credit's due. I've been complaining about the notch, okay. Thank you.",
    "transcript_keywords": [
        "Pro",
        "iPhone",
        "Apple",
        "Hertz",
        "good",
        "Lightning port",
        "Lightning",
        "care package arrived",
        "big",
        "Anker Nano Pro",
        "camera",
        "good folks",
        "package arrived",
        "screen",
        "dbrand",
        "people",
        "kind",
        "David",
        "HDR",
        "touch"
    ],
    "transcript_entity_values": [
        "Wi-Fi 6",
        "Techquickie",
        "iOS 15",
        "Anker",
        "15",
        "Hertz",
        "three",
        "Qi",
        "RAM",
        "4k",
        "N5",
        "one",
        "ProRes",
        "60",
        "only seven and a half watt",
        "iPhone",
        "12 megapixel",
        "five watt",
        "Lightroom",
        "TSMC",
        "Apple",
        "Siri",
        "the A15 Bionics NPU",
        "just 25 minutes",
        "second",
        "VFX",
        "Watts",
        "AI",
        "The Anker Nano Pro",
        "13",
        "David",
        "Neural Processing Unit",
        "daily",
        "Anker",
        "Pro to 50%",
        "first",
        "A15 Bionic",
        "3.0",
        "UI Ultra Wideband",
        "Netflix",
        "two",
        "120",
        "iPhones",
        "200",
        "four",
        "1200",
        "GPU",
        "45%",
        "30",
        "iPad Pro",
        "the entire year",
        "12",
        "Linus",
        "arctic",
        "ShortCircuit",
        "five nanometer",
        "six",
        "CPU",
        "YouTube",
        "30",
        "20",
        "5",
        "Bionic",
        "800"
    ],
    "transcript_entity_types": [
        "FAC",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERCENT",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "LOC",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL"
    ]
}