{
    "id": "4RyIQ15M9_Y",
    "title": "Is My Mac Pro Dead?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-06-19T15:36:18Z",
    "video_url": "https://www.youtube.com/watch?v=4RyIQ15M9_Y",
    "category": "Science & Technology",
    "tags": [
        "mac pro",
        "mac pro problem",
        "problem",
        "mac",
        "pro",
        "broken",
        "graphics",
        "video card",
        "issue",
        "mac pro issue",
        "d700",
        "mac pro broken",
        "apple",
        "new mac pro",
        "2013",
        "2014",
        "2015",
        "dead",
        "logic board",
        "tear down",
        "ssd",
        "replacement",
        "computer",
        "pc"
    ],
    "views": 1094423,
    "likes": 26801,
    "comments_count": 3318,
    "description": "There's a problem with my Mac Pro...  *UPDATE - not software related, issue persists with different users and booting from another system. Not monitor / cable related as problem is exhibited on 4 different displays.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So this is my Mac Pro And the reason it's here and not on my desk is because its... broken :( as you can tell I'm very pleased about that Basically I started having some video issues As you guys now if you've seen my setup video or at least episode one You know that I push a lot of pixels out of this little beast It's been video editing since it's birth, since it got here I dunno if it has to do with it specifically or its just a defect But what I'm getting now is a lot of video artefacting It's basically a garbled mess somewhere within your video feed that exists on your display. Now generally that means that there's something wrong with your graphics card Well in this case possibly both graphics cards because it has dual D700s. This is a very expensive system so that brings me to the next part. It is covered under AppleCare warrantee This system is close to 10,000 dollars now before you write your comment about how crazy that is and obscene just remember that I use this for work on a daily basis. It's produced hundreds of videos I'm looking at it right now I like I'm proud of it or something but yes it's produced hundreds of videos and saving time is money in this business. Yes you could build a PC similar to this one Similar in functionality if you want to. Nontheless I need to get this thing fixed so it can go back to my desk and it can go back to editing videos which essentially what it loves to do most I just...kissed...my computer Anyways it's covered under AppleCare as I've said before and that's imporant cause AppleCare and this is like 250-300 bucks and the system is worth a lot more money than that. If this wasn't covered under AppleCare, it would cost me quite a bit of money. To be exact they've ordered in a new logic board which is $423. Two new graphics cards obviously since I've said this has dual D700's. This is just to be sure they've got it covered Those are 310 dollars each. They ordered in a new DIM of memory 16GB's and lastly the labor charge is on this order sheet as well. The total lump sum figure for this repair is about $1400 if it weren't covered under AppleCare. Ouch! Yes...I've used it hard Now the next point of this video. Since it is going in for repairs it got me a little bit concerned about privacy. As you know I'm a fairly public figure you know who I am and I make videos about products sometimes I talk about Apple, sometimes I make videos like this and of course this thing has a lot of personal information on it that I think should protected So what I'm going to do before I turn this in for that physical repair is that I''m going to remove my SSD and all of my personal information that goes with it And it's actually not that difficult to do. That's why I have this torque TA screwdriver right here there is some good documentation online as well from Apple themselves about how to remove the SSD but I'm gonna show you here just for the sake of it Start by lifting this up. Beautiful sound. And over here you can see where it's located This is the SSD. It's tiny as you can tell and it's a single torx TA screw to remove it. Remove this screw here and then simply lift it out of the place where it is secure and connected from the logic board. Now some of you might be thinking: How will they fix your device if you've taken out the SSD and they cant test it to see if the repair worked? They can actually boot these things off of external drives and do all the testing necessary. They don't need this internal drive or my personal information In order to check if the repair has worked and they're no longer seeing video artefact But for me it's worthwhile for one screw. Easy removal. Why not take the drive out and not have to worry about them going through my stuff. God knows what's on there So thought this was an important thing to share with you guys for various reasons. Obviously my main editing machine is going to be out of service for a little while but also since you come to me for product information and what not. I thought why not report on something that's happened to me as a regular product user over the extended life cycle of a very expensive computer product This is real reporting right here and if anyone else runs into this issue now they have a video at least talking about it cause I found it kind of hard to track down videos like this one. I think that's probably because there aren't that many Mac Pro's out there comparative to more consumer basing products Anyways guys that wraps up this video it's time to put this top back on the Mac Pro Bring it in to the Apple Store. Say goodbye for a little while. I'll be thinking about you I hope you guys are thinking about the Mac Pro as well. How many videos have come through this thing. Videos that you guys have enjoyed! If you guys enjoyed this content make sure to leave a thumbs up below. Thanks as always for watching. And I will catch you up on the next episode. Very soon. Later guys.",
    "transcript_keywords": [
        "Mac Pro",
        "video",
        "videos",
        "guys",
        "covered under AppleCare",
        "SSD",
        "covered",
        "AppleCare",
        "Mac",
        "Pro",
        "Mac Pro Bring",
        "lot",
        "Basically",
        "repair",
        "Apple",
        "thing",
        "remove",
        "information",
        "make videos",
        "system"
    ],
    "transcript_entity_values": [
        "Two",
        "Mac Pro's",
        "close to 10,000 dollars",
        "the Mac Pro Bring",
        "the Apple Store",
        "SSD",
        "TA",
        "423",
        "about $1400",
        "Apple",
        "GB",
        "D700",
        "AppleCare",
        "250-300 bucks",
        "16",
        "daily",
        "TA",
        "310 dollars",
        "hundreds",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "FAC",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "GPE",
        "MONEY",
        "CARDINAL",
        "CARDINAL"
    ]
}