{
    "id": "4VaHN4CG34w",
    "title": "Hacking APIs and Cars: You need to learn this in 2023!",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-05-01T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=4VaHN4CG34w",
    "category": "Science & Technology",
    "tags": [
        "api",
        "apis",
        "hacking api with postman",
        "hacking apis no starch press",
        "api hacking bug bounty",
        "api hacking tutorial",
        "api hacking 101",
        "api hacking insiderphd",
        "hacking rest api",
        "web api hacking",
        "hacking apis free download",
        "ethical hacking",
        "ethical hacker",
        "hacking cars",
        "hacking cars remotely",
        "hacking car computers",
        "hacking car parking multiplayer",
        "hacking cars with python",
        "kali linux",
        "learn hacking",
        "what is an api",
        "bug bounty",
        "rest api",
        "how to",
        "kali linux tutorial",
        "how to hack"
    ],
    "views": 536822,
    "likes": 15978,
    "comments_count": 961,
    "description": "You need to learn how to hack APIs in 2023. This is the future battlefront! Ignore this at your own peril.   // MENU // 00:00   Coming up 00:44   Intro 00:53   Alissa Knight introduction and background 02:36   Published author and filmmaker 03:30   Alissa Knight YouTube channel 05:02   Book on API hacking 06:05   The definition of hacking 10:25   How to approach hacking 14:10   The importance of learning 16:07   How to start hacking APIs 22:54   \"The Desire\" 25:35   Recommended certifications 28:35   Understanding Networking fundamentals 30:04   Do you have to be a programmer to hack? 33:09   Mastering tools 34:33   Hacking APIs 38:43   Shift left security, shield right 40:15   Bank app developed by marketing team 42:51   Smart phone takeover 45:10   How to learn to hack APIs 48:11   Process on how to hack APIs 55:05   Implementing authorization and authentication 56:43   APIs in nuclear plant systems 58:52   Wifi pineapple 01:01:23   Securing APIs in cars 01:03:18   \"Exciting times\" 01:05:45   Conclusion  Nahamsec Interview:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // Alissa's SOCIAL // Twitter:  YouTube:  Instagram:  LinkedIn:  Website:  Hacking Bank APIs:   // Katie Paxton-Fear // YouTube:  Twitter:   // David Sopas // Twitter:  Github API mindmap:   // Hyperfocus daily task sheet // Alissa Knight's Daily Task Sheet:   // BOOKS // Hacking Connected Cars - Alissa Knight:    Hyper Focus - Chris Bailey:    Self Journal by BestSelf:  Hacking APIs - Corey Ball:  The Official (ISC)2 CISSP CBK Reference:   // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  api apis postman burpsuite hacking hacking cars hacking connected cars hacking api cyber security information security sans institute cybersecurity training cyber security training information security training cyber hack privacy nsa oscp ceh  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #hacking #infosec #cyber",
    "description_links": [
        "https://youtu.be/Y2Y4Sk0PswU",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://twitter.com/alissaknight",
        "https://www.youtube.com/alissaknight",
        "https://www.instagram.com/alissaknight/",
        "https://www.linkedin.com/in/alissaknight/",
        "https://www.alissaknight.com/",
        "https://davidbombal.wiki/hackingbankapis",
        "https://www.youtube.com/c/InsiderPhD",
        "https://twitter.com/insiderphd",
        "https://twitter.com/dsopas",
        "https://github.com/dsopas/MindAPI",
        "https://davidbombal.wiki/dailytasks",
        "https://amzn.to/3Ke00GO",
        "https://amzn.to/3vAocxO",
        "https://amzn.to/3ks1BhK",
        "https://amzn.to/37PUwoI",
        "https://amzn.to/3vxzjJ2",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- If you're a penetration tester today, mark my words, mark my words. You need to start learning how to hack APIs, because that is what's coming if it's not already here. One of the things is, I like starting my conferences out with a great quote from Anonymous that's, \"If I were to advise a rogue nation state \"on how to take down the United States, \"I would tell them to start with the APIs first.\" And it's because cyberspace is the ultimate equalizer, and I, one individual, one little old girl in Las Vegas, can take down an entire country simply because I know how to hack APIs. And that entire country is being powered by APIs, from industrial controls systems, all the way to the cars that are driving around on the road. (upbeat music) - Hey, everyone, it's David Bombal, back with a very special guest, Alissa, welcome. - Hey, David. Thank you. Appreciate being here, this is awesome. - It's great to have you here. - Sorry, it's great to have you here, so, as always, let's start with your story, cause that's a really cool story. - Yeah, for sure. So for those of you who don't know who I am, I've been in cybersecurity for roughly 22 years. I like saying I'm a recovering hacker, I started hacking when I was 13. I grew up in the BBS scene in Seattle, believe it or not. So for those of you who are old enough to remember the dial tone of a modem ProCon plus, and AT codes for modems-- - You're making us feel old. - I started my own. Yeah, yeah, I know, hey, I'm a lot older than I look. This is care color, okay? There's a lot of grays here, but so, yeah, I started a multi node BBS in Seattle. And then when I was 17, I was so close to graduating, my parents were like, oh my God, she's almost there, I made a bad decision, I hacked the government network, I got caught and I was arrested at school. And then the charges were dropped, because the arrest was handled so improperly, and went to go work for the US Intelligence Community in cyber warfare shortly after that. Surely then I actually went out, and started working with some of the startups in the Silicon Valley area. I actually started my first company when I was 17, shortly after the arrest, and sold it to a public company when I was 20. And then I sold my second successful startup when I was 27 to a public company. And now I'm in the middle of my third exit, so I'm a serial entrepreneur, serial perfectionist, so kind of all of the above. - I was gonna say, and you do this as well. You write books. - Yeah. And I'm a published author, yeah, you've got my book. - Of course. - Thank you. Give it a review on Amazon, if you don't mind. - No, I'm gonna tell everyone. I mean, I don't understand everything, and I'm hoping you're gonna like explain some stuff in it, but it's a great book from what I've read. - Oh, thank you. Thank you. Thank you. So yeah, so I'm a published author, and my wife and I actually own a family company. So we own, I guess you would call it an umbrella company, which is Knight Group, and that owns Knight Capital, Knight Events, Knight Ink, and Knight Studios. So I'm now at this stage in my life, a cybersecurity filmmaker. So we're filming in Hollywood, in LA, and a producer approached me about a new Netflix TV series based on my life. - That's great. - So I'm actually taking over the production for that. So we're doing a lot, we're having a good time, David. - But you're on YouTube as well, yeah? You've got a YouTube channel. - I am, yeah. So I'm definitely cybersecurity influencer. I have a YouTube channel, so definitely subscribe to my channel. - Definitely, yeah. - It's under Alissa Knight, it's not under a pseudonym or anything, so just youtube.com/c/alissaknight. And there I publish videos on hacking APIs, hacking cars. I've got some great videos on my police car hack, where I was able to take remote control of any, I think it's okay to say it now, Ford, any Ford on the road. - [David] Oh, wow. - It originally started with law enforcement, and I was able to remotely start and stop the engine of any Ford on the road that was connected with their service, which is turned on by default when you buy the car, and remotely lock and unlock the doors. As long as you knew the VIN number. So I think within the last few years of my life, I've been branded as this API hacker. - Yeah. - So there's a lot of videos on my YouTube channel about API hacking, for those of you who are interested in API hacking, and also hacking banks. I just recently published research on how I hacked 55 banks within a week through their APIs, transferred money in and out of accounts, changed pin codes of any bank customer, and then hacked healthcare APIs, and access millions of patient records, because of improperly secured and unhardened fire APIs. So, yeah, I'm kind of all over the place, like I said to you earlier, before the show started, I'm trying to cram as many lifetimes into my one lifetime as I can, because tomorrow's not promised to any of us. - That's exactly right. I mean, so you wrote this, but you're also writing a book on API hacking. Is that right? - Yeah. So my first book was published with Wiley. - [David] Yeah. - And then I saw, this is gonna sound awful, but I saw how much money they were taking from the book sales. - Yep. - So I was like, I went to my wife, Mel, and I was like, why don't we just start our own publishing company, and then publish all of our books under Knight Publishing, where we now also have a publishing company, and my new book on hacking APIs will actually be published under our new production company, Knight Publishing. - And when will that be out? Sorry. - This year, this year. - Great. - So, my plan is to try and get it done and out, I'd like to do it before the Black Hat and DEF CON, cause I'm going, obviously going to those conferences, and I plan to do book signings at Black Hat and DEF CON, so if any of you are coming to Hacker Summer Camp this year in person, yes, we're back to in person, then I will be glad to do a book signing with you. - I mean, that's brilliant. I mean, there's a lot to talk about. So I heard you, you had an interview with NahamSec, and I'll link that below. - [Alissa] Yeah, yeah. - Great interview with Ben. - Thank you. - And you mentioned something which I really like, can you define hacking? Cause you kind of used this term that I really liked, so what would you define as hacking? - So that's a great question, David, I mean, I've seen so many definitions of hacking, and my definition, I think there's some people that will disagree and wanna key my car over this, but to me, hacking is nothing more than just sending stimulus to an application that the developer didn't anticipate, and then sending a response to that stimulus. So it's trying to take things apart, and figure out how something works, and then sending a stimulus that the developer didn't expect. That's to me what hacking is, it's just trying to figure out how something works. I started on a new vulnerability research project, like for example, the hacking 55 banks and cryptocurrency exchanges through their APIs. I didn't know even how to spell API. A lot of people think that hackers come out of the womb knowing this stuff, but we really don't. We do research and learn just like you do. I had to go out there and research the history of APIs, why the hackers freak out when they see JSON responses, and move on to the next target. What is JSON? And so there was a lot of learning in that experience, where you're just kind of tinkering, and one of the things that I would urge all of you to do, for those of you who are red teamers in the audience and, ethical hackers is, don't be so rigid and static about your hacking, your tactics and techniques, when you act like, I need to follow the penetration testing execution standard and start out with intelligence collection, and remove on the reconnaissance. It's not that rigid. - [David] Yeah. - Be more creative. And first and foremost, figure out how it works. So you showed my first book on the hacking connected cars, and I actually wrote a majority of that in Germany when I was living there, working for some of the largest car makers and tier one OEMs, in hacking their fleets of commercial vehicles, I'm sorry, their fleets of connected vehicles. And one of the things that I learned in that process was, I have no idea what an electronic control unit is, I have no idea what a telematics control unit is, but I'm gonna learn. - Yeah. - And so I was fortunate enough to have a client that literally, and he's my friend to this day, sat, just locked me in a room, and whiteboarded with me, and taught me vehicular mechatronics, and all of these other different concepts of in-vehicle networking and V2V, and just taught me how it works. You can't hack something when you don't know how it's supposed to work under normal operation. All hacking is, is just trying to figure out what the developer didn't expect to receive, that's all hacking is. And so, yeah, so that's my definition of hacking, that was long winded, but that's my definition of hacking. - No, I love it, I love it because I mean, I love this, that you're sending stimulus. It's something that the developer didn't think about or didn't expect, and then-- - Yeah, stimulus and response. It's like, if I've got this API, and let's say it's a public and documented API, it's got open API specification swagger, and I want people to write for it. But that swagger filer that open API files says, you can only send this API request and this API request. So it's documented when you're writing a mobile app or something for my API, that's all you can send, but in the back end, the API actually supports a hundred different request types, and the documentation, the swagger of it, only says it only supports two. Hacking is sending the other 98 API attempts in request to see if it's supported. That's really, to me, all hacking is, it's yeah, this is the documented functionality of this. This is the way it's supposed to work, but let's see if it supports things that aren't documented. Let's see if it supports things that you're not telling me it doesn't support, trust and verify. - Yeah. So, I mean, I wanna get to the car hacking and the API hacking, but let's get sort of your experience and your brain, to help everyone. How do you approach, like you said, you're gonna hack cars and you had someone help you, but how did you like with the APIs? How did you approach that? Did you just read up on, use Google? How do you learn this knowledge? Cause you cover so many things, I mean, in your journey, you've done so many things. How do you suddenly become an expert at hacking cars, and then an expert at hacking APIs. - Yeah. So I am so glad that you asked this question. I wanna talk about this, because a very systemic concern, I think, within cybersecurity is that being a jack of all trades and master of none is a bad thing, that you should niche yourself and become a master. Okay. But here's the thing, David. Over time that quote has been butchered, and that's actually not the full quote, and it's actually \"a jack of all trades is a master of none, \"but oftentimes better than a master of one.\" - [David] That's interesting. Yeah. - And so, over time, a lot of people don't know this, jack of all trades is master of none is only the first half of that quote. And so over time we just kept repeating it, repeating it, and rinsing, and rinsing it, and plagiarizing it. And everyone kept plagiarizing it from the previous person, and it's somewhere along the way, the last half of that quote got cut out. And so for me, I've always lived my life that I wanna learn as much as I can about everything. So if I'm in a situation where I don't know how to do something, I don't wanna have to have the fate of my project or my fate in general, just predicated on this person, dependent on this person, doing this for me. I wanna know, so I don't have to put all of my eggs in their basket. I always wanna be there being able to say, it's the same thing with filmmaking, David, so, as a director, I wanna know exactly what my cinematographer, director of photography knows how to do with the red cameras. I wanna know what my audio, my production sound mixer, I wanna know how that equipment works and how to do that. And my gaffer and my lighting person, I wanna know how to do all that, so just in case I need to step up and do something, I know how to do it. And so I sort of, I guess, applied that same mentality to cyber security, where if I run into an API, I wanna know how to hack that API. If I run into a VPN, I wanna know how to circumvent that. A lot of people don't know this, David, I actually published the first vulnerability on hacking VPNs in 2000. And then in 2001, I spoke about it at Black Hat briefings at Caesars Palace. And it was the first vulnerability on bug track. And what had happened was the VPN company had hard coded the root password into the SSH binary. - Oh, wow. - For the appliance. - But they haven't learned, cause aren't they doing the same with APIs now? - Yeah. Yeah. Developers are hard coding passwords into mobile apps, and API keys and tokens. So please, if your audience, if you take one thing away from this, take this away, just remember there's another half to that quote, of it being better than a master of one. So learn as much as you can in this lifetime. - In other words, you've got this, I would say insatiable, learning thing where you wanna learn more, as much as you can, about any topic that you're interested in. So you wanted to do filmmaking, so you try and learn everything or as much as you can, get an understanding of everything, so-- - Yeah, correct. Yeah, exactly. Sorry. Yeah, exactly. And that's the thing is, you have to have that grit, you have to have that just passion, and that, in Spanish \"fuego\", that fire to want to get up and learn something new every single day. And so in order to accomplish that, I have this daily task sheet, I just published it on LinkedIn. - You like this book? - Yeah. \"Hyper focus\" from Chris Bailey, great book. So and I took the concepts from that book and self journal, and the best self from best self code, and created a spreadsheet, where I basically block out 30 minute blocks in my day, and I make sure that the first thing that I budget my time for today and every day is taking 30 minutes of training, learning something new, taking 30 minutes out to read. Cause I really hate it when I hear someone say, I don't have time to read. - [David] Yeah. - I don't have time to do this. I don't have time to do that. You have to make the time. And if that means getting up earlier or sleeping faster, then do that. As Arnold Schwarzenegger says, then learn to sleep faster. It's so important, that capacity building is so important, because you can't stay still. In the military, there's this quote that if you stay still, you're dead. You gotta keep moving. And I really believe it's the same thing in life. And one thing that all of you need to remember is, our brains are muscles, too. And just like you work out your muscles, you need to work out your brain, and that means reading, and doing capacity building to learn, and continuing to learn. It's so important. - I wanna get back to your time management, because when I saw what you do, and that spreadsheet that you have, and I'll link that below, it's amazing how much you can do in a day. And I mean, the fact that you run all these companies and do all these things is unbelievable, really. You managed to do so, so much, but I wanna come back to you to this thing and I wanna push you on it. Let's say you're suddenly interested hacking APIs, and this is a new thing. What's your methodology of way of attacking that from being like, I know nothing about this topic, to like now you're the expert in this topic, and you said you didn't know how to hack the cars, and now you've got a book on hacking cars, which we'll get into the technical details in a moment, but how do you approach that? Do you just like consume knowledge, YouTube videos, what's sort of your game plan? - So I look at it as like a blank piece of paper. If any of you have heard, have applied the concept of mind mapping in college, or remember mind mapping, it's the idea that you start with the central thought, and then you branch out to these other nodes within the mind map. And the first thing I do is I start out with the center topic, like hacking APIs or hacking cars. And then I start mapping out. What are the things within that sphere of hacking cars that I need to be aware of? So, as a hacker, the first thing you need to be aware of is what are your ingress points? How do you communicate with the car? What does hacking a car mean? What exactly does that mean? I mean, that could mean many things. It could mean throwing a brick through the window, and reaching in and unlocking the doors, to hacking the car through Bluetooth or wireless. So the first thing I do is I start mapping out what are my communication interfaces for that target. With a car it's telematics control unit, it's the router or modem for the car. So that's one ingress point. So the telematics control unit is the router for the car, and it uses GSM to communicate, so I put that on that node. I put that on that that little square, is GSM TCU. Okay, what are the other communication interfaces? Bluetooth. Okay, so I put down Bluetooth. Infotainment system. That's kind of like the computer screen or media entertainment system within the car, so that has a USB port, right? Okay, that's a communication interface. Then I found out, realized that the in-vehicle networking, that everything is connected within the car, so if you've seen that car commercial where the person, the driver's turning the steering wheel left, you can see in that car, I think it was an Audi, you see the car, the headlights were turning left as the car was taking the turn. That's because the headlights are connected and are communicating with other electronic control units within the car. So if I remove the headlight, doesn't that give me access to the in-vehicle network? Because it's connected to the headlights, it's not just electricity. So we found that you could hack a car by taking the headlight out, and there's the communication port that the headlights are connected to. So you map out all of the communication interfaces, what is called, also referred to colloquially, as the attack surface. - [David] Yeah. - So that's your attack surface. Then, those are the things that I need to study and learn. I need to know what a TCU is. Okay, what are the different TCUs out there? How does it communicate? Okay, GSM. I need to learn how to hack GSM. Okay, rogue base stations. What's that? How do you build one? Okay, I need to build a rogue base station. Okay, these cars communicate with APIs, that was my most recent research. So the thing is that, you're figuring out what your attack surfaces and what you can actually target with the device you're targeting. - [David] Yeah. - And then learning more about those things. So with APIs, it's like, okay, let me go research the history of APIs. All right, there's different types of APIs. There's RESTful APIs, like REST APIs. - [David] Yeah. - There's GraphQL. There's these different types of APIs. Okay, how do REST APIs work? Okay, what types of REST APIs do you have? You've got private, you've got public, you've got web APIs, you've got mobile APIs. Okay, mobile apps communicate with APIs. Okay, Android hacking, Android mobile app hacking, I need to research that. iOS hacking, I need to research that. You're kind of building this spider web of all of these things that you can target, that you need to learn how to build or create, or do vulnerability research into. And then that just kind of creates a step by step attack map, or kill chain for hacking that particular thing. So it's a very kind of, I start with the blank page. I like to say, and I'm gonna plagiarize this from Quentin Tarantino. \"I believe that God put me on earth to face the blank page.\" And if you think about that's really, we're all faced with the blank page, whether it's screenwriting or hacking a car, or hacking APIs, or hacking a firewall, or hacking a VPN. We're all faced with that blank page, because we all start out with not knowing anything about it. - I love that you got into hacking when you were 13, is that right? - Correct. - I mean, you didn't follow some kind of course or some kind of curriculum. - I didn't, because if you think about it, David, they didn't really exist back then. When I started in hacking, even if you recall in the '90s, there was no master's degree in cybersecurity. There was no SANS training center. There was no, at the time, even SecurityFocus, for those of you who remember that, there was none of that, and so it really irks me. I have an open door policy, so please don't take this the wrong way. You can reach out to me on social media and say hi, and tell me what the color of the sky is today, I don't care. But when people reach out to me on social media and say, Alissa, can you teach me how to hack? How do you do that, David? Okay, so I'm gonna spend an hour a day on social media teaching you how to hack. I've been doing this for 22 years. The thing is, is that when I started out, it's great we have this collaboration, we have Security 2. DotNet, we have SANS, we have all these places you can go, we've got books. Do you think that there were, Metasploit Unleashed or all these hacking books, the Hackers Blueprint, these didn't exist back then. You had to download exploit source code, which is what I did, looked at the source code, modified it, recompiled it, trying to change it or trying to get it to do something else. I reverse engineered the exploits, and modified them so I could learn how they work. I ran them and then used tcpdump, at the time Ethereal, which is now called WireShark to analyze the packets, to look at the packets, and I ended up becoming a packet monkey, and really getting into packets, and trying to learn how things work through packets, which is how I was able to circumvent VB.NET appliances, and subsequently spoke about it at Black Hat briefings on how to circumvent any VB.NET appliance, was just looking at the packets, and seeing what the packets were doing. You can tell so much about the way an application works, about the way an exploit works, the way malware works, the way a black box works by looking at the packets. - That's interesting. - So to me, yeah, to me it's a storyteller. - So, I mean, so what kind of skills or attributes would you say that have helped you the most and what should someone try and develop? I mean, curiosity, I suppose, you said grit, things like that, is that right? - I think the desire. - [David] Yeah. - Now let me expand on that. I can teach you, David, how to hack a TCU, I can teach you how to use Metasploit, I can teach you how to hack an API, but I can't teach you the passion or the interest in learning how to do it. There have been a lot of people along the last 22 years, who've come and gone in my life, who like, I wanna make six figures, I wanna be a junior security analyst making 90,000 a year, I wanna make 250,000 a year being a senior engineer. There's that interest to make the money, but they don't have the interest in what it takes to learn. And I don't know, we can go down this whole religious debate about being generational, gen Z and millennials versus gen X, whatever. But a lot of people wanna skip directly, they wanna skip in line and cut directly to the $250,000 a year salary. You gotta work your way up. You gotta start looking at packets. You gotta start system administration. The best security engineers I ever met started out as network admins or assist admins, cause they understand the layer three, layer two, layer one, they understand operating systems. There was this one time, where I was sitting in IRC. For those of you who remember IRC. - Yep. Yep. I'm old enough, but not everyone watching is perhaps old enough. - You probably even remember Prodigy, David. Do you remember Prodigy? - Yes, I'm old. I'm an old. - That was like our internet was Prodigy. - I'm an old man. Yeah. But it's like Discord for everyone else. - Before email. Yeah, it was before email. But at the time, you didn't have the resources that you have today. - [David] Yeah. - And you have to have that interest in, and I was sitting on IRC, and this, and I hate this term, I'll use it only once, it's called script kiddie. The script kiddie came online. It was just basic, and basically script kiddie is someone who just pure dot slashes and runs an exploit, doesn't know what it does, and doesn't know what to do after that. Dot slash ran this exploit, got a shell on an Apache server, and didn't know how to restart Apache. - Oh, wow. - And it was like, this individual came on IRC asking how to restart Apache. How can you be hacking networks, how can you be hacking systems without knowing how to restart Apache? My advice, understand the OS, understand packets, understand what a TCP throughway handshake is. You need to go through all of that before you get to the fun stuff of exploits and buffer overflows. - So would you recommend any kind of certs or any kind of path or books? What's your recommendation? - I hate to start the narrative from certifications. I like to start the narratives from the learning path to get that certification. - Yeah. That's great. - Yeah, the certification is great if you can get it and you can memorize what's needed to memorize to go get your CSSP, but reading the CBK, the Common Body of Knowledge, understanding that mile wide and inch thick book on every topic regarding cybersecurity networking and systems is so important. If you can then go and take the exam and get the cert, great, awesome. Do it. But don't make that the reason that you go and do this. Learn, do it for the learning. OSEP, same thing. Do it for the practicals. Do it for the learning. CSSP, do it for the learning. SANS certifications, if you can afford them, it's ridiculously expensive. Sorry if SANS is a sponsor of yours. - No, no, no. I'll say this, they don't sponsor us on this video. So you can say what you want. - Okay, good. Look, SANS courses are great, but there's no reason to be charging the same amount of money for a virtual online course that you charge for someone to fly out and be there in person. How was that ever okay to do? But you know what, I get it, you're a business, and you need to make your money, but SANS, for example, if you can afford that, just don't do it for the certification. Do it for the learning path. - I love that. I mean, it's like desire, passion. I see this in so many spheres of life. Some people might be handicapped by money, but because they've got the desire, the passion, they break through and make a success. - Yeah, they overcome those challenges. Yeah, anyone can throw money all day long, that's got the money, to sign up for this, this, this, and this, but a lot of the people that I know that do that, David, don't take the time to take the class or forget that they paid for the class and never took it. And then there's the people who don't have the money, and they're doing everything they can to afford it. And then obviously they worked so hard for that money to buy that class, that they made sure to show up, and they made sure to do the homework, and they made sure to learn, and got every ounce of education from that curriculum they could, because they worked so hard to get it. Yeah, I think that's the most important thing, is what can you take from it in going through it versus that piece of paper at the end of the day. Cause you still gotta pass the interview. - That's a whole different discussion, isn't it? Because I think anyone who's been in this game for any length of time, knows someone or has heard of someone who had the cert, but didn't know the answers in the interview. - Yeah. I mean, I've interviewed people that had every Cisco certification under the sun, but as soon as I ask them, tell me the header of a packet, tell me all the headers, from the ethernet header down to the payload, they couldn't do it. I'm like, dude, you got a CCNA. You've got all of these certifications from Cisco and you don't know what the headers of a packet are? - I don't think many people would know them all by heart, but it's-- - Yeah, I'm one of those weirdos that I guess that. - No, no, no, no, it's interesting. I mean, I think the difference is, and I think this is the big difference. If you're using scapy or something to create fake traffic into a network, I saw you using scapy in this car hacking book. - Yeah. Yeah. - You're very quickly gonna learn those headers, or if you're going through Wireshark, and you actually looking at that, because it's practical and it's real, you learn a lot. - Agree. Agree. Yeah. And so I think just by virtue of doing it and loading it, a lot of people think, oh, I need to build this amazing virtual machine lab, throw out, rock out some Docker containers, and some vulnerable hosts and then get some exploits, get my hands on exploit, DB exploits, and then record the packets. Dude. You can turn on Wireshark right now, and start sniping your traffic and look at those packets. You don't have to, I need to go get this zero day exploit, and then run it and then capture it. Just turn on Wireshark. Learn, look at what's coming in and out of your computer, understand that you're only gonna see broadcast when a machine is communicating to a local machine on network. And you're only gonna see, they're only gonna be communicating with the MAC address when it's communicating on the local LAN. All these things about basic networking fundamentals, but they wanna jump all the way up to zero day exploits, but they don't know what a packet is? Come on. - I heard you, I wouldn't say it's controversial, but I'd say, what's your take on-- - David, my middle name is controversy. So you can use the C word, it's okay. I'm okay with that. - No, I love it because the thing is, I love it when they're different views, and I mean, you've been doing this for 20 odd years. You've proven, I mean, you have nothing to prove, you've done this, you've done crazy things for lack of a better word, and it's great to get your opinion on these things. So my question was, do you have to learn to become a programmer or do you have to learn programming to hack? - Oh, my God, I'm so glad that you brought this up. Yeah, I'm really glad that you brought that up, and it's such a polarized debate, and I've had, I try not to get into just mud slinging contests on social media. - [David] It's not worth it. - And actually engaging with trolls, because you could just spend all day doing that, let that affect you, but there were some folks who approached me on Twitter and LinkedIn, and talked about the fact that you can't be this lit hacker, unless you knew how to program. And I've run into it in my career as well, obviously. And of course those people were programmers, but no, long story short, I do not believe you need to be a programmer in order to be a hacker. Here's why. Because hacking is so many other things than just writing exploits. - [David] Yeah. - What about the amazing social engineers out there? When you're targeting a network, and there is no vulnerable service for you to go after, and you have to spearphish someone, that's an art form, David. I know some social engineers that can get me, and I've been doing this for a long time. No, I don't think you need to code, so for those of you who hate programming, like me, for those of you who hate scripting, like me, you do not need to be this amazing developer in order to be hacker. If you're interested in programming, and you wanna learn how to program, then more power to you. I had absolutely no interest in staring at lines of code all day. I'm an artist, I'm a visual person. I'm rocking out Photoshop in Adobe After Effects and Cinema 40. I don't wanna stare at lines of text all day, but I have an immense amount, a profound amount of respect for programmers, who are like, I wanna write a program that does this, and be able to just bust out the code and write that program. But you don't need to know how to program to be a hacker. There's some amazing hackers out there, where a lot of the times, if you think about, David, most of the successful penetration tests throughout history have never needed to be conducted or executed with a zero day exploit. There's networks out there that are still vulnerable to EternalBlue. You don't need to be able to write a zero-day exploit or write a buffer overflow, in order to get a foot holder beachhead on a network. So many organizations struggle to keep up with patch and vulnerability management, that there's no sense in saying that you have to be a programmer in order to be a hacker, it's just not necessary. - But you do need to understand, I was gonna talk about cars, but let's talk about APIs, cause we're talking about programming. You do have an understanding of APIs, and like REST and POST, and PUT, and all this stuff. - Yeah, yeah, I mean there is obviously something beyond dot slashing and with things like APIs. I mean I had to learn Postman, I had to understand that you need a dedicated API client in order to be able to do the things you wanna do with an API, and I stumbled on Postman. There are tools you need, there's an understanding of those tools. Just because you can go out to Home Depot to buy a drill or a miter saw, doesn't mean that you know how to use it effectively, like a general contractor can. Just because you can go out there and purchase a copy of Burp Suite instead of using the community edition, doesn't mean you'll automatically or a hacker know how to use it. You have to learn, you have to master the tools of your trade. A tool is only as good as the person using it. I'm a strong believer in that, yes, so yes, I did have to, you have to understand API request, you have to understand JSON, you have to look at JSON, understand what it's doing. You have to understand what you're looking at that the tool, the empirical data is being provided. You understand it. You need to be able to demystify what's happening right now when you're sending that API request, what's the difference between a put and a delete, what are HTTP verbs, and what is their consequence on this API request. - So tell me, with the APIs, you hacked a bunch of banks, you hacked medical records, and I think you said it in the introduction, but just remind me, you were doing like eight minutes an app or something crazy, you were hacking these banking apps. Is that right? - Yeah. So it originally started with a set of fintech and financial services apps. That was my first foray into vulnerability research, where I downloaded, I think it was 20 financial services and fintech mobile apps, the research was sponsored, and I ended up reverse engineering those, and learning what does that mean, to reverse engineer an Android APK file, and what are the tools that you need to do it? And then being able to comb that source code for hard coded API keys and tokens, and then taking that further and realizing, why, what's this whole world of APIs, what are these keys and tokens doing, and so researching that. And then my next vulnerability research was downloading and then hacking, and going after the API endpoints these apps were communicating with, and of course this was in collaboration with the banks. There was no illegal stuff happening here. So a very large bank came along, and several financial services companies came along and said, Alissa, you understand APIs, we want you to come in and hack these and tell us how vulnerable they're. See, here's the thing, David, you can't just throw a rock and hit a penetration tester that knows how to hack APIs. I know the most senior penetration testers in the world, been doing it for 20 plus years, and they stay away from APIs, they run screaming when they see JSON. Just because you're a senior penetration tester doesn't mean that you know how to hack APIs, but I think that's changing, and hashtag more, please. I wanna see more of that, which is why Mel and I created the API secure conference. Here's the thing, when I think of an API hacker, there's only a few names that come to your mind, right, David? There's Dr. Katie Paxton-Fear. She's a huge influencer in the API hacking space. Sharing my spotlight, me, so there's me, there's Dr. Katie Paxton-Fear, there's David Sopas, who created that huge mind map of all the different tools used in API hacking. He's gonna actually be speaking at our conference. So there's only a few names, I can count them only on one hand, we need to change that. I'm sure there's other API hackers out there that I've missed, but the ones that are out there in front of the camera, sharing knowledge, trying to create more YouTube videos around this to teach it. Really, myself, Dr. Katie Paxton-Fear, and we need to change that, and that was the impetus behind us creating this conference, was to be able to train future women, non-binary, disenfranchised, and men, and also male allies, and just everyone who identifies, no matter what your gender is, just trying to train future hackers of APIs and defenders, because this is where the data is, David, and there's a reason that Gartner said that APIs are gonna be the number one point of entry for breaches in 2022, because that's where the data is. If you want oil, what do you do, David? You go to where the oil wells are. - Exactly. - That's where you go. You go to the oil fields and you drill where the oil is, if you're hacking today, it's for profiting off of the data. You and I talked about what it was like 20 years ago, it was about defacing websites and world of hell, and Rafa was here, and getting on that, all this defacement mirror. Now, today, it's about stealing data. It's ransomware, it's profiting twice off of that data with lock and leak, ransoming the company that you've stolen the data from, and still leaking it and then selling it on the dark web. And where is that data these days now? They're not sitting on file servers, they're sitting in APIs, so you need to learn how to hack APIs if you're going to go after the data. So I believe that that's the future battle front, is APIs. If not today. - I'm glad you said that because it's like, for people who are up and coming in the industry, you don't necessarily wanna go after what everyone else is, ready and master at, you wanna try and get into something new. You mentioned crypto currencies and stuff like that. I mean, it looks like APIs, from what I've seen you say in the past, is one of those things that's often an after thought. I think you mentioned that some of the apps were created by the marketing departments, not by technical people. - Yeah. - So let's talk about that, and then also you mentioned this thing about developers versus security, and I can't say it as well as you said, so can you explain that as well, where you said, there should be a security group looking at the APIs? - Yeah, so I'm a big believer, David, in shift left security shield right. So shift left security is the idea that you're weaving cyber security into the software development life cycle, while the code is being written, or while the product is being manufactured, all the way up to shielding. Once it's deployed in production, you're protecting it against future vulnerabilities, and other flaws that you may have missed, because until computers can write their own code, it's gonna be vulnerable. Humans are, we're fallible, where we make mistakes, we will write insecure code, so we need to protect it in production once it's there, for the things that we missed or that our tools missed. So yeah, I mean, there's definitely that shield, that shift left and shield right mentality, and then there was the first part of your question, can you repeat that one? - Yeah, sorry. What I was saying is, it looks like a lot of APIs haven't been developed properly, for lack of a better word. I think you mentioned that some of the banking apps were developed by marketing departments. - Yeah. Yeah. - It was like an after thought. - Yeah. - Sorry, go on. - Yeah, it's crazy, yeah. And then with the research, I think this was the most startling thing for me that I wasn't prepared for. So one of the banks, extremely large bank, I mean, for those of you who think, oh, Alissa, you just targeted small community banks that don't have a budget, and don't have people that know what they're doing. These are financial services and fintech companies that have billions of dollars of assets under management, in some cases trillions of dollars. - [David] Wow. - One of the most startling things for me from this research was that a lot of the banks, as a matter of fact, about 300 of them, had actually outsourced the development of their APIs, and their apps to a single company. - [David] Wow. - And that single company was developing these APIs and apps. So the vulnerabilities that I found in one bank had been actually copied and pasted, and reused into 300 other banks. It was, I would say probably the biggest finding of my two decade career. The other thing is, like you said, in organizations where the marketing department was involved in developing the app, and not necessarily the cybersecurity team. In one instance, the cybersecurity team for the bank didn't even know that the development was going on, that didn't know that the CTO and the chief product officer, and the people that were responsible for building the app had even started a project to do it. And it's that whole working in a vacuum, and I don't think it's intentional. I'm not a pessimist, I like to see the good in people versus immediately saying, well, they did this intentionally to hide it. I feel like people are just so laser focused these days when they are, that they don't think about involving the CISO or the security team, and it's not intentional, it's not to be malicious. I think they're just focused on a deadline and getting there and then forgetting, oh my God, the security team doesn't know about this, oh my God, they haven't tested it. So I think conferences, shows like yours, I think all of these things are helping to change that narrative, and are bringing us into a more secure future. But I think we can only change it with education, and I feel like we'll start to move away from organizations that it's just the marketing department. - I mean, it's quite shocking because in the UK, and I'm pretty sure it must be the same in the US, the big banks or the financial firms are pushing people to use their phones more and more and more, like use the app on your phone, don't use the internet, like a browser on your computer, use the app on the phone, and you think it's gonna be secure, but what you're telling us is it's not. - Well, here's the thing, David. So yeah, a lot of people don't know this about me, but I have a 17 year old son, he's actually turning 18 in April. And so he grew up in a very different time than you and I did. We grew up on a mouse. This generation has never used a mouse. They know what mice are, but they never really used one. They're the iPad generation. They're the touchscreen generation. My niece walked up to our TV, cause the Apple TV was on the screen, and she walked up, and she started trying to push on the screen of our TV, because she thought it was touch screen. But that's what we're dealing with. The number of laptop sales are going down, while the number of cellular phones sales are going up. So I feel like it's gonna get to a point where we just try and do everything on our phone. We're conditioning ourselves, even you and me, we're conditioning ourselves to like, not want to run to our laptop to type up that email. It's like, it's quicker just to quickly go and type up that email on our phones. I feel like that's what we're moving to, and so, yes, you're right, it is insecure. A lot of these mobile apps, and a lot of the developers I'll talk to. So one of the financial services companies, I found a director full of unprotected private keys in there. And pre-computed, no password. I'm like what are you doing? And this developer's response was, how did you even know that directory was there? How did you get to those keys? It's on your phone. I was like, are you kidding me? You didn't know that you can extract an APK file off of an Android device, and upload it to Google Drive, and then download it to my workstation, and then browse the directory structure, and look at the source code on my computer? There's an app for that, it's in Google Play store. Coincidentally enough, ironically enough, there's a tool in the Google Play store for extracting APKs off of an Android device, and this is a developer. And it's like, how did you reverse that back to the source code, when it's on your Android device? - I think it's like any new thing, isn't it? It's like the flavor of the day. - The shiny new toy. - Exactly. Yeah. And then the security is often forgotten, because they wanna rush this out, and it's like, look at our new cool app. It sounds like there's a lot of opportunities, but the big question is always, how do I learn this stuff? Where's your book? We need your book. - Give me the shortcut, give me the book. Give me the trick class. God, I hate to sound like a broken record, but look, the answer is everywhere. You don't have to save a five grand to go take a SANS course, it's probably more than that now. Inflation. It's this book, it's that class, it's that security 2.DotNet free video, it's that YouTube show, it's David Bombal, so it's all these things that, you go to all these places, and that's where your education is. It's your friends, it's your collaboration, it's your influencers. David, there was no such thing as a cybersecurity influencer in the '90s, come on. Influencer? I don't think the Kardashians were even a thing at the time. So that's where we're at now, is cybersecurity influencers and following them, and learning, and watching their videos. That's the other thing is, I feel like a lot of us don't wanna read the white paper because it's too long, or now YouTube videos are too long, and we want YouTube shorts. - [David] Yep. - We're the TikTok generation. Give it to me in two minutes. Like what? You want me to teach 22 years of hacking in a two minute TikTok? We all need to just step back and come back, and read these books, and watch these, spend 30 minutes to watch this video instead of looking for the short, and just taking our time to learn. And be a student every single day, and be exposed to everyone, because it's not just Alissa, that's the other thing, David. Why would you want to just learn how to hack from Alissa Knight? You're gonna learn my style, you're gonna learn my tactics and techniques. There's other brilliant vulnerability researchers, and hackers out there, and breakers out there. Why do you wanna just learn from me? What you're gonna learn are the way I've learned, learn from everyone. Tune into David's show, tune into my show, tune into Dr. Katie Paxton-Fear's show, tune into all these people because they're all amazing. And I was taking this one class just recently actually, and someone was complaining on Facebook about the course. And it was like this was such a waste of time and money to take this class, shame on you for only taking that one class, take a little bit from everyone. Take what you like from everyone, read, it's just like you don't read one author, you read - [David] that's a good point. - multiple authors. So anyway, I'll get my soapboxes. - No, no, no, I like soapboxes. It's always good to get someone's passion about something. - Yeah. - So I think that the problem is when you're starting out, it's difficult to know where to start. - Yeah. - You've mentioned some-- - Okay, so, yeah. - You've mentioned your name, you've mentioned some others. - Okay, so let me, all right, I took the easy route on that question. Let me, okay. All right. My advice is at the very beginning, if you don't know anything about systems or networking or kind of like this mile white thing, go get the book for the common body of knowledge to study, the CISSP study guide, go read that. Read it from front to back, take notes, that's another thing, take notes. Don't type notes, write notes, because it's a different type of kinesthetic learning style. Did you know that? You actually retain more by writing than typing. Do not type your notes when you're learning something new. Go grab the CBK, read that, learn the fundamentals of networking, learn fundamentals of system administration, start out understanding networking and the operating systems. Then once you understand that and get that, then start looking into the fundamentals of security, like the confidentiality, integrity, and availability, the CIA triad, understand those tenets of cyber security, understand the the cyber kill chain, and the methodology, the modus operandi that people follow in hacking. And reading the penetration testing execution standard, not just jumping straight to the tool section to figure out what tools you need to download. Don't skip the reading. But read and learn, because that is the learning path that I would recommend. Start with the CISSP and move outwards. Figure out, do you wanna be a breaker, meaning a hacker, or do you wanna be a defender? Do you wanna be red team or blue team, or do you wanna be purple team? All these colors didn't exist back then either, but I'm trying to get with it. I'm trying to modernize my vernacular. - No, no, no, no, don't worry, I mean, that's great. Sorry, I was actually, my question wasn't very clear. I was asking, with API hacking, I think you said, get a phone, and I think you said the same thing with a car, get a phone, get it to connect to the car, and then capture the traffic, and then use Burp Suite or something. Is there sort of like a methodology, or, I mean, we can watch, look, you've got that on your YouTube channel, stuff like that, that we can look at? - Yeah. Yeah. So there's some videos on my YouTube channel that walk you through how to be an API hacker, what are the tools that you need, what is my process that I follow. There's also some great blog articles that I wrote that are on my LinkedIn post feed on this as well for same period tech lab. So here's the process, first and foremost, you definitely want the mobile device, you want either an Android phone, you don't need to go out, don't go on Twitter and say, Alissa Knight told me to buy a $1,500 Android Samsung. No, you can go to Best Buy, and buy like a $200 or $100 dollar Android phone. Just get an Android platform or install an Android emulator in Linux, that's another thing, but a lot of apps have checks for emulators, so that's not always gonna work, but have an Android device that you're gonna install the Android apps on, that you're gonna extract with APK extractor to be able to download the APK file, and load it into mobile security framework or mobSF, which is a free GitHub project you can download today. And also obviously have an iPhone, if you wanna do iOS hacking. But I like to work off of Android, the same processes and procedure tactics and technics can use on an iPhone. There's just less mess, it's less messy. There's a lot more security controls with iOS, as all of you know. It's a lot easier on Android, which is why a lot of the hacking platforms like Fonepad, and Pon OS and stuff are Android based, but get yourself an Android device. It can be a tablet as well. And then install APK extractor app to extract the APKs off of the device, load them up into Google Cloud, download them to your workstation, install mobSF, it supports Linux, Mac OS, I've got mobSF running on Mac. Once you've done that, you can also do what are called woman in the middle, what I like to call woman in the middle, man in the middle, whatever person in the middle attack, there's a great tool called Mitmproxy, as well as Burp Suite. You can use those, either of those, to do what's called a MITM attack or WITM attack on the app, where you're injecting yourself in the middle of that communication, set the proxy on your phone, and then you can intercept that TLS and SSL encrypted traffic and decrypt it, and look at it, because you're presenting certificates in both directions. Now here's the thing, I'm about to publish a new article on how to get around certificate pinning. So a lot of the apps, I won't say a lot, I'll use a different word, many of the apps implement certificate pinning to prevent MITM, WITM attacks. There's a way to get around that if they haven't used a sophisticated pinning app, use the basic Android stuff for pinning, it can be circumvented with the tool called Frida. And Frida is basically your real time tool that will actually run a certain script, which is freely available to get around pinning, I'm gonna be publishing an article on that. I'm in the process of hacking numerous banks using Frida, because they implemented certificate pinning. And so there's very little content out there on how to do this, but that's my processes. If MITM, WITM attacks fail using traditional means, it means they've implemented pinning, you can try Frida to get around it. So that's my process, is decode, load the APK file onto mobSF, look for hard coded API keys and tokens, hard coded usernames and passwords, that's also a thing, unfortunately, and then use things like Frida, or Mitmproxy or Burp Suite to perform a MITM or WITM attack against the app, to be able to learn how the API works, if it's a private API. And then take those API requests, and then feed them into something like Postman. And then you could use Postman to send API request to the API endpoint and basically mutate those API fields, those requests, to be able to request things like data that doesn't belong to you. There is a website called jwt.io, it's JWT.io, and you can copy and paste your bare token into jwt.io, and it will decode the jwt token for you, and basically this is a form of, it's called OAuth, OAuth authentication. It'll decode it because it's not encrypted, it's encoded, and it will tell you everything in that token. And if there's scopes applied, it'll show you, a lot of the times mobile apps developers will not properly implement scopes, and so you can actually request data that doesn't belong to you when there's no scopes applied, or if it isn't properly hardened. So it's something to think about. - So I, in another interview, I heard you talk about a lot of developers don't implement authentication and authorization correctly. - Yeah, so the two most common findings that I find when hacking APIs, that I would urge all of you to look at, is OSP, PACE security top 10, number one, and number two. Number one is broken object level authorization, and number two is broken authentication. And both of those are the most prevalent findings in the APIs that I find, where developers will authenticate the API request by looking for that token that I just described, and what happens is once they see the token like, oh, Alissa is authenticated, I know it's her, she's presenting this token, it's a valid token, let her do her thing. And it won't authorize the requests to make sure that I'm requesting data that belongs to only me, where I'm sending an API request, for example, to move money from David's account to my account, and I shouldn't be allowed to do that, but because I know his account number, because I changed that account number in the API request to his account number, it's not doing a sanity check to make sure I should even be requesting that account number. So that's broken object level authorization. The other type is broken authentication, where just authentication is broken. And in the case of this one bank, I completely removed cookies, I removed authentication, it was an unauthenticated request, where I can change the pin code and transfer any bank customer without even authenticating, where it was just so broken, that as long as you sent the right API request, the API would execute that query. - So, I mean, from what you're telling me, there's a huge opportunity for someone who wants to get into a specific niche to look at APIs, cause I mean, APIs are on phones, but they're also, I think you worked on nuclear systems and industrial systems, yeah? Sorry, go on. - Yeah, correct. So at one point, I left cybersecurity for a while, went into high risk zone close protection, went to close quarter combat training, sniper training, long story, probably another show. - Yeah. Another one, another time. - And decided to come back, knowing that the conflicts in the Middle East were winding down. I supported counterinsurgency operations in Afghanistan and counter ID operations in Iraq. And really is that the conflicts in the Middle East were winding down and came back to cybersecurity, and started out in critical infrastructure protection, and started doing cybersecurity at nuclear power plant. San Onofre Nuclear Generating Station or SONGS was the plant, and I was responsible for running the CSAT teams, where I was hacking into SCADA systems. You can niche yourself, and please don't get me wrong, I know earlier in the show I said, you can be a jack of all trades as well, but for those of you who wanna niche yourself and say, I just wanna be an API hacker, I wanna master API hacking, that's okay, too. There's no wrong answer here. Yeah, there's always gonna be trolls, but there's no wrong answer here. If you wanna niche yourself, niche yourself. We, as a matter of fact, at the API secure conference, which is running tomorrow and on the seventh, it's gonna be running for two days, 60 plus talks, definitely register. I don't know when this, sorry, I don't know when this show's airing. - This will probably be posted, unfortunately. - It'll probably be after, all right. Okay, for those of you who miss the API secure conference, I was doing a workshop for women, non-binary, to train future women and non-binary in API hacking, because we're so underrepresented in API hacking, API security. Yeah, so please, if you're interested in API security, if you're interested in nicheing yourself, don't be afraid to do so. We need more people in API hacking and API defense, who understand APIs, so please definitely learn it, if it's something you wanna do. - When we started the interview, we spoke about this book, \"Hacking connected cars\". I saw your YouTube video and on your laptop, you're running a Ubuntu, and then you got a whole bunch of interesting devices. So in your book, I think the devices you mentioned, were WiFi Pineapple and some other devices. Why would you use a WiFi Pineapple, as an example, to hack a car? - Yeah, that's a great question. One of the things that I think I'm known for doing is taking tools or just scripts or exports, whatever, and using them for a new purpose, repurposing them. - [David] Yeah. - Where the developer didn't originally intend it for that, but could be used for something else. WiFi Pineapple is a great example of that. So, originally, the WiFi Pineapple was created to target wireless clients through a set of different modules that you could turn on and use within the Pineapple, whether it's a rogue BTS as a rogue wireless access point or anything else. And I realized that it could also be used for hacking cars, because a lot of the car makers today, are now implementing wireless communication in cars, where the infotainment system within the car is communicating wirelessly with the telematics control unit. So, if you think about it, a two cent cable per car can cost a car maker a lot of money. So if they pull that two cent cable out, whether it's USB or ethernet that communicates, that basically connects the infotainment system with the TCU and do it wirelessly, you're saving a lot of money, but you're also creating an attack surface, and you can use a WiFi Pineapple as a rogue base station, where the infotainment system in the car is acting as the wireless access point, and if you use a Pineapple, you can tell the Pineapple to broadcast that BSSID or that name, and then force the TCU to communicate or connect with you instead of the infotainment system. And what happens if you're the wireless access point and the TCU connects to you instead? You can now see all that traffic that's traversing, that communication channel between the TCU and the infotainment system. It's repurposing another device that's intended for something else, for hacking a different device, in this case, a car. - Did you find the same thing, where the security was very bad for lack of a better word, on the cars, like it was with the API situation, so the car developers weren't thinking about these attacks? - Yeah. There were definitely some more egregious findings, like for example, pre-computed private key sitting in open world readable directories in the file system of the device. It not hard coding, or taking additional security precautions and the wireless communication between the two devices. It communicating with any cellular tower, so you could use a rogue base station using a device called bladeRF, from a company called Nuand. You could basically imitate a legitimate cell tower, by creating what's called a rogue BTS. And by broadcasting a stronger signal, closer to the car, getting the car to associate to your rogue base station, your rogue cell tower instead of a legitimate one. And it not having any controls to say, you know what, I'm communicating with this cell tower right now, where encryption is disabled, should I really be communicating with that cell tower? Is that something that's okay? And those basic things, I think, are getting better over time with penetration testing and education with the car makers, where they're realizing that cars are no longer just these combustion engines, that they're smart, they're computer networks on wheels now, and they need to bring cyber security people into their team to make more secure passenger vehicles. And I think as EVs come along, autonomous driving, the car makers are realizing that these are more computers that need to be secured, like a traditional computer or traditional application, than they are just gears on wheels. - It's amazing because I mean, it's like nuclear power plants, all these control systems are coming online with a connection to the internet. Cars have connections to the internet. It's a bit worrying in some ways, because I mean someone with your skills, like you said, you're applying it from one domain to another. Sometimes you wonder if it's a good idea to give devices IP addresses. - Yeah, it's a thing where we live in a real exciting time, David, and that's the thing is, there's all this attack surface around us everywhere, because things that were not historically connected are now being given an IP. I love it, I embrace this innovation, I'm a hacker whose house is like 99% connected. Even my water softener in my garage is connected. And it's because I embrace this innovation in technology. And that's what's amazing about humans, is we're continuing to innovate. It's not a bad thing, we just need to do so securely. A particular state in the United States reached out to me to hack their new fleet of connected trains that they're rolling out. - Oh, wow. - This is a thing, where humans are being replaced by computers, communicating with APIs. And we talked about this earlier in the show, about APIs being really ubiquitous today. And they really are. They're the plumbing of our financial system. In the UK, we talked about London and the UK earlier, you guys have PSD2, the United States it's open banking, and those are all powered by API. So our entire financial infrastructure is APIs. Our transportation system, APIs, they're ubiquitous, they're everywhere, and it's not something that you're gonna be able to avoid anymore. If you are a penetration tester today, mark my words, mark my words. You need to start learning how to hack APIs, because that is what's coming if it's not already here. One of the things is, I like starting my conferences out with a great quote from Anonymous that's, \"If I were to advise a rogue nation state \"on how to take down the United States, \"I would tell them to start with the APIs first.\" And it's because cyberspace is the ultimate equalizer. And I, one individual, one little old girl in Las Vegas can take down an entire country simply because I know how to hack APIs. And that entire country is being powered by APIs, from industrial control systems, all the way to the cars that are driving around on the road. - Alissa, we can go on for hours. I wish I could keep you, talking, and talking, and talking, but it's been going a long time, so I really wanna thank you for sharing. Sorry, go on. - Oh, sorry. I was just gonna say, yeah, I mean, we have that awesome chemistry, I agree. I think we can talk for hours. I would love to be back on your show. - [David] I'd love that, too. - But definitely thank you for having me. - Yeah, I mean, we didn't talk enough about cars. I wanna get into hacking cars more, but we can call this the API video. - [Alissa] Okay. - For the audience, please put your comments below. What would you like to know about it? Alissa's got lots and lots of experience. What would you like me to ask in subsequent videos? Alissa just give us the rundown, I'll put it below, but where can people connect? Is it Twitter, YouTube channel? Where's good places? - Yeah, and for those of you who are gonna be commenting on the video, I will be monitoring the comment thread on this video when it goes live, so I'll make sure to check in on those comments, and answer any questions that many of you have. For those of you who are on YouTube, please, definitely subscribe to my channel, hit that bell icon, I'm trying to boost my number of subscribers in YouTube. I upload and livestream a new video every week. That's where I publish my vulnerability research first, is YouTube, so definitely check that out. We could definitely talk about car hacking more in the next episode, when I'm lucky enough to be invited back on your show. - Oh, for sure. Definitely, soon as possible. - Subscribe. Yeah, for sure. Subscribe to my YouTube channel. I'm one of those rare breeds that is also on Vimeo. I love Vimeo. The quality of the videos are great there, too, so I'm also on Vimeo, but that's where a lot of our short films are published, and then also connect with me on LinkedIn and follow me on Twitter. So I'm also always, of course, as an influencer, as a content creator, I want as many followers everywhere as possible, so definitely connect with me on Twitter and LinkedIn, and I'm happy to talk on these social platforms. - Alissa, thanks so much. You must stay safe. - Yeah. Thank you, David. Take care. (upbeat music)",
    "transcript_keywords": [
        "APIs",
        "API",
        "API hacking",
        "Yeah",
        "hacking",
        "hacking APIs",
        "thing",
        "API request",
        "David",
        "hack APIs",
        "things",
        "car",
        "learn",
        "hacking cars",
        "lot",
        "API hacker",
        "Android",
        "cars",
        "people",
        "REST APIs"
    ],
    "transcript_entity_values": [
        "YouTube",
        "these days",
        "CISO",
        "three",
        "Audi",
        "Linux",
        "TLS",
        "OAuth",
        "JSON",
        "SSH",
        "jwt",
        "London",
        "TCU",
        "13",
        "LAN",
        "two cent",
        "Cisco",
        "this lifetime",
        "LinkedIn",
        "Burp Suite",
        "two",
        "Pon OS",
        "my day",
        "Mitmproxy",
        "two minute",
        "Hollywood",
        "Home Depot",
        "ProCon",
        "Knight Group",
        "tomorrow",
        "second",
        "YouTube",
        "Google",
        "seventh",
        "OSEP",
        "Knight Capital",
        "Spanish",
        "Linux",
        "Iraq",
        "17",
        "hours",
        "hundred",
        "20 odd years",
        "2001",
        "250,000",
        "WITM",
        "1,500",
        "CSSP",
        "David Bombal",
        "an hour",
        "POST",
        "the US Intelligence Community",
        "20",
        "the end of the day",
        "Las Vegas",
        "Katie Paxton-Fear",
        "Facebook",
        "USB",
        "BSSID",
        "GSM",
        "a week",
        "Android",
        "Frida",
        "API",
        "Google Cloud",
        "millions",
        "NahamSec",
        "Pineapple",
        "Wireshark",
        "BTS",
        "the last few years",
        "55",
        "98",
        "zero-day",
        "Knight Ink",
        "This year",
        "CISSP",
        "today",
        "20",
        "EternalBlue",
        "$100 dollar",
        "David Sopas",
        "Katie Paxton-Fear's",
        "jack",
        "billions of dollars",
        "VB.NET",
        "one",
        "two days",
        "Mel",
        "Prodigy",
        "IRC",
        "Knight Studios",
        "SecurityFocus",
        "CTO",
        "the Middle East",
        "200",
        "YouTube",
        "all day",
        "this day",
        "99%",
        "30 minutes",
        "Ford",
        "first",
        "UK",
        "fintech",
        "Hacker Summer Camp",
        "Chris Bailey",
        "Mac",
        "the day",
        "the United States",
        "eight minutes",
        "Kardashians",
        "the '90s",
        "Ben",
        "300",
        "up to zero day",
        "OSP",
        "fuego",
        "Black Hat",
        "17 year old",
        "VPN",
        "Amazon",
        "every week",
        "CCNA",
        "Knight Events",
        "SSL",
        "Vimeo",
        "VIN",
        "the Hackers Blueprint",
        "250,000",
        "this year",
        "iPhone",
        "David",
        "2022",
        "two minutes",
        "Gartner",
        "2000",
        "IP",
        "CSAT",
        "WireShark",
        "Black Hat",
        "MAC",
        "Postman",
        "LinkedIn",
        "the Common Body of Knowledge",
        "SCADA",
        "TikTok",
        "Alissa",
        "60",
        "US",
        "April",
        "number two",
        "Afghanistan",
        "Mitmproxy or Burp Suite",
        "10",
        "18",
        "22 years",
        "six",
        "20 plus years",
        "iPad",
        "San Onofre Nuclear Generating Station",
        "roughly 22 years",
        "Metasploit Unleashed",
        "Docker",
        "half",
        "Caesars Palace",
        "Rafa",
        "CIA",
        "30 minute",
        "third",
        "Fonepad",
        "two decade",
        "Netflix",
        "Anonymous",
        "20 years ago",
        "five",
        "One",
        "Knight Publishing",
        "every single day",
        "CBK",
        "all day long",
        "trillions of dollars",
        "Wiley",
        "Wireshark",
        "Seattle",
        "Apache",
        "zero",
        "90,000",
        "the last half",
        "Alissa Knight",
        "Google Drive",
        "Security 2.",
        "Metasploit",
        "Arnold Schwarzenegger",
        "the last 22 years",
        "Samsung",
        "Apple TV",
        "Nuand",
        "13",
        "Frida",
        "Silicon Valley",
        "LA",
        "Quentin Tarantino",
        "about 300",
        "GitHub",
        "Cisco",
        "MITM",
        "Google Play",
        "VPN",
        "Twitter",
        "Wireshark",
        "Adobe After Effects and Cinema 40",
        "27",
        "Germany"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "LANGUAGE",
        "GPE",
        "GPE",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "MONEY",
        "PERSON",
        "DATE",
        "DATE",
        "PERCENT",
        "TIME",
        "ORG",
        "ORDINAL",
        "GPE",
        "ORG",
        "EVENT",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "GPE",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "LAW",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "LOC",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE"
    ]
}