{
    "id": "4vY0NqKNmB4",
    "title": "Galaxy S8 / S8+ Mini \"Review\" - Should You Buy It?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-04-02T23:41:59Z",
    "video_url": "https://www.youtube.com/watch?v=4vY0NqKNmB4",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Galaxy S8+",
        "Galaxy S8 Review",
        "Galaxy 8 hands on",
        "Galaxy S8 impressions",
        "Galaxy S8 first look",
        "samsung galaxy s8",
        "galaxy s8",
        "galaxy s8 plus",
        "samsung",
        "best smartphone 2017",
        "best smartphone",
        "samsung vs pixel",
        "pixel vs",
        "iphone vs"
    ],
    "views": 535528,
    "likes": 16554,
    "comments_count": 1509,
    "description": "Galaxy S8 Skins from  My thoughts on the best smartphones from Samsung!  Music Credits: Fili - Daydream  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://dbrand.com/samsung-galaxy-skins",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here! So I was able to play with the Samsung Galaxy S8 for a couple of days, and wanted to share some of my thoughts with you. The first thing I want to talk about is the screen. So it's big, it's high-res, it's bright, the aspect ratio is stretched out, so widescreen content fits it better. The extra visual real estate is nice, but using it one handed is... eh. I'll come back to that. The second thing is the design, I mean, visually, it looks amazing. But it's more than that. This is the first phone that I've used where the curved screen felt really comfortable in my hand. When it comes to phones, I don't care too much about millimeters and grams and stuff like that. I just want it to feel comfortable in my hand, and most curved screens just don't feel good in the hand. But this one does, and it comes from this thing, right here: the frame. The transition from the front glass to the frame and then to back glass feels almost seamless. There's just nothing with texture. It's really nice to hold, but it's also really slippery. I would strongly suggest recommend getting a skin for this thing, I'll link the ones I use below, they're from dbrand, and they're awesome. The other things I like are wireless charging, the headphone jack, Bluetooth 5.0- I love extra range you get from that- I like the micro SD slot, the USB-C port, and the performance feels really quick so far, all good stuff. The camera hardware is similar to the Galaxy S7, but let's be honest, the camera on the S7 was awesome. So it's not too big of a deal to me that they didn't upgrade the camera. Here are some comparison photos, I mean, this isn't a review or anything, but in case you're interested: The front facing camera has improved quite a bit, and considering how many selfies get taken every day, I think this was a good call. Now, these devices have large screens that are super bright, and have high resolutions. So there's a lot of pixels to process, and the battery size isn't huge. So I wasn't expecting amazing battery life. The first full day of use, I ended the day with 32% left, relatively heavy use over the course of the day. At night, I charged it back up, watched some YouTube videos, and then I streamed a Twitch channel overnight, with max volume, max screen brightness, highest resolution. Not the 1080p+ default, but the 1440p+. And when I checked it eight hours later, it was at 36%. Screen on time was basically the same, I think that's not bad, I mean, if I streamed that on an iPhone 7, I'd probably get some very similar numbers. Samsung Dex is kinda cool; I don't know how many people would use it. I mean, turning your phone into a tethered desktop experience is not something I would use very much personally. But, it's there, the option's available if you need it. The facial recognition is awesome, it works fast, and it's reliable. I tried it with sunglasses, just to see, and I mean, these are the sunglasses I used. They didn't work very well. It just straight up doesn't recognize it. Now, I don't wear glasses, like, regular glasses. And I just wanted to know, what would it be like for people that do wear glasses? So, I popped out the lenses from my sunglasses, this is going to look ridiculous. And I wore it, on my face, and I tried to get the phone to recognize- these look- these look amazing! I tried to get the phone to recognize my face and it was, like, hit or miss. Sometimes it would work, sometimes it wouldn't. I should wear this for the rest of the video [you should]. *Okay, I can't do it.* The fingerprint scanner isn't in the best location, I have to stretch for it. But really, since the facial recognition is so good, I'm totally fine with it being on the back like this. The Galaxy S8 is packing a lot of cool tech, and that's just how Samsung rolls. They take the top of the line in phone tech and they stuff it into their phones, and they usually end up with something like this. Really high-end tech in a top-tier flagship phone. But hardware specs aren't everything. For me, user experience is by far the most important thing when it comes to any kind of device. And with this, there's a couple things that kinda detract from the user experience. The first is that on-screen home button. I think it could, or should, be a little bigger, and the haptic feedback isn't good. It feels like a regular phone vibration. If you're going to do this, you need a more localized vibration, like how the iPhone 7 button feels. The speakers are also not stereo, and I know a lot of people don't care about this, but it's important to me, I consume most of my media on my phone. And it's so weird watching super high-res video that looks gorgeous on the screen, while having tinny audio that just comes out from one side of the phone. It just feels off. The screen is also difficult to use one-handed. So a wide phone like the Google Pixel XL, this is already wide and a little bit uncomfortable to use. But it's okay, I manage. The S8, because of the tall screen, the vertical stretch is crazy. This is actually the first phone I've had to use one-handed mode. And this was on the S8, it's going to be even worse on the S8 Plus. The last thing is probably my most personal opinion, and I know a lot of people are going to disagree with this. But I don't love where they're going with Bixby. And I know I haven't given it an extended trial, but Bixby is such a heavy investment and commitment into the exact type of stuff that I don't like about some of Samsung's software. Their proprietary Samsung apps that are just stuck on your phone and you can't get rid of. And this time, it comes with a dedicated hardware button. So, if you're interested in this phone, and you enjoyed the S6 and/or the S7 user experience, you're going to love the S8. It's just basically an elevated version of those phones. Truly next-level hardware, you're going to love it. But if you didn't like the S6 and/or the S7 because of the user interface, because of the user experience, it's going to feel very similar. That's the end of this video, hope you guys enjoyed it. Thumbs if you liked it, subs if you loved it! I'll see you guys next time.",
    "transcript_keywords": [
        "phone",
        "screen",
        "thing",
        "Samsung",
        "user experience",
        "feels",
        "good",
        "user",
        "experience",
        "phones",
        "Galaxy",
        "day",
        "camera",
        "back",
        "Samsung Galaxy",
        "stuff",
        "lot",
        "people",
        "love",
        "hardware"
    ],
    "transcript_entity_values": [
        "32%",
        "the Galaxy S7",
        "S7",
        "The Galaxy S8",
        "Bixby",
        "Samsung Dex",
        "one",
        "Samsung",
        "Samsung Galaxy S8",
        "about millimeters and grams",
        "S6",
        "second",
        "the S8 Plus",
        "the day",
        "first",
        "every day",
        "S8",
        "Twitch",
        "36%",
        "The first full day",
        "S7",
        "1080p+",
        "YouTube",
        "a couple of days",
        "eight hours later",
        "max"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON"
    ]
}