{
    "id": "4xccv71o6u8",
    "title": "Unboxing LEGO Dimensions!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-10-04T17:20:19Z",
    "video_url": "https://www.youtube.com/watch?v=4xccv71o6u8",
    "category": "Science & Technology",
    "tags": [
        "lego",
        "lego dimensions",
        "starter",
        "lego dimensions starter",
        "ps4",
        "playstation 4",
        "xbox",
        "xbox one",
        "nintendo",
        "nintendo wii u",
        "wii",
        "wii u",
        "xbox 360",
        "ps3",
        "playstation 3",
        "playstation",
        "gaming",
        "video games",
        "lego games",
        "lego video game",
        "dimensions",
        "unboxtherapy",
        "unboxing",
        "lego dimensions unboxing",
        "dimensions unboxing",
        "gameplay",
        "game",
        "walkthrough",
        "lord rings",
        "dc comics",
        "lego movie",
        "starter pack",
        "unboxing lego dimensions",
        "unboxing lego",
        "lego unboxing",
        "pack",
        "unbox therapy",
        "Video Game (Industry)"
    ],
    "views": 1231916,
    "likes": 23093,
    "comments_count": 1419,
    "description": "Sponsored by WB Games Get the game here:   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/Get-LEGODimensions",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys lew here back with another video and today. This is something that I am actually quite excited for it is Lego dimensions Something a lot of you guys might not know about me Is that I am a huge Lego fan and Lego video game fan Dimensions like it Brings everything together Multi universe Expansion packs you got this portal now for minifigures as well as vehicles which can then be Customized and as you can tell I am legitimately excited for this dimensions starter kit also comes with some legit Lego actual Lego pieces because as you can tell the portal here is something you will build now in the back of the box kind of get A description of Exactly, what's happening here? You can see that you build the portal which you will then put the characters on to each Character of course will then show up in the video game or vehicle for that matter the vehicle is Customizable as I mentioned before you can see here that each one is [three-in-one] and as you change the build in the real world it will then be represented in the video game There are so many different brands Included in this ecosystem from Ghostbusters to lord of the rings these expansion packs will be purchased separately But you don't need to buy them to play the game this starter pack already includes Minifigures as well as some vehicles to get you moving you can venture through any of the worlds in the game With any characters chances are you'll never completely? 100% complete the game But that's a good thing because it means that you're going to get hours and hours out of this thing and as you purchase more Expansion packs you're going to continue [to] have different experiences on the top of the box here you'll see the entire minifigure Inventory available for Lego dimensions these aren't included in the starter pack but as you can see there are different waves of Releases for characters and with each wave you're going to get the availability of more minifigures from these various brands that are available within Lego dimensions I'm a bit of an official when it comes to Lego games big fan hungry for those gold bricks you know Gold Bricks stud collecting if you're unfamiliar with Lego games You don't know what that stuff is when you crack this open you're going to find out real quick, so let's jump inside the box Inside here, you're going to have Batman Wyldstyle, and I believe gandalf very nice game here this is for the PS4, but this games obviously also available for Xbox one or Nintendo Wii u [oh], what do we have here look at this. It's a poster so that you can keep track [of] the various expansions and the ones That you have and the ones that you want old school stuff that even dudes like me can get excited about like Ghostbusters jack you remember [ghostbusters]. What about the green guy? [I] think his name was slimer Something like that Slimy this is our portal this connects to your console super long cable so you [could] keep it like near the couch or wherever it is you're gaming from and Swap out characters while you're playing now in here this is the actual Lego for Completing the construction of the portal as well as your minifigures. Let's jump in here real quick Check it out a couple different packs. You've got step-by-step guides here for how to complete the construction [alright], so I'm going to go ahead and build the Minifigures here we have Batman Wyldstyle, and Gandalf, I believe there's wild style with that angry face. That's gandalf and Batman has two looks wouldn't give him that kind of like Somewhat aggressive look oh, I missed her hood goes on first is she also have two expressions [she] does so she can just go on this base right here, and Now just like that She's capable of being put on the portal Coming to life right [in] the game now gandalf. [uh] the beard of course the beard in the hand I can only aspire To a beard like that one day I'm not there yet working on it. Though. Now Batman time. Cape wait a sec gandalf also wears a cape Jack There's two capes, and this one's black. This is definitely Batman's cape of course he has a cape I mean what he's a wizard [wizards] always have capes right look at these guys Batman Wyldstyle gandalf pretty cool, how about expansion though we have marty McFly As well as the hoverboard the legendary hoverboard and the legendary Delorean I still to this day I Kind of wanted Delorean now There are a few different types of expansion packs this back to the future Pack is something called a level pack means it comes with one character one vehicle and one gadget But there are also team packs and fun packs available each of which comes with its own combination of these characters Vehicles and gadgets where's McFly MCFly's enhance. There's a shirt guitar of course Pants head nice little red Guitar here onto your base you go look at this group right here guys Look at that How cool is [that] for people of all ages even even old dudes like me? So there you have it the Lego dimensions? Starter pack Unbox right here on Unbox therapy big thanks to warner brothers for setting that out. Let me take a look early Hope you guys appreciate this content if you did make sure thumbs up down [below] if you want more information on this game This kit the expansion packs. I'll have the links down in the description should definitely go check it out now. I'm going to go I'm gonna play the game [alright] later guys",
    "transcript_keywords": [
        "Lego dimensions",
        "Lego video game",
        "Lego actual Lego",
        "Lego",
        "Expansion packs",
        "Lego games",
        "Batman Wyldstyle",
        "video game",
        "game",
        "Batman Wyldstyle gandalf",
        "Lego games big",
        "Multi universe Expansion",
        "packs",
        "guys Batman Wyldstyle",
        "video game fan",
        "starter pack",
        "Lego video",
        "Batman",
        "actual Lego",
        "Expansion"
    ],
    "transcript_entity_values": [
        "lew",
        "Expansion",
        "Ghostbusters",
        "sec",
        "Delorean I",
        "this day",
        "Gold Bricks",
        "Batman",
        "warner",
        "gandalf",
        "today",
        "first",
        "PS4",
        "Swap",
        "Batman Wyldstyle",
        "Pack",
        "Jack",
        "two",
        "Delorean",
        "Gandalf",
        "Lego",
        "Dimensions",
        "Batman Wyldstyle gandalf",
        "marty McFly",
        "hours and hours",
        "Nintendo Wii",
        "Xbox",
        "Cape",
        "three",
        "Unbox",
        "McFly MCFly's",
        "one",
        "100%"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT"
    ]
}