{
    "id": "4XRl_k5pJiI",
    "title": "Trick your boss into buying one of these! - MSI Stealth GS77 and Vector GP66",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-06-11T20:07:24Z",
    "video_url": "https://www.youtube.com/watch?v=4XRl_k5pJiI",
    "category": "Science & Technology",
    "tags": [
        "msi",
        "gaming",
        "laptop",
        "unbox",
        "first impressions",
        "office",
        "work from home",
        "wfh",
        "setup",
        "software",
        "speaker",
        "game"
    ],
    "views": 760089,
    "likes": 24868,
    "comments_count": 983,
    "description": "Thanks to MSI for sponsoring this video! Check out the latest MSI gaming laptop deals at   Learn more about the Stealth GS77 at  Learn more about the Vector GP66 at   MSI sent over a couple of their laptops for us to check out and believe it or not, these powerful computers are office-chic enough that you could probably convince your company to buy them for you!  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 So violent! 0:31 GS77 unboxing and overview 2:32 Webcam and specs 3:52 Vector GP66 unboxing and overview 4:59 Specs and \"Hand Lube\" 5:59 GS77 vs Vector GP66 speed test 9:11 Another look at the GS77 10:00 Gaming on the GS77 11:14 Speaker comparison 12:17 Teardowns 15:17 Conclusion",
    "description_links": [
        "https://msi.gm/3MCSvuh",
        "https://msi.gm/3tveqg7",
        "https://msi.gm/3xBD4yd",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Those are our famous- (marker thuds) - [Riley] Stop! - MSI's gaming laptops have always been exceptional at gaming, but do you know what they haven't been good at? Getting expense to your work. They hope to change this by instead of it looking like Lucky on Pride Day, it being, you know, (cardboard rustling) (clock ticking) (plastic rustling) like this. Thanks to MSI for sponsoring this video. We have another one too, but we're looking at the GS77 first. Here are the box. It looks fancy. There's a gloss black dragon. (plastic rustling) He just wants us to know that we have a warranty. Actually, we probably don't 'cause MSI sent this to us, but you know, you would if you bought it. Quick guide. Let me guess. Plug it in. Turn it on. (box thuds) Balls. (Jono laughs) That's fine. Connect to AC power, power on the notebook. Nailed it! Ha ha! Let's have a look at the charger. It's not USB-C. This thing's way too powerful for it to be USB-C. 240 watts. That's not quite as much as I expected but this is also not quite as much laptop as I expected given the spec sheet. Okay. Let's take a look at the IO. Is that a- Oh cool. So that right there looks like a webcam enable/disable, like a hard switch for it. That's nice. Headphone/microphone combo 3.5 millimeter, two USB Type-A's. Around back, we have an HDMI 2.1. Love to see that. And Gigabit ethernet. I kinda wish it was 2.5 but- Oh, it's 2.5? Hell yeah. Never mind. It's 2.5. Love to see it. Thank you, MSI. On the right side, we have a thunderbolt port, a USB Type-C with display port, and a full size SD card reader. I hope that's a fast one, 'cause that is wicked if you want to be doing like photo editing and stuff like that. We'll take it apart later, but you can see that just all of here and there and there and around there. It's all heat sinks. Okay. Let's open her up here. My first comment, MSI's build quality has just increased so much in the last couple of years. I am genuinely impressed. How long ago was that where we looked at like the GE66, I think that's the one and it was just a floppy, like you pressed here and the whole thing would just bow. It's so solid. They have done such a good job at improving the build quality on their laptops. Oh yeah, we need power. This thing may have a 99.9 watt hour battery, but I can guarantee you you need to plug it in if you're gonna do much. Which to be clear, not MSI's fault. Just like physics and how many watts it consumes. Loads of ways to log in here. You've got facial recognition, you've also got fingerprint reader. Wow. If I am honest, this webcam's not nearly as bad as I expected. Is it shifting at all? The reason that I checked that is that Window's Hello facial recognition needs to use an IR camera. If you look very closely here, I don't know if you can even see it. Let's go right about there. It looks like we have an IR camera there, the actual camera for like your webcam right there. The fact that they aren't combined is wicked. Because if you have an IR camera and you use it as a normal camera, you don't have an IR filter and everything just looks weird and there will be like blotchiness and purple shifting and stuff. Although, they did it the right way. So you have an Intel Core i7-12700H. That's 14 cores. I think that's- Is that six performance cores nailed it up to 4.9Ghz on that one? For the memory we have 32 gigabytes of 4,800 mega transfers per second, must be DDR5 then. We also have a 1TB Micron SSD. Also Iris XE graphics, you won't use that because you have an RTX 3070 Ti. The screen on this laptop is the absolute star of the show. It's 1440P, 240 hertz. That is just perfect. It also has a hundred percent coverage of DCI-P3, so it's nice and color accurate as well. You can use it for photo editing and whatnot. While Windows updates there, we have another laptop. (box thudding) All right. I wonder if this one has the same charger. Oh no, that's bigger. 280 watts. Oh. Is this one a chunky boy? Oh, it's still pretty stealthy though. I'm surprised. Yeah. This one will raise a lot more questions. (man laughs) Oh, yeah. Damn. You can really see those heat pipes. This thing is either going to be very quiet or very loud. Maybe both. Don't do it? Don't do what? This? Oh. It mentions very specifically in our notes that the MSI logo is black to make sure that we show it well on camera. So there you go, MSI. You have headphone/microphone combo. It's gold so I imagine it's a very expensive deck. We also have USB Type-C with display port. USB type-A. Around back, we have HDMI, ethernet 2.1, 2.5? Wicked. We have two USB Type-A ports. Is there one over here? Okay, good. Okay. It still is quite good, but it's not quite the same as the Stealth that we have over here. It's also considerably less expensive so there you go. Apparently it has a 360hz display though. That must be 1080p. Oh, this one is an i9 as well. Damn. I think we need some hand lube for this one. Listen. Like, Ugh. (finger scratching) My finger's sticking to it, but I think we can fix it. Just get some hand gunk on there. Ugh. Yeah, official short circuit hand lube. She's lubed up. Tracking nice and smooth. It's a real thing. (everyone laughing) Is our cheaper laptop more powerful? That would be kind of funny. 12900H, processor's faster. And a 3070 Ti. So maybe the same? Maximum is a 3080. Does this one have DDR4? 3,200 mega transfers per second. They might have cheaped out on the motherboard and that would explain the price difference between the two. So even though we have \"technically\" slower processor in the Stealth, the better motherboard and RAM might make up for that difference. Okay. Which one do you guys think is faster? DDR5 versus 12900H? DDR5? Yeah, I think so too. 12900H? Horst is getting in here too. One very important thing before we start here. There we go. Turbo mode. Oh wait, does this one not have a turbo mode? There we go. Performance mode. So what do we think? GP66? GS77? 77, 77. Alright, I'm going with the GP66 just to be different then. Even though I think I'm wrong. We're doing this on extreme. I even increased the anti-aliasing because that just makes \"Forza Horizon 5\" look better. And start. Ah, frick, we have to optimize. Well, if optimization is anything to go off of, the GS77 is in the lead. Probably because faster memory. Which one's gonna get in first? GS77 won the optimization battle. Will it win the gaming battle? Says we're getting 77 FPSs versus 83. What? One thing that we aren't balancing for right now is the fact that the GP66 is way louder. I cannot hear the Stealth. You can probably barely hear me over this thing. It is going a lot faster though. All right. 79 FPS on extreme with custom settings. Higher than extreme. I think this is gonna be a little bit more. 83! Oh, damn! The small, thick boy is faster. Okay. I win. (snaps fingers) (people laughing) Turns out that a 12900H with DDR4 is faster than a 12700H with DDR5. Not a perfect test, 'cause this one's also way louder. Those are our famously - (marker thuds) - [Riley] Stop! Stop! Stop this! Stop! We're doing TechLink. It's TechLink time. Its time to stop. - [Jono] TechLinked, go get (beep). - [Riley] Gimme that marker back! - I'm not giving you the marker back. You threw it at me. Okay. Okay. Reran the tests in just, you know, ultra settings instead of extreme, and same basic result. The GS77 got 91 FPS, the GP66 got 96. The reason though is a little bit interesting. If you look a little bit closely here, the CPU on the GS77 was a little bit faster in every way but the GPU in the GP66 was a little bit faster in every way. That's cool because it tells us that the 12700H with DDR5 is faster than the 12900H with DDR4. It also tells us that if your GPU has 150 watts of power like this one, it's faster than one with 105 watts. Who would've thought? This is also why buying a laptop is really (beep) hard. Because you're gonna have situations where a CPU that should be faster is slower because of the RAM and even though this one's a 17-inch and this one's a 15-inch, this one has more graphics power. It's a mess. But now we know between these two. Yeah. That's why you watch our videos. That's why we're creating labs. Either way though, when you compare this to other 3070 Ti laptops that I have used before, the results are right in line with the fastest other laptops on the market. Makes sense. We're gonna put the GP66 away for a bit. I'm sure the 360 hertz display is wicked and amazing, but I'm good. Yeah. This is the laptop that I would want. Purely because of the trackpad, it's bigger and just feels way better. This is an absolutely acceptable keyboard. The key stabilization is fine, and the key travel and feel is also perfectly acceptable. I would give this maybe like an A-, something like that. Surprisingly, these are not the same keyboard. They actually appear to have different switches. Now the ones on the GP66 I think it has a little bit more travel, which makes sense, they have a lot more room. But that said, the key stabilization isn't quite as good. I'd say it's about a draw between the two, A-. A-. So empirically, this laptop is very good for gaming, and subjectively, it is also very good at gaming. Like I said before, 1440P, 240 hertz, is completely incredible. And as long as you're not looking away from the road, you can avoid like hitting someone that comes up to you. Hey Linus, new video idea, I get a C8 Corvette. That's it. (people laughing) Oh, I don't know if I mentioned this before but the screen also is 400 nits and you can really tell that in \"Horizon 5\" when there's like the sun bouncing off of the road and stuff, it just looks fantastic. I would say that this meets the bare minimum spec on a laptop at least, of having like an HDR experience. Because like 400 nits on a TV is trash. It's not good at all. But when you're sitting like this far away from a laptop, 400 nits, when it's well done like this one is, is enough to get an actual HDR experience. It's not incredible, like it's not 1000 nits, but when you're this close, 1000 nits actually burns your eyes. Like if you have a white screen, it hurts. I guess MSI is the first one that had the- Yeah. They have a mini LED display. It's not in this, but if you really want an HDR experience on a laptop, MSI has you covered there. Unsurprisingly, this laptop's great at gaming. Who would've thought? Is it good at Crab Rave though? That's all I need to hear. These ones are worse. (white noise) Okay. Mute. Play. Three. (Noisestorm -\"Crab Rave\" plays) Okay. Speakers in the Vector, not so good. Changing to the GS77. Night and day. (\"Crab Rave\" continues) Yeah, I don't need to hear anymore. The Stealth GS77 just absolutely blows the Vector out of the water when it comes to speaker quality. In here, we have six 2 watt speakers. So you can see the two that are up firing right there, that helps a lot with treble. That adds just so much clarity when you don't have it bouncing off of things. As for the Vector, it has two 2 watt speakers and they're not firing at you. Which means that the clarity is just completely ruined. Can we take them apart now? I wanna take 'em apart. Cool. They're doing the thing that Alienware's been doing for a little while now, where they tell you exactly what screw it is on the screw holes. I don't know if you can read it right there but it says, \"M2.5 by 3.5 millimeters.\" Awesome. Oh, there we go. I'm in. Oh, it did take a little bit of screwing around with the guitar pick. Getting into this thing was pretty easy. Just be sure that you use something like the iFixit tray to put all of your screws back in the right spot. Some of them are real long. Some of them are not. If you put it in the wrong hole you'll have a real bad time. Trust me. What happens is your screw goes through the chassis. It's a terrible time. The bottom is a bit aluminum and some plastic as well. Once you're in here, the upgradeability looks fantastic. So we have our one SSD in here. There's another spot for a second SSD if you wanna upgrade your storage. As for the RAM, there we go, 16 gigabytes, 4,800 megahertz. There's also super easy access to the battery. Like I said before, 99.9 watt hours. It's as much as you can put in this laptop and still take it on a plane. I have no clue how long the battery's going to last. It's going to be dependent on so many things like if you turn down the refresh rate and don't use the GPU and stuff, you might be able to get a not embarrassing amount of time out of it. If you try and game, it'll be nothing. You'll be down in half an hour. The heat pipe array in here is quite impressive. We have what? 1, 2, 3, 4, 5, 6. including VRM coolers. Love to see that on the CPU. They're so power hungry these days. We also have nice big heat sinks. Like you can see the way if they go out here. Those ones aren't too thick. The ones on the sides are a little bit thicker. Let's compare it to its sister laptop. I'm excited to see the cooling system in this one. 150 watts is a lot for a GPU, at least on a laptop. (laptop clicking) Okay, there we go. That did it. Damn, that's pretty. I know that in a lot of laptops, like, you know, the Stealth right here, they'll make the heat pipes black. I absolutely love it when they just leave it as bare copper. It looks so pretty. And like, damn. That right there is how you get 150 watts outta your GPU. I'm not even gonna touch it. I don't wanna make it look bad. We also have, again, super easy access to your SSD. There's one, there's a spot for another one and there's our RAM. Boop a doo! Also, the heat sinks on this guy are massive. Look at those things. They're- I don't know if you can really tell there, it's quite a bit more cooling. One final difference, and this one's very important. In the Vector, you only get a 65 watt hour battery. Again, I don't know how long that's going to last you, I haven't tested it personally. But it's gonna be a lot less than the 99 watt hour in the Stealth. That is for sure. Which one would you guys want? Do you want the super powerful one that also is cheaper? Or do you want the one with the nice trackpad and the really pretty display? Let me know down below. And huge thanks to MSI for sponsoring this video. Hit like, gets subscribed, and see you later. Bye!",
    "transcript_keywords": [
        "MSI",
        "laptop",
        "bit",
        "good",
        "faster",
        "yeah",
        "thing",
        "Stealth",
        "watts",
        "MSI gaming laptops",
        "USB",
        "laptops",
        "watt",
        "GPU",
        "lot",
        "Stop",
        "camera",
        "display",
        "gaming",
        "heat"
    ],
    "transcript_entity_values": [
        "77",
        "280 watts",
        "360hz",
        "3.5 millimeters",
        "Three",
        "3",
        "79",
        "USB",
        "Night",
        "Maximum",
        "150",
        "Horst",
        "AC",
        "1440P",
        "12900H",
        "32 gigabytes",
        "2.5",
        "150 watts",
        "3.5 millimeter",
        "1000",
        "Linus",
        "99.9 watt hours",
        "IR",
        "16 gigabytes",
        "GP66",
        "FPS",
        "6",
        "5",
        "3,200",
        "105 watts",
        "2 watt",
        "Iris XE",
        "360",
        "240 hertz",
        "first",
        "Alienware",
        "12900H",
        "two",
        "4,800 megahertz",
        "the last couple of years",
        "GS77",
        "GPU",
        "USB Type-C",
        "a hundred percent",
        "SD",
        "CPU",
        "2.1",
        "SSD",
        "Crab Rave",
        "six 2 watt",
        "RAM",
        "one",
        "15-inch",
        "Crab Rave",
        "iFixit",
        "Intel Core",
        "USB-C. 240",
        "4",
        "second",
        "half an hour",
        "Noisestorm -\"Crab Rave",
        "3080",
        "4,800",
        "96",
        "DCI-P3",
        "Horizon 5",
        "these days",
        "Boop",
        "17-inch",
        "77",
        "six",
        "83",
        "2",
        "One",
        "99.9 watt hour",
        "14",
        "12700H",
        "TechLink",
        "Forza Horizon 5",
        "91",
        "4.9Ghz",
        "3070",
        "IO",
        "Jono",
        "DDR5",
        "USB Type-A's",
        "1",
        "MSI",
        "400",
        "65 watt hour",
        "Vector"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG"
    ]
}