{
    "id": "5-eFLcCDNo8",
    "title": "Intel predicted the future - Journey Inside: The Computer",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-18T17:26:56Z",
    "video_url": "https://www.youtube.com/watch?v=5-eFLcCDNo8",
    "category": "Science & Technology",
    "tags": [
        "cpu",
        "intel",
        "education",
        "school",
        "teacher",
        "material",
        "projector",
        "pentium",
        "486",
        "1996",
        "curriculum",
        "vhs",
        "learning",
        "computer science",
        "electronics engineering",
        "electronics",
        "science",
        "engineering",
        "stem",
        "middle school",
        "chip",
        "kit",
        "silicon",
        "wafer",
        "led",
        "wires",
        "prediction"
    ],
    "views": 1106214,
    "likes": 54045,
    "comments_count": 5211,
    "description": "Thanks to MANSCAPED for sponsoring the video! Get 20% OFF + Free Shipping at   Create your build at   Schools have changed a lot since 1996. But Intel has stayed inside the curriculum. Can they be trusted to teach kids about electronics engineering and computers, or are they feeding them product placement?  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:01 What's in the box??? 2:34 Teacher's guide 4:19 Chip Kit - The CPU 6:02 Chip Kit - The rest of it 7:09 A Wild Linus Appears! 9:51 Future Middle School blows Linus' mind 12:19 The world was different then 13:51 It's movie day! 16:11 Third edition was better 16:35 Conclusion",
    "description_links": [
        "https://manscaped.com/TECH",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1444043-is-intel-advertising-to-kids/",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This box contains evidence that Intel infiltrated the education system in a nefarious scheme to teach kids about electronics engineering and, ugh, computer science, all while pushing their own products and branding onto children. What dark horrors could lurk within? (groan) Huh? Oh. Well. That's just adorable. Maybe this isn't so bad after all. Let's journey back to the long lost year of 1996 and see what Intel thought we needed to know. Like I think you need to know about our sponsor. - Build Redux. They make it easy to configure your new build with support guides to help along the way. They also offer competitive pricing as compared to building a PC yourself. So head to buildredux.com/linus and start your new build today. (funky, energetic music) - First things first, definitely A+ for the box design. Like if you turn it around here, you can even see that they modeled the back of a computer. It's adorable, right? Inside we have one classroom sized poster. I can't fit this in the frame. I'm not even sure if this is in frame. - Nope! Pretty big! - Yeah, it is pretty big. Oh, that's funny. Is that? That looks like a Mac screenshot. Pretty sure that's an Apple font right there. That's hilarious because this is Intel. Back during these days, Intel didn't have anything to do with Macs. In fact, Intel wouldn't have anything to do with Macs for another like, 10 years. We have sealed VHS tapes. The Journey Inside The Computer second edition. Okay. So from what I understand, there have been three editions of this kit. The first edition, which I think came out in 1994, this one, which was 1996. And then there was one from 1998. So in this one, we follow Tim, an inquisitive 12 year old on a quest to learn more about how computers and microprocessors work. Learn the major components of the computer, enter a microprocessor, see how a transistor works, and visit the ultra clean fab where chips are made. I think we've already done that, but you know, this would've been pretty cool too, I think. In case it wasn't obvious by now, this is actually like a teacher's resource. A school would've bought this for a teacher to set up in their classroom and, well, I mean, movie day. But also, I have this great big teacher's guide, and this is thick, like real thick. There's a lot of stuff in here. And most of it's like lesson plans, but we do have this here note. Dear educator, welcome to the journey inside the computer. This national education program from Intel Corporation is designed to increase technology literacy among middle school students, and inspire them to learn more about the science behind computers. We hope both you and your students enjoy the kit, and we look forward to receiving your input once you have used it in your classroom. Barbara A. Carmen. I'm not sure, maybe, maybe she still works there. And this would be a quick start guide on how to lay out your course as a teacher. Very cool. I guess. I mean, I'm not a teacher, so I'm not laying out a course, although maybe I can get Linus in here and I can teach him a thing or two about computers from the nineties. That's not all there is to the teacher's guide though. Back here at the end, we have laminates. I don't think many people will have seen these in recent years, but basically, these are transparent slides that are shot, like, you put them over a light that reflects off a mirror, and it pretty much just projects this onto a screen. It's like a projector, but not in a way. I'm struggling to describe it because it's not something that I've ever had to describe before, because it was just a thing. But as far as I know, this has fallen out of favor. The Intel Pentium Processor. Don't forget the trademark. That's the anatomy of the Pentium. They got the fetch, they got the decode, they got the execute, three main functions of the processor. If this feels like a bit of a short circuit, it almost is, but there's more to this. Trust me. We have the chip kit. The chip kit is, dare I say, exactly what it sounds like. We open this up, we have an Intel CPU of some description with a little rubber band thing in it. Intel IPP. That's literally all the markings there are in this thing. Some kind of serial number. If I flip this over, nothing. They actually say here that the microprocessor and chips in this kit are non-working items and should not be installed into any computer for any reason. This husk of a machine is actually one of the things that we were collecting for our MS-DOS gaming PC build. So if you wanna see that, let Linus know, because I've been hoping to do that for many years. But what we have here is a Pentium 120 CPU. Now I know for a fact that this CPU works because I had it booted just a couple of hours ago. It turns on, it beeps once, very short, and shows you an output on the display. So I wanna see if this other CPU even beeps, because presumably this is just a, I don't know, like a mechanical sample. Like this doesn't seem to even have any kind of, well, it has no markings on it whatsoever. So I'm very curious to see what happens if I put this in. That's in there. Power supply is on. No, we would've heard a beep by now. Well, it was worth a shot. I mean, what would they do? Just like give a classroom a perfectly good Pentium? Okay. The Chip's a bust, but that's not all that's in the chip kit. We look in here, we also have switches, as we can see here, we have C-cell batteries, long life battery number 152, 1.5 volts. Well, I wonder what the voltage is now. Wait, it's still like 1.459 volts. So 1.46 volts. This is still good? How is this still good? Look at it. Aside from terrible batteries that may or may not actually still hold the charge, we've got a silicon die. Well I've never touched one of these with my bare hands before. I'm not gonna lie, like that looks really cool. Even though this is nineties tech, in fact, perhaps, because this is nineties tech and everything looks so big, like on a modern die, you can't really make out much, but I can see the structures with my naked eye. It's fascinating. We have some LEDs, and these are supposedly 14 volt LEDs. That's what they say. And we also have these incandescent bulbs. These are 12 volt bulbs and I'm not sure what these would be used for that the led LEDs wouldn't be used for. - Hi there. - Oh, it's a wild Linus. - What are we looking at? - This is the chip kit. Those batteries are old. - Whoa. These gonna be leaky boys. - Yeah. - Long life battery? Not long enough. - Fun fact though. It's 1.5 volts, it's measuring at 1.45. - Really? - Yeah. It still has a charge. - From 1996. - Yeah. I doubt it would actually like power much for very long. - Yeah. - But like it still has the voltage. - I will absorb your power into my body. - I wouldn't have done that. - There was a little bit of power. - One thing that older technology actually kind of is interesting for is how much... - You can see it. - Yeah. - The naked eye. You can actually make out the structure of the chip. - Yeah. - Well that's just incredible. Isn't it? - It's amazing. Like this is the kind of thing that you don't see anymore. Like even with a standard die, to the naked eye all you see is like the iridescent (indistinct). - It's a mirror. - It's just the mirror. - Yeah. This chip is the size of a dime. It has over 3.1 million transistors. - And they're laminates. - Oh, shut up! You can throw this on your overhead projector. - Yeah. I had to like actually explain because I realized that people probably don't know what overhead projectors are anymore. - Yeah. - So I had to explain what these were for. - You could write on them, you could use your wet erase markers to mark them up and then wipe them off clean and they would go back in your little, nice little separated binder here. Oh wow. This is a whole giant thing. - Oh yeah. This is a class. - Sorry. I didn't even know what this was. - Yeah. This is a class. So the introductory level will be like lower middle school, then there's intermediate, and then there's advanced. - You know what's really wild? This is far, far more detailed than anyone is learning about microprocessors in school today. I can't believe Intel produced these resources. I can't believe that my school never used them. - Yeah, if my school had this, like if you look at the teacher's guide video, which we're not going to do, we have another VHS to watch, because it is movie day, they actually show activities of how like having kids getting up and like, okay, so you're bits, and you need to like turn on and off in order to send a signal, and we need to read what this ASCII character is. - Yeah. - That you're sending, because there's actual like ASCII tables and stuff in here. For people to look at. - That is so cool! - For people to learn. - We all carry computers in our pockets and all it took was this class from Intel for us to have a basic understanding of how they work. - You wanna know something amazing? They actually predict that in this. - Really? They're issued a portable, personal computer. It is light, rugged, and about the size of a textbook. Wow. Chromebooks are in this tome of future knowledge. - Yeah. - How wild is that? Students are expected to carry their computers with them so they can use them at home and in all of their classes. Future middle school is completely networked. The network is wireless. Holy shit, wifi didn't exist when this came out, did it? - When was 802.11 B? - I was in high school. - Yeah. I don't think wifi was a thing. - Whoa. They could communicate with each other, students around the world. Portable computers are quite powerful. They are multimedia machines, tech sound, graphics, and video. I mean they got steam on Chromebooks now. - Yeah. - All the students are given instruction in the use of their computers. All teachers know how to use computers. Computers are everyday tools. See, you guys are reading this going, \"Well yeah, duh.\" This is not duh. Back when this was written, this was kind of wild. - Yeah. - Who wrote this? - Yeah, like this was futurism. Like this was oh, computers are gonna be common? Like right now we have computer labs. Maybe each classroom has a computer. - Yeah. - Maybe if you're really lucky. - The wealthy families have computers. - I feel like my grandparents talking about one room schools at this point. - I didn't have internet. - Yeah, no, I didn't. Not at this time. My first interaction with the internet was on a school computer and it was dog slow. - This section, future middle school, is wild. How accurate it is. How absolutely on point, nailed it. - Yeah. - If I didn't know that this was a genuine relic of another era, I'd go, \"Oh, this is a quaint marketing exercise where they're pretending to be from a pastime, predicting the exact state of things today.\" This is super cool. Like I wanna do this with my kids. They would know so much more than their peers about computers. - Circuit diagrams. They're not talking about like, oh, well this is the Intel Pentium way of doing things, they're talking about at a very like high level, like where actually low level, what electronics engineering, what computers are. - Okay, well I have to run back to do WAN Show, but this was fun. - Oh, well I guess we'll have to watch the VHS without you. There's more of that stuff in here too like that, \"Oh, well obviously that's what computers are things.\" That, you know, people take for granted now, but no, many people own a VCR but do not know how to record a TV program. They are not getting the full value out of their machine. VCR? What's that? Like, we're in a different era now. And they talk about things like computers and programmability in terms that people like could understand at that time, because this was all new. Like computers had been around, but they weren't ever present. You know? Like most people hadn't used a computer or had only briefly used a computer at this point in time. So saying things like, \"Oh, well word processors are like using typewriters that you can go back and fix mistakes with.\" Ah, it's so interesting to me looking back at this and seeing the difference between how things were presented to me as a kid, because this is mostly contemporary with me, but not quite. I probably would've gotten this if I had it at my school, just because my school was usually a couple years behind. It just blows me away. How is it that we've gotten to a point where, I mean, I had to explain what an overhead projector was. Did I have to explain what an overhead projector was? I'm starting to worry now. Like what is time? What even is time? No. Good thing I got this indoor hoodie on from lttstore.com. Keeps me nice and calm in times like these. And now it's time to close our journey inside the computer, not that we've even remotely gotten through all of this content, because now it's time to watch a movie. Oh, one more thing. Check it out. The inside of the box is the inside of a PC from the era. How cool is that? (laughs) That is some nineties ass CG. I love it. (upbeat, techy music) Here's that Intel branding. How many Intel logos could you spot in that? - Welcome to the journey inside the computer. This series focuses on computers, how they work, and the impact they're having on our lives. Imagine that you had a machine that could take you on a journey to learn about computers. Just step through the machine and you could zoom down. - Imagine you had a computer that you could use to learn about computers. - All he has to do is ask a question, step through the machine, and it sends him to places where he finds the answers. - Hey cool! I'm on a motherboard. (laughs) - We all need to learn more about computers. They're changing our lives and... - How do computers do what they do? Okay, here we go. - How do computers work? (sci-fi portal noise) Great. What am I supposed to do now? - Go down the aisle to the fourth desk on the left. - You can talk! - Of course I can. Special effects don't have to be dumb. - Nobody cares. - Do they? - No. It's just, well, I mean, I'm surprised that's all. - Come on now, get moving. The person you want is in the third cubicle on the left. - Third cubicle on the left. Didn't it say fourth one? - Wait a minute here. You said it was the fourth. - Oh, sorry. It's my fuzzy logic acting up again. - Fuzzy logic? (groans) - Sure, right. (yells) - Oh, that got grim. (laughs) - Hey wait, where are you taking me? Stop. - It's all right, Tim, we're just gonna do a little surgery to see how a computer works. - Oh wait, wait, wait a minute here. I'm not a computer. I've got a brain! - I'm afraid I don't really have a whole lot to add to this. This is just straight up information. I was expecting more of the CG stuff, but I guess that was pretty high budget back then. I wonder what Intel employees they dragged out for this. Well, That's enough of that for now. I'm a little disappointed, but at the same time, I'm also quite amused, so I'm not sure if I would call that a win or a loss. It just is, and sometimes that's okay. Well, this was an interesting way for me to feel old. When I was in school at the time that this was released, our library was pretty much entirely analog. You wrote down what you signed out and it was on an index card and you had to find things manually. In fact, I entered in a bunch of the information that it eventually changed it into a digital system in my school. It's a strange feeling knowing that kids today will never experience that. What Intel has put together here was surprisingly accurate for what it is. Like, they predicted a lot of things about the schools of the future. And it's even kind of fun. You've got your group activities, you've got electronics, and you've even got a cheesy nineties education quality video. If I'd gone through this unit as a kid, I probably would've loved it for how hands on it was, even if I weren't a giant nerd. It is however, also an artifact of a time when Intel was on top. AMD had just released the K5 by that time, and if that name doesn't sound familiar, it's because it didn't really succeed. So in a way, it also comes across as a little patronizing, especially given their legal maneuvers around that time. Still, this kit's just really cool. And if you look at the teacher's guide, the people who put it together were really passionate about teaching and about tech. It kind of makes me wish I were a kid again, and that I could tell you about our sponsor. - Manscaped. Their ultra premium collection is an all in one skin and hair care kit designed to keep the everyday man covered from head to toe. There's the two in one shampoo and conditioner, there's the body wash infused with aloe vera, hydrating body spray, deodorant, and a free gift. Moisturizing lip balm. So simplify your man maintenance with Manscaped. And best of all, all of their products in the Ultra Premium Collection are cruelty free, paraben free, and vegan. So visit manscaped.com/tech or click the link down below for 20% off, and free shipping. That's not a bad deal. - Thanks for watching guys. This was very different from a usual LTT. So maybe you'll check out our video where we reacted to old computer magazines for around the time that these kids would've started getting into PC gaming. That video really didn't get enough love.",
    "transcript_keywords": [
        "Intel",
        "computers",
        "Yeah",
        "computer",
        "school",
        "time",
        "Intel Pentium",
        "things",
        "thing",
        "back",
        "kit",
        "teacher",
        "people",
        "Intel Pentium Processor",
        "chip",
        "Intel infiltrated",
        "chip kit",
        "cool",
        "Inside",
        "Pentium"
    ],
    "transcript_entity_values": [
        "WAN Show",
        "aloe vera",
        "one",
        "second",
        "Apple",
        "Intel",
        "first",
        "120",
        "nineties",
        "some nineties",
        "recent years",
        "One",
        "First",
        "ASCII",
        "1994",
        "over 3.1 million",
        "Chromebooks",
        "many years",
        "a couple years",
        "14 volt",
        "today",
        "sci-fi portal noise",
        "Mac",
        "12 volt",
        "K5",
        "10 years",
        "Pentium",
        "AMD",
        "Intel Corporation",
        "12 year old",
        "Macs",
        "20%",
        "LTT",
        "1.46 volts",
        "Tim",
        "the Ultra Premium Collection",
        "three",
        "a couple of hours ago",
        "CPU",
        "the nineties",
        "1998",
        "152",
        "1.5 volts",
        "1.45",
        "The Journey Inside The Computer",
        "Linus",
        "third",
        "Barbara A. Carmen",
        "CPU",
        "a minute",
        "fourth",
        "two",
        "1.459 volts",
        "1996",
        "VHS",
        "these days"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "LOC",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE"
    ]
}