{
    "id": "53RBwdzW6fs",
    "title": "EXPOSING Dave2D’s “Tech”",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-07-15T16:30:19Z",
    "video_url": "https://www.youtube.com/watch?v=53RBwdzW6fs",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "dave2d",
        "Dave lee",
        "acer",
        "iconia",
        "oneplus",
        "oneplus 2",
        "canon",
        "notejet",
        "hp",
        "omen",
        "omen x",
        "Toshiba",
        "android",
        "android laptop",
        "predator",
        "triton 900",
        "xiaomi",
        "black shark 2",
        "dell",
        "adamo",
        "windows",
        "Asus",
        "rog",
        "water cooled laptop",
        "gx800vh",
        "mi book",
        "mi book air",
        "venue 8",
        "tablet",
        "laptop",
        "trivia",
        "quiz",
        "game",
        "tech",
        "technology",
        "weird tech",
        "mystery tech",
        "Dave 2 dee",
        "smartphone",
        "gaming",
        "gaming laptop",
        "gaming phone"
    ],
    "views": 235594,
    "likes": 10639,
    "comments_count": 366,
    "description": "Dave2D?  More like Dave2F, amiright?!  Subscribe to @Dave2D  Check out @ThatCreativeLife:    Hang with Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://www.thatcreative.life/episodes/austin-evans",
        "https://twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to \"This Is\" where we have a very special guest today, Dave3D himself. Dave, how are you doing today? - Feeling pretty 3D dude. - I'm surprised, I'm used to seeing you sort of in the 2D mode. So Dave, we're gonna show you a list of ten different tech items and you need to give us two answers per tech item. First of all, what the actual item is. Second of all, what year it came out and we do have a plus or minus one year handicap. Dave2D are you ready to enter the \"This Is\" matrix? - I'll be honest, I'm not. Like I feel like the moment year is involved on something like this it becomes incredibly difficult. - Well, the good thing is you have a handicap, right? So if you're plus or minus a year you're totally fine. - Yeah, okay, well we'll see, we'll see. - Plus if you don't know the piece of tech, you can just guess the year like kind of get vaguely right and you can still get points because to win our wager you only need 50% of these right so you can get the year on every single one correct and the name of every single one wrong, you still are a \"This Is\" winner with your Tweet of doom. Do you have a Tweet ready for us? - Not yet, I'm sure I'll prime one for you guys. - All right, let's start with item number one. - [Dave] Is this even a real product? I may have done a video on this. So it's a double screened device. The one that comes to mind is some Asus device but that's not it. If this is the difficulty like if this is the caliber of questions, I'm so screwed. - So before you lock in your answer, I will say usually we have a Phone-a-Ken available where you can call our wonderful friend Ken Bolido, however, that is no longer available since Ken is taking the day off. So instead you can do a Phone-a-Matt and Matt may or may not know the answers to these questions since he found them all. - Okay (laughs). I'm gonna guess that it's a product made by Lenovo. A yoga something. A Yoga Book. - What year do you think this Lenovo Yoga Book came out? - 2000 and 18. - Dave 2D you have impressed millions and millions with your delightful videos and in this particular question for question number one you were incorrect. This is the Acer Iconia 6120, from get this, 2011. So this was a dual screen laptop with that fully virtual keyboard. This one's bizarre. I had never seen this one in my life. - I definitely didn't do a video on this. - Yeah (laughs) so we tricked you. Not all of these products you've done videos on, some of them you have, some of them you haven't. This one's a weirdo oddball, so it's okay, it's okay. You got nine more questions, still completely in the game. - I'm gonna eat some dirt on this one. All right let's do it, number two. - (laughs) All right, number two, let's do it. - Oh dude, I gotta think. Is that...it's either OnePlus or two. It's iconic, its totally OnePlus. Everything about it, the fingerprint sensor, the shape of it, it's OnePlus. It's either a two or a three and I'm so disappointed in myself I don't know this. I feel like there's something about the UI that is that I should be like, if I knew my Android versions better I feel like those icons are a tell. No, I take, I rescind that, I'm gonna go OnePlus 2, I'm gonna go for year two thousand and do I have to just go back in time here, no to speed things up I'm just going to guess here 2000 and 16. - My 3D friend, your deductive reasoning on this one while very thorough, is also 100% correct. It is the OnePlus 2 from 2015 that's inside the handicap so congratulations you get full points on this one. - I feel, I feel good about that. - All the older like that sort of mid-generation of Android phone especially so many of those phones to me look just in my mind, just one blob of a phone, like I just, it's a little difference here a little difference there, but they all look so similar. Dave you're actually in good shape now, so with that you're actually at the 50% threshold so you are 100% in the game. If you can stay at this level, you will be a \"This Is\" winner. Let's move on to item number three. - Look at that keyboard dude, that looks like straight up old AF and like mechanical AF. - Look, I'm just going to be real this one's a little unfair. I'm just floating that out there. This is a little unfair. I'm gonna take... - [Matt] There's no unfair on the This Is game show! - There is unfair, there is unfair all the time. Dave, I'm gonna give you an extra handicap. I'm gonna give you plus or minus two years on this one so if you can get within two years of the date of this laptop I will give you points for that. - Okay, I'm gonna call my friend. I'm gonna call Matt. - [Matt] Hey, how ya doin'? - (laughs) I'm doing, doing all right but I feel like I need your help on this one. - [Matt] You know, being so perceptive, I can tell you that this is the Canon Note Jet. - No it's not. It is in fact the Canon Note Jet. - Okay, what year it if from? (laughs) - [Matt] What do you like about me? - The end, the end, hang up, hang up. - I feel like you have a very nice personality that likes to help people in game shows. - [Matt] Oh, oh Dave2D I like you. Uh it's from 1992. - I feel like he gave me the year. His year of 1992 I believe, but a Canon Note Jet? No way. - Oh, so you think he lied to you? Oh, did you not tell him you love \"This Is\" enough? - I don't know, I feel like he wanted more from me. I'm gonna go with 1992, but for product thing, model I'm gonna go with IBM Notebook 5000. (laughs) - Dave, for question number three you were very perceptive and yes you are correct. It is 1992, but the model of this is in fact the Canon Note Jet BN120C. (laughs) - I just threw that one out the window. - [Matt] I was super nice and I was trying to help! (laughter) - Oh it has a printer built in? - So it's underneath the keyboard, so that's why Canon made it. It's bizarre, it's weird, but don't doubt Matt I guess is the moral of the story here. I, if I, like my brain didn't even go into that realm of possibility that there could be a printer built in. - All right, well Dave after three questions you are at three of six potential points so you're actually still absolutely in the game. So let's move on to question number four. - Ah dude, easy, actually I shouldn't say that. I believe it's the HP OmenX. This type of product with the double screen is super rare right, not a lot of companies have done it so that's why my memory of this just a little more, a little better so HP OmenX. I'm gonna go for 2019. It's probably 2018 but I'm going for the plus minus because it could've been this year that I did it so I'm going for 2019. - It doesn't matter because you're dead on regardless. Yes, this is the HP OmenX from 2019. So Dave you did a video on this not that long ago. I didn't know if this was a year old at this point. - Yeah, you lose track of time on this kind of stuff but it felt recent enough. - Got very good news for you right now you are at five of eight points. You are well above 50% right now. (beep) - Hey guys, hey, hold on. I won this ten second ad spot from a recent \"This Is\" episode so Austin take it away. - Hello everyone and thank you very much for subscribing to Sara's podcast \"That Creative Life\" available at the link in the description where you can find the most recent episode that I was one with Sara, oh joy. (beep) Let's move on to question number five. - [Dave] (laughs) Some of these feel so hard. Okay, I'm thinking another HP or Acer. They're the companies that do like the rounded, bubbly stuff, oh, also Sony. Some of their older stuff was like that too. And that battery, see that hump? That looks like a detachable battery. We'll go with 2000 and nine. - Okay, got it, 2009. - Uh (laughs) Sony Chromebook 5. - My friend, with your voluminous knowledge of tech large and small, powerful and terrible for this question, you were 50% correct. It is the 2010 Toshiba AC100 and it is actually not a Chromebook. This is the very first Android laptop. - Interesting. - This thing was I don't want to say terrible but terrible is I think a good word for it. Yeah, super weird, super bizarre, this was pre-Chromebook which actually started shipping in 2011. So there was obviously some market for something that was not Lennox but wasn't like Windows but I mean this thing looks straight just like a crappy old netbook. - But hey, half there, we're good. - My friend, you're doing very well so far so why don't we move on to item number six. - I feel like I should know this really well. I think I can kinda like stumble my way there. Definitely an Acer product, it's Triton, That's the moniker. 'K we'll get there, for year we're gonna go with 2019. The Acer Triton 900. - Dave2D I'm not going to play with you, full points that's absolutely the Acer Predator Triton 900 from 2019. - Okay, cool. Sweet! - I think it look's cool. It has that very sort of Acer looking aesthetic. - [Dave] No that's definitely an interesting looking machine. I never actually got to use one, like this exact one though. I never got to try this thing. It just looks super cool. - At this pit Dave you're actually in very good shape. You are at eight points. You only need to hit ten points and you have clenched the game. So at this point you've got, you've got four questions to get two points. - I gotta do it. I gotta do it. - All right, all right, well then let's move on to question number seven. - What? I'm thinking a gaming phone. 'Cause the wallpaper. I'm assuming this is marketing material. That wallpaper looks straight up like Asian gaming phone. So, okay, this is the thing that comes to mind. I feel like it's a Black Shark phone. Like they made something like this a couple years ago or last year and I also feel like if there was a white phone like this or like a gray phone like this I would've been all over it. Like I would've been really interested to get it in. Okay, okay, okay, I'm gonna go with Black Shark 3. I'm going with 2019 again. I don't think it's actually 2019 but I want to be in the middle there for the plus minus again. - Dave, I've gotta say you've really had me going for these last few phones but actually you're 100% correct. This is the ROG phone. - What? - Not it's not (laughs) I'm just kidding it's the Black Shark 2. I'm just screwing with you. - Ahh, it's the Black Shark 2? It came in white like this? - Apparently so, apparently so! I don't know, I guess you just of missed out on this color way or something. - What year was it? - It was 2019 so you do get 50% points which means you're very, very close to clenching this one. - I want, I want that clench. - All right, let's move on to question number eight. - Okay, there's no way I'm getting this product name. It almost looks like an old Dell product. There's no clues! The weird thing to me is that they would even try to do something like this with seemingly no, I'm gonna go for 2010, 'K. 2010 is my, yeah, and the Acer Folder. - Dave, you have amazed me with your impeccable tech knowledge. You have done an incredible job of deciphering the clues. But for this one you actually kinda talked yourself out of it. It actually is a Dell. This is the Dell Adamo, but I'm very happy to report it is from 2009 which means you do get the point for the year. - So it did fold like this? I'm not mistaken, it actually folds? - That is the way that the laptop is meant to be used. Obviously, super thin for a 2009 device, but obviously a little bit of a questionable design choice, but look how thin that thing looks. For 2009 that is pretty impressive. - That's pretty cool, that they made something like that 'cause I feel like they wouldn't do that today not in terms of like experimental designs like this. Dave I'm actually very happy to report that you have reached the 50% threshold, so at this point well obviously I have a couple of questions left but at this point you could just take your Tweet and walk away. Or you could continue playing for our double or nothing bonus round. You don't have to make a decision yet. We still have a couple of questions that you could just breeze through because it doesn't matter you've clenched. Let's move on to question number nine. - This was the water cooled one! Oh dude, first for like the longest time I thought that was like some crazy speaker set up. I maybe even have done a review on this so long ago. No disrespect to the company, but this is just stupid. (laughs) Because it is so not scalable. They would run, they would run piping, like water coolant piping through the laptop. I think, I forget, you know what, it's been so long. I think that's how it worked. That's crazy man, that they even attempted something like this. It's made by Asus, it's the it's an ROG, it's got the ROG like language all over it. The ROG GX, I'm just guessing here, the GX 901. The year, let's go with 2017, I think it's 2018 actually, but I'm guessing 2017, for the flex. - Okay for the flex. Dave the flex is 100% correct it is the 2017 Asus ROG GX800VH. And what really made this crazy in addition to the water cooling it that there was water cooling dual GTX1080's in SLI. - Oh, yes. That's why they needed that dude. - Do you want to take a guess? Just for fun at how much this costs? - Oh my God, like 6000 US. - (laughs) You are exactly correct it was $6000. I'm all out here for weird, cool designs but this was like one step too far of like just look at how thick it is. Like look at that USB port and look at how thick the laptop is not even counting the water cooling dock. - That would've been like 30 pounds to bring around. Holy smokes. - All right, well Dave it's time to move on to potentially the final question question number 10. - It's either Xiaomi or Huawei. It's a MacBook clone and this was the best they could do. I feel like if Huawei was doing this though, they would do a better job of the edges, You can tell that bottom panel is not it's not a good, right? It's not a good fit. They just stuck underneath there. I'm going with Xiaomi, I'm gonna go 2018, but the model is, I forget what they call them, the Xiaomi Ni Book 13. I'm going with that, Xiaomi Ni Book 13 2018. - Dave, this is a laptop to be fair which originally came out in 2016, but this is specifically the 2019 model, very few differences but the fingerprint as well as the color, are a couple of them. So you get the point for that. This is the Xiaomi Mi Notebook Air. - Notebook Air, of course! (laughs) - So Dave I'm very happy to report you have won \"This Is\" game in style. So if you'd like you can take your Tweet, you can tell the entire world whatever you'd like from the \"This Is handle,\" call it a day. Or you can go, double or nothing on a final bonus question. The stakes are simple. If you lose, you walk away with nothing. You're obviously still a \"This Is\" winner and nothing cannot take that away from you, but you will leave with no Tweet, no prize. If you are successful however, you will get a 30 second ad spot on \"This Is\" where we will read whatever you would like us to read in a legitimate actual upcoming \"This Is\" episode. However, the catch is you have no handicap. So you need to get the year and the model name basically dead on. - Okay, I'm gonna go for it. Chances are I'm not even going to use your ad spot for anything real. - We can literally talk about the color teal for 30 seconds if that's what you'd like. Whatever you want. - Okay. - Now that you've opted to go for the double or nothing question, let's take a look at our final bonus item - I feel like I've seen this like multiple times. It's so clean dude. This is a real product? This is real? This isn't conceptual? - This is a real product that shipped to real consumers. So I'm gonna give you a very slight handicap on this one. - [Matt] No! - No, no, just a very slight one, this is one of those model numbers that has a bunch of numbers on the end. You don't have to get those. You just have to get the actual model name and the year correct. - What is that thing on the bottom left? That's not a speaker. Like what would that be for? Some, oh, it's a camera! It's on the bottom. My guess in terms of manufacturer whose got the, whose got the bankroll to make something like this? Let's call it the Sony Tablet and for year I'm going with 2016. - My friend, after 10 grueling questions and an 11th bonus question, the \"This Is\" game is officially at it's end. And you are unfortunately wrong! This is the 2014 Dell Venue 8. - Oh my God. I've, I think I've covered this thing. - There's and Intel atom processor unit in here based on when they were really pushing Android on X86. - Austin, I made a video on this. - Did you really? - I made a a video on this. It was like the second or third video I ever did. That is so embarrassing. - It's okay, if it makes you feel better, I was the very first participant in this game and it was almost entirely on things I had done videos on and I got almost all of them wrong. - I think, I actually think this was like the second or third video I ever did. - It's actually, Matt says it's actually your very first video. - Very good. - It's okay Dave, you've been a great sport and don't forget you still won the game, right. This is the double or , but you still technically won the game. You might not have your ad spot, but I'll Tweet what you want any day anyways, so it's fine. - But it was fun playing this. This was actually way more enjoyable than I thought it could be. I thought we'd be sitting here like roasting me of how poorly I know tech but - No see, we try to get a good balance. - Thanks Steve, thanks for having me. - So when you go to YouTube.com/Dave2D, you can find lots of wonderful videos all about technology that I'm too lazy to cover. - That's right. - Thank you very much for coming on. If you enjoy, make sure to subscribe here on \"This Is\" for lots more game shows and other tech shenanigans, until next time, Dave would you like to play us out with a little, a little song perhaps? Would you like to stretch your legs and pretend that you're not sitting this whole time? - I'm not sitting. I'm standing. Or am I standing? Or am I sitting? (laughs) Dude just cut it, just kill it. (theme song plays)",
    "transcript_keywords": [
        "Dave",
        "year",
        "Canon Note Jet",
        "question number",
        "feel",
        "question",
        "number",
        "game",
        "Canon Note",
        "points",
        "Note Jet",
        "questions",
        "good",
        "Acer",
        "thing",
        "Black Shark",
        "special guest today",
        "product",
        "video",
        "Tweet"
    ],
    "transcript_entity_values": [
        "Ken Bolido",
        "Android",
        "30 pounds",
        "three",
        "GTX1080",
        "the day",
        "Xiaomi",
        "mid-generation",
        "the Black Shark 2",
        "pre-Chromebook",
        "the 50%",
        "the Black Shark",
        "Asian",
        "13",
        "6000",
        "the moment year",
        "ROG",
        "UI",
        "year of 1992",
        "Lennox",
        "two years of the date",
        "50%",
        "Acer",
        "year two thousand",
        "That Creative Life",
        "Triton",
        "the Acer Folder",
        "The ROG GX",
        "Huawei",
        "Acer Triton",
        "OnePlus",
        "Asus ROG",
        "11th",
        "2015",
        "Dell Venue 8",
        "Asus",
        "18",
        "third",
        "Second",
        "2010",
        "the Xiaomi Mi Notebook Air",
        "Chromebook",
        "USB",
        "2000",
        "2017",
        "Matt",
        "Austin",
        "2009",
        "2014",
        "this so long ago",
        "MacBook",
        "this year",
        "Sara",
        "the Sony Tablet",
        "Black Shark",
        "2011",
        "first",
        "1992",
        "Chromebook 5",
        "10",
        "last year",
        "AF",
        "Dell",
        "30",
        "a year old",
        "millions and millions",
        "Toshiba AC100",
        "nine",
        "The year",
        "US",
        "Canon",
        "100%",
        "above 50%",
        "2016",
        "IBM",
        "HP",
        "2019",
        "6000",
        "2018",
        "second",
        "five",
        "Lenovo",
        "Xiaomi",
        "Intel",
        "the year",
        "ten",
        "First",
        "30 seconds",
        "OnePlus 2",
        "one",
        "A Yoga Book",
        "four",
        "Steve",
        "5000",
        "SLI",
        "today",
        "Xiaomi Ni",
        "eight",
        "year",
        "six",
        "two years",
        "number one",
        "901",
        "Black Shark 3",
        "two",
        "Dave",
        "Sony",
        "13 2018",
        "Ken",
        "16",
        "seven"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "LOC",
        "ORG",
        "PERCENT",
        "LOC",
        "NORP",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "LOC",
        "DATE",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "PRODUCT",
        "PERCENT",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}