{
    "id": "545sYAB564M",
    "title": "5 Strange Amazon Tech Gadgets",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-12-04T16:51:25Z",
    "video_url": "https://www.youtube.com/watch?v=545sYAB564M",
    "category": "Science & Technology",
    "tags": [
        "Amazon",
        "Strange Amazon",
        "Weird Amazon",
        "Tech",
        "Amazon Tech",
        "Tech Under $50",
        "cool tech",
        "weird things on amazon",
        "best tech under $50",
        "weird gifts",
        "gag gifts",
        "gross products",
        "10 strange products on amazon",
        "top tech under $50",
        "strange walmart",
        "10 things on amazon",
        "amazon",
        "weird stuff online",
        "amazon reviews",
        "funny amazon reviews",
        "amazon fails",
        "top 10",
        "cool tech under 50",
        "tech under 50 dollars",
        "gadgets",
        "best tech",
        "top",
        "list",
        "best tech for gifts",
        "Keyboard Waffle",
        "tld",
        "jonathan morrison"
    ],
    "views": 619941,
    "likes": 16777,
    "comments_count": 925,
    "description": "5 strange, weird and crazy things on Amazon. I'm sorry. These self-lacing shoes will blow your mind -  Check out Ralphy!   My Mickey Christmas Sweater -  Banana USB Drive -  Condom USB Drive -  The Bluetooth Horse lol -  8-Bit Changing Mug -  Illumibowl Toilet Night Light -  Keyboard Waffle Iron -   Add me on Snapchat!  Dream Desk 3 -  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/XOWvicNAUBE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.youtube.com/watch?v=UobnLR_y-UI",
        "http://amzn.to/2gN7fva",
        "http://amzn.to/2g6NNWs",
        "http://amzn.to/2gzrGZG",
        "http://amzn.to/2h25it5",
        "http://amzn.to/2h2dKsi",
        "http://amzn.to/2hcW9wn",
        "http://amzn.to/2h29nx7",
        "https://www.snapchat.com/add/tldtoday",
        "https://youtu.be/KKlO3Bof7uw",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo, guys, Jonathan here alongside Ralphy C., and things are about to get weird. These are five weird tech items from Amazon that you guys sent me. This one might be the weirdest though. It's a bluetooth horse, and I think it's a little bigger than I thought it would be. - It's bigger than that Beats pill, man. - I thought it was gonna be like a little small horse. - And we got the full stallion in here. - Dude man, look at this keg. - What? Damn, got some Donkey Kong bongo action going on here, man. - The full array of ports: SD, USB, 5v in, previous, play, pause, next. You can control your horse. You get a remote. - God! Ooh. You got all the cargo to carry, man. - Bam, music's gonna pop out of this horse. - He's got even like, he's got some foot protective shoes. He's not gonna be messing up your counters, your dressers. Anywhere you put this guy, he's gonna be pretty solid and he's not gonna move anywhere. Let's call him Sylvester. - Sylvester Stallione, whatever? Okay, there you go, put Sylvester. - [Ralphy] Oh, Sylvester. - [Jonathan] Stallione. - Okay, so I guess this is the final build, hey man. - So this device is called Frisbee. - What did I just do? - You paused it. You made me fall, again He does like this constant, oh wait, maybe the phone? (music grows louder) So far, the Frisbee should not be at top of your Christmas list. Turn it off. - Yeah, I was turning it off. - The classic have you try to resetted it. - Yeah, if you need to move around, if you're on the go, you know, if you're on the road trips, your gonna want those wheels. - Maybe the battery's low. Oh. (music blasts unexpectedly) - Ahh! Why would anyone ever buy this? - I would theory, okay. If we face it down and it's gonna act like a sub, which should even it out a little bit, no, no. You're covering the-- - Much better. - You either buy a good bluetooth speaker or buy a good horse. But don't buy this. Oh man, I wasted my money. God! Not sponsored by Frisbee, don't buy a Frisbee. - Don't buy a Fri (hiccuping) don't buy a Frisbee. - Ralphy, what's next? - Next, thinkgeek mug. But it's not any sort of mug. - So when you got a cold beverage inside, the mug is sad. Throw something hot in there, and he smiles right up. Is that a little offensive to cold drinks? It's tea, man. - Yeah, is it tea? - Earl Grey. - Mmm, it is. Is it working? Oh, there it goes. Hey man, this is some Bill Nye action. - [Jonathan] The science guy. - Dude, I think we're gonna get a happy mug after this. That's cool, man. It's actually a nice color, too. - Yeah, I've actually seen a few mugs that do this with the hot liquids, and this actually works really well. - What is this? - That's coffee filter water. (Jonathan snickers) - This coffee filter water?! Ahh! - So next is something that may sound like a good idea, but I know I'm probably gonna regret this. A banana USB drive. The problem is this is like USB 2.0, which is gonna burn my soul alive. We're gonna dongle a banana into a MacBook. - Yeah, I mean, you're getting some lean 2.0 speeds. - [Jonathan] What's your prediction? - [Ralphy] 30 write, 10 read. - [Jonathan] Damn, nailed it. - [Ralphie] Five megabytes per second? I mean, how much was this again? - [Jonathan] Like, seven bucks. - Wait, transfer this video with this 4K. Hey man, I don't even think the numbers are, oh, 11 minutes. - Oh, I paid 15 bucks for this? - You paid 15 bucks? You liar, you said it was seven. - I hoped it was seven. Alexa. A condom USB drive. (both laugh hysterically) - Rich! Rich, no! Rich is on it, dude! (everyone laughs) Oh, we done goofed. We done goofed man, we're just struggling, man. He's panting, he's breathing, man. (Jonathan snickers) (background chatter) Wait, wait, Rich, did it go through? (background chatter) Goddamn, Rich. I was wondering why that wasn't in my history. Yeah, man, make sure they don't deliver any of that. - He shares that account with his girlfriend so... She gonna be pissed. The only reason I could possible see buying this is maybe a as a joke for Christmas, but you can buy much better and faster USB 3 drives for less money. But if you wanna buy a banana or a condom USB drive, the option is yours. So next up is the Illumi-Bowl motion-activated toilet nightlight in eight different favorite colors that you can set or rotate. If it's any any toilet midnight convenience prevents accidents. What could go wrong? - Yeah, man, I mean, if you're scared at night, you're gonna wanna have that, like, set up. - So on a serious note, I guess this is more useful for children or to Rich's example if you don't wanna turn on the light in the middle of the night. Batteries not included. - Aw. Rekt. Little Timmy got this on Christmas Day, and now he can't play with his toilet bowl. No one's gonna pee now. Triple AAA, the most awkward kind that no one has. So after the trip to Walgreen's, we should be in business. Holy crap! - [Ralphy] Little Timmy's gonna sit down and have a poo-poo. Oh dude, you're peeing into the doom. - You're peeing the fire right there. Yeah, man, so if you want your RGB keyboard to match your toilet, here you go, bro. That's actually kind of cool. So it detects if there's light going on beyond just itself and it will turn off automatically. So if you were in the pitch black and you walked by, this guy is illuminating your way to the toilet. Cut that light. - [Ralphy] Damn. - So that was quite the rollercoaster with that. I wasn't sure at first it was gonna actually work. The installation was a little sloppy, didn't want to stick at first, but once I got it on there, it works as advertised, and the cool part with this, it's under 25 bucks. So last step is one of the weirdest things I've ever seen on Amazon. - Oh my. - The keyboard waffle iron. This does exactly what it sounds like it would do. It allows you to make waffle-shaped keyboards. - What? Man, it's got that like 2001-like felt keyboard action, man. Where's the chiclet-style Johnny I have keyboard? - This is mechanical AF. So now it is waffle time. - Rip them like you open, man. - So this calls for a cup of the mix, two-thirds a cup. - One-half teaspoon of some sweet honey. - That is some fresh honey. How nonstick do you think this is? - Uh, not nonstick at all. It's cool. I mean, if that was my keyboard, that would suck. Go, man, go go go, slowly. Woo, that was a long time, man. - So we're starting to see some smoke. I think we should be hopefully about done with this. - Oh man, go Rich, hit it. (whistle) - Oh man! - [Ralphy] Don't touch it man, you're gonna burn yourself. Come on. Oh, there she is! - [Jonathan] Chef Boyardee. - That tastes real good, Evans. (talking in background) - [Male] The Lady and the Tramp. (laughing) - You're gonna eat that ain't you? - I would eat that again. - [Jonathan] This is a nightmare. - I you've got somebody that likes waffles and computers you're going to wanna buy this keyboard waffle. I mean, it does the job. It does it great, it's better than everything we've reviewed all ready. Would you agree, Rich. You like keyboards, right? - I like keyboards and I like waffles. - [Ralphy] There you go. This is the keyboard waffle iron. - So the giant bluetooth horse, that was definitely a no. The mug, that was cool, the banana not so cool. I think out of this batch, though, my favorite would be the keyboard waffle iron. Now, no, none of these products were sponsored. I bought them myself based off stuff you guys sent me. So if you want to see more of this weird tech, definitely drop me some recommendations on Twitter. Hopefully, enjoy the video, if you did and you are feeling like an awesome keyboard waffle make sure to smash that like button. Check out Ralphy's link below this is Jonathan, and I'll catch you guys later.",
    "transcript_keywords": [
        "man",
        "keyboard",
        "buy",
        "keyboard waffle",
        "Frisbee",
        "horse",
        "Yeah",
        "waffle",
        "cool",
        "Sylvester",
        "keyboard waffle iron",
        "weird",
        "mug",
        "hey man",
        "guys",
        "alongside Ralphy",
        "weird tech",
        "USB",
        "keyboards",
        "good"
    ],
    "transcript_entity_values": [
        "2.0",
        "Rich",
        "Bill Nye",
        "Rekt",
        "Ralphy C.",
        "USB 3",
        "Evans",
        "10",
        "five",
        "Five megabytes",
        "Walgreen",
        "Twitter",
        "Timmy",
        "midnight",
        "Donkey Kong",
        "2001",
        "30",
        "Sylvester Stallione",
        "AF",
        "USB",
        "seven",
        "Frisbee",
        "USB 2.0",
        "11 minutes",
        "Jonathan] Stallione",
        "SD",
        "15 bucks",
        "two-thirds",
        "Sylvester",
        "Christmas Day",
        "Rich",
        "Goddamn",
        "Ralphy",
        "first",
        "seven bucks",
        "25 bucks",
        "eight",
        "the middle of the",
        "Amazon",
        "Frisbee",
        "Alexa",
        "Christmas",
        "5v",
        "RGB",
        "MacBook",
        "Earl Grey",
        "Frisbee",
        "Jonathan",
        "Johnny"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "PERSON",
        "GPE",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}