{
    "id": "572T5eZr8JQ",
    "title": "Can You Game on a $400 Laptop?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-07-15T16:05:30Z",
    "video_url": "https://www.youtube.com/watch?v=572T5eZr8JQ",
    "category": "Science & Technology",
    "tags": [
        "laptop",
        "gaming laptop",
        "notebook",
        "best gaming laptop",
        "best gaming laptop 2017",
        "gaming",
        "best laptop",
        "budget gaming laptop",
        "cheap gaming laptop",
        "gaming laptops",
        "best cheap gaming laptop",
        "lenovo z50",
        "lenovo",
        "austin evans"
    ],
    "views": 1170259,
    "likes": 25212,
    "comments_count": 3136,
    "description": "Can a $400 budget gaming laptop even handle HD games? Lenovo Z50 on Amazon:  5 Tech Gadgets under $30:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/lenovoz50",
        "https://www.youtube.com/watch?v=OD-erxztorU",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. I do videos on a lot of very expensive gaming hardware but today I wanna find out, can I game on this $400 laptop? This is the Lenovo Z50, and it's currently less than $370 on Amazon right now. Based on the giant Gears of War 4 picture they have on the product page, I think it's pretty safe to assume that they're aiming this at gamers. Typically with budget laptops, you're getting integrated Intel graphics which are fine for basic use but really can't handle serious gaming. However, here we actually have an AMD FX APU which in theory should work a little bit better. Also that was a very meaty seal. Think I actually cut through the box. Yep, cut through the box. (laughs) So inside, first of all we get the laptop itself and the first thing I notice is that the battery actually doesn't come installed, it has been a long time since I've seen a laptop with a detachable battery like this. This is a 2800mAh battery. For reference, I feel like a lot of smartphones have bigger batteries than that. We also have the power cable and what I'm sure is the power adaptor. So nothing too exciting in the box but of course, this is a budget laptop. What we're really getting here is actual performance. At least, hopefully that's what we're getting. This battery is taking me back, it's been a long time since I've actually used a laptop like this. So at first glance, it looks very plastic-y but once you open it up, you do see that it looks pretty decent inside, mostly thanks to the sort of fake brush metal here. This is a very interesting selection of ports. So not only is there VGA, which is really weird on a laptop in 2017, we also have Ethernet, HDMI, a USB 2.0 as well as 3.0, but the really weird part is when you actually come around to the DVD drive. Yes, this laptop in 2017 comes with a DVD drive standard, which actually is not really a bad thing, just weird. A big downside is that this does lack AC WiFi, instead opting for the older school Wireless N. Now to be fair, you do have an Ethernet port so it's not all bad but there are a lot of very unusual design choices with this laptop. What makes this special are the specs. Inside, it has a quad core AMD FX 7500 APU with Radeon R7 graphics, as well as eight gigabytes of RAM. This should give us a fair bit of power to game. No, it's not going to shame a laptop with dedicated graphics but the Radeon stuff really isn't bad and this costs less than $400, you really can't be picky at this price. However, there are some sacrifices to get that much power at this sort of price. The biggest one is the screen. This guy is rocking a 15.6-inch panel with a resolution of 1366 by 768. It is not very good. As a low-end TN panel, this really does bring me back to the days where budget laptop screens were kind of terrible. One of the biggest places that you can see it are with the viewing angles, so if you look at it straight on, it's not that bad, but if you get off axis, it ghosts really badly. Plus, having such a low resolution on such a big screen just makes everything a little bit weird, there's very little screen real estate. Now I have to delicately balance the laptop so it doesn't completely wash out on camera. Hey guys, this is Austin. This is a $330 laptop and I'm going to be using it for the next week. The speakers are okay but this is not going to be a great video-watching experience. Thankfully, the keyboard isn't bad so it has the sort of classic Lenovo layout and it feels pretty good to type on. Only problem is there's a fair bit of flex on the actual keyboard itself, but it's totally usable. And the same thing goes for the trackpad. It's maybe not the most accurate thing in the world. However, you are probably gonna want a mouse for gaming. Although that's true for every track pad ever, so. Remove three screws on the back and it's actually easy enough to open the laptop up. And one of the nice things about being a little bit more of an old school design is that there's a lot that you can actually upgrade yourself. Not only can you get access to both of the memory slots, but there's also a one-terabyte hard drive pre-installed that looks super easy to swap out. If this was my PC, I'd spend a few extra bucks and throw an SSD in here, it will make a big difference. The real test for this laptop, though, is to play actual games, so to start with, we have CS:GO. So right now, we're playing at 768p which is the max resolution of the screen and we're playing with a mixture of medium and high settings and we're getting decent frame rates. It bottoms out in the mid 30s but in some of these more open areas, we're getting in like the 40s and 50s. Next we have Rocket League. This is another game that isn't incredibly demanding but here on quality settings, which is roughly equivalent to medium, it's pretty smooth, we're getting in the mid 40s to low 50s. Next we have Minecraft. Now yes, this will run on pretty much anything including a Raspberry Pi, but on the Lenovo, we're able to crank the settings up pretty much all the way to the max and we're still getting really solid frame rates, even flying around here as it loads chunks, we're still on the 60 to 70 frame per second range. Next we have Overwatch. This is a little bit harder for the laptop to handle so even on low settings here, it's a little bit choppy so in less action-oriented scenes, it's fine, but once we get a lot of characters and a lot of effects on screen, we do sometimes dip a little bit below 30. It's kind of playable but you've gotta really wanna play Overwatch. The Lenovo Z50 is definitely not a perfect gaming laptop but for less than $400, it's actually not bad. As always, I will have a link to check this guy out in the description and let me know, would you pick up a $370 gaming laptop? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "laptop",
        "bit",
        "lot",
        "bad",
        "pretty",
        "Lenovo",
        "gaming laptop",
        "screen",
        "budget laptop",
        "gaming",
        "Gears of War",
        "battery",
        "thing",
        "weird",
        "power",
        "budget laptop screens",
        "settings",
        "fair bit",
        "DVD drive",
        "AMD FX APU"
    ],
    "transcript_entity_values": [
        "a Raspberry Pi",
        "2017",
        "Ethernet",
        "768p",
        "2800mAh",
        "Ethernet, HDMI",
        "one-terabyte",
        "three",
        "Minecraft",
        "370",
        "the next week",
        "first",
        "RAM",
        "40s",
        "Amazon",
        "Overwatch",
        "330",
        "AC WiFi",
        "Austin",
        "400",
        "768",
        "15.6-inch",
        "30",
        "Rocket League",
        "a few extra bucks",
        "Austin",
        "60 to 70",
        "one",
        "second",
        "Lenovo",
        "Intel",
        "less than $370",
        "VGA",
        "TN",
        "The Lenovo Z50",
        "Gears of War 4",
        "less than $400",
        "the mid 40s",
        "One",
        "50s",
        "today",
        "3.0",
        "Radeon",
        "AMD FX 7500 APU",
        "the mid 30s",
        "1366",
        "the Lenovo Z50"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG"
    ]
}