{
    "id": "5aJ9U5t9oD4",
    "title": "The COMPLETE OPPOSITE of a MacBook - System 76 Oryx Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-23T21:12:57Z",
    "video_url": "https://www.youtube.com/watch?v=5aJ9U5t9oD4",
    "category": "Science & Technology",
    "tags": [
        "system",
        "76",
        "oryx",
        "apple",
        "macbook",
        "air",
        "windows",
        "laptop",
        "review",
        "unboxing",
        "pro",
        "linux",
        "customization"
    ],
    "views": 1927550,
    "likes": 80198,
    "comments_count": 3899,
    "description": "Sign up for Private Internet Access VPN at    Doesn't open-source just make you feel all warm and fuzzy inside? Today Anthony takes a look at System76's Oryx Pro laptop.  Get the System76 Oryx Pro:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://system76.com/laptops/oryx",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(sneezes) - Excuse me, I'm allergic to short circuit. System76 is a bit of an odd company. I mean when you think about it, they've got all of these products that are relatively high end and yet, it's all based on open source software. From the Thelio, to the Serval, to the Oryx Pro which is what we're looking at right now. Honestly, I haven't unboxed this yet I've opened the box to see what's inside but, this is the first time that is actually gonna be taken out. This is a big box for a very small laptop. This is a 15 inch laptop. They got this kind of weird packaging method here. Everything is bound up in this rather heavy duty cardboard and plastic. And you're supposed to do is unfold it and it'll just slide right out, like so. That way you can reuse it and it cuts down on waste which is honestly quite awesome. So let's get the main event out here, that's better. The inside of the box is pretty nice to actually when stopped to look at it. All around it are these nerdy kinda designs like you can see the rocket ship they're blasting off. You've got some kind of crystal here. Yeah, all kinds of really cool stuff here. So, that is definitely something you'd want to keep which brings us to the laptop. As far as the aesthetics go, it's a pretty standard design this is actually a Clevo unit that System76 has customized for their own use. So, yeah it feels really nice. Glass trackpad, all metal exterior, very thin bezels on the screen a little bit of wobble but it's not too bad. But you might be asking yourself what's so special about it then, it's a Clevo laptop that's running Linux. And that is where things get very interesting. This aside from the fact that it just runs Linux, is running a custom firmware. It's running coreboot, that System76 has specifically engineered to allow it to not only use Thunderbolt, but also Nvidia switchable graphics. It's kind of a first in that regard as far as I'm aware, it may actually still be the only one that's capable of doing that. And what that essentially means is you're going to be able to modify the firmware for yourself. You can go on GitHub download the firmware, modify it, build it and flash it. I'd like to try to do that today, that'd be nice. But first, our sponsor. Private Internet Access is a VPN allows access to services and websites as though you're on a different country. Encrypts all of your network traffic and uses a safe protected IP. You can connect up to five devices at once, with clients for Windows, Mac OS, Android, iOS and Linux. Buy a one year plan for 3995 and get two months for free at the link in the description below. I didn't even notice this but the packaging here actually comes with a nice little cleaning cloth. And what is this, is this is a thermal pad, this looks like a thermal pad. I guess they expect you to open it up, which is honestly kinda neat. It's also possible they expect thermal pads to degrade over time. So they want you to be able to keep this for a while. I'm guessing this would be a thermal pad for the chipset. Perhaps the embedded controller which, if I had to guess, probably mates to the bottom shell here. So if you were to open it up to replace your RAM or upgrade your storage then, yeah you've got this nice little thermal pad here, very nice. Nice standard but, decent feeling powered adapter. Okay, so the power plugs into the back and it actually reminds me I've been so excited to just fire this up and play with it, that I haven't even gone over the I/O. So on the back here we've got a Thunderbolt three port, power, HDMI. DisplayPort, Mini DisplayPort actually. Over on the other side we've got a little expandable Ethernet port, isn't that cute. I remember the first time I saw those like 10 years ago. I mean, you used to be able to see them on PCM CIA cards but, whatever anyway we've got two USB 3.0 ports here. And then around the other side we've got headphone jack, microphone jack. USB 3.0 and a micro SD card reader. So this thing is pretty kitted out. Before I power it on, let's have a feel for how the keyboard is. It's got very striking lettering, I'm not sure if that's a Clevo thing or a System76 thing. The keys themselves feel pretty solid there, they have a very stable throw actually. System76 those guys are actually kinda keyboard nerds. In fact, from what I understand I think it's Jeremy, one of the lead programmers over there or lead product designers over there, actually flashed their or created and flashed their own keyboard layout for this computer. So yeah, that all feels pretty good. A little bit of deck flex but I mean this is is made of metal so, you're not really gonna have to worry about that too much. And when you're typing, there's nothing. So, let's go ahead and power it on. I've never used a core boot enabled machine before. Press escape for Boot Options, cool. This trackpad feels amazing by the way, holy crap. It is buttery smooth. One of the things that I love about Pop! OS is that it actually asks you right off the bat, whether or not you want to encrypt your hard drive or SSD as it were. What that lets you do is protect your machine say if it got stolen. That way, they need your passport in order to access all your files. So it's actually quite useful to have especially on a laptop, but we're not we're not gonna do that for now. There's not really a whole lot of settings that you can change in the bios of this thing. I guess that's the whole point of the core boot thing you can just change it all and recompile it. So, one of the other things that Pop! OS does really well is it has all of these integrations for online accounts. So you've got Google, Nextcloud, Facebook, Microsoft. Flicker, Foursquare and your traditional enterprise IMAP and SMTP and stuff. What this lets you do is you can configure your email, your calendar, your cloud storage. All that kinda stuff all at once from here, you don't have to go through every single application and log in each time. So we don't wanna do any of that right now. Yes, you can't really see this because I don't have any screen capture right now but, the Oryx Pro has switchable graphics and it's saying that here that you can just switch it by going up to the menu here and toggling it, that's great. That's something that like I said, I don't think has actually happened before now for a core boot enabled device. This is not running any kind of proprietary firmware whatsoever. It's mind boggling 'cause like this is a company again, that is completely in the open ecosystem. So firmware, software even their custom designed chassis. the Thelio is open source and yet they're selling it. And they seem to be doing pretty well. This is Pop! OS, you guys have maybe seen it before. I've used it in a couple of videos now in our gaming on Linux updates and also in the PC Bill challenge that Linus and I went through. It was a bit of a race and unfortunately Pop! OS, I'm gonna say it was half and half. Pop! OS let me down and I let Pop! OS down 'cause, there were some configuration changes I could have made that would have made things a lot better. Suffice it to say Pop! OS is actually a pretty nice operating system. It's a more or less stock gnome or g-no-me interface here. So we've got our notification area up here. We've got our system tray up here which includes our Wi Fi control, sound control. Display brightness, we got Bluetooth, our power settings. The fan just kicked in for some reason. It's getting warm, yeah a little bit okay. That's to be expected when running primarily on the dedicated graphics card. And we have a quick access to our settings control panel here. I won't go through all the different details of Pop! OS but, yeah let's let's explore a little deeper. For one, looking at it, it all really matches well like the the dark theme for Pop! OS really matches with the theming of the machine. Don't you just love it when you download Steam and then you launch Steam for the first time and it's like updating Steam. What version of the Nvidia driver are we using here, 440.100. So it looks like this screen is not a FreeSync compatible screen otherwise we'd have the G-Sync compatible button here. Which is fine, but it is a 144 hertz panel and it is silky smooth. It doesn't say what technology the display is, that's a little unfortunate. Actually while I'm here, what GPU is this? It's an RTX 2080 Super Max-Q. So that is the top of the line I believe. They have them available in the RTX 2060 and 2070 as well. So that's cool. Looks like 64 gigs of RAM so this thing is kitted out. NVMe boot drive, 512 gig I think Steam is having trouble. Looks like there were some major maintenance run on it yesterday. All right, I'm gonna give steam one more shot. I'll switch to the US server nope, wrecked. All right, gaming is not all this laptop has to offer anyway. Part of the whole appeal here is unleashing your potential. So, if we wanna build something gonna have to install some build tools. We're looking at a KeyMap. So there are two layers on a typical laptop keyboard. Your standard, keyboard and then also the keys that happen when you press the function key. So you can press function and plus and minus for example, to change the backlight brightness of the keyboard. You can press function and let's see F9 to increase the brightness of the monitor or F8 to decrease it. F6 to enable the sound to go up and down. Those are all handled here. This block here, this upper block is our regular keys. You can see we've got Escape, F1, F2, F3, F4, F5. Blah, blah, blah, blah. And it's all laid out in the order you see them in the keyboard. Similarly, we've got the same thing down here. I'm not entirely sure why, but there's not a whole lot assigned to function and the regular keys. So let's just say for giggles let's change function T to something else. Well I mean, let's just change it to L. So we can just do function L and then T, T or function T and then T, T and we've got L, T, T. Now I need to close all running applications. Unplug everything from the computer aside from the power adapter meaning, you'll lose screencap sorry. And run make flash internal. I'm more excited than I should be for my stupid little custom KeyMap 'cause it really is truly stupid. All right, we're back let's open up our text editor and let's see what happens. Function T, that looks like an L. Shift T, that is capital L. T, T, L, L, T, T, L, L, T, T, L, L, T, T. This is way more amusing than it should be but basically I can make any key on the keyboard any other key on the keyboard. You can change the layout of the keyboard at your own whim. And that's just the start of it. You can change the fan profiles, you can change all kinds of stuff in the in the embedded controller here and that's all built into the the Oryx Pro. Like it's (chuckles) pretty amazing. So what you're getting is basically complete control over the computer like the embedded controller handles like power delivery. It handles the fan curves like I said the voltage curves, the frequency curves all of that stuff is handled in the embedded controller and it is completely open for you. The only problem is that there is a price to all of this which is, 1699. And that's for a family 15.6 inch panel, GeForce RTX 2060 and a 250 gigabyte SSD which is SATA on the base model. So you've got some upgrades to do, but the good news is you can do them. What is the price of freedom really, you've got a completely open source operating system you can do whatever you want with. You've got a completely open source firmware, you can do whatever you want with. You can adjust the internal spec of the computer as much as you want. You can expand it with thunderbolt. You can choose to run it with or without the Nvidia graphics card. It's a cliche and I already used it in this video, but it's basically the apple of the Linux world. You're paying a premium, but I mean you are getting a pretty premium machine. I think it feels fantastic, I think the philosophy behind it is fantastic. The company behind it is pretty great. The CEO I met him a little while ago at the Superfan III event. He kind of gives me a Hank Scorpio vibe and like I wanna support worth that again, it's just how much are you willing to pay for it. That's the question you have to ask. These guys are premium, you get a premium product. Is that what you want for Linux? It's what I want, but it's a question you're gonna have to ask yourself. Thanks for watching. Make sure to get subscribed so you can see more short circuits like this one or unlike this one, this is kinda different. And see you later.",
    "transcript_keywords": [
        "Pop",
        "kind",
        "pretty",
        "keyboard",
        "open",
        "Linux",
        "nice",
        "change",
        "thing",
        "function",
        "laptop",
        "Oryx Pro",
        "power",
        "Steam",
        "open source",
        "running",
        "Yeah",
        "thermal pad",
        "firmware",
        "pretty nice"
    ],
    "transcript_entity_values": [
        "Serval",
        "15 inch",
        "Thunderbolt",
        "3995",
        "USB",
        "US",
        "Google",
        "DisplayPort",
        "Nvidia",
        "15.6 inch",
        "one year",
        "F8",
        "Wi Fi",
        "Linus",
        "today",
        "Scorpio",
        "2060",
        "Private Internet Access",
        "Jeremy",
        "2080",
        "PCM",
        "2070",
        "half and half",
        "Linux",
        "first",
        "Mini DisplayPort",
        "two",
        "up to five",
        "144",
        "GPU",
        "two months",
        "GitHub",
        "Ethernet",
        "250",
        "SD",
        "VPN",
        "Glass",
        "SSD",
        "L. T",
        "Clevo",
        "RAM",
        "IMAP",
        "one",
        "CIA",
        "Bill",
        "F5",
        "Nextcloud",
        "System76",
        "L.",
        "2060",
        "Microsoft",
        "10 years ago",
        "Windows, Mac OS",
        "Linux",
        "KeyMap",
        "HDMI",
        "Boot Options",
        "Android",
        "440.100",
        "512",
        "F3,",
        "hertz",
        "L, L",
        "jack",
        "yesterday",
        "GeForce",
        "three",
        "One",
        "Thelio",
        "F9",
        "64",
        "1699",
        "the Oryx Pro",
        "F4",
        "Hank",
        "F2",
        "Facebook",
        "Foursquare",
        "SATA",
        "FreeSync",
        "USB 3.0",
        "SMTP"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "FAC",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}