{
    "id": "5C7UOrGdwQk",
    "title": "This Gadget Claims To Make You A Better Gamer...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-11-12T20:23:50Z",
    "video_url": "https://www.youtube.com/watch?v=5C7UOrGdwQk",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "hipshotdot",
        "hip shot dot",
        "gaming",
        "video games",
        "mlg",
        "call of duty",
        "cod",
        "battlefield",
        "titanfall",
        "cool gadget",
        "cool gadgets",
        "xbox",
        "playstation",
        "xbox one",
        "playstation 4",
        "ps4",
        "pc",
        "pc gaming",
        "ps4 pro",
        "halo",
        "destiny",
        "gears of war",
        "best",
        "2016",
        "video",
        "futuristic",
        "inventions",
        "cool",
        "invention",
        "amazing inventions",
        "innovation",
        "vs",
        "new inventions",
        "cool technology",
        "cool inventions",
        "awesome inventions"
    ],
    "views": 4504406,
    "likes": 59458,
    "comments_count": 7775,
    "description": "HipShotDot (USA Link) -  HipShotDot (International) -   This gadget is called the HipShotDot. It's a physical LED mounted to a suction cup meant to stick to the center of your display while gaming. The idea here is to improve shooting accuracy in various games without the need to zoom.  Here is some more infor from the manufacturer -  The HipShotDot is the gaming industries first powered red dot sight attachment for your television. It is compatible across all gaming consoles. Works with popular 1st and 3rd person titles such as Call of Duty - Advanced Warfare, Battlefield, Gears of War, Titanfall, Destiny, Halo and 100s more.  The HipShotDot replaces or enhances your in game sights. In a game like Call of Duty, the HipShotDot enables you to change out your in game red dot sight with an additional attachment, ultimately giving you the advantage over the competition.  The HipShotDot is compatible with virtually any game system including popular consoles such as Xbox 360, Xbox ONE, PS3, PS4, Wii and WiiU. Works with 100s of 1st and 3rd person shooter games including popular titles such as Call of Duty, Battlefield, Metal of Honor, Titanfall, Halo, Gears of War, The Division, Destiny and many more.  The HipShotDot is powered from a standard USB port. Simply connect the HipShotDot to any available USB port on your game console. You may also power the HipShotDot with a standard USB power supply, i.e. phone charger or available USB port on your television. The power indicator on the HipShotDot's USB connector and red dot sight will illuminate.  During gameplay, simply zoom in and attach the HipShotDot to the television to align with the cross hairs/sights of your weapon. Slide the secondary suction cup down the cord to the edge of the television and attach to hold the wire straight and taught. There is a quick release designed into both suction cups for easy removal. To remove the HipShotDot after gameplay, simply pull the HipShotDot wire below the secondary suction cup in an upward motion.  The HipShotDot is not an aim bot, it will not aim for you. It simply gives you a full time red dot sight attachment in games where you typically do not. Experience increased hip fire, quick-scope and no-scoping accuracy. Leverage the advantage of an additional attachment over the competition.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2es81xO",
        "http://geni.us/D9kUm3",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "din dong so I think I might have a fun one today this showed up it's called the hip shot dot and it was sent to me from the folks over at live with YouTube gaming they want to start sending me a couple of cool gaming related peripheral accessories I have no idea what to expect it's called the hip shot got a red dot sight attachment for first-person shooter games compatible with xbox one ps4 xbox 360 ps3 pc wii u call of duty battlefield titanfall and more it's got a USB powered LED which sits on your display over top of your normal sites easily attach and detach from the television 72-inch USB power cord alright you actually stick that little suction cup right to the TV in a claim you can name more quickly improve your accuracy enhance reaction time to feel like the real deal with the red dot let's crack this open i'm a little skeptical who knows let's find them so this is the device kinda looks like a piece of medical equipment your kind of like keep any way you can power this thing off any USB power doesn't have to be directly from your console and then this little thing I'm going to show you this just suctions right on right like this right to your eyeball know wow that's actually on there right now but the majority of the suction cup is see-through and then the center portion that's what is going to illuminate supposedly increase my accuracy which that's going to be quite the feat but I mean I need all the help I can get I just picked up battlefield we're gonna try it out together let's do it right now see somebody better ok got myself a monitor got the ps4 that I've got battlefield one boot it up i'm at the very beginning of the game and played it yet it's pretty intense so far i'm gonna take this little device and plug it into the ps4 for power you can see this lights up to we'll see if Jack can pick that up can you pick that up so what you're supposed to do to set this up go in game they're firing and zoom in you want this little dot to be right at your crosshairs the second one just exist pretension and then out of the way down here now watch I'm talking about when i zoom in see that how the dot becomes the same even though I'm only in world war one I got the red dot sight all that is a flamethrower holy on fire I'm on fire right now Oh what did last log now the cool thing is i mean lines up with or without l2 oh no not again with the flame door this guy and all right Adam all you gotta shoot his backpack he blows up I can sense a lot of a lot of dying is gonna happen you would his world war one I mean beyond bye-bye who's tank is that it's probably oh I get what you're doing here with the thing you're playing all the different roles of different guys within the military's what's going on so what can i say like I think it actually kind of does the job can you can pick it up there it is called the hip shot dot i think the name is fitting because we're this really stands to improve your accuracy is when you're firing without zooming in without having to cross hairs because then it becomes really obvious to you where they would be but you can fire from the hip shot done I don't know all right listen you're not sticking this thing on your TV and going straight MLG it's not happening alright there's no easy way you gotta put in the time you've got to put into practice with or without the hip shot when you get an extra kill I don't know maybe if you want to step your game up to the highest levels it's time to grab that controller keyboard and mouse putting those hours with those cheetos all over your hands because you're special like that you're going pro your parents are going to be proud of you",
    "transcript_keywords": [
        "hip shot dot",
        "red dot sight",
        "USB powered LED",
        "USB power cord",
        "dot sight attachment",
        "power cord alright",
        "firstperson shooter games",
        "shooter games compatible",
        "accuracy enhance reaction",
        "cool gaming related",
        "enhance reaction time",
        "duty battlefield titanfall",
        "hip shot",
        "gaming related peripheral",
        "related peripheral accessories",
        "normal sites easily",
        "sites easily attach",
        "illuminate supposedly increase",
        "called the hip",
        "red dot"
    ],
    "transcript_entity_values": [
        "YouTube",
        "xbox",
        "MLG",
        "second",
        "ps4 xbox 360 ps3 pc wii",
        "today",
        "USB",
        "first",
        "72-inch",
        "those hours",
        "Adam",
        "Jack",
        "din dong",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}