{
    "id": "5dd1GmKPsIw",
    "title": "I got SCAMMED on Instagram",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-06-17T18:11:45Z",
    "video_url": "https://www.youtube.com/watch?v=5dd1GmKPsIw",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 398707,
    "likes": 11155,
    "comments_count": 267,
    "description": "We bought all the products on our Instagram Check out the Narwal T10 Robot Vacuum and Mop:  Your Games are Disappearing:  Don't Make a Mistake - Surface Laptop Go 2:  The Smallest Xbox Yet:  I Bought the WORST Shark Tank Products:  PS5 Pro:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 We spent TOO MUCH 0:34 Snactiv FingerSticks 1:27 Shark Shoes (ALSO AUSTIN FEET IN 4K) 2:25 Narwal T10 2 in 1 Robotic Vacuum 3:30 Boa Endure Berry Fusion (ORAL BLAST) 4:50 Waterdrop Microdrink 6:06 Lisa Frank Blender (Really) 9:02 Telscoping Stool 10:24 Notorious B.I.G. Speaker 12:31 Nsta Chill 13:45 Larq Self-Cleaning Bottle 14:45 Shift Cam 15:54 Oh Snap! Pop Socket 16:29 What do you think?!?!",
    "description_links": [
        "https://bit.ly/YTThisIsJune.",
        "https://youtu.be/CN3PqKuSyyQ",
        "https://youtu.be/MAOpw8qRjHo",
        "https://youtu.be/iw4gjl2aako",
        "https://youtu.be/QxsClxIo6fI",
        "https://youtu.be/f9KdYp0upfE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- We bought those weird products on Instagram, so you don't have to. We spent way too much god (beep) money on this episode. I went through my- - How much was it, Matt? - Instagram feed, which is almost exclusively ads- - Hey Matt. - because I don't really use Instagram. - Hey Matt, how much did you spend? - We spent close to $1,500 on this episode. Because here's the thing. Products on Instagram are stupidly marked up. - $1,500? (beep) (soda can tab popping) - So Austin gets his inferior Coke coffee, and I have a sip of my inferior Red Bull. - Ah, the mocha flavor of Coke coffee. - Does that make you hungry to have that? - It makes me hungry to have some Cheetos Crunchy. Okay. I mean, this is like a normal thing of Cheetos. - What can we all agree is the worst part about Cheetos? - The dust? - Well, I got the product for you. (munching) The SNACTIV Dark Mode, chopsticks for your fingers. So what these do is they sit on your fingers. You can be sitting there gaming like the elite gamer you are. Then you reach over- (gentle music) - [Austin] Yo, actually, wait, is this a good product, Matt? - I wanna make a disclaimer. These are all very real products that I got recommended to my Instagram. - How much was the SNACTIV. - $35? - This should be $5 no more. It's a literally a piece of rubber. (munches) - Nope. We've held hands a lot on \"This Is\". This is the weirdest way. - Don't put something on my Wikipedia. (laughing) - Speaking of Wikipedia, and things that shouldn't be on the internet. I know you're a fan of sensible footwear. - I am? (bag rustling) Why is it so big? (laughing) - It's a little shark. - This is bigger than a real shark. - I knew there's a reason we got the prop foot. These are like Crocs, the same type of materials as Crocs. You just slide- - For context, it's bigger than my head. (laughing) (imitating shark munching) - All right, I'm doing it. I'm doing it. - The whole reason we do any of these episodes is just to get Austin on celebrityfeetpics.com. (laughing) - This is about 17 times larger than my foot. - How do they feel? - [Austin] Like Crocs that are two times bigger than they should be? - Do you feel like a shark is eating your feet? Just (imitating shark munching) - No. Their super low quality is the thing that I don't like. Like they feel like this is something you'd find for like five bucks. - $27. - [Austin] This is one of those items that looks cool on Instagram and is really trash- - [Matt] Yeah. - when you actually get it. Matt, you should wear them though. 'Cause I don't wanna be the only one who's pulled my feet out for a video. (laughing squeamishly) (beep) - Matt, what's a problem in your life. - My dirty apartment, because my dog sheds all over the place. - You know what I can get you? - What can you get me? - Unlimited time? Because you don't have to do any of that work ever again. Thanks to the sponsor of today's video, Narwal and their T10 2-in-1 Robotic Mop & Vacuum. The T10 uses LIDAR navigation, and laser mapping to not only quickly and accurately map out your room, but also avoid obstacles or falling off of edges, such as steps. In addition to vacuuming, you can also easily switch out new bristle heads for the snap on mop attachment. The five liter tank in the bay station has enough clean water to cover up to 3,000 square feet. - [Matt] Whoa! - That's like 10 of your apartments. - That's way more than 10 of my apartments. - [Austin] When the robot detects that it's mops are dirty, it automatically returns to the base station to self clean, and then seamlessly picks up right where it left off. The base station is simple to use, allowing you to map, clean, or return home with just one click. Or you can use the app to remotely control it and set up things like virtual no-go zones. - To learn more about the Narwal T10, check out our link of description, and a huge shout out to Narwal for sponsoring this portion of the video. - And importantly, keeping Matt's apartment nice and clean, giving you more time to talk about cloud gaming or something. (beep) - Moving on to the next item. - Wait, I gotta put my shoes back on. - Did walking around in all those shark shoes make you super thirsty? What we have here. - Oh no. (laughs) - BOA Endure, Berry Fusion Blast flavor. - Oral blast! Oral blast! Matthew! - 25 oral blasts- (laughing) - of this is supposedly- (continuously laughing) - a zero sugar, zero calorie, zero carb. - Matt, can I please read you the directions for use? - [Matt] Yeah. - [Austin] Fully coat the inside of your mouth with a serving, approximately two second of blast, as needed, then swallow. Boy, oh boy. I don't like any part of this whatsoever. (mocking laughter) Are you spraying? Oh! - All right, ready? I'm gonna fully coat. (spray hissing) (coughs) (laughing) - All right. I'm gonna do this. (spray hissing) (coughs) - It's like, chalky. - It's like medicine. (coughs) - This is actually horrible. Oh my God. - It's like Someone rubbed a rock in my mouth. (gags) - Yeah. I would rather be like sucking on like a pocket full of pennies, than this. - Apparently a two second blast is 7% of your daily sodium. That's why it's so salty. - Salt? Oh my God. Yeah. So we just sprayed our mouths with salt. Pure salt. (gagging) - All of you absolute gremlins talked about how much- - Suck on a- - like the idea of add all from our other video. So it was $30 for two cans. - It's like a dollar per oral bliss, or oral blast. That makes sense. - Look, I feel thirstier than I did before. Luckily we have the solution for that. (thrown box crackling) We have waterdrop FLARE, and waterdrop YOUTH. It's a sugar cube. - Yeah. Did you drop it into the water? - Yeah, I got youth 'cause y'all keep telling me I'm old as (beep). All the flavors are something like FLARE, YOUTH. (exhaling air) - All right. let's let's do this. I'm gonna crack open some YOUTH. - Look at that go. - Wow. That's gross. - All right. we're gonna do two. 'Cause I have a feeling this is gonna taste like nothing. Oh. (sniffing) Oh. - Okay. So mine has peach, ginger, ginseng, and aloe vera. - Mine is elder flower, lime blossom, and the raspberry. I'm gonna try mine. You wanna try it? - Cheers. - Bonk! - That tastes like nothing. - Yeah. That- - What? That's it? - I barely got any flavor outta that. - As someone who drinks a lot of sparkling water, I'm used to the idea of the word flavor being shouted into an empty can and then you drink it. But... - This smells so much more than it. I mean, it smells good. Don't get me wrong. But like it really smells. Then you go to taste it and it's literally nothing. - How much was it for 12 of these cubes? - $24 plus $9 in shipping. So a total of 33. (laughs) - I could get a whole pallet of La Croix and it would taste better and be less work. - Austin. I was gonna ask you if you remember school but you didn't go to school. So if you all remember Lisa Frank, the bright colors that look like a rainbow vomited on a unicorn or a tiger. Have I got the product for you? A BlendJet. Lisa Frank branded personal blender. USB powered, battery powered, rechargeable. - [Austin] This is gonna suck. - [Matt] Single serve blender. - How often do you need to blend things on the go? - Reg, often. - Really? What do you blend on the go? - Everything. - Okay. (laughs) - Smoothies. Oh my God. It's more beautiful than I ever could have imagined. Look at that. It's got a lanyard. Oh! (laughs) - I don't approve of any of this. - [Matt] Do not let children use BlendJet untended. - [Austin] Yeah. - [Matt] Do not put your hand inside the BlendJet. - [Austin] Yep. - Do not run your BlendJet while empty. Do not- (BlendJet whirring) - Sorry. What? (laughing) - So the beautiful thing about this is, yeah, maybe it's not enough for, you know, like a kumquat or- (laughing) - Wait. Wait. - a mango. (laughing) But, when we bought our Lisa Frank personal blender, we were given a variety pack. Chai latte. - What? - Cinnamon Dolce. - So wait, so this is more so for drinks than anything else. 'Cause on the box they say you can do smoothies, protein shakes, mixed drinks. But again, who needs to do this portably? When are we gonna take your whole kitchen with you? Except your blender? I don't, this does not make any sense to me. - Camping? - Okay. - Tailgating. You gotta watch your kid's (beep) soccer games. So you gotta make margaritas. (laughing) So we just made Kinsey run to the store because we didn't feel like doing it. And I forgot to look at the instructions. (milk pouring) (laughing) - I hope you can see, that he got milk all over his hand, shirt, and the Dave, the table. So we've got ourselves some milk. We've got ourselves the ready to blend latte. - I didn't put the ice in yet. - No, stop that! Gentle, Matthew, gentle. (ice crackling) - That's not. Oh, let's see. - Yeah. See. - So we basically need to add the entire content of the jet pack. Apparently it's a jet- (smacking sound effect) (laughing) (sighs) (beep) - Activate jet pack. Okay. - Oh it smells delightful. - So we're supposed to do this for two full cycles. So I'm just gonna press the button. See what happens. Right? Ready? And... (BlendJet whirring and rattling) - It's quite aggressive. - It's quiet. Like it's not, well, it's not quiet. But it's quieter than I would've expected. Lisa, what are you doing to me? - All right. Would you like to do the honors? - Oh. - Oh, well that's, oh. - That is- - That's not good. - No. - No, that's bad. - What? - That's ice and cinnamon milk. (laughing) - That was so disappointing. It smells so much better than it actually is. If you're gonna be tailgating, you wanna be on brand. You don't wanna be showing up with some non Lisa Frank accessories. So what we were able to get, the telescoping portable mobile stool. This was probably the thing that was recommended to me the most. - A stool? - And this is also something I'm pretty sure is seen on TV. - All right. All right. All right. - So this is suitable for climbing, camping, barbecue, fishing, football game, concert, line, touring, parks, gardens. So the idea here is that this collapses down to be almost nothing. And then you just kind of collapse it down. There's no way I was gonna try this for the record. - It works. So you, oh, here's the best part of it. It matches the Lisa Frank. This is, I think like a decent little product that like, again, you bring over to your kid's soccer game. - You say a lot of going to your kids' soccer game but you would have to still be in contact with your children first. - Look, when you're dating in your mid thirties, there's a lot of kids' soccer games. Okay. Like, just for the record. (laughing and clapping) - All right. This is, how much was this? - The blender was $80. That's not bad. - That's not bad. - That's not bad. You're paying for that premium Lisa Frank branding. You could strap this to a bag. You could put the, easily fits in your backpack, whatever. - [Austin] Yeah. - I think this is not bad. This is, I think like a decent little product that like, again, you bring over to your kid's soccer game. - I'm gonna sit here for the rest of the video. - What about the stool? - $55. - $55. Matt I'll bequeath this upon you. - So we're at our kid's soccer games and we got our stool. We got our Lisa Frank blender so we can get our drinks going. Now we wanna get some tunes going. We all know that Lisa Frank is absolutely glorious. - It's not 'cause that player doesn't count. - Well, good news. I'm aware that you are a fan of- (laughing) - notorious- - No, no, no, no, no, no. Is this the way they do it? The N, otor, ious, B, I, G. - [Matt] So this is a retro inspired pager based Bluetooth speaker. I do like the size of it. - Whoa, smell that, Matt. What? It's like- - Fruity. (device clicking) Ooh. I thought you were peeling plastic. That sounds awful. - I think it may have been dead. - Is it dead on arrival? - Like the man himself no longer with us. - Ooh, wait, is this really dead on, what is with products that we keep getting in, that have been dead on arrival? (laughing) - The problem with a lot of Instagram products is that they might look cool, but looking cool in a photo on Instagram and actually being cool as I'm sure you all know, are two very different things. - [Matt] Oh yeah. I forgot that it has a flashlight. - Yeah. There's a flashlight. - I mean... (laughing) - Are you trying to tell me that we got scammed by Instagram? Matt, are you trying to tell me that the advertising and the truth were not the same? - This just feels so cheap. - It feels like a $3 thing you get on wish. - Yeah. Like I felt like I got this at dollar store. - How much was this amount? If it's more than $11, I'm gonna be... - It's way more than $11. - Oh, you're not ready for this. It's $90. (laughing) (continues laughing) - $90!? I swear if this was for $2 on wish. I'd think, I guess. (laughing) (giggling) - [Matt] Oh, suddenly the build construction is super solid. - We've been scammed a lot over the years. This is top three biggest scams. I'm more mad about this than when I bought a PS5 that didn't show up. - Wait, wait, wait, will it blend? (laughing) (beep) - So- (thrown device crackling) - Go ahead. - We've been at our kids' soccer game. - Yep. - We had our drinks and we had, you know, we were trying to listen to some tunes, but we're out. We're out in the beating hot sun. That's where the next products comes in. The chill, anytime. - [Matt and Austin] N'Sta chill. - Oh good Lord. That looks highly suspicious. That looks so- - Look at that smut. We gotta blur that. I think you just literally dropped this in your drink. - Dude. You cannot just tell me that this is it. There's no instructions or nothing. (laughing) Wow. - [Matt] Okay. - There's a QR code on the inside of the box. Matt, scan us up here. Part... (laughing) - What? - \"Hey, thanks for scanning. Notice. The QR code campaign has been disabled for some reason.\" We're missing a key component that they did not sell me. A CO2 container. You open this up, you stick the CO2 container there, and it goes (imitating squealing noise). - How much was the N'Sta Chill? - So much money. - Without the CO2 to actually make it functional. - Without the CO2, it's $50. - This is a scam. - Definitely makes the thing taste even worse. For the rec. (laughing) Look, I know what you're all here for. - Please give me something good. Please gimme something good. - After having that tainted drink. - Okay. - We have this to cleanse our palate. - [Austin] The LARQ, Self-cleaning Water Bottle. Oh, I've actually seen these before. So it says it's got like a little UV light or something on the inside to clean, double isolated. And it is USB rechargeable. So basically all of the actual smart tech, which really is just a light, a charger, a battery, and a little LED are in the cap. So you could take this off. And I assume wash that like normal, because even though it's self-cleaning, it's only self-cleaning against like germs and bacteria. Not against like, whatever it is that you drink in the morning. Okay. - Yeah. - It's cleaning now. So I don't know if you can see, it is now UV sanitizing with ultraviolet light, our Monaco Blue LARQ. I will say I like the design of this. I like the two tone and that Monaco blue does speak to me. How much is it? And I think it's- - 100. - a hundred bucks, man. - Look here. My little gemstones. - Stop doing that. - I know that you wanted some real tech. And I did find something for you. - [Austin] Did you though? - At our children's soccer games, occasionally for the most part, they're just turds out there. They're really bad. They're running in the wrong direction. Your kid goes on a breakaway and scores a goal. And you wanna capture that moment. But you don't wanna carry around your big bulky camera. So what do you do? You reach for the ShiftCam. - You can tell it's expensive because there's like 11 layers to the packaging. Okay. So they also have a series of lenses available. All the way up to anamorphic lenses for your phone, because little Timmy needs to have his soccer game while he's picking his nose done. - You know that some (beep) parents in there. \"Well, I only shoot my kid in anamorphic 4k 120.\" - So basically what this is, is it's a grip for your phone and you have some extra controls on it. Like being able to use the shutter and whatnot. And you have tripod mounts. This has gotta be like what, 200 bucks? - 150. - There's a market for this. This is not gonna help you really take better photos. Like having a shutter button. Like, yeah, these are nice things to have but also, you gotta carry this whole thing around. Like, if I'm gonna carry this whole thing around, I'd rather actually carry like a real camera or something. I'm shooting video. Right? I mean, this doesn't look that different. - Wait, wait, there is one more product. The Ohsnap! PopSocket. It's not PopSocket by the way. It's Ohsnap. - Right? So an off-brand PopSocket like thing. - I bought this specifically, 'cause they're like, oh it's mag safe compatible. So I thought this would just stick on. - Nope. - So it does stick on, 'cause it's magnetic. But they want you to stick this on your phone. - Yeah. How much is this? - $30 for that. - 30 bucks? No, no, this is absolute trash. - Yeah. - This little rubber bit that actually holds it back. It's like a rubber band. I feel like this, you used this for a couple weeks and that rubber is going to snap or fray. I mean you feel that. - Yeah. It's not good. It's like... (sighs) - That's it friends. We've been scanned by Instagram. Just like we've been scanned by many other retailers in our eternal quest for some fresh hot click bait action. Do you actually ever find anything interesting on Instagram? I am not impressed by literally any of it. Some of it's vaguely okay. And that's the absolute best thing I can say. \"Make sure to subscribe and ring-a-ling the ding-a-ling bell. Otherwise, I'm gonna nibble your toes.\" (laughs comically) - No one should be nibbling toes. - \"That's my job. I'm Mr. Sharky.\" - Thanks for watching- - \"Subscribe!\" - this episode of \"This Is\", like, subscribe, follows for the next one. See where we get scammed next and be sure to check out Austin's celebrityfeetpics.com profile. (jazzy music)",
    "transcript_keywords": [
        "Lisa Frank",
        "Yeah",
        "Instagram",
        "Matt",
        "thing",
        "Lisa",
        "wait",
        "Frank",
        "Hey Matt",
        "soccer game",
        "soccer",
        "make",
        "good",
        "feel",
        "Lisa Frank blender",
        "products",
        "product",
        "things",
        "game",
        "Blast"
    ],
    "transcript_entity_values": [
        "zero",
        "three",
        "Crocs",
        "aloe vera",
        "Coke",
        "LARQ",
        "about 17",
        "Ohsnap",
        "ShiftCam",
        "Lisa Frank",
        "PopSocket",
        "80",
        "200 bucks",
        "27",
        "close to $1,500",
        "Wikipedia",
        "4k",
        "CO2",
        "USB",
        "3",
        "Monaco",
        "Monaco Blue LARQ",
        "Matt",
        "24",
        "9",
        "T10 2-in-1 Robotic Mop & Vacuum",
        "daily",
        "Austin",
        "Red Bull",
        "Austin] Yo",
        "LIDAR",
        "12",
        "90",
        "Timmy",
        "first",
        "Instagram",
        "more than $11",
        "Narwal",
        "10",
        "11",
        "PS5",
        "up to 3,000 square feet",
        "2",
        "5",
        "BlendJet",
        "Kinsey",
        "five bucks",
        "50",
        "7%",
        "Lisa",
        "150",
        "Sharky",
        "La Croix",
        "Ohsnap",
        "Narwal",
        "Berry Fusion Blast",
        "second",
        "YOUTH",
        "mid thirties",
        "55",
        "a couple weeks",
        "SNACTIV",
        "1,500",
        "the bay station",
        "35",
        "more than 10",
        "one",
        "33",
        "today",
        "five liter",
        "T10",
        "Austin",
        "the years",
        "Matthew! - 25",
        "Chai",
        "two",
        "Dave",
        "Matthew",
        "the Narwal T10",
        "30",
        "the Lisa Frank"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "FAC",
        "ORDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "MONEY",
        "LOC",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "PERSON"
    ]
}