{
    "id": "5FID5kWGSyg",
    "title": "TOP SECRET SMARTPHONE",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-06T16:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=5FID5kWGSyg",
    "category": "Science & Technology",
    "tags": [
        "huawei p9",
        "huawei",
        "p9",
        "huawei p9 unboxing",
        "huawei p9 review",
        "unboxing",
        "review",
        "p9 unboxing",
        "p9 review",
        "android",
        "best",
        "new",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "apple",
        "iphone",
        "smartphone",
        "iphone 6s",
        "samsung",
        "6s",
        "phone",
        "iphone 6",
        "android (operating system)",
        "galaxy",
        "smartphone (video game platform)",
        "camera",
        "leica",
        "apple iphone",
        "apple iphone 6s",
        "s7",
        "iphone 7",
        "apple inc. (publisher)",
        "galaxy s7",
        "vs",
        "stronger",
        "better",
        "dual lens",
        "gorilla",
        "5s",
        "video",
        "case",
        "iphone 6s plus",
        "galaxy s7 edge",
        "edge",
        "s7 edge"
    ],
    "views": 5700419,
    "likes": 104831,
    "comments_count": 6491,
    "description": "Follow my Twitter for Huawei P9 Giveaway   This is a special, exclusive unboxing of the new Huawei P9. Huawei's new flagship has some unique features including a dual camera system co-engineered with Leica. The Android universe continues to expand with compelling options.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here, back with another video, and today it is something exciting and exclusive. In front of me is not a box, instead it is a briefcase, a fancy briefcase and what I know at this point, is there is an exclusive device inside. The new flagship smartphone from Huawei delivered by hand. Let's jump inside this briefcase and see what it's all about. So this is just not a standard briefcase guys, this is like, the code I didn't even know until right now, that's how secure this situation has been. Unbox Therapy, embossed, in leather. Is that what that's called? That's embossed, right? Very secure, in fact, triple zero in this case. Oh! Ooooooh... Can you see all that? What we have here, my friends... So this is a... This is some kind of custom case here, the device is in the middle. The new P9 here, there's also a leather case and then lastly, very special booklet here. \"Congratulations Lewis\" \"You are the first person in the world to unbox the new HUAWEI P9.\" And then lastly, underneath here, we have the accessories Unbelievable. And we think about all attention to detail that goes into manufacturing something like a high-end smartphone. Why not present it in the way that it deserves to be presented like this? This is the key right here. The fact that you have this dual lens system, co-engineered with Leica. If you guys don't know Leica, you probably don't know photography. These guys have been around forever. One of them is RGB, while the other is monochrome, capturing more light and better clarity. So it's two 12 megapixel sensors. Two separate 12 megapixel sensors! 5.2 inch full HD display, 1080p, it's also got Android 6.0, 3 gigs of RAM, 32 gigabyte ROM... It's also got 8 megapixel f/2.4 front-facing camera and the battery is 3000mAh. Woah! Very nice. USB-C for charging it up, in-ear style earbuds and it does support quick charge. The first thing that stood out to me here is just how thin the overall design is. It's not much thicker than a USB port. Your power switch on the right hand side of the device We have the SIM card tray. This also features a microSD card slot. It's one of those combo sort of sleds. On the back of the device you can see the specs listed for the dual lens system from Leica and also in the center there is a dual tone flash. On the bottom of the device you'll find a speaker as well as the USB-C connector. You will notice a fairly vibrant display here. Launching into the camera application... Now, the camera is actually pretty quick. Pretty rapid fire when it comes to taking pictures. So as mentioned earlier, the P9 features a dedicated monochrome sensor. This will allow you to take these really high contrast native black and white images. So ones of my favorite features in the camera app - little button that looks like some aperture blades. This allows you to utilize both of those lenses. Essentially, what you end up with here is the ability to change your focus to simulate some kind of depth of field. This really unique ability to focus in what matters within the frame. So we can select any area of the image and change focus after the fact. I'll probably be posting some of these samples shortly after this video on my Instagram, so make sure to go follow me there to check those out. So let's go ahead and snap a real quick selfie here Dare I say crispy? Dare I say. OK, I'm gonna enroll my fingerprint on the back here. You wanna gonna go ahead and unlock it. Look at how fast that is. Watch this. See that? YouTube... yeah, it works. Thank God! That, of course, is the main reason you would get any smartphone, of course, to watch more Unbox Therapy, right? Right? Jack, tell 'em. There you have it. A quick look at the new flagship device from Huawei. This, my friends, is the P9, with this very interesting collaboration with Leica. Lastly, before I take off, I've actually got an extra P9. Big shout-out to Huawei for hooking one of you guys up! If you wanna win this, just head over to my Twitter. I'll link it in the description. I'll have all the instructions over there. I'm gonna make it very easy for one lucky person to get their very own device. And bite that photography bug. Does that make any sense?",
    "transcript_keywords": [
        "exclusive device inside",
        "device",
        "Lew",
        "briefcase",
        "Leica",
        "guys",
        "Huawei",
        "exciting and exclusive",
        "Unbox Therapy",
        "exclusive device",
        "exclusive",
        "camera",
        "quick",
        "standard briefcase guys",
        "Unbox",
        "briefcase guys",
        "fancy briefcase",
        "lastly",
        "case",
        "smartphone"
    ],
    "transcript_entity_values": [
        "P9",
        "Lew",
        "Two",
        "Unbox Therapy",
        "12",
        "RAM",
        "1080p",
        "P9",
        "today",
        "USB",
        "first",
        "RGB",
        "Android 6.0",
        "Huawei",
        "Jack",
        "P9",
        "two",
        "One",
        "SIM",
        "HUAWEI P9",
        "Leica",
        "zero",
        "3",
        "microSD",
        "Leica",
        "Twitter",
        "32 gigabyte",
        "8",
        "5.2 inch",
        "Lewis",
        "Leica",
        "Instagram",
        "one",
        "12 megapixel"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY"
    ]
}