{
    "id": "5Fk_41Flqh0",
    "title": "Gaming PCs Just Got More Expensive",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-01-06T17:18:32Z",
    "video_url": "https://www.youtube.com/watch?v=5Fk_41Flqh0",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "pc",
        "pcmr",
        "gaming",
        "videogames",
        "video games",
        "pc gaming",
        "consoles",
        "scalpers",
        "tariff",
        "tariffs",
        "gpu",
        "cpu",
        "graphics card",
        "pcpartpicker",
        "how to build a pc",
        "gaming pc"
    ],
    "views": 53841,
    "likes": 2921,
    "comments_count": 297,
    "description": "Bad news for that GPU you already couldn't buy... Apple's Next Mac :  Why the PS6 Needs to Be Different:  This Camera is INSIDE the Screen - ZTE Axon 20:  Trying $30 AirPods Pro from WISH:  You Should(n't) buy AirPods Max:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/l8b3WWc8Rxw",
        "https://youtu.be/fN_tpKEnviY",
        "https://youtu.be/DMjE_z-Hm6E",
        "https://youtu.be/fruqbEGQ92M",
        "https://youtu.be/sXGzHgrmOs0",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to \"This Is.\" Guess what? That PC, that you've been eyeing that you wanna build, that you can't because their components are all gone and you can't get it, until you're trying to pay scalper prices. Well, now.. - It's worse. - It's worse. It's so much worse. - So here's the thing, right? 2021 is already shaping up to be a very rough year for all kinds of stuff, right? I mean, Play Stations is sold out. Xboxes are sold out. Graphics cards, CPU's, it's hard to get your hands on a lot of these hot tech items. But the big issue now is that things specifically including motherboards, graphics cards and a lot of PC components are now subject to a tariff. Now, if you were paying attention to an economics class, you'll know exactly what that is. But Matt, I don't pay attention in any class. What happens with a tariff? Okay. - What a tariff is, is a tax between countries. So, goods coming from country A are then under a tariff. So they pay a tax to country B. - Here's the deal. Here's what actually matters. If you are going to be purchasing a gaming PC or PC of any kind over the next, well, indeterminate amount of time. There is a 7.5 to 20% tariff. - 25% - 25? - Yes. - Matt, why are you so.. Okay, fine. 25%. - I'm not even mad. I'm not making that up. - It's... - 7.5. - 7.5 - To 25%. - Yeah. - Now this is not necessarily, although most likely going to be passed on to you. - So, I saw this on Reddit. A lot of people were saying that basically companies were scalping themselves and they sneakily raise the MSRPs and everyone's blaming it. - Yeah. - But what it actually is, is this tariff increase, which went into effect January 1st. - So they're essentially now paying the 7 to 25% more to bring the product in. Right? So as they import it from China, they're paying that to get it out of customs. So, while they may have before not paid much or paid very little. This is a direct cost to the company. - Yes. - And obviously, everyone wants graphics cards. They're gonna turn around and pass on most, if not all of that, to you the consumer. Which does make sense. That is the way tariff work. - Right. - Tariffs are applied to a wide variety of products. - Almost everything. - Yeah. - So the most famous example tariffs in electronics is with digital cameras. - Yeah. So you'll notice with a lot of like DSLRs and mirrorless cameras, they might be limited to a 30 minute or 29 minute, 50 and 59 second record limit. That's because a digital still camera. - Yeah. - Was a tariffed differently, than a video camera. - There's all kinds of stuff like that. - So when we talk about, that there's the range is from 7 1/2 and to 25%. - Yeah. - It's hard to tell what is gonna to be what. Because there's so many different variables in that, which get very, very complicated... - They're like 1000s of pages in the tariff, like, guidebook and it gets ridiculous. - It might be like, it could be something is as nuanced as, it's 25% if they use X amount of rare metal. - But what we do know is that some components are already going up in price, right? So we've already seen over the last few days, certain components start to inch up in MSRP. Which to be fair, like, sometimes you see fluctuations but a ASUS has actually come out and basically said, \"Hey, look, this is what's going on. We are raising the prices of these products because this is just costing us more.\" Right? That is just straight up happening. We know that they're being at least upfront about it. Other companies are probably sliding in. But all of this is compounding a much larger issue, which is, look, I love to build myself computers and do videos and all this kind of tech. But I, the other day, literally yesterday, I had to pay 150 dollars over MSRP, to get my hands on a Ryzen processor, 'cause I need it for a build and I have no other option, right? Now to be fair. This is something that will affect many PC components generally not CPU's, right? Other products like graphics cards, like motherboards, these things are going to go up in price and they're gonna stay up in price unless something changes. And it's gonna be especially noticeable on a graphics card, because, look, you might not notice a case that's gonna be 2, 3, 5 dollars more expensive or some RAM that might be 10 dollars more expensive or even a motherboard, that might be 20 dollars, more expensive. But if you're buying a 500 dollar graphics card, that suddenly turns into 650 dollars, which to be fair, a little bit of a worst case scenario, but still, you'll top up about 15, 20% is a lot on these expensive components. I mean, I feel like it's conservatively safe to just assume that, if you can get your components at MSRP, it's gonna cost you about 10 to 15% overall more than what you were gonna pay. The 25%, I think is a very extreme... - It's hard to stay there, man, we don't know... - Right. And unless you're gonna read through, like you said, 1000s of pages of tariff documents, which I know I'm not. Like it's... - You've actually gotta do research for this video. - Well, I mean, there's research and then there's going insane. - Well also, it's hard to know from the outside because different things... again, like you were saying. - Yeah. - Are tariffed at different rates. So, basically the gist of this is, 2020 was already a great year for PC components and gaming components, but not a great year to get your hands on it. Guess what? While yes, stock maybe getting better over the next few months as more and more people are able to get their hands on the RTX cards and their RX 6,000 series cards and the Ryzen processors and all that kind of stuff. The problem is these tariffs are gonna come in, in a big way. What's ultimately gonna happen. In my opinion, is you're gonna notice that 500 dollar card is 550 or 600, you're gonna notice all of these sort of, small and up to large sort of pricing things. They're kinda gonna start inching up. What you are really gonna notice though, is when you go to check with your final bill, right? And you may look at a system that used to be 11, 1,200 dollars and now is 13, 14, 1,500 dollars, right? We don't know how much it is. Maybe 300 dollars is gonna be a little bit more than what's actually gonna happen. But all of these little things and medium things are going to add up. It's gonna be very difficult to get around. - Let me ask you this. - Okay. Go for it. - Do you think any of this matters right now? - No, because you can't buy this stuff, right? I'm buying processors on eBay because I need them. I can't get my hands on them literally anywhere else. - So, that's the thing is that the scalper market doesn't operate the same way as the regular market with tariffs and things like that. They've already bought those graphics cards and they're already selling them for more than MSRP. They're not looking at those and be like, \"Oh, MSRP went up 50 bucks, lets raise our price, 50 bucks.\" They're raising their price based on supply and demand. - Yeah. - So they're gonna... regardless of like what the MSRP is, they're gonna sell those graphics cards at the most that they can sell, period. - Whatever people are buying it at. That's what they price them at. Over time, I think everyone's going to get used to this. Right? Who knows if it stays or goes, right? These are things that are constantly through political, machinery, are kind of coming and going. But basically when you see that next series of graphics cards come out or whatever. They might be a little bit more expensive and we're kinda have to get used to it, right? But right now, there's gonna be a little bit of sticker shock, for things that, Oh, finally, it's coming down MSRP. Oh, this thing's launching at 300. Oh wait, it's launching a 350 now, right? Oh, it's launching at 400, 500. Like everything is gonna start inching up. And in 10%, 15%, these are big numbers. - They are. But we have to remember that this is not unprecedented. - No. - It's not. We've been through this. - Yep. - We've gotten over this. - Yep. - The PC building market, especially, fluctuates so often, you know, how many years ago was it, we had the tsunami in Japan, that RAM prices skyrocket. - Yeah. - Because there was no demand, I mean, there was no supply of RAM prices. Guess what's also happening again right now? - Ethereum is up big. - Ethereum's up. Bitcoin is at... - [Austin] 30 something 1000 of as the recording of this video - [Matt] I think it peeked at like 35. - [Austin] 34 or something like that, yeah, yeah. - It's a ridiculous number. So that's causing all these people to reinvest in new mining systems, using any GP that they can get their hands on. - Which to be fair. I'm not an expert in this situation. I do think it is still not massively cost-effective to buy graphics cards to mine a lot of crypto. So, I don't foresee... - You should not do it. - Yeah. It might make sense if you're long-term. I don't think it's quite as lucrative as back in the earlier days in 2017, where you could go out and spend 300 dollars on a graphics card and it would turn around and make you 300 dollars within a month of profit. - Yeah, right? - Like that's not quite happening. But there's still, it's not good. - When people see these huge numbers now. And they're like, \"Oh wait, I remember when this happened, I didn't do it last time. Quick panic buy all of these things to do at this time.\" And that's just, it's all compounding, because again, supply was already low for these products just due to everything else. - Yeah. - So it just, this perfect storm of, you can't get the components, but then they're just gonna cost you more. And we don't know how long that's gonna last. - It's hard to say. It really is, because these things do come and go. Some tariffs last for decades. - I wanna know is, like you say it's, maybe a company goes and they moved their entire operation to Thailand, Indonesia, - Sure. - Wherever they can skirt around these tariffs. - Yeah. - But that's a huge investment. - Huge. - Billions. - Like supply chains. - Yeah. - Building factories, moving stuff over, massive investment. - So how, you know, which then, that has to be recovered. So how long before that price comes down? - While the manufactures graphics cards have a say in the MSRP. Generally speaking, it's AMD and Nvidia who say, \"Hey, look, this is our new graphics card. It costs 500 dollars. If you wanna charge more for your custom cooler or whatever.\" But usually they're the ones who set the main price. So, if 80% of the graphics card manufacturers are subject to this tariff, guess what, Nvidia is probably gonna go, \"okay, you know what? It's gonna be 600 dollars.\" And everyone's just gonna make more money, if you're outside of it, like it's a messy situation. But I think the real gist of it is this. If you were buying or building a new gaming PC, it is going to be more expensive this year. Not only are you likely gonna have to pay scalpers if you want it right now or you'll have to wait in line. But, even if that's not the case, even if tomorrow supply appears everywhere and everything is right with the world, you are now going to pay 7, 10, 15, maybe even as high as 20 or 25% more, for some of the major expensive components. Which is unfortunate, but that's the way it is. Anyway. Thank you very much for watching this very cheerful episode of \"This Is.\" Make sure to subscribe. And if you're interested in more about tariffs, because you're a nerd, feel free to check out our episode that we did all about the tariff situation. And Matt tells a happy little story about the chicken tax and the... Long, long time ago when we made \"This Is\" videos that were actually good. - Yeah. I hosted that one, didn't I? - You kicked me off the camera... - That's right, because I was the nerd for that one. Thank you for watching. I'm gonna go play my 20 ADTI.",
    "transcript_keywords": [
        "Yeah",
        "Graphics cards",
        "Graphics",
        "tariff",
        "cards",
        "dollars",
        "things",
        "MSRP",
        "components",
        "Tariffs",
        "price",
        "card",
        "pay",
        "expensive",
        "kind",
        "dollar graphics card",
        "lot",
        "hands",
        "prices",
        "hard"
    ],
    "transcript_entity_values": [
        "January 1st",
        "15%",
        "yesterday",
        "35",
        "Reddit",
        "30 minute or",
        "2",
        "300 dollars",
        "CPU",
        "20",
        "Thailand",
        "7",
        "650 dollars",
        "7 1/2",
        "The 25%",
        "7.5",
        "20 dollars",
        "7.5 - To 25%",
        "80%",
        "RAM",
        "10",
        "400",
        "600 dollars",
        "20%",
        "550",
        "ASUS",
        "many years ago",
        "2017",
        "3",
        "Matt",
        "2020",
        "150 dollars",
        "the last few days",
        "500 dollars",
        "Austin",
        "25%",
        "this year",
        "China",
        "Xboxes",
        "Ryzen",
        "1000",
        "decades",
        "1000s",
        "350",
        "7.5 to 20%",
        "11",
        "eBay",
        "30",
        "a month",
        "14",
        "AMD",
        "500 dollar",
        "1,200 dollars",
        "50 bucks",
        "6,000",
        "Maybe 300 dollars",
        "15",
        "13",
        "300",
        "7 to 25%",
        "about 10 to",
        "1,500 dollars",
        "Indonesia",
        "Bitcoin",
        "tomorrow",
        "as high as 20",
        "2021",
        "29 minute",
        "about 15",
        "500",
        "10 dollars",
        "10%",
        "the next few months",
        "34",
        "a great year",
        "25% - 25",
        "50",
        "Japan",
        "the earlier days",
        "MSRP",
        "600",
        "GP",
        "Nvidia",
        "ADTI",
        "5 dollars"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "GPE",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "TIME",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "PERSON",
        "PERCENT",
        "DATE",
        "GPE",
        "ORG",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "GPE",
        "NORP",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "DATE",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY"
    ]
}