{
    "id": "5gfXjY8kLw0",
    "title": "Mi Note 10 Durability Test! - 5 cameras for under $500?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-03-09T22:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=5gfXjY8kLw0",
    "category": "Howto & Style",
    "tags": [
        "Mi note 10 review",
        "Mi note 10 durability test",
        "mi note 10 bend test",
        "burn test",
        "scratch test",
        "mi note 10 unboxing",
        "norton 360",
        "norton",
        "lifelock",
        "norton antivirus",
        "norton security",
        "norton secure vpn",
        "norton vpn",
        "cyber security",
        "cyber safety"
    ],
    "views": 1608961,
    "likes": 53261,
    "comments_count": 4084,
    "description": "Its time to durability test the Mi Note 10! Huge thanks to Norton 360 for sponsoring a portion of this video! Get up to 60% off your first year HERE:  Xiaomi hasnt always survived my durability tests. Its time to see if their new Mi Note 10 Pro can handle the abuse of every day life. We'll start off with a scratch test on the Note 10 to see what the screen, back glass, and camera lenses are made from. The Mi Note 10 Pro has 5 camera lenses on the back, including a Macro camera for close up shots.  Watch the Mi Note 10 Teardown HERE:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://bit.ly/2VV7yIO",
        "https://youtu.be/neLzN4QtTIk",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "A portion of this video has been sponsored by Norton 360. Today we're going to be durability testing the Xiaomi Mi Note 10. This guy has 5 cameras on the back and currently costs less than $500. Xiaomi phones haven't always passed my durability tests so this should be interesting. Huge thanks to Norton 360 for sponsoring a portion of this video. Norton 360 is a group of apps that give multiple layers of protection for connected devices providing safety and security features. No one can prevent all cybercrime of course, but having protection is better than having no protection. I use a VPN when I'm traveling. I virtual private network secures Internet traffic and encrypts it, all while routing it through a remote server. I can access my apps and content just like I were at home, even though though I'm not physically there. Pretty useful. You can get up to 60% off with a promo code: jerryrig. Norton 360 isn't just a VPN and antivirus, it also has something called dark web monitoring which basically scans the web for your personal information. Then you can stay on top of keeping that information private. There's even parental controls to help keep your kids safe online and it works on multiple devices. Norton 360 even has a password manager. There's a lot of protective layers going on, and it works for computers and smartphones. And they are all found in one spot. You can check out Norton 360 with the link in the description, or visit Norton.com/jerryrig. And thanks again to Norton 360 for sponsoring a portion of this video. Now it's time to move onto the durability test of the Xiaomi Mi Note 10. Let's get started. [Intro] This is one of the most powerful phones for the price right now, and it almost slipped my radar. Released late in 2019, I didn't realize how cool this phone was until I started getting a lot of requests for it. It's no folding phone of course, but I'd say most people aren't looking for that tech just yet. The biggest perk of this phone I think is the camera setup on the back. It's got everything: a beastly 108 megapixel, a portrait camera, a telephoto, an ultrawide, and something we don't see very often, a macro camera for those super close up shots. The phone does come with a clear case in the box which is nice. Protection is always a good thing. It's time for the scratch test. The last two phones I tested, the Motorola Razr and Z Flip both had flexible displays that started to damage at a level 2. Sapphire of course would scratch at level 8 or 9. Xiaomi has said that this phone is using Gorilla Glass on both the front and the back. And indeed we do see scratches at a level 6, with deeper grooves at a level 7. Pretty normal. Every day objects shouldn't do any damage. My razor blade is unable to scratch the top 32 megapixel selfie camera in this teardrop notch. The speaker grill up top is a thin strip of plastic, but it's glued in tight and won't be falling out on its own. I got the Aurora Green version of the Mi Note 10, and the frame is made from metal. Flipping it over we can see the SIM card tray is also made from metal. There's no official IP rating on the Mi Note 10, but it does have a red rubber ring around the dual SIM card tray. No SD or expandable memory though. The power and volume rockers are both made from metal. And here at the top we have more aluminum, along with the built-in IR blaster for remote controlling TVs and stuff. I like phones with features and this phone...are you ready...even has a headphone jack. You might have heard those old legends of this antiquated technology existing in every handheld communication device, and it's nice to see that Xiaomi is still going strong. The Mi Note 10 is the Swiss Army knife of cellphones. The back panel is made from glass, and each of the cameras are protected as well. The bottom 2 megapixel macro camera, the 12 megapixel wide-angle, has it's own lens. Then the 108 megapixel wide-angle high resolution camera and 12 megapixel portrait, and 5 megapixel telephoto camera are all under the same piece of scratch resistant glass. There are 4 flash LEDs, 2 of which are diffused. Kind of cool. The frosted diffusion on top should made a softer flash, but with LEDs this small, it will be interesting to see if it actually makes a difference. The biggest selling point of this phone to me of course, is the large selection of cameras. Obviously, that 108 megapixel camera is cool all by itself. I'll let other tech reviewers do the glamour shots. I just like having options. This phone has the largest selection of cameras we've ever seen. A macro lens is something we never usually included on a smartphone, and I'm sure some of you will find that closeup camera super useful. It's not just the 5 cameras, IR blaster, headphone jack. This phone also has a massive 5,260 milliamp hour battery. We'll have to find that of course during the teardown. This sub $500 Mi Note 10 is easily one of the feature rich smartphones we've seen in a long time. It has more features than most $1000 smartphones. And it survives the burn test. After 30 seconds there was hardly any damage on the 6.5 inch AMOLED display. But, of course, if we're being honest, if your phone's on fire you probably have bigger problems to worry about. The last thing to check before the bend test is the underscreen fingerprint scanner. This time around I'll scan my fingerprint first. We can tell it's an optical fingerprint scanner by the way the screen lights up illuminating my fingerprint so the underscreen camera can take a picture of it. Then we can inflict some level 7 deeper groove damage on top. This is definitely more scratches than the phone will ever see with regular use. And lucky for us, the Mi Note 10 is still reading my fingerprint every time and unlocking the phone. Normally, smartphones do survive my durability test, but in the past I've had multiple Xiaomi phones fail catastrophically. Like the Mi 5 or the Redmi Note 3, or even the Redmi Note 7 just last year. But after the first bend with this phone, we can tell the Mi Note 10 is different. There is no flex to the display when bent from the front, and no flex when bent from the back. This is probably the most structurally solid smartphone that Xiaomi has ever built. And it's definitely one of my favorites. It has a lot of features, less than $500, and is structurally sound. The Mi Note 10 is a winner. Let me know what other smartphones you want to see tested down in the comments. Hit that subscribe button so you don't miss the teardown. And come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Note",
        "phone",
        "camera",
        "Norton",
        "Xiaomi",
        "Redmi Note",
        "Xiaomi phones",
        "megapixel",
        "phones",
        "cameras",
        "top",
        "multiple Xiaomi phones",
        "test",
        "smartphones",
        "Xiaomi Mi Note",
        "back",
        "level",
        "made",
        "time",
        "fingerprint"
    ],
    "transcript_entity_values": [
        "the Motorola Razr and Z Flip",
        "Norton",
        "Norton 360",
        "5,260 milliamp hour",
        "2019",
        "9",
        "the Swiss Army",
        "8",
        "Instagram",
        "up to 60%",
        "IR",
        "two",
        "Aurora Green",
        "108",
        "jack",
        "6",
        "108 megapixel",
        "VPN",
        "12 megapixel",
        "4",
        "SIM",
        "This sub $500",
        "the Xiaomi Mi Note",
        "less than $500",
        "10",
        "6.5 inch",
        "5 megapixel",
        "5",
        "Mi Note",
        "1000",
        "first",
        "last year",
        "30 seconds",
        "2 megapixel",
        "Xiaomi",
        "the Mi 5",
        "Today",
        "32",
        "7",
        "Twitter",
        "IP",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "DATE",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}