{
    "id": "5gvBu524u_A",
    "title": "HTC Made a CLEAR Smartphone!! (almost)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-05-02T14:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=5gvBu524u_A",
    "category": "Howto & Style",
    "tags": [
        "Transparent smartphon",
        "Translucent black",
        "HTC",
        "smartphone",
        "Android",
        "NFC",
        "HTC U11",
        "HTC U11 plus",
        "teardown",
        "clear tech",
        "see through smart phone",
        "technology",
        "tech",
        "review",
        "U11 unboxing",
        "Translucent phone review",
        "clear smartphone"
    ],
    "views": 1471093,
    "likes": 31652,
    "comments_count": 1439,
    "description": "A transparent smartphone anyone can buy!! HUGE thanks to Squarespace for sponsoring this video! Go to  to save 10% off your first purchase of a website or domain.  HTC is the FIRST company to release a semi transparent smartphone! Or as they like to call it 'Translucent Black'.  And I think its beautiful! Seeing the inside of technology is the best. Especially when you dont have to void any warranties to get there. Speaking of voiding warranties... Lets make this 'translucent' phone even more 'translucent'.   In pure JerryRigEverything fashion, its time to open up the HTC U11 and remove some of the color from the back panel. Definitely leaving the trademark NFC coils intact... But with a little smartphone modification, we can see the rest of the internals as well.   Here is the HTC U11 durability test (It didnt do so well):   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.Squarespace.com/JerryRig/",
        "https://youtu.be/DdRxmu2jcMs",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "HTC is the first company to make a semi-transparent cellphone. They dropped a translucent black option onto their U11 Plus model, which is a huge step in the right direction for nerds who like to see inside the expensive tech they are paying for. I kept waiting for HTC to release this phone in the USA, but it's still currently unavailable. When Squarespace offered to sponsor a video, I knew immediately what phone I wanted to check out. Let's get started. [Intro] And here it is the translucent black HTC U11 Plus. And while it is semi-transparent, it's still much darker than I anticipated. I guess that's why they call it a translucent black. I'll bump up the exposure on my camera so you can see all the details inside the phone. The one prominent feature is the copperish looking coils that peek through the center of the glass. While easily mistaken for wireless charging, these are actually just the NFC coils for payments or transferring files via near field communication to other devices within a few inches. Personally, I think HTC could have made the glass a bit more see-through...you know? So let's see if we can help them out a little bit. Removing the back panel is pretty similar to all the other glass back smartphones like Samsung or LG...not the new iPhone though. That piece of glass can buzz right on out of here. After the HTC U11 is warm, I can lift up with a suction cup and slip my metal pry tool between the glass edge and the middle frame and work my way around the edges with a piece of paper to not put too much pressure on the curved glass. The reason the U11 partially failed my durability test was because the metal frame and the screen glass have no cushion between the two layers. Metal isn't very forgiving during drops or bends, and the glass shatters. Paper is much more forgiving than my metal pry tool, so I'm using that to slice through the adhesive and it's working just fine. Finally the translucent back can lift off. I'll unplug the fingerprint scanner with my blue pry tool. And check it out the phone is revealed. It's interesting that the glass is semi-translucent in the center, and then gradients out to black pretty quickly around the edges. When I first saw this phone I was pretty excited about the wireless charging being so epically prominent and prevalent...but it's just NFC no wireless charging option. It's still cool looking of course, but wireless charging would have much more substantial copper inside to handle the induction. Looking closer at the back glass, it almost has a green tint to it as the color gets darker around the edges. Revealing tech from the inside has it's perks. It looks good, don't get me wrong, but let's show HTC what a real transparent phone looks like. I'll pop off the fingerprint scanner and the camera lens frame from the underside of the glass, and then I can start scratching away the color. Normally with a glass back LG or Samsung phone, this would either pull off in one big chunk or some industrial paint thinner would help remove the color. But HTC is using a different laminate layer material that left some pretty heavy residue on the glass, even after the laminate coloring is gone. I like to get a little bit of a grip on the laminate by scraping away with my razor and then using heat to soften the laminate and pull it up off the glass. I don't have to worry about my razor blades scratching the glass because a razor is a level 5 on Mohs Scale, and glass won't scratch till level 6. You can see the hefty amount of residue left on the glass right here. I thought paint thinner might help get this off, but it's pretty invincible gunk. The only thing that really worked was a whole lot more scraping. And some glass cleaner. Even after the laminate is pulled off the glass, it still has a tinted mirror-like finish to it, which I'm fine with. I think it looks pretty sweet. I'll get the camera lens put back into place, along with the plastic flash defuser. I'm going to leave the black plastics intact this time around, since it kind of goes with the darker tinted aesthetics of the phone...but clear plastics have been around for a hundred years. So if HTC really wants to make a transparent phone on their next device, all the way down to the circuit boards, I'm sure they could. Kind of like the clear Nintendo Switch mod. While I put adhesive around the square of the phone, let's talk about Squarespace for a second. Huge thanks to them for sponsoring this video and making this teardown possible. Squarespace is an easy to use website builder. The cool thing with Squarespace is that all of their tools are in one spot - buying the domain, the hosting, and even the templates for building a website. Whether you want your resume online or you're building a legitimate online storefront with products and inventory, Squarespace can handle it, and it never needs to be updated. You get 10% off your purchase by heading to squarespace.com/jerryrig. And speaking of being updated, how do you like the new updated transparent glass of the U11 Plus? I do like now that we can see more of the internal antennas and the massive 3930 milliamp hour battery. Huge thumbs up to HTC for pushing the boundaries in phone design and taking official steps to make the fully transparent phone we all want. Check out Squarespace if you need a website, and thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "glass",
        "HTC",
        "phone",
        "translucent black HTC",
        "Squarespace",
        "translucent black",
        "glass back",
        "back",
        "pretty",
        "transparent phone",
        "black",
        "black HTC",
        "wireless charging",
        "laminate",
        "translucent",
        "metal",
        "inside",
        "wireless",
        "charging",
        "pry tool"
    ],
    "transcript_entity_values": [
        "HTC",
        "Nintendo Switch",
        "a few inches",
        "iPhone",
        "10%",
        "two",
        "6",
        "HTC U11 Plus",
        "a hundred years",
        "U11",
        "3930 milliamp hour",
        "Mohs Scale",
        "USA",
        "5",
        "NFC",
        "Squarespace",
        "first",
        "second",
        "Samsung",
        "the U11 Plus",
        "U11 Plus",
        "one",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "ORG"
    ]
}