{
    "id": "5LdAEBimv5Q",
    "title": "Dell wants to be Apple so bad...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-04-19T01:10:31Z",
    "video_url": "https://www.youtube.com/watch?v=5LdAEBimv5Q",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Dell",
        "Apple",
        "memory",
        "DDR5",
        "GPUs",
        "graphics cards",
        "proprietary",
        "locked in",
        "right to repair",
        "upgrade",
        "DIY PC",
        "laptops",
        "Macbook",
        "Macbook Pro",
        "Dell Precision"
    ],
    "views": 596842,
    "likes": 33590,
    "comments_count": 805,
    "description": "Save 10% on XSplit's video tools at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:   Timestamps: 0:00 we could do anything 0:07 Dell's S-CAMM 1:05 Tesla removes mobile connector 1:50 Insteon gone 2:36 Xsplit 3:14 QUICK BITS 3:20 Ads in Xbox F2P games 3:51 North Korea hacked Axie 4:14 Twitter edit button history 4:36 Playdate 5:03 BCI lets locked-in man communicate  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://lmg.gg/xsplit",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/jDHMh",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- We could talk about tech news. Yeah. Yeah, we could talk about tech news. Dell has made some good computers in their day. Ever heard of the OptiPlex? The XPS notebook? Marcus? - Nope. - Never heard of... Oh, he doesn't know about computers. Well, the company's Precision 7-series laptops look pretty good as well, except for one small problem: they've got a proprietary memory connector, according to some leaked presentation slides courtesy of iGPU Extremist on Twitter. So it looks like you will be able to upgrade these laptops' DDR5 memory, but only by using Dell's probably overpriced Compression Attached Memory Modules, or CAMMs. This, along with Dell's proprietary GPU modules, makes the company just a little bit more like Apple. They're not gonna hug you, bro. It does look like Dell's system could allow scaling laptop memory up to 128 gigabytes, which is great, bit if you put \"scalable\" in front of \"CAM,\" you get \"SCAM,\" so... You don't need that much RAM. Elon Musk confirmed on Twitter that Tesla will no longer include the mobile connector accessory by default with new vehicle purchases because, quote, \"Usage statistics were super low, so seemed wasteful.\" Wait, sorry, it seemed wasteful to include the thing that lets owners of an electric vehicle charge it with a regular wall outlet? It just seemed like more people wanted to spend 500 bucks on a wall connector, so... You can still buy the mobile connector separately. Musk said they're lowering the price to $200, though it's still listed on Tesla's site at $275, and also is out of stock, so maybe that contributed to this decision. I mean, the usage statistics showed that people just aren't using the mobile connector because we're not making them anymore, so... And smart home company Insteon has apparently shut down its office and servers without so much as an email to its thousands of users, removing functionality from their devices and apps. Multiple executives purged their LinkedIn accounts of any reference to the company, and some appear to have deleted their accounts entirely. Thankfully, the Insteon community has figured out some plugins and workarounds that can keep the lights on. (chuckles) That's... But the incident serves as a warning against investing in the wrong smart home company. Thankfully, the industry seems to be moving more towards open and interoperable standards, like Matter, instead of the proprietary technology that Insteon was known for. Of course, there's always the option to just go with a dumb home. I mean, I find they have a certain charm. Now it's time for Quick Bits, brought to you by XSplit, the trusted livestreaming and recording software for gaming, presentations, live events, hot dog competitions, regular dog competitions, you name it. XSplit's got it all: Broadcaster, the all-in-one streaming and recording solution; Connect: Webcam, which lets you use your phone as a webcam; Presenter, for adding personality, flair, and interactivity to your stream; Capture, which lets you annotate and add voiceover to shareable images and video clips; and VCam, a virtual background tool. Get everything you need to make awesome streams, and use code LINUS at the link below to save 10% off today. We could do some Quick Bits. We could definitely do some Quick Bits. A report from Insider claims Microsoft may allow brands to display ads in free-to-play Xbox games, but they wouldn't take a cut of the ad revenue. It seems like the strategy is just to attract more free-to-play game developers towards the Xbox platform, which is great. More soulless, microtransaction-infested multiplayer games. That's what Xbox needs. I mean, they did just buy a bunch of Massive studio's, so these ad-ridden games will balance out the deeper single-player games. You don't want too many of those. It's too much quality. The hackers that stole more than $600 million worth of cryptocurrency from the NFT game \"Axie Infinity\" were based in North Korea, according to the FBI. North Korea's Lazarus Group has reportedly been responsible for stealing over $1 billion in crypto in recent years, contributing greatly to the country's economy. And your parents tell you to get a real job. Some leaks are making it seem like Twitter's upcoming edit button could include functionality to display a tweet's history after it's been edited, which could allay some concerns about the feature being used to hide bad takes. Who knows, maybe this will normalize the idea that it's okay to change your mind about stuff. I'm already feeling the edit instinct. The heavily anticipated Playdate handheld gaming toy thing is finally out after many delays, and the internet is full of tech reviewers singing its praises. It's a $180 2D Game Boy-looking thing with 24 simple games built in and a crank in addition to a D-pad and buttons. And while you're not gonna feel the excitement of taking down kaiju while playing it, you might experience some feelings of quaintness, whimsy. And a recent paper published in Nature describes how scientists at the Wyss Center in Germany managed to fit a brain-computer interface onto a man with complete locked-in syndrome, meaning he was entirely paralyzed, which allowed him to learn to compose simple messages. Using only his thoughts, he was able to communicate with his son, and even asked for specific foods. Now, some of you are hearing this and thinking, \"Whoa, a way to never leave my chair again?\" No, that's the... That's not the right takeaway. Now I have to take myself away, so come back on Wednesday and we can talk about whatever you want. As long as it's tech news.",
    "transcript_keywords": [
        "Quick Bits",
        "Dell",
        "games",
        "mobile connector",
        "connector",
        "company",
        "Dell proprietary GPU",
        "Attached Memory Modules",
        "talk",
        "memory",
        "Compression Attached Memory",
        "proprietary memory connector",
        "home company Insteon",
        "Twitter",
        "Bits",
        "tech",
        "Quick",
        "smart home company",
        "Insteon",
        "Xbox"
    ],
    "transcript_entity_values": [
        "Webcam",
        "24",
        "Insteon",
        "Capture",
        "Germany",
        "more than $600 million",
        "CAM",
        "FBI",
        "Tesla",
        "one",
        "Nature",
        "Connect",
        "NFT",
        "their day",
        "500 bucks",
        "275",
        "XSplit",
        "128 gigabytes",
        "Lazarus Group",
        "Marcus",
        "Twitter",
        "Microsoft",
        "Massive",
        "Quick Bits",
        "North Korea",
        "the Wyss Center",
        "LinkedIn",
        "VCam",
        "recent years",
        "North Korea's",
        "OptiPlex",
        "$180 2D",
        "thousands",
        "10%",
        "Elon Musk",
        "Wednesday",
        "200",
        "GPU",
        "some Quick Bits",
        "XPS",
        "Xbox",
        "LINUS",
        "Xbox",
        "over $1 billion",
        "Dell",
        "Apple",
        "today",
        "Axie Infinity"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "NORP",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "GPE",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART"
    ]
}