{
    "id": "5MaPqUYAetg",
    "title": "Apple AirTag Teardown! - How easy does it scratch?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-05-04T13:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=5MaPqUYAetg",
    "category": "Howto & Style",
    "tags": [
        "Apple Airtags",
        "airtags",
        "airtag",
        "air tag",
        "air tag pro",
        "airtag pro",
        "iphone",
        "ios",
        "smartphone",
        "cool accessory",
        "Steve jobs",
        "Tim Cook",
        "Apple Park",
        "tile",
        "tile pro",
        "keys",
        "wallet"
    ],
    "views": 1639164,
    "likes": 70904,
    "comments_count": 3253,
    "description": "Its time to take apart Apples new AirTag! Grab your teardown skin HERE:  Apple is always comeing up with new ways to dip into your wallet. (Funny how the AirTag doesnt even fit into a wallet) This time around they've built a small $30 dollar tracker that can clip to your suitcase or keys, and will beep for you if you ever need help locating your items. Would you ever spend 30 bucks on a location tracker?   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.dbrand.com/teardown",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Small little video today on Apple's small little AirTags. Apparently, these tiny little pucks can help you find anything you might have lost like: keys, purses, pets...ambition. I have the 4 pack in front of me which costs about $100. And for that price you might want to just practice not losing your stuff a little bit harder. Or, you know, pay me $100 and I'll just come hold your keys. I'm mostly joking though since these kind of actually do some pretty cool things. Let's get started. [Intro] Right out of the box they look pretty good. Simple white design, with a super shiny stainless steel metal plate, with the Apple logo right front and center. You might forget your keys, but you'll never forget who owns the world you live in. Of course this was designed by Apple in California. And assembled in China, and functions with Bluetooth low energy alongside the ultra wide band. We'll get to those more in a second. As you can see, the scratches made from my razor blade on the back of the AirTag is pretty visible. I think we should see what level it really starts scratching at. I'll grab my Mohs picks and start with the level 2 plastic tip pick, and as we can see, there are no markings except for the little scratch near the apple bite that must have happened during shipping, or from my own microfiber cleaning cloth. Moving up to a level 3 copper pick, we start to see scratches on the surface of the stainless steel. It's not so much that the stainless itself is soft, it's just the shiny finish is so pristine that it's easily susceptible to blemishes. And some of these abrasions probably came from the dust on my cleaning cloth...which is supposed to be clean. So basically just plan on this finish not being pristine for long. Not a big deal, of course. I'll talk more later in the video about how to hide the scratches. The metal plate is about the same size as a U.S. quarter. The back of the AirTag is rounded as well and made from white plastic...which does a better job of hiding the scratches. Getting inside the AirTag is easy enough. This might be the first user replaceable battery in an Apple product since, well, ever. Thumbs up for that. With a little twist we reveal the Panasonic 3 volt CR2032, and this battery could supposedly last for about a year before needing to be switched out. The rest of the housing is slightly more difficult to get inside of. This thing is IP67 water resistant, so keeping track of your goldfish is an option. Finding Nemo would have been a much shorter video if his dad had one of these bad boys. With the inner plastics off, we get our first look at what seems to be another battery, but it's actually a small speaker for the tones that play when you're trying to find whatever it is that you're trying to find. It's a real easy way to cheat at hide and seek by the way. Just put one of these on your kid. It'll be a new game called Bill Gates and the Microchip...except for it's actually Tim Cook and an AirTag. The main board is actually pretty hard to remove with it being glued in place and all. But eventually we can get it separated from the plastic housing...while accidentally ripping both copper speaker wires in the process. Apple could have totally done some Iron Man level Easter eggs in here with the Apple Campus. But besides them both being circles, that's about all the similarities we get. Here's the magnetic portion of the speaker, and you can see the copper coils that drive the speaker right below it. The circuit board is pretty nifty. This is what contains the Bluetooth chip and the ultra wide band. The difference between the two, while both pretty similar, is that the ultra wide band's signal is easier to measure precise locations with than it is with Bluetooth signal alone. Your iPhone will measure the time it takes for the Ultra wide signal to pass from the AirTag to the phone, and that signal strength measurement is how it can pinpoint the exact location of the AirTag. The last thing inside of the AirTag is the NFC coil on the back of the black plastics. So even if you are further than say, 30 feet or 10 meters from your lost goldfish, Apple's network of phones and computers acts like a giant skynet...I mean, acts like a giant net that can help you find your missing item. Even Android phones can jump in on the action and scan this NFC to see who the AirTag belongs to, if you've allowed that feature. It's kind of like a luggage tag, but with extra steps. And then you might even get your lost item back, assuming, of course, that the other person is a decent human. But judging by the people who can't be bothered to wear a mask during the pandemic, you got a 50/50 chance. And I might be a little biased, but the easiest and coolest way to hide the scratches on the AirTags is with one of my Teardown Skins from dbrand. It's probably our easiest Skin to apply yet, and lets you see all the cool insides of the AirTag from the outsides. Instead of the AirTag looking like a white button from your grandma's fur coat, it's now a fine tuned location tracker fit for a sci-fi nerd. I'll leave a link down in the description. We probably have a Teardown Skin for your phone as well. Would you ever buy a $30 location tracker for your keys? I'm curious. Let me know down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Apple",
        "AirTag",
        "ultra wide",
        "pretty",
        "ultra wide band",
        "scratches",
        "keys",
        "ultra",
        "level",
        "back",
        "Apple Campus",
        "wide",
        "video today",
        "wide band",
        "Bluetooth",
        "find",
        "Apple small",
        "speaker",
        "signal",
        "AirTags"
    ],
    "transcript_entity_values": [
        "50/50",
        "Tim Cook",
        "iPhone",
        "Teardown Skins",
        "30",
        "China",
        "the Apple Campus",
        "10 meters",
        "Instagram",
        "AirTags",
        "California",
        "two",
        "Mohs",
        "100",
        "about a year",
        "a Teardown Skin for your phone",
        "4",
        "U.S.",
        "30 feet",
        "Apple",
        "Panasonic",
        "NFC",
        "first",
        "about $100",
        "second",
        "Ultra",
        "today",
        "3 volt CR2032",
        "3",
        "Bill Gates",
        "AirTag",
        "one",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "GPE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORDINAL",
        "NORP",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}