{
    "id": "5OE_C3g6LeU",
    "title": "Moto Z2 Play Review: Bad Sequel, Better Smartphone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-07-06T19:53:35Z",
    "video_url": "https://www.youtube.com/watch?v=5OE_C3g6LeU",
    "category": "Science & Technology",
    "tags": [
        "moto z2 play review",
        "moto z2 review",
        "moto z2 plus review",
        "moto z2 force review",
        "mrmobile",
        "michael fisher",
        "moto mods 2017",
        "moto mods review",
        "motorola 2017",
        "biggest battery phone",
        "android central",
        "moto z play 2017",
        "moto z 2017"
    ],
    "views": 293325,
    "likes": 7702,
    "comments_count": 573,
    "description": "Last years Moto Z Play was a smartphone with legendary battery life that didnt break the bank. So, for the sequel, Motorola decided to shrink the battery  and bump up the price. Because  capitalism?  I was as irritated as anyone to see Motorola make that choice, since I really admired the original Z Plays unique package of affordability and endurance. But what surprised me is that, even despite its shrunken battery (and my accompanying consternation) the Motorola Z2 Play is still a really good phone. Even more surprising: its also a pretty good deal -- as long as you get it from Verizon. To see how that's possible, check out MrMobiles Moto Z2 Play Review! Then be sure to follow it up with Android Centrals Moto Z2 Play review for the deeper dive, and visit my Channel Page here on YouTube if you want the full take on all the new Moto Mods coming down the pike!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  \"Stay Mobile, My Friends\" T-Shirt:   Motorola Moto Z2 Play:   Motorola Moto Mods 2017:   Fonesalesman Qi Wireless Charger:   mStand by Rain Design:   Scientific Sci-Fi Scanner (tricorder app):      [ABOUT MRMOBILE'S MOTO Z2 PLAY REVIEW]  MrMobile's Moto Z2 Play Review was produced following seven days with a Moto Z2 Play review device on loan from Motorola/Lenovo. The device was used on Verizon Wireless and was connected to an Android Wear-powered Casio ProTrek for the duration of the review period, which took place in Greater Boston.    [FURTHER READING]  Android Central's Moto Z2 Play Review:   Moto Mods Homepage at Motorola:     [MUSIC]  Sensational by Cymatix, available at Premium Beat:   Lifetime Travels by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://teespring.com/mrmobile-stay-mobile-pink",
        "http://mrmobile.tech/2s8",
        "http://mrmobile.tech/2s9",
        "http://thrifter.com/suRJ",
        "https://www.raindesigninc.com/",
        "http://mrmobile.tech/2tj",
        "https://www.androidcentral.com/moto-z2-play",
        "https://www.motorola.com/us/products/moto-mods",
        "https://www.premiumbeat.com/royalty_free_music/songs/sensational",
        "https://www.premiumbeat.com/royalty_free_music/songs/lifetime-travels",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Voiceover] Last year's Moto Z Play was a smartphone with legendary battery life that didn't break the bank. So for the sequel, Motorola decided to shrink the battery and bump up the price. - Wait a minute, I'm sorry, is that? That can't be right. Is that true? - [Voiceover] Yep, you heard me right. So you don't exactly need to watch til the end of the video to know that I think this is a pretty weak sequel, but what might surprise you is that the Moto Z2 Play is still a really good phone and a pretty great deal for some people, at least. Like a lot of phones, the Z2 Play looks better in person than in photos. The matte metallic back plate is a much better choice than last year's scratch-prone mirror finish, and the whole package just looks and feels a lot classier. Now a big part of that is the millimeter Motorola managed to shave off the chasse and if you're already skimming the comments, you'll probably see some phone geeks shouting \"heresy.\" See, the popular feeling is that most people would rather have a thicker phone that lasts longer, and dumping 15% of its battery capacity to hit a smaller waist size, the Z2 play breaks this rule. And then it goes on to break another one by sticking a huge camera lens out the back. But you know what surprised me? This phone is still an endurance champ. I routinely have 20% left after a 16-hour day of heavy use. Not that I'm making excuses for Motorola, whose thought process here seems to have been well, having a phone famous for its big battery is nice, but getting people to spend more money on accessories is way nicer. That's where the Moto Mods come in. Spend an extra 80 bucks and you can pick up a Turbo Power Mod that roughly doubles your battery capacity, and yeah, this thing is no joke. After a Fourth of July that included an hour of Google Maps driving navigation, two hours of browsing the web, and a whole afternoon shooting almost constant photos and video, at the end of 14 hours I still had 80% left on the phone and 35% left in the Mod. In fact, Mods are such a big part of the story of this phone that I shot an entirely separate review video just on the new Moto Mods. Check it out on the Mr. Mobile channel on YouTube and subscribe while you're there. I'll share some of those Fourth of July photos in a second, but first, a quick word on software. Motorola is just so good at improving Android where it can and leaving it alone where it can't. If you wanna see what you missed since the last time you looked at your phone, Moto Display flickers to life with a wave or a pocket pull, and now it lets you take quick actions, too, like replying to text messages without unlocking the phone. The new fingerprint sensor is super fast and it's been enlarged to accommodate Motorola's one-button nav, which lets you use swipes and taps to navigate the OS. I know it looks weird, but I've come to prefer it over the standard soft keys. In the same vein, once you get used to chopping and torquing your way into the flashlight and camera, going back to a boring old button just seems dull. If the Moto features don't flip your pancake, you can turn them off, and what you get then is a nimble, near stock Android 7.1. Lots of folks still think a processor that starts with the number six instead of eight somehow guarantees you'll be on the slow boat to sluggish city, but that wasn't true for the Z Play or the G5 Plus, and it's not true here either. Whether you're talking regular day-to-day usage or high-intensity gaming, this thing flies. Where you'll start to feel the pinch of that mid-tier processor is in areas like network connectivity, mainly for future-proofing, and in the camera. The Snap Dragon 626 doesn't have the same image processing prowess as its 800 series betters, so although the camera in the Z2 Play is very capable in terms of hardware, its performance fades rapidly once the sun goes down. (crowd chatters) (children chatter) So I wouldn't call the Z2 Play my first choice when it comes to phone cameras, but as you know if you follow me on Facebook or Instagram, I rarely post a photo without tweaking it a little first. And this camera usually gives me a good enough starting point for that. The front-facing camera has a flash next to it which is handy for those tricky backlit selfies. Also, for reasons I'll make plain at the end, I put the Z2 Play camera up against the OnePlus Fives, and I was surprised how well it kept up in side-by-side shooting. It wasn't the slam dunk I expected and here too, Motorola sneaks in some of its signature conveniences, a full manual mode and a built-in barcode scanner that usually works. A couple seconds for the loose ends here. Nothing to complain about on call quality or network performance. The display, while only full HD, is vibrant with a wide brightness range and night mode, and yes, there's a headphone jack even on this super-slim chasse. Some letdowns too, though. Even though Motorola calls it a Turbo Charger, the 15-watt adaptor in the box is anything but. You'll need to budget two hours to go from dead to 100%. Also the casing is only treated for splashes. It's not truly water resistant. And under Lenovo, Motorola's track record for timely Android updates is bad. Don't buy this phone expecting new software on the regular. Whether the Z2 Play will be worth it for you comes down to where you get it. Verizon Wireless is the exclusive U.S. carrier partner and if you're buying it to use on big red's network, it'll cost just over 400 bucks for the phone. Early buyers also get the new Sound Boost Two Mod for free. For that price, I'm gonna say yeah. The phone is totally worth it. But when it debuts in unlocked form later this summer, Motorola's planning to charge about a hundred bucks more. That doesn't sound like a big bump but it has the effect of putting it up against the excellent OnePlus Five, which offers much more compelling specs and the LG G6, which brings a much more versatile set of cameras. So at the price Verizon's asking, I say go for it. But if you're planning to buy the Z2 Play unlocked, well I'd hold out either for a discount or to see if there's a more forceful Motorola offering later in the year. Don't forget to check out that Moto Mods video if you wanna see how those modular stick-ons work and don't miss the next video. There are two landing every week on the Mr. Mobile YouTube channel. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Moto Mods",
        "Play",
        "phone",
        "Motorola",
        "Moto Mods video",
        "Moto",
        "smartphone with legendary",
        "camera",
        "Mods",
        "Turbo Power Mod",
        "legendary battery life",
        "Mod",
        "Play camera",
        "battery",
        "big",
        "Fourth of July",
        "video",
        "legendary battery",
        "Mods video",
        "phone cameras"
    ],
    "transcript_entity_values": [
        "Lenovo",
        "eight",
        "the G5 Plus",
        "last year's",
        "Instagram",
        "20%",
        "the end of",
        "15%",
        "Verizon",
        "Moto Z Play",
        "Turbo Power Mod",
        "later in the year",
        "Android 7.1",
        "every week",
        "an hour",
        "G6",
        "YouTube",
        "Fourth of July",
        "Facebook",
        "Moto Display",
        "Moto",
        "Verizon Wireless",
        "about a hundred bucks",
        "Mobile",
        "OnePlus Fives",
        "Motorola",
        "Last year's",
        "Google Maps",
        "35%",
        "first",
        "800",
        "Turbo Charger",
        "jack",
        "the Z2 Play",
        "U.S.",
        "two",
        "Moto Mods",
        "OnePlus Five",
        "A couple seconds",
        "15-watt",
        "100%",
        "six",
        "second",
        "til the end",
        "Fourth",
        "LG",
        "80 bucks",
        "Mobile YouTube",
        "two hours",
        "14 hours",
        "a minute",
        "the Z Play",
        "just over 400 bucks",
        "16-hour",
        "Two",
        "July",
        "later this summer",
        "one",
        "Android",
        "80%"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "PERCENT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "LOC",
        "PERCENT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "TIME",
        "TIME",
        "TIME",
        "PRODUCT",
        "MONEY",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT"
    ]
}