{
    "id": "5pZbVks7J_0",
    "title": "Fix the Steam Deck's Biggest Problem!",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2022-09-27T17:13:01Z",
    "video_url": "https://www.youtube.com/watch?v=5pZbVks7J_0",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "steam deck",
        "valve steam deck",
        "steam deck oled",
        "steam deck screen",
        "steam deck upgrade",
        "steam deck mods",
        "steam deck 2",
        "oled screen",
        "ar glasses",
        "augmented reality",
        "nebula",
        "ar",
        "vr",
        "ios ar",
        "apple ar glasses",
        "apple ar",
        "apple vr",
        "steam",
        "steamdeck",
        "virtual reality glasses",
        "oculus"
    ],
    "views": 253623,
    "likes": 7762,
    "comments_count": 956,
    "description": "The Steam Deck is amazing, but the screen isn't cutting it in 2022. This accessory fixes it. Purchase Nreal Air on Amazon and get a free gift -   Follow Snazzy Labs on Twitter -  Follow me on Instagram -   The Valve Steam Deck is a lot of people's first Linux device. When it first hit the scene in early 2022, gamers went wild for a handheld without platform lockout and with access to a large portion of Steam Libraries everywhere. The Proton compatibility layer enabling Direct3D games to run on Linux opened up a world of opportunities, fiddling, modding, and more. No group of users are more enthusiastic than Deck owners and while I've been loving mine, I can't help but hate the display. I upgraded my base screen to the 512GB anti-reflective display but that didn't do it for me either. It lacked contrast, dynamic range, luminence, and more. Returning to my Nintendo Switch OLED, colors seemed more vibrant, highlights popped, and more. Until we get a Deck OLED upgrade, there's another way you can bring amazing quality displays to the Steam Deckand that's with the Nreal Air.  This video is sponsored by Nreal.",
    "description_links": [
        "https://amzn.to/3DW3cHt",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "Hey, just a heads up: this video is sponsored by Nreal; however, they did not provide editorial input on this video. Everything youll hear today are my opinions and mine alone. I love the Steam Decklike truly, I love it. Its one of the geekiest gadgets to come out in recent years. The fact that you can run games written for DirectX through a compatibility layer on a non-native operating system better than you could on Windows, portably, is mind boggling. My time for games is very limited, but the Deck makes it so easy to pickup and play if even for just a few minutes. Theres really only one major complaint I have with itand thats the display. I understand that Valve had a price target they needed to hit, but Ive recently been playing Splatoon 3 on my Nintendo Switch OLED and its just so much better. The colors are way more vibrant and while peak luminance is similar, the massively improved dynamic range puts the Switch OLEDs display in a whole different league. The Decks lousy screen is fine for little gaming spurts, but when I want to mash out a longer play session, Ive been using these: the Nreal Air. In short, these are AR glasses designed to be used primarily with Snapdragon 888 Android phones, but can also be used with iOS devices, the Steam Deck, or any HDMI-capable device. Heres how they work. The top of each lens houses a Sony OLED microdisplay with a 1920x1080 resolution. Now at first glance, this doesnt seem quite as high resolution as, say, the Oculus Quest 2; BUT if youve ever put on a pair of VR goggles, youve most certainly noticed the screen door effect, so called because you can actually the grid lines in between the individual rows of pixels. The fix is to either: decrease the field of view, increase the density of pixels, or do both. The human eye cant perceive beyond about 55-60 pixels per degree but VR headsets arent even close to that number. The Oculus, pardon me Zucky-boy, the Meta Quest 2 is one of the densest VR headsets on the market at a mere 21 PPD. Not great. The Nreal Air, however, clocks in at an incredible 49PPD meaning that not only do you have to focus really hard to see a screen door effect, but the glasses have a higher perceived sharpness and resolution than any VR headset ever made. How? Well, the displays in the Nreal Air are TINYjust 1.8cm diagonalso the pixel density is huge. Furthermore, because of the reflective prisms that allow you to see through the glasses into the real world, your eyeballs minimum focus distance is tricked. Its a really clever solution to a very real technical problem. This does mean that the FOV is narrower than a VR headset, but at 46 degrees, its still very respectable and you can achieve an up to 201 equivalent display from 9 feet away. And the displays are GORGEOUS. They are insanely sharp and bright at an effective focus-luminance of 400 nits making them usable even outdoors. Of course, your contrast ratio will be dependent on ambient lighting conditions since these are AR glasses, but in a dark room or with the included light shield you can achieve a bananas 100,000:1 contrast ratio. Well come back to the experience wearing these, but lets talk a little more about the glasses themselves. Youre certainly still going to get double takes while wearing these from people walking close to you, but theyre not as socially ostentatious as your average HMD would be in public. They mostly look like normal sunglassesdare I even say fashionable ones. More importantly though for a product like this, theyre comfortable. Those that struggle with PWM flickering from most OLED displays will be pleased to hear that the Nreal Air are the first AR glasses to obtain flicker-free certification from German testing firm TUV (tuhf) Rheinland. And physical comfort is enhanced thanks to flexible temple hinges, an adjustable rake system to change lens pitch, moldable nose pads to modify nasal bridge positioning, and their light 79g weight. Theyre absolutely heavier than your average pair of glasses and I found that the ear hooks struggled to reach on my big ol noggin, but despite that, I could still wear them for about an hour and a half before I needed a break. To reduce weight, the Nreal Air dont have internal batteriesthey receive power from your device over a USB-C cable that stealthily exits the left temple tip. You plug into your intended device and youre ready to go. Its impossible to capture the sharpness, color, and immersion of the Nreal Air with a mere camera, but I want to try my best the headset is at its most capable when attached to a Snapdragon 888 Android phone running the Nreal Nebula mixed reality environment. The headset has 3 degrees of freedom for head tracking and using your phone as a gyroscopic remote, you can utilize their AR space to browse the web, play an extremely limited selection of AR games, work out with their AR cycling app, and AirCast your phones display. Its neat, and Nreal says theyre committed to bringing new content into the future, but as it stands today, theres just a lack of app support and with limited input controls, it mostly just feels like a slightly gimmicky, content-deficient Oculus Quest forcing itself to live in the real world. I think that Nebula is better suited for their more expensive, more powerful Nreal Light and that the Nreal Air is at its best when its in mirror mode. This, in short, turns your glasses into a static, massive, 130-equivalent 16:9 display. On devices that support USB-C like the Steam Deck, you plug the headset in, the Decks display shuts off to preserve battery, and you get the most gorgeous projection right in front of your eyes. Even with a thesaurus, I cant come up with words to describe how mind-blowing the screen looks and thats not a platitude. Im not being paid to praise the screen. My opinion is that it's GLORIOUS. The environment is vibrant, sharp, and HUGE. Playing Cuphead on my Steam Deck, the hand-drawn characters spring to life with depth and definition not seen on the Decks LCD. The response time is even better than the built-in display with more precise input realization, and because the displays are tiny, they draw significantly less power than the built-in screen and Ive actually seen play time increase on my Decks battery as a result of using them. My sole complaint is that because all of the processing and output is done by the host device, you can only get head-tracking on Android. On the Deck, the display is fixed in front of your eyes. Nreal appears to be really active with their community and theyve acknowledged the demand for head tracking on the Deckeven alluding to it being a work in progress. It's already a fantastic accessory for the Deck, but having 3 degrees of freedom would make it a must-own companion device. I was very skeptical when Nreal reached out and as with all sponsored content, I require time to use and like the product before I move forward with agreeing to do a video. I did not expect to like these as much as I did. Theyre so good and so portable that I will be traveling with them in the future. Ive been using them to play a game for 30 minutes before bed, heck, I may get a second pair to keep in my car so I can watch YouTube while Im waiting on errands. Im also really excited about the prospect of using them as a Stage Manager display when iPadOS 16 releases. Theyre not cheap at $379, but I also dont think that theyre overpriced and youll be hard-pressed to get a better display for $379not just in glasses form, but period. If the budget can accommodate such a luxury, I think these are PERFECT for dorm-bound students that dont have room for a TV but dont want to watch everything on a laptop or phone. The Nreal Air are available to order using the link below starting today. The first 500 orders will receive a special AR t-shirt for free and by so doing you support Snazzy Labs. I really like these thingslet me know what you think in the comment section down below. Thanks so much for watching, and as always, stay snazzy!",
    "transcript_keywords": [
        "Nreal Air",
        "Nreal",
        "Steam Deck",
        "Air",
        "display",
        "provide editorial input",
        "Switch OLEDs display",
        "Deck",
        "glasses",
        "provide editorial",
        "Nintendo Switch OLED",
        "Decks",
        "Oculus Quest",
        "Decks display",
        "screen",
        "Decks display shuts",
        "displays",
        "Steam",
        "headset",
        "Nreal Nebula"
    ],
    "transcript_entity_values": [
        "Deckeven",
        "recent years",
        "TINYjust 1.8cm",
        "just a few minutes",
        "Deck",
        "100,000:1",
        "TUV",
        "VR",
        "PWM",
        "Android",
        "the Steam Deck",
        "79",
        "Zucky",
        "201",
        "Sony",
        "379not",
        "Splatoon 3",
        "400",
        "Nebula",
        "9 feet",
        "Nreal",
        "Switch",
        "Snazzy Labs",
        "Nreal",
        "1920x1080",
        "YouTube",
        "about an hour and a half",
        "Quest 2",
        "500",
        "today",
        "FOV",
        "Snapdragon 888 Android",
        "Nintendo Switch",
        "46 degrees",
        "3 degrees",
        "Nreal Nebula",
        "The Nreal Air",
        "30 minutes",
        "the Nreal Air",
        "the Nreal Air",
        "first",
        "one",
        "130",
        "Windows",
        "German",
        "about 55-60",
        "16",
        "49PPD",
        "USB-C",
        "21",
        "second",
        "Oculus",
        "Valve",
        "379",
        "DirectX",
        "Nreal Light"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "MONEY",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "FAC"
    ]
}