{
    "id": "5qL_QfYdc48",
    "title": "Google Home Hub hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-09T18:22:42Z",
    "video_url": "https://www.youtube.com/watch?v=5qL_QfYdc48",
    "category": "Science & Technology",
    "tags": [
        "google",
        "home hub",
        "pixel",
        "pixel home hub",
        "google home",
        "google home hub",
        "google assistant",
        "echo show",
        "amazon echo show",
        "google pixel",
        "pixel 3",
        "google pixel 3",
        "pixel 3 xl",
        "google event",
        "google phone",
        "google pixel 2",
        "google io",
        "smart home",
        "event",
        "io",
        "hands on",
        "first look",
        "price",
        "new phones",
        "technology",
        "smartphone",
        "gadgets",
        "gadget",
        "tech",
        "new tech",
        "is it worth it",
        "specs",
        "processor",
        "review",
        "latest updates",
        "apple",
        "android",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 318202,
    "likes": 2329,
    "comments_count": 202,
    "description": "Google has announced its Google Assistant-powered Home Hub. We spent some time with it, and its much smaller than you would expect from the 7-inch display size. It looks like nothing more than a tiny floating tablet on a cloth-covered stand. That display has something called Ambient EQ, which automatically adjusts to the light in the room to look more natural.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey guys, it's Nilay from The Verge. I'm here with the new Google Home Hub. It's a new Google Home product. It's got the seven-inch display on the front. First thing I'm gonna tell you is, it's really small. It's a seven-inch display, but its a lot smaller than you would expect. It comes in four colors. White, black, pink, this really cool blue that I've got here. It's really cute, its got front (mumbles) speakers. If you just tap on it, you'll see there's not really an interface or a home screen, it's just a list of actions you can take, and you can obviously talk to Google Assistant. The big feature is that if you swipe down, you get the control center for your home. It's called Home View. You can just go into rooms. I can turn the lights off in here. I can tap in the rooms. Here we are in the bedroom. I can swipe back, swipe that again. I can pick the lights. It's integrated with the hue lights in this room, so I can set the brightness, I can change the color. If your using a different kind of lights like LIFX lights, it would actually show you all the color options this all just gets set up in the Google Home app. But this is kind of the big feature, is this home view, where you can control your entire smart home in here. There's a Nest thermostat over there, I can obviously screw with that. I can also, obviously, it's Google Assistant. I can just cast videos using it, so I can say, hey, Google, play the Pixel 2 review from The Verge on the bedroom TV. - [Google Assistant] All right, playing the Pixel 2 review from The Verge from YouTube on bedroom TV. - [Narrator On TV] Whoa, look at that. - Great. Obviously, a big problem with smart speakers, is discoverability. So if you just swipe over, you can see, explore more things for your assistant to do. This is pretty neat the Echo Show and other smart displays like this don't really do this. So you can say \"control lighting,\" you can tap on it, it will show you all the things you can say, but then you can also just hit the button and do it. So you get kind of a touch interface for your home, and other things Google Assistant can do. The Google Home Hub also has something called Ambient EQ. Which is basically a light sensor. You can see here, we have a print photo on the left, we have the Home Hub on the right. As the light changes color you can see the display on the Home Hub changes to look exactly like the print photo reflecting the light. That's pretty cool, it's pretty similar to other ambient light technologies we've seen, particularly on the iPhone with TruTone, but here its called Ambient EQ, it's on the Google Home Hub. Two other things I can't show you, one because it's actually not here. There's no camera on the Home Hub. Google says they didn't add a camera because they want you to be able to put it in your bedroom and other private areas without worrying about it. That's a big decision. It's very different than the Echo Show or the Facebook Portal that just came out. There's also parental controls which I can't show you because you have to set them up in the app, but you can lock this out, you can set up do not disturb, and there is a mode, where it won't even respond to you during downtime, which is pretty cool. The Home Hub can also integrate with video doorbells. Here when you ring the Nest doorbell, you can see the video pop up on the Home Hub right away, and you can also talk back to the person waiting at your door. Google Home Hub is $149, a super aggressive price, a great price actually. It comes out October 27 at retail. You can pre-order it right now.",
    "transcript_keywords": [
        "Google Home Hub",
        "Home Hub",
        "Google Home",
        "Home",
        "Google",
        "Hub",
        "Google Assistant",
        "Google Home product",
        "Home Hub changes",
        "Google Home app",
        "Home View",
        "show",
        "Nilay",
        "things Google Assistant",
        "lights",
        "Assistant",
        "light",
        "Echo Show",
        "Verge",
        "called Home View"
    ],
    "transcript_entity_values": [
        "Google Home",
        "149",
        "four",
        "Google Home Hub",
        "The Verge on the bedroom TV",
        "The Google Home Hub",
        "LIFX",
        "Google",
        "Home View",
        "Nest",
        "the Google Home Hub",
        "the Echo Show",
        "the Home Hub",
        "Nilay",
        "October 27",
        "Pixel 2",
        "Two",
        "the Facebook Portal",
        "YouTube",
        "The Home Hub",
        "iPhone",
        "Ambient EQ",
        "seven-inch",
        "The Verge",
        "First"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "LOC",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL"
    ]
}