{
    "id": "5qXUy5EQb1c",
    "title": "The Best Wireless Earphones Under $70 - Bullets Wireless",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-05-18T17:24:17Z",
    "video_url": "https://www.youtube.com/watch?v=5qXUy5EQb1c",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "bullets wireless",
        "beatsX",
        "beats",
        "one plus",
        "oneplus",
        "one",
        "plus",
        "op6",
        "one plus 6",
        "oneplus 6",
        "best earphones",
        "best wireless earphones",
        "best budget earphones",
        "best wireless earphones for the gym",
        "best wireless earphone for working out",
        "best headphones",
        "best wireless headphones",
        "best headphones for exercise",
        "gym",
        "working out",
        "running"
    ],
    "views": 654205,
    "likes": 16844,
    "comments_count": 1090,
    "description": "My review of the OnePlus $70 Bullets Wireless Earphones. Available at OnePlus -  The previous Champ  -   OnePlus Bullets Wireless brings an excellent set of wireless earphones onto the market at an affordable $70 price. With AptX support, magnetic controls and a big battery where 10 minutes of charge gives you up to 5 hours of use.  Music Credits: Fili - Splash  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://goo.gl/LG6X1z",
        "https://amzn.to/2LezqjA",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2d here So these are some new wireless earphones from oneplus the bullets wireless and the short and sweet of it Is this they are amazing headphones for the price for 70 bucks. They are literally the best wireless earphones I've used and right off the rip. The unboxing experience isn't amazing I've seen better but product packaging isn't what I'm here for, right? So the build quality, it's really good for the price. The buds themselves are milled aluminum They're lightweight, but they feel solid the cabling feels kind of average I would have liked like a flat ribbon cable those tend to wear better over time But the overall build quality is good it also comes with three ear hooks and three ear tips the Medium-sized like the one that comes installed right off the factory fit me very comfortably particularly the hooks They just fit my ear really well. The sound quality is also quite good and is this something that's difficult to showcase in a video and there's obviously some subjectivity to this but I think for most people they'll enjoy the sound quality from this particularly if your device supports AptX you get crisp trouble and very good bass not like earth-shattering bass, but for $70 these sound deeper than I thought They would go now There's a marketing term that oneplus is throwing around for these bullets Wireless called energy tubes and those are supposed to be structures built into these earphones that help to reduce the auto Distortion and Like I don't know how much the energy tubes actually play a role in it They sound clean very clean, but I don't know are those energy tubes actually doing anything? I can't tell you but it is a pretty cool sounding term. Okay battery life on these are great So ten minutes of charging gets you like 65% of battery full top off takes around 30 minutes Maybe a little bit less and this is what the regular charger You don't need the - charger or anything like that to get those numbers and battery life. I'm getting around 7 half hours So this is with the volume at around 60% if you're going running and need to crank it up if you're in like high traffic Or something like that. It's gonna be reduced but the eight hours estimated battery life I'd say is reasonably accurate and I really like the USBC charging. It just brings you one step closer to being free of microUSB, which I'm pretty sick of in 2018 Ok, other features the button like the play/pause button if you long press it It'll launch Google assistant and I thought it would be cool But there's too much of a delay like when you press it It takes about a second maybe a second half before you'll actually hear that tone so it's cool and usable if you need but I wouldn't consider to be like a game changer or anything and if you're connected to an iPhone it will Launch Siri instead of the Google assistant. So, the microphone is good. I made a few calls with it And everyone said it sounded clean it might even sound better than your phone's built-in mic depending on the phone that you have The earbuds are magnetic and the magnetic interaction between the two sides can pause and unpause music It'll pause music on any phone like pixel two XL, iPhone 10 doesn't matter where you're using if those buds snap together, it'll pause the music but resuming music is different It does need to be the one plus five or the one plus six and it may not sound like a killer feature But it's just something that I really enjoy the ability to just pause your music when you clip your earbuds together so, I like these wireless earphones way better than I thought it would and I actually liked them better than Basically any other wireless earphones that I've used so I like them more than the jaybird freedoms I like them more than my previous top pick the Plantronics backbeat fit and I definitely liked them more than the beats X from Apple So the beats X wireless earphones have a lot in common with the bullets wireless earphone So I'm just gonna be straight up I think that one plus ripped-off This design from the beats x to the point where just there's so much similarity in function and design to the control mechanism That being said these are $100. These are $70 like the bullets Wireless are cheaper, but these are better in every conceivable way. It's got better build quality It's got the magnetic pause. It doesn't require a proprietary lightning cable It just doesn't have a pretty box when you unbox it and it also only comes in this black and red color where as the beats X comes in a whole bunch of colors so the price is what is probably the most attractive thing about the bullets Wireless for $70 or getting a product that is comparable to devices that are double the price if not more and the main thing is I'm not seeing any $70 wireless earphones that are better than These so there are so a few things that I don't love about it I wish the charging port was covered like when you're running and you're sweating that port is just Exposed so I don't know how that'll hold up over time. The other thing I don't love is the storage pouch like it's cool It's soft rubber and it's got a magnetic closing system, but I just find it difficult to stuff everything in there I feel like I'm just like bending things in ways that they shouldn't be bent and sometimes a magnet snap together where you kind of Don't want them to the other thing is availability So every other earphone that I've mentioned in this video is readily available on Amazon for basically Next Day Delivery The bullet's Wireless is only available from oneplus So it's not as readily available or easily returned if you don't end up liking them, but those negatives aside I feel like these are really, really good earphones for the money put it this way I've been using these the backbeat fit as my go-to earphones for like three three and a half years And I've always been looking for something to replace them I've tried so many things always go back to these but I finally found something that actually liked more than the backbeat fit and There's $70 instead of like 120 bucks. Okay. Hope you guys enjoyed this video, thumbs if you liked it, subs if you loved it See you guys next time",
    "transcript_keywords": [
        "wireless earphones",
        "bullets wireless",
        "wireless",
        "bullets wireless earphone",
        "earphones",
        "short and sweet",
        "build quality",
        "good",
        "sound",
        "quality",
        "pause",
        "Dave",
        "sound quality",
        "bullets",
        "amazing headphones",
        "bullets Wireless called",
        "price",
        "fit",
        "energy tubes",
        "good earphones"
    ],
    "transcript_entity_values": [
        "Next Day",
        "Siri",
        "six",
        "three",
        "65%",
        "120 bucks",
        "Dave",
        "iPhone 10",
        "around 30 minutes Maybe",
        "around 60%",
        "100",
        "XL",
        "one",
        "70 bucks",
        "Apple",
        "USBC",
        "half",
        "second",
        "iPhone",
        "ten minutes",
        "Google",
        "Plantronics",
        "2018",
        "Amazon",
        "two",
        "microUSB",
        "five",
        "70",
        "Wireless",
        "around 7 half hours",
        "the eight hours"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "PERSON",
        "ORG",
        "TIME",
        "PERCENT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "TIME",
        "TIME"
    ]
}