{
    "id": "5rHJUxKCamo",
    "title": "Galaxy Note 9 review: worth the price?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-17T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=5rHJUxKCamo",
    "category": "Science & Technology",
    "tags": [
        "note 9",
        "galaxy note 9",
        "samsung galaxy note 9",
        "note 9 samsung",
        "note 9 review",
        "samsung",
        "samsung galaxy note 9 review",
        "samsung galaxy",
        "note 9 battery",
        "note 9 camera",
        "samsung galaxy note",
        "note 9 official",
        "note 8",
        "galaxy note 9 unboxing",
        "note 9 unboxing",
        "unboxing",
        "samsung galaxy note 9 official",
        "review",
        "hands-on",
        "first look",
        "phone",
        "smartphone",
        "smartphones",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 530848,
    "likes": 6986,
    "comments_count": 822,
    "description": "Samsung's Galaxy Note line of phones is all about more: more specs, more power, more battery, more speed, more screen. The new Note 9 has more of everything, it's the most packed Note phone yet. But at the same time, it's the most expensive and biggest Note phone yet, so you really need to want the most to make the Note 9 worth it.  Subscribe:   Here's a link to buy the Galaxy Note 9:   Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2S5Kthn",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(percussive, exciting music) - Samsung's Galaxy Note phones have always been about more. More screen, more battery, more specs, more power, more features. And the new Note 9 is the most more of them all. It has the biggest screen, the fastest processor, the biggest battery, the most storage, and the most features of any Note phone. And it also has the biggest price. This thing costs $1,000 and up, and it's way more than any prior mainstream Samsung phone. So is all of this more stuff worth it? Well, if you're a Note fan, or someone that's owned a prior model, yeah, totally. This is the device you've been asking for and wanting. You don't even really need me to tell you that. You probably already know you want this thing. But for the rest of us, it's a much tougher sell, especially since Samsung's other big phone this year, the Samsung Galaxy S9+, can be had for hundreds of dollars less and offer many of the same features. (chill music) The Note 9 doesn't look much different from last year's Note 8. It has the same basic design of the past few Note models. There's lots of screen, curved glass on the front and back, and a metal frame. This time there's a 6.4-inch screen, which is just barely, basically indistinguishably bigger than the screen on the Note 8. But in a cool twist, the Note 9 isn't really bigger as a phone. It's still the same size as the Note 8, though it's still a massive phone. And then the other thing is, Samsung moved the fingerprint scanner on the back to a much easier position to reach, so it is easier to hold. Now I don't really have much to say about the Note 9's display. It's just like the S9+. It's a big, bright, colorful LED screen that's about the best you can get in the smartphone world right now. And if you hate the trend of notches that cut into the screen, the Note 9's 18x9 panel has no notch whatsoever. Now, in terms of performance and specs, the Note 9 is basically the same as the S9+. It has the same Qualcomm Snapdragon 845 processor that every other Android flagship phone is using this year, and it's paired with six or eight gigabytes of RAM. Now the Note 9's performance is smooth and fast. Never did I really run into an issue where there was choppy performance or lag or even an app not being ready for me as soon as I expected it. Now one of the more things that you get with the Note is more storage. The base model has 128 gigabytes, but you can get one with up to 512 gigabytes if you're okay with spending 1,250 bucks for it. Either of those models also have a Micro SD card slot, so you can max this thing out with up to one terabyte of storage if you really want to. But the most more that you get with the Note 9 is more battery. Samsung put a 4,000-milliamp hour battery in this phone. That's 500 milliamp hours more than the S9+ and a full 700 more milliamp hours more than the Note 8. That really makes it an all-day device, even if you're a really heavy user that's always looking at your phone. And if you're not as heavy as a user, you might even get two or three days of use without much trouble. And of course, because this is a Note phone, the other difference between it and every other Samsung phone is its S Pen stylus. Now the S Pen has been around for years and it can be used for all the same things that you did before. You can jot down notes or doodle, or just use it to navigate the interface. But this year, it's got a couple more tricks. It has Bluetooth added to it, so you can use it as a wireless remote to snap photos, pause music, or page through a presentation. Now, personally, that really doesn't make the S Pen all that much more usable to me, but for you, you probably already know whether the S Pen is something you're interested in using at this point or not. Note 9's camera is also exactly the same as what we saw in the S9+ earlier this year. The rear camera has a dual 12-megapixel system with a switching aperture, wide-angle lens, plus a telephoto lens for portrait effects. And then then front camera has eight megapixels and auto-focus. Now the pictures that the Note 9 produces are therefore very similar to what you get from the S9. They're sharp and colorful, and low-light performance is great. But they still look like Samsung photos, so they're gonna be warmer and brighter than what you get from a Pixel or an iPhone. So if you didn't like the way that Samsung photos looked before, you probably won't like the Note 9's either. One thing that's new in the camera app is it's a bit smarter. It has an automatic scene optimization system that of course uses AI to determine what you're taking a picture of and then change the camera settings for the best results. There's like 20 different things it can recognize, and it's pretty neat to watch it do it. But if I'm really being honest, I didn't notice much of a difference between the optimized ones and the non-optimized ones. The one thing that is new and useful is it can tell if someone that you're taking a photo of has blinked or moved and the image is kinda ruined, and it will alert you to take that photo again. That's something that's actually useful when it shows up. For software, the Note 9 is running Android 8.1 Oreo, and it's got Samsung's user interface on top of it. It's not really changed much from what we've seen from the past few years from Samsung. It looks fine, but the biggest issue is and always has been Samsung's insistence on duplicating a bunch of Google's apps with its own. There's two browsers, two email apps, two mobile payment apps, two gallery apps, two assistants, and so on. And of course, Samsung's really bad with software updates. I have no idea when this is getting Android 9 Pie. And then there's Bixby, Samsung's universally panned virtual assistant, which has been updated with a new interface and some deeper integrations with third-party services. But it's still Bixby, which means that it's slow and more cumbersome to use than Google's assistant, and of course, there's a dedicated button on the side of the Note 9 that can't be used for anything else. Now, the version of Bixby that's on my review unit is said to be non-final, so it may be updated before it hits stores, but I honestly don't think it's gonna make much of a difference. It's clear that Samsung's invested some time into this, though, and Bixby's not going anywhere. And finally, we have DeX, Samsung's attempt to make your phone work as a computer. And it's easier to get DeX up and running with the Note 9. You basically just need a USB-C to HDMI adapter. But it's still just as clumsy to use as it was a year or so ago when DeX first came out. It's slow, it's limited, there's many apps that are still incompatible with it. And to really make this work, you need a keyboard, mouse, and display to do it all, which at that point, you might as well just use a laptop. So there's the Note 9. It's the most more phone from the line of phones that always gives you more than others. And it's really a great phone. There's very little to complain about here. If you need more screen, more storage, and more battery life, you can't go wrong, so long as you're willing to spend more to get those things. But Samsung's own Galaxy S9+ offers a lot of the same features as the Note 9 for a lot less money, which means that you really have to want the most for the Note 9 to make sense. That's 500 milliamp hours more than the S9+ battery, and a full 700 milliamp hours more than the Note 8's. That makes the Note 9 a real all-day device, even if you're a heavy user (cicadas buzzing) that's been listening to crickets all day long. - [Man] (laughing) It kept getting louder. - [Woman] They came in high.",
    "transcript_keywords": [
        "Note",
        "Samsung Galaxy Note",
        "Samsung",
        "Galaxy Note phones",
        "Note phone",
        "phone",
        "Samsung Galaxy",
        "Samsung phone",
        "Galaxy Note",
        "screen",
        "thing",
        "year Note",
        "Samsung photos",
        "year",
        "Note models",
        "battery",
        "Pen",
        "mainstream Samsung phone",
        "Bixby",
        "things"
    ],
    "transcript_entity_values": [
        "DeX",
        "Android",
        "Snapdragon 845",
        "Samsung Galaxy S9+",
        "one",
        "third",
        "1,250 bucks",
        "Bixby",
        "AI",
        "Bixby",
        "S Pen",
        "Google",
        "eight megapixels",
        "128 gigabytes",
        "12-megapixel",
        "the S Pen",
        "700 milliamp hours",
        "years",
        "20",
        "Qualcomm",
        "6.4-inch",
        "Samsung",
        "up to one terabyte",
        "hundreds of dollars",
        "18x9",
        "two",
        "1,000",
        "One",
        "Micro SD",
        "Galaxy Note",
        "9",
        "the past few years",
        "this year",
        "Bluetooth",
        "S9",
        "700 more milliamp hours",
        "the S Pen",
        "512 gigabytes",
        "six or eight gigabytes",
        "iPhone",
        "two or three days",
        "Galaxy S9+",
        "last year's",
        "RAM",
        "4,000-milliamp hour",
        "max",
        "a year or so ago",
        "500 milliamp hours",
        "earlier this year"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "EVENT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "WORK_OF_ART",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "DATE"
    ]
}