{
    "id": "5roFfKoqX50",
    "title": "You're Too POOR For These",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-02-22T19:17:04Z",
    "video_url": "https://www.youtube.com/watch?v=5roFfKoqX50",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 137778,
    "likes": 4704,
    "comments_count": 137,
    "description": "Why do people buy these?! Razer, WHAT Have You Done?!  The WORST Tech of 2023:  Apple Doesn't Want YOUR Money - iPhone 15:  Amazon's WORST PC Scams:  TikTok Made Me Buy It...AGAIN:   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Lynaugh  Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:15 A Fire Extinguisher () 0:57 A Brick 1:38 Some Toilet Paper 2:25 A Coat Hanger 3:05 A Crowbar 3:40 Someones Piss 4:25 Fleshy Crocs 5:15 Big Feet () 5:55 A zip tie 6:22 A Binder Clip 6:45 A Fishing Lure 7:38 A Disposable Camera 8:15 Some Flip-flops 8:42 A Cookie Jar 9:04 A Plastic Cup 9:30 A F#$ked Up Bear 9:47 Toy Story Bears 10:32 Someones Tears 11:15 Who won?",
    "description_links": [
        "https://youtu.be/4xL41svihM8",
        "https://youtu.be/mx-NtfD4E4M",
        "https://youtu.be/1HIN4OecBtQ",
        "https://youtu.be/XcAPWNMh8ukvv",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- [Matt] Hello and welcome to \"This is\"; are you a hypebeast? - [Austin] Yeah! - [Crew Member] We are. - [Austin] I'm Supreme'd up. - [Matt] But what we're gonna do is we're gonna look at some hypebeast nonsense today, and we're gonna try and guess how much these are selling for and be completely wrong about it. Let's see the first item. A Supreme fire extinguisher. - [Austin] As you're probably aware, Supreme has slapped their logo on about everything under the sun. There was a time that I know that Supreme really were able to charge an incredible premium for a lot of these things. Remember the Supreme brick? - [Matt] Yep. So it's a collaboration between Supreme and Kidde. - [Austin] Okay wait, can we not use the word collaboration? - [Matt] It is. - [Austin] They slapped the logo on his fire extinguisher. That's not really a collaboration. - [Matt] Okay, I'm going with $420. - [Austin] Ha! That's a pretty good guess, actually. Yeah. Actually, I'm gonna say $690 then. - [Both] $900! (laughter) - [Matt] And $23 shipping. - [Austin] That's a lot of money. - [Matt] How are we gonna? - [Austin] Whoever gets closest. I think it's whoever gets closest, which means that, that would be 1 point for monsieur Austin. - [Matt] Supreme Brick with box. - [Austin] If I go to buy one brick, what do you think it costs? - [Matt] Maybe like five bucks. - [Austin] No. - [Matt] I have no idea. - [Austin] Think about how many bricks you need for like a building or something. For context this brick should normally cost less than a dollar, right? This was not insanely expensive at sort of retail, right? Like it was really like the aftermarket where I think the price shot up. I'm going to say $750. - [Matt] Because of everything you just said, I'm going to go way higher. - [Austin] No you shouldn't. - [Matt] Because I think this is one of the early ones so the value has just continued to go up. - [Austin] Okay. Okay. Sure. Fair enough. - [Matt] So I'm gonna go 1,200 bucks. - [Austin] Okay. 350! Score for Austin. - [Matt] I have a feeling I'm not gonna do well in this game. - [Austin] It's because you're not a man of culture. - [Matt] No, I'm not. - [Austin] Do you not know of Bathing Ape? Are you familiar with this? - [Matt] No. - [Austin] You've heard of Bathing Ape? - [Matt] What is this? - [Austin] So a Bathing Ape is one of these sort of hypebeast brands. They've done a number of collaborations. On one side, I could argue that this is going to be fairly cheap because it's toilet paper, but on the other side going all the way back to 2007 feels like it's a little bit more of a retro vintage kind of thing. That being said, I don't think this is gonna be wild. It could be, but I'm gonna just say that this is $150. - [Matt] All right, I'm gonna be really conservative on this. Even though we've gone through a bathroom pandemic, I'm gonna go $57. - [Austin] You're going lower. I think this could be in the thousands of dollars. That's my fear. - [Matt] You realize that I'm just blindly throwing in the dark. - [Both] $80! - [Austin] Wow! All right, point to Matt. - [Matt] All right. - [Austin] Oh, Bape again. - [Matt] All right, so a (Minecraft oof) ape. - [Austin] Stop! A hanger is lame, like a hangar? Kenzie's like luring us with a false sense of security here. She about to drop like some 10 grand items on us and we'll be like, \"Oh, (Minecraft oof).\" Would you like to go first? - [Matt] I'm gonna say this is $88. - [Austin] Okay. - [Matt] And it has nothing to do with the $88 I just saw in the last one. - [Austin] You're $88? - [Matt] I'm $88. - [Austin] I'm gonna say $135. 135, 135, that's my guess. I'm not feeling confident. - [Both] Oh! - [Austin] And it was originally $88! - [Matt] With 10% off coupon. - [Austin] That mean we're two and two right now? - [Matt] We're two and two. I'm back in it, baby! What? - [Austin] The supreme crowbar. - [Matt] It's scientifically proven that the best item in a zombie apocalypse is a crowbar. (crowbar banging) You can stab, you can hit. - [Austin] Wait Matt, you should go first. You were the winner of the last one. - [Matt] Okay. This one I'm going pretty high on. - [Austin] I agree with that. - [Matt] I'm just saying $700 bucks. - [Austin] Ooh, okay. It's a little higher than I was gonna think, but I agree. This is like out of all items we've seen so far, not that I would ever actually buy this (Minecraft oof) because It's dumb. But this is actually kind of cool. I'm gonna guess, $450. - [Both] Oh! - [Austin] Score! $380! High five, we're pretty good at this. - [Matt] All right, well I'm not. Rick Owens! 330 Milliliter water bottle, unopened like new. And they say it's the piss of Rick himself. Who must be incredibly well hydrated, for this to be that clear. - [Austin] Rick Owens is an American fashion designer, who looks like this. - [Matt] That's unfortunate. (Austin laughing) - [Austin] The piss of Rick himself is not filling me with any confidence. I'm gonna go low on this. $40, four zero. - [Matt] I am also gonna go lower than I normally would do. - [Austin] 'Cause this is dumb and no would should buy this but yeah. - [Matt] I'm gonna say $75. Playing defensively on this one. - [Austin] Yeah, yeah. - [Both] (laughing) - [Austin] $666 - [Matt] The Devil himself could not be deterred by this Holy Water. - [Austin] Matt, you get the point for this one. I hope you enjoy it. - [Matt] I don't think anyone wins on this one. Oh, no. Oh, no. - [Austin] Crocs and Salehe Bembury. - [Matt] Do you want Crocs that look like maybe it was ground chicken before it became chicky nuggies? - [Austin] I was gonna say gum, that's so much worse, Matt. - [Matt] As a impending crock connoisseur, I say impending because I haven't had the bravery yet to pull the trigger on Croc. - [Austin] They're cool now. I own no Crocs, but I think they're cool. These not so much. You go first this time. You go first. - [Matt] I'm going $600. - [Austin] Ooh, you're high on that. Okay. I was thinking high, but maybe not quite that high. I think you're probably relatively close and maybe a little high. So I'm gonna say $400. $245! Let's go! - [Matt] You want shoes that look like brains after it's been run over by a car? Well I got the shoes for you! - [Austin] It looks like gum to me. It really looks like gum. - [Matt] No! - [Austin] Boy, I wasn't ready for that. I don't know on what earth these are Crocs. They look like just big feet molds. Boy, we're gonna get demonetized for this, I think. I'm not sure why though. - [Crew Member] Matt is rebooting. - [Matt] I don't get it. I don't get it. - [Austin] I actually kind of get it. These are better than the other ones. - [Matt] If I saw you walking into the office with this, you have no idea how hard I would throw you. - [Austin] Well, at least I'd have some cushion to pad my fall. I'm gonna say $750. - [Matt] I was way over on the other; I'm gonna say $350. - [Austin] Okay. $227! - [Matt] Yeah! - [Austin] Wow! - [Matt] How are they cheaper than the brain shoes? - [Austin] Off-White zip tie. It is a real stylistic choice, right? - [Matt] Wanna rock, paper, scissors to see who goes first on this one since we're tied up. - [Austin] Sure, let's do it. - [Both] Rock, paper, scissors, shoot. Rock, paper, scissors, shoot. Rock, paper, scissors, shoot. - [Austin] Ah, you go first. - [Matt] I'm gonna go low on this one. - [Austin] Yeah, I think so too. - [Matt] I'm gonna go $30. - [Austin] Oh, that's too low. Way too low. - [Matt] You're too low. - [Austin] $80 bucks. $60 bucks, let's go. - [Matt] By $10. - [Austin] Off-White, Virgil Abloh signature binder clip. - [Matt] Sticking with my gumption. - [Austin] 'Cause this is, to be fair, a binder clip. - [Matt] I'm gonna say $70. - [Austin] Oh, okay. This is more than $70 bucks. Like I just think, it's Off-White, it comes with a box, it has the binder clip. It's silly, but like, this is a bit of a stylistic choice. I'm gonna say $170. Woohoo! - [Matt] Are you kidding me? - [Austin] Let's go! - [Matt] Are you kidding me? - [Austin] Let's go! - [Matt] Is this a fishing tackle? - [Austin] Outdoor life, Streetwear, Stussy. Wait, is this Stussy or \"Stoossy\"? I wish i never said this out loud. How do you pronounce Stussy? Stussy. Okay, thanks Google. - [Matt] How rare is the Stussy? That's what I want to know. - [Austin] You're saying with the tone right now, Matt. I don't like how you're staying saying with the tone. - [Matt] Well, all I'm doing is talking about my rare Stussy, okay? The thing I hate though is when my rare Stussy smells like fish. - [Austin] I'm gonna punch you directly in the right temple. I'm gonna guess that this is actually gonna be on the lower side. 'Cause I don't think this is that cool. I think it's a little bit of a weird sort of pick. I'm going to guess $45. I'm a little low there. - [Matt] I'm going with my tried and true $88. - [Austin] Okay. - [Matt] $180! - [Austin] Point for Matt. All right, this is dumb. This is dumb. It doesn't look good on a shelf. It's just not good. - [Matt] But it looks great in your 0ff-White tackle box. Zip tied with your 0ff-White zip tie. - [Austin] Cactus Plant Flea Market, Dover Street Market, Stussy again. - [Both] Another Stussy. - [Matt] It's dented. - [Austin] You're dented. - [Matt] I think this is gonna go way lower. - [Austin] This is probably gonna be a little more expensive than my guess. - [Matt] What is the difference between Stussy and Rare Stussy? - [Austin] I'm ignoring you now, $135. Can I give you my opinion on this? - [Matt] Yeah, let's hear it. - [Austin] I would go higher not lower. That's my gut. - [Matt] I'm going $150. And I'm playing really defensive. - [Austin] Yeah, yeah, yeah. - [Both] $202! - [Austin] There you go! - [Matt] All right, wait, it's only $202 because it's 20% off. - [Austin] 19% off. - [Matt] That's such a weird number to be off. - [Both] Oh! - [Austin] Rare Faze Clan red logo slides. They IPOed, they're actually like a real legit company. Do you wanna go first on this one? Since I've gone first the last couple times when we tied? - [Matt] I'm going by tried and true $88. - [Austin] $88 bucks. I'm gonna make a spicy choice. $50 bucks, I'm probably wrong, but I'm going low on this one because I think people are not feeling Faze right now. - [Both] Oh! - [Austin] $155? I mean, they're kind of cool, but like damn. The Supreme Pillsbury Doughboy cookie jar in white and red. - [Matt] Oh ho! This is the first one I think we've seen that actually has the Pillsbury logo on as well, and not just taking over the Supreme logo. - [Austin] Yeah, this is a proper collab. - [Matt] Yeah, yeah. So I'm gonna go with $150. - [Austin] That's a good guess. I'm gonna say $225. - [Both] $181! - [Matt] Yeah! - [Austin] All right. - [Matt] Matt's pulling ahead! - [Austin] 0ff-White plastic cup, very rare description. Very rare, drink in style. - [Matt] This is what you drink the designers' piss in, because this guy is saying how rare it is. I'm going stupid high on this. - [Austin] No, no Matt, don't do it. What you talking about? - [Matt] I'm going $1,700. - [Austin] Oh my God. That is the dumbest thing I've ever heard. I'm gonna say $75. $100 bucks! Oh, what the (Minecraft oof) is this? (Matt laughing) - [Matt] So I'm gonna go $2,500. - [Austin] Ooh, I like that guess actually. I think you're pretty solid on that one. I'm just for safety and go $1,500, but this is the most expensive item so far. I'm pretty confident in that. - [Austin] $1,710! So this is the Toy Story Bearbrick, 400% Woody and Buzz. I will say, Buzz looks a whole lot better than Woody. Buzz has like that natural sort of shape of his face. Woody looks like he's let himself go. - [Matt] All right, I'm gonna go $750, for the pair. - [Austin] I'll say $500. - [Both] $4,000! - [Matt] We knew it was coming! We knew Kenzie was gonna throw it at us. I technically win that round but man! - [Austin] While I try to salivate and remember how my throat works, what a great time to remind you to subscribe to the channel and ringaling the dingling button. I guarantee you, you cannot find content like this anywhere else in the internet. And if you can, go there. Because this is as good as it gets my friends. Noah Cyrus tears, this is approximately 12 tears made by Noah Cyrus as a result of sadness. Human digestion of these tears is not suggested 'cause tears are generally pretty salty and that would just be super (Minecraft oof) weird if you drank someone else's tears. Who's Noah Cyrus? - [Crew Member] Miley Cyrus's little sister. - [Austin] Ew. - [Crew Member] Yeah. - [Austin] How many tears did she have to cry to sell these nonsense things? - [Matt] It's only 48 hours worth of tears. - [Austin] Boy, I don't like this at all. - [Matt] No, I'm going $4,500. - [Austin] Jesus! - [Matt] Original price. - [Austin] No! - [Matt] Any number I threw out there would've been too little. - [Austin] $100. $12,000! $12,000! Ew! - [Matt] Oh, all right, let us know in the comments what you thought of these stupid, awful, hypebeast things. Let us know about your Stussy and how you rock it out. Like, subscribe and follow. - [Austin] Lost so much faith in humanity. So much faith in humanity has just evaporated. - [Matt] What are you more afraid of? Like a bumblebee? - [Austin] Not afraid of so, okay. - [Matt] The size of a giant squid, like 20 foot. - [Austin] Oh, okay. Yeah, it's not good. Okay. Yeah. - [Matt] Or 20,000 tiny squids that are all super aggressive. - [Austin] No, but the bee though can't fly, right? Bees only can fly because of how small they are. If you scale. - [Matt] No, scientists do not know how bees fly. - [Austin] The bee is obviously terrifying, but also it's probably kind of fast, but I bet it's gonna be like kind of. - [Matt] The intellect of a squid terrifies me, but I feel. - [Austin] But they're squids, I just stay outta water, It's easy. - [Matt] I feel like they're organized. They would develop a series of kelp and breathing apparatuses. - [Austin] I'm more afraid of the bee that will literally crush me with one leg.",
    "transcript_keywords": [
        "Yeah",
        "Supreme",
        "Stussy",
        "Matt",
        "rare Stussy",
        "Supreme brick",
        "bucks",
        "guess",
        "rare",
        "Bathing Ape",
        "low",
        "high",
        "good",
        "tears",
        "Supreme Pillsbury Doughboy",
        "Noah Cyrus",
        "kind",
        "pretty",
        "Crocs",
        "Ape"
    ],
    "transcript_entity_values": [
        "American",
        "some 10",
        "57",
        "Salehe Bembury",
        "Crocs",
        "227",
        "150",
        "155",
        "4,000",
        "Stoossy",
        "202",
        "Buzz",
        "Doughboy",
        "1,200 bucks",
        "12,000",
        "Stussy",
        "80",
        "500",
        "75",
        "Rare Stussy",
        "2,500",
        "750",
        "four zero",
        "4,500",
        "20%",
        "less than a dollar",
        "Dover Street Market",
        "400%",
        "Google",
        "88",
        "20,000",
        "Matt",
        "330",
        "Austin",
        "380",
        "600",
        "100",
        "135",
        "Minecraft oof",
        "first",
        "350",
        "Rick",
        "1,710",
        "45",
        "20 foot",
        "this Holy Water",
        "Austin] Point",
        "0ff",
        "1,700",
        "Bape",
        "five bucks",
        "Off-White",
        "Kidde",
        "$60 bucks",
        "Streetwear",
        "Kenzie",
        "Croc",
        "19%",
        "400",
        "420",
        "more than $70 bucks",
        "only 48 hours",
        "1",
        "1,500",
        "approximately 12",
        "225",
        "Supreme",
        "Woody",
        "450",
        "one",
        "the thousands of dollars",
        "Noah Cyrus",
        "Pillsbury",
        "Minecraft oof",
        "Miley Cyrus",
        "Virgil Abloh",
        "10%",
        "today",
        "690",
        "181",
        "180",
        "Austin",
        "135",
        "Rick Owens",
        "only $202",
        "70",
        "$50 bucks",
        "two",
        "245",
        "350",
        "40",
        "10",
        "Bathing Ape",
        "$700 bucks",
        "23",
        "2007",
        "170",
        "IPOed",
        "30"
    ],
    "transcript_entity_types": [
        "NORP",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "MONEY",
        "FAC",
        "PERCENT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "GPE",
        "PERSON",
        "ORG",
        "PERCENT",
        "MONEY",
        "MONEY",
        "MONEY",
        "TIME",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERCENT",
        "DATE",
        "MONEY",
        "MONEY",
        "MONEY",
        "GPE",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "MONEY",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY"
    ]
}