{
    "id": "5rvj8Cc35ss",
    "title": "The Ultimate Slim Wallet",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-05-12T20:54:05Z",
    "video_url": "https://www.youtube.com/watch?v=5rvj8Cc35ss",
    "category": "Science & Technology",
    "tags": [
        "wallet",
        "slim",
        "slim wallet",
        "cool",
        "cool wallet",
        "card",
        "credit card",
        "holder",
        "card holder",
        "secrid",
        "best",
        "best wallet",
        "rfid",
        "secrid holder",
        "secrid wallet",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "gadget",
        "gadgets",
        "review",
        "unboxing",
        "iphone",
        "apple",
        "new",
        "test",
        "android",
        "crazy",
        "top",
        "things",
        "minimalist",
        "futuristic",
        "future",
        "smart",
        "innovation",
        "features",
        "laser",
        "case",
        "wearable",
        "4k",
        "connected",
        "durability",
        "must have",
        "wallet (product category)",
        "comparison",
        "video",
        "invention",
        "videos",
        "inventions",
        "latest",
        "smartwallet",
        "google",
        "2016",
        "edc",
        "band"
    ],
    "views": 3528627,
    "likes": 122187,
    "comments_count": 4596,
    "description": "The 4 Dollar Android Smartphone -  SECRID Slim Wallet -   I've been searching for the ultimate, slim card wallet. I found the Secrid on Amazon and instantly ordered. It features RFID protection and a cool mechanism to display available cards.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/utRww8-QuBw",
        "http://amzn.to/20QA2ws",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys! Lew here, back with another video and today I am here to solve the biggest problem... ...biggest thing threatening mankind, that is; terrible wallets! You have one! Or you've had one! ...or you're yet to buy one. Everybody's seen one of these guys... You know big, chunky Look! Inevitably this is what you do, paper! I hate it! Get rid of it! [wallet hits wall] A money-clip style, like this... ...maybe a couple of different spots for cards and whatnot. But then I realise: Hey, I'm hardly ever carrying around cash So this cilp portion was less important to me Take that off, now you're left with this really thin thing and a couple of different cards You can only really see a little bit of them getting them in and out... not ideal You can get your spine back You put one of those in your back-pocket You're going straight to the chiropractor, alright! The real threat to mankind... ...those big-ass wallets Alright, get rid of this. This is what I'm using right now It's a bit of a hybrid, spots for cards ...got this magneticI guess you could put money in there?! I like it, it's pretty durable It's still not all the way there! [wallet hits wall] Ordered this guy off Amazon. It is called the \"Secrid\" Look at that, oh yes! Card protector, Titanium, made in Holland! Finally! The thing I've been wanting: A card-only wallet, as slim as possible... with an easy way to see all of your cards and get them out Let's see if this thing delivers on a promise It remains to be seen. Look at that. That's tiny! Metal, very protective! What do we have here? How do we? Oh! See that Jack? Look at this! [click] Boom! What do we got? Is there english anywhere on here? \"Protects your most important plastic cards against bending, breaking but also against unwanted RFID-Readers!\" This is where the tech-component comes in! The future of hackers and whatnot! They'll be able to dip through your leather wallet into your RFID, wipe you out You'll lose your house, family hates you It treats you like a gambler But it never happened! You weren't in Vegas... You just got hacked! See that little release? Thats what's gonna give you very quick access to your cards Slide that baby out! So... some cards, yes of course Check 'em out! Ooo, that feels satisfying Alright and then we'll have to hit the button Ooohh! [click] How? Boom! Pay! Back in. Button! Boom! Pay! Back in. Button! Oh, you need a different card? Okay! Pull that one out. Pay! Back in. I think we made it Jack! Look at that slick, little guy right there! Oh my - Satisfying too [click] No problem! Pay! Take it! Take all my money Okay leave a few bucks! If you wanted to fold a bill in there... Let's see [click] Yea, look! If you're oldschool and you still want to fold up a bill in there or a couple [click] Still works! You know... Maybe I'm more into this stuff than the average person, but I can't be the only one! If that's you... Show me some thumb-love, so I can prove Jack wrong. Jack's like \"No one cares about wallets, Lew!\" I'm like \"Listen! RFID - It can't be hacked\" Look at you you're James Bond! Prove Jack wrong! Use your thumb! This is the kind of lightbulb that you would see in a cartoon! Like when the thought, like when the guy gets the, the great Idea... This goes off Ding!",
    "transcript_keywords": [
        "cards",
        "Jack",
        "back",
        "Pay",
        "thing",
        "alright",
        "Jack wrong",
        "guy",
        "prove Jack",
        "wallets",
        "couple",
        "Boom",
        "biggest",
        "button",
        "Card",
        "prove Jack wrong",
        "biggest thing threatening",
        "RFID",
        "biggest thing",
        "guys"
    ],
    "transcript_entity_values": [
        "the \"Secrid",
        "Amazon",
        "Ding",
        "Holland",
        "Lew",
        "english",
        "RFID-Readers",
        "James Bond",
        "Vegas",
        "Jack",
        "RFID"
    ],
    "transcript_entity_types": [
        "LAW",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "LANGUAGE",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG"
    ]
}