{
    "id": "5sa0acU4pmY",
    "title": "How to Install Ubuntu on VirtualBox using Windows 10",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-11-21T19:21:36Z",
    "video_url": "https://www.youtube.com/watch?v=5sa0acU4pmY",
    "category": "Science & Technology",
    "tags": [
        "VirtualBox",
        "Ubuntu",
        "Linux",
        "virtualbox tutorial",
        "Install Ubuntu",
        "Install VirtualBox",
        "VirtualBox How to",
        "Virtual Box",
        "Ubuntu 18.04 LTS",
        "Ubuntu 19.10",
        "Ubuntu 18.04 LTS (Bionic Beaver)",
        "How to install Linux",
        "vmware",
        "virtual machines",
        "virtualbox",
        "virtual machine",
        "install",
        "tutorial",
        "ubuntu 18.04",
        "how to",
        "how to install",
        "virtualization",
        "vm",
        "how to install ubuntu 18.04",
        "how to install ubuntu",
        "how to use virtualbox",
        "ubuntu 19.04",
        "how to set up a virtual machine"
    ],
    "views": 119937,
    "likes": 3105,
    "comments_count": 219,
    "description": "Learn Linux! Learn VirtualBox! Learn Virtualization technologies. In this video I'll show you how to install VirtualBox and then install Ubuntu 18.04 LTS within VirtualBox on a Windows 10 Laptop. VirtualBox is a type II hypervisor that allows you to run virtual machines directly on your Windows computer. No need to dual boot or struggle to learn Linux.  Ubuntu is one of the most popular Linux distributions (distros) in the world. Even though Ubuntu 19.04 has been recently released I recommend you use Ubuntu 18.04 LTS (Bionic Beaver) to get long term support.  VirtualBox is a very popular free hypervisor that allows you to host virtual machines on your Windows computer. In this example we will run Linux within VirtualBox on a Windows 10 laptop.  Both Ubuntu and VirtualBox are free software.  Menu: Overview and Hypervisor Types: 0:00 Download VirtualBox: 2:49 Install VirtualBox: 4:00 Download Ubuntu: 5:53 How to enable Intel VT-x / AMD-v: 6:45 Create Ubuntu Virtual Machine in VirtualBox: 8:40 Install Ubuntu in VirtualBox: 12:00 Fix Ubuntu screen resolution in VirtualBox: 16:34 Copy and paste from Windows to Ubuntu: 18:36   kali linux Hacking Ethical hacking  EVE-NG GNS3 VIRL Packet Tracer 10x Engineer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #virtualbox #linux #ubuntu",
    "description_links": [],
    "transcript": "- In this video I'm gonna show you how to install VirtualBox on a Windows 10 computer. Once we've got VirtualBox installed, I'm gonna show you how to download and install Linux within VirtualBox and get that running. Why do you wanna do this? Well these days, it's really important for network engineers to learn Linux. It's very important if you wanna learn network automation as an example, so it's a great skill to have. You also need to learn virtualization technologies. These day, it's very seldom that you will host a server directly on bare metal, typically you're going to host a server within hypervisor software, which could be type one hypervisor software such as ESXi or type two hypervisor software such as VirtualBox. VirtualBox is free software that you can download and run on your Windows computer, so in this example we're gonna have Windows 10 running directly on our hardware. Windows 10 will be what's called the host operating system, and then we're gonna run VirtualBox on top of Windows, and then we'll run Ubuntu within VirtualBox as our guest operating system. (upbeat electronic music) Everything must end - Now VirtualBox is what's called a type two hypervisor. A type two hypervisor runs on top of another operating system, so in this example we have Windows as the host operating system, we run hypervisor software, which in this example is VirtualBox, on top of Windows, and then we run a guest operating system within the VirtualBox. In this example it'll be Ubuntu. Type one hypervisor such as VMware, ESXi, run directly on hardware, so you don't install the hypervisor software on top of another operating system, you install it directly on bare metal, or physical hardware. VirtualBox, however, is a type two hypervisor, it runs on top of another operating system, which in this case is Windows 10. So we have Windows 10 as our host operating system, we have the hypervisor software which is VirtualBox, and running within the hypervisor software we have our guest operating system, which in this example is gonna be Ubuntu. Now if you enjoy these videos, please would you subscribe to my YouTube channel, please would you like the video, and please click on the bell to get notifications when I post a new video. Without further ado, let's get started, and I'm gonna show you how to download VirtualBox, get it running, and then get Ubuntu running on VirtualBox. Okay, so now I'm gonna show you how to download and install VirtualBox on a Windows 10 computer. Search for my PC, right click, go to properties. This is once again a Windows 10 laptop, the processor's an Intel Core i7, eight gig of RAM, 64 bit operation system. To download VirtualBox, go to VirtualBox.org, or just search for it in Google. So just search for VirtualBox, and the first hit in Google is VirtualBox downloads. Now if you've gone to VirtualBox.org, scroll down, and select download VirtualBox. In this example, the current version is 6.0.14. I wanna get the Windows version, so I'm gonna click on Windows hosts, and as you can see VirtualBox is now being downloaded. It's 163 meg in size. So you simply need to wait now for that download to complete. Okay, so it's downloaded, I'm gonna click show in folder. Here's the VirtualBox executable. The installation process is very simple. I'm basically gonna mainly use the defaults. So I'm gonna double click on the executable. The setup wizard displays, I'm gonna click next. You can customize the installation, I'm not gonna do that, I'm gonna simply click next. Again you can change some of the options, such as not creating a shortcut on the desktop. I'm gonna leave everything at defaults and click next. Now a warning is presented that network interfaces will be reset. Before I continue with the installation, I'm gonna open up Control Panel, go to Network and Internet, Network and Sharing Center, change adapter settings, and what you'll notice here is I have a physical wireless interface card. This is the interface that I'm using to connect to the internet, I also have some VMware interfaces, but there are no VirtualBox interfaces. Now don't get concerned if you see additional network interfaces displayed here once you install VirtualBox, that's normal. So when I click yes to proceed with the installation, and then click install, you'll see that network interfaces are added to Control Panel. VirtualBox is now installed, and as you can see here we've got a VirtualBox ethernet adapter. So VirtualBox has added an adapter to my computer. I'm gonna click finish, which will finish the installation and start VirtualBox. Okay, so there we go, we've got VirtualBox installed. I previously installed Kali Linux in VirtualBox, so that's displayed here, but what I wanna demonstrate is how to run Ubuntu in VirtualBox. So I'm gonna go to Ubuntu.com, click download, and we're gonna download the desktop version of Ubuntu. Now you could download 19.10, but we're gonna download 18.04 LTS, or long term support, that's the one I'd recommend that you download at the moment. So I'm gonna select that, and as you can see, Ubuntu 18.04.3 is downloaded. Again, all you need to do now is wait for the download to complete. So what I'm gonna do now to save time is pause the video, and then I'll restart the video once the file is downloaded. Okay, so the ISO image has been downloaded, we can see it's Ubuntu 18.04.3 desktop AMD 64. Now this is important, you need to have nested virtualization enabled on your laptop to be able to run this version of Ubuntu. So I'm now gonna show you how to enable nested virtualization on a laptop. In this example I'm using an Intel laptop. Similar kind of process will be used for AMD processors, but you need to have nested virtualization enabled on your laptop to run this image. Okay, so I'm gonna show you that now, skip to this timestamp if you've already got nested virtualization enabled on your laptop, and you just wanna see how to get Ubuntu running. Okay, so I need to enable nested virtualization, or VTX, on my laptop, so what I'm gonna do is shut it down. I'm gonna power it on, and in this example for this laptop, I'm gonna hold the F2 key down. So you can see here BIOS information. What I'm gonna do is go to the next menu, and the important piece is Intel Virtualization Technology. That's currently enabled. There are some other options like hyper threading, Intel AES-NI, Vt-d, but the one that I want is Intel Virtualization Technology. You need that to be enabled to do nested virtualization in VirtualBox or a VMware workstation. So I'm gonna save those settings, and say yes to save. The laptop will reboot. Okay, so now I can log in. And I've been able to log in successfully. So if you have problems, make sure that Intel Virtualization Technology, or VTX, Intel VTX is enabled on your laptop. Okay, so now that I've got nested virtualization enabled on my laptop, in VirtualBox I'm gonna click new, because I wanna create a new virtual machine. Notice currently it's set to Microsoft Windows, but notice what happens when I change the name. I'm gonna call this Ubuntu 18.04. You could use a better name if you want to, but that's the name I'll use for this demonstration. I'm gonna leave the machine folder at the default, it's picked up that I'm using Linux Ubuntu 64 bit. VirtualBox is clever enough to work out that this is Linux Ubuntu because of the name that I've used. I'm gonna click next. We now asked how much RAM or memory we wanna allocate to this virtual machine. This will really depend on the laptop that you're using and the hardware that you have available. In my example I've got eight gig of RAM, so I'm gonna allocate two gig of RAM to the virtual machine, and click next. I'm going to allow VirtualBox to create a virtual hard disk of 10 gig, which is the recommended size, and click create. You can change the hard disk type. I'm gonna just use the default. If you want to use this virtual machine with, for example, VMware, you may prefer to use VMDK, but VDI is fine for this example, so I'm gonna click next. Now VirtualBox, like a lot of hypervisors can either allocate all the disk space, or it can allocate a portion of it, and then expand it dynamically depending on how much space you actually need. I'm going to use dynamically allocated so that it doesn't try and grab all the disk space if I don't need it, it'll allocate more disk space when the virtual machine requires the disk space. So again, dynamically allocated, click next. You can once again change the disk space if you want to, 10 gig is fine for my example, I'm gonna click create. And as you can see, VirtualBox has created this Ubuntu virtual machine. I'm gonna go to settings to verify that everything looks good, so under basic we can see the virtual machine name, it's Linux, Ubuntu 64 bit, under system, we've allocated two gig of RAM. If you wanna change that now, you could do that. Processor type, we've only got one CPU allocated, so I'll change that to two CPUs to make it run quicker. AMD processors support nested virtualization. That's currently not supported in VirtualBox 6.0 on an Intel processor, but that's okay for what we're doing here. Now one of the things that we wanna do is specify the ISO image that we've downloaded so that Ubuntu boots off that ISO and gets installed. So under storage, IDE, it says empty at the moment. I'm gonna click on this CD ROM, and select choose virtual optical disk file. Go to downloads, and I'm gonna specify the ISO image that we've downloaded, and click open. We once again wanna boot off this ISO image and install Ubuntu, so I'm gonna click okay, and now I'm gonna click start. VirtualBox is now booting. And as you can see the virtual machine is booting off the ISO image. We can specify our language, which in my example is gonna be English, and then we're asked, do we wanna try Ubuntu, or do we want to install Ubuntu? I want to install Ubuntu, because I don't wanna keep on booting Ubuntu from the ISO image. We're told that we can try Ubuntu without making any changes to the computer by directly booting off the CD. But what I wanna do is install Ubuntu. That's not gonna affect the Windows machine, because I'm running Ubuntu within the hypervisor. I can now specify my keyboard, in my example I'm using a UK keyboard. If you're based in the US as an example, you would specify US keyboard, but I'll specify UK keyboard and click continue. Now because I'm traveling, I'm actually connected to the internet via 4G modem, so I don't wanna download additional Ubuntu options. If you're at home or in the office and you have a permanent connection to the internet, you may wanna specify that option. I'm gonna specify a normal installation, but not download updates while installing Ubuntu, and I'm not going to install third party software. So I'm not going to download updates while I'm installing Ubuntu, I'm gonna click continue. Now in this example I'm gonna erase the disk and install Ubuntu. That's okay because I'm running Ubuntu in a virtual machine, I can erase the hard disk which is a virtual hard disk in the virtual machine without affecting my physical Windows computer. So I'm gonna select that option and click install. I'm asked, do I wanna write changes to the disk, yes I do, click continue. Ubuntu asks me where I am, it's actually picked up that I'm in South Africa, so that's okay for this demonstration, you could change the time zone if you liked. So I could specify as an example London, and click continue. So what's my name? I'm gonna specify David, that's okay in this example. Note that's the username that you're going to use to log on to the Ubuntu system. What's the computer name, I'm gonna change that as Ubuntu-VirtualBox. Username is gonna be David, password I'll specify as Cisco123, and I'm gonna specify login automatically. Now you probably wanna use a good password if this is a production system, but this is just a lab on my laptop, so that's fine, basic password and automatic login. For the real world as always, the warning is use a good password, eight or more characters, make sure that it's complex. I'll click continue. Ubuntu is now being installed, so what I'll do is speed up the video at this point so that you don't have to watch the installation process. Basically, it's taking the files from the ISO image, which is the virtual CD ROM, and installing that onto the virtual hard drive running within VirtualBox. Okay, so after a while, we're told that the installation is complete, you need to restart the computer in order to use the new installation. I wanna click restart now. Okay, so I've made a mistake there, we're told, please remove the installation media and then press enter, so what I'm gonna do is close the virtual machine, so power it off. I should have done that before I rebooted the virtual machine. I'm gonna go back to settings, storage, and I'm gonna make sure that this is empty which it now is, click OK, and then click start. So virtual machine is now booting up once again, and there you go, you can see my Ubuntu machine is booted up, I'm gonna click next, click next, click next, and click done. Now this interface is way too small. If I resize the window, notice Ubuntu is still using a very small window size. So what I'm gonna do is go to devices, insert guest additions CD, and I'm told that this software intends to be automatically started, do I wanna run it, yes I do. I need to put my password in, and click authenticate. I'm told that the system will be restarted, so notice the window size automatically adjusted there. When I move this around, window sizes automatically adjusted. I'm gonna press return to close this window, but notice now how the desktop is automatically adjusted because of those additions that have been added. I'm gonna click show applications, search for terminal, I'll change the font here because it's way too small, so I go to preferences, custom font, make this bold, make this a lot bigger, so that it's easier to see what's going on, click select, and then close that. So as an example if I type ifconfig now, I'm told that that command is not installed, that's an older command, so I'll do IP address. This is the IP address of my device. Can I ping Google.com, yes I can, because this device is using NAT by default. Under machine settings, network, notice I'm using NAT. I'm not bridging the adapter to my wireless network card, which I could do, but I'm simply using NAT. That's the easiest way to get started. So if you're not sure, just use NAT. Especially if you've got a laptop and you're moving from one wireless network to another. Clear clears the screen, let's do IP address. When I select this and copy it, I can't copy it to Windows. So in notepad, when I right click and paste, that's not working. Now to enable features, go to devices shared clipboard. What are you going to allow? I'm going to allow bidirectional copying from one clipboard to another. I'm also going to allow files to be dragged from Windows into Linux and back again. So now when I select this and click copy, and go into Notepad and paste that, notice I've been able to paste from Linux into Windows. I could also do the same from Windows to Linux, so this is Windows, copy that text, and clear the screen in Ubuntu, right click and click paste. Notice I can paste into Ubuntu, now that's not a valid command, but I've been able to copy from Windows into Linux, and I've been able to copy from Linux into Windows. Okay, so in this video, I showed you how to download VirtualBox and get it running on a Windows laptop, I also showed you how to download an Ubuntu ISO image, boot off that in VirtualBox and get Ubuntu running on a Windows 10 laptop. Now if you enjoyed this video, please once again subscribe to my YouTube channel, please like this video, and please click on the bell to get notifications, I'm David Bombal, and I wanna wish you all the very best. (upbeat electronic music) Everything must end",
    "transcript_keywords": [
        "Ubuntu",
        "click",
        "Windows",
        "VirtualBox",
        "install Ubuntu",
        "Linux Ubuntu",
        "virtual machine",
        "download",
        "Linux",
        "virtual",
        "Intel Virtualization Technology",
        "ISO image",
        "machine",
        "Ubuntu running",
        "laptop",
        "operating system",
        "system",
        "download VirtualBox",
        "ISO",
        "virtualization"
    ],
    "transcript_entity_values": [
        "first",
        "Microsoft",
        "Linux Ubuntu 64",
        "UK",
        "these days",
        "Linux",
        "VTX",
        "Network and Internet",
        "London",
        "VirtualBox",
        "163 meg",
        "F2",
        "Ubuntu.com",
        "third",
        "19.10",
        "18.04 LTS",
        "US",
        "64",
        "two",
        "Sharing Center",
        "Vt-d",
        "VMDK",
        "4",
        "eight",
        "Control Panel",
        "AMD",
        "Windows",
        "CPU",
        "South Africa",
        "NAT",
        "YouTube",
        "VDI",
        "Google",
        "David",
        "IP",
        "VTX",
        "Linux",
        "English",
        "Ubuntu-VirtualBox",
        "IDE",
        "These day",
        "one",
        "Linux",
        "ISO",
        "VMware",
        "AMD 64",
        "RAM",
        "Intel Virtualization Technology",
        "Intel",
        "Windows 10",
        "Kali Linux",
        "Windows",
        "David Bombal",
        "Intel AES-NI",
        "Windows",
        "Ubuntu",
        "10",
        "Intel Core"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "LANGUAGE",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "NORP",
        "PRODUCT",
        "CARDINAL",
        "ORG"
    ]
}