{
    "id": "5xeNeQa_qSY",
    "title": "Hidden keylogger // Bypass Linux & macOS logon screens! Rubber Ducky scripts for Hak5 OMG cable",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-10-05T14:17:01Z",
    "video_url": "https://www.youtube.com/watch?v=5xeNeQa_qSY",
    "category": "Science & Technology",
    "tags": [
        "omg",
        "omg cable",
        "apple macbook",
        "macbook",
        "linux",
        "ubuntu",
        "hak5",
        "hak5 omg",
        "kali linux tutorial",
        "kali",
        "rubber ducky",
        "hak5 rubber ducky",
        "rubber ducky usb",
        "rubber ducky hak5",
        "usb rubber ducky",
        "usb rubber ducky tutorial",
        "usb rubber ducky payloads",
        "hak5 omg cable",
        "hak5 bash bunny",
        "hak5 omg cable tutorial",
        "hak5 cloud c2",
        "hacking macos",
        "hacking macbook pro",
        "hacking macbook",
        "ethical hacking",
        "usb rubber ducky hacking",
        "keylogger",
        "key logger",
        "keylogging",
        "keylog",
        "macos keylogger",
        "linux keylogger"
    ],
    "views": 213573,
    "likes": 6237,
    "comments_count": 407,
    "description": "It's just crazy scary what these cables can do. They look like normal USB cables, but are not! In this video we login to Apple MacOS and Linux computers :)  ====== Scripts: ====== Apple macOS Rickroll:  Linux Rickroll:   ======================= Buy Hak5 coolness here: ======================= Buy Hak5:   ================================ Hacking Android and iOS devices: ================================ OMG with Android and Apple iPad:   ============= Setup Videos: ============= OMG Cable setup:   Rubber Ducky setup:    ================ Connect with me: ================ Discord:   Instagram:  LinkedIn:  Facebook:  TikTok:    keylogger keylogging key logger hak5 keylogger macos keylogger hak5 omg cables omg cable apple apple macos linux ubuntu ubuntu hack linux hack rubber ducky hak5 rubber ducky hak5 omg cable omg cable android omg cable ios  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #omgcable #hak5 #rubberducky",
    "description_links": [
        "https://davidbombal.wiki/applerickroll",
        "https://davidbombal.wiki/linuxrickroll",
        "https://davidbombal.wiki/gethak5",
        "https://youtu.be/7YpJQT55_Y8",
        "https://youtu.be/V5mBJHotZv0Hak5",
        "https://youtu.be/A2JNBpUotZM",
        "https://discord.com/invite/usKSyzbTwitter:",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombalYouTube:",
        "https://www.youtube.com/davidbombal"
    ],
    "transcript": "- So, does everything look normal here? Do you see anything out of place? Or does it look normal? Well, there's a serious problem in this setup. Have a look at this cable. Does it look like a standard Apple cable? The problem here is that this cable is an O.MG Cable. I've connected this iPhone to the access point running within this cable. This cable is really scary. It has a keylogger built in it, even though it looks like a standard cable. What I've done here is selected the key log. And let's start logging keystrokes. I'll put in my password. And, hopefully, there you can see what my password is. So, I'll log into this computer. I've just captured the password of the user who logged into this Mac. In this example I'm using a Mac M1 mini on my desk here. I logged into the computer. And I was able to capture the keystrokes. So, let's type something. I could say username, David. Password, secret password. And as you can see there, whatever I typed on the screen is captured by the O.MG Cable. It even captures the backspaces. So, I'll do that again. Username, David, password, secret password, all captured by the O.MG Cable. And just to make the point again I'll lock the screen, screen is locked. Move my mouse, put in my password, secret password. And there you go, it captured the login details. Now, let's assume the user decides to log off for the day. So, locks their screen as we've been told is good practice. But let's see if we can do something now with that information. So, I'll stop logging. I'll go to payloads. And what I'm gonna do here is load a payload from slot one. This is a payload that I've pre-written using the password that was captured. So, let's see if I can log into the computer once the user has left. Again, remember, I can do this from up to a mile away. So, I'll press run. Screen will hopefully come on, there you go. I can log in as the user. I can send a URL, and something happens. So, I've been able to Rick Roll you by using the captured password from the login prompt, use while logged into the computer. I used the key logger within the O.MG Cable to capture that. I've now got to the password of the user. I can add that to a script or payload if you prefer. And I can log onto the computer and get it to do something, I could get this to run a reverse shell. And if you're interested I'll show you how to do that in a separate video. I'll show you how you can open up a reverse shell to a server on the internet, and then remotely control this computer. But let's see if we can do something similar with a Linux device because a lot of people believe that Linux is secure. There's this misconception that stuff like this can only be done with Windows, but I've just demonstrated with macOS. Let's see if we can do something similar with Linux. Now, a lot of people believe that Linux is safe and can't be attacked. But in this example I've got the O.MG Cable connected to this Linux laptop. I'm running Ubuntu natively on this laptop. And I've got my iPhone connected to the access point running in the O.MG Cable. What I'll do here is load a script from slot five. I've preconfigured this script to log into a Linux laptop. So, what I'll do is press run. And what we should see is that we can auto log in to this laptop and do something. So, there you go, it's logged into this Ubuntu computer. Again, I'm not touching the computer at all. The O.MG Cable is sending commands to the Ubuntu laptop. And as you can see there, I've been able to Rick Roll you by using this laptop. So, again, I'll log off the laptop. So, log out. Now, in this example I know what the password is, but I could have captured that using the keylogger within this cable. So, I'll run this again, hopefully be able to log into this laptop. And once again, open up Firefox and go to YouTube. So, Firefox has opened. I've set the script to go full-screen and play the famous Rick Roll video. The point is is that this cable can be used with Linux, it can be used with macOS, it can be used with Windows. It can be used with Android. It can be used with iOS devices that support a USBC connection. Cable comes in different form factors. In this example I've got USB-A to lightning port, comes in white, comes in black. Also, comes in USB-C, USB-C is an example of different form factors allows us to hack different types of devices such as Android phones, or iPads, or Linux, Windows, and macOS devices. Now, this is just a simple demonstration. You can take this a lot further. You can do a lot more with this cable. I simply wanted to show you a basic demo, where I can log onto a locked Linux laptop, gain access, and get it to do different things. Now, if you're interested in a separate video, I'll show you how to set up a reverse shell on Linux. Once again, log in. Set up a permanent reverse shell so that I can maintain access to this device, even when you log off as an example. Now, as always, I don't want you to get into trouble. Only attack devices that you own, or attack devices that you have permission to attack. Do not attack devices that you do not have permission to attack. Don't get into trouble, don't go to jail. Do things ethically. Now, if you enjoyed this video, please consider subscribing to my YouTube channel. Please, like this video, and click on the bell to get notifications. That really does help me with the YouTube robots. I'm David Bombal, and I want to wish you all the very best. (electronic dance music)",
    "transcript_keywords": [
        "cable",
        "O.MG Cable",
        "Linux",
        "log",
        "password",
        "Linux laptop",
        "laptop",
        "computer",
        "Rick Roll",
        "O.MG",
        "captured",
        "devices",
        "secret password",
        "screen",
        "Apple cable",
        "video",
        "user",
        "standard Apple cable",
        "attack",
        "David"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Linux",
        "USB",
        "Mac",
        "Rick Roll",
        "USB-C",
        "Apple",
        "Android",
        "the day",
        "macOS",
        "five",
        "Windows",
        "M1",
        "YouTube",
        "iPhone",
        "David",
        "USBC",
        "O.MG Cable",
        "iPads",
        "Linux",
        "up to a mile",
        "the O.MG Cable",
        "Windows",
        "The O.MG Cable",
        "David Bombal",
        "Firefox"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG"
    ]
}