{
    "id": "5ZHHXZXTISY",
    "title": "Is Apple KILLING the Game Console?!",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-09-13T19:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=5ZHHXZXTISY",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "google stadia",
        "apple arcade",
        "gaming",
        "stadia",
        "cloud gaming",
        "video games",
        "game streaming",
        "google console",
        "xcloud",
        "ps5",
        "xbox game pass",
        "xbox news",
        "xbox game pass ultimate",
        "game pass",
        "#xboxscarlett",
        "stadia vs xcloud",
        "SEGA",
        "telltale games",
        "stadia vs steam",
        "streaming service",
        "xbox game pass pc",
        "project xcloud",
        "xbox update",
        "xbox one news",
        "xbox",
        "new xbox",
        "project scarlett",
        "apple games",
        "the walking dead",
        "project scarlet",
        "game",
        "best game streaming service"
    ],
    "views": 107218,
    "likes": 4198,
    "comments_count": 423,
    "description": "Is Apple making the PS5 outdated already?   Netflix SAVED Piracy :  Is It Time to DITCH Chrome?:  Video Games Getting WAY More Expensive?!:  Twitch Is KILLING Twitch:  The END of Loot Boxes?!:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/3PCs_jcOFdI",
        "https://youtu.be/se5PS2AjKY0",
        "https://youtu.be/3cQJiQ0AkW8",
        "https://youtu.be/734b1TdKR90",
        "https://youtu.be/WLtG2Ed5uP4",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys and welcome to, This Is Now. Tuesday, Apple rolled out their brand new iPhone 11, along with updates to their Apple watch, as well as to a brand new entry level iPad. But they also finally detailed their upcoming gaming service, Apple Arcade. Now, all of this got me thinking, are games consoles about to become obsolete? Is the Apple TV about to destroy your PlayStation 5? Is the iPhone 13 going to replace your Switch? Well keep watching to find out. All right, all right, hear me out here. Yes, I will 100% keep making videos on the PS5 and Xbox Scarlett, as to me they're incredibly exciting. However, I do think gaming is changing in a very different way than it has in the past. And by different I mean complicated because it literally seems like everyone is coming up with a different strategy on how to tackle this next generation. So, first of all, you've got the hardware. Of course there are traditional consoles and PCs on one side, but there's also cloud gaming on the other. On top of that, you've actually got the games themselves. While Sony and Valve are perfectly happy to sell you full price game downloads, companies like Apple and Microsoft are leaning into a subscription model. Xbox Game Pass is a similar concept. You get a pretty solid selection of downloadable games, including pretty much all of their first party titles, such as Gears and Forza for the Xbox, as well as PC. And you also get Xbox Live bundled in for $15 and a train horn a month. Yes, a train horn a month does sound expensive, however. [train horn] Then there are companies like EA and Nvidia, who are offering game streaming subscriptions. The idea is that you can play games for some monthly price, on pretty much any device that supports a controller or mouse and keyboard. As you long as you have the internet speed to support it. Now, on top of all of this, there's Google with their Stadia project. With what looks to be the best streaming game feature that you have to purchase individually. So, instead of paying some subscription fee, you have to pay to buy each game, which then you can stream, it's just a huge mess, right? And that's really one of my major sort of issues with the way that gaming is going right now. Complicating all of this, is the sheer amount of hardware that you can actually game on. Yeah, we still have exclusives on exclusives on streaming on subscriptions. I'm confusing myself right now. - [Matt] Yeah, yeah! - But this is true, this is the way it works. There are streaming games, there are purchased games, there are game subscriptions, which can be either streamed or played natively. Then there are exclusive games for say, Apple devices, there are Xbox exclusives, there are plenty of other mobile exclusives, there are some games that play on Steam. (beeping) We're going on a huge tangent here, but basically the idea is that gaming is no longer like, \"I'm gonna go buy an Xbox and put in a copy of Halo 3.\" Now, I will say Apple Arcade has the best mix here, in my opinion. The fact that the games run natively on your hardware is a big plus, and they'll of course give you the best experience regardless of where you are, not counting like internet speeds and everything. but while the exclusive titles they've shown off are interesting, I don't see a killer app yet. Then there's the issue of, are you really going to want to carry a controller with you with your phone, so you can get the best experience, no, of course not. You're gonna play with the stupid touch controls. I feel much better about the subscription model like Xbox Game Pass, except that like our episode last week talked about, there are a ridiculous number of streaming video services that you need to subscribe to these days, and gaming isn't far behind. I mean seriously, think about it, are you really ready to shell out for Microsoft's game service, and PlayStation Plus, and Nintendo Online, and maybe throw in Apple Arcade, and some Ubisoft or some EA streaming service. No, I'm not at all, that sounds terrible. The real losers here are traditional consoles, in my opinion. With the looming threat of tariffs threatening to make this high-end hardware even more expensive, I can see a future where people really only play the Triple-A games of the world on console, and pretty much everything else is either using the cloud or on mobile. I mean think about it, the new iPhone 11 has a lot more power, to the point where it's really not that far behind current gen consoles. Now mobile games, of course, have a long way to go, but however, the thing that really you need to keep in mind, and something that continually impresses me, is that they get better and better and I think a much more rapid pace than consoles do. Right, I mean we're getting a new console every three to six years, whereas every year, you're seeing a mobile device get 30% more 50% more, double the performance, right. There's going to be a point in which the level of power is going to be nearly indistinguishable. Is it that crazy to think that people might choose to grab a controller and play games via Apple Arcade or Google Stadia on the phone you already own, instead of dropping that ton of cash on a PS 5? No, it's not. And look, I'm not going to sit here and tell you that gaming is dying, far from it, I honestly believe that this is one of the most exciting times to be a gamer, ever. There are so many new titles, big and small, so many places and interesting ways to play. With that, comes a lot of complications. Consoles will definitely have a future for at least another generation, but between cloud gaming, the rise of that sheer power inside the mobile space, and subscriptions, I think the days of spending 60 dollars plus on a new game are nearing their end. Now, I'm not really sure if that's a good thing, but it's definitely going to be a wild ride the next few years. Buckle up Matt, we're going straight to the expensive game zone. - [Matt] Cool, I can't afford any of those! - Well now that GameStop's going out of business, you might be able to. - [Matt] Maybe we should buy all the consoles at GameStop. - Or maybe we shouldn't. (upbeat music) Oh, why thank you, look at this giant pile of console we purchased from GameStop. Ah. Are you gonna make me like-- No! No. Got some consoles, I don't need anymore consoles. (beeping) Whew, all right, well speaking of a wild ride, we've got the company that refuses to die, Telltale Games. After closing down the majority of its operations in September of last year, and letting go about 90% of its workforce, it was announced on August 28th this year, that the brand is being revived, by a company known as LCG Entertainment. Now, LCG is partnering with another game publisher, Athalon Games, to redistribute as much of Telltale's back catalog as possible, to build up funds, and potentially create new games. The new owners have already actually begun hiring back former employees as freelancers, with potential of full-time work in the future. But it's going to be even harder for this new Telltale to find a foothold in that ultra competitive gaming industry. Especially considering that apparently consoles are dying. See, the old Telltale's biggest money maker, were their series based on The Walking Dead. However, after they closed, Robert Kirkman, the comics creator, bought the license for the games, and finished the final season through his company, Skybound Entertainment. And through that deal, he also gained the rights to the other three seasons on top of the two spin-offs that were released. Essentially, that's all gone from Telltale. Now they've also of course, purchased those games, or rather, used the licenses from those games, such as Borderlands, Guardians, Game of Thrones, Minecraft, actually Minecraft was pretty good, Jurassic Park, I mean, there are a ton of games that they've made, but it's really unlikely that they'll be able to sell the back catalog of all those games. Licenses all this kind of stuff. Telltale has a crazy back story, but the issue is, is they don't really have the licenses to all of these games. Now, they also lost the rights to make a Stranger Things game in the shuffle. However, apparently they do have some licenses for some popular franchises, such as The Wolf Among Us and Batman, two games that are also pretty solid. I'm realizing I've played a lot of Telltale games. Telltale Games was founded in 2004, after LucasArts decided to move away from making adventure games, which they were largely known for at the time. The model of episodic content released in seasons over time that the pioneered, was in place from the start, but the first license they wanted to work with, Sam & Max, was being held by LucasArts, while they waited for the rights to expire, they tested their model on a two episode game based on the graphic novel, \"Bone\" and then they did a three episode game based on the CSI TV show. After they finally obtained the rights to develop a Sam & Max game, they made two of them, both of which were considered financial successes. After that, they worked their way up the ladder, with other licenses, such as Wallace and Gromit, and Homestar Runner, before being contacted by LucasArts to revive their classic Monkey Island series. Now, at this point, you might be noticing a trend with Telltale, they built their entire catalog of games around IP, that they had to license them instead of creating their own. Even back in 2008, this was causing huge problems for them. Because while technically they were making money on their games, the fact that they had to pretty much to license every single property they had, meant they were working with very small margins because they had to give so much of that money back to whoever held the licenses. So, around June of 2010, they decided to scale the model up, and start working with bigger properties, such as Back to the Future, Jurassic Park, and The Walking Dead, but of course, with the bigger properties came bigger risk. As these licenses were far more expensive, but they rightfully gambled that the awareness on those brands was a lot bigger than some of the smaller brands they were used to working with, so in their mind, they would make more money in the long-term, as it turned out, they were right. At least at first. Back to the Future ended up being their most successful game to date in 2010. Of course then in 2011 came The Walking Dead, which sold over a million copies in just 20 days. Things kept getting bigger from there, and for a while, it seemed like a month wouldn't go by without a new Telltale Game episode launching or some new series being announced. It wasn't all smooth sailing for Telltale though. From the very beginning their games were plagued with technical issues that caused them to run poorly, no matter what device you played them on. Although, fun fact, Telltale were one of the first companies that did jump on the mobile train. In fact, I know I played through all of the first season of Walking Dead on a first generation iPad Mini. And while it didn't run particularly well, it was really nice to be able to have those games available on literally like Macs and phones and consoles, like they were pretty much everywhere. Now, while storytelling in games was in a weird spot in the early days of Telltale, as time went on, other titles, such as, The Last of Us, The Witcher 3 and God of War, proved that other developers could certainly make very cinematic experiences too. The episode model had it fair share of downsides as well. Working with big names like Game of Thrones, and Guardians of the Galaxy, meant constant back and forth with the companies that owned those properties. This meant that episodes were being constantly reworked and rewritten, to the point where some of them would change 50 to 60 to maybe even 90%, just days before release. Like, oh, we're almost done, wait I don't like that, tear that character out, redo the game. Still needs to come out next week, - [Matt] That would be so gutting to me, like... I mean you get it though, these companies are very sensitive and some of the games actually had like the real actresses voice actors, I mean these were not like sorta like little budget mobile games, like these were big deals, but the fact that they were literally building these games and coding them and developing them as they were being released, meant that they had almost no room for error, And so when a company said, \"hey, we don't like that.\" They really didn't have a choice, they had to tear it out, and start over, and it just, just a mess! As time went on, the red hot sales started to delcine, but the leadership at Telltale was adiamant about sticking to the model. However, eventually, they were losing money on every game they released. On top of that mess, there are also major controversies surrounding the way that the company was managed with low company morale and a toxic office culture. Which is pretty understandable when you have to tear your game apart and redo it in a few days. And that is how we got to where we are today. The new Telltale says that they'll be talking about the new projects they're working on, and the changes they'll be making going forward in the next few weeks. But this all seems like a massive waste of time and money. The episodic model was cool when it came out, but the games industry has moved passed it, and Telltale failed to adapt when they needed to. So, let's hope they make their mistakes better this time. Or maybe they can just put all their games on Apple Arcade. - [Matt] Just make a Battle Royale. - This week the SEGA Dreamcast celebrated its 20th anniversary, but did you know that SEGA was originally a US company. Yeah, really, it's one of those weird Matt facts. The company was founded by Marty Bromley as Standard Games based out of Honolulu in 1940. Their focus was to provide coin operated slot machines to the US military bases around Hawaii. However, when the US government outlawed slot machines in 1951, Bromley was forced to set up a new company. Which he dubbed Service Games, a subtle nod to their military origins. Now, after banning slot machines, the government had a whole lot of confiscated slot machines that they didn't really know what to do with. Service Games decided to buy up all of those confiscated machines and begin importing them into Japan, where the slot machine business was booming. Service Games eventually merged with another company, which was then purchased and ended up with the name, SEGA. Now, up to this point, SEGA didn't actually make any of their own games, they had been solely relying on those slot machines, that is, until 1966, when they released their first game. Periscope. Now, while it was originally released only in Japan, it did eventually make its way to America. Arcades at this point were becoming more and more popular, to the point where SEGA's main competitor, Taito, released Space Invaders. The game was so popular that it actually created a shortage of coins in Japan. To compete, SEGA bought Gremlin Industries, which was based out of San Diego, so they could custom build all of their processors in-house. This allowed them to release super innovative titles, like, Buck Rogers: Planet of Zoom, which was the first game with 3D scaling, and turbo, the first racing game with sprite-scaling and full color. SEGA also bought a distribution company run by hiot-- Oh, Ken, help me, it's a Japanese name I can't say it. - [Matt] Hayao Nakayama. - Ken, ken, quick, read that name. - Hayao Nakayama. - Yeah, that, that, he later became the CEO of SEGA. Nakayama became a major player in SEGA's history. Bringing in Tom Kalinske and kicking off the console wars between SEGA and Nintendo. But that's a story for another episode. Thank you so much for watching this episode of This Is, you can definitely check out some of our other bomb diggity episodes, here and here, I can't believe you made me say bomb diggity. Make sure to subscribe and ring that notification bell. Because if you don't, you'll miss all the This Is actions, including all of Matt's wonderful bomb diggity jokes that he forces me to read. Because it's such a toxic workplace. (piano music)",
    "transcript_keywords": [
        "games",
        "game",
        "Telltale",
        "Xbox Game Pass",
        "Telltale Games",
        "Apple Arcade",
        "Apple",
        "SEGA",
        "Xbox Game",
        "Telltale Game episode",
        "Service Games",
        "consoles",
        "Xbox",
        "company",
        "Walking Dead",
        "Game Pass",
        "make",
        "gaming",
        "back",
        "pretty"
    ],
    "transcript_entity_values": [
        "three to six years",
        "LCG Entertainment",
        "three",
        "60 dollars",
        "Nintendo Online",
        "Wallace",
        "San Diego",
        "Apple Arcade",
        "CSI",
        "Bromley",
        "every year",
        "Future",
        "Telltale Games",
        "Nintendo",
        "Wolf",
        "Service Games",
        "just 20 days",
        "This week",
        "Telltale Game",
        "Microsoft",
        "Hawaii",
        "50 to 60",
        "Google Stadia",
        "the first season",
        "Athalon Games",
        "God of War",
        "Honolulu",
        "Halo 3",
        "seasons",
        "2010",
        "ken",
        "15",
        "90%",
        "Google",
        "Stadia",
        "Hayao Nakayama",
        "Skybound Entertainment",
        "Taito",
        "about 90%",
        "Matt",
        "just days",
        "iPad",
        "Gromit",
        "Telltale",
        "2008",
        "Galaxy",
        "Space Invaders",
        "Forza",
        "EA",
        "Xbox",
        "Borderlands, Guardians",
        "Buck Rogers",
        "Game of Thrones",
        "Monkey Island",
        "Jurassic Park",
        "Japanese",
        "2011",
        "1951",
        "August 28th this year",
        "first",
        "2004",
        "Xbox Live",
        "IP",
        "PlayStation 5",
        "a ton",
        "September of last year",
        "a few days",
        "PS5",
        "Standard Games",
        "the next few weeks",
        "The Walking Dead",
        "1966",
        "Apple Arcade",
        "the early days",
        "US",
        "LCG",
        "100%",
        "Robert Kirkman",
        "over a million",
        "Tuesday",
        "Xbox Scarlett",
        "Macs",
        "Minecraft",
        "these days",
        "PlayStation Plus",
        "Batman",
        "Gremlin Industries",
        "SEGA",
        "iPad Mini",
        "GameStop",
        "Gears",
        "one",
        "1940",
        "Apple",
        "LucasArts",
        "Tom Kalinske",
        "the next few years",
        "Battle Royale",
        "today",
        "Sam & Max",
        "around June of 2010",
        "Homestar Runner",
        "the final season",
        "Nakayama",
        "monthly",
        "3",
        "Ubisoft",
        "America",
        "two",
        "Xbox Game Pass",
        "next week",
        "Japan",
        "Witcher",
        "Marty Bromley",
        "Sony",
        "iPhone 11",
        "Ken",
        "Nvidia",
        "Walking Dead",
        "20th",
        "Valve",
        "The Walking Dead",
        "Switch",
        "30% more 50%"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "GPE",
        "FAC",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "GPE",
        "NORP",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT"
    ]
}