{
    "id": "6022e03wp2E",
    "title": "The Galaxy S10 Hole - Actually Better?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-02-07T18:17:20Z",
    "video_url": "https://www.youtube.com/watch?v=6022e03wp2E",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "galaxy s10",
        "samsung",
        "s10 plus",
        "s9",
        "versus s9",
        "vs",
        "hole punch",
        "hole punch display"
    ],
    "views": 614116,
    "likes": 19807,
    "comments_count": 3881,
    "description": "Before my review of the Samsung Galaxy S10, I have some thoughts about their new hole punch displays. The Cheaper Galaxy Phone -   Background Music Fili - Smooth Rides  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2BBmLUQ",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "2019 looks like it's gonna be a year filled with a lot of phones with punch out camera holes. And it kind of begs the question are punch out camera holes actually better than notches? like we're seeing this type of camera style coming out on the Galaxy S10 and we've seen it on HUAWEI Nova 4 and one of the HONOR phones has it. Hole punch phones are gonna be a thing this year like it or not. And as I see more of these phones come out, it just makes me wonder are these hole punch phones actually better than notch phones or are we kind of being sold this idea that they're better by companies. And if you think back to the original notch phone like why companies did it. If you think back to the essential phone they were trying to achieve a particular aesthetic. Right? They wanted to minimize the kind of abstractions and protrusions on the front of that screen to make it look ultra chlene on the front. to make it look ultra chlene on the front. And they did a pretty good job of it in 2017 And they did a pretty good job of it in 2017 that's almost two years ago. Two years later we have notches on phones with a water drop shape that looks pretty clean. And then we have some phones that are just like bang. I heard you like notches. Here's a notch. So for me I really like the idea of a hole punch screen it looks so much cleaner and honestly looks refreshing to me. From all those notch phones that we saw over the course of 2018 a circular hole punch camera looks really nice, and even some of the earlier conceptual work that I did was really fun to work with like being able to see your wallpaper move over that hole punch was just super cool. But there's a part of me and it's not even that small part of me. But there's a part of me and it's not even that small part of me. There's like a reasonable part of my brain that's like There's like a reasonable part of my brain that's like There's like a reasonable part of my brain that's like are we just being had are we just being played by companies? are we just being had are we just being played by companies? are we just being had are we just being played by companies? Because if you think about it, bezel were fine before like bezel give you a nice thing to hold when you're in landscape mode, they give you front facing speakers, and removing those bezel was something that looked nice, and removing those bezel was something that looked nice, and removing those bezel was something that looked nice, but that was really unnecessary. Notches and hole punch phones were basically fixing a problem that never existed for the consumers. if anything notches and punch out cameras are fixing a problem for manufacturers. The problem of how do we sell people more phones, like how do we sell you a new device like how do we sell you a new device a replacement device of something you already own that's already really good, like how do we convince you to buy something that's new like how do we convince you to buy something that's new like how do we convince you to buy something that's new this is the way. Right? When I look at models and concepts with the S10, it looks so cool and forget the fact that it's like an awesome phone like seven nanometer chip bigger battery all that stuff. It's gonna be a great phone but the fact that it looks the way it does makes me more interested. But I want to know what you guys think like is the hole punch screen is that something that you guys find a substantial enough feature to make it more of a compelling purchase for you like is that a big enough shift in technology for you to be like hey that's the phone i'm interested in, because we've seen iterative changes in phones for a long time. This to me is one of the bigger ones. And the weird thing is we know that samsung is working on an even better screen right one without any visible front facing camera and that is a technology that's endgame right? That's the phone that manufactures want to sell. That's the phone that every consumer wants to buy that completely clean front facing display. But even though we know that that's something they're working on and it's probably not that far in the future. This phone that S10 looks super cool to me. But is that enough for you guys? Is that hole punch camera something that you guys want? Or did you prefer the notch or are you gonna hold out for that completely clean phone? And I think we're probably gonna get there sooner than later. Okay. Hope you guys enjoyed this video thumbs. We liked it. Subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "Hole punch",
        "Hole punch phones",
        "phones",
        "punch",
        "phone",
        "Hole",
        "punch phones",
        "hole punch camera",
        "part",
        "camera",
        "hole punch screen",
        "front",
        "HUAWEI Nova",
        "companies",
        "guys",
        "notch",
        "notches",
        "bezel",
        "nice",
        "punch camera"
    ],
    "transcript_entity_values": [
        "seven nanometer",
        "S10",
        "2018",
        "HUAWEI Nova 4",
        "almost two years ago",
        "Two years later",
        "this year",
        "S10",
        "samsung",
        "2019",
        "2017",
        "the Galaxy S10"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT"
    ]
}