{
    "id": "65-shOzuBTo",
    "title": "Apple Watch Ultra changed my life! 8 months later review...",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-05-18T15:47:11Z",
    "video_url": "https://www.youtube.com/watch?v=65-shOzuBTo",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 336206,
    "likes": 9006,
    "comments_count": 433,
    "description": "I've been having so much fun with the Apple Watch Ultra! I love it so much more than I thought I would.   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we're gonna talk about the Apple Watch Ultra. I also have a little unboxing here. So being a tech creator, sometimes people just send you things and you don't even know like where they came from. I don't know where this came from. I'm not sure who sent this. There was no note. But I'm really excited about it so. It's a Titanium Apple Watch Ultra Band, and I've actually been really wanting one of these. And I didn't even know that they made one, and, well, here we go, we've got one right here that just showed up in my mail. So thank you I guess to SANDMARC or whoever sent this. I'm hyped to check it out. So let's open it up. Check that. Oh my gosh, this looks so good. I mean, it is a little masculine, but I am so here for it. Look at that nice. Oh wow, this is so nice. I can't wait to wear this. Like, I love the chain-link style. They also have a little tool here, so I feel like this is gonna be a bigger project than I thought it was going to be. I originally wanted to wear the Milanese Loop on my Apple Watch Band, but because you do need to wear the 45 millimeter, it was actually too big. So whenever I would wear it, it would completely just overlap the watch, because it was too large. So this is great because I'll be able to fit it to size of whatever I need. So here's our little tool. How do we do this? We've got extra pieces. I should probably save those. Let's put it on. It's definitely gonna be too big, but I don't feel like resizing it right now. Oh, it matches beautifully. Oh yeah, this is gonna look freaking incredible. But look how many of these I need to take out. oh my goodness, that's so many. Here's the band, and it clasps just like so. Oh, this looks so good, and it's really lightweight. It matches the titanium almost perfect. Wow, this looks so freaking good. I can't wait to size this. I'm not gonna do it right now, because I feel like this is more of a process than I wanna get into right now. So I'm gonna work on this later. So it has now officially been, I would say, maybe like seven or eight months, since the Apple Watch Ultra has come out, and it still, to me, has been I think, one of the most surprising Apple products that has exceeded my expectations. Obviously, we saw how cool it was in all of the demonstrations. That you could take it out in super low temperatures. You can use it as a dive computer. And you can take it and really push it to its limits. And yeah, that's cool, but like most people aren't really gonna put themselves in those scenarios. Now, when I first got this, I said I was gonna get scuba certified. I do sometimes make a lot of plans and then I never actually get around to being able to accomplish those plans or those goals. So scuba certification was something that like I wanted to do, but deep down I was terrified. Still am a little terrified of the water, because I'm not a strong swimmer, and going underwater, I don't like the feeling of it, I start getting a little panicky. And living in California, you would think that I should be quite comfortable in the water. Well, I'm not. So recently, I had this plan that my sister and I, were going to go and get Scuba certified to test out the Oceanic app on the Apple Watch. So I'm planning to do a whole video about the process of getting dive certified and using the Apple Watch Ultra as a dive computer. But when I went to the Maldives not too long ago, they had a dive center there, and I thought, okay, maybe I'll just go do one of their little intro dives. So I did, and all of my fears of the water were, well, they were correct. I was terrified. First thing that we did, there was like a little scuba exploration where you kind of go in, they get you comfortable in the water, and you kind of learn the ropes of what you're supposed to do when you actually go for the dive. And this is very entry level, so basically anyone can do this. So I thought, yeah, it'll be easy, let's go. And the wild thing about all of this, is I didn't even wear my Apple Watch on this first dive, because the only watch band that I had was the Trail Loop and I was afraid that it was gonna come off in the water, because it's Velcro. So I didn't even freaking wear it. I didn't even bring my ocean band, because I had zero intention of diving. I didn't even know that was an option. But once I got there and had read that the Maldives is one of the top destinations to dive, I felt like that was something that I couldn't let pass me by, in case I never make it back there. So we go out, we do this dive. I'm freaking out just in the shallow water, having to be able to just clear the mask. If any of you have ever dove before, you kind of know what goes into it. But as someone who doesn't like the water and is terrified, it was incredibly panic-inducing. But thankfully, I do have very good breath control and I'm able to calm myself down in very high-stress situations. So I used that and knew that you have to calm down or you're gonna die. That's basically a life or death situation when you are underwater. So anyway, I fight through the brewing panic attack as we're about to go into the water for the first time. I mean, even just like falling back into the boats, terrifying. I literally was probably crying underneath of my mask, so thankfully you can't see it. But I did it and then I was like, well wait a minute, I have like five more days here, and it takes four days to finish this certification course. So I decided to just go for it. I ended up getting dive certified. So I basically went from completely terrified, to oh my gosh, I now have a SCUBA certification. And it was honestly an incredible, life-changing experience. Why I'm kind of telling you this whole story is, because the Apple Watch kind of motivated me to do that. And I do feel like sometimes using tech to our advantage to motivate us to reach goals, to try to get in shape. I owe a lot of my fitness achievements to my gadgets, because they tell me when I'm not sleeping enough. Even though my body knows I'm not, I sometimes need to see those facts. I stopped running as much as I used to before. So I can tell that my cardio levels were obviously not where they used to be. I know my resting heart rate is pretty low and when I'm not running actively, I can tell that starts raising slightly. So I was like, all right, let's step up the cardio a little more to bring that back down and get back into that range that I felt was comfortable for me. So having these devices be able to just give us that little push that we need, I think is so awesome. I was definitely very impressed with this as a dive computer. Now having actually gone through the course and understanding what a dive computer actually is, I mean in theory, like I understood it, but I didn't actually understand until I was under the water. And this started blinking for the first time, telling me that I was at my safety stop. So one of the things that I realized while I was underwater, I did have two dive computers, just because you should always have a backup no matter what. The thing that I noticed though, is the first day that I dove, I had been learning everything in meters and my watch was in feet. I didn't really know how many feet were in a meter, which is probably something that I should have known. I didn't, but I did have the other dive computer on, so I was doing a little comparing here. So all that to be said, I finally understand the appeal of the Apple Watch Ultra. I am obsessed with the Apple Watch Ultra way more than I was when I first got it. I'd love to hear from you guys though. What is your biggest fear? I feel like honestly water is and was my biggest fear, but I definitely feel so much better having kind of conquered that and knowing that a lot of these things is mind over matter. Always easier said than done, but I highly recommend it and I hope that some of you can get to experience this incredible underwater world. Like I have just scratched the surface. Like there's so many places that I can go and dive and explore. And being underwater with these fish and these sea life, it's like an out-of-body experience, 'cuz it's like you don't belong there, like you are in their world. You have to respect and there's like this weird, unspoken understanding when you're just kind of like eye to eye with a sea creature. They're like, I see you, I know you're not supposed to be here, but I accept you and I'm gonna swim around you. It was lit, it was actually life changing. I say that about a lot of things, but this is definitely an experience that I don't regret and I can't wait for more experiences. There's gonna be so many cool videos that I'm gonna be able to make underwater and not only like this opens up a whole new world of SCUBA and diving tech. Oh my gosh, I can't wait. If you guys are divers, please, I would love to hear any advice you have, great places to dive, gear that I should check out. I am so excited for this new hobby and I'm so excited to be a part of the community. I've been watching a ton of videos and there's so many cool videos of people doing incredible things, diving in amazing locations, and now like getting into underwater housing, like different camera. Oh my gosh, this is, we're going down a complete other trajectory. Thank you guys for watching. This was supposed to be an Apple Watch video about how I've been liking the Apple Watch, but I feel like it led me to a new, really cool hobby. So yeah, the Apple Watch Ultra, I guess you could say it changed my life. Is that a click bait title or is that just, are we reaching? I'm not sure.",
    "transcript_keywords": [
        "Apple Watch Ultra",
        "Apple Watch",
        "Watch Ultra",
        "Watch",
        "Apple",
        "Apple Watch Band",
        "Apple Watch kind",
        "Titanium Apple Watch",
        "dive",
        "Apple Watch video",
        "Watch Ultra Band",
        "dive computer",
        "Ultra",
        "Watch Band",
        "water",
        "feel",
        "scuba",
        "kind",
        "Justine",
        "underwater"
    ],
    "transcript_entity_values": [
        "zero",
        "Scuba",
        "the Trail Loop",
        "Apple Watch Band",
        "the Apple Watch Ultra",
        "a minute",
        "Velcro",
        "one",
        "the Apple Watch",
        "Apple",
        "Justine",
        "seven or eight months",
        "SANDMARC",
        "a ton",
        "five more days",
        "four days",
        "a meter",
        "a Titanium Apple Watch Ultra Band",
        "today",
        "this later",
        "California",
        "two",
        "Oceanic",
        "Maldives",
        "first",
        "Apple Watch",
        "the first day",
        "First",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "FAC",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG"
    ]
}