{
    "id": "67wEGmtrtiM",
    "title": "🔪📦 Unboxing new Apple Watches! Series 9 and Ultra 2",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-09-20T19:12:28Z",
    "video_url": "https://www.youtube.com/watch?v=67wEGmtrtiM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 312861,
    "likes": 7971,
    "comments_count": 322,
    "description": "Watch the review here:  Pre-order Oceanic+ Dive Housing:   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://youtu.be/6J5o4J-Ttp8",
        "https://www.oceanicworldwide.com/product/computers/oceanic-plus-dive-housing/",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hello friends. Today we're checking out the brand new Apple Watch Series Nine, brand new Apple Watch Ultra Two. If you guys are new to my channel, hi, I'm Justine and I'm obsessed with Apple and all things technology. And the Apple Watch is one of my favorite pieces of tech, obviously next to the iPhone. But I'm so excited to show you guys this today. The one thing I am excited because they came out with a new pink color to, of course, match the new pink iPhone 15. Now, technically speaking, there's not a lot of huge upgrades from the previous version but what is really exciting is Apple has managed to make the new Apple watch the first product in their entire lineup to be a hundred percent carbon neutral which is a huge feat. I think this is super exciting and I love what Apple is doing to help further the environmental initiative. They promised by 2030 that their entire product lineup will be carbon neutral. And here it is. Let's unbox. This packaging is also special. They've managed to make the packaging a little bit smaller which is one of the ways that they're able to reduce the carbon footprint because they're able to put more of these boxes on a pallet and they've switched up the way that they're actually shipping the products and they're taking them by ocean instead of by air. And there's so many small things that they have done. There's now these new logos on the carbon neutral products. I actually did an interview that does a more deep dive into all of the environmental things that Apple is doing if you guys wanna check that out. It's a great interview with Apple execs Lisa and John, so be sure to watch that after you check this out. I love unboxing Apple Watches. It's such a magical experience. I don't think we give enough credit sometimes to the packaging team. You guys really know how to do it. Like this is so cool. So you've got our Apple Watch and the new Sport Loop band. They have an entire lineup of Apple Watch bands now that are completely carbon neutral. They're using all sorts of recycled fabrics, old recycled watches, especially these ones from Nike. They've got these little specks in it. A lot of the threads in the sport loop they've reused from previous versions. And it's amazing all of the small little things that are making such a huge difference. Ooh, it's so great. Since I've been wearing the Apple Watch Ultra, these tiny, smaller, 41 millimeter, it's gonna feel so small and dainty on my wrist. I can't wait to wear it. I'm loving these new woven cables. Nice little pink color. It's so great. Oh, this looks so good. I've been wearing this Apple Watch Ultra for so long. It's wild how much smaller this is, especially on my small wrist. Now, this is the new Nike Watch band. This is also using recyclable materials. I love the Nike bands. They're some of my favorite. (bright music) So this is this stainless steel Apple Watch Series Nine and check out the modern buckle. This is the new fine woven Apple Watch band. Ooh, that's a nice fit. I really like this. It's really pretty. The fine woven kind of feels like a soft felt, like a fabricy kind of feel. It's really nice, and I'm not sure if it's on the same level as leather, but it's kind of in its own new category and I really like it. So now we're gonna test out the new feature, the pinch to select. - [Man] It's called Double Tap. - Double tap. It's a pinch, it's a pinch. - [Man] Well, it's called double tap. - Double tap is here. So basically you just lift your arm up and you pinch your fingers together, just like so. And right now I'm scrolling through all of my home feed stack and this is also great if I get a phone call 'cause I can just lift my arm up, check to see if I want to answer, double tap and I'll answer the call. Okay, I've answered. Oh, we've got a little bit of an echo. Now I'm gonna hang up on you. And there we go. (bright music) Today we have the Apple Watch Ultra Series Two. Two? Just two, Apple Watch. - [Man] No series - No series. Love this thing so much. The first version is absolutely incredible. It honestly has been so life changing for me so I can't wait to check out the second version. Now, I'm not gonna lie, there's not a lot of huge upgrades from the Apple Watch Ultra to the Two. So I do feel like if you have the first version, there's probably not a really huge reason to upgrade to the Two. But if you don't have one yet, let me tell you. This thing is absolutely perfection. Let's unbox and check it out. So here's the Apple Watch and we have the new Trail Loop. They also came out with a new Orange Ocean Band. Last year the main one that they featured was the yellow. So I'm definitely gonna have to order that orange one for my next dive trip. And here it is. Now to look at both of these side by side, there really isn't much of a physical difference to be honest with you. I don't even think that I could tell the difference if they were sitting next to each other. (bright music) The only difference is my Apple Watch Ultra has been through some things. So there looks like there's a little, no, it's the same. The amount of places and things that this has been through, it looks almost perfectly brand new. So these do definitely hold up well. New braided cable charger. Now, when the Apple Watch Ultra first came out, I thought, \"Wow, this is really cool. These people are doing all these adventurous things like hiking and diving. I'm never gonna do that.\" Well, I said in the review that I wanted to review the Apple Watch as a dive computer and it took me a while. I've been diving for about three months now and I am so obsessed. If it wasn't for the Apple Watch Ultra and the Oceanic Plus app making diving so accessible it would've never been something that I ever considered as someone who was terrified. My biggest fear was going underwater. I kid you not, barely could even swim, to now I'm trying to figure out how I can dive at least once or twice a month. Thankfully, I live in California so the ocean is quite close, so it's a little bit easier but it's definitely not an easy hobby to do often. So it only makes sense that we go for a dive and take the Apple Watch Ultra Two with me. This is also pretty exciting because the makers of the Oceanic Plus app also came out with a dive housing for the iPhone. So the entire time that we're gonna be underwater we're gonna be filming it with a new iPhone 15 Pro. I can't wait. (bright music)",
    "transcript_keywords": [
        "Apple Watch Ultra",
        "Apple Watch",
        "Watch Ultra",
        "Apple",
        "Apple Watch Series",
        "Watch",
        "Apple Watch bands",
        "woven Apple Watch",
        "steel Apple Watch",
        "Ultra",
        "Watch Series",
        "Watch band",
        "Nike Watch band",
        "things",
        "Nike Watch",
        "Apple Watches",
        "dive",
        "carbon neutral",
        "carbon",
        "Series"
    ],
    "transcript_entity_values": [
        "the Apple Watch Ultra",
        "Nike",
        "the Apple Watch",
        "second",
        "one",
        "the Apple Watch Ultra Series",
        "Apple Watch Ultra Two",
        "Apple",
        "Apple Watches",
        "Sport Loop",
        "Justine",
        "Apple Watch Ultra",
        "Two",
        "about three months",
        "iPhone",
        "Today",
        "Double Tap",
        "Trail Loop",
        "2030",
        "Orange Ocean Band",
        "Last year",
        "41 millimeter",
        "Nike Watch",
        "today",
        "two",
        "California",
        "15",
        "John",
        "first",
        "Apple Watch",
        "a hundred percent",
        "Apple Watch Series Nine",
        "the Oceanic Plus",
        "Lisa"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PERSON"
    ]
}