{
    "id": "6aGItAKu6fY",
    "title": "Is Lukie Games a SCAM?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2024-06-23T15:01:30Z",
    "video_url": "https://www.youtube.com/watch?v=6aGItAKu6fY",
    "category": "Science & Technology",
    "tags": [
        "lukie",
        "games",
        "lucky",
        "lukie games",
        "refurb",
        "console",
        "retro",
        "dkoldies",
        "nintendo",
        "sony",
        "microsoft",
        "playstation",
        "xbox",
        "ds",
        "austin",
        "austin evans"
    ],
    "views": 586114,
    "likes": 14363,
    "comments_count": 956,
    "description": "Subscribe for more!  TikTok:  Instagram:  Twitter:  Threads:   Chapter Titles: 0:00 What is Lukie Games? 2:40 Ordering 3:30 Nintendo DS 7:43 NES Top Loader 10:16 Nintendo 64 13:55 Xbox 360 18:02 PS3 Super Slim",
    "description_links": [
        "https://www.youtube.com/austinevans",
        "https://www.tiktok.com/@austintechtips",
        "https://instagram.com/austinnotduncan",
        "https://twitter.com/austinnotduncan",
        "https://www.threads.net/@austinnotduncan"
    ],
    "transcript": "- Lukie Games is a store (logo whooshing) that is being compared to DKOldies for a reason. Now, they have a wide selection of retro games and consoles. Sounds great, right? Except for people have some truly terrible stories about this. So let's get to the bottom of is Lukie Games actually worth it? What exactly is the drama with Lukie Games? 'Cause until we were doing this video, I was not really aware of them. - [Alex] I think it would be better if you just read it from the community themselves. - Okay, okay, let's do it. \"Sometimes they're good, but they're, quote, 'cleaned and tested,' is usually not true. I spent two hours just cleaning five NES games.\" \"Lukie is worse than DK. DKOldies at least has their own inventory.\" \"They suck. They used to always buy my games off eBay for reasonable prices, then immediately re-list them with the same photos I used and a 200% price increase.\" So there's multiple people accusing Lukie Games of literally just reselling their eBay listings. Yeah, that seems not great. Let's see what we've got. Authentic Nintendo 64 system. It has an N64, one generic controller, don't like that, but at least they say it. And a power supply and AV cable. And okay, interesting. So even though they say a 90-day return policy across the whole site, this one specifically does say it has been cleaned, tested, works perfectly, includes a one-year warranty. So that's actually what I really want to look for on a site like this. Because if I'm gonna pay a markup for a company to have professionally cleaned, refurbed the system, I also want a return policy which is robust and importantly, I want a warranty. So while the reviews are quite negative, what I'm seeing here, it's they're checking a lot of the boxes, right? Like, this looks very reasonable. Is that a copy of \"Pokemon LeafGreen\" for $260? (lighthearted music) Okay, so yeah, maybe this is not gonna be as straightforward as I thought. So they've got DS Lites. The discounted conditions are in the 60, $70 range based on if I want a red one or a white one. The nicer-condition ones are $108. And the DSi XLs are expensive. That's 200 bucks! Okay, we're gonna do something a little different here. Because there's such a huge price disparity between some of these consoles and the condition, I'm going to purchase a great condition Nintendo DS for $182. And I'm also going to get a discounted system with some cosmetic flaws for $60. So we're gonna get both these and see is it really worth triple the price? So with that, my friends, I have everything I need to place a very, very substantial order at Lukie Games to see is this an actually good place to buy retro video games or are we about to get ourselves into a world of hurt? Only one way to find out besides selling them stuff on eBay apparently. (chuckles) (scene flicking) It is our lucky day! So I have two packages here. So the first one is addressed to our good buddy, Mr. Pierre Luigi. But because this order was so large and conspicuous, I have a second package that was addressed to Ken going to a different address. So believe me when I say we're going to annoying lengths to make sure that we're not found out because who could ever guess that Pierre Luigi is a pseudonym for Austin Evans? No one knows that, that's impossible information to find unless you look at the name of the credit card, which is says it's Austin Evans. But (throat clears) anyway, we're trying to do our due diligence to make sure that Lukie Games doesn't figure us out. Inside our squashed box, we have a whole bunch of stuff. So there's some padding and oh, oh my goodness, that's a lot of things, wow. Okay, let's do this one at a time. Ah, okay, so we're gonna start out with one of the smaller items. So this is our Nintendo DS. Don't adjust your phone screens, my friends. We have two identical looking DSs. Now, these were ordered separately. So one is in one package, one was in the other. But essentially, one of these was a very affordable, cosmetically flawed DS. The other was one that was in, what do they call it? They don't call it good condition. They call it it like- - They call it great condition. - Great condition. So I'm gonna try to figure out which one's which 'cause there was a massive price difference between the two. It was, like, 60 versus 160 or something? - [Alex] It was triple the price. The cheap one was $60 and the other one was $182. - Yeah. I know that I was the one who hit the Order button, but oh. Okay, let me see if I can tell the difference 'cause I pulled them both out, I'm not entirely sure. So the first DS, I'll say, is in relatively decent cosmetic condition on the front. It's got some scratches on the back, but it's not too bad. And it does have some wear on the inside, but it's in decent shape, I would say. I would say this is fine. The other one has some much deeper scratches on the outside, but other than that, it's actually in good shape. So the back looks fine and the inside screen is a little bit better. Is this the expensive one and this is the cheap one? - [Alex] You are incorrect! - Are you telling me that this is the expensive one? - [Alex] That yes, that is the one that you paid triple the price for. - The only reason why this is in better condition is because this doesn't have as many scratches on the top. So if you're gonna grade the consoles based on that one, then that's the way you would pick it. But besides the scratches, which I'll admit, there's a lot of scratches on this, in every other way, this one is worse. I'm actually mad. I'm actually mad. - [Alex] You know what's gonna make you even madder? If you try to buy those same ones right now, the discounted one is now $58 and the great-condition one is now $205. (chuckles) - In the span of a week, they raised the price, especially on the nice one, over $20. Who is spending 200 plus dollars on the fact, yes, this is the worst one? We do have further things to do. I still need to test that these actually work for games. But I am, like, actually mad. Are you kidding me? I spent $127 on a copy of \"Pokemon Sapphire,\" and they just chucked it in the box with the rest of it. They couldn't even, like, put it in, like, an envelope or something? Your $3 copy of \"Nintendogs,\" it gets a bag. Your $127 copy of \"Pokemon Sapphire,\" yeah, just throw it in. - [Joanna] $3? (bell chiming) - How much was the \"Nintendogs?\" No offense. - They're $17. - That's not good either, but okay, sure. - [Joanna] That's a fair price. - I'm gonna play with my $60 DS that was in better shape for this. So we're gonna test both of these to make sure they actually work. So I have a $17 copy of \"Nintendogs.\" So we've got Momo and Chi. Let's say, what's up with Chi? Here's a balloon. Now, there's a lot of stuff in here. Thank you. Anyone, a balloon? This clearly works fine. This clearly works fine. So we'll go ahead and shut that down. All right, we're gonna try \"Sapphire\" now. Seems to be booting fine. (Nintendo DS buzzing) Now is there a saved file? There is a saved file, Misty! Oh, we're gonna play as Misty. What's Misty been up to? We've got Muddy the Marshtomp, who is level 35. Everyone else is level 12. Level 13 Gulpin. Boo the Whismur, that's pretty good. Okay, this does work totally fine. Let's open this copy of \"Sapphire\" up and make sure it's legit. And also see if the battery has been replaced or not. Oh yeah, that's real. Yeah, yeah, that's a real cart. The fact that we spent three times as much on a great-condition DS, and it is, I would say, acceptable, but actually in worse condition than a $60 DS makes it pretty clear to me that condition means almost nothing to Lukie Games. And they're just, you know, they honestly, I think, what they did was they looked at the two on the shelf and goes, \"That one's a little scratched,\" and grabbed, it. (Nintendo DS clacking) It's okay, that was the bad one, it's fine. Actually, that's the expensive one, so it's already scuffed anyway. I don't know, man. This is a terrible start. (scene flicking) Next up, we have, well, a lot of stuff, but I see bits and pieces for our NES. I'll say that at first glance, this looks to be in pretty good shape. What was the condition of this NES top loader? - [Alex] A very confusing, just refurbished. They don't specify any type of, like, condition, whether it's good, bad, or whatever. The only thing it says is it's refurbished, and it has been thoroughly cleaned and tested. Works like new. - Okay, I feel good. Now, I'm gonna fire it up in a second, but just to kinda set expectations, how much was our NES top-loading bundle? - [Alex] We paid $210 for the entire bundle. So that's the console, the Zapper gun, and the two games. If you were to buy it on their website right now, it's closer to, like, 230 something. - That's crazy to me that they've raised the price so much. Okay, let's see what we got. Ah, the sound of a cathode ray- (label grating) (TV sizzling) - [Joanna] Ah, music to my ears. - All right, let's try \"Super Mario\" real quick, and then we'll do some \"Duck Hunt.\" (\"Ground Theme\" by Koji Kondo) (sad arcade music) (crew laughing) - [Joanna] Well, that didn't last long. (Austin's throat clearing) - One more time. (sad arcade music) (Joanna scoffing) - [Joanna] That was even worse. - Well, I'm just warming up. You know, it's a... - [Alex] Do you really need to warm up for one-one? - [Joanna] Gosh, dude, that's pretty bad. (sad arcade music) - Oh my. (chuckles) Hey, Edit Team, you can cut that out, right? Not cut that into, like, a sick montage of me dying over and over again. Just, you know, cut it to like, \"Oh, it works,\" and then we just fast forward to all that part. Yeah, thanks, that will be great. (Zapper gun clicking) - [Alex] I mean, you're definitely better at this than \"Mario.\" - Okay, that was uncalled for. That was rude. (upbeat arcade music) This is honestly really fun. As far as the actual NES, I have no complaints. It is in good condition. Original controllers, everything seems to work. No concerns at all. The slight thing I have against it is just that it was a little bit on the pricey side, but I do know these top loaders were a lot less popular. But to give Lukie Games a little bit of credit, I mean, we do have a 90-day return policy. This doesn't seem to come with a warranty, which is a bit of a downside. But at least compared to the DSs, specifically the expensive one, which is a complete ripoff, this, this is a lot more like it. (scene whooshing) Next up, we got our N64. (Austin laughing) - [Joanna] We got it. - Look, look, it's literally (chuckles). So at first glance, it looks fine. I mean, obviously, the gray N64, if we're honest, is kinda, like, the lame one 'cause they actually had, like, really cool colors. This is a controller design for someone with three hands, and that's in fact one more hand than I have. So can't get worse than that, now can it? I'm curious with \"Stadium.\" So this is not, like, an especially expensive game, right? It was like 30 bucks or something? - [Alex] It was 40. - $40, okay, a little expensive, but I mean, it looks fine. The label's still intact. Thankfully, no one ever filled out the, \"This Game Pak belongs to.\" - [Joanna] Oh, now you can fill it out. - I could, you know, the reason why Nintendo did that was they wanted people to write on it so they wouldn't be able to, like, sell their games or trade them. (chuckles) I mean, I'm just hypothetically saying that, but, like, it was Nintendo. All right, let's give this a try, shall we? (switch clicking) - [Pikachu] Pika! - That immediately works. (dramatic arcade music) (jovial arcade music) (Austin's throat clearing) Oh, look at that. It's asking me if I want to connect my Game Pak. Why, I would love to. (switch clicking) (bubble wrap crinkling) Because I bought a Game Pak from Lukie Games! The way this works that you plug it into the actual N64, and then what you've got yourself is a Game Boy cart slot for your original Game Boy games. So it's called a Transfer Pak, but you actually could do a couple of things with it. So in a game like \"Pokemon Stadium,\" you could actually transfer your Pokemon over and play them in the game, which is cool, but you could also straight up use \"Stadium\" as a Game Boy emulator, basically. Oh, it's not working. (magical twinkling) All right! - [Alex] You mean the $21 Transfer Pak that we bought from them isn't working? - Well, I'm just gonna play some \"Stadium\" mini-games 'cause that's more fun. Yeah, dude, I'm really bad at this. I forgot how bad I am at this. (crew laughing) Wow, this is really hard. (carefree arcade music) Yo, what's up! I'm the hardening winner! - [Alex] No, thanks, no. - Well, so how much did I pay for the N64? It was $95? - [Alex] Yes, it was $95 for the original, great-condition console, the generic controller, and all the cables. - Yeah. - And all that stuff. - That's a reasonable deal. I don't think it's a great deal. Mind you, I'm not trying to say like, \"Go out, and you know, grab a Lukie Games N64 right now,\" or something. But like, because, you know, it has got the warranty, it is in good condition, like, no problems with that. 20 bucks feels okay for the Transfer Pak as well. What about \"Pokemon Stadium?\" Is that like, that feels okay to me, but also, I don't know 'cause, like, some of these games are sometimes way more expensive than I expect it to be. - [Alex] Just like just the cartridge is, which is what we got. - Yep. - You can get it for, like, 20, 25 bucks. - Oh we got ripped off. This is $40. If you pay premium prices, you should get a premium product. And I'll be honest, this feels pretty much, like, I could have just got this straight off of eBay, right? Like, yes, it is in pretty good condition, but I think back to the DS, the DS that was in, supposedly, great condition was worse than the one that costs 1/3 the price. Like, I'm getting the picture here of what DK, (throat clears) Lukie Games is all about. (scene flicking) Next up, (groans) let's go back to our big box, where we've got our Xbox 360. So again, give 'em a little credit. Just like the photo, it is a boxed, old-school Xbox 360 controller. We have the chungus of a power brick that the original Xbox 360 came with, as well as its accompanying power cable. Now, it looks fine, I would say bordering on good. I mean, a couple little scratches and scuffs. The door still works, the USB ports are clean, power button sounds fine, memory slots. Everything seems okay. Now, it also has a hard drive, but it doesn't say the actual capacity, it just says hard drive. So I think this is 20 gigabytes or this is supposed to be 20 gigs, right? It doesn't say anywhere, so I assume it's just 20 gigs. It just says, \"Xbox 360 hard drive.\" Let's pull the TV up. Let's see how this thing actually works. Okay, let's see if our 360 works, shall we? Oh, the good Xbox noises. And by good, I mean, grindy, but that's what it always sounded like. Hey! You know what? I gotta say, so we're using component here, not HDMI, which is the best thing we can get out of the 360. But this feels, oh! It's got the old school interface, holy (duck quacks). Yo, I haven't seen this in forever, dude. Oh my God, that's so sick! So this was the second iteration of the Xbox interface. And to me, this is my favorite. The original Blades, they look ugly. But this, this is nice. And it's way better than the current one. All right, I'm so excited. Please let the disc drive work. Excellent, and it looks clean too. You know what? I know exactly what happened with this 360. Someone bought it in 2008 or even 2009, maybe put it online once or twice, and then never used it again. Which sounds a little sad, but what it means is that it is in very good shape, and it is still running the vintage primo software before it got loaded up with, like, ads and nonsense. Now, if this disc drive works, which is not a guarantee for something that's this old. (dramatic music) (crew laughing) - [Alex] Aw. - \"An update must be applied to your console to play this game. If you decline this update, you'll not be able to play this game. Do you wanna apply the update now?\" Hell no, brother. (controller clicking) Normally, I would love to show you it working, including the disc drive works 'cause it is, it is reading the disc, but hell no am I going to update this beautiful new Xbox experience. How much do we pay? And we'll start it out with \"Bad Company 2.\" How much did I pay for this complete in-box? - [Alex] Well, apparently, that was not a very popular game. We paid six bucks for it. - Yep, \"Bad Company.\" Y'all that never played \"Bad Company,\" it was really good. I played a lot more \"Bad Company 1,\" but two is good too. Okay, great, solid. Now, how much did I pay for this console? - [Alex] So I will start with, this is the other only item. So we only got two items that had a one-year warranty. This is the other one. - One-year warranty, got it. They're gonna need to honor that pretty soon if I use this. (laughs) - [Alex] Yeah, and we paid almost $140. - Wait, like, 1-4-0? - [Alex] Yeah, almost. - Wait, what? - [Alex] Yeah. - I don't think I can justify $140 for this as much as I personally love that fact that I've got this old-school software. Because here's the other problem, right? Now, yes, it is nice that out of all of our items, the 360 and the NES do have the one-year warranty, but the problem is, is that people had a lot of issues getting Lukie Games to actually honor the warranty on the consoles. So take that with a grain of salt. I'm happy that we now own an Xbox 360 with this beautiful interface. So every time someone talks about the glory days of Xbox, I can point them right here and point them to the fact that that's not red yet. But as far as value goes, this is not strong at all, like, it's the opposite. In fact, I would argue, like, $50 too expensive. Last, but certainly not least, (scene flicking) we have ourselves a Super Slim PlayStation 3. Now, it's funny, this is the only one that actually has a whole letter about it. Probably because the Super Slim was the worst one. \"Congratulations on purchasing a PlayStation 3 system from Lukie Games. This is a used PS3 system that has been cleaned and tested.\" Before I open it, this was in good or great condition, right? That's what they called it, the great quality, great condition. - Yes, this is basically the highest-quality condition that they sell. (Austin exhaling heavily) - I'm scared, I'm really scared. Ay-ya-yai-yai-ya, okay. All right, let's do it. Three, two, one. 1 3/4, 1/2. (bubble wrap crinkling) (PS3 clicking) Okay, this could be worse. (flashback twinkling) What's all this? Ew! Ow! While this looks cosmetically dirty and not, you know, in great shape, sticker missing, everything, but there's no, like, actual damage to it. Oh, look at that. That's disgusting. That looks like snot. (groans) Okay. Okay, well, we do have a game for it! I actually have two games for it 'cause (scoffs) I really wanted to buy \"SOCOM\" for PS2 just 'cause this is really fun. But we also have \"SOCOM 4\" for PS3. Unfortunately, Ken's not here. So I'll play \"SOCOM\" in his honor. Here goes nothing. (PS3 beeping) Okay, hearing quiet PS3 noises. Hey! (mesmerizing music) - [Alex] Ah, oh, okay. Sound, but no... - How do we get sound but no video via HDMI? What? All right, we've got ourselves the XMB, the only interface better than the NXE. And it does show that we have a 160 gig hard drive, which has 130 gigs left. So that all seems fine. In fact, I would say more than fine. Like, this is in working order. And I will tell you that, I mean, obviously, I'm not running anything yet, but it running. It sounds very quiet. Let's try to play some \"SOCOM 4,\" and then we will determine if we got screwed or we got lucky, get it? 'Cause Lukie Games, and I was trying to, like, make a joke that's like... - Oh! - It's funny, yeah, yeah. - Oh. - Whoa! (dramatic music) All right, let's do it, gang. (gunshots popping) (flesh squelching) Wow! That was really fast! (Austin laughing) Huh? You know \"SOCOM\" is not what it used to be. I thought you'll just be able to go (imitates gunshots whistling), not die immediately. So how much did I pay for, first of all, \"SOCOM 4\" for PS3? - [Alex] For \"SOCOM,\" you paid $16. - Not bad, how about \"SOCOM\" for PS2? The better game. - [Alex] $5. - Five bucks, wonderful. Okay, great. How much did we pay for our great-condition Super Slim PS3? - [Alex] We paid $190, (Austin laughing) which is still a discount 'cause if you were to buy this exact one from them now, it's $200. - Oh my God, so bad. So for context, when they were making these things, they were 200 bucks! At least the 12 gig versions were 200 bucks for, like, several years. And I, boy, I (sighs). Man, like, the only thing I can say about it that's remotely good is it is not physically broken like the one I got from DKOldies. But look, if we're gonna sum up Lukie Games, it is like this: DKOldies, but worse? Like, at least DKOldies has a warranty! I don't think I have anything positive to say except there's one big but here, all of the games we got did work, they had been tested, and some of the prices weren't terrible. So if I can give them anything, they have a decent selection of vaguely okay-priced games. But as far as the consoles go, man, this is not it, like- - [Joanna] It's, like, you only had luck with the games, Lukie Games. - Oh, Joanna just did our outro for us. (scene flicking) Whoa, whoa, whoa. Hold on, hold on, hold on, before the video is over, we were just cleaning up, and Alex made a surprising and shocking allegation! So if you look real, real close in there, there actually looks like, and I can't believe I'm about to say this, a little bit of rust? I'm not entirely sure. Well, actually, I'm gonna crack it open real quick, but there's no way we got two rusty Super Slims. Like, there's no way. So it is, you see all this, like, stuff? It's definitely gotten wet before. Do you see all those little, like, lines? It looks like spores growing in \"Last of Us.\" - Oh, oh my god. - [Austin] I mean, it's way smaller, to be fair. - Don't describe it like that. - I mean, I think what happened here is that maybe it didn't get outright, like, soaked, but there was definitely a lot of humidity in the area. And so you've got little bits of rust on the top, but especially on the bottom, you can see where the liquid actually ran and sort of, like, dried up. And it's, like, got legitimate bits of rust. Yikes, man. (chuckles) Remind me to never ever buy a Super Slim PS3 again in my entire life, I'm so over that. (wary music)",
    "transcript_keywords": [
        "Lukie Games",
        "Games",
        "Lukie",
        "game",
        "Game Boy games",
        "good",
        "condition",
        "Game Pak",
        "Yeah",
        "Game Boy",
        "works",
        "give Lukie Games",
        "Xbox",
        "fine",
        "great condition",
        "great",
        "SOCOM",
        "good condition",
        "Super Slim",
        "price"
    ],
    "transcript_entity_values": [
        "5",
        "90-day",
        "21",
        "almost $140",
        "Nintendogs",
        "DKOldies",
        "Ground Theme",
        "over $20",
        "first",
        "Only one",
        "Super Slim PS3",
        "two",
        "200 plus dollars",
        "60",
        "58",
        "1-4-0",
        "N64",
        "200%",
        "one",
        "60",
        "260",
        "16",
        "190",
        "Xbox 360",
        "Five bucks",
        "127",
        "six bucks",
        "Marshtomp",
        "the Super Slim",
        "Stadium",
        "Austin Evans",
        "30 bucks",
        "Sapphire",
        "Ken",
        "USB",
        "Austin",
        "Game Pak",
        "one-year",
        "40",
        "Pokemon Stadium",
        "PlayStation 3",
        "Blades",
        "Lukie Games",
        "Momo",
        "two hours",
        "Joanna",
        "1 3/4",
        "Pokemon Stadium",
        "17",
        "Yo",
        "Pierre Luigi",
        "182",
        "1/2",
        "13",
        "25 bucks",
        "160",
        "200 bucks",
        "2008",
        "Koji Kondo",
        "130",
        "the Transfer Pak",
        "20 gigabytes",
        "Order",
        "108",
        "Last of Us",
        "one-one",
        "One-year",
        "140",
        "40",
        "1/3",
        "Super Slim",
        "Xbox",
        "2009",
        "Pokemon LeafGreen",
        "NXE",
        "230",
        "Super Mario",
        "200",
        "Lukie",
        "SOCOM",
        "SOCOM 4",
        "eBay",
        "Lukie Games",
        "70",
        "205",
        "One",
        "the span of a week",
        "Misty",
        "Alex",
        "Super Slims",
        "Mario",
        "Whismur",
        "three",
        "210",
        "Lites",
        "20 bucks",
        "Three",
        "DK",
        "Nintendo",
        "Xbox 360",
        "50",
        "Pokemon Sapphire",
        "12",
        "Pokemon",
        "second",
        "PS3",
        "95",
        "five",
        "NES",
        "Bad Company 2",
        "several years",
        "35",
        "3",
        "Duck Hunt",
        "Chi",
        "Game Boy",
        "AV",
        "20"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "MONEY",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "MONEY",
        "FAC",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "LOC",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "MONEY",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL"
    ]
}