{
    "id": "6AwNWzcQxoM",
    "title": "I Was Wrong About the PS5...",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-11-14T18:16:09Z",
    "video_url": "https://www.youtube.com/watch?v=6AwNWzcQxoM",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "ps5",
        "playstation 5",
        "sony",
        "microsoft",
        "xbox",
        "series x",
        "series s",
        "next gen consoles",
        "consoles",
        "gaming",
        "games",
        "videogames",
        "video games",
        "ps5 review",
        "review",
        "tech",
        "technology",
        "best consoles",
        "ps5 vs series x"
    ],
    "views": 151723,
    "likes": 5058,
    "comments_count": 981,
    "description": "What has been your favorite part about the PS5?   Is the PS5 ALREADY Overheating?  Is the iPhone 12 Pro Max Worth It?  The Razer Book Is(n't) a Gaming Laptop:  BLIND Mystery Tech Challenge:  What PS5 & Series X Are Missing:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/KXPjk4ndbJE",
        "https://youtu.be/9Whx7gQaB0M",
        "https://youtu.be/mKtnjV-LtI8",
        "https://youtu.be/_IvNqh8z4C0",
        "https://youtu.be/MugTyyYrTlM",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is. We have actually now played the PS5. How has your testing of the PS5 gone? - I've seen the ray traced light. I will never be the same again. No look the PS5, as I adjust the controller to its proper location is a very clear step forward over the last generation, right? I've said this many times, the PS4 and the Xbox One were weak. They were puny. They weren't ready for the power of next generation. Look, they were just not aggressive consoles. Right. They had slow laptop hard drives, they had terrible CPU's, they had okay graphics but like they were way too conservative and it kept gaming sort of held back for the last six, seven years. And then when you look at the PS5, and I'll throw in the Series X as well, but both you look at the whole next generation. It is a huge step forward in a few key areas. - So I've been playing mostly Series X now for a you know, a couple of weeks. And then just now played a little bit of the PS5 and it's weird where you see like the huge improvement and it's always in the things that you think don't matter. But where I've been disappointed with both consoles, the like character models have not had like, have not been great. - Launch games are always rough. Right? You look at like the first like Xbox 360 and PS3 games, I mean they were nothing like GTA V which came after them. This time around. I think the emphasis was on something different because put simply graphics kind of, sort of, they don't plateau. But like once you have something which is incredibly detailed, if you add double the detail, it's still really detailed. - [Matt] Yeah. It's logarithmic, it's not linear so it's-- - It's in the little things that you really notice. Things like load times, which are, I wouldn't say instant, but instead of 30 seconds to a minute, minute and a half, you're talking about two seconds, five seconds. - Load times have not even been like a blip on my radar. I got to train myself to be back in the game immediately after I die and that's really great because I die a lot. - I do too. - But yeah, the thing that, again this is launch bugginess, at least I'm hoping, that has been super disappointing for both consoles is the 120. I have the same TV that we use in our main channel video where we kind of talked about what monitors or TVs you should get for the Series X or PS5, and which we confirmed has 4K120 and it has HDMI 2.1. So a week ago when I plugged in my Series X that did not work at all. Two days ago I got a final patch. I could do 4K120, things like Ori And The Blind Forest work. - Great 120 example. - The one that really I loved and hated at the same time was Miles Morales. You were playing that and there's two options-- - Performance - Performance which it looked-- - [Both] Fidelity, fidelity. - Yes, it looked great. However, - [Man with glasses] However. - [Matt] 30 FPS. - So this generation has been promised to deliver 4K60 FPS as the target with support up to 120 FPS, and theoretically you could go 8K out with like video and stuff. But the idea is, is that we're the last generations who tried to push on more and more resolution, this is pushing more on frame rate, on immersion, on sort of image quality beyond just sort of giving you more raw pixels, right. The right call, absolutely. We don't need 8K gaming. But if you're a developer, you can do whatever you want essentially. I mean if you try to ship a game at 4 ADP, you might get a weird call from Sony saying, Hey, don't do that. But I mean generally speaking, you can do whatever you want and there's nothing stopping them from shipping 30 FPS games still. And in fact, I would say some games are okay at 30 FPS. - I would agree-- - Not all though Spider-Man 360 - This is my problem. Is it's insomniac, which is first party. This is a flagship title for the next gen console and it's Spider-Man, arguably one of the most fast paced superhero games that's ever been made. So like everything about this, I think should have been at a minimum 60 FPS. - [Man with glasses] I will say, so just speaking about Spider-Man, like we were saying two modes, there's fidelity mode which is 30 P, all the visual bells and whistles, it looks great. - [Matt] Again, it looks amazing. - [Man with glasses] Absolutely. - [Matt] No questions there. - Or you can do performance mode, which essentially strips out a lot of the fancier things such as ray tracing. You do get a pretty decent 60 FPS, but use that on some of these things, which I get like, look ray tracing is an expensive thing even with the hardware that is built into these consoles. Look, I'm always a big fan of having more options. I would always like even more options of like, hey, let me turn on ray tracing and if it runs poorly at 45 frames per second or whatever, I don't care. - There was times in that 30 FPS mode, the cut scenes didn't even feel like 30 FPS. - It was definitely a little stuttery. - And we're not talking about the Miles Morales Spider Verse suit by the way. I mean, again, like you say, there's plenty of games where that's fine. I just think if this is supposed to be the game that sells your console, they should have put in the you know the investment, whether it's a cost investment, whether it's a time investment to make that one be at least locked at 60. - I'll say most all of the next gen games across Xbox and PlayStation generally do a good job of at least having a couple of modes, performance and quality. But I always want more. You clearly always want more. The closer you get to a PC like experience, not necessarily having a hundred options, like I get that that's not feasible, but giving you a good sense of what these options do versus just trying to AB test and figure it out, especially because so many people have different types of TVs, like it gets complicated. - So let's talk about the controllers. In another video you had mentioned that the dual sense controller is actually probably the biggest leap for the PS5. My thoughts had flipped on this pretty hard from when I first saw it. When I first saw it, I'm like, this is a glossy mess, I didn't like it. Feeling it in my hand I do like it. There's one feature I love and then one feature I think is super not great. - Okay go ahead. - So the one that I do love is the adaptive-- - Triggers. - The triggers. You know I really wished that Microsoft had adopted something similar to that. - Well so it actually is an evolution of what they did with the Xbox One. Right? So with the X-Box One they have impulse triggers, which would give you some feedback in the triggers, but it was very kind of like a 1.0 sort of feature, right? - This is truly next generation. - Yes. So instead of just getting a little bit of vibration in the triggers, with the dual sense you can actually have. like so if you're in a game and you're shooting, you can actually have a little point where it'll like click like you have a gun. Or if you're in a racing game, the brake pedal can be much stiffer or it can start vibrating as you start losing traction. There's a ton of potential with that. And I think that's something that really has opened my eyes to what a controller can do beyond just being a dud hunk of plastic. - [Matt] Yeah. And I really liked that feature. I do fear that the true potential of that will be limited to first party games. - It takes a lot of work. Like even in the launch titles. Right. Spider-Man does not take great advantage of the dual sense. It feels like I'm just playing on a dual shock. Dirt does okay. But it's kind of like half broken right now as far as like the right trigger has a ton of resistance and the left one just feels completely empty. But then you look at Demon Souls and that's actually a game that I think does a good job, right. Like every footstep you can feel in the controller like left, right. Or as you like clang swords, like there's certainly like, there's a wide spectrum of different ways to take advantage of the controller. But the hardware is there, the software is there, you just have to actually as a developer make me good at use of it. I don't want to over-hype it and make it seem like it's the most incredible thing in the world, but this is hands down without question my favorite game controller ever. I previously was a big fan of the Xbox One controller. I still like it and the Series X, but not only do you get the ergonomics and all like the fundamentals down on the dual sets, but the level of force feedback between the rumble, between the motion, between the touch pad, between the triggers is really next level. - So that will bring me, the thing that I was in fact very disappointed with this is the rumble motor. - Really? - So like, I'll be honest, I don't have a ton of experience with the Xbox One controller cause I've just been using the elite controller for so long. - What have you played with the dual sense? Did you do-- - I just was playing some Miles Morales. - [Man with glasses] That doesn't do it. - That doesn't. Okay but so like that kind of comes back to it of like, I don't think there's a game that I played on X-Box that doesn't have the rumble just kind of activated there. - So I would say if you want a good demo, I would play first and foremost absolutely do Astro's Play world...I mean Playroom. That is designed around showing you what this controller can do. - [Matt] Again if I'm playing the flagship game of the console and it's not giving me a good sense of that, I just think that's kind of like a little bit of a problem that Sony has right now. - I will say if you're interested in the controller, some games certainly do it better than others. Outside of the performance of the PS5, which look, let's be really honest with ourselves, it's about the same as the Xbox Series X, right? You can subscribe to Digital Foundry for every bit of analysis on game by game sort of stuff. But like, I feel very confident in saying that unlike with the PS4 and the Xbox One where a PS4 was head and shoulders above the X-Box, the PS5 and the Series X are much, much more on even footing. - Yeah. I think Dirt's the only game I've played on both, and I could not tell you the difference. - It's subtle. Because they're both very powerful consoles. They both have ray tracing, they both have all these features. I do think that the Xbox is a little bit more technically minded, right? So it has support for things like variable refresh rate, which I do think is important. It does have support for things like 1440P, which is a little bit more of a niche feature. But if you have like a gaming monitor or something, you may find that to be useful. Something that Sony does not have. And also something that I think that the X-Box has, which is really sort of its killer feature when you look at them side by side is quick resume. Quick resume will keep a handful of the last few games that you played always saved in the background. So if I was playing Halo last night and I played four this morning and I go back to Halo, you open the game, wait three seconds. And then not just loading the game again. I'm like, right exactly where you were. - [Matt] I didn't a time the PS5 yet, but the instant on for the Xbox is insanely fast. Yeah. - A lot of the features of these new consoles you get used to very quickly, and it's only really when you go back to either like a PS5 or in the case of quick resume or lashing console whatever the case is that you appreciate like, oh that loaded in 10 seconds versus a minute or oh, that my game was just ready to go. Right. Like I think these are the things that make it sort of a little bit more of a...look there are pros and cons across the board. Whereas last generation for many years you bought a PS4 cause the X-Box One was connect crazy town. - Yeah. - But when you look at how these consoles have come out, right, there's obviously tons of hype. And in last year refreshing Amazon a hundred times a day, you might not be able to get your hands on one of these this year if you don't already have one. But I feel very confident in saying that you will be very happy with the Series X and the PS5. The main drawbacks are all things that will 100% be fixed with time. Not a lot of games, surprise, surprise, that's every console ever when it first comes out. And the nice thing about these consoles is you do have some level of backwards compatibility and generally speaking those games will run at least as well as they did before if not slightly better with improved load times - Yeah. I mean, that was my biggest thing. I had this huge back catalog of games. Then I'm like, you know what, every time I died in this one, it takes a minute and a half to load. I'm not gonna play that. Now I'm gonna play on my next gen console and it's gonna take three seconds. - Absolutely. I waited to play Last Of Us Part Two until the PS5 came out, just because I was hoping that we get some patch, I don't think it did. But regardless, whatever I am ready to dive into the PS5 and play a lot of these games that are not necessarily brand new. Although of course there are brand new games, but I'm amped to spend time with these new consoles. Because I mean look, if I'm being really honest with you, I've spent the last nine months being in rumor town, in spec town and all kinds of towns that are great to make videos on, but I haven't actually spent a lot of time playing games. Right. I'm ready to go actually take off my analytical hat, stop recording my gameplay and writing notes. I just want to play some (beep) games, man. Thank you very much for watching. Make sure to subscribe and a ring-a-ding that notification bell. Otherwise, if you don't, Matt's shiny head will haunt you in your dreams. That's all.",
    "transcript_keywords": [
        "Xbox",
        "games",
        "game",
        "FPS",
        "Series",
        "things",
        "controller",
        "consoles",
        "time",
        "great",
        "thing",
        "sort",
        "console",
        "Xbox Series",
        "Yeah",
        "times",
        "Miles Morales",
        "play",
        "kind",
        "bit"
    ],
    "transcript_entity_values": [
        "Halo",
        "last year",
        "the Series X",
        "a hundred",
        "Miles Morales",
        "PS5",
        "2.1",
        "five seconds",
        "ADP",
        "one",
        "30",
        "PS4",
        "four this morning",
        "Ori",
        "GTA",
        "Two days ago",
        "FPS",
        "about two seconds",
        "30 FPS",
        "three seconds",
        "Astro",
        "8",
        "120",
        "60",
        "a minute and a half",
        "Matt",
        "45",
        "CPU",
        "Last Of Us Part Two",
        "the last six, seven years",
        "10 seconds",
        "100%",
        "Xbox One",
        "two",
        "fidelity",
        "Spider-Man 360 - This",
        "Amazon",
        "Digital Foundry",
        "4",
        "60 FPS",
        "Dirt",
        "1.0",
        "Xbox",
        "Demon Souls",
        "Morales Spider",
        "a couple of weeks",
        "Sony",
        "Xbox 360",
        "second",
        "Halo last night",
        "hundred",
        "Microsoft",
        "first",
        "the Xbox Series X",
        "PlayStation",
        "a week ago",
        "the last nine months",
        "the Series X or",
        "a ton",
        "Spider-Man",
        "30 seconds",
        "PS4"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "DATE",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "TIME",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "EVENT",
        "PRODUCT",
        "DATE",
        "DATE",
        "EVENT",
        "QUANTITY",
        "PERSON",
        "TIME",
        "NORP"
    ]
}