{
    "id": "6D_BFaAewLU",
    "title": "Note 8 Camera Lens Replacement - Cracked Glass fix",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-12-20T14:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=6D_BFaAewLU",
    "category": "Howto & Style",
    "tags": [
        "Note 8 Camera lens",
        "Note 8 camera glass",
        "How to fix",
        "how to",
        "samsung note 8",
        "note 8 tutorial",
        "samsung",
        "android",
        "fix",
        "repair",
        "replacement",
        "Bonafide Hardware",
        "Galaxy Note 8",
        "Samsung Note 8 camera glass",
        "Broken glass camera",
        "cracked camera lens"
    ],
    "views": 298671,
    "likes": 11134,
    "comments_count": 955,
    "description": "Did you accidentally break the camera lens on your Samsung Note 8? ME TOO! (kinda.) HERE is the Bonafide Hardware 'glass only' lens:  And HERE Is the Note 8 Camera Lens with frame:   It is easier to replace 'just the glass' part of your camera lens. So I recomend buying the first link.  BUT if you are replacing the back panel of your phone at the same time as your camera lens. THEN you might want to buy the full camera lens with frame. That way your frame will look brand new along with the lens.   If the Glass is just cracked on your Note 8, but still takes good pictures, I do not recommend attempting this repair.   Tweezers make this process way easier:   Go slow and be careful to not let glass dust fall into the camera unit. If your Galaxy Note 8 camera stops focusing then just follow the steps in this video to try and clear it out.  Let me know if you have any questions!   Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2CILSmp",
        "http://amzn.to/2z1nHxB",
        "http://amzn.to/2Bklm6M",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "You're probably watching this video for one of two reasons: either you've reached the end of the Internet and have nothing left to watch, or you've broken the camera lens on your Samsung Note 8 and you want to fix it for cheap instead of paying a huge insurance deductible. Well, you're in the right spot because I have a broken camera lens. Oh, wait. Hold on. Okay, now it's broken. Let's get started. [Intro] The biggest tip I can give during this operation is to go slow, be careful, and don't let the glass fall into the camera unit. Glass dust inside the camera will keep it from focusing later on. I'll give you some tips on how to correct the situation if it should happen to befall you. There are two types of lenses. One that comes with a full metal frame - this would need to be installed under the back panel, which is a little more difficult, but if the back glass of your phone is already cracked and needs to be replaced anyway, it's easier to replace the frame of the camera lens and the back panel at the same time. It took me a long time to source these Bonafide Hardware camera lenses. There are a lot of imitation cheap flexible plastic lenses out there, but as you can see, these are a much higher quality glass version. If you don't want to remove the back glass panel of your phone, buy the glass only version of the camera lens. It has the adhesive pre-installed. It is a little more dangerous to replace, but the whole operation is easier because you only have to remove one thing instead of the whole back panel. I'll explain. Heat is going to be our best friend during this operation, along with a thin pair of tweezers which I'll link in the video description. Heat softens the adhesive under the glass layer, making the little shards of glass easier to pull up without breaking them. You want to minimize the breakage as much as possible. Remember, since glass is the same hardness as glass, any bits of glass dust laying around in your work space has potential to rub up against the screen and scratch it and give it some micro abrasions. So try to keep the glass dust clear from the work space. Each time the lens cools down, the adhesive will get hard, I'll just warm it up again. It's a rather tedious process because I'm taking special care not to let the glass fall into the camera unit. The camera has optical image stabilization and a focus mechanism requires movement, so getting glass jammed up inside the Note 8 camera unit will keep things from moving and working like normal. The exterior glass we are installing has nothing to do with focus just protection. All of the focus and stabilization happens underneath the glass. All of the glass dust, shards, and adhesive needs to be cleaned off from inside the metal camera lens frame. Any dust left will become a pressure point for the new glass and might cause the new glass to break when it gets pressed into place. I'll flip the phone over and give it a couple sharp taps with my finger to help dislodge any dust caught inside the camera unit. It looks like this Note 8 is focusing on both my hand and my metal pry tool easy enough with both the normal lens and the telephoto lens. So now it's time to put the new glass into place. I'll have these Bonafide Hardware lenses linked in the description. The important thing is to make sure there are no fingerprints on the inside of the lens before putting it down. It needs to be clean on the underside. I'll blow it off to get rid of any dust and gently remove the adhesive protection without touching the underside of the glass, and then I can set it into place. Remember, glass is glass and doesn't need any force. I'll make sure it's snug and the adhesive will do the rest. And there we go, the glass is installed, flush with the back surface of the phone. I'll test it out really quick, and it's having no problems with either of the two lenses, focusing on my hand and the pry tool. If it was to stop focusing, I'd give it a few sharp taps on the screen while the camera was facing down to help dislodge any debris. Everything I used in this video will be linked in the video description whether your camera lens is broken already or you are the prepared type just buying a backup, I hope I was able to help out. Hit that subscribe button if you haven't already, and thank you so much for watching. I'll see you around.",
    "transcript_keywords": [
        "glass",
        "camera",
        "camera lens",
        "huge insurance deductible",
        "Samsung Note",
        "Glass dust",
        "lens",
        "camera unit",
        "broken camera lens",
        "dust",
        "Internet",
        "Samsung",
        "back glass",
        "back",
        "Bonafide Hardware camera",
        "insurance deductible",
        "reached the end",
        "paying a huge",
        "huge insurance",
        "adhesive"
    ],
    "transcript_entity_values": [
        "8",
        "two",
        "Samsung",
        "Bonafide Hardware",
        "One",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}