{
    "id": "6DiYVYg4p70",
    "title": "You will probably want to buy this! - Acer Predator Triton 300",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-06-23T14:01:28Z",
    "video_url": "https://www.youtube.com/watch?v=6DiYVYg4p70",
    "category": "Science & Technology",
    "tags": [
        "Acer",
        "Predator",
        "Triton",
        "300",
        "Gaming",
        "PC",
        "Laptop",
        "Mobile",
        "Nvidia",
        "2070",
        "Max Q",
        "Design",
        "IPS",
        "Intel 10th Gen",
        "Performance",
        "Portal 2",
        "Unboxing",
        "Alex",
        "Clark"
    ],
    "views": 918963,
    "likes": 28311,
    "comments_count": 1743,
    "description": "Sign up for Private Internet Access VPN at    Acer's Predator Triton's line up has been a bit interesting over the years, but this one you might want to really consider.   Check out the Acer Predator Triton 300 at   Buy Acer Triton Gaming Laptops On Amazon (Paid Link):  On NewEgg (Paid Link):  On BHPhoto (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://geni.us/hzDaN5",
        "https://geni.us/bwWWB",
        "https://geni.us/sIlehTt",
        "https://geni.us/lbOmvbQ",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- A couple years ago when Nvidia started pushing their Max-Q line of GPUs, we saw some pretty funk-tastic designs from Acer and Asus that, like, they were fun to look at. I enjoyed reviewing them but you probably don't wanna buy it. Although now, after a couple years of trying, they're getting damn good. So let's see Acer's most recent one, the Triton 300, which is apparently, you know, she's thin, she's small, very light. But it has a 2070 in it, damn! Let's do it. I actually have not seen this laptop at all yet. Jeez, they were really not screwing around with the tape here. By the way, this is a pre-production unit. I think that this is final retail packaging but I could be wrong. It might just be like a normal cardboard box inside here. We'll see. What, do you just want me to just like hold it here and pull out? - Sure. - Sure. (grunts) (laughs) As always let's first look at the power brick to give ourselves an idea of just how much power this thing's going to draw. I imagine this one's going to be quite a bit. Although it's actually not super heavy for gaming laptops. Let's see here. 230 watts, that's actually like quite up there. They've also been nice enough to write \"Predator Triton 300\" on it. - [Offscreen Voice] That's nice. - It's really annoying when we open up like several laptops and then you have no clue which one has which power adapter. Anyway, on to the main attraction here. The way that the Predator logo looks, it's just really cool. Are you guys able to see that in like the overhead? - Holographic? - Yeah, that's sick. Anyway. (laughter) Oh, I wonder if there's like a- What's that called? The like little refract-y thing where it like traps different thingies of light and (makes playful noises), kind of like soap. Anyway. (laughter) (gasps) Sorry that I'm just admiring logos here but this one also is really cool. I don't know if you guys can see how it's like 3D? I wonder if it lights up, that'd be sick. Well, is there anything besides the laptop in here? Ah, no. There probably would be like warnings or warranty info or whatever in the production version but whatever. (plastic crackles) Look. That was not as graceful as I was hoping for. It is quite light given, you know, that it has a 2070 in it. So it's 4.6 pounds, which is slightly heavier than like the XPS 15 here, which is 4.2, just to give you a bit of context. Looking at the IO though, we have USB Type C and I think it has charging on it. I'm not entirely sure. We also have USB A, HDMI, Mini DisplayPort. Eh! Then on the other side, we have two more Type As, ethernet and headphones. My favorite part here is just having the dedicated ethernet port. I don't know, that's going away on gaming laptops lately it seems and for gaming, you just kind of need it. Right, let's get into it here. Can open it with one hand. The screen's definitely a bit on the flimsy side. It doesn't really matter but it doesn't measure up to like an actual Ultrabook. That said, the actual chassis feels very stiff. Yeah, that's one thing where on some of Acer's less recent machines, they had especially kind of right around here, you could really flex the chassis, whereas right now, it feels like I'm flexing the table more than the laptop. Overall though, the feel of this machine is just very good, just like you will feel very good with private internet access. Wow, that was one of the bad ones. We're keeping it though. With PIA, you can access services and websites as though you're in a different country. It encrypts all of your internet traffic and uses a safe protected IP. You can connect up to five devices at once and has clients for Windows, Mac OS, Android, IOS, and Linux. Try PIA risk free with their 30 day money back guarantee at the link below. This is something that might seem pretty dumb but I really appreciate that they have just a standard power connector here. There's nothing more annoying when you just lose the end to a power cord and you can't just put in a normal one. It doesn't really matter but it's just nice to see. Anyway, should we- Wait, where's the power? (laughs) I thought that this right here was the power button but it's \"turbo\". Are you able to see that? I'm guessing that's the make it loud button. All right, so let's take a look at what the specs are here. We have up to a 10th Gen Intel Core i7, so that's the 10750H, which is six cores, up to five gigahertz. Pretty awesome for gaming if it can stay cool, of course. Up to a Nvidia GeForce RTX 2070 Max-Q. We have a 240 hertz, three millisecond, full HD IPS display and fourth gen AeroBlade 3D technology. The first thing that I wanna do is just press this turbo button. Oh, yep! That's the vacuum cleaner setting for sure. (whirring) Although it actually isn't as bad as I was expecting at first. It's loud for sure but it doesn't have the like (squeaks) that some earlier laptops had. I feel like this is the kind of thing that when you have headphones on, it just immediately gets drowned out by whatever you're listening to. Okay, why don't we get some games installed? They have some 3D audio examples here that I wanna take a look at. (shooting noises) Wow, yeah, I can see why they had right on the desktop there an example for the DTSX audio 'cause that actually sounds frigging awesome. Like their last ones had Dolby Atmos and this might actually have better separation of the sounds. It's pretty crazy what they can do now. (shooting noises) That said, if we turn on turbo so it's an actual simulation of what it'll sound like when you're gaming, much less impressive. Just put on headphones. Actually, do they have- Oh, they don't. I really liked how on some of Acer's more recent laptops, they had a little spot for your Mez dongle to go. It was like a USB Type A that was just a bit recessed. So you've just kind of got to chuck this guy in there and just never worry about it again. That said, this is fine. There's enough Type A ports on here that you don't really have to worry about it. They've also been nice and not put the ethernet cable on the right side, on the left here. It's going to be just way better for using your mouse at the same time. Ah, there we go! 240 hertz is just so sick. It's one of those things where like very few people besides Esports professionals are going to actually need it but it's just so awesome to have. Yes, what else do we have here? How much RAM is in this? 32 gigabytes, not bad. I actually found out the other day that just like doing my normal job, uses more than 16 gigs of RAM. I was pretty shocked! All right, let's see if this laptop can play Portal 2 well. (sighs) 240 hertz is just so great. It's the sort of thing where like I wanna turn 90 degrees. (squeaks) Did it. Anyway, that's really enough of that. Unsurprisingly, it plays Portal 2 great. (laughs) Now, although we can't show you performance data, we can just take it apart and find out how good it's probably gonna be anyway 'cause sometimes your eyeballs work just as well. This looks like it should be pretty easy. Just a couple of screws and I'm guessing it's gonna come right apart. I wonder if they'll get bonus points for using the same screw in all of these. I always really like to see that because then you just don't have to worry about where they go back in. Also it's so bad when like you're a noob taking apart a laptop and you accidentally put the longer screw in the shorter screw's thing and it comes through the top of your, like, keyboard or something. (laughter) I'd like to say I haven't done that before. Nice, yeah, all the exact same screw. Perfect. (light knocking) It's plastic but at the same time it does feel pretty good. All right, let's see here. So we have a 57.3 watt-hour battery. That's not great for something with this much performance really. I would guess with, what, an i7 that's six cores, up to five gigahertz, and a 2070, you're going to be getting four, five hours of battery life maybe. Yeah, they say up to six hours based off of MobileMark and video playback tests. So you might be able to get that. You might have to turn down the refresh rate of display. I'm not entirely sure. As far as the cooling system goes though, they don't have a lot of heat pipes but the ones that they do are big. We have one, two, three, four heat pipes and four heat sinks. And some big old fans that are metal? That one's metal. Is this one plastic? Huh, interesting. We also have super easy upgrading of the RAM, just two SODIMM slots right there. Storage, we have two one terabyte and we got two SSDs. That's actually sick, they're probably in RAID. And we also have- Is this a hard drive bay? I can't tell, so there's a spot right here for another M.2 SSD, for three of them. But I can't tell if there's a way to add in a- Why is there just a space there? That's weird, I can't figure out if there's supposed to be a Seda SSD here or if you're supposed to get a larger battery that comes all the way over in the production unit. Either way, the upgradability on this thing's gonna be absolutely fantastic. It looks like that there's loads of heat sink here for the via RAMs. I imagine this thing is gonna perform really well. Anyway, that's about it really. There's not a whole lot else to say. It seems like a pretty great laptop as far like if you need the performance of that 2070, it's gonna be pretty good. You also get like- I didn't check this out really but the keyboard seems good, track pad seems good. There's not a lot to fault it on. Let's see what the price is actually. That might be a spot to fault it. Okay, so it's starting at 1300 bucks. That's actually not too bad. That's for the i5 and the 1650 version. So I probably would not buy the starting one. Like if you're buying something that's this OP, I'd probably go for at least like the 2060, 2070. If you're going for something that's a bit cheaper, I'd go for something more powerful in like their Helios lineup, which they also just released some new ones of. But anyway, that's about it. I like it! Overall, it seems like quite a good one. So, yeah, hit \"like\", get subscribed. Have an excellent day! So long.",
    "transcript_keywords": [
        "pretty funktastic designs",
        "Nvidia started pushing",
        "couple years ago",
        "thing",
        "pretty",
        "good",
        "line of GPUs",
        "started pushing",
        "funktastic designs",
        "laptop",
        "power",
        "couple years",
        "Asus",
        "Yeah",
        "Acer and Asus",
        "laptops",
        "USB Type",
        "Acer",
        "years ago",
        "Type"
    ],
    "transcript_entity_values": [
        "Ultrabook",
        "Helios",
        "four, five hours",
        "Predator Triton",
        "15",
        "10th",
        "three",
        "Linux",
        "IOS",
        "Max-Q.",
        "chuck",
        "RAM",
        "one",
        "2070",
        "Seda",
        "Triton",
        "Mez",
        "10750H",
        "up to six hours",
        "Max",
        "240",
        "230",
        "90 degrees",
        "4.6 pounds",
        "SODIMM",
        "2070",
        "five gigahertz",
        "1650",
        "three millisecond",
        "PIA",
        "4.2",
        "Acer",
        "more than 16",
        "IO",
        "2060",
        "another M.2 SSD",
        "DTSX",
        "30 day",
        "32 gigabytes",
        "300",
        "Esports",
        "MobileMark",
        "240 hertz",
        "Windows, Mac OS",
        "first",
        "Mini DisplayPort",
        "AeroBlade",
        "Nvidia",
        "Asus",
        "HDMI",
        "up to",
        "a couple years",
        "two",
        "up to five",
        "the other day",
        "Android",
        "USB A",
        "four",
        "Predator",
        "57.3 watt-hour",
        "hertz",
        "six",
        "USB Type C",
        "2",
        "Dolby Atmos",
        "1300 bucks",
        "fourth"
    ],
    "transcript_entity_types": [
        "FAC",
        "PRODUCT",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORDINAL"
    ]
}