{
    "id": "6jqJ7Ga5CoE",
    "title": "Next Gen Hacker?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-12-10T14:30:04Z",
    "video_url": "https://www.youtube.com/watch?v=6jqJ7Ga5CoE",
    "category": "Science & Technology",
    "tags": [
        "cyber",
        "cybersecurity",
        "infosec",
        "information security",
        "xss attack",
        "xss video tutorial",
        "xss attack tutorial",
        "xss vulnerability",
        "xss vs csrf attack",
        "xss example",
        "xsssa facebook",
        "xsssa",
        "kali linux",
        "penetration testing",
        "ethical hacking",
        "bug bounty",
        "cross site scripting",
        "cross-site scripting",
        "red teaming",
        "cyber security",
        "kali linux install",
        "kali linux 2022",
        "ethical hacker",
        "javascript",
        "ajax",
        "jquery",
        "node js",
        "node js hacking",
        "portswigger",
        "xss",
        "xss script",
        "wifi",
        "windows",
        "linux"
    ],
    "views": 234848,
    "likes": 8236,
    "comments_count": 349,
    "description": "Get Proton VPN for free:   Big thanks to Proton for Sponsoring the video!  Time waits for no one ... don't wait... start your journey today. Gavin shows us that being young is no barrier to entry. No matter how old or young you are, start learning today and change all your tomorrows.  // Gavin's SOCIAL //  Twitter / X:   Discord:    GitHub:   YouTube:   // David SOCIAL //  Discord:   Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:   YouTube:   // MY STUFF //     // MENU // 00:00 - Coming Up 00:40 - Sponsored Section 01:35 - Intro 01:41 - Gavin's Backstory 03:56 - Bug Bounty 08:16 - How Gavin Learned Hacking 11:47 - Insecure Direct Object Reference (IDOR) 14:21 - HackerOne 14:58 - IDOR Example 18:11 - Informantion Disclosure 19:01 - Business Logic Errors 21:50 - The Race Condition 22:34 - Gavin's Advise for the Youth 24:47 - Gavin's Learning Process 26:54 - Favourite Payloads 29:14 - Gavin's Journey 34:42 - What Can the Next Genereation Offer? 36:44 - Can A.I Help Write Reports? 39:19 - Last Advice 42:02 - Conclusion 42:38 - Outro  // Detailed Timestamps // 00:01 - The discussion opens with thoughts on how the world has evolved, offering new career paths like gaming and hacking, especially for the younger generation. 01:09 - Proton VPN sponsored segment. 02:07 - Gavin recounts his early hacking endeavours and the support he received from his school's computer lab teacher. 03:01 - Gavin talks about his first major security discovery and the financial reward he received for it. 03:49 - Gavin's journey into bug bounties is highlighted, marked by self-learning through YouTube and hands-on practice, bypassing formal courses. 04:39 - Talk about the financial benefits of bug bounties for young hackers and how Gavin profited from this avenue. 05:02 - Gavin recalls discovering a security flaw in high school and the $1000 bounty he earned from it. 08:05 - Gavin talks about his interests in cybersecurity beyond hacking, including collaboration with Jakoby on bad USB payloads. 09:49 - Gavin provides examples of vulnerabilities he explored, like IDORs and business logic errors, and shares hunting strategies. 11:58 - Gavin demonstrates a vulnerability in a calculator site, revealing personal information access. 12:08 - Discussion on business logic errors in cybersecurity, with Gavin sharing his experiences and tips for identifying and exploiting these issues. 13:17 - Gavin explains how he found a bug in a trading platform simulation, leading to an infinite virtual money gain. 14:27 - Gavin describes exploiting a race condition in a team management platform to bypass member limits. 16:14 - The discussion shifts to networking in cybersecurity, and Gavin highlights the role of platforms like Discord and Twitter. 17:45 - Gavin credits Cosmodium and Jakoby for aiding his cybersecurity journey and stresses networking's importance. 19:08 - Gavin discusses using AI tools like ChatGPT to improve bug reporting and communication skills. 21:37 - Conversation about career evolution, the significance of following one's passion and skills. 22:06 - Gavin talks about his learning and networking approach, along with active participation in the cybersecurity community. 26:41 - Gavin discusses the advantages his generation has with technology familiarity and the challenges of being young in cybersecurity. 27:27 - He reflects on his experiences and the importance of effective communication in gaining respect. 28:08 - Gavin expresses gratitude towards his parents and advises the younger generation to follow their passions. 28:50 - He talks about the significance of networking and building connections in the industry. 29:32 - Discussion about Gavin's strategy for connecting with established figures in cybersecurity. 30:10 - Gavin reflects on overcoming age-related barriers in the industry through skill demonstration and dedication. 31:33 - Gavin speaks about the benefits of being raised in a tech-rich era and the need to blend traditional and modern learning methods. 32:16 - He acknowledges his parents' role in his journey and the importance of supportive family environments. 33:44 - Gavin advises young cybersecurity enthusiasts to persist, learn continuously, and embrace practical experiences. 35:10 - The interview concludes with Gavin expressing optimism about the future of cybersecurity and encouraging exploration in the field.  #cybersecurity #hacker #2024",
    "description_links": [
        "https://davidbombal.wiki/protonvpn4",
        "https://twitter.com/atomiczsec",
        "https://discord.com/invite/VNYsP6zVjg",
        "https://github.com/atomiczsec",
        "https://www.youtube.com/channel/UCO3HJD9va6b2gJSZyxLxExg",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/@davidbombal",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "I think a problem with a lot of the older generation is they don't realize the world has moved on and the opportunities for your generation is is totally different and if you're good at gaming then become a gamer or if you're good at hacking then become a hacker you know do what you're good at because the world is different. But here I was able to uh use request manipulation to lead to me being able to get infinite amount of money I couldn't show the request because there was too much information in there. So you could get personal information about the user as well? Yes, if if they type like whatever they typed into that chat with the um calculator I was able to [Music] retrieve. Let's say you're traveling like I was recently in the United States and you need access to the internet and you see that there's free Wi-Fi available do you trust the free Wi-Fi connection that you see out there? Do you trust that if an access point is broadcasting an SSID of McDonald's or Starbucks or something else that it's actually that company or someone setting up a rogue access point to intercept your traffic? I'm very careful connecting to Hotel Wi-Fi to anything that says free Wi-Fi. If I have to do it I'm going to run a VPN and the VPN that I've been using for a long time is Proton VPN I started using Proton based on discussions with hackers and Cyber Security Experts as well as what I've read in books such as this. Now this is a choice that you need to make is the Wi-Fi that you're connecting to legitimate? Is it safe to use? Personally I'm not going to put my trust and some random Wi-Fi connection out there. I'm going to use a VPN and the VPN that I use is Proton VPN. Hey everyone it's David Bombal back with a very special guest Gavin welcome. Thank you, thank you. So Gavin you got to tell me how old are you? I'm I'm 18 years old. And Gavin how long have you been hacking for? I would say about five years now. Oh wow, so you started when you 13 man that that's amazing. Yeah I started in like the eighth grade um just messing around in my computer lab and I'm thankful for my computer lab teacher because he let me really start to mess around and introduce me to Kali Linux and that's kind of what really started it. Okay hold on so let's start right there because you know we often get this like perception that teenagers get into trouble and a lot of times the authorities don't so-called authorities don't allow them to you know work with Kali or whatever but the person that was helping you did something different right? Right yeah so I was in the computer lab it was about like 20 or so kids in 8th grade and normally we would just go into computer lab for like an hour and we would all be doing these typing lessons and I was typing but I was kind of getting bored like after a little bit so I would just be messing around clicking on the different parts in the computer and then I came across like the command prompt this feels like every like hacker beginning but I saw like the command prompt and I started to learn some commands yeah yeah windows and then I remember once like the periods were over we had to go back to normal class I would take my note notbook and I would be memorizing all the uh different commands to show the Wi-Fi passwords and you know the simple command prompts. and Joel how how did it come about that your was it your teacher sorry that introduced you to Kali? I was showing him all the different commands and he said the one time um when I came into the class I didn't have to do the typing anymore I could mess around with trying to break the computer lab um and then I I was able to get some Wi-Fi passwords off of the computers and shut down some some different systems um and then we I talked to him after class I was saying like what can I do to like learn further and he said to take a look into like Kali Linux. That's amazing I mean it's it's fantastic when people you know don't stop you or stop your curiosity and allow you to you know grow in what you're interested in and I mean just for everyone who's watching I got to know Gavin through NahamSec and that's sort of how you reached out to us is that right? Right correct yeah shout out shout out NahamSec I love that guy. Yeah he's amazing I mean but I mean the the thing that's amazing to me based on like what he told me and what what you've said is you've got into Bug Bounty since then and you've actually you know hack companies and you've made quite a bit of money to kind of pay for your studies I think it is so perhaps you could just tell us the story right? Yeah so I really started looking into bug bounties I guess in like 2021 so I've been doing it for a couple of years now and you know I'm not I'm not the best but it it can definitely uh excite me when I get a couple of bounties um especially at a at a younger age cuz the the companies do pay sometimes a good amount of money but yeah it definitely does help my uh bank account yeah. So I mean you I I don't if you can share figures and I believe you got something to share so I mean if you I don't want to jump the gun if you want to go through what you prepared then we can do that but I I I love the story that I read on medium where you wrote about how you failed a test right or like a quiz or something and then you you hacked a company and made some money out of it right? Go on yeah so I can tell you that story so it was in high school on pretty sure it was my sophomore year of high school so that's like the second year and I had a English class that was extremely boring and I was messing around on my computer before the teacher came in and I was looking at like the main page of a website and there was like an opt out button and when I clicked it it gave me a prompt for an email to like put in an email so I typed in a random email and I hit like opt out and then it brought me to a different URL once I was there I looked into the the you know URL tab and I changed the the last digit from like a three to a four and then a different email popped up with the opt out button again or removed from all email notifications. So once that happened I I felt extremely hot, I was like I was like shaking I was like oh my gosh I I think this is like my first bug that I've ever found um because this was the this was the first time I ever actually found like a valid security issue. So then he comes into the class and he's like all right everyone we're going to have a I think it was like a vocab test or something so it was like 20 or so questions and I basically just answered I just circled all A's for each one handed it in ran back to my computer and basically I was writing up the report in class and it took about it took about two months to get paid but I was sitting in my room where I am now um after that test which I extremely failed very badly but it's okay um and I got the email notification and it said the company um rewarded me with $1,000 Bounty that was my first Bounty ever and that's basically the story of how I failed my test. So tell me just for international audience because I I always get mixed up with a US and stuff how old were you when this happened? I would I think I was about 15 or 16 at the time. So I mean that's amazing because I sometimes here in the community you need to go and study a whole bunch of stuff before you can you know start hacking but at 15 years old I mean what what did you study? How did you basically get to that point where you were able to hack a company and you know get $1,000? Really I was just watching a bunch of YouTube videos like NahamSec as well as you um just basically just watching a bunch of YouTube videos, staying up super late, I was just so like addicted to wanting to learn um basically I would just watch so many videos I would submit a bunch of bugs that were really not valid vulnerabilities um things like without like um CSRF like there's no protection against that. um So I definitely failed a lot before that um but basically just trial and error and then doing some minimal research but I didn't buy any courses I didn't like buy some books and like go to like any other additional resources really. So you didn't do hack the box or TryHackMe or anything like that no courses you just kind of like went straight into bug Bounty and tried things. Yeah I did try hack me and stuff like that for other types of um cyber security but nothing for like web application really I was mainly focused on um like Windows exploitation on um try hack me. So for the bug bounty you you obviously had to learn how stuff works right so you when you when you 13 or whatever you you learned a bit about like command prompt and then you started learning about Kali. Did you just like was it YouTube videos teaching you how the web works and stuff that taught you how to you know do web hacking? Yeah exactly um I would just watch some Kali Linux videos uh with like man in the middle stuff like that and that kind of brought me into like the world of web web um security and from there I would I would test things out on my own network and my parents would be a little concerned when they come in and see my computer screens with all this information but it paid off now so. So do they how did they react to that I mean obviously in the beginning that would have been a bit nervous but did they have you like are they used to what you're doing and understand what you're doing now? Yeah they're they're definitely used to it once they once they saw the money and I kind of explained them and showed them like my Twitter following stuff like that my mother actually came to Devcom with me and she so she flew out uh she she didn't like go into Devcom but she came to Las Vegas with me um and met Jakoby so it's kind of funny. Yeah I mean that's interesting interesting that you you mentioned Jakoby because you also do hack5 stuff right it's not just web hacking? Right yeah Jakoby really uh opened my eyes to bad USB and just payloads in general and me and him would be late nights just like I was doing with bug bounties we would just be grinding making payloads and we would be having a blast. Because you won some awards from hack5 right for hack5 stuff but you also do Flipper Zero, so tell us a bit about that. Um 2022 I was third place for the payload awards and I was able to get some gift cards to uh the hack5 shop so now I I have a bunch of their tools but yeah it was it was a lot of fun I think there's around 30 some payloads that I submitted to them um to get to that to that spot. You were 17 when you were doing that right? Yes correct. Yeah I mean that's amazing I think it's a big inspiration for people who are watching because I interview a lot of like older people or people who are you know been in their journey a lot longer than you but I think it's really inspirational that you were able to do so much so soon. You know you didn't stop at 13 you started 18 you well I mean earlier than that you already making money, 17 year um you're winning awards, I mean that's fantastic are you planning to go on this journey or are you at University are you studying something else what what are your plans? Yeah so right now I'm in University my major is like International Security and then I have a minor in Cyber Security but I plan to continue this cyber security stuff with my career and as a hobby as well I'm I'm so deeply involved and addicted like there's really nothing else I would choose to do. So I I get this from a lot of younger people how do you how did you convince your parents or how did you you know speak to them about letting you do this I mean obviously the Twitter following help and and stuff like that but how did you approach it when they they first saw what you were doing and perhaps were worried? So it was they were definitely worried in the beginning um especially in the the Kali Linux days where I was middle manning our own Wi-Fi things like that but I basically I would like just they would come in they would be extremely curious and somewhat worried about what I was doing um and I would just show them like the both like the pros and the cons like this is what could happen but then there's ways to protect it and like that's what I wna I want to pursue I want to learn how to do both of those just by that I've always wanted to be like understanding how things work so they they kind of took that uh hand in hand and just let me, trusted me in what I wanted to do. Now I know Gavin you you've prepared something right to to talk about some of the bugs that you got and the money that you earned sort of some tips and tricks so I'm going to keep quiet now don't you want to like share your experience I mean I think it's amazing that someone at your age has done so much and can be an inspiration for other people who are watching so go for it. Cool yeah so the bug we were talking about was a IDOR which is a Insecure Direct Object Reference and I basically just compiled some tips and then I have some screenshots of applications that I found these bugs in so I'm just going to quickly go over the tips I think are pretty helpful for beginners to start looking. So the first tip obviously is to inspect your HTTP history um you could do this within Burp and basically I just go through my HTTP history and I look for endpoints that are numerical um sometimes you can get IDORs with more advanced uh like numbers in the URLs but I normally just look for like IDs like 1 2 3 4 or things like that. Um next is testing beyond like the standard parameters in the URLs um sometimes I found found IDORs within like the body of the HTTP requests um I think people might overlook that when they're going through their Burp Suite history they just tend to look at the URL bar um but there's a lot of hidden data in those uh HTTP requests. How did you learn Burp? I kind of downloaded it and got so confused that I eventually learned how to use it because I go like PortSwigger Academy or did you just play around sorry? I stayed away from the Academy which might be against what a lot of people say but I really like just forcing myself inside applications and just learning them like that. That's great and did are you using the free version or the paid version for you know when you got these bugs? Yeah so I used the free version the community version. That's great it's right go on. And then you have to understand the broader impact of the IDORs so a lot of the times I I find like some information leaks but I try to further increase the impact so like privilege escalation or personally identifiable information leaks sometimes if there's an IDOR on the system or in the application there is probably another one somewhere around because the developers are building the same app so they might have those same tendencies which is kind of the last point I made here which is look for patterns in the application um because they might be susceptible as well. What shirt you've got on you've got a really special shirt on right? Oh yeah I got my uh HackerOne shirt on here I forget what reputation level this was but I think it was maybe a 1000 or 750 I'm I forget off the top of my head. So that's the platform you joined right? Yeah so I really only hunt on HackerOne um I do have accounts on integrity and Bug crowd but I kind of built my history on HackerOne and I have a lot of like private invitations there so that's kind of where I focus my energy towards. That's fantastic sorry man I keep taking often attention. It's all good. All right so next I have a couple of screenshots here um from some bugs I found and all of the information is redacted um so it's just kind of to show people what it kind of looks like. Um so here's an IDOR that was leading to the disclosure of location of any team um so this team this app was for managing um teams or like communities I was looking at all the different functions under the team management and as you can see here if you can see on the uh the request it's a forecast so basically this function allowed administrators of the team to see how the weather would be in their specific location and that's what that team ID would be tied to um which is kind of it's put in a purple highlight right there and basically it's just a numerical ID and I change it a couple times within burp suite and as you can see on the right um there's the latitude the longitude and basically everything about where the team was located so there was a bunch of addresses and information tied back to people's locations within their teams. So you could find individual people's addresses and stuff like that? No it was just the actual location of like the team whoever whoever created the team they would add a address for wherever that would be but um in this way this is kind of a a leak of information that might not be publicly available. If you had a book club and it was at someone's house and they put the address as their house then you would be able to get their address. Yeah okay this one was pretty severe um this was a application for calculators um it's just a b it's a mathematical site which you're able to give it your feed it equations and it'll spit out the answers and here's an example of what I was saying about an IDOR being able to be used in the uh body of the h HTTP request as you can see the URL is only uh two different uh words and there's no numerical ID in the URL the ID actually lies in the HTTP request and as you can see on the right I was able to get the user ID and then the action which is basically the message that they sent the calculator and I was able to get about every single message that that user ID sent to the calculator and you can also you could type words into there so I was able to pull back a pretty severe amount of information from that. So you could get personal information about the user as well? Yes if if they type like whatever they typed into that chat with the um calculator I was able to retrieve. That's great. And the the only issue with some of these bugs is sometimes obviously you'll get duplicates or not applicable because at the end of the day the company decides and sadly for this one it would have been a nice payout but someone on the internal development team found this before I did and reported it so. But I mean it's a learning experience right I mean it's and it's something that you can show like you're doing here it's not like it's wasted youve you've learned a lot and you know it's something that you can demonstrate to others sorry go on. Definitely yeah so then this one kind of similar to the team uh management platform this one was just an information disclosure via the IDOR so this one is used a lot in education this application is also used for teams as well but mainly for education so different classes and stuff like that within school districts um and basically I was able to pull back it's kind of blurry but you were able to pull back the phone numbers of whoever created the teams, the email addresses, and a list of all of the parents names which are in like the students of the class so yeah basically a lot of too much information I should say. Um um all right I think that's it for IDORs. The next bug that I love looking for and finding are business logic errors the thing I want to say about these is it really depends on the company some companies will not pay for these bugs because they don't think it's a security vulnerability rather than just like a a logic kind of error but if basically if a company is losing money you should report it because they can they might take that into consideration. So some tips I have for this is check pricing models so a lot of companies will have different tiers um say like if you can only have five people in this group and you're able to get 10 and you're supposed to pay for more and you're not paying for more that's a that's a business logic error so see if you can buypass payments through that um rate limiting is a big thing with business sensitive functions so like I was just saying if you're able to use a race condition or something which I'll explain in a little bit you're able to basically bypass their protections or their their payment tiers um to be able to do that and basically these two last ones are are a little iffy but you can like simple math and some of these like vulnerabilities really come to show which I'll explain I think in the one of the next two slides and then also revisiting previously patched vulnerabilities um I found this a couple times with some trading platforms where they might have fixed like the Math logic on on one uh trading function but another function has the same issue later on. So this one was the trading platform that I was talking about now this is not real money I wish it was I was gonna say yeah I wish um but this is basically a simulation of the stock market as well as a crypto simulator so it pulls real time stock market information and you can basically mess around with trading stocks and you could basically just learn how the stock market works but here I was able to uh use request manipulation to lead to me being able to get infinite amount of money um I couldn't show the request because there was too much information in there but basically all I've did was when I intercepted the request I changed the buy like me buying the stock to a negative number and that somehow tricked the application in the background to give me the negative amount of the stock so I was able to have this amount of cash just in my account. It was It was kind of confusing and it's hard to explain without showing you the request but it has a little bit too much information to show. But you didn't make that money man but it's great. Right yeah I wish this was real money and maybe they would have made it a a bigger Bounty but sadly it was only fictitious cash. Okay and like I was talking about the race condition um this company had a different pricing tiers for the amount of people you were allowed in your specific group so I used a vulnerability called a race condition which sends requests at the same time hoping that the application can't differentiate each request which was the case here as you can see I was able to invite all of these emails to my um Team here when I was only allowed to have about five I think. Nice. And yeah so that was a that was my two business logic error screenshots and here's the screenshot of my hack5 payload uh hero. Gavin that's fantastic I think that a lot of people will be thinking like okay I'm a teenager or I'm younger or I'm moving and I don't want to just say young people because some people watch these videos some of them are much older but they they moving from say one career to another what advice do you have especially for let's start with younger people people your age or you know if I'm 14 years old and I wish I was but I mean let's say I'm 14 years old and a I want to become like you any tips and advice based on your journey you know what what would you advise me to do? Um it's kind of funny asking or being asked for advice um when I'm I'm normally the one like listening to advice I guess something from that is listen to people but don't do exactly as they say all the time I think people's success is a case by case like issue I feel like a bunch of people will just give you advice on how they became successful which might help you but at the same time you kind of have to make your own path because if you're doing the same thing that everyone else is doing you're going to there's there's too many people already doing that, I mean that's fantastic advice I mean it's uh you say you don't normally give advice you should give more advice so any more advice because that's brilliant advice. Yeah I guess I would say I think this is a pretty common one but do what you love I know it might be a little harder if you're older but especially if you're younger you have a lot more time you can really you can really focus what you want to do and just become addicted to it and just dive deep and and love what you do. Did it affect your grades I mean I know it's that one test you you didn't do so good but I mean did it affect your grades when you got consumed by this and your parents got worried or did you manage to balance you know your passion for this versus you know what you have to do like go to school whatever. I've been kind of the same mindset with school my entire life it's kind of always been my like second priority which is not how it's supposed to be. My grades have been the same they're not the best but they good enough so I can pass. But I mean you got into University right so I mean you must have done fairly well. Right right and and definitely uh uh being in university has kind of showed me that time management is more important but I would definitely say that I I've been able to keep my grades up as well as doing things that I love. So I mean you didn't do you didn't read a lot of books, you didn't do courses, you just like trial and error I suppose is the way to describe what you did right? Right exactly yeah um the only really courses I've ever taken were for like certifications other than that I I don't really like spending money so I never really wanted to spend money on a a course to learn how to do something when I rather just throw myself into it spend the money on tools and learn that way I think application is more my type of learning. I mean that's fantastic I mean it's everyone has different parts and different ways to learn but it's fantastic to hear yours so when you said you spend money on tools are there any specific tools that you I mean both you you're using the community edition so it doesn't cost anything are there any other specific tools that you' recommend people invest in or is it just a specific use case for you for yourself? Yeah so for um online security I really haven't spent much money I've tried tools here and there but I don't I don't like as I said I don't really like spending money on tools like that I guess most of my money has become tools like physical tools like the hack5 products or I have right here a uh hack RF, nice Proxmark so I kind of like mess around with tools physically but I would say if I was to buy one tool to help me in Bug Bounty it would be Trickest which is a it's an automation platform and I've I've done a lot of stuff in there with um at scale um vulnerability scanning but that would be a case by casee issue as well like if if you're wanting to do um bigger scale operations uh I think that would be the go-to but other than that I would say just load up burp suite and focus your attention there. Your Hack5 payloads do you have any favorites that you you know you really like or enjoyed making? Yes so I have a next slide here um these are my two favorite payloads uh I worked on copy and waste with Jakoby and hack5 CEO Darren Kitchen um when we were at Devcon I was talking to Darren for a while and he was telling me about some ideas he had for a payload and one of them was using the clipboard history on Windows and that kind of sparked the idea in my head I was like okay well give me a couple weeks and I'll have something uploaded to your GitHub and basically I made the payload called copy and waste instead of copy and paste every I think at 5 seconds or so it'll get the contents of your clipboard and it'll send it to a Discord web hook and yeah it'll just it'll populate there with whatever you copy so that could be passwords from password managers, emails, basically whatever you have copied in your clipboard. Is that running on a rubber ducky or is that how does it get on the computer and is it you know does it stay in memory or how does it work? A kind of design that Jakoby and I have been using for our most like recent payloads is when once you plug in a rubber ducky, Flipper Zero whatever it'll download a PowerShell file hosted either on Dropbox, Discord something like that it'll download it it'll run it and then it'll delete the Powershell file um this might not be the most efficient or uh secret way to run these payloads but most of these are just a proof of concept to show that these things can happen and the PowerShell code is there. That's great and the other one is browser grab or something? Yeah so there's been a a couple of iterations that other people have made of this one um and everyone kind of asks for this payload, this one was kind of suspicious due to the reason that we had to download an executable to be able to decrypt the passwords that are in stored in Chrome and what not but basically this one will download a um executable that decrypts the passwords in like your Google Chrome basically all of the browser so Microsoft Edge, Google Chrome, Firefox it will uh decrypt the passwords and it would also exfiltrate bookmarks history and cookies and it'll send that to a Discord web hook or upload it to Dropbox or something like that. Gavin question for you you mentioned Darren hack5, you've mentioned some like really well-known names in the sort of our discussion what opened the doors for you because I'm a bumo even though I'm not in my day I had to get a degree I had to do this, I had to do that to get doors opened but your journey isn't like that right? Yeah I would say basically what what happened I guess with me is I've just like just like have done like work consistently that eventually someone who's maybe a little bit bigger will notice it and you can either try to reach out to them or they'll reach out to you but I would say doing work consistently is really what will help get eyes on you um either they'll reach out to you or you'll reach out to them but I would like to say uh the main two people that have really helped me is Cosmodium which is a uh cyber security group and basically I've been with them since my freshman year so right after I graduated or from grade school and basically we would just be learning in uh late night Discord calls same thing as I said before um and they really helped me organize basically what I wanted to do and they're just like my friends just like in person but I would be hanging out with them. Then the next person would be Jakoby like I said when we would be making those payloads uh we basically got to the top of the leaderboard and that's when people started to notice and basically just started from there. So how did you meet Jakoby was it through the hack5 development that you did and then you noticed you how I mean how did you make that connection to someone like who's so well known? Yeah so I'm pretty sure from what I remember is he was friends with one of the people in Cosmodium and we were just in a voice chat together and I was just uh asking questions about his stuff, hit up his DMS on Discord and then we were just in calls by ourselves after that and we we just started from there. It's amazing because I get I get two things from what you've said and I always say this to people put your work out there, right you, you put your work out there and you weren't scared to network with people is that is that kind of correct? Yeah I definitely said that second point um networking obviously is one of the one of the greatest tools you can ever have is knowing people and just from from Cosmodium and Jakoby I I've met so many people and the position I'm in now even at 18 is is remarkable I I am so excited to see what the future holds. No I love it because I mean I I have a quite a large following and um I get a lot of push back people say David it was easy in your days, it's not easy today and then I look at you and and I think man this is amazing look at you and what you've been able to accomplish when I was young it was so much harder it was so much harder to network the opportunities weren't there I mean the fact that you can legally hack companies at like 16 or whatever and then get paid for that and also get recognized for that I think the opportunity is amazing. Definitely yeah I'd say my main two tools for networking are Twitter and Discord um I think Discord is actually is a better tool because you can really become like closer with people from just being in like a Discord with them and messaging with them a couple times rather than Twitter like trying to get through all their DMS and whatever. So how did you differentiate that you weren't just some kid is it because of the work that you were doing like the fact that you had recognition on Hackerone, the fact that you had recognition on hack5 because I mean obviously some the people would have taken you seriously for some reason right? Yeah so I don't know what has really done that you just have to put yourself out there like it's it's definitely a little intimidating when I go to things like Devcon where it's 40 30 year olds all older than me I think I was like at least one of the younger ones there they definitely give you an interesting look they're not standoffish they just are like how how are you here I guess. The thing about the world today right is it's age isn't isn't a factor I mean it's it's amazing that you could do so much in like in five years or so and it's only going to get bigger now and I I think a question I want to ask you cuz I'm sure sure a lot of people are dying to know this is can people reach you or reach out to you and get some advice and if they can where should they go? I'll answer um basically anywhere Discord and Twitter are like my main main two applications that I use um and I would like to say that I'm I'm not Hollywood um so I'll I'll answer anyone from any School level I don't I don't care how well known you are or not. I mean that's the thing you know we all I always like to say we all started at zero and we all had a journey and I love what you said earlier that you know everyone's path is different or any everyone's journey is different get advice but you got to make your own way and I think it's important that people who are experienced in the industry help the next generation I mean you you you are the next generation it's important that you help other people who are your age but also anyone who's older or anyone's got more experience we need to help one another rather than bash one another. Exactly um a thing with that like the next generation uh a bunch of people in my Bug Bounty server are the same age as me or even a year or two younger and they they're wanting to learn and I'm I'm right there with them showing them the the different techniques and whatever to be able to become this next generation. So what do you think this is a bit of a nasty question what does the next generation like your generation bring to the table that the Boomers if you like I just use that as a joke don't don't have um what are you doing differently? Yeah I think growing up with technology is is a big factor in that like we understand the industry more because we we just have been born in it I feel like older people have to learn the industry but we've just been born in the industry so we already have that preconceived knowledge. Yeah I mean it's amazing I always use the story that my daughter at that time was two years old and she told me about you know something on an iPad just by messing around and I think that's exactly right right you digital natives it it's just natural to you? Exactly I I think it's an analogy I guess would be you're if right now if I had to be put on a farm with a farmer I would have to learn everything and the farmer would have to come to my room and learn about all this technology so I feel like it's just how we've been born into these industries. Have you had people push against you like say get away you're just some dumb kid or has the community been welcoming and helping you and if you've had push back you know how did you handle that? Yeah I think kind of in the beginning it was more my fault at the time because I'm so young or because I was younger um I didn't know how to effectively communicate with people or companies I feel like there was still that lack of maturity in the way that I communicated so people didn't take me as serious but I had that thirst for knowledge at that time too but I just didn't know how to communicate my thirst for knowledge. So I I think I read it on medium you said something like when you submitted a bug you didn't do a great job doing a report but they still gave you the money right? Yeah at the time uh my reports were brutal to look at I I just kind of submitted the URL where the bug was and uh a couple sentences on why it why it's wrong but now I spend about 30 to 40 minutes writing up a report. So any advice for someone younger trying to get into Bug Bounty or into cyber like I mean you've already given a lot of advice but any like final thoughts advice for someone? Yeah I would say the number number one thing especially with bug bounties and like reporting issues um which I find helpful as well is uh using Artificial Intelligence like ChatGPT or whatever to basically help you frame your reports what I've done is I have a couple outlines that I use so I would I asked it can you create an outline for a cross scripting vulnerability report and basically it'll it'll map out each section like the URL that's affecting, what's the potential impact and basically it just helps me effectively communicate with the company in a professional manner. That's fantastic so let's talk more about that have you found that AI has really helped you was it just in the reporting side or was it elsewhere as well? Yeah I would say especially nowadays I think it it has greatly uh sped up my my learning and has definitely made it um easier to find things like uh yesterday I was messing around with my SDR um which is like a Software Defined Radio I was looking for some specific frequencies that I could test like in my area and I basically asked it like can you give me some frequencies to test and what band should I be using whatever and it listed a bunch and I was able to quickly get to them like that. That was ChatGPT right? Yes I have the paid version but I'm sure you could do it without it. Yeah I mean ChatGPT is amazing have you have you used any other AI tools or was it mainly that? Yeah so mainly uh I use ChatGPT I've been subscribed for a while now and they've definitely improved stuff but I I tried um Google Bard I just have favored it towards ChatGPT. So it's more for report writing or like research it's not for like actual hacking right? Yeah I def yeah definitely more more research than anything I feel like it's kind of limited in the in the aspects of what it can really do like giving you um certain information but there are some type of uh chat Bots that are like uncensored. I mean it's fantastic that you use ChatGPT to write a professional report that's the way the of the future right don't try and reinvent the whe just use something like that to help you make your life easier and do things better. Exactly I think um it can benefit both the reporter and the reader of the report I feel bad for whoever was reading my reports when I first submitted them but now I try to make it as smooth as possible so. A lot of people that watch my videos are your age I can't give advice to your generation so is anything else you want to like say to someone your age or like inspiration to younger people you've given a lot of that but if there's anything else? Yeah I mean still like the biggest thing is especially if you're young you have a lot of time and your life is still very malleable so just do what do what you want to do and even if it's not the most uh socially accepted um I know a lot of my friends they mess around with me saying whatever I do online but at the end of the day I'm still I'm still getting that paycheck from sitting at my desk so they can say whatever they want. I was just going to say let's see what they say when you get your Ferrari right? Yeah exactly then then we'll see who's talking. Yeah yeah I always find it hilarious because it's um it's that old old joke you know the um people hate on the nerds or whatever you know whatever joke you want to use or hate on people who are in cyber who stuck in a dark room busy hacking but let's see what happens in the future when you have your Ferrari or whatever you you know you get one day let's see what they say then. I think cyber security is a great foundation and just a way to like think um like the hacker mindset I feel like it has applied to so many things in my life not even just technology based but if I have a project to do around home it's really like it helps so much with problem solving especially in school as well um I feel like I'm able to do my work or just figure out things so much faster because I have a mindset that like I want to be able to solve problems. I love that I mean it's that whole hackers mindset is not just about hacking servers or hacking companies right it's a whole way of thinking and I think if you can learn that way of thinking thinking it's a huge advantage. Exactly um the only other thing is I do want to thank my parents I know some people might have some issues with parents or they might not fully understand what they're doing but my parents they've really shown me the support that I need and I I'm really appreciative towards them for allowing me to do this all at the age of that what I am. I think it's fantastic and you know kudos to your folks um I I heard of someone else who wanted to be a gamer who was like 14 or whatever and the parents discouraged that and my attitude was like What if this if this kid is good at gaming then they should game. I think a problem with a lot of the older generation is they don't realize the world has moved on and the opportunities for your generation is is totally different to say in for instance my generation and if you're good at gaming then become a gamer or if you're good at hacking then become a hacker. You know do what you're good at because the world is different and you know huge kudos to your folks for letting you do this. Exactly yeah if if you know deep down what you want to do and the people that you're listening to aren't aren't telling you that then find other people to listen to because that's just not that's just not how it is anymore. Gavin I really want to thank you for sharing you know you said you normally listen to people but the advice you've given is is is fantastic and I I love interviewing a range of people I can't talk to your generation like you can I really want to thank you for sharing you know your perspective, sharing for the younger generation the next generation because the world will continue having this disaster with cyber security unless your generation come up with new ideas and better ways to do things so thanks for so much for sharing any last words before we wrap up? I think that was a a great time and um I just thank you for having me on here, it's it's a dream it's definitely a dream come true. That's fantastic man it's great to have you and thank you for inspiring everyone. So everyone who's watching please connect to Gavin I've put his Twitter and his Discord links below ask your questions especially if you're a younger person and you know you find that I'm a boring old guy then you know connect to Gavin and get his input about what you should be doing with your life. Gavin again thanks much man. Thank [Music] you!",
    "transcript_keywords": [
        "Yeah",
        "people",
        "basically",
        "kind",
        "lot",
        "Bug Bounty",
        "Bug",
        "money",
        "yeah yeah",
        "things",
        "time",
        "stuff",
        "yeah yeah windows",
        "advice",
        "information",
        "younger people people",
        "Kali Linux",
        "generation",
        "Discord",
        "Gavin"
    ],
    "transcript_entity_values": [
        "YouTube",
        "at least one",
        "three",
        "about 15 or",
        "17",
        "DMS",
        "Bug Bounty",
        "Burp Suite",
        "HackerOne",
        "four",
        "two",
        "Hollywood",
        "Ferrari",
        "second",
        "five years or so",
        "Devcom",
        "English",
        "Software",
        "about five years",
        "1000",
        "ID",
        "18 years old",
        "the Wi-Fi",
        "NahamSec",
        "David Bombal",
        "Wi-Fi",
        "McDonald's",
        "eighth",
        "a couple of years",
        "the end of the day",
        "Las Vegas",
        "Cosmodium",
        "USB",
        "casee",
        "Cosmodium and Jakoby",
        "Devcon",
        "15 years old",
        "NahamSec",
        "Joel",
        "Darren",
        "today",
        "Bounty",
        "8th",
        "Powershell",
        "like an hour",
        "SSID",
        "one",
        "Hotel Wi-Fi",
        "about two months",
        "Gavin",
        "Darren Kitchen",
        "Proton VPN",
        "Flipper Zero",
        "Kali Linux",
        "Windows",
        "around 30",
        "YouTube",
        "5 seconds",
        "20 or so",
        "first",
        "Starbucks",
        "Jakoby",
        "about 30 to 40 minutes",
        "the United States",
        "Devcom",
        "Wi-Fi",
        "hack5",
        "VPN",
        "PortSwigger Academy",
        "17 year",
        "Discord",
        "David",
        "International Security",
        "Cyber Security",
        "2021",
        "Hackerone",
        "University",
        "Darren hack5",
        "AI",
        "about like 20",
        "SDR",
        "Dropbox",
        "late nights",
        "about five",
        "Microsoft Edge",
        "year",
        "Trickest",
        "Academy",
        "US",
        "16",
        "40 30 year olds",
        "10",
        "18",
        "Cyber Security",
        "IDOR",
        "iPad",
        "my freshman year",
        "Artificial Intelligence",
        "TryHackMe",
        "third",
        "Boomers",
        "Chrome",
        "five",
        "late night",
        "14",
        "14 years old",
        "750",
        "zero",
        "the second year",
        "18",
        "Kali",
        "1,000",
        "two years old",
        "Jakoby",
        "13",
        "GitHub",
        "Google Chrome",
        "hack5",
        "Flipper Zero",
        "VPN",
        "Twitter",
        "PowerShell",
        "a couple weeks",
        "Firefox"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORDINAL",
        "DATE",
        "PERSON",
        "LANGUAGE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "FAC",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "LOC",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG"
    ]
}