{
    "id": "6L68XIics5c",
    "title": "We built the Home of the Future with Grant Imahara",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-06T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=6L68XIics5c",
    "category": "Science & Technology",
    "tags": [
        "home",
        "prefab house",
        "smart home",
        "smart house",
        "future",
        "future house",
        "future home",
        "grant imahara",
        "modular home",
        "construction",
        "the future",
        "real estate",
        "building",
        "house",
        "smarthome",
        "future technology",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "mkbhd",
        "marques brownlee",
        "verge",
        "the verge"
    ],
    "views": 3253044,
    "likes": 59735,
    "comments_count": 2483,
    "description": "The Verge and Curbed have teamed up to build the home of the future. Join host Grant Imahara as he examines the renewed trend of prefabricated modular home construction.  Host: Grant Imahara Executive Producers: Kelsey Keith, Nilay Patel, Eleanor Donovan, Steve Kantor General Managers: Britt Aboutaleb, Steven Belser Network Manager: Sarah Bishop Woods Supervising Producer: Tom Connors Production Manager: Meg Toth Editorial Supervisor: Dan Seifert Writer: Ginny Mohler Director of Audience Development: Ruben Salvadori Social Media Manager: Mariya Abdulkaf  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - The home of the future. It's been a dream for decades but can we build one right here in Austin, Texas. The Verge and Curbed have partnered to bring this dream of the home of the future to life. I'm Grant Imahara and our goal is to construct a house that combines cutting edge technology with innovative design. We wanna see if some of the latest smart home systems and high-efficiency design can create a more secure and convenient environment. and actually improve our daily living. How do we build this Home Of The Future? Well, it all begins in the factory. (eeeeing of grinder) In east Texas construction company, evolution, builds roughly 85% of its houses inside this 265,000 square foot warehouse. Each year they complete about 50 homes. These fully constructed modular units can be finished in 1/3 of the time it takes to build a house onsite. (crackling of welder) (eeeeing of grinder) (baarrring of drill) The power of prefabs or prefabricated homes is that they can be mass produced without compromising quality of design and structural stability. The assembly line construction begins with pouring the concrete floor and once the slab's been laid down cranes and hoists pick them up and take them to the line. But the scale of this assembly line is bigger than most. Instead of cars, it's houses. How long's it take from when a slab comes in to the finish line? - We have 17 stations. If we were doing one box a day you could have a complete box in anywhere from five to six days. - [Grant] (chuckling) wow. The house is assembled as it rolls down the line on a track. The walls are installed on top then wiring and plumbing. It goes from station-to-station, to sheet rock, the top is placed on, until there you have it, a complete unit. Technically Luna House is a prefabricated home. For me at least when I first heard about prefabricated homes I have this idea that they are cheap or low quality. Where do you think that that comes from? - I think a lot of it comes from certainly post-World War II era and the association as well with prefab with modular housing which we also associate with the mobile home. So you have that kind of connection in many peoples minds even in so far as a lot of prefab construction is actually quite high-end. - [Grant] This is Michelle Addington, the Dean, of The University of Texas at Austin School of Architecture. - The opportunity to have much more precise control over manufacturing in particular is what enables the greater quality. And so by going factory-built you have an opportunity not only for higher quality control but the opportunity to use much higher-end materials because they can be protected in the factory in a way that they're not gonna be as protected on a home building site. - [Grant] The downside is that you can't deviate from the design once you begin. So, you better be sure this is what you want. Our Luna House has three bedrooms and is 60 feet long, and, that's not changing. And because the factory is a giant assembly line a problem with one house can delay all the other projects behind it. In fact, our original house was delayed so long that we needed to switch to a house further along the line. But even with delays like these the total amount of time from blueprint approval to completion is around six months on average where as a typical on-site construction could've taken up to a year. - Architects have actually been trying to accomplish some level of factory-built housing for a hundred years and so it's gained some traction and some popularity in the last decade with the increasing popularity of design. I think in a general level that happens with Apple, it happens in the popular press-- - In everyday life. - In everyday life and so I think that that's kind of transmitted over to architecture as well. - [Grant] Architect, Chris Krager, is the founder of Ma Modular and is the designer of the house we're building. We're here at his home. - [Chris] Our business was founded with a primary goal of making modern, that kind of architecture, financially accessible. - [Grant] The design we're building is called, The Luna House floor plan made of three modular pieces. Modular design means these units can be configured in multiple arrangements. They can even be stacked to create multiple floors. You can think of them like big Lego blocks that an architect can use to create the best design for the needs of the homeowner. Our house is composed of three main pieces. One large module that includes one bedroom, kitchen and living room and a smaller module that has two bedrooms connected by a bathroom and a third module for the entryway that acts as a connection for the other two. - [Chris] We're working with a framework that I think is amenable to open-floor plans, lots of windows and so I think it is very modern-friendly. You also get to choose all your fixtures and finishes, flooring. There's definitely adequate room for customization with the finish in the house. - I gotta say, I knew that it was modular construction but it really didn't feel like it. - That is our goal with the design for it to feel, not just like not a modular house, but to feel like an architect-designed house. - If you were to drive on this block you'd say, well I think an architect designed that so it automatically ups its cache. - [Grant] But there's still a lot of hurdles before you can really think of this kind of construction as being, the future of home building. - When you deal with something that's premanufactured there's a tremendous amount of upfront cost in setting up that type of manufacturing particularly if you wanna get the economies of scale of building large. If we think about single family homes there is very little upfront investment. You can basically build in real-time in terms of procurement of materials. So the costs are incremental from that standpoint. - [Grant] While we wait to see what the future will hold for factory-built homes our home has already been placed on the ground. Right now though, it's still just a shell. Over the next few months we'll work to finish off everything inside of the home, create our own power generation and storage and fill it with the latest connected technology for comfort and convenience. It'll be hard work, but in the end we'll get a glimpse into what it means to actually live inside the home of the future. Thank you so much for watching. Now I'm sitting here in our home of the future but I'm curious to know what you think you need in your home of the future? Let us know in the comments below and we'll see ya next week with a new episode.",
    "transcript_keywords": [
        "home",
        "house",
        "Luna House",
        "design",
        "future",
        "homes",
        "line",
        "modular",
        "home building",
        "construction",
        "Verge and Curbed",
        "prefabricated homes",
        "Texas",
        "assembly line",
        "build",
        "building",
        "Luna House floor",
        "Grant Imahara",
        "Luna",
        "quality"
    ],
    "transcript_entity_values": [
        "post-World War II",
        "Chris",
        "Chris Krager",
        "Luna House",
        "one",
        "third",
        "Apple",
        "roughly 85%",
        "1/3",
        "three",
        "around six months",
        "Luna House",
        "Grant Imahara",
        "the next few months",
        "The University of Texas",
        "Austin",
        "17",
        "Dean",
        "about 50",
        "Lego",
        "five to six days",
        "two",
        "this Home Of The Future",
        "Ma Modular",
        "Each year",
        "60 feet",
        "One",
        "the last decade",
        "up to a year",
        "next week",
        "a hundred years",
        "Michelle Addington",
        "Texas",
        "Austin School of Architecture",
        "decades",
        "first",
        "this 265,000 square foot",
        "The Verge and Curbed"
    ],
    "transcript_entity_types": [
        "EVENT",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "ORG"
    ]
}