{
    "id": "6llnxOV_aRU",
    "title": "How to start with the Cloud in 2022 // AWS Azure and Google",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-01-07T16:48:45Z",
    "video_url": "https://www.youtube.com/watch?v=6llnxOV_aRU",
    "category": "Science & Technology",
    "tags": [
        "aws",
        "azure",
        "cloud computing",
        "best it certifications",
        "aws certification",
        "top 10 certifications for 2022",
        "amazon web services",
        "best it certification 2022",
        "AWS Cloud Practitioner",
        "AWS Solutions Architect",
        "AWS Security Specialty",
        "AZ-900",
        "AZ-104",
        "AZ-500",
        "Azure Security Specialist",
        "gcp",
        "google cloud",
        "cloud",
        "google cloud platform",
        "aws cloud",
        "microsoft azure",
        "azure fundamentals",
        "aws training",
        "microsoft azure training",
        "azure tutorial",
        "aws certified",
        "linux",
        "cloud+",
        "comptia",
        "comptia cloud+"
    ],
    "views": 61793,
    "likes": 2018,
    "comments_count": 155,
    "description": "Top 5 Cloud Certifications for 2022. AWS, Azure, GCP?  // MENU // 0:00  I wish I had learned this! 0:52  What is the path when I am starting out? 5:02  Do I need to learn to code? 7:06  This is overwhelming! 9:10  How to learn from Bart 9:40  Cloud resume challenge / how to get experience 11:47  Mentorship with Bart 12:24  The three core technologies to learn for cloud 15:50  Networking is dead! 18:23  Should I get a CCNA? CCNP? CCIE? 21:00  Will networking be replaced by the cloud? 23:55  Main interview - welcome Bart! 25:27  I'm confused? Where do I start? Don't eat the elephant! 39:51  Repeat: What is the path when I am starting out? 44:12  Security path? 46:33  Networking is dead! 54:37  Developer / AI path? 57:50  Three pillars 1:01:24  Big trends that are driving the industry 1:05:00  Other trends 1:06:20  Do I need to learn to code? 1:13:42  Cloud challenge   // MY SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // CONNECT WITH BART // Twitter:  LinkedIn:  YouTube:   // MY STUFF // Monitor:  More stuff:   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  aws azure comptia comptia cloud+ comptia linux+ linux AWS Cloud Practitioner AWS Solutions Architect AWS Security Specialty AZ-900  Microsoft Azure Fundamentals AZ-104 Microsoft Certified Azure Administrator Associate AZ-500 Azure Security Specialist Top 5 certifications 2022 Top 10 certifications 2022 Top cloud certifications  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #aws #azure #gcp",
    "description_links": [
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://twitter.com/cloudbart",
        "https://www.linkedin.com/in/cloudbart/",
        "https://www.youtube.com/channel/UCaCZnknpM1TpUnJHl0fv0OA",
        "https://amzn.to/3yyF74Y",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- Got anything you wish you knew if you were starting out? - Yeah, I wish I had learned Linux earlier. When I was in college, I went to a two-year Associates Program. And it was really lightweight. It was a very accelerated thing. It was done in like 18 months. Honestly, it didn't take very long to complete it. But, I wish I had learned Linux back then. I left with an MCP, a Microsoft certification, and I did use it, but I wish I had learned Linux a lot earlier on. Just understanding how to use it, how to work with the file systems and how to understand how workloads run on them. All of that would have been a really big help for me in every field that I've been on up to this point so. - And the the course you'd recommend is Linux Plus, yeah? - Linux Plus is a great one. Yap, that's a great start from Cloud CompTIA. There are other ones that are more specific to certain distributions, but that's a great starting point. (electric sound) - If I am starting and I have no idea what I wanna do. Did you say, CompTIA certs? So give us, I'm gonna put you on the spot a bit. Bart, like give us five certs, kind of like just something to aim for. And I know this is very generic but like let's say, I'm starting out, I don't know what to do. Which is gonna give me the biggest bang for buck? So like I've said in the past, go do AWS 'cause they're the biggest. What would you recommend? So let's say my background is just basic IT. Let's do a few like security, networking, in different backgrounds. But let's start, I'm just a young person, I'm starting out. I'm not quite sure I wanna learn, I wanna get into the cloud 'cause I hear it's a big thing. What would you recommend? - Okay, so if I were really starting from scratch, I would be looking at, honestly, the CompTIA Linux Plus. I would find out about Linux. I would learn Linux as soon as possible in this, regardless of what vendor you're gonna learn, as little or as much Linux as you can. So that is one of the key camps of general knowledge you should have. So I would put the Linux Plus in there from CompTIA. After that I would look at something like the Cloud Plus or the Cloud Essentials. Those are two different flavors from CompTIA. - [David] Can you explain that? - At slightly different costs. So Cloud Essentials is really just pure cloud concepts. Cloud Plus brings in a bunch of virtualization infrastructure concepts around hypervisors and running virtual machines. - Which one would you do? Sorry. - I would do the Cloud Essentials to start, if you're just trying to get into Cloud. You're gonna run into the virtualization stuff eventually. So you're thinking Linux Plus, you're thinking Cloud Plus. These are all from CompTIA which carry a very widely recognized brand. So that's gonna have a lot of impact on your hiring process. The next thing you kind of need to decide then would be either something vendor specific. So you're going to be moving into Azure or AWS or Google Cloud. If you're not sure, I would probably pick AWS just because I think it has the broadest and the longest running training for Cloud. So Azure is good, but they haven't been doing the Cloud training path as long as AWS. And I don't wanna compare sizes for vendors, but AWS I think has the maturity on the training side of it that will help you get the right impact and the right value that you wanna get back from it. So that would be your cloud practitioner essentials if you're on AWS, okay. - So that's our third one, yeah. - That's our third one there. So we went, we added Linux, we did some basic Cloud stuff. Okay. After that we have to start getting more specific. We have to think about either a job role specific thing or something vendor specific. - So let's go AWS. - Okay, so we're doing AWS. - Because we, I mean, let's just say for this discussion, based on your experience, AWS training is more mature. It's the biggest in the market. So let's say AWS, what's a cloud practitioner? Is that the first AWS cert there? - Yeah, cloud certified. - Yeah. - The certified cloud practitioner is the one that you would start with. After that, you would move on to something like either solutions architect or the SysOps one. Solutions architect is gonna be the general one that's gonna get you the broadest understanding, the most services, okay? The other thing that's cool there is they do some like exam cost incentives so that if you take cloud practitioner, you get a discount on the next test. So that's a nice trade-off too if you're paying for these on your own. Finally when you get done with that, that was our fourth cert then. So we're up to the associate. Then I would consider it really needs to be a job role specific decision next. So you're gonna either pick professional architect because you want to support large enterprise decisions around designing cloud solutions, or you don't know what you wanna do. So that's the professional one. If you know you have a specialty then you pick one of the AWS specialties. Advanced networking, security or the data analytics one. If you're not sure where to go, again, you kind of need to get into the industry to start seeing some of these roles in action. But at that point you're definitely refining. So we went from really basic stuff, Linux Cloud. We talked about AWS Cloud Practitioner essentials, solutions architect. And then moving on into either a professional or one of the specialty certifications after that. (electric sound) - So Bart, you've had a lot of experience. Would you recommend based on your experience that we need to learn to code, like programming something? So would you recommend that I need to learn automation, a programming language like Python? Like if you had a skill that you felt today would really help my career, what would you say it would be? - Yeah, I don't tell people to learn to code, I tell them to develop code proficiency. - [David] Yeah. - And hopefully we can say that here. I don't want you to learn to write software. I want you to be able to take things that you're finding from the community, Python script templates, JavaScript templates, JavaScript object notation. I want you to be able to look at it and understand what it is and be able to integrate it and modify it. I don't need you to be able to write it all from scratch. But if you can start with a position where you know how to process and read those types of languages, it will definitely unilaterally help you in a huge amount of ways across a huge amount of fields. So, maybe not learn to code but develop some code proficiency. - And that'll help you in the cloud, yeah? If you wanna be a cloud engineer or something, yeah. - Yeah. I mean, so many different examples throughout Google, Azure and AWS where we're using a standardized notation like JavaScript object notation simply because so many different systems around the world understand how to consume and parse that. And that's a simple pattern. We want you to be in the same position as a person to be able to parse and understand it. And keeping in mind again, that you don't necessarily have to reinvent the wheel by being able to write it all from scratch. That is where these low code solutions are coming in, where we want you to be able to understand the effect of what you're configuring and be able to use a language to the point that it helps you achieve that reproducibility. Okay, we're not trying to smother you with settings. Almost everywhere I see in the serverless field right now, it's about reducing the amount of effort to write business logic. (laughs) We don't want you to have to write as much code. You should be writing less and less the longer we do this. And I think that's a pattern that a lot of developers would agree with. - Bart, but I mean, I'm a young person. This is totally overwhelming. I mean, you know, I look at you and I'm just starting out and it's like, you know, I just wanna give up, I might as well go and get another job. What's your advice for someone starting out and is like despondent perhaps or overwhelmed by all this stuff? - Sure. Well, I think probably one of the most important things to do when you are feeling that way or when you find yourself in that space in IT is to recognize that you're not alone. And even if I tell you that, find a way to be a part of a community. These could be regional opportunities, they could certainly be internet-based opportunities. Before the pandemic, it was a lot easier to get together as actual local groups. I would encourage you to seek that out as much as possible. If you are in an educational environment, you're still at college or something like that, find the user groups of people who are working in a similar field and can corroborate your experience. I think that goes a long way to fighting burnout and to making sure that you keep your perspectives in the right area and move methodically through. You're gonna see other people struggling through it and you'll be able to help each other out. I'm a really big proponent to that community model behind it. - Plus, it's fun. You're talking to your peers and you're beginning to network too. I think those are all infinitely valuable skills to develop that'll help you further on throughout your career. I still have people that I talk to that I met working here 20 years ago and I still keep in touch with them on LinkedIn. And occasionally I get a gig from them. So, never discredit the notion of the network and the community that you're building around it. And if you don't know, Twitter is a great place to start. There are a lot of smaller communities that you can find outside of that. I know Twitter is huge and crazy. So if you start there though, you can find some of the other smaller groups that you might find will really help you out. There's a lot of new tools coming online. And I think the pandemic helped us with that, honestly, to make sure that there was even remote access for those sorts of communities. So do what you can. I even run a little virtual open mic now because I can't go play outside. But I just do it online, but it's still, that's my community and it's a chance to refresh and work with your peers. - So I'll put a bunch of links below. Are they links that people can follow you? Where can they follow you? Where can they connect? Where can they learn from you? - Sure. Well you can find me at AWS, I'm out there training. So if you take a look on aws.training, you'll find me. Twitter, @cloudbart. You can find me on YouTube, /cloudbart as well. Those are the two platforms I'm most active on. You can also find me on LinkedIn if you wanna connect out there as well. So just do a little search for Bart Castle, AWS, and I'll be there. - So Bart tell me, in a lot of conversations I've had with people, they talk about networking on LinkedIn and places like that. Is that something that you think is a good thing to do in the cloud space as well? It's like, how do I? I'm starting out. You know, how do I connect? Who do I connect to? Do you have any advice for that? - Yeah. One of the things that's been particularly impactful that I've seen the last couple of years are these Cloud Resume Challenges. There's one particular from Forrest Brazeal. I hope I said his name right, Forrest. But he basically approached it from the same scenario where he's like, \"Look, I realized that you can go and learn the solutions architect content. But when you go to a job interview and you want to demonstrate those skills, sometimes there's a disconnect between I got the cert and do I have the skills, especially if you're just starting out.\" So the Cloud Resume Challenge is an interesting opportunity where they're actually having you use a wide array of complex cloud services to basically talk about yourself. It's essentially, it's a blog project that you're running. But it gives you a chance to practice, actually publishing the resources, getting them online. And then you can talk about how you built that technology on your site. And hopefully talk about your other little side projects. I really encourage you to find something that you're passionate about, that IT can help you with or cloud or code can help you with, and start doing some pet projects and find a way to showcase them. I think that that's a really important pattern. So closing the gap between, I just started, I know I know a lot but I don't know how to show it off. - Yeah. That's a problem, yeah. - It's a big problem. And those communities are gonna be places where you can get ideas of other projects. You can share ideas with other people. You can collaborate with them. The other part too is that resume review is another thing that a lot of communities can help you with too as you get your resume together. And you're talking about how to find positions or where to work or where not to work, you know. Those community folks, they can help you out with that quite a bit. And again, that's something that I like to offer as much as I can. People send me resumes pretty regularly and I'll usually can help them a little bit there. So I do offer that. Let me know if I can help you with, if you have any requests there, send some stuff to me and I'm happy to take a look at it and see how I can help. - So how do they do that? 'Cause you might get lots of requests. Is that to your Twitter account? What's the best way to send you stuff, to interact with you? - Sure. Yeah, Twitter is probably the best way. I try to keep a few like mentorship things going on the side that I help people with. You know, I only do what I can. But if you reach out to me on Twitter, usually I can catch stuff on YouTube there as well. If it's a popular topic, I'll try to record a video. I haven't been doing as much recording lately. But Twitter is my most active platform. So if you wanna reach out to me on Twitter, I will do my best to field your questions. Yeah, I'd love to help out. (electric sound) - Bart, you mentioned three things. Can you just remind me what those are? So it was the three main things you said for cloud, were virtualization. And what were they again? - Yeah, it was virtualization and automation and networking. Those are the three core technologies that I see. I don't really consider the data part of it a technology. Data is just the fundamental things. It is the people that we move. It is the stuff that we put in the boxes. It is what we're designing the infrastructure to support. So all of it's centered around data. Virtualization, there's a couple of concepts there. Remember that you're talking about running actual virtual machines, that is one of the primitive parts of it. But then you're also getting up into things like containerization. And so when I'm thinking of what skills I wanna have, I want to understand virtualization and how containers differ and how that evolved and where that's leading us, because all of those are important trends. And of course, the vendors that support those tools like Docker, Kubernetes, VMware. The vendor specific containerization products like Amazon EC2 or our container service or Elastic Kubernetes. There's a ton of great inroads to get into it. The next layer then is thinking about virtualization from like an abstraction perspective. It's kinda like using a menu at a restaurant instead of talking to the chef directly. APIs are a really important part of what we're doing out there. And that's the same for networking folks, it's the same for data folks, it's the same for developers. So understanding APIs is one of the skillsets that I kind of include in virtualization. Automation then gets us into the ability to reproduce effects over time or have them performed in an automated fashion. So these are all of your infrastructure as code solutions that allow you to build services like Terraform, Amazon Cloud Formation, resource templates from Microsoft. I don't know the Google variation of it, okay? The other automation layers then are how you're looking at event-driven behavior. When an event happens somewhere in your cloud ecosystem, how can you capture it and then respond to it? And remember events generic, it could be a network event, it could be an application event, it could be a security event, okay? It could be a data delivery event that's occurred. So we're thinking about event-driven behavior and all of the cloud providers are pushing us in that same direction. The last part then was networking, okay? And really maybe networking should have been the first one on there. But all of this connectivity that we're talking about now, it's even more critical it ever was before. And we're now entering into an era where edge computing and edge networking is becoming a really important topic. We're deciding, it's really a classic battle of where to put the data and where to put the compute from a user experience perspective. So we're seeing 5G. We're seeing satellite-based services. We're seeing questions about, how can we use something way up there when the compute is down here and the data is here? Well let's move it there. And that means that now we're stepping into a whole other dependency on networking and connectivity. So the idea that it's going away, I just don't see it. I see diversification and enrichment happening in the networking field. And it means you really can't know too much about networking. And consider these edge, these edge locations are really important. The idea that we can run, compute out very close to our cell towers, running them out in IoT devices that are on the backs of trucks or in factories. Those are all different networking realms that we still need professionals to be able to provide the right connectivity for. (electric sound) - So let me ask you this question because this is a question that comes up a lot. Networking is dead, the cloud is gonna take over. - Oh well, yeah, I don't. I definitely don't agree with that. I laugh at that one a lot. I do hear people talk about that. And having a lot of networking friends, they're very much not concerned about the cloud killing off network engineering positions. The big thing you gotta kind of recognize here too friends is that organizations, we still see predictions that a hybrid cloud is going to continue to be the most common model, even on into the next 10 years, even with the improvements of hosted services. And for those of us who aren't familiar, hybrid means running something in your own data center, plus having elements of hosted services running at other providers. So that means there's always a network still at home that's gonna be supported. Do I see it going away? No. Do I see low code networking solutions continue to be developed that allow for the, you know, graphical implementation and management of complex networking services? Yes, I do see a lot more of that coming online. But keep in mind friends, someone still has to design those tools and then support the infrastructure that runs that nice beautiful dashboard that hides all the complexity. So I think in a lot of ways, no, networking is not going away, but it is becoming increasingly automated and more software oriented. So that means that if you're gonna stick around the networking career, you really should benefit in some automation training. And I say automation not coding, because in my mind automation is any sort of approach where you're using template-based agents. You're using certainly some software and some code that's written there as well to manage and deliver excellent network infrastructures. So I think that's the skill set that really has to be added if you're an existing networking person. That being said, if I were to be in networking, I would be looking at something like DevOps. Honestly, DevOps pulls a lot of those pieces together. Even if you don't wanna be a DevOps person, it will teach you about source control. It will teach you about versioning. It will teach you about testing. It will teach you about the automation tricks to move a design through to getting it executed and implemented in a real environment. So I think those DevOps principles are coming in a big way to pretty much all the fields of IT. We want everybody to have good power and control over what they're doing because it means improved efficiency and reduced human error. And everything in IT can benefit from that. So that's why I say automation and not just software development. - So would you recommend, firstly, would you recommend someone who's interested in networking to get a CCNA or is it just like some of the other parts we've discussed? Just go straight into like Linux, go into cloud. And let's say I've just got my CCNA. You know, is it worth even looking at CCMP? Is it worth looking at CCIE? And this is just your opinion, Bart. You've been in the game a long time. You see, you've come from a networking background. So like if I'm starting out, I don't wanna like go down a path on networking that's perhaps dying. So what would you say to that? - Yeah, you know, I still look at fields like telephony and collaboration. I mean, these are fields that really haven't been changed by cloud yet. So I still see companies needing phone systems. I still see them needing connectivity in a variety of different mechanisms with different providers. And I still see the world's providers needing people in businesses to talk to to integrate all of these services together. So I think the first thing to kind of recognize is that you didn't get your CCNA just to get into networking, okay? I think a lot of people got it because they wanted to be a part of the Cisco ecosystem. And so if you wanna get into networking, there's other ways to do it without your CCNA, but you're gonna end up in a different ecosystem like Palo Alto or Juniper, okay? So you're thinking, this is back to the roles conversation we just had. Who do you wanna work for? What type of positions do you have? If you wanna work for organizations that are running large Cisco implementations, you'd need to continue on to the CCNP. If you want to get your CCIE and you wanna design large internet backbone routing systems, you're not gonna find that path through a cloud services providers option. You're gonna need to work with the right tools that those organizations are running. And Cisco is typically gonna be one of the top leaders in that, that is their forte. So you really are picking a vendor. Like we were saying when you were choosing Azure or AWS, it's the same thing where you're choosing to go deep enough on a vendor to meet the hiring objectives that you yourself are looking for. So no, I wouldn't say not to do it. One quick funny story about that is voiceover IP and telephony, I am actively talking to AWS right now. Like, \"Hey, you know, this is still a part of our niche where we have services.\" There's almost no training and there's a very small overlap of people who can do telephony and cloud services. And the people that I would hire, they would come from Cisco telephony roles and collaboration roles. - [David] That's interesting. - We are actively hiring at AWS right now. We're hiring CCIEs to help us design a lot of the products and services that we're using to deliver connectivity across all those different spectrums. - So you don't think, and I mean, I'm just asking the questions that I hear, 'cause this is the kind of stuff that people debate. You don't think that networking will go away, and do you need networking knowledge for the cloud? - So, I don't know if I see those two questions as being tied together. I would say networking is not gonna go away. It is one of the core. I say three technologies, there's automation, networking and then virtualization. Those are the three core techs of cloud computing. So we're not gonna get rid of networking. You're gonna continue to see a robustness that grows. Our AWS networking options continue to become more and more aligned with a CCIE skillset every year. I mean the stuff we're asking our cloud architects to know, you need to know more BGP than you ever did before to be an advanced cloud networking specialist. So people who have that skillset and understand that level, and I'm talking CCIE level stuff here, they are able to get jobs with large providers and that is happening in a big way. The other question is, do I need to know networking to work in cloud computing? I definitely see that question being a no, that you don't need to know it. In a continual improvements of reasons why we don't have to know it. There are a lot of great managed services where I don't have to ever even look at an IP address or ever think about an interface. And that is, if you hear the term serverless, that's where a lot of this is moving for. But the audience is different, okay? You're thinking developers then. These are developers who want to execute a solution without having design networks underneath of it. They're allowing AWS to design those networks for them. And also keep in mind too that Azure, Google Cloud and AWS all have professional services divisions. So this is another area where you could be taking your Cisco skills and applying them to help these cloud providers connect and integrate their customer's infrastructure, which is a really big problem. I will tell you what, the best job of all time that will never go away is that of an integrator. And it happens in networking, it happens in security, it happens in analytics, it happens everywhere. So integration is the name of the game. And the network people out there are still going to continue providing a crucial part of that integration story for us. So I don't see it going away. But also keep in mind, David, when I say that you don't need to know networking, you're thinking about very light level applications. You're not necessarily designing global infrastructure at that point. You're thinking about smaller pieces of business logic. So it's a very different paradigm that you're living in at that point. And again, keep in mind, if you have a cloud skillset, you are better equipped to move laterally back and forth across these different parts of the industry. So if you feel something's a better fit, having those cloud skills is gonna make it easier for you to move to another provider, to another vendor, to another organization or to another role in your organization right now. (electric sound) - Hey everyone, it's David Bombal, really excited to have Cloud Bart with me today. Bart, fantastic to have you here. - Hey David. Hello, good to see. - Yeah, so I mean, from a personal point of view, let's just introduce you to the audience. You have been doing cloud forever, is that right? - Yeah I mean, I've been working in the cloud and tech space for almost 20 years now, doing things that I didn't consider cloud computing before it was even called cloud. So yeah, working in virtualization and software development environments, DevOps. Yeah, so a good time. And now I am a technical trainer for Amazon Web Services. So I've had a chance to take a lot of cloud experience, practical implementation, and then turn it into a later era career has a trainer and a consultant. So that's been kind of my overall arc if I could summarize it quickly. - Yeah, so I mean, I think that's really important before we get started. You did this stuff in the real world for a long time, and then you started getting into training. And now you're training for Amazon themselves, is that right? - Yeah, that's exactly right. And so I've carried a bunch of different certifications through, some of the specialty Cisco certs, back in voiceover IP days I used to work on call manager. I was a CCNA before that. I've supported windows domains. I've supported software development environments. So really touching a huge array of technologies, which is really kind of the ideal situation to be a cloud architect and a generalist like I consider myself these days. I've touched enough of the different parts of IT to be able to talk to almost anybody in any of the fields, including the business side. - So Bart, I am new to this field, let's say. And I've heard that cloud is the future, cloud is hot. It's something that I should look at learning. But I'm confused, you know, where do I start? Do you have like any top five certs that I should look at? Or, you know, based on your experience, if you were talking to Bart starting today, like put yourself in like you started today, what would you advise yourself to do? - Sure. Well, usually the first thing I try to get people thinking about in this conversation is, you don't wanna eat the elephant here. When we say we wanna get into cloud computing, that is kind of like the big, giant scope thing that we kind of see on the horizon. The problem is that's not really tangible. Like what does that mean? And I think that's where a lot of confusion begins for certainly new folks, and definitely for experienced folks in the industry as well. So typically what I try to get folks thinking is to go back to a little bit more of a general job hunting approach, and then I'll get into the cert parts of this here. And I think if anybody who's been in IT for any time or if you're just getting started, you know there's a lot of options out there. There are many certs from many different vendors that might lead you down a variety of paths. So the first thing I kind of imagine is, if you thought of like a pie, okay? And you cut it up into 10 slices. Those 10 are all of the jobs in the IT world out there, okay? A lot of the jobs that we're talking about that are in cloud, they're not really pure cloud jobs. It's not like you're gonna go work, unless you wanna work for AWS or Azure directly. Okay, there's gonna be a whole gamut of traditional technology jobs that have cloud services that are a part of how they deliver that for the organization. So that's kind of the first thing to start thinking here, is it's not really about getting into cloud as much as it is learning cloud skills that can support a business role that you might have somewhere within an organization. So that's usually where I get people thinking first, is saying, okay, what kind of work do I wanna do? And then how can a cloud computing skillset help me, you know, execute against that or land a position or maybe transition in my own company or something to that effect. So beyond that then, you're getting into really traditional technology roles like operations. You're thinking about support. You're thinking about development and engineering, networking, security. And then I definitely wanna mention data and machine learning, some of the big analytics fields that are out there now. Those are the real jobs to go and get. The cloud skills are the part that help you use AWS or Azure or Google to deliver goods for that particular position. So that's kind of what we wanna start thinking first is, what sort of work do I wanna do? And then what sort of organizations do I maybe wanna work for? So all of this is really not cloud specific, and that's really why I take the step back from the cloud conversation for just a sec. I usually get people thinking where in the world do they wanna work? Can you find jobs locally with employers who have roles related to cloud computing? That usually is a good option. Can you relocate? If you can relocate, then you've got a whole bunch of new options that are available to you. So that's usually like, where in the world could I work? After that I'm thinking, what industries do I wanna be a part of? Okay, are there any industries I know I don't wanna work in? Do I wanna work in healthcare, insurance? Do I want to work in manufacturing? Do I already work in one of those industries, okay? The third question then is what sort of roles do those employers in that kind of demographic have available related to cloud computing? And hopefully some of you can see where I'm going with this, is that we're not just chasing a cert for it, we're gonna chase a cert because we know that it will help us get this position or move into this space or move into this particular role. So that's where I always start this conversation. This is when you hit the listings. You start looking at an employer. And dream big here friends, dream big. Think, in an ideal situation, who would I wanna work for? What sort of jobs might I try to acquire? So find those roles and then start looking at the requirements that they have, not only the certifications, but also the tools that they're mentioning there. Okay, 'cause that's kind of part of this story as well. The last thing then is how can I use the skills that I have already to help me land those jobs as well? So if you're in a networking professional or if you have a background in sales or if you have a background in data or if you're a security specialist, it's almost always gonna be to your benefit to leverage those skillsets to move further forward. So, now that we've thought a little bit about how you might go through this process, David. Maybe you can give us an example, David. What's your background? What would you say is your forte coming in here? Just for example. - Yeah, so I mean, mine is mainly networking. So I wanted to ask you, is that like, do I need to do CCNA before I become, do get into cloud? And I mean, I don't wanna push certs, but certs seem to be a nice roadmap that people can follow. So yeah, if you wanna use me as an example, let's say as networking. - Sure, okay. Yeah, and that's kinda near and dear to my heart. I have a deep networking background and a lot of my peers are networking folks. So when I'm looking at the networking environment, most organizations are gonna need cloud computing services to be connected to their infrastructure in some way. So this means, wide area networking, metropolitan area networks that we might be running, private and public interfaces or lines that we might be delivering to get to our other locations and to our cloud providers. So in that specialty, a lot of you probably already have a good understanding then around the principles of connectivity. So what you need to focus on would be the specifics of using the cloud providers. So at this point, hopefully we're thinking what cloud vendor might work well. And the answer to that goes back to my first questions. What employers are you looking at? What roles do they have? And what providers are they using? If they're heavily invested in AWS, then it would make sense to start with something like the cloud practitioner. This is gonna be a cert that will get you the right language to talk. And a good understanding of the other opportunities from a certification perspective. So you could move from a cloud practitioner, or if it's a Microsoft or Azure shop, you're thinking something like the Azure Fundamentals. And maybe later we can come back and throw up some of the code names and link info on some of these as we go through them. But those certs are meant to be able to take you with your existing skillset and bring you up to speed on the language so that you can talk to other business partners in the field, talk to other business members in your teams that are delivering these services and then begin understanding where you might move next. And that's kind of more of a product and vendor specific path. For a lot of people though, they're still not sure. Maybe they don't know what the cloud role are that they're looking for. Maybe they haven't done that research yet. If that's the scenario, then you can think of a generalized solutions architect position as a good place to start. So this is where we see things like the AWS Solutions Architect, the Azure Administrator Certifications. These are moving up into a higher level of understanding, but there's also a lot of patterns that they lay out that are gonna work across vendors. So I kind of think of them almost like Liberal Arts degrees, where you're really, it's a broad set of technologies, it's a broad set of topics. - I hope you all get a job though. - But well, yes, exactly. And so that's why I was originally like, don't just think I wanna get into the cloud. Think more like, what specific types of roles are interesting to me and what sort of organizations do I wanna work for? That way you can tailor your studies and your certs to whatever role you're trying to obtain. So we're still thinking pretty generic. Practitioner essentials as your fundamentals. These are gonna be fairly entry-level certs. You're moving into the associate level certifications after that. These are gonna be valuable for helping you understand the architect complexity that I was referring to. - [David] Yeah. - It's also a specific type of path. Many of us don't know what cloud architecting really is. The truth is that's really kind of an upgrade to the classic consultant position. You're gonna be talking to team members, finding out problems they have, and then trying to prescribe a cloud-based solution to solve those problems, given all of the myriad requirements that the company might have. Now that may or may not be something that you've done in the past. Architecting is a new part of this that many of us are not familiar with because we weren't consultants. Now for me, I get that. I've been a consultant, I'm used to doing that. But when I started in the industry, I didn't know anything about consulting. I didn't know anything about project management. So those skillsets are things that really lead you to the pure cloud architect role, which like I said, that's a small slice of all the jobs that are out there. So as much as we like those certs, keep in mind that you really need to stitch it to that next effort and say, \"What role specifically do I want? And what other tools and technologies can I learn beyond just the general parts?\" Now fortunately for us, if you're gonna be an architect, there are professional architects certs that go on beyond that for Google, Azure and Microsoft. Those ones are gonna possibly be your best bet. The AWS Cloud Professional Solutions Architect is a pro-cert, definitely a more intensive cert. It's going to be one that takes you to that next level of really outside of a startup mentality and into enterprise. You're thinking about multi-accounts. You're thinking about really large deployments and how to support them. And so I also want you to think, okay, well that changes the types of jobs that you might be acquiring and the types of organizations you might work for. So that's why I started this whole conversation with, where do you wanna work? What kind of changes can you make? What's realistic for where you are right now? 'Cause that's where you get the leverage. We don't want you to just be studying for the sake of studying. So at this point we're still being pretty general. Architecting is a very general practice. You're gonna have a wide array of people that you'll talk to, okay? David, are you familiar with Accenture or Deloitte or Raytheon? Some of these big consulting firms. Now those organizations are interesting. If you wanna work for them, they have a global footprint, okay? They need architects, specifically by job title, who can work across a lot of different technologies for their customers. So that's a role that you might not be thinking about yet, but that's really what I think of as pure cloud architecting. If I wanna get into cloud and work in cloud, those are really cloud pure roles. There's still all the other stuff that we have to do for the business. All the operations and networking and developments and the data analytics parts. So this is where you start thinking about a specialty certification. And again, buyer beware here. You don't wanna go after specialty unless you're sure that's something you're heavily interested in, or you already have a role in mind that you would be looking for. Now, things are really hot right now in the security space. So we would definitely recommend looking at things like AWS Security Specialty, the Azure Security Specialties as well. And keep in mind, all of these certs have security in them, but that one's gonna give you a lot of paper impact. Having the security certification shows that you've spent the focus on it, and there's gonna be specific services that you've learned then, that again, should help you directly provide a value add for your organization now or in the future. The other ones I really want you to think about too are things along data analytics and machine learning. These are ones that I think a lot of people don't know about unless you came right out of college with a mathematics degree and started doing analytic work. But there's a lot of inroads to data analytics and machine learning now from Azure, Google and AWS. They're thinking what they call low code or no code machine learning. And so really you're thinking like, how can I make this data do something useful for the organization? And it can be pretty exciting and very dynamic. So this is another very lucrative part of the field. It's also an area that we don't have as many specialists in yet. So whenever I think about what certs to obtain, it's either because I know it's gonna help me do something directly, or it's gonna be impactful in the broad appeal across the marketplace. So that's why things like data analytics and security and machine learning have a broad appeal. You're gonna learn some very important principles and patterns that will make you stand out when it comes time to do these hiring or these transition opportunities and conversations. So beyond that as well, there is also an advanced networking one. Since we were talking about networking, AWS has a networking specialty as does, I believe Azure has one on here as well. There are some other ones like, SAP has been added recently. I know AWS is ramping up a new cert as well. So these specialty ones would be your next steps to go once you're sure about the role or the interest level on it. I think I recall seeing a few people talk about, who's paying for certs as well? This is usually a good time to bring that conversation up. Additionally, there are many certs you could obtain. But when you're thinking about personal investment versus having maybe your organization pay for these certifications, I'm sure we can see that there's a different impact that we have on it. If I were really starting from scratch and I didn't know which of the vendors to pick, AWS and Azure are usually gonna be your safest ones to start with simply by market footprint. They just have that much footprint on it. But I'm also a really big CompTIA fan. So depending on where you are with your training or learning path, the Cloud Essentials or the Cloud Plus are very non-vendor specific. So they are a pretty nice way to get started. If you're paying by yourself and you don't know where else to start, those might be a good option for you as well. They are gonna have concepts across all the cloud vendors, and they also get a lot into virtualization. So I think that's another really important technology to kind of understand here as well. So, just to kind of recap everything we were saying here, go back to the job hunt first and try to identify some really big goals that you would like to find and identify what certs might be most helpful for you. The ones that we mentioned here as our top fives are gonna be your essentials like cloud. Cloud Plus from CompTIA, the cloud practitioner essentials from AWS, the Azure fundamentals, okay? And I remember, the more that you can help build confidence and using one of these vendors, the easier the selection process becomes. If your organization is using Microsoft heavily, they use .NET development and that's what they do, you can comfortably use Azure then as your model. Move in that direction, you'll probably be able to get some good insights into where you could move in your organization right now. That's usually a good fit. Again, if it's AWS, then that would be the track to choose. If they're using Oracle Cloud or OpenStack or one of these other vendors, there are certifications that are available out there, but it's a smaller appeal. Okay and so again, if you attach the certification to the role that you're trying to acquire, that's usually a better relationship and it's more directly impactful for you yourself as an employee. Go ahead David. - I'm gonna push you now 'cause that's what I do in these videos. So I know we're gonna repeat a little bit, but it's just for me to try and get it clear in my head. If I am starting and I have no idea what I wanna do, did you say CompTIA certs? So give us, I'm gonna put you on the spot a bit. Bart, like give us five certs, kind of like just something to aim for. And I know this is very generic, but like let's say, I'm starting out, I don't know what to do. Which is gonna give me the biggest bang for bucks? So like I've said in the past, go do AWS 'cause they're the biggest. What would you recommend? So let's say my background is just basic IT. Let's do a few like security, networking, different backgrounds. But let's start. I'm just a young person, I'm starting out. I'm not quite sure, I wanna get into the cloud 'cause I hear it's a big thing. What would you recommend? - Okay, so if I were really starting from scratch, I would be looking at honestly, the CompTIA Linux Plus. I would find out about Linux. I would learn Linux as soon as possible in this, regardless of what vendor, you're gonna learn as little or as much Linux as you can. So that is one of the key camps of general knowledge you should have. So I would put the Linux Plus in there from CompTIA. - [David] Yap. - After that, I would look at something like the Cloud Plus or the Cloud Essentials. Those are two different flavors from CompTIA. - Can you explain that? - At slightly different costs. So Cloud Essentials is really just pure cloud concepts. Cloud Plus brings in a bunch of virtualization infrastructure concepts around hypervisors and running virtual machines. - Which one would you do? Sorry. - I would do the Cloud Essentials to start if you're just trying to get into cloud. You're gonna run into the virtualization stuff eventually. So you're thinking Linux Plus, you're thinking Cloud Plus. These are all from CompTIA which carry a very widely recognized brand. So that's gonna have a lot of impact on your hiring process. The next thing you kind of need to decide then would be either something vendor specific. So you're going to be moving into Azure or AWS or Google Cloud. If you're not sure, I would probably pick AWS just because I think it has the broadest and the longest running training for cloud. So Azure is good, but they haven't been doing the cloud training path as long as AWS. And I don't wanna compare sizes for vendors, but AWS I think has the maturity on the training side of it that will help you get the right impact and the right value that you wanna get back from it. So that would be your cloud practitioner essentials if you're on AWS. - Okay, so that's our third one, yeah. - That's our third one there. So we added Linux, we did some basic cloud stuff, okay? After that we have to start getting more specific. We have to think about either a job role specific thing or something vendor specific. - So let's go AWS. - Okay, so we're doing AWS. - I mean, let's just say for this discussion, based on your experience, AWS training is more mature. it's the biggest in the market. So let's say AWS, what's a cloud practitioner? Is that the first AWS cert there? - Yeah, cloud certified. The certified cloud practitioner is the one that you would start with. After that, you would move on to something like either solutions architect or the SysOps one. Solutions architect is gonna be the general one that's gonna get you the broadest understanding, the most services, okay? The other thing that's cool there is they do some like exam cost incentives so that if you take cloud practitioner, you get a discount on the next test. So that's a nice trade-off too if you're paying for these on your own. Finally when you get done with that, that was our fourth cert then. So we're up to the associate. Then I would consider it really needs to be a job role specific decision next. So you're gonna either pick professional architect because you want to support large enterprise decisions around designing cloud solutions, or you don't know what you wanna do, so that's the professional one. If you know you have a specialty, then you pick one of the AWS specialties. Advanced networking, security or the data analytics one. If you're not sure where to go again, you kind of need to get into the industry to start seeing some of these roles in action. But at that point you're definitely refining. So we went from really basic stuff, Linux Cloud, we talked about AWS Cloud Practitioner Essentials, solutions architect, and then moving on into either professional or one of the specialty certifications after that. - That's brilliant. So let's say I wanna be in security. I love hacking. I love, you know, security is hot at the moment. Cyber security is hot. Do you have sort of a path for me? - Yeah. And, you know, security isn't my arenas as much. So I don't know. I know the CISP is an incredibly valuable one that a lot of organizations are seeking. It is not cloud specific. - I mean, there's a professional. Sorry, it's a specialty security cert from AWS. Can I go straight to that or would you recommend doing some other stuff first? I'm just trying to, like let's say that's my goal. I wanna do cloud security stuff. Is that a good cert or are there any others that you'd recommend? And how do I get there? I'm assuming I can't jump from like no knowledge to that. So I'm assuming you're gonna tell me to use Linux again, is our right? Learn some Linux and then. - Yeah. I pretty much, I would tell everybody to learn Linux. You don't need to master it, but you do need to be familiar with the distributions and how to use it. So yeah, I would look at Linux. I would look at the CompTIA Security Plus. Honestly, it's a very popular one. Again, CompTIA has got a really big impact, non-vendor specific. So it's the one that I've used so many times over the years to get started. So I always encourage people to go with CompTIA at the beginning. And then you're back in the same scenario where you're looking at something that's vendor specific. Azure, Google or AWS. If you're looking at Azure, then you're gonna go into their Azure Fundamentals. And then after that you would look at the Azure Administrator. Yeah and I'm trying to look at all these. And then finally they have the security administrator specialties that you start on as well. Those are gonna be more about securing enterprise infrastructure. I don't have a lot of good feedback on like a hacking, ethical hacking sort of background. I'd have to lean on some of the other security pros in the field to kind of ramp on that. But at that point, a lot of those certs are not vendor-specific at that point. You're thinking more about the actual tools that you're using to do those jobs. - I think it's just, it's good to know that like there are specific cloud certs from the big cloud providers. So there's one from AWS. There's one from Microsoft. So it's good to, it's kind of like, let's say I wanna get there. So you've given us another nice roadmap. And what about networking? I mean, I think that's kinda like repeating it again, isn't it? - Yeah. - Like do Linux. So let me ask you this question because this is a question that comes up a lot. Networking is dead, the cloud is gonna take over. - Oh well, yeah I don't. I definitely don't agree with that. I laugh at that one a lot. I do hear people talk about that. And having a lot of networking friends, they're very much not concerned about the cloud killing off network engineering positions. The big thing you've gotta kind of recognize here too friends is that organizations, we still see predictions that a hybrid cloud is going to continue to be the most common model even on into the next 10 years, even with the improvements of hosted services. And for those of us who aren't familiar, hybrid means running something in your own data center, plus having elements of hosted services running at other providers. So that means there's always a network still at home that's gonna be supported. Do I see it going away? No. Do I see low code networking solutions continue to be developed that allow for, you know, graphical implementation and management of complex networking services? Yes. I do see a lot more of that coming online. But keep in mind friends, someone still has to design those tools and then support the infrastructure that runs that nice, beautiful dashboard that hides all the complexity. So I think in a lot of ways, no, networking is not going away, but it is becoming increasingly automated and more software oriented. So that means that if you're gonna stick around the networking career, you really should have benefit in some automation training. And I say automation not coding, because in my mind automation is any sort of approach where you're using template-based agents. You're using, certainly some software and some code that's written there as well to manage and deliver excellent network infrastructures. So I think that's the skillset that really has to be added if you're an existing networking person. That being said, if I were to be in networking, I would be looking at something like DevOps. Honestly, DevOps pulls a lot of those pieces together. Even if you don't wanna be a DevOps person, it will teach you about source control. It will teach you about versioning. It will teach you about testing. It will teach you about the automation tricks to move a design through to getting it executed and implemented in a real environment. So I think those DevOps principles are coming in a big way to pretty much all the fields of IT. We want everybody to have good power and control over what they're doing because it means improved efficiency and reduced human error. And everything in IT can benefit from that. So that's why I say automation and not just software development. - So would you recommend, firstly, would you recommend someone who's interested in networking to get a CCNA? Or is it just like some of the other parts we've discussed, just go straight into like Linux, go into cloud. And let's say I've just got my CCNA, you know, is it worth even looking at CCMP? Is it worth looking at CCIE? And this is just your opinion Bart, you've been in the game a long time. You've come from a networking background. So like if I'm starting out, I don't wanna like go down a path on networking that's perhaps dying. So what would you say to that? - Yeah, you know, I still look at fields like telephony and collaboration. I mean, these are fields that really haven't been changed by cloud yet. So I still see companies needing phone systems. I still see them needing connectivity in a variety of different mechanisms with different providers. And I still see the world's providers needing people in businesses to talk to to integrate all of these services together. So I think the first thing to kind of recognize is that you didn't get your CCNA just to get into networking, okay? I think a lot of people got it because they wanted to be a part of the Cisco ecosystem. And so if you wanna get into networking, there's other ways to do it without your CCNA, but you're gonna end up in a different ecosystem like Palo Alto or Juniper, okay? So you're thinking this is to the roles conversation we just had. Who do you wanna work for? What type of positions do you have? If you wanna work for organizations that are running large Cisco implementations, you need to continue on to the CCNP. If you want to get your CCIE and you wanna design large internet backbone routing systems, you're not gonna find that path through a cloud services providers option. You're gonna need to work with the right tools that those organizations are running. And Cisco is typically gonna be one of the top leaders in that, that is their forte. So you really are picking a vendor, like we were saying when you were choosing Azure or AWS, it's the same thing where you're choosing to go deep enough on a vendor to meet the hiring objectives that you yourself are looking for. So, no, I wouldn't say not to do it. One quick funny story about that is voiceover IP and telephony. I am actively talking to AWS right now. Like hey, you know, this is still a part of our niche where we have services. There's almost no training and there's a very small overlap of people who can do telephony and cloud services. And the people that I would hire, they would come from Cisco telephony roles and collaboration roles. - [David] That's interesting. - We are actively hiring at AWS right now. We're hiring CCIEs to help us design a lot of the products and services that we're using to deliver connectivity across all those different spectrums. - So you don't think, and I mean, I'm just asking the questions that I hear, 'cause this is the kind of stuff that people debate. You don't think that networking will go away. And do you need networking knowledge for the cloud? - So I don't know if I see those two questions as being tied together. I would say networking is not gonna go away. It is one of the core. I say three technologies, there's automation, networking and then virtualization. Those are the three core techs of cloud computing. So we're not gonna get rid of networking. You're gonna continue to see a robustness that grows. Our AWS networking options continue to become more and more aligned with the CCIE skillset every year. I mean the stuff we're asking our cloud architects to know, you need to know more BGP than you ever did before to be an advanced cloud networking specialist. So people who have that skillset and understand that level, and I'm talking CCIE level stuff here, they are able to get jobs with large providers and that is happening in a big way. The other question is, do I need to know networking to work in cloud computing? I definitely see that question being a no. That you don't need to know it. In a continual improvements of reasons why we don't have to know it. There are a lot of great managed services where I don't have to ever even look at an IP address or ever think about an interface. And that is, if you hear the term serverless, that's where a lot of this is moving for. But the audience is different. Okay, you're thinking developers then. These are developers who want to execute a solution without having design networks underneath of it. They're allowing AWS to design those networks for them. And also keep in mind too that Azure, Google cloud and AWS all have professional services divisions. So this is another area where you could be taking your Cisco skills and applying them to help these cloud providers integrate their customer's infrastructure, which is a really big problem. I will tell you what? The best job of all time that will never go away is that of an integrator. And it happens in networking, it happens in security, it happens in analytics, it happens everywhere. So, integration is the name of the game and the network people out there are still going to continue providing a crucial part of that integration story for us. So I don't see it going away. But also keep in mind, David, when I say that you don't need to know networking, you're thinking about very light level applications. You're not necessarily designing global infrastructure at that point. You're thinking about smaller pieces of business logic. So it's a very different paradigm that you're living in at that point. And again keep in mind, if you have a cloud skillset, you are better equipped to move laterally back and forth across these different parts of the industry. So if you get, if you feel something is a better fit, having those cloud skills is gonna make it easier for you to move to another provider, to another vendor, to another organization or to another role in your organization right now. - So let's say I come from, like a developer background or I'm interested in Dev. I'm not interested in networking security. I'm not too concerned about it. I wanna program or I wanna do Dev. Do you have a sort of a path as well for me? I mean, you mentioned previously machine learning, AI is really hot. So let's say I wanna get into that. What would you recommend? - Sure. Well, I would start with some of the basic tech background stuff like we've talked about like the Cloud Plus or the Network Plus, just some basic tech experience. Moving on in though, you need to get close to the data sets as quickly as possible. So wherever there is an interesting data location, and unfortunately I don't have a good cert path to just chase through this. There aren't that many that are developed in this way, they see it as a niche. But the big thing to understand is that you're talking about database problems. So you need to understand the formats in which data are stored in. So this means understanding NoSQL databases, relational databases, the differences between them and the wide array of next generation, what they call task-built databases and how those work. We have some great database certs here at AWS. Azure has some as well, okay? Those will get you into thinking about where the data lives, what it looks like and the problems with moving it back and forth between different parts of the organization. Those are the big patterns you need to know to be into data analytics and data engineering. When you get to that point, then you can start looking at the specific machine learning tools. Like AWS has SageMaker. And again, I don't mean to be so AWS centric. It's just my expertise. - That's fine. This is your opinion, Bart. So use your examples, that's fine. - Yeah. And so one big thing that AWS has done lately is our SageMaker products are all about improving. It's reducing friction. We wanna make it easier for you to take whatever data set you have, run the types of experiments you need on it at the speed that you need them to run on and get the results back. So you're then looking at an integration position again. You're taking services A, B, C, and F over here, and you're taking this dataset and you're stitching them together so that you can produce some sort of a business driving output, whether that be a report, a dashboard, some decision-making factor that they're using, or maybe even something that's part of an application's actual life cycle that it does. So I would consider looking then at data engineering. The Google data engineering position is one that I always hear people talk about as being one of the top positions. A lot of that really comes from the fact that I think Google has a big reputation as a very data oriented organization. So the data engineer position would probably even outrank some of the AWS data specialties that I've been talking about here. You start looking at things like Google Bigtable. These are other interesting products in the industry that are driving and pushing the boundaries of where machine learning is. At the same time AWS is creating tools like SageMaker to make it easier for us to work with those tools. So just the background on the data parts there, I would encourage you to get as close to databases as much as possible and begin understanding the problems that they have. That's kind of where I would start with that. - Bart, you mentioned three things. Can you just remind me what those are? So it was the three main things you said for cloud, were virtualization. And what were they again? - Yeah, it was a virtualization and automation and networking. Those are the three core technologies that I see. I don't really consider the data part of it a technology. Data is just the fundamental things. It is the people that we move. It is the stuff that we put in the boxes. It is what we're designing the infrastructure to support. So all of it's centered around data. Virtualization has a couple of concepts there. Remember that you're talking about running actual virtual machines, that is one of the primitive parts of it. But then you're also getting up into things like containerization. And so when I'm thinking of what skills I wanna have, I want to understand virtualization and how containers differ and how that evolved and where that's leading us, because all of those are important trends. And of course, the vendors that support those tools like Docker, Kubernetes, VMware. The vendor specific containerization products like Amazon EC2 or our container service or Elastic Kubernetes, there's a ton of great inroads to get into it. The next layer then is thinking about virtualization from like an abstraction perspective. It's kinda like using a menu at a restaurant instead of talking to the chef directly. APIs are a really important part of what we're doing out there. And that's the same for networking folks, it's the same for data folks, it's the same for developers. So understanding APIs is one of the skillsets that I kind of include in virtualization. Automation then gets us into the ability to reproduce effects over time or have them performed in an automated fashion. So these are all of your infrastructure as code solutions that allow you to build services like Terraform, Amazon Cloud Formation, resource templates from Microsoft. I don't know the Google variation of it, okay? The other automation layers then are how you're looking at event-driven behavior. When an event happens somewhere in your cloud ecosystem, how can you capture it and then respond to it? And remember events generic, it could be a network event it could be an application event, it could be a security event, okay? It could be a data delivery event that's occurred. So we're thinking about event-driven behavior and all of the cloud providers are pushing us in that same direction. The last part then was networking, okay? And really maybe networking should have been the first one on there. But all of this connectivity that we're talking about now is even more critical than it ever was before. And we're now entering into an era where edge computing and edge networking is becoming a really important topic. We're deciding, it's really a classic battle of where to put the data and where to put the compute from a user experience perspective. So we're seeing 5G. We're seeing satellite based services. We're seeing questions about how can we use something way up there when the compute is down here and the data is here? Well, let's move it there. And that means that now we're stepping into a whole other dependency on networking and connectivity. So the idea that it's going away, I just don't see it. I see diversification and enrichment happening in the networking field. And it means you really can't know too much about networking. And consider these edge, these edge locations are really important. The idea that we can run compute out very close to our cell towers, running them out in IoT devices that are on the backs of trucks or in factories. Those are all different networking realms that we still need professionals to be able to provide the right connectivity for. - Bart, it's 2022. What are the big trends that you see? We wanna talk about cloud and cloud certs, but what are the big trends that you see driving the industry in 2022? - Wow, okay. So 2022. Well, probably one of the funniest things I see happening right now is that hardware is king all over again. We're seeing a lot of really interesting new hardware come on the market for our large providers to use like smart network cards. The idea that you can offload computing from your virtualization infrastructure down onto the network cards, it's gonna change a whole bunch of the ways that cloud providers provide their services and the way that we deliver virtual services in our data centers right now. So watching where the hardware is going, it's really interesting. AWS and Azure are all designing a variety of circuits and chips that help drive costs down and improve performance. Especially since we just got done going through this crazy chip shortage. So what we can do with what we have is going to continue to be an interesting part of it. The only problem is a lot of that's like electrical engineering, computer engineering that's maybe outside the scope of what a lot of regular folks might be working on. So other hot topics, I definitely see software developed, software based networking, SD-LAN style architecture is continuing to be incredibly important. The quality of service and the control that they afford organizations are critical as we move into this re-diversified cloud era. So the more that you can understand about those complex wide area networking technologies, the better. And I know for some of us just starting out, that might seem like a really big goal, but it's closer than you might think. And you're gonna be finding that a lot of what's networking is reducing the gap between where you start and where you get to on that software defined world. I think a lot of it has to do with the tooling that's gonna come along. So really curious to see what Cisco is releasing this year. Further cloud integrations have been really impressive to me as well. Cloud computing continues to be something that organizations are afraid of because of the loss of control that they perceive. So the more we see services that can live around providing quality, compliance and governance management for your in-house resources and your cloud resources, we're gonna see a continual growth in that area as well. And machine learning again, like it's crazy hot right now. There is so much data, and there is very, very little value coming out of it. And that is a huge, huge vacuum that's just sucking a lot of focus in on the space. So that means we're gonna continue to see a better growth around data management tools and ease of access to data management tools. I'm thinking about things like data lakes and data warehouses. And then feeding them into the machine learning and artificial intelligence systems, which actually allow us to discover information. So again, I really see those as crucial. And of course, security. I mean, even though we keep coming back to this, it is even more important than ever before to have a very robust and dynamic security approach. And frankly, a lot of organizations are behind. They're struggling. It's one of the big stories we see with customers coming to AWS, is that they want to be able to use our big shield so that they can operate safely behind and learn. I mean, right now people are trying to learn what to do to protect themselves while being attacked. And that is a brutal situation to find themselves in. So if you can move parts of it into a provider realm where they're able to shield you from that and allow you to grow and develop, it's almost gonna become a necessity. One of the big stories that we say in class is, well you tell me, imagine your company's budget, okay? How much do you spend on security every year? Now ask yourself how much does Google, Azure and AWS spend on security every year? If your budget exceeds theirs, you're probably doing a good job. But I chance to say, it probably doesn't. - I mean that's brilliant. Any other things that you're seeing, like edge computing, stuff like that. - Yeah, and of course, the 5G transition and edge is gonna be really big. I think one of the biggest problems with this though is that, it's really gonna depend on software engineers to start writing tools that can take advantage of this and hen we can build the infrastructure out. But until you get those feature rich apps, so there is still a wild amount of software that's gonna be written in the years ahead to take advantage of our satellite infrastructures, our edge infrastructures and those low to the ground technologies like IoT. You're still seeing a lot of industrial modernization that's happening as well. I believe I saw a statistic the other day that said the average piece of factory machinery in the United States is at least 20 years old, which was pretty crazy. It's imagining that, that's what they're trying to build things on. And then the IT teams are trying to figure out how to monitor and interface with that. So again, that's a lot of really interesting hardware and software problems. And again, they create network connectivity issues as well for us. So we're thinking, we're still thinking, where does the network need to be? Where does the compute need and where does the data need to be? So more of that diversification, again, continuing on into the future. - So Bart, you've had a lot of experience. Would you recommend based on your experience that we need to learn to code, like programming something? So, would you recommend that I need to learn automation, a programming language like Python? Like if you had a skill that you felt today would really help my career, what would you say it would be? - Yeah. I don't tell people to learn to code. I tell them to develop code proficiency. And hopefully we can say that here. I don't want you to learn to write software. I want you to be able to take things that you're finding from the community, Python script templates, JavaScript templates, JavaScript object notation. I want you to be able to look at it and understand what it is and be able to integrate it and modify it. I don't need you to be able to write it all from scratch. But if you can start with a position where you know how to process and read those types of languages, it will definitely unilaterally help you out in a huge amount of ways across a huge amount of fields. So maybe not learn to code but develop some code proficiency. - And that will help you in the cloud, yeah? If you wanna be a cloud engineer or something. - Yeah. I mean so many different examples throughout Google, Azure and AWS, where we're using a standardized notation like JavaScript object notation, simply because so many different systems around the world understand how to consume and parse that. And that's a simple pattern. We want you to be in the same position as a person to be able to parse and understand it. And keeping in mind again, that you don't necessarily have to reinvent the wheel by being able to write it all from scratch. That is where these low code solutions are coming in, where we want you to be able to understand the effect of what you're configuring and be able to use a language to the point that it helps you achieve that reproducibility. Okay, we're not trying to smother you with settings. Almost everywhere I see in the serverless field right now, it's about reducing the amount of effort to write business logic. We don't want you to have to write as much code. You should be writing less and less the longer we do this. And I think that's a pattern that a lot of developers would agree with. - Bart, but I mean, I'm a young person. This is totally overwhelming. I mean, you know, I look at you and I'm just starting out and it's like, you know, I just wanna give up, I might as well go and get another job. What's your advice for someone starting out and is like despondent perhaps or overwhelmed by all this stuff? - Sure. Well, I think probably one of the most important things to do when you are feeling that way or when you find yourself in that space in IT is to recognize that you're not alone. And even if I tell you that, find a way to be a part of a community. These could be regional opportunities, they could certainly be internet-based opportunities. Before the pandemic, it was a lot easier to get together as actual local groups. I would encourage you to seek that out as much as possible. If you are in an educational environment and you're still at college or something like that, find the user groups of people who are working in a similar field and can corroborate your experience. I think that goes a long way to fighting burnout and to making sure that you keep your perspectives in the right area and move methodically through it. You're gonna see other people struggling through it and you'll be able to help each other out. I'm a really big proponent to that community model behind it. Plus it's fun. You're talking to your peers and you're beginning to network too. I think those are all infinitely valuable skills to develop that'll help you further on throughout your career. I still have people that I talked to that I met working here 20 years ago, and I still keep in touch with them on LinkedIn. And occasionally I get a gig from them. So never discredit the notion of the network and the community that you're building around it. And if you don't know, Twitter is a great place to start. There are a lot of smaller communities that you can find outside of that. I know Twitter is huge and crazy. So if you start there though, you can find some of the other smaller groups that you might find will really help you out. There's a lot of new tools coming online. And I think the pandemic helped us with that, honestly, to make sure that there was even more remote access for those sorts of communities. So do what you can. I even run a little virtual open mic now because I can't go play outside. I just do it online, but it's still, that's my community. And it's a chance to refresh and work with your peers. - So I'll put a bunch of links below. Are they links that people can follow you? Where can they follow you? Where can they connect? Where can they learn from you? - Sure. Well, you can find me at AWS. I'm out there training. So if you take a look on aws.training, you'll find me. Twitter, @cloudbart. You can find me on YouTube, /cloudbart as well. Those are the two platforms I'm most active on. You can also find me on LinkedIn if you wanna connect out there as well. So just do a little search for Bart Castle, AWS, and I'll be there. - So Bart, tell me, in a lot of conversations I've had with people, they talk about networking on LinkedIn and places like that. Is that something that you think is a good thing to do in the cloud space as well? It's like, how do I? I'm starting out. You know, how do I connect? Who do I connect to? Do you have any advice for that? - Yeah, one of the that's been particularly impactful that I've seen the last couple of years are these Cloud Resume Challenges. There's one particular from Forrest Brazeal. I hope I said his name right, Forrest. But he basically approached it from the same scenario where he's like, \"Look, I realize that you can go and learn the solutions architect content. But when you go to a job interview and you want to demonstrate those skills, sometimes there's a disconnect between I got the cert and do I have the skills, especially if you're just starting out.\" So the Cloud Resume Challenge is an interesting opportunity where they're actually having you use a wide array of complex cloud services to basically talk about yourself. It's essentially, it's a blog project that you're running. But it gives you a chance to practice actually publishing the resources, getting them online. And then you can talk about how you built that technology on your site. And hopefully talk about your other little side projects. I really encourage you to find something that you're passionate about that IT can help you with or cloud or a code can help you with and start doing some pet projects and find a way to showcase them. I think that that's a really important pattern. So closing the gap between I just started, I know I know a lot, but I don't know how to show it off. - Yeah. That's a problem, yeah. - It's a big problem. And those communities are gonna be places where you can get ideas of other projects. You can share ideas with other people. You can collaborate with them. The other part too is that resume review is another thing that a lot of communities can help you with too as you get your resume together. And you're talking about how to find positions or where to work or where not to work, you know. Those community folks, they can help you out with that quite a bit. And again, that's something that I like to offer as much as I can. People send me resumes pretty regularly and I'll usually can help them a little bit there. So I do offer that. Let me know if I can help you with, if you have any requests there, send some stuff to me and I'm happy to take a look at it and see where I can help. - So how do they do that? 'Cause you might get lots of requests. Is that to your Twitter account? What's the best way to send you stuff and interact with you? - Sure. Yeah, Twitter is probably the best way. I try to keep a few like mentorship things going on the side that I help people with. You know, I only do what I can. But if you reach out to me on Twitter, usually I can catch stuff on YouTube there as well. If it's a popular topic, I'll try to record a video. I haven't been doing as much recording lately. But Twitter is my most active platform. So if you wanna reach out to me on Twitter, I will do my best to field your questions. Yeah, I'd love to help out. - That's brilliant. I mean, so this is called the cloud challenge. Is that right? I've heard it mentioned a few times and then you build like a site with these different skills that you've learned, is that right? To try and showcase it, you actually know what you're talking about rather than just having a piece of paper. Is that correct? - Exactly. So you're actually gonna end up with a blog that's running on a cloud provider somewhere so that you can talk about the services that are driving your site in the background. Exactly. The Cloud Resume Challenge specifically is the one that I was talking about. And beyond that, though, if you reach out to me on Twitter there, I can definitely hook you up with some other cloud specific people that are good to follow so that community building can happen there. And like I said, you really might not know where you wanna go yet. And once you start talking to others in the industry and seeing what they're doing, that's where you start really honing in on and going from, I wanna get into the cloud to I wanna do this specific thing in the cloud space. And that's where we can really help you. - So I'm gonna recommend everyone to follow Bart on Twitter. I'll put the links below. Bart, I really appreciate you, you know, being available and willing to help people, you know, get into this. Now before we wrap up Bart, are there any closing thoughts that you've got? Anything you wish you knew if you were starting out? - Yeah, I wish I had learned Linux earlier. When I was in college, I went to a two-year Associates Program and it was really lightweight. It was a very accelerated thing. It was done in like 18 months. Honestly, it didn't take very long to complete it. But, I wish I had learned Linux back then. I left with an MCP, a Microsoft certification. And I did use it, but I wish I had learned Linux a lot earlier on. Just understanding how to use it, how to work with the file systems and how to understand how workloads run on them. All of that would have been a really big help for me in every field that I've been on up to this point so. - And the course you'd recommend is Linux Plus, yeah? - Linux Plus is a great one, yap. That's a great start from Cloud CompTIA. There are other ones that are more specific to certain distributions, but that's a great starting point. - Bart, I really wanna thank you, you know, for taking the time to help the community. Thank you so much for sharing your advice. I mean, you've been in this game a long time, and I know you've done many, many things. And you've been in cloud for a long time as well. So I really appreciate you, you know, sharing with all of us, so thanks. - Absolutely. You know, cloud has been something that allowed me in technology to move where I wanted to. I wanna see people be able to leverage those same advantages. - That's brilliant. Thanks Bart. - Cheers David. (electric sound)",
    "transcript_keywords": [
        "Cloud",
        "AWS",
        "networking",
        "AWS Cloud Practitioner",
        "AWS Cloud",
        "lot",
        "Linux",
        "cloud practitioner",
        "cloud practitioner essentials",
        "Azure",
        "Cloud Essentials",
        "cloud services",
        "people",
        "Yeah",
        "cloud computing",
        "Google Cloud",
        "AWS Cloud Professional",
        "cloud providers",
        "data",
        "thinking"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "a ton",
        "Bart",
        "these days",
        "Linux",
        "three",
        "like 18 months",
        "the Cloud Essentials",
        "SD-LAN",
        "Cisco",
        "Palo Alto",
        "AWS Security Specialty",
        "two",
        "Yap",
        "SysOps",
        "NoSQL",
        "YouTube",
        "Azure Fundamentals",
        "Google",
        "DevOps",
        "Python",
        "Oracle Cloud",
        "Docker",
        "Linux",
        "Elastic Kubernetes",
        "SageMaker",
        "the Azure Fundamentals",
        "AWS Cloud Practitioner Essentials",
        "Deloitte",
        "Cloud Essentials",
        "CompTIA certs",
        "David Bombal",
        "CompTIA",
        "at least 20 years old",
        "the CompTIA Linux Plus",
        "The Cloud Resume Challenge",
        "CCNP",
        "David] Yap",
        "MCP",
        "healthcare",
        "the years",
        "Linux Plus",
        "CCMP",
        "Google Cloud",
        "Azure",
        "CISP",
        "the Cloud Essentials",
        "Bart",
        "today",
        "the next 10 years",
        "these Cloud Resume Challenges",
        "Google Bigtable",
        "one",
        "the Cloud Plus",
        "Cloud Bart",
        "firstly",
        "the Azure Administrator Certifications",
        "YouTube",
        "the Cloud Resume Challenge",
        "DevOps",
        "2022",
        "the Network Plus",
        "almost 20 years",
        "first",
        "the Azure Security Specialties",
        "IoT",
        "the United States",
        "Cloud CompTIA",
        "Forrest Brazeal",
        "Amazon",
        "sec",
        "AWS",
        "CCNA",
        "Twitter",
        "the last couple of years",
        "this year",
        "David",
        "2022",
        "IP",
        "Linux",
        "AI",
        "Accenture",
        "Cloud Plus",
        "VMware",
        "OpenStack",
        "LinkedIn",
        "Associates Program",
        "the years ahead",
        "5",
        "BGP",
        "every year",
        "CCNA",
        "10",
        "The AWS Cloud Professional Solutions Architect",
        "CCIE",
        "the other day",
        "third",
        "Forrest",
        "Kubernetes",
        "five",
        "20 years ago",
        "Amazon EC2",
        "One",
        "Amazon Web Services",
        "SAP",
        "F",
        "the Linux Plus",
        "two-year",
        "the CompTIA Security Plus",
        "Bart Castle",
        "JavaScript",
        "Linux Cloud",
        "Cisco",
        "CCNA",
        "Amazon Cloud Formation",
        "Cloud",
        "Twitter",
        "Liberal Arts",
        "Azure",
        "fourth",
        "Terraform",
        "Raytheon"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG"
    ]
}