{
    "id": "6n7mPKEevIE",
    "title": "Mac Pro ❤️ Unboxing behind the scenes!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-12-11T17:17:09Z",
    "video_url": "https://www.youtube.com/watch?v=6n7mPKEevIE",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 372778,
    "likes": 12872,
    "comments_count": 938,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and welcome to the behind the scenes of shooting the Mac Pro unboxing video. For this video I wanted to get really crazy, I normally only shoot 4K, we're shooting on three 8K red Heliums, we've got Tyler over here, Cory over here, Nathan over here. I was looking to get three AK reds basically, at a last minute notice and somehow, I managed to text Nathan, over thanksgiving break, he happened to be at Alternative Rentals, where we got these cameras at. So huge thank you to you guys in Culver City. Hi, thank you for making this beautiful project possible. (slow techno music) We've also got a lot of other gear happening here, specifically for this shoot, I knew it was going to be happening so I got a light, over here, check this one out. One of the things that I haven't had forever, are C stands, anytime anybody comes over to do a shoot they're like \"where are your C stands?\" I don't have any. I've got C stands, we've now got some sandbags. Because usually I was just telling people to sit on this here, to hold it down. I've had some great Black Friday deals. These guys right here, also a new addition, not rentals, these are the NanLites. They're great because you can also switch them to RGB colors which I'm not going to touch right now. But you can see an example back here. We've got those set to a nice orange hue. Of course we have the centerpiece of this whole entire video, which is the new Mac Pro. We've got the two, dual Pro Display XDRs. These are the matte versions, which are really great because behind me is a window, so if we were shooting and these weren't the matte ones, you would see so many more reflections. It's been a while since I've edited with this kind of matte display, this thing is so insane, I've just been kind of stepping back, and just admiring the beauty. (slow techno music) This is behind the scenes of shooting the beauty shots, for the Mac Pro. This has been two, incredibly intense days, but it's been worth it. - That's all you need right there. (slow techno music) - We're now on our way to rent a slider, because we wanted to get some cool B-roll shots of the Mac Pro, you may or may not have already seen those. You know, we just thought we would go out and make a vlog. Are they gonna yell at us for filming in there? I feel silly. Nathan what did you get us? This is a big boy. What I was picturing like a small, tiny little thing. - Well that wouldn't work for those huge cameras we have. - You're right. - Yeah, so we had to get the real thing. - Well. - [Man] That's happening now. - I have to put this. - I'll get you some coffee. - That will go like, into there. - I'm gonna need, a new server at this point. - If you just wheel it, and I'll carry these. - Okay, did you still have my card? Did it run? - [Cashier] Yeah I ran the payment, it's all good. - Okay, perfect, thank you, appreciate it. I definitely thought this was going to be smaller, like this is the size of a body. That's gonna have to do. Let's get back to it. (rock music) It's also been a really long time since I've edited with dual monitors, so this has been a really great experience because I'm able to have one of the monitors set as a completely full resolution of the video that I'm editing, and over here is kind of like my workspace timeline. Unfortunately this isn't my official set up, like I'm gonna have to move this stuff upstairs. We're still in shoot mode right now so we basically, turned this entire living room into a set. We moved couches. Nathan how much total gear did we rent? Like how much would that all have been if we bought all this gear? - I mean over half a million dollars. - Oh my gosh. Renting is cool. You wanna come see where I hid all the mess? Before we started filming, I realized that everything was a complete disaster so I cleaned up a little bit, and this is what it looks like cleaned up. We kinda just have been moving stuff around and hiding all of the mess. One thing that we always do have on hand, bananas. Yeah, this is, this is it. This is the behind the scenes. (chilled music) Matty look here honey. Matty who's a good boy? Look here. Do you love Mommy? Do you wanna sit for Mommy? Can you sit? Wait. (chilled music) - [cameraman] Can you pull the brightness down a little? - Can I? You don't want this 1600 mix? What am I saying? This has been two days of very long, shooting. Everyone has been great sports, we ate a lot of food. Lot of pizza, I think we're all still recovering from yesterdays pizza. - They're both at full brightness? - Yeah, oh. - Oh what was that? What did you just do? - [Justine] I turned it down, do you want it down more or do you want it up? - It's all very much in, keep hitting down, that's good, yeah let's see what that looks like. Can you match that? (Justine yawns) - Okay oh. - [cameraman] Is this how you're gonna edit from now on? - (laughing) I think so. - [cameraman] With this nice lamp. - Yeah, it's good. - [cameraman] I don't know if this is, it might be really good for your posture I don't know. - It might be, I don't think I'm ever actually gonna get my house back because, there is stuff everywhere. I just, tried to clean up but. - [cameraman] Let's take a look. Oh man. - If you guys haven't yet seen the official video, I'll put a link in the description, and an annotation at the end, so make sure you guys go check that out. Yeah, this is it. Hope you guys enjoyed the video, and are you snacking? The one thing that we always have, on hand are plenty of snacks. (cheerful music)",
    "transcript_keywords": [
        "Mac Pro unboxing",
        "Mac Pro",
        "Pro unboxing video",
        "Pro",
        "Pro unboxing",
        "Yeah",
        "guys",
        "Justine",
        "Mac",
        "video",
        "red Heliums",
        "Hey guys",
        "shooting",
        "great",
        "Nathan",
        "shoot",
        "Culver City",
        "unboxing video",
        "good",
        "thing"
    ],
    "transcript_entity_values": [
        "1600",
        "Matty",
        "two days",
        "one",
        "Alternative Rentals",
        "RGB",
        "Justine",
        "Nathan",
        "4",
        "Mac Pro",
        "three",
        "thanksgiving",
        "8",
        "NanLites",
        "the Mac Pro",
        "two",
        "Cory",
        "Tyler",
        "the Mac Pro",
        "Nathan",
        "Friday",
        "Culver City",
        "AK",
        "One"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "GPE",
        "FAC",
        "CARDINAL"
    ]
}