{
    "id": "6olELByj0xw",
    "title": "Casio ProTrek F30 Hands-On: A Smartwatch For The Great Outdoors",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-08-29T23:38:30Z",
    "video_url": "https://www.youtube.com/watch?v=6olELByj0xw",
    "category": "Science & Technology",
    "tags": [
        "casio protrek f30",
        "casio wsd-f30",
        "casio protrek f20",
        "best smartwatch 2018",
        "smartwatches",
        "wearos",
        "mrmobile",
        "wearos 2018",
        "michael fisher"
    ],
    "views": 178756,
    "likes": 3905,
    "comments_count": 145,
    "description": "Im MrMobile  and for the past two years my go-to summertime smartwatch has been the ProTrek series from Casio. So you can imagine I was pretty pleased to find that here at IFA 2018 in Berlin, the company  has brought a proper sequel. Join me for an early look at the new ProTrek  the Casio WSD-F30 Hands-On from IFA 2018!    [SPONSOR]  This video brought to you by TunnelBear. (Rawr!) Get 59% off a 2-year TunnelBear VPN plan using MrMobile's exclusive link:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S CASIO PROTREK WSD-F30 HANDS-ON]  MrMobile's Casio ProTrek WSD-F30 Hands-On was produced following an hour with a WSD-F30 review device at a Casio press event at IFA 2018 in Berlin Germany. Pre-production hardware running pre-release software. This video was sponsored by TunnelBear.   [MUSIC]  \"You Know U Iz\" by GG Riggs, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #casio #smartwatch #protrek #smartphones #technology #ifa18 #ifa2018",
    "description_links": [
        "http://click.tunnelbear.com/aff_c?offer_id=76",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.premiumbeat.com/royalty-free-tracks/you-know-u-iz",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "(upbeat music) - [Narrator] I'm Mr. Mobile, and for the past two years my go-to summer time smart watch has been the Pro Trek series from Casio. So you can imagine I was pretty pleased to find that here at IFA 2018 in Berlin, the company has brought a proper sequel. The Pro Trek F10 and F20 were designed for adventures and the great outdoors with rugged casings, alti barometers and a dual layer display years before anyone else was doing it. But the thing is to get to appreciate their special features you first had to get over just how huge they were. Well with the brand new F30 Casio might finally have made the Pro Trek line accessible to folks who don't wanna wear a coaster on their wrist. It's still a thick watch, barely a half a millimeter thinner than the F20 but it's now almost four millimeters narrower. Casio has also made the watch band more flexible while also adding more notches for more granular sizing. The major upgrade to the hardware here is the display, Casio makes the switch to an OLED panel, higher resolution and much more vibrant than the IPS LCD's have the prior to and hopefully more power efficient as well. Switch that display off and you've got the segmented LCD for day time viewing and now the watch can show altitude and compass bearing on that screen as well as the time. That might come in handy to the hikers and outdoors people who buy this thing, and there's is also a new extend mode for them as well. That basically saves your battery by maintaining a GPS track while keeping the screen off. Casio promises up to three days of tracking in extend mode which also lets you schedule periods of time out for even more energy saving. And of course I'd be remiss not to point out the new version of Wear OS being displayed here. Google's new wearable platform now uses swipe in gestures from the four cardinal compass directions to get you to your most often used features on the smartwatch. I've only used it for grand total of 15 minutes but already I can say that this is a large improvement over what we're dealing with currently in Wear OS. More to come. To these improvements Casio also brings familiar carry overs both positive and negative. The compact but slightly finicky magnetic charging port, the three side buttons, the heavy durability, the lack of a heart rate sensor. And even with all the improvements and keeping in mind that amid all miniaturization it's still a big old watch. Casio's expected stand by time of just 1.5 days is, well, as usual I expected a little bit more. We'll see how it stacks up out in the real world when I do get the chance for a full review. The Pro Trek F30 will be available in three colors, presumably some time this fall. But exact pricing and availability are, as of yet, TBD. This video is brought to you by TunnelBear. True story, it's the first VPN I ever used, and I'm genuinely glad to sponsor it. TunnelBear lets you browse the web safely on a public hotspot, which I'm on frequently. And it lets you do it with the flick of a switch. TunnelBear even opened itself up to an independent audit to prove it's keeping its security promises. Mainly though, gotta be real, I'm here for the mascot. (bear growls) Help support Mr. Mobile secure your browsing for the next two years and save almost 60%. Hit the link's in the description to secure your special deal on TunnelBear. And thanks. Be sure you're subscribed to the Mr. Mobile on YouTube so you don't miss that full review and follow me at the same handle on Instagram for all the latest at IFA 2018 in Berlin. Until next time, thanks for watching. And stay mobile my friends.",
    "transcript_keywords": [
        "Pro Trek series",
        "Pro Trek",
        "goto summer time",
        "summer time smart",
        "Pro Trek line",
        "time smart watch",
        "Trek series",
        "Casio",
        "goto summer",
        "Pro",
        "Trek",
        "time",
        "smart watch",
        "watch",
        "summer time",
        "time smart",
        "made the Pro",
        "Trek line accessible",
        "Mobile",
        "past two years"
    ],
    "transcript_entity_values": [
        "IFA 2018",
        "the past two years",
        "TunnelBear",
        "Instagram",
        "Casio",
        "Berlin",
        "15 minutes",
        "F20",
        "OLED",
        "YouTube",
        "four",
        "three",
        "almost 60%",
        "The Pro Trek F30",
        "Pro Trek",
        "the next two years",
        "Mobile",
        "The Pro Trek F10",
        "first",
        "day",
        "Google",
        "up to three days",
        "years",
        "Wear OS",
        "this fall",
        "just 1.5 days",
        "almost four millimeters",
        "LCD",
        "F30 Casio"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG"
    ]
}