{
    "id": "6Rw6bPCCDdY",
    "title": "Blue Baby Bottle Setup - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-09-28T20:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=6Rw6bPCCDdY",
    "category": "Science & Technology",
    "tags": [
        "Blue Baby Bottle Setup - Krazy Ken's Tech Misadventures",
        "Blue Microphone",
        "Blue Baby Bottle",
        "Blue Baby Bottle Demo",
        "Microphone",
        "Unboxing",
        "Focusrite",
        "Focusrite Scarlett",
        "Audio Interface",
        "XLR",
        "Podcasting",
        "Adobe Audition",
        "Sound Mixing",
        "Apple",
        "MacBook Pro",
        "Mac",
        "macOS",
        "Computer",
        "Tech",
        "Demo",
        "Funny",
        "Humor",
        "KKTM",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken"
    ],
    "views": 26388,
    "likes": 498,
    "comments_count": 108,
    "description": "The best mic Krazy Ken has ever owned . . . the Blue Baby Bottle SLcombined with a Focusrite Scarlett. On this curse-free day, Krazy Ken decides to set it up, and put on a demo for you.  Get your own Blue Baby Bottle   Want more videos like this?   Subscribe for more tech videos!    Special thanks to Podcastage:  @podcastage  Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #67 - Blue Baby Bottle Setup  You can get your own Blue Baby Bottle mic (with a kit) here:  Youll actually get more value than Krazy Ken did (because he didnt buy a kithes an idiot).  Want to buy (Krazy) Kens previous USB mic? DM him on Twitter @thecomputerclan, or leave a comment on this video.  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "https://amzn.to/2Op7QER",
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/2xWyKcR",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "https://amzn.to/2Op7QER",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] Important safety instructions. It comes in a (beep)ing wooden box. That is freakin' cool! You know I need to think of something really cool to first say on this microphone through a recording. How about like a little vocal warm up? OK, so remember the important safety instructions that I just tossed aside? Let me read these to you, because they sound like an evil king is like threatening my castle. (beeping) (techno music) Hey guys, how are you all doing? Really? That's just great. You know, I'm doing great today too, because I'm so freaking excited. Let's check it out. DUN DUN DUN. Yes, I have a Baby Bottle Right, you may think it's an odd name but it's a bottle style microphone and it's the Baby version of it. The real Bottle microphone from Blue is about five thousand dollars. So, I thought let's get the less expensive version, because it is time that I really step my game up and go analog. I'm not a huge fan of digital microphones anymore. The more I learn about sound, the more I learn that analog really is the way to go. I mean, it's used everywhere. So I figured, why not go back to the old ways of doing things with analog? In fact, you're listening to my voice right now through an analog mic. In fact, every time you've watched a Krazy Ken episode, ever since I got this ME66, you've been listening to me through an analog microphone. So, spoiler alert, the magic's all ruined. But, wait, there's more. I also have a mystery box which we will be getting to later. So, without further ado, let's get this unboxed, take a look at it, set it up, and then listen to how it sounds. I have never placed my voice on one of these mics before, so this is going to be a first time experience for me. I'm doing this blind. Okay so, let's set that aside for a sec. Let's just take a look at the whatever you technically call this part of packaging. The sleeve, I guess? It looks pretty. Blue, more Blue Baby Bottle SL. I forgot what the SL means. It is a large diaphragm studio condenser microphone, and it actually has a high high pass filter, and a minus 20 decibel pad. So, we can do things like, let's say there's a bit of background noise, like an air conditioner or something. Flip a switch and you can remove that sound without any post processing. However, you can absolutely do post processing with this microphone, of course. Or you can run it into a mixing board like a Behringer X32 or something else that you could get instead of buying a car. Sound stuff is expensive. Just watch it, okay. Time for the ultimate reveal. Oh yes, that, that is awesome. Holy balls, hang on. Okay so you got a quick start thingamajig. We'll probably take a look at that later. You know what, oh shit, it's stuck. Okay, hold on a second. Well at least we know its securely in there. Okay, I'm going to approach this a different way. I am going to take this out and we'll get to that in a sec. Because, this is too cool. I'm going to get to that later. Okay, Blue sticker, that's pretty cool. You can wear that on your car. Be like, yo, (beeping) you, Neumann, I use Blue. Ha ha ha, Neumann's actually really good. You also get one of those games you used to play in elementary school. Like, all right, pick a number. You know? This is kinda like the new version of that. And then, we get a monolith that just shat out a card. We'll look at that in a sec. And I believe, that's it. That's all she wrote. We'll set that off to the side. And well get back to our monolith. Actually I'm gonna be honest, I ordered this quite a while ago. I don't exactly remember all that comes with it. But I think that this is the shock mount. Oh, yes indeed, that is a shock mount. So this is what holds the microphone so if there's any vibrations or movements in the room if something bumps the stand, the mic stand, you know this type of shock mount or cradle has these bungee chords in it to absorb said vibrations to keep the sound more clean. So that's another thing that helps. I'm thinking I should also get a pop filter for this but I don't, I didn't get one yet. So, that's really cool. We're gonna kinda set that over there. There you go. Now the cool part. It comes in a (beep)ing wooden box. That is freakin' cool. Like that's legizzle. I probably shouldn't have said that, I'm sorry. But yeah it, look at that, nice wood box. I like that. So we'll take that off. Blue, but in fact it is red. That's an optical mind trick. Oh, Baby Bottle quality control certification. Back in the old days they used to, I'm pretty sure the inspector used to sign their initials on these. I swear they used to do that because I've seen one of these before at a studio I work at. Ha, now they just do a barcode. Well, I hope these are still like handmade. At least I think they're handmade. That kind of removes a little bit of the handmade-ness, but still if it sounds good that's what I care about. And there she is, assuming it's a she. Wow, I uh, I don't know if I can actually use this. It's so beautiful and pristine looking. Oh my gosh. Get outta town. That just, that definitely has that like vintage inspiration in the design which is what I'm going for. But I'm not just looking for vintage inspiration in the design, I'm looking for vintage inspiration on how it sounds or in how it sounds. And how it works. There you go, XLR on the bottom. For your nice analog interface. Oh this just feels really nice. I don't want to get fingerprints on it. But I just want to feel it, like this. This feels really goods in your hands. That's nice and metal. Definitely vintage inspired in the design. So as I was saying earlier, I'm ditching the whole digital thing. I don't wanna do digital frickin' sound anymore. Which means, I'll be getting rid of my old RODE. Which, it's kind of funny to think about. Over a million people have heard my voice through this thing. But I think it's time to move on from this. This has served me well. This plugs in, just through USB Type B. For those who don't know, you might be like Ken, that is the weirdest lookin' USB port I've ever seen. How the fricky frack you gonna plug that into your computer? You don't. You don't plug it into your computer. And that's the point. That's what I wanna do. You plug it into a mixing board. You plug it into an audio interface. You don't just plug it into a computer because honestly, that's kinda shitty. It can be really shitty at times. Now if you're on a budget and you just want a plug and play solution, go for something like that RODE NT-USB. It'll fit you hopefully well. What is a shirt? I don't know. But I'm going analog. So, that's where the mystery box comes into play. And before we get to this I should probably clear this off a little. Ah, much better right? Oh it's all taped together. Okay. I just trimmed my nails so this is gonna be tricky. But we'll make it work. All right, you know what? One second. Well I wanna cut my fingers a break. But I don't want to cut my fingers off. So, Kershaw to the rescue. All right. And that should do it. Ladies and gentlemen, boys and girls, say hello to the Focusrite Scarlett 2i2. (funky beat sounds) That's enough of that. Okay. So this is how we get the analog signal into the computer. (funky beat sounds) And it goes over USB. I honestly wanted to go with Thunderbolt but it seems like all the cool, hip, new audio interfaces are going to Thunderbolt 3. And poor little old me is still on Thunderbolt 2. So I had to settle for USB. But I think we'll be okay. Because I have used USB with Behringer sound boards. Like 32 channel Behringer sound boards and it sounds fine. So we'll be good here so, yeah Focusrite Scarlett. Let's have a peek. Important safety instructions. And there it is. Pretty, nice and metal. Kind of a brushed metal-y finish. Knobs. And some other stuff. So, this is yeah, this is oh silica gel. Do not eat. What a shame. Okay. And, ooh look at that, hang on. I believe this is our included fiery red USB cable. That's kinda cool. Let's take it out of the condom unit. Okay, okay, okay, Kershaw. No that wasn't manly enough. Let's do that again, there we go. This may be a little bit of overkill. Oh it's just a single piece of tape. Well, you know yeah, I'm not gonna poke the metal. Go away Kershaw. I'm just gonna take the tape off. I wanted to be all cool, oh shit. That was probably a bad idea. I just smacked it against my aspen. Yeah I said aspen, that's what this type of wood is. Yeah, dangerous do not eat. Desiccant silica gel. And then Japanese. Okay, so here we have our XLRs. Line and I'm guessing instrument, ha ha. Ooh, I don't know. Line and instrument I guess. One and two. And then the gain. For how much of a signal we'll allow to pass through the XLR ports. I hope I'm using the right terminology here because I'm kinda new to this. We have our 48 volt phantom power which essentially means we can power the microphones through the XLR instead of having to attach the microphones to like a power baluster, plug 'em into a outlet or something. We can just power them through phantom power. And we have a monitor dial for our output. Which I'm guessing is here. We have 1/4 inch out for our headphones. Flipping it over. One, two, three, boom. We have our K port. I think that's a Kensington security lock, I'm guessing. There's our USB type B to output to the computer. And then our line, oh those are line outputs. Not inputs. Designed in England, made in Chainor. Perfecto. All right, Focusrite. We're gonna test you out next. (laughing) Oh and it is bus powered so it just runs off of USB for the power. And to push the digital signal to the computer. Okay so remember the important safety instructions that I just tossed aside? (laughing) Okay, let me read these to you, because they sound like an evil king is threatening my castle. Okay, read these instructions. Keep these instructions. Heed all warnings. Follow all instructions. (laughing) What? I am (beep) ing serious. Those are the first four lines. Of the safety instructions for the Focusrite. Oh, it definitely was made in England wasn't it. (laughing) Read these instructions. Keep these instructions. Heed all warnings, follow all instructions. Do not use this apparatus near water. (laughing) Oh my gosh, this was um, that was a treat. It also says protect the power chord. There is no power chord for this. It's bus powered you nitwits. It's clearly a general purpose sheet not specifically for the, what is it the 2i2? That doesn't really roll of the tongue. But I trust this, I've seen a lot of other YouTubers and podcasters use this brand so I'm gonna do it. I'm not a huge fan of the seraph typeface on the top. Font I guess, I'll never know. But yeah it's okay, I guess it's classy. Okay that was fun. That was incredibly fun. Before I complete the setup of the new analog microphone, I'm just gonna record a quick sample from this digital microphone to remind everyone how it sounds and we'll do a little comparison. Let's plug stuff in. Big, red, shiny cable. I was gonna use another USB Type B cable but I couldn't find one during the 60 seconds I searched, so I'm just gonna use the provided one from this other microphone quick. All right. That's the HDMI port, there we go, okay. That's a really tense cable. Not very bendy. I'm an idiot, dude, what am I doing? I need to like lay off the boozies and the twozies. I need to plug this into here, not the Focusrite. Yeah, Focusrite, that's what I need to do right now. Jeez Louise. Okay so I'm currently speaking into the normal mic I use to talk to you guys. The Sennheiser ME 66, which runs to the Blackmagic camera. I'm gonna switch over to Adobe Audition now with the USB mic that I've been using up until this day. And this is what I sound like coming through the USB microphone, the RODE NT-USB. Right, now that we have that down, let's have a listen for the first time ever to the Baby Bottle, which again, I've never used before. This is new to me. Right, so I've been doing some thinking during that jump cut and I realized that I didn't really buy a stand for the Baby Bottle. Ha, I may have to MacGyver some things together. 'Cause I didn't really want to buy a bunch of accessories until I knew I was keeping it. So I'm just gonna have to jerry-rig something. I don't have a stand for it. I also crap, I don't think I have an XLR cable for it either. I'm just gonna have to borrow from another piece of equipment just for today at least. (laughing) Should've checked my grocery list. Let's see, milk, eggs, fabric softener. Oh yeah, XLR cable, it's on there. I didn't buy it though. Okay now for the fun part. Let's put the Baby Bottle on the NT-USB stand and hope it balances, yeah. All right, let's jerry-rig something together. So unplug that, and we're going to piss off Adobe Audition. It's probably gonna be like you unplugged something, yep there it goes. You unplugged something you son of a bitch. I don't know what to do I'm just a computer. I can just calculate trillions of operations per millisecond and I don't know what to do when you unplug something. Actually trillions of operations per nanosecond. No, that's not realistic. I was joking about that. Okay obviously I'm doing this wrong. That's the, that's not supposed to happen. Gosh darn it, how do you take this thing off? Okay hang on, I'm a professional. Actually I might have been doing it right. See it's on like a rivet, so it spins around so you can swivel it, but then it's like weird to unscrew. Oh wait, no I was doing it right. Ha! Boom. Okay. This which actually has a pop filter will sit off to the side, I don't have a pop filter for the Baby Bottle. I might have a spare one lying around somewhere. We'll have the little shock mount cradle thing here. And we're gonna, just make sure I do this right. Gonna assemble that bad boy like that, oh, there we go, I just gotta screw it in. I want it nice and centered. That's a lot of screwing. That sounded dirty, I'm sorry. It's just a, long screw. There you go, nice and tight like tiger. You're very tight, Mister Powers. Tight, like a tiger. It's like the descent stage of Apollo. It's like the lunar excursion module. The swinger has landed. Okay, actually I could just, you know, the XLR cable won't clear. I'll need to put this on. Ha ha, I want to put it on this thing here. And it came with a bushing so I can go from, whatever that is to a 5/8, I forget the actual dimensions of the bushings and stuff. So yeah, it's a little MacGyvery, but it'll work for this test. I will get an actual stand for it when the time is right. And now, I just hijacked this XLR from the Sennheiser kit. Helps if I plug it in the right way. And bon appe-TIT (sorry), we have a nice analog connection going here. So now we gotta go to the interface and then from the interface to the computer. Alley-oop. We'll just go into the first XLR here. Plug her in. It's kind of a mess of cables. It's also just for testing purposes. When I have this setup in my office, it'll look a lot neater hopefully. I can see our USB light there so that's good. Now I just gotta get it configured with Audition. Well I clearly have not wiped down this screen in a while so I apologize for that. Let's take a look at the preferences. Scarlett 2i2 USB. So that just detected right away, perfect. I'm gonna turn phantom power on. Turn up our gain. We have input one. Okay so you can't see this right now but I'll show you this later. The volume knobs actually blink when signal's being picked up on the Focusrite so that's really cool. Yeah I was having problems picking it up in Audition but I think it's set to the wrong device. That would, oh, that would be why. Input one and input two. Okay so I actually can split it over this USB, that's cool. Check one two. Oh we got signal! I'm gonna turn this down all the way. Turn it up all the way, nope that didn't do anything. Okay so that monitor dial must actually be for monitoring somewhere else. The actual signal we're sending in the computer just must be dependent on our gain fader. Check, check, check, check, check. Gonna crank it up. Check, check, check, oh yeah now we're clipping, okay. So that's on the gain fader. The gain fader is turned all the way down. And it's still getting a signal so I guess you can't go all the way down on this thing. That's interesting. So it's not touching the red. I gotta reset that warning, there we go. Check one two, check one two, beautiful. Okay we're not clipping. So, I'm gonna plug some headphones in. And test this baby out. All right, I'm not gonna listen to this directly through any type of input monitoring because I want to hear it after I make the recording. So, I'm going to record in Audition. You know I need to think of something really cool to first say on this microphone through a recording. How about like a little vocal warmup? The wire is wound around the wheel. You're listening to WFCK radio, where the only thing missing is you. Yeah, that sounds pretty freaking good and it's gonna sound better once I actually put some processing on there to give it a little more texture and a little more punch. But oh my gosh, that sounds great. Let's have a listen to the USB mic here, again. And this is what I sound like coming through the USB microphone. The RODE NT-USB. Yeah, I mean they sound kind of similar but I can tell the Baby Bottle definitely has that warmer sound. And I bet if I listened even closer I'd be able to notice there's less of a noise floor. Less background noise with this because we have the filters built in. I believe that's a, (laughing) oh my gosh I always reverse low pass and high pass filter. But anyway that's on there. Yeah let's do some more samples. Now that I think about it that wasn't really a fair test because I wasn't very close to the microphone but again I don't have a pop filter for it yet. So I have to be careful. But when I moved closer to the capsule, I definitely got way better results. So let's do another test. I got my headphones here. I'm input monitoring now. I just gotta say something that doesn't have a lot of P's in it because pa pa pa pa, I don't really have a pop filter on this bad boy. I'd do the trick where I put my finger in front of my lips. But that sometimes will degrade the sound. You won't get as much fidelity if you will. Hello, ladies and gentlemen, welcome to Computer Clan radio, where we don't use pop filters, yeah. I know it's kind of unfortunate. So today on today's program, we have special guest Tony Shalhoub in the studio. Just kidding, we couldn't afford him and his agent laughed at us. Yeah this sounds really freaking good and this is with no post processing. And again I don't have a pop filter so forgive the pibbity pops. (laughing) Yeah no pop filter yet but oh man, the warmth of this. Oh it sounds so freakin' good. This Baby Bottle here, wow! I can't imagine what the $5,000 version sounds like. Ha ha, what do we talk about the weather? But yeah this sounds really good. Oh man, how close can I get to this thing? Okay so right about here, yeah. But we're really gonna pop pop pop. Pibbity pibbity pop pop pop pop pop. Yeah I'm trying to not pibbity pop so much without a pop filter. Oh I just want to listen to my voice. We could do some cool radio stuff with this. Welcome to Computer Clan live radio. This is a kick ass microphone. I've only been using it for a few minutes but so far I really recommend it so if you're looking for a good analog microphone solution to do pristine, warm sound and you want to treat sound very seriously, man this Blue Baby Bottle, this sounds like the way to go. All right we're on to our next guest now. Tony Shalhoub, oh wait I already did that one. Oh bummer. So there's our little plasma ring there. It glows when a signal's being picked up so, (snapping) you know, that's really cool. I wonder if it turns red if it overloads? Check check check check check. Oh yeah, it does turn orange and then, check check check, then red. Ha, that's so cool. Oh dude, that's so cool. All right, cool cool cool, baby. All right, overall I just think it's awesome how we have a Blue microphone plugged into a red Scarlett. I mean we have Blue and Scarlett. Everything is just colors nowadays. And I'm using a Blackmagic camera. What is that? I got a Scarlett, a Blue, and a Blackmagic. Everything is colors ladies and gentlemen. But I cannot wait to do more projects with this mic, especially since I was thinking of maybe picking up some audiobook stuff. Doing some recordings for audiobooks and this would be a great way to do that. So even though I can't recommend that Blue Baby Botle and the Focusrite Scarlett enough, I know that not everyone is going to be in the market for that type of setup. So, I want to be able to help. I am going to sell this microphone. And it will include a signed certificate of authenticity. This microphone was used in some of our most popular videos, with over millions of views. And it's being used on Krazy Ken. This is the real deal that was used in the Computer Clan for many years. And over a million people have heard my voice through this freakin' microphone on all those videos. So, the certificate of authenticity from myself Krazy T Ken and of course the microphone itself with the pop filter and the stand. I'll include all for a single price for you. So just hit me up on Twitter on the Computer Clan. Just say hey I'm interested in buying the microphone and I'll give you more detail. I'm calling this a win. Piece of cake to set up. Check out the Blue Baby Bottle and the Scarlett if you want a great, warm, powerful, serious audio solution that won't break the bank. I super recommend this. And thank you very much to Podcast Stage for helping me make my decision on these products as well. Thanks for sticking with me. Catch the crazy and pass it on.",
    "transcript_keywords": [
        "Baby Bottle",
        "Blue Baby Bottle",
        "Check check check",
        "USB",
        "pop pop pop",
        "microphone",
        "yeah",
        "Baby",
        "check",
        "sound",
        "cool",
        "Blue Baby",
        "pop",
        "Bottle",
        "Check check",
        "pop filter",
        "sounds",
        "pop pop",
        "Blue",
        "computer"
    ],
    "transcript_entity_values": [
        "one two",
        "USB",
        "Apollo",
        "Ken",
        "Blackmagic",
        "over millions",
        "Audition",
        "a few minutes",
        "YouTubers",
        "Baby Bottle",
        "Kensington",
        "32",
        "the old days",
        "Focusrite Scarlett",
        "Thunderbolt 2",
        "Thunderbolt",
        "a minus 20",
        "Adobe Audition",
        "Alley-oop",
        "pa pa pa pa",
        "Kershaw",
        "Tony Shalhoub",
        "Bottle",
        "Chainor",
        "two",
        "MacGyver",
        "over a million",
        "the 60 seconds",
        "5/8",
        "Focusrite",
        "Kershaw",
        "the Computer Clan",
        "Desiccant",
        "Krazy T Ken",
        "SL",
        "Scarlett",
        "Japanese",
        "MacGyvery",
        "today",
        "48 volt",
        "Baby",
        "Krazy Ken",
        "trillions",
        "66",
        "this day",
        "seraph",
        "first",
        "one",
        "four",
        "Scarlett 2i2",
        "Behringer",
        "Sennheiser",
        "swinger",
        "Louise",
        "Behringer",
        "One",
        "XLR",
        "One second",
        "Perfecto",
        "Neumann",
        "HDMI",
        "Computer Clan",
        "Blue",
        "5,000",
        "second",
        "Twitter",
        "USB Type B.",
        "about five thousand dollars",
        "phantom power",
        "sec",
        "England",
        "three",
        "Over a million",
        "1/4 inch"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "NORP",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ]
}