{
    "id": "6sAu7CDwLiU",
    "title": "An Unconventional Upgrade - Intel $5,000 Extreme Tech Upgrade",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-27T18:28:12Z",
    "video_url": "https://www.youtube.com/watch?v=6sAu7CDwLiU",
    "category": "Science & Technology",
    "tags": [
        "Intel",
        "PlayStation",
        "Xbox",
        "Streaming",
        "PC Build",
        "PlayStation Setup",
        "Linus Sebastian",
        "Intel ETU",
        "Intel Extreme Tech Upgrade"
    ],
    "views": 3558333,
    "likes": 110044,
    "comments_count": 3740,
    "description": "Thanks to Intel for continuing to sponsor this awesome series! Buy an Intel Core i7-12700K:   Discuss on the forum:   Buy dbrand Darkplates:   Buy an ASUS Prime Z690-P D4:   Buy a Steelcase Night Owl Gesture:   Buy a Corsair MP600 PRO LPX 1TB SSD:   Buy an EVGA XC3 RTX 3080:   Buy an Xbox Series X:   Buy a Sony PS5 Disk Edition:   Buy a TotalMounts PS5 Wall Stand:   Buy a Sony X85J 55\":   Buy a Mounting Dream MD2379 55\" Wall Mount:   Buy a Vitamix Ascent 2300:   Buy Poly-fil Stuffing:   Purchases made through some store links may provide some compensation to Linus Media Group.    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Special Intro by MBarek Abdelwassaa   Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:50 - Parts List 2:26 - Linus Cleaning Tips 3:59 - Building not one, but TWO PCs 10:47 - How many TVs do you need?! 14:43 - Linus gets maimed 15:46 - Back to building 17:50 - Linus Console Tips 19:12 - How long does it take to build two PCs? 22:50 - Building a PlayStation 24:10 - All that money and he didn't get a couch 25:10 - Testing the setups 26:51 - Conclusion",
    "description_links": [
        "https://geni.us/RPyj54U",
        "https://linustechtips.com/topic/1439783-an-unconventional-upgrade-intel-5000-extreme-tech-upgrade/",
        "https://lmg.gg/6PN8H",
        "https://geni.us/8AmNIja",
        "https://lmg.gg/OMP30",
        "https://geni.us/coOQ",
        "https://geni.us/ejhr",
        "https://geni.us/Ud5jX",
        "https://geni.us/4iIkXx",
        "https://geni.us/Ubtnzl",
        "https://geni.us/piGL",
        "https://geni.us/FAfz0y6",
        "https://geni.us/FHZE",
        "https://lmg.gg/edQfU",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.instagram.com/mbarek_abdel/",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- The theme for today's Intel $5,000 Extreme Tech Upgrade is simple. Nothing is going to go wrong. - Okay. - Nothing will go wrong! - I'll do my best! - And if anything goes wrong, thank God we have this giant Snorlax (Nolan laughs) that we can collapse onto, so that we can recover. This is Nolan. He's one of our customer care coordinators. What the hell is your job title? - Customer Support Rep. - Fantastic. - And Nick's assistant, technically. - For Creator Warehouse, and he is going to be getting not one, but two computers, a brand new TV. Thanks Intel for sponsoring Extreme Tech Upgrade. Let's get this started. (upbeat music) I don't know where to start with this, because normally you do such a great job that I actually end up talking to you almost not at all. Especially with all the work from home through COVID, right? - True. Yes. - But we have to have a bit of a chat right now about your performance here. Because your PC performance is looking pretty good, but I see a lot of consoles. (Nolan Laughs) Okay? One of the consoles, at least, to your credit, you're upfront about. Okay. You got an Xbox Series X, but you tried to hide this one from me. What is this Nolan? - That's a PlayStation- - A PlayStation you say? - The box has been spray painted black. - And why pray tell was the box spray painted black? - Because dbrand sent it. - To deceive me? - Yeah. To deceive you. Yeah. Yeah. - What are we doing first? Have you ever built a computer? - I have. - You have? - Yeah. - Well then, why don't we roll reversal? - We're building two computers. - And I'll build the consoles. Wait, what two computers? I don't see two computers here. - Well, we're building one computer and... - But this is a Vitamix. This isn't a computer. (Nolan laughs) Okay. Can I just say? - Yeah. - This has got to be, hands down, the, A, most creative, and B, best use, - Right? - of Intel Extreme Tech Upgrade budget that I've ever seen. Sarah's all like, \"Oh, I don't know. Maybe I'll spend it all on a Starbucks gift card.\" (Nolan Laughs) Nolan here goes big brain. This is gonna save you so much money. Are you into shakes? - I am. - You into, like, soup? - Ahh. - You know you can heat your soup with it. Right? - I know. I know. So out here in the pile there's most of one computer. - Oh my. - But I have a pretty comparable system in my room that some of the parts are going. So this case is not the case. - All right, let's go get it. Let's go get it. - Yeah, yeah, yeah. - Other than nailing people for stolen goods, like this mousepad, the first thing I like to do when I come into people's rooms is figure out if they're actually a tidy person or if they tidied up 'cause they knew I was coming. And with Nolan, you know what? I gotta give you props. You almost fooled me. - (laughs) Oh, damn it. - The carpet's vacuumed. - Yeah. - Right? Your screens are clean. But I'll show you what gave you away. You didn't dust your Stream Deck. - [Nolan] No I didn't. - [Linus] Which means that however much dust was on your Stream Deck was on everything else. - That's true. - And number two, when you vacuumed, you didn't take off the power head. - To get the- - [Linus] And hit the top of your baseboard. - [Nolan] I did not. - Kids, can you say (beep) got him. (Nolan laughs) - Thankfully though, this is the only thing you noticed was stolen. 'Cause that monitor and that GPU are also from the office. (Linus Laughs) - I was too busy appreciating your taste in graphic novels. - [Nolan] Oh yeah? - You stream? - I do. I took a long break but I'm back to it now. - [Linus] How are we building this? This is already built. - The GPU, motherboard and CPU are getting swapped out for the new ones. - Okay. - And then the stuff that's in here is going into the case that's out there. - I was told today's was going to be simple. (Nolan Laughs) - It should still be simple! - Okay, boy! - There we are. - Okay. Let's go. By the way, Jamie's helping us today. - [Jamie] Hello! - You can take that back. - I can take that back. - That's for the PlayStation. - Oh, oh, sick! We're upgrading your PlayStation SSD? - [Nolan] Yeah. - Love it. Okay. Well, you go over there. - I'm basically gonna end up with a PC on my desk that stays there all the time and one that I might use out here and I might use other places for streaming. - So you're gonna be full God-tier with the PC, the Xbox, the PlayStation and the Switch? - No, the PlayStation's going in my room. - Which one's the a-tier machine. - This will be the main PC still. - This is the main PC? - But the stuff that's in there, for the most part, is coming out. - Okay. So you're keeping your old RAM. - The old RAM's going on the other one. I've got two sticks. - I mean this is like the Vengeance fricking RGB Pro. - Yeah. - Please tell me you have a DDR4 board. - We'll blame Matt if I don't 'cause he ordered that. - DDR4. - Thank God. (Nolan giggles) - [Linus] Nice. The bananas for scale. - The bananas for scale. - Ittstore.com - Those are sold out right now. - What do you mean they're sold out? So they're sold out and you're hoarding them here. - I've had these for a long time. - Do you work in customer care or do you really care about the customers? If you're hoarding all the yellow bananas for yourself. - Three people are going without bananas. - Three starving children could have eaten those, those plush bananas. - They would've had a bad time digesting those. - I'm surprised you didn't go with more of like a media center type case since it's gonna be... - This was a last minute addition. This is actually, I got this off a friend. - Oh. Really? - This one wasn't an initial part of the budget. Yeah. This is the only thing I had to, everything else is spare parts. Oh, speaking of which, I should go grab that. I have a spare PSU and stuff. - I mean, fricking priorities. Look at this place. Okay, we got this Ikea-ass console thing here. Got some Ikea-ass couch and... - [Nolan] Oh. - And this thing. - [Nolan] Dude. - And then it's just like PCs, monitors, TVs, game consoles, sub woofer. Do you even lift bro? - [Nolan] Did you look at the legs on the coach? - Uh, no. Wait, what? - [Nolan] Yeah. - What happened? - [Nolan] I was not prioritizing furniture when I went to... Here, here, here. - [Linus] Oh, my God. - [Nolan] That's where it's supposed to be. - [Linus] Yeah, I see. - [Nolan] That's where it is on both sides. That'll be replaced at some point, when it breaks. - I mean, when you have got all of your tech absolutely God-tier. - I cut corners somewhere. - You know what? I gotta respect it. - This is a \"what you can't see\" moment. (Nolan chuckles) - [Linus] You know what? - [Nolan] How bad is it right now? - Actually, that's pretty bad. And then you've gone 12700K. Okay. Well, that's good. That'll save us some power budget versus if you'd gone for the 12900K. You have three AIO liquid coolers, a Corsair Dual 120, an EK Dual 120 and an EK triple 120 - Yes. Okay. The original plan was for this cooler to stay in this case, but it doesn't have the mount for the CPU, for the 12th gen. So we're using this temporarily, while I email Corsair to get standoffs or whatever the retrofit kit is. - Right. - And then this guy I'm keeping. So that one's just gonna go in that case. - Yep. - Sweet. - Oh wait, I still need your Mdot. Oh, you got a couple Mdot. - I've got a few. - What the-? - The there's one in there that I don't use. It's like an old one that I grabbed from somebody and threw on there. - [Linus] That moment when your CSR has a better computer than you do. (Nolan Laughs) I'm serious. - I have a lot a storage. - You have a problem. - Yes. What's my problem? (Nolan Laughs) - You have too much Mdot2. - I just like 'em! - You just, you need to relax. - It's not a problem. I can stop whenever I want. - Okay. Which ones go where? So you've got a five. You've got two, 500 gig WD blacks. - So these three in there. This one's the only one going in that one. - And that's gets a five, 500. - And this one's for the PlayStation. - That's for the PlayStation. You know that the best one is going in your PlayStation? - Yeah. - Fine. Okay. And it's well packaged. - Yeah. Yeah. - He's not stressed. - No. I've watched you drop much worse. - Now you have no excuses. - Yes. Here's your drive. - I can do some work now. - Got some 16 gigs, 3,600 mega transfer per second memory. - Yes. - Okay? - Sweet. - Here's your screws. - Oh, nice. Here's my screw driver. - Oh. Okay. Nicole, you might have a challenger for coolest screwdriver. - Yeah. - Practicality. Kind of low. - Yeah. It's a little bulky. - But in terms of just raw, manly, sex appeal? (Nolan Laughs) That, that's a screwdriver. All it needs now is like a belt loop here. - Yeah. - Yeah. It's amazing, you know, Moore's Law marches ever onward. Check this out. These are both WD black 500 gig drives. So this is an older SN 750. This is the new SN 770. We've gone from a 500 gig SSD needing two NAND packages, a giant controller chip and onboard DRAM. Not to mention like, look at just the complexity of this board by comparison to this one. Controller, NAND package, and for DRAM, it just pulls it over the PCIE bus from your system memory. Just man, this setup, is crazy. You already had the kind of setup that most people... - Yeah. - ...have been upgrading to. I mean, do you feel a little guilty? - No. - Going in front of other people who have much worse setups than you. (Nolan laughs) - Oh man. It was worse when I ordered the parts. - [Linus] Okay. That's fair. - I had a 2070 super in there and. - Oh, it was that long ago. - Yeah. - And then you, and then the Christmas party, - Christmas party happened. Like I would've just said, \"I don't need this.\" Cause I got a GPU at the Christmas party, but it was already on the way. - So now, because of this man, three people don't have bananas (Nolan Laughs) and one person doesn't have an RTX 3080. - Yeah. I got an RTX 3080 I didn't need. - You're basically a monster. Actually, Nolan, crazy pitch for you. - [Nolan] Yep. - Okay. Come over here. I couldn't help noticing that your computer is right on the other side of this wall. - Yeah. - So, hear me out. You sell your second machine. - Yeah. - You put a little, like, a little wall plate thing in the wall that goes between the two rooms. - Drill a hole. - I'd put a little pass through there. Boom. - Hook it up to the TV. - Computer up to the TV. One computer. - That could be a project. - Ooh. I need to put the CPU in. Where the heck the CPU go? - [Nolan] Oh yeah. - Oh, here it is. Think it fell. - Of course it did. - Oh. I guess we should talk about the 12700 K. This is basically the one to get. If you've got the budget for it. You go 12400 if you don't care about overclocking and you don't need the most multi-threaded performance, but the 12700 K is without going, you know, all the way to the halo tier product, pretty much all the performance you need. How you doing over there, Jamie? - [Jamie] I'm good. - [Linus] Nice. - You want me to Mount the TV? - No, I think we'll come. We'll come struggle with it with you, I think. - [Jamie] Okay. - What, how big of an upgrade is? Oh, actually I can tell from the thickness that TV's a little bit on the older side. - Oh, the TV's not getting replaced. - The TV's not, wait what? Oh. What? - This is going in my room. - Oh! Wait. So you need two computers. One. So you can game on your monitors. - Yeah. - One so you can game on your TV. - Yeah. - But you're gonna have a TV. - In my room with the PlayStation. - With the, in the room with the, with the, so this is your dedicated PlayStation TV. - Yes. - You're not gonna freakin' share the good TV? - [Nolan] Hey. (laughs) - This guy. Okay? He's got all the bananas. - Yeah. - He's got all the RTX3s. - Those bananas are my roommate's. - He keeps all the good TVs completely for himself. - Yeah. - At least he feels shame. (Nolan laughs) You can tell from how red he is. At least he feels some shame, but not enough to change his ways. - No. No. - Is anyone else gonna be allowed to sit on the Snorlax? - Oh, people already have. Yeah, yeah, yeah. - And you consider that generous? - Yes. - Like that somehow makes it okay? - Yeah. I mean that thing's like $500. I'm not like, I gotta pick who can go on it, you know? - Customer care? More like customer don't give a (beep). - (laughs) Customer care about myself. - [Linus] Yeah, exactly. (Nolan laughs) - These two machines are gonna be so sick. And then soon on Facebook marketplace, you're gonna be able to trade a long HDMI cable for Nolan's second computer. - Yeah. - It's gonna be great. - Probably not. Although, speaking of Facebook marketplace, if anybody wants a transparent TV. - [Linus] Oh my God. Are you the one who won that stupid thing? - [Nolan] I put one freaking ticket in Linus. One ticket. - Where are you even keeping it? - It's at my parents' house taking up space. They're like, \"When are you getting rid of this thing?\" - [Linus] We tried so hard to sell that stupid transparent TV. (Nolan laughs) Jamie, how long did we have it listed for? - Like eight months maybe? - [Linus] Ugh. - We, we had one guy message and it was just like, \"Oh, is this the one that was on the Linus Tech Tips Video?\" And, and we were like, \"Yeah.\" And it's like, \"That's cool.\" And that was the end of it. (all laugh) - What was the lowest price we ended up offering for it? - It was like 600 bucks, or something like that. - [Nolan] Geez. - How much did I pay for it? Seven grand. And then think it was another few grand in shipping to get it here. Nolan, You don't even want it, do you? - (laughs) I got, no. - Okay. Hear me out. - It was a fun novelty. - Hear me out. Come on over here. I got a pitch. - Okay. Another pitch. - You got your computer on the other side of the wall? - (laughs) Yeah. - All right. You got your TV embedded in the wall. - Yeah. Okay. - You press a button. Boom. (Nolan laughs) Your computer has a little app that flips around the image. TV on both sides! - On either side. - Embedded in the wall. - That would be very cool, but very impractical. - Yeah. Also there's a giant puck in the bottom of the TV that contains all the electronics. That would be just like... - Sitting somewhere. - Sticking out of the wall on either side. I'm sure your strata council would... - Yeah, they would love that one I'm sure. - How much, how freaking much did you spend on RGB fans for this build? And then you had a 2070 super. To be clear, it's a respectable GPU, but good gravy man. - It was all. Yeah. (chuckles) I... - It's not how I would've allocated my budget. I'll tell you that much. - (laughs) And I don't even like RGB. - I feel like a lot of people end up coming away from these extreme tech upgrades as like new fan favorites. - Yeah. - That ain't gonna be you dude. (Nolan laughs) Ah, okay. Jamie, let's see. You seem to be, you seem to be wanting something to do. - [Jamie] Yeah. - What is there to do still? - I'm gonna put the plate on the wall for the TV and that's it. Well, he made it easy. He already drilled all the holes so. - [Linus] Wanna show the people how to put a plate on a wall? - [Jamie] Sure. - All right. Jamie is now officially an LTT host. (Nolan laughs) - [Jamie] Whoa, okay. - [Linus] Good luck Jamie. - [Jamie] Thanks. - [Linus] We might end up cutting it if you suck. - Oh man. - Damn it. I was taking out this cooler standoff and this heat sink sliced me open. Damn, I'm gonna need a band-aid. That's really bleeding. - [Nolan] There's blood on the.. - Yeah. Yeah. Sorry about that. - [Nolan] I think I got a- - [Linus] I don't wanna fill out the paperwork! - [Brandon] Yeah, this is actually like, like a thing you have to do. - No, I'm like bleeding. I actually have to do it. [Brandon] Where's the safety committee? - [Jamie] You want me to just call Yvonne? (Nolan laughs) - Let the record show, safety committee, that I am washing my hands. (Nolan laughs) Well, I'm trying. Wow. Way to go. - [Roommate] Hey, I'm just filling up. - [Nolan] Yeah filling up a good water bottle. - Thanks for that. (Nolan laughs) Oh, there's a skin flap. Ow. Damn it. I peeled it up. Man, now that I peeled it up, it's bleeding more. Aw this sucks. - [Brandon] Linus put the bandaid on quick. - Well, I can't cause my hands are wet now! Whoever thought- - [Nolan] It's a waterproof bandaid! - It's a? Oh, is it? Guys waterproof just means that once you've applied it, it's waterproof. (Nolan laughs) - That might be all we have for bandaids. - Oh my God. - So...(giggling) GPU doesn't fit with the fans in, so. - [Linus] Wait, what? - No. (laughs) - Your GPU doesn't fit in your new case? - It fits, but I'll have to move this fan. There's no clearance. - [Linus] Oh shoot. It really isn't gonna fit. - [Nolan] It really isn't gonna fit. - [Linus] I wonder if we could just? (computer part clicks) I bet we could get it in there. - I think we could get it in there if we can, yeah. - I mean it'll flex a little, 'cause you want that fan right there blowing the fresh air. - Yeah. I wanted air in there. - So well now the question is can you get it out? (Nolan groans) Hold on. Let me give it a little. Go ahead. - It's this at the end. - Jaws of life, here. - There we go. - Move GPU! How old are you, Nolan? - I'm 21. I'll be 22 in a month. - So you do not know what a Limp Bizkit is then? - No. - Yeah. - Well. - [Jamie] That's a shame. - No I do, but I don't. - Yeah. - [Jamie] That's fine, you don't know the joy of going out and buying a Limp Bizkit CD ? - No I don't. - Or any CD? - [Jamie] Watching them at Woodstock 99? - No, I wasn't even born. - Oh God. - [Jamie] What year would you be born in then? - 2000. - [Linus] Wow. - Yeah. - That's okay. Cause at least my generation's housing was much more affordable. - [Jamie] (laughs) Oh geez. - But who needs a house when you can live in Mark Zuckerberg's metaverse? I mean you got all the gear. all you need is a quest now. - Yeah. And I have no VR and no desire to be in the metaverse. - Almost cut me again. These heat sinks, Jesus, are extremely sharp. I kind of wish the GPU was white. (scoffs) Not gonna lie. - Yeah. Cause the, yeah. - You could pop this back plate, spray it white. - Yeah. Put it back on. - And then I think you're good to go. - [Nolan] Yeah. - [Linus] Then you. - [Nolan] I've actually got a friend that does that, so I might. - Not gonna lie, dude, (Nolan laughs) I... - [Nolan] The rat's nest? - do not see a better way to deal with this. - Than how I've already dealt with it? Yeah. - Oh my God. There's like extra sata power cables hanging around back here that we could purge. There's.... - [Nolan] It's a mess. - [Jamie] Tada. We're on the mount. - [Nolan] Wow. That is. - [Jamie] Pretty simple. - [Nolan] Shockingly easy. - I'll grab my little screwdriver and we'll just put the locking piece in. - Oh, okay. - [Jamie] You wanna mount that? - Yeah. Let's mount the PlayStation on. I'll bring it in here. I think I'm gonna put it over here somewhere. - [Brandon] Are you concerned about it clashing with your left hand shelves there? (Nolan clicks tongue) - [Linus] I hear a debate. - Yeah. - [Linus] Hold on. - Of where to put this PlayStation. - Debate. PlayStation? How about in the garbage? (Nolan laughs) Boom! Are you a disc boy? - I am a disc boy. - You're a disc boy. - I am a disc boy. - Well then, in my humble opinion... - Yep. - It's gonna have to be on the left, so you don't have to physically leave the bed to change the disc. Yeah. - The only thing is the shelves are there, but I, yeah. - But the, the PlayStation. - [Nolan] If we line it up, if we line it up. - The PlayStation is a work of art. - [Nolan] That's true. - It's a popped collar work of art. - [Nolan] It deserves to be there with the Lego and the picture of my mother. - [Jamie] So you wanted the bottom of the plate at 14 inches or so? - Like I'm just thinking about how fricking tall this PlayStation is. - [Jamie] This is the last install of the day. How about I put it there, and you like it? (all laugh) - You know what? Works for me! (drill cranks) So I think it just sits on there, like that. - [Linus] Wonderful. - And then yeah, yeah, yeah. It screws in up through the bottom, but I still have to put an SSD in this thing, so that looks fine for me. - Meanwhile, the progress I've made has been purely aesthetic, but actually pretty good, in my humble opinion. - [Nolan] That is a lot better than what it was. - That's still gonna involve some stuff just being kind of jammed behind the power supply over here. I'm gonna put the commander pro up there. - [Nolan] Okay, I'm totally fine with a little jank. - Yeah. - Oh! Well there's some lights. - [Linus] Don't see. - [Nolan] I'm not seeing fan lights. I'm not seeing random. - [Linus] Fan lights. Ah, good enough. Let's eat! (Nolan laughs) (Vitamix whirs) Your old OS just picked right up, which is kind of nice. Do you wanna go ahead and log in and then we can see if the Corsair software also figures out its shiz. Blue, purple, white. - [Nolan] What the? - Then red, yellow. - [Nolan] My monitor is going nutty. Oh, okay. Oh, it was just, I think it was just realizing that there's other monitors here. - Hey! - Look at that. Nice. - All right. Oh, look at all of these things. - Okay. Yeah. No one cares. Six fans are connected. So red, yellow, green, blue. - Yeah! Got 'em all. - So they're still not spinning though. - The white one's not spinning, which is, weird. - The iCue is not responding at all. I love iCue. - You truly have made very little progress here. - We took lunch. I had a problem with the rad. - Cause lunch is not progress. Is this what they pay you for at Creative Warehouse? - If you wanna help with wiring, that would be great. Cause as you saw from my last one, (laughs) not my strong suit. - Yeah. No it's not. What is your strong suit, Nolan? - (laughs) Wow, that was harsh. That was harsh! - I'm kidding! - I've invited you into my home, Linus! - I can't help it. I just love, like, sick burns as humor. Does that make me a bully? (Brandon laughs) Don't answer that. - [Brandon] You don't want us to answer! - Part of my problem, I think, with my public image is that I tend to enjoy playing that character so much that whenever I do play that character on camera, I just get way too into it. I just love the sick burns too much. Wait, you have another fan and you can fit another fan. - Yeah. - That is great. - It's a win win. So I gotta move, no I don't even think- - See, this is my new positive. - [Nolan] I like it. - This is my new positive persona. Nolan, I'm so happy for you. This is great. I just, I can't keep this up. - [Brandon] Could you tell how genuine that was? - Yeah It felt, it felt way too fake. - And I think we're just gonna put this GPU in here. - [Nolan] All right. - [Linus] Like is everything else installed in? It seems pretty installed... - [Nolan] This fan? Ah, minor details. - Yeah, yeah, yeah, okay. - Minor details. - Well, let's see if you can (laughs) - Let's see if it'll go. You gonna go boy. - [Nolan] Oh my. That sounds so great. - Oh yeah. I'm not. - Oh, it's not going. - Hold on. - I gotta push it towards. There we go. There we go. - Good job. - Thank you. I'm halfway there. - See, look how positive I'm being right now. - It's a big process. Big process. - I'm a positive person. - Does feel a little condescending, but (laughs) - I can't win! (Nolan laughs) - That is a tight fit. - And I gotta tell you that this is not good. - Yeah. - For case airflow, like having the bottom completely cut off from the top. Yeah. Like I don't know where this heat's gonna go. You know what I'm saying? I guess we'll see. - [Nolan] We'll figure it out. - Yeah. There's only one way to know for sure. I'll tell you what, why don't you leave this to me to finish up. - Okay. - And why don't you go build a PlayStation? - I will go build a PlayStation. I'm totally down to do that. Yeah. - Have a seat. - [Nolan] Oh, there you go. Is it the wrong side? - Yeah It's the wrong side. (Nolan laughs) - Where do you want this boy? - Uh, yeah, you can just leave it, put it right there on the ground there. - Had you given any thought to control for it? Keyboard? - I have a wireless mouse, but I'm gonna need to get a wireless keyboard for it. - [Linus] Okay. - [Nolan] I have a spare keyboard to use in the meantime though, I'll go grab it. This thing is dusty. Here you go. That was under my bed. (laughs) - The wind is coming your way. It's coming right in. It's coming right in there. If I blow it, I think we gotta close the door. (Linus blowing air) That's awful. - [Brandon] Oh, it's flying towards me. - Sorry Brandon. - [Brandon] Oh God! - I got it. I'll protect you! Okay. Perfect. Why don't you guys go put the PlayStation on the wall. I'll get Windows installed. - Sweet. - [Linus] Now everybody's working. - [Nolan] Okay. I've got it in the, in the hole. I don't know if it's exactly lined up, though. - [Jamie] What is going on here? - [Nolan] I think it needs to like turn. There we go. I got it. - [Jamie] Oh. - [Nolan] There we go. It wasn't actually sitting down on that side. - [Jamie] We do it right, 'cause we do it twice. - [Nolan] Yeah. - Yep. There you go. - Oh, two person, two person peel. Andy would've just left it on. - [Jamie] That's true. - [Nolan] Andy's a monster. - Nolan, I'm not saying you're a heavy boy, (Nolan laughs) but when you sat down on this... - Dude, this couch is, it's brutal. - I can feel it going. - Like that. - [Brandon] Oh, It's going. Oh guys, it's like... - Is it actually going? - I think it's going. - [Brandon] It was moving. - Please. Oh, do you know why? It's cause we don't have the stuff under it. Cause you moved it off from the wall. - This is what keeps the couch from collapsing? - (laughs) Yeah. They tore down a sushi restaurant and we took their signs. - Okay. So I should put this back under? - Back against the yeah. Or do that, too. - Okay. Xbox. - [Nolan] Xbox. - This one's gonna be easy. - [Nolan] This is the easiest thing. - One, two, three. Installed. - Pretty much. - [Linus] It wasn't actually part of the upgrade. Like you won at the Christmas party. So you've been... - [Nolan] It was on my list. - You've been using it for like six months. Right? - So yeah, it was on my list and then me and Matt were like the two people who put the most tickets in for it. - Yeah. - Because they weren't able to get one, at the time at least. - The TV in your room looks a lot better. - [Nolan] It's a lot better. - It is amazing how much gaming can be done from within just - I know. Oh! - Like nine square feet. - I should get a chair in here, too. - A chair? - Yeah. I got a chair. - Is this a Steelcase? - It is. Steelcase Gesture. - Oh very nice. - Yeah. - Whoa. I haven't actually tried the Gesture. - [Nolan] So much movement. It's great. - Is this a 65 inch? - 55. - 55. It feels really big. - When you're sitting this close. - When you're like, yeah. When you're like hanging out on the bed right here. You're like, oh yeah. Oh not bad man. So Jamie. - Yes, sir. - Can you please take the whole thing off the wall? You want me to do it all over? - Just adjust a little bit. Yeah. Do it all over again. - I'll see you guys tomorrow. (all laugh) - To play this game, insert the disc. - [Jamie] Oh. - He put the disc in. That's why it's up on the thing here. - There's only one way to find out for sure. - Did he put it in upside down? He did. It's unreadable. - [Jamie] Did I? - Oh, that's hilarious. - What? Wait no that's actually the right way. - That should be the right. It doesn't go in this way. - Does it go in this way? It might. - I've never put a disc in a PlayStation 5. - So now if I click it, yep, there we go. - Wow. - Is it just gonna play? - We just. - I think it's just gonna play. - We just revealed our PlayStation V newness. - (laughs) Knowledge. - Hardcore. - Wow. There we go. - I don't think you're gonna end up running an HDMI cable from your computer to the living room. I think you're gonna end up running an HDMI cable from your Xbox to this TV. - [Nolan] Yeah. This TV is nice. - [Linus] Cause this is so much better than the one out there. - [Nolan] It's actually crazy. - Man. This setup is amazing. 12 gen. RTX 38. - Yep. PS 5. Got the big TV. I think you should put the Xbox in here. I think you should, I think you should flank the TV. - Mount it there? - Yeah. Flank it with the Xbox and just everyone else can hang out in pleb land. - Yeah. - Out in the living room. Well, whether it's streaming, gaming on PC, gaming on Xbox, PlayStation 5, Switch; Nolan's got it covered. This has definitely been one of our most all encompassing Intel extreme tech upgrades. Guys, I hope you enjoyed meeting Nolan. Actually, some of you have probably met him already. - Yep. - Through customer support messages. Thanks to Intel for sponsoring Extreme Tech Upgrade. We will see you at the next one. If you're looking for another video to watch, the most recent one is Brandon's and that's probably worth a watch. As long as you have a strong forehead, because you're gonna have a lot of this. (hand smacking) Oh.",
    "transcript_keywords": [
        "Yeah",
        "put",
        "PlayStation",
        "Nolan",
        "thing",
        "Extreme Tech Upgrade",
        "Extreme Tech",
        "GPU",
        "computer",
        "good",
        "God",
        "Intel Extreme Tech",
        "wall",
        "Tech",
        "Xbox",
        "Tech Upgrade",
        "people",
        "Jamie",
        "Intel",
        "side"
    ],
    "transcript_entity_values": [
        "RGB Pro",
        "one",
        "500",
        "Mdot2",
        "Brandon",
        "One",
        "RGB",
        "Intel Extreme Tech Upgrade",
        "Corsair",
        "12400",
        "Steelcase",
        "GPU",
        "Moore",
        "Seven",
        "Andy",
        "WD",
        "120",
        "PlayStation TV",
        "like six months",
        "Three",
        "Linus] Nice",
        "Xbox",
        "65 inch",
        "LTT",
        "Nolan",
        "three",
        "Facebook",
        "Extreme Tech Upgrade",
        "Linus",
        "the day",
        "NAND",
        "Nolan] Andy's",
        "Mount the TV",
        "AIO",
        "only one",
        "Woodstock",
        "3080",
        "first",
        "Christmas",
        "Nick",
        "Nolan Laughs",
        "SN",
        "EK Dual 120",
        "Lego",
        "Mdot",
        "Six",
        "CPU",
        "Jesus",
        "22",
        "Intel",
        "tomorrow",
        "Starbucks",
        "Vitamix",
        "12700 K.",
        "Windows",
        "CSR",
        "12th",
        "21",
        "600 bucks",
        "Stream Deck",
        "five",
        "Sarah",
        "Nicole",
        "Stream Deck",
        "Xbox",
        "Jamie] Tada",
        "nine square feet",
        "Nolan",
        "Switch",
        "Steelcase Gesture",
        "12",
        "Jamie",
        "HDMI",
        "Linus Laughs",
        "38",
        "two",
        "2070",
        "PlayStation SSD",
        "EK",
        "the Linus Tech Tips Video",
        "Mark Zuckerberg's",
        "second",
        "Nolan] Xbox",
        "PlayStation 5",
        "55",
        "PCIE",
        "14 inches",
        "Creative Warehouse",
        "Ittstore.com",
        "Corsair Dual 120",
        "Yvonne",
        "today",
        "Matt",
        "3,600",
        "iCue",
        "Brandon] Linus",
        "RAM",
        "Linus] Wait",
        "PSU",
        "Ikea",
        "500",
        "PlayStation",
        "eight months"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "LOC",
        "FAC",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE"
    ]
}