{
    "id": "6TAmdKTtlw4",
    "title": "They Call Them SleepPhones...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-20T16:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=6TAmdKTtlw4",
    "category": "Science & Technology",
    "tags": [
        "sleepphones",
        "sleep phones",
        "sleep",
        "phones",
        "headphones",
        "audio",
        "best",
        "best headphones",
        "unboxing",
        "review",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "gadget",
        "gadgets",
        "apple",
        "iphone",
        "android",
        "new",
        "smartphone",
        "samsung",
        "galaxy",
        "iphone 6s",
        "phone",
        "test",
        "6s",
        "iphone 6",
        "vs",
        "iphone 7",
        "s7",
        "plus",
        "galaxy s7",
        "edge",
        "iphone 6s plus",
        "apple inc. (publisher)",
        "s7 edge",
        "top",
        "apple iphone",
        "android (operating system)",
        "apple iphone 6s",
        "google",
        "smartphone (video game platform)",
        "video",
        "wireless",
        "2016",
        "crazy",
        "galaxy s7 edge",
        "bluetooth"
    ],
    "views": 2043559,
    "likes": 37484,
    "comments_count": 2013,
    "description": "Come with me to Iceland -   SleepPhones -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://www.facebook.com/unboxtherapy/posts/1219935431364370",
        "http://amzn.to/1ScXyNP",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys? Lew here back with another video and before we get into it... I wanna mention an opportunity. For two people, to come with me, to Iceland. For an incredible tech experience. You have no idea what you're in for. Click the link in the description. All the details are on my Facebook page. Join me... On a ride of a lifetime. (Cue Music) So... Sometimes... Things show up here and... The packaging is not magnificent... This was in, like, a plastic bag. But that did not affect my excitement! Now, I'm gonna tell you what this, this thing is in a moment here, But first I wanna do a little demonstration. Over here, We got some great ol' headphones. Great headphones! No problem here. Put 'em on. You're listening to music. Loving life. Then... It's getting late. You're on an airplane. You start to dose a little bit, y'know what I mean? Inevitably, lean up against something, you're trying to, you got a pillow- You're not comfortable! Gettin' stabbed right now! Nothing against these headphones. That's not what they're for. So I'm browsin' around Amazon and I'm like, \"What's the solution for this? Is it earbuds?\" Well here's the problem with earbuds: Even, uh, the slimmest of earbuds! You put 'em in, and you lay down, and now you're stabbing yourself in the ear canal! (LAUGHS) This-I-There's nothing worse than a sore ear canal! Sooo... I found these, they're called \"SleepPhones\". And the idea here is it's like a headband with very slim speaker units in it, that are designed to help you listen to whatever you like while you're sleeping, or while you're on an airplane, or while you're leaning up against something trying to get comfortable. In fact, the way they say it is \"Pajamas For Your Ears\". Well, let's give it a shot. (CLEARS THROAT) So, Oh, that's like - there's like a control area, probably some electronics there, and then the, the speaker units one here and one here. Guessing we do it like this? What do you guys think about that look? (SCOFFS) You're on an airplane! Who cares wha - what you look like? Relax. Gettin' a little warm right now. Similar to the video where I had the giant pillow on my head. Dunno who's idea that was. (POINTS AT CAMERA) I didn't take this part off, the little twister, there we go. This is the moment of truth, and like I said, expectations... Super low here. (MUSIC PLAYS THROUGH HEADBAND) Listen to me. They're not very loud. They're not gonna compete with your Earphones, headphones, earbuds... Somethin' I like about them. Of just being able - they don't move around, y'know? You're not having to re- make any adjustments as you move around. Y'know what I just, i just realized something, What if you go - Is this a double - look at THAT! Now I'm in the double zone. Check me out! I dunno how much they are. They're not that expensive, I remember. ($39.95) I'll put a link in the description. SleepPhones! \"Catch a nap or two. You look terrible.\" (new slogan) This is another example of something I love more now then when I got it.",
    "transcript_keywords": [
        "headphones",
        "earbuds",
        "airplane",
        "y'know",
        "ear canal",
        "Put",
        "idea",
        "Lew here back",
        "ear",
        "Gettin",
        "SleepPhones",
        "description",
        "Iceland",
        "great",
        "canal",
        "comfortable",
        "guys",
        "video",
        "link",
        "problem"
    ],
    "transcript_entity_values": [
        "Iceland",
        "two",
        "Amazon",
        "Pajamas For Your Ears",
        "Gettin",
        "Lew",
        "Catch a nap",
        "Facebook",
        "SleepPhones",
        "39.95"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "MONEY"
    ]
}