{
    "id": "6tpe_6ILN5k",
    "title": "Gigabyte Aero 15 Review - Better than the XPS 15?!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-05-02T22:05:08Z",
    "video_url": "https://www.youtube.com/watch?v=6tpe_6ILN5k",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Aero 15",
        "XPS 15",
        "Razer Blade",
        "Gigabyte",
        "GTX 1060",
        "1070",
        "1080",
        "Laptop",
        "Gaming Laptop",
        "Best gaming laptop",
        "best laptop for video editing",
        "professional",
        "video editing"
    ],
    "views": 814719,
    "likes": 14667,
    "comments_count": 1580,
    "description": "Dave2D review of the Aero 15 - the best laptop from Gigabyte for thin and light performance. Features a GTX 1060 like a Razer Blade but with a screen of a Dell XPS 15 9560 Aero 15 -   Note - The paneling is aluminum but the laptop frame is mostly plastic  Laptop GPU Benchmarks -    Music Credits: Intro:  Runaway Nights Background: Fili - Smooth Rides  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2xe6fcQ",
        "https://youtu.be/wEb0mWN5-gE",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey how's it going? Dave 2D here. And this is the Aero 15 from Gigabyte. This is their new all-purpose thin and powerful laptop. Now I get a lot of devices that come through this office, but once in a while I get something that just really exceeds my expectations. This is one of them. It has a plastic build, it feels very similar to the Aero 14 materials. It's a little bigger but the idea is the same. The top surface comes in various colors. If you want something a little less loud the black looks pretty good. The Gigabyte logo lights up. I'm not the biggest fan of light-up logos but that's just a personal preference thing. So, for a predominantly plastic laptop the build quality is good. It starts at $1,900 which is pretty expensive for a laptop and I know some of you are going to say that you can get a laptop with a 1060 for like a thousand or $1200. The thing is they aren't going to be this thin and they certainly aren't gonna have the features that this thing has. So, when you build something this thin and this light, you're going to have to pay a premium because the manufacturer has to get custom PCB, custom thermal solutions to cool something this thin and this powerful and keep it in a package this small. Ok, the port selection is above average for a device like this. You get Ethernet, HDMI 2, DP 1.3, an audio jack, 3 USB3s, a Thunderbolt 3 port and an SD reader. I did ask about the Thunderbolt 3 port just to see if it was by 2 or by 4 in terms of PCIe lanes and they said it was four lanes of PCIe so that's a good thing. It's pretty easy to open it up and when you're in there you have access to the two RAM slots. You can load up to 32 gigs of DDR4. But the best part and I really mean the best part is that there's two M.2 storage bays in here. Somehow over the course of time it became the standard to have just one stick of storage for these thin and light performance machines. This has two. I really like that. Now the included drive uses a slower SATA interface but it does support NVMe Drive so you could just use the included drive as like a storage drive or something. The battery down here is 94 watt hours. Battery life is pretty good. With the screen at 250 nits I'm getting around 7 hours of battery life. Playing games, I'm getting about an hour and the charger has that bonus USB port. The keyboard has individual RGB lighting which is always fun to play with and it can actually be really useful. I adjust the colors to match the shortcuts and apps and stuff. The layout is good, nicely spaced out, the keys themselves are a little stiff. It's hard to describe this, but it needs more pressure than I'm used to just to activate the stroke. But once you get used to it, it's a good keyboard overall. The trackpad uses Elan drivers and to be honest I'm not a fan of Elan drivers, but this feels noticeably better than the one on the Aero 14. It could be from updated drivers or potentially updated hardware. I'm not sure what it is but the tracking is improved. It's not perfect, but it's not bad. The screen is awesome. It's the headlining feature of the laptop it has a super thin bezel matte finish and the panel has great color gamut and accuracy. It's 1080p non-touchscreen. It has this X-Rite Pantone certification and out of the box the colors are just bang on. It could be a little brighter and I'm seeing some mild ghosting. The laptop is geared towards productivity and content creators so brighter is always good. There's supposed to be a 4k option down the line but this 1080p panel looks really good as it is. The webcam is down at the bottom because of the bezels so you get that upward nose angle. And this is what it looks like. I should probably shave this. Ok, let's talk performance. I was pretty sure this would have some kind of heat issues, because it's thin and light and you're stuffing a GTX 1060 in there. But it's cooled well and performance is strong. It has really extensive fan control through their software and I like that and - I don't know maybe it's just me - but I really liked the fact that you can control the fans. Like if you want to, you can run it on quiet mode, which is basically silent And, you'll throttle it if you're benchmarking or you can let it go on automatic mode Or you can manually crank up the fans to get maximum performance. Fan noise on automatic mode is actually quieter than I thought it would be under load. Performance is so good and the external temperatures are comfortable. There's no nasty hot spots. Gameplay is really nice on this thing. It's a Kaby Lake i7, GTX 1060 in an ultraportable, it's awesome. If you're playing at 1080p you'll comfortably break 100 frames per second in Overwatch on ultra. In Doom it floats in the low to mid 90s on ultra graphics as well. It's really weird seeing these kinds of frame rates on a laptop with five millimeter bezels. It's like luxury gaming. Something heavier like The Division, you'll need to drop the graphics to high in order to stay near that 60 frames per second. The hardware is great for games. If you want to see more details and benchmarks there's a link in the description. Now, with a color accurate display and two drive bays, the Aero 15 is clearly made for creative professionals as well. This thing is going to do really well with Photoshop and Illustrator workflows. In regards to video editing, this is one of my favorite laptops I've used for edits. This is only the 1080p panel, I'd want the 4k panel for my content but performance is great. With 4K footage the 1060 isn't a huge jump up in performance from the 1050 but it pulls further ahead with a 5K or higher resolution footage. The speakers are located underneath, like the Aero 14, and they sound really similar, if not the same Good clarity, good volume but not much bass. Alright, the Aero 15 starts at $1,900. You're getting a thin and light laptop that's housed in mostly plastic. Build quality is good for the materials. The screen has super-thin bezels with excellent color accuracy and viewing angles. The keyboard is pretty good. It has a nice layout, but the keystrokes can feel a little stiff. The trackpad feels reasonably accurate even with Elan drivers. On the inside it's running a Kaby Lake i7 and a GTX 1060 which deliver strong performance. Cooling is done well. It's loud if you're going full-tilt, but the temperatures are good. The RAM is upgradable and so are the two drives. Did I mention it has two drives? The 94Wh battery is big and it will last you a comfortable seven hours of battery life. So there's so much I like about this laptop: the performance, the screen, the battery life, the two drive bays. It's just an all-round fantastic machine with great performance, thin and light, ultraportable. Is it the best in this market? It's tough because the build quality isn't as good as its two main competitors: the XPS 15 and the Razer Blade. Those have better build quality but for the price this has better performance all around than the other two. So it's kind of ... you got to pick your poison. I like this machine a lot. I don't know if I would recommend this as, like, the best of the three, because it really depends on what you're looking for. But if you're looking for this type of machine this should be on your short list because it's fantastic. I hope you guys enjoyed this video. Thumbs if you liked it; subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "good",
        "performance",
        "thin",
        "laptop",
        "Aero",
        "pretty good",
        "drive",
        "thin and light",
        "thing",
        "battery",
        "pretty",
        "build",
        "Battery life",
        "build quality",
        "Elan drivers",
        "light",
        "fan",
        "port",
        "GTX",
        "Elan"
    ],
    "transcript_entity_values": [
        "2",
        "Aero",
        "Gigabyte",
        "1060",
        "4k",
        "three",
        "5",
        "60",
        "4",
        "Dave",
        "the Razer Blade",
        "five millimeter",
        "about an hour",
        "mid 90s",
        "PCB",
        "one",
        "1200",
        "USB",
        "1080p",
        "XPS",
        "jack",
        "second",
        "RGB",
        "100",
        "SD",
        "GTX",
        "Overwatch",
        "Elan",
        "around 7 hours",
        "94 watt hours",
        "two",
        "3",
        "Gigabyte",
        "Photoshop",
        "four",
        "32",
        "1050",
        "RAM",
        "seven hours",
        "1,900",
        "Kaby Lake",
        "250",
        "15",
        "14",
        "Ethernet, HDMI 2",
        "Thunderbolt 3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "MONEY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT"
    ]
}