{
    "id": "6TWbXV5xeYE",
    "title": "Is Apple Ruining Your Mac's Performance?",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2017-09-01T22:18:26Z",
    "video_url": "https://www.youtube.com/watch?v=6TWbXV5xeYE",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "thermal throttling",
        "intel cpu temperatures",
        "computer temperatures",
        "mac hot",
        "mac is quiet",
        "macbook hot",
        "computer",
        "apple",
        "apple macbook",
        "apple mac",
        "cpu hot mac",
        "mac slow",
        "macbook slow",
        "imac slow",
        "apple slowing down computer",
        "is apple ruining your performance",
        "is nvidia ruining your performance",
        "pc build",
        "mac build",
        "hackintosh",
        "sierra",
        "high sierra",
        "benchmark",
        "hackintosh build",
        "mac mini",
        "mac pro",
        "macbook pro",
        "imac",
        "stock cooler",
        "water cool"
    ],
    "views": 265843,
    "likes": 9274,
    "comments_count": 1066,
    "description": "Spread the  and visit iFixit:  Follow Snazzy Labs on Twitter -  Follow me on Instagram -   Apple's Mac lineup has a long history of being the quietest computers in the biz. Have you ever wondered exactly how they stay so quiet? It's simple! The fan speed is runs super low. That's why MacBook can get so hot in your lap! But is heat harming the performance of your Mac? Spoiler alert: it is. Thermal throttling is very, very real.",
    "description_links": [
        "http://ifixit.com/snazzylabs",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "It is no secret that Apple has always wanted their computers to be silent. Well, most of their computers. There is even an account of Steve Jobs crying in frustration; crying when he was told by an engineer that the Apple Lisa might require a fan. But does silence come at a cost? Is Apple intentionally reducing the performance of their Macs in order to keep them quiet and in order to compensate for inadequate cooling? I tested this to find out. This episode is sponsored by IFIXIT, \"the free repair guide for everything, written by everyone!\" Macs are quiet because Apple keeps the fan speed as low as they can for as long as they can, but look, you can't escape physics! Have you ever noticed how Macbooks are always very warm and sometimes uncomfortably hot? That's because rather than exhausting hot air by turning up noisy fans like other PC laptop manufacturers, Apple just doesn't, so their machines naturally run hotter. My i7 7700K iMac idles at around 57C. Now my PC, with the same chip, idles at just 30C. That's almost half! So yes, Mac's run warm, but technically other than maybe shortening the lifespan of your CPU, It's okay. What's not okay is if modern Intel CPUs hit 100C. That is the maximum operating temperature, and the CPU will actually decrease the clockspeed and voltage to cool off. It's called thermal throttling and it's seriously hampers performance. So I wanted to see, naturally, if I could get my Mac's to thermal throttle. But rather than try unrealistic benchmarks that are designed to punish the computers and make them as hot as possible, I decided to try real-world workload scenario, stuff that you would actually do, To see if I could get anywhere near the thermal throttle limit on both my base model 2017 13-inch MacBook Pro and my loaded 2017 i7 7700K iMac. I first tried exporting a 4K video on my iMac in Final Cut Pro. Now, annoyingly, the fan speed didn't even increase from the lowest rpm until the CPU hits 80C; and it doesn't ramp the fan speed up to full speed, which is very loud... until 95C. That is really hot! However, despite getting balls hot, the machine doesn't thermal throttle. It hovers between 95C and 99C while maintaining its full 4.5GHz turbo boost clock speed. However, once I opened Google Chrome and played back a 4K YouTube video while I was still rendering, temps rose over 100C and the CPU down-clocked as low as 3.9GHz! That is a 600MHz underclock. Ouch. Since the iMac's CPU and GPU share the same cooler, I thought I would try something moderately taxing on both: a video game. I thought I'd play Tomb Raider in macOS and see if I could get the machine throttled. Now at 1440p, Ultra settings, I was able to play for about 20 minutes at a constant 60 fps. That's pretty good. However, temperatures finally overwhelmed the machine after about 20 minutes and my frame rate dropped to an average of 45 frames per second. That is a 25% performance drop. Not good. Now, that's pretty bad, but on the MacBook, things get even crazier. Exporting the exact same 4K video as the iMac is just too much from my little laptop to handle, and not only does it not maintain its turbo boost speed which I think is 3.6GHz, but it struggles to keep up with the 2.3GHz base clock speed. And this is the entry level model laptop. Have even hotter CPUs jammed into the same computer with the same crappy cooler now I obviously can't add a fan or a heat pipe to my laptop But I can introduce it into a cooler environment now my office air conditioning maintains a 74 degree Fahrenheit Which is 23 Celsius temperature except for what? I'm shooting its balls hot right now, but I wanted to see if the video would export faster And if thermal throttling would go away if I put it somewhere Nippy I have a floor freezer in the office that we store drinks in that maintains a temperature of 29 degrees Fahrenheit That's minus 2 Celsius so I did what any sane lucid man would do I put my laptop inside the freezer close the freezer lid and exported the video and holy Now the machine temperatures stayed in the high 90s still, but it never hit a hundred degrees Celsius It never thermally throttled and it ran at 3.6 Gigahertz the whole time not only that but the laptop actually exported the video seven minutes faster Which is a 39 percent improvement? Holy smokes? Obviously putting a laptop in a freezer is not practical, but I feel like it illustrates an important point Apple Simply isn't putting an adequate cooling Hardware on many of their computers and since Apple uses the same fans and the same coolers Regardless of your computer's configuration, if I'm thermally throttled on the base model 13-inch MacBook Pro, it's surely. There's going to be throttling on the more expensive 13-inch MacBook models And it paid more money for a more powerful CPU that can't even be properly cooled doesn't make any sense Now look sure on my loaded 5k iMac the machine runs very hot But thermal throttling is rare unless you're gaming that is or watching 4k video as you export a 4k video but on the MacBook Pro And I'm sure other models a Mac that Apple sells unless you live in the tundra and use your computer outside Thermal throttling is very real your Mac might be silent, but silence comes at a cost Okay, so while you maybe can't fix your Mac's crappy cooling solution I fix it We'll help you prepare pretty much everything else. I can't even begin to tell you how many times I've used I fix It's free Illustrated repair guides from broken iPhone screens to even the 5k iMac upgrade I did a few weeks ago there repair guides and community forums help you exercise your right to repair it saves You money it saves the environment and fixing stuff is actually really fun I fix it also offers quality tools and parts and great prices for example Pulling apart that iMac would have been a nightmare without the Handy iMac opening oil specifically designed for the job and their Pro Tech tool kit provides a high quality set of every tool you'll need for electronics repair I Love mine I use it almost daily And I know you will too good ifixit.com slash snazzy labs to let them know I sent you well folks That's all for me be sure to like this video if you liked it. If not that other button seems to work Okay, too, but most importantly and as always stay snazzy You",
    "transcript_keywords": [
        "Apple",
        "video",
        "CPU",
        "iMac",
        "Mac",
        "MacBook Pro",
        "Apple Lisa",
        "thermal",
        "speed",
        "thermal throttling",
        "Pro",
        "hot",
        "laptop",
        "fan speed",
        "fan",
        "MacBook",
        "thermal throttle",
        "machine",
        "repair",
        "Steve Jobs crying"
    ],
    "transcript_entity_values": [
        "2.3GHz",
        "74",
        "5k",
        "2017",
        "13-inch",
        "100C.",
        "Pro Tech",
        "2017 13-inch",
        "about 20 minutes",
        "23",
        "Apple",
        "Final Cut Pro",
        "seven minutes",
        "39 percent",
        "the MacBook Pro",
        "3.6 Gigahertz",
        "Mac",
        "3.9GHz",
        "Tomb Raider",
        "600MHz",
        "GPU",
        "Google Chrome",
        "MacBook",
        "Mac",
        "45",
        "the high 90s",
        "Nippy",
        "CPU",
        "a hundred degrees",
        "Illustrated",
        "first",
        "4",
        "4k",
        "almost half",
        "Steve Jobs",
        "MacBook Pro",
        "over 100C",
        "25%",
        "iMac",
        "iMac",
        "80C",
        "K YouTube",
        "29 degrees Fahrenheit",
        "IFIXIT",
        "iPhone",
        "4.5GHz",
        "Intel",
        "second",
        "3.6GHz",
        "Macbooks",
        "just 30C.",
        "60",
        "MacBook",
        "a few weeks ago",
        "the Apple Lisa",
        "Macs"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "FAC",
        "TIME",
        "PERCENT",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "NORP",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "DATE",
        "ORG",
        "ORG"
    ]
}