{
    "id": "6wFuNgW3Z_M",
    "title": "Chargers: The Most ANNOYING Thing About Laptops",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-09-04T17:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=6wFuNgW3Z_M",
    "category": "Science & Technology",
    "tags": [],
    "views": 442742,
    "likes": 22968,
    "comments_count": 956,
    "description": "Learn through problem solving, and the first 200 people can save 20% today on Brilliant at   Why haven't laptop chargers been standardized like phone chargers?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- If you've ever lost your phone charger, you know that while it can be annoying, it's typically not the end of the world, as you can always pop down to the store, grab any cheapo hanging on the rack and it'll do an adequate job of charging your phone's battery. But if you've ever lost your laptop charger, you know that that's an entirely different story. Replacement laptop chargers not only tend to be more expensive, but it's also a lot harder to find one that's gonna work correctly. So what gives? I mean, tons of people carry around laptops, so why haven't charged has been standardized in the same way? One big reason is that laptops have very different power requirements between them. Although this is true to phones to an extent, the difference is a lot more pronounced with laptops. You see, phones have different size batteries and different rates of power consumption, but at the end of the day, they're nearly all built with battery efficiency in mind, as they're going to be used without being plugged into an outlet the overwhelming majority of the time. And even a relatively power hungry phone, like a big gaming RoG phone, isn't going to draw a massive amount of current from the wall when it is plugged in. But this is not the case with laptops. If you look at the variety of laptops on the market, you'll find lightweight models built with power-sipping processors designed for portability that might only require a 40 watt or so charger. However, you can also buy a beefy gaming laptop that can't even get an hour of battery life under load and needs to power bricks that push a total of almost 500 Watts. So you can see right away they have different power needs. And in either case, it's significantly more power than the vast majority of phones would draw from an outlet. This also means that laptop manufacturers wanna have more control over exactly what charger their customers are using. If you buy a third party replacement charger for your phone, the worst that would happen is probably that your phone charges more slowly, that is as long as the charger's built to spec and isn't a piece of junk that's gonna start a fire. However, an underpowered laptop charger could become easily overloaded, meaning that your components could throttle and hurt your performance or start to drain your battery, defeating the point of even having a charter in the first place. So it's not surprising that one company's chargers usually don't work in another company's laptops. And oftentimes they won't even fit as the laptop makers' lack of incentive to standardize charters means that the actual connectors or tips that plug into the system can vary greatly. And of course it doesn't help consumers that manufacturers can make a healthy profit selling their own replacement chargers. As there often, isn't an easily accessible replacement from a third party that functions correctly, so. But despite the usual corporate greed, it does appear that the game is changing, a little bit with new revisions of USB, being able to deliver larger amounts of power, typically through a USB-C port. We may see, a bit more standardization in the future, at least in the laptop connector, if not in the bricks themselves. And you can also make the argument that certain proprietary technologies manufacturers push are actually helpful, such as Apple's MagSafe connector, which allows the charging cord to stick to your laptop magnetically so if it gets yanked out, the chances anything will get damaged are far lower than they would be with many other laptop connectors. So given all of this, my advice to you is to hold onto your laptop charger. The good news is those power bricks, although bulky are a little easier to keep track of than tiny phone chargers. Or AirPods. I think one of my went down the carburetor. Big thanks to today's sponsor, Brilliant. If you're a student, a professional, or just someone who wants to understand the world better, check out Brilliant. The website that helps you reach your learning goals by working just a little bit every day. Brilliant offers interactive explorations and a mobile app to help you master concepts in math, science, and computer science. The courses take complex concepts and break them up into bite-sized chunks. Over time, you'll be amazed at what you can accomplish. We suggest checking out their Mathematical Fundamentals course, which has been redesigned with interactive features to help you with the foundational concepts behind algebra and number theory, and logic, which make it a great resource for STEM students. The first 200 people who had to Brilliant.org/techquickie will get 20% off an annual premium subscription. So thanks for watching guys, if you liked this video, hit the thumbs up, get subscribed, and be sure to hit us up in the comment section with your suggestions, for topics that we should cover in the future.",
    "transcript_keywords": [
        "laptop",
        "laptop charger",
        "charger",
        "power",
        "phone",
        "grab any cheapo",
        "cheapo hanging",
        "adequate job",
        "laptops",
        "Replacement laptop chargers",
        "chargers",
        "phones",
        "battery",
        "Replacement",
        "lost",
        "phone charger",
        "power bricks",
        "Brilliant",
        "underpowered laptop charger",
        "big"
    ],
    "transcript_entity_values": [
        "20%",
        "40 watt",
        "Mathematical Fundamentals",
        "annual",
        "the end of the day",
        "third",
        "first",
        "today",
        "One",
        "an hour",
        "Watts",
        "almost 500",
        "200",
        "one",
        "Apple",
        "USB",
        "RoG"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON"
    ]
}