{
    "id": "6y7_wm9Yufo",
    "title": "BittBoy Handheld Console Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2017-07-18T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=6y7_wm9Yufo",
    "category": "Science & Technology",
    "tags": [
        "BittBoy",
        "handheld",
        "video game",
        "gaming",
        "retro gaming",
        "Nintendo",
        "Game Boy",
        "NES",
        "Famicom",
        "clone",
        "emulator",
        "console",
        "DMG",
        "Game Boy Pocket",
        "review",
        "This Does Not Compute"
    ],
    "views": 148839,
    "likes": 2573,
    "comments_count": 235,
    "description": "Let's take a look at a Game Boy-inspired handheld with an IPS screen. But is it what it seems?  BittBoy main product page:  BittBoy Amazon page:   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Lakey Inspired ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.bittboy.com",
        "https://www.amazon.com/BittBoy-Portable-Video-Handheld-Sky-Blue/dp/B071G11LDZ/ref=sr_1_1?s=videogames",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "https://soundcloud.com/lakeyinspired).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin, how's it goin'? Handheld gaming consoles have been around for decades, but this time, let's take a look at a new retro-focused one that's in some ways, upping the game. [ Music - Intro ] This is the BittBoy and it shares more than a passing resemblance to the original Game Boy. On the right side is the volume dial and around back hides a rechargable lithium-ion battery. It's replaceable too, and is actually the same as those used in the Game Boy Advance SP. It charges through a MicroUSB port on the bottom of the unit. The BittBoy overall is pretty compact, yet still fairly comfortable to hold and use. The controls are familiar, with the expected D-Pad and A and B action buttons. There are turbo buttons for each as well, along with a reset button to go back to the main menu. Speaking of that menu, it lists 300 built-in games. The box claims that all games are in English, but this isn't entirely true. There are some familiar titles here, like Mario 3 and Double Dragon, but Super Contra, for example, is actually the Japanese version. Yet it seems lke a lot of the games listed are homebrew or knockoffs. I mean, who knew that Angry Birds was an 8-bit platformer? Or that Mario could punch enemies? Or that he was skilled with a katana? What's perhaps most confusing is that despite the BittBoy's handheld nature, it only includes Famicom and NES games. I was excited to find a slot on the top of the case that looked like it was for flash storage. And indeed, it's the perfect size for a MicroSD card. But when I took the unit apart, I found that it's just a slot in the casing. There's no actual card reader or even the solder pads on the board for one. Having a built-in rechargeable battery is great, but this one is only said to last for two to three hours of gameplay, which seems low for its size. There's also no headphone jack. There is an AV output on the bottom, and a composite video cable is included, but it uses a 2 millimeter plug, instead of the more common 3. The buttons work fine, but they can be a bit stiff, and the A and B buttons have a weird layout. Finally, there's no link port or ability to connect an additional controller, despite a number of the built-in games supporting two player modes. This handheld has one saving grace, and that is its screen. It's a 2.2 inch IPS panel with vibrant colors and excellent viewing angles. This display is very sharp and it's even a standard 4:3 aspect ratio, though games are stretched horizontally from their original 16:15 ratio. The backlight is nice and bright, and while there's no brightness control, overall, this screen makes for a pretty nice gaming experience. So this console is really a mixed bag. Its small size, rechargeable battery, and great screen make the hardware somewhat compelling. I can get over the non-standard button placement, even though it is annoying. But what really limits the BittBoy is its software. Instead of being locked into a questionable list of ROMs, I would have preferred that the MicroSD card slot actually worked so I could load my own. The thing that may still make this worth buying is its price. I paid only $30 US on Amazon with free shipping. So, despite its flaws and quirks, for some, that price may make the BittBoy too appealing to pass up. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Game Boy Advance",
        "Game Boy",
        "games",
        "original Game Boy",
        "Colin",
        "builtin games",
        "BittBoy",
        "game",
        "Boy Advance",
        "buttons",
        "Boy",
        "NES games",
        "make",
        "original Game",
        "slot",
        "Handheld",
        "Hey",
        "card",
        "battery",
        "builtin"
    ],
    "transcript_entity_values": [
        "NES",
        "Mario 3",
        "Super Contra",
        "Angry Birds",
        "two to three hours",
        "MicroSD",
        "BittBoy",
        "two",
        "Instagram",
        "IPS",
        "8",
        "Mario",
        "decades",
        "Japanese",
        "300",
        "English",
        "jack",
        "US",
        "2 millimeter",
        "one",
        "Game Boy",
        "2.2 inch",
        "16:15",
        "MicroUSB",
        "Amazon",
        "Famicom",
        "Colin",
        "Twitter",
        "AV",
        "only $30",
        "D-Pad"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "NORP",
        "CARDINAL",
        "LANGUAGE",
        "PERSON",
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "ORG"
    ]
}