{
    "id": "717kBVleKEs",
    "title": "Are Movie Theaters Dead?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-04-01T16:30:12Z",
    "video_url": "https://www.youtube.com/watch?v=717kBVleKEs",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "movies",
        "movie theater",
        "movie theaters",
        "theater",
        "alamo drafthouse",
        "amc",
        "box office",
        "amazon",
        "the invisible man",
        "trolls: world tour",
        "the hunt",
        "movie",
        "alamo drafthouse cinema",
        "universal studios",
        "disney",
        "netflix",
        "cinema",
        "film",
        "theatres",
        "movie math",
        "theaters",
        "movie theatres",
        "movie theaters closing",
        "vod",
        "video on demand",
        "movie rental",
        "regal",
        "universal",
        "disney+",
        "streaming",
        "disney plus",
        "tech",
        "film industry",
        "movie review",
        "movie theaters closed",
        "movies delayed"
    ],
    "views": 95660,
    "likes": 3819,
    "comments_count": 702,
    "description": "Where will we get our $20 popcorn now?! Trying the $166 iPhone 11 Pro from Wish:  The Truth About Xbox Series X:  Austin's hands on demo:  Xbox Series X Gameplay:  110 year old DVD!?   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/P5aEi6WGxOs",
        "https://youtu.be/5V_vMjkDzGE",
        "https://youtu.be/7Fjn4GRw8qE",
        "https://youtu.be/Oeyu0xYQtrw",
        "https://youtu.be/fElUqZHWpUw",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to this is, Are movie theaters as we know it dead? - I mean obviously, right now movie theaters are going through a tough time with social distancing becoming the norm. It's difficult to say, \"Go hang out with your buddy Matt and watch movies.\" - First of all, if you knew anything about me, you'd know I do not want anyone with me when I go to the movies. I remember when we went to the movies with our editor, Josh. It's a dead silent theater, movie's about to start and suddenly you just hear kssshh. - Look, we're not here to put Josh on blast. - (chuckles slightly) So I argue obviously, theaters are going through a hard time right now. All of them have closed down really and not immediately. I wanna make it clear. The point I'm about to make I don't think it's gonna be an immediate thing, but in the next like say five years, movie theaters are not gonna be a thing. - Please walk me through that very controversial statement that I strongly disagree with. - Recently, Universal, Disney like a whole bunch of studios, have started talking about doing in theater releases of movies or either super advanced releases for home videos. So, right now Amazon currently has four in theater options. It's actually a new category they have-- - On Prime, yeah. - With Disney's \"Onward\", you can purchase that for $20 right now. - Oh, you can purchase not rent? - You can purchase that one-- - Oh. - And that's-- - To be clear that is a Pixar movie that came out a few weeks ago, very recently. - And I'll get into that in a second, but also they have like, Universal they have \"The Invisible Man\" which you can rent for $20. You get 30 days rental with it. - Wait 30, I've never rented on Prime before. - So once-- - 30 days? - So once you hit like purchase or rent, I guess in this case, you have 30 days to watch it and as soon as you start watching it, you have 48 hours to finish the movie. So this is actually completely unprecedented. They've never done anything like this and this is something that's really been requested by people in the past. When TVs came out people said the movie theaters we're gonna die. When cable came out they said the movie theaters were gonna die, still here. And then when they said video on demand came out, that would be the end but really, it never happened and if anything, movie theaters have gotten better. - They've changed their policies on what a movie theater's for, right? The movie theaters have gotten more expensive, but they've had to sort of become more premium, right? How many theaters in the last few years have switched to like reclining seats and like offering things like food and drink when you're in the theater? And that makes sense because if you just wanna watch a movie, like you said, wait a few months, rent it on you know, iTunes or, you know, watch on Netflix or whatever, but the theater has evolved to give you a more premium, higher-end experience. I would argue that it makes sense that that's something you can't really get at home. You're not gonna have people bringing you food and obviously getting the great experience on the display with the sound, Dolby and like IMAX, everything. They're really trying to push things up market and I think once things get back to normal, not to completely disagree with your entire point. But I completely disagree with your entire point in that, I don't think movie theaters-- (man laughing in background) are going anywhere. - I don't think it's a movie theater thing that's gonna cause this. So like you're right, movie theaters are no longer a place to go see movies. They're a place to go do everything else that happens to-- - Experience. - Yeah, that happens to show movies. Like, we love going to the Alamo Drafthouse, which is a bar, a great restaurant, oh and by the way, you can go see a movie there. - And eat in the theater. - Right, the reason I say that the movie theater is gonna go away, is because really, the studios aren't gonna have a whole lot of incentive to push their premieres to movie theaters. So I'm gonna make a very simple generalization here, just for the sake of math. So the way that studios and movie theaters work is, say opening weekend, \"Avengers:Endgame.\" The studio made 90% of ticket sales for that first weekend. But then maybe say the second weekend, they get 80%, third weekend 70% and so on, so on, so on. So the movie theater is making next to nothing on your ticket. Obviously, that's why they've been pivoting to serving alcohol and food and concession because that is almost purely profit. - Look, that $8 bag of popcorn costs them like 45 cents to make a-- - Correct. With something like the video on demand that Universal's doing, they're one step closer to completely eliminating the middleman, because the studio does not care how much concession gets sold. They don't care that-- - They don't make anything on that-- - Yeah, they get nothing. - Although, fun fact I'm gonna tell on your behalf, you used to actually have a job installing-- - Yes. - Movie projectors, you were upgrading projectors. - I had a job upgrading projectors. This was back in I think about 2010, 11-ish, when theaters made the official switch from film projectors to digital projectors. Those were about $50,000 projectors. A lot of studios would kinda loan them out or like often they helped offset the costs. But for smaller theaters that still couldn't afford it right away or had to get one later, a concessions company would actually pay for the projector for them. That's part of why concessions have gotten larger and larger and larger. Is because there's so much everyone's taking a bigger slice of this-- - But Matt, I love to spend $50 on a really mediocre meal for my wife and I when we go to the theater. Hit me with the hard-hitting facts right now, Matt. Change my mind. Try to explain to me why you were right and I'm wrong. - This is the first time that studios have let regular people watch a in theater movie at home and I say regular people because there is a service for the ultra-rich, which cost like tens of thousands of dollars, where you could actually like, get your own projector and you can actually get like in theater movies. That's not us, we're the peasants down here. But so, this is the first time that they're doing it. Now right now, we don't know what the the numbers is. We don't know how successful this has been, or how unsuccessful it's been and we don't know how much Amazon has taken, which is a big factor. Is it comparable? Is it more? With upcoming services like, NBCUniversal streaming service, they can completely cut out the middleman and then so if you go and rent a movie on their platform, it is 100% profit going direct, I mean not 100% profit. But if 100%-- - It's pretty much a 100. - Going to Universal, there is no middleman. - I'm gonna clap back, as the kids say-- - Yes, clap back. - And hit you with a couple of other other points, okay. First of all, a lot of people have been pointing out that with streaming services like Disney Plus, and Peacock and all these other streaming services that are owned by the studios that are making these movies, people like, \"Why don't they just put them on \"the streaming apps?\" But that would be dumb, because you're paying what? Eight bucks a month, 10 bucks a month, whatever. Whereas these movies can sign 10, $15 tickets, they can make hundreds of millions of dollars in one weekend by selling it and then they have the trailing revenue of then they sell the rights to go to TV and to hit the streaming service, and everything-- - Oh yeah. All right, I have some statistics here from you, from-- - Oh, no Matt, don't hit me with statistics-- - Yes. According to NATO, and not that NATO. - (laughing loudly) What?-- - Yeah. (man laughing in the background) - Whoa, hold on-- - They need, a way better acronym. It's The National Association of Theatre Owners, in the United States, all right? The average ticket in the U.S. cost between nine to $10 to go see a movie. Obviously, we live in L.A-- - But to say what? - If we saw a $9 ticket we'd buy all of them, just period. Here-- - Are you hoarding tickets, Matt? (laughing loudly) - Yeah, I'm gonna be out in the back of my car just selling tickets at $9, you kidding me? For some people it's a bad deal to spend $20 to rent a movie at home. For someone like us in L.A., it's not that bad. But when you also factor in that the average persons spent about 15 to $20 per visit in concessions suddenly, this is a really good deal. Because you got the guys like Josh, who is still bringing in their Coke anyway. They're not buying it at the theater. You could just do that at home. Is the concession as good? Actually you know what, you could probably make better popcorn at home than most movie theater popcorns-- - Wait, wait, are you throwing shade on movie theater popcorn right now? - Yeah, just like what's the incentive? So on Universal and Disney, they could do this with the flip of a switch. No one is suggesting that it'd be a financial gain to make these movies free. - And I'm not suggesting that. You duly cut me off in the middle of my point, but go ahead Matt, whatever-- - Exactly, because that's what you do to me. (Matt fake laughing) - Oh yeah, that's true. - So, if Disney just on their platform , just has a section that says, \"Rent from home\" and suddenly they can just be making all this money. - But not, you're missing a key point. - What's my key point I'm missing? - All of these movies, will end up on Disney Plus, for example. So, what are the odds that someone's going to pay to get the exact same experience that they will get for free in two to four months later? I think that's the main issue. People are like, \"Oh look, that new Pixar movie came out. \"If I go to the theater, I get this whole experience \"as a whole thing. \"But if it just shows up in the app, \"that I'm already paying for, \"that I'm gonna get in a couple months anyway,\" I feel there's gonna be a real like, a lot of people are just not going to do it and these studios need-- - Because I could argue that one as well. Average for release from theater to home release, which is either digital or DVD whatever, that definition has changed over the years, is 90 days. Because after 90 days, the studio is making literally zero dollars on movies in the theater, which is why they then transition it over to DVD where they at least get some of the home sales. I wanna make one thing clear so I don't get chased out of town with pitchforks and torches. I love going to the movie theater. I go two to three times a week. It is-- - Not same. - That is like what I do. So I'm not saying that I am rooting for this, but I'm saying the way that the the economy for movie theaters would shift, this is what I see happening. - But the thing is Matt, this is all happening because of obviously the extraordinary circumstances that the world is going through right now, right? Obviously, anytime that there is some kind of major disruption, industries and companies are going to take advantage of it however they can and if the Disneys and the Universals of the world really do want to push theaters out of business, they can certainly do that and they could use this as an opportunity. However, in the wise words of Jimmy Champagne, they have not, to my knowledge really talked that much about the numbers from some of the movies that they have released through Amazon, right? That to me seems like a sign of weakness that they're not seeing millions of people paying to rent these movies at $20 a pop, right? I'm not surprised cause that's a tough sell and it's such a new thing for people, I feel that theater's gonna come back man-- - I think part of it too. - I feel theaters are going to come back just as they as they were before. They're going to continue to get more and more premium and once the world is back to normal, I really do feel like people are gonna to go back to watching movies because that is the way this has been for so long and it is an experience that you cannot translate that at your home, right? Some people wanna watch stuff at home, guess what? You can still watch at home. It's still gonna hit Disney Plus three months later at for free or whatever the case is. Did you want the day one experience, you want the popcorn, you wanna go out on a date? I don't think movie theaters are going anywhere anytime soon-- - [Ken] It's the early adopter mentality for mainstream stuff. - So for a long, long, long time, the only way movies succeeded was with the help of the theater. Now, they don't need the theaters. - That makes sense if you take the idea, the movie studios wanna run theaters out of business. I'm not convinced that that's the case. Last year, how much money did they make on the hundred movies or what? How many were they released that all were number one-- - [Matt] Every blockbuster's about a billion dollars. - Why are they gonna walk away from that kind of money on a risky gamble like this? Especially, given that from my limited understanding of the way that these early home releases have been going, it is not huge. Obviously, that's not a fair comparison. They did not market a ton of people around like, \"Hey, go download on Amazon,\" or I just feel like there's definitely, you never know in the future, right? Five, 10 years from now who knows?-- - And I'm saying this is a minimum of five years out. - Well, I look forward to 2025 where we'll do it. This is update and you will be wrong. - I'm really hoping I am wrong. I really am. - Theaters aren't going anywhere, but I'm very curious. What Do you guys think? Is it time for us to move past a movie theater? Are you perfectly happy watching content at home on Netflix, Disney Plus? Quibi, YouTube, YouTube TV, Sling. I don't know, I just hit my mic, but there's probably like 100 other options. Let us know in the comments, but more specifically, let Matt know that he's wrong. - Did you just say Quibi? (low hiphop beats)",
    "transcript_keywords": [
        "movie theaters",
        "movie",
        "theater",
        "theaters",
        "movies",
        "people",
        "home",
        "Disney",
        "Matt",
        "make",
        "movie theater thing",
        "back",
        "yeah",
        "rent",
        "studios",
        "Universal",
        "movie theater popcorns",
        "theater movie",
        "Pixar movie",
        "thing"
    ],
    "transcript_entity_values": [
        "opening weekend",
        "like tens of thousands of dollars",
        "8",
        "90 days",
        "millions",
        "the last few years",
        "Universal",
        "Coke",
        "Pixar",
        "a few months",
        "Disneys",
        "kssshh",
        "80%",
        "three months later",
        "2025",
        "hundreds of millions of dollars",
        "U.S.",
        "30",
        "Quibi",
        "Avengers:Endgame",
        "15",
        "90%",
        "YouTube TV",
        "48 hours",
        "Matt",
        "L.A.",
        "two to four months later",
        "Five,",
        "9",
        "70%",
        "about $50,000",
        "the second weekend",
        "45 cents",
        "10 bucks",
        "Dolby",
        "between nine to $10",
        "Netflix",
        "first",
        "a ton",
        "the Alamo Drafthouse",
        "10",
        "10 years from now",
        "Josh",
        "a couple months",
        "one weekend",
        "20",
        "Disney",
        "30 days",
        "50",
        "100%",
        "third weekend",
        "Last year",
        "that's--",
        "Disney Plus",
        "second",
        "two to three",
        "NATO",
        "The National Association of Theatre Owners",
        "about a billion dollars",
        "Jimmy Champagne",
        "First",
        "a few weeks ago",
        "one",
        "five years",
        "four",
        "zero dollars",
        "the years",
        "YouTube",
        "the United States",
        "Amazon",
        "hundred",
        "about 15 to $20",
        "11-ish",
        "about 2010",
        "Eight bucks",
        "100",
        "that first weekend",
        "IMAX"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "GPE",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "PERCENT",
        "ORG",
        "TIME",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "MONEY",
        "PERCENT",
        "MONEY",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "PERCENT",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "GPE",
        "GPE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}