{
    "id": "73hQPc_RInM",
    "title": "The smart way to buy a used phone online",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-09-27T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=73hQPc_RInM",
    "category": "Science & Technology",
    "tags": [
        "phone",
        "refurbished",
        "used",
        "samsung",
        "samsung s9",
        "how to buy",
        "new phone",
        "buy",
        "mobile phone",
        "samsung galaxy s9",
        "galaxy s9",
        "used iphone",
        "smartphone",
        "galaxy s9 plus",
        "samsung galaxy s9 plus",
        "galaxy s9 review",
        "samsung galaxy",
        "s9",
        "galaxy s9 camera",
        "s9+",
        "s9 review",
        "technology",
        "top 10",
        "gadgets",
        "gadgets 2018",
        "gadget",
        "new gadget",
        "future gadgets",
        "tech",
        "future tech",
        "future technology",
        "latest updates",
        "how to",
        "apple",
        "google",
        "android",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 571814,
    "likes": 11534,
    "comments_count": 1175,
    "description": "Phones are becoming more and more expensive, and there isnt always a need to buy the newest phone available. Buying a used phone can be a great way to upgrade and save a lot of money at the same time. In this episode of Workflow, Becca shows us how she shops for used phones and what sites to use for a great deal.   Read more about these tips here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2zEkmrp",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- The time has come. I'm coming clean. I've had the S7 for two years now. And being someone that films the latest and greatest tech everyday, it's gotten me wanting a new phone. The thing is, I don't wanna spend $1,000 and I don't necessarily need something that came out yesterday. So I'm gonna show you how to buy a good, used phone. (light music) Okay, I'm buying an S9+. Now, I am not here to tell you what phone to buy and I'm sure you'll sound off in the comments about your favorite devices and what you would buy, but what I am here to do is to tell you the best buying practices for a used device. The safest and most reliable ways. Before we get to any of that, though. You have to remember that phones come out in cycles and there are better and worst times to buy certain devices. So I hit up Chris Welch, a reporter here at The Verge, and I was like, Chris, is it a good time to buy an S9+? - [Chris] So there are pretty clear timelines for when it's a good idea or bad idea to buy a phone. New iPhones come out every September so you really shouldn't buy one if it's July or August. Samsung puts out the Galaxy S at the start of each year, March or April. Then the Note follows that up in the summer. Google does Pixel updates in October. In general, Apple and Samsung both change their designs every two years. Then in between, there's a more powerful version of the same phone with better specs, nicer camera, stuff like that. That's what we call the S year. So the question comes down to: do you want the new flashy design right away? Or can you wait one year for the more powerful, more refined version of that same phone. Now Google is a bit different because the Pixel generally hasn't used the same design more than once. But maybe you'd be totally happy with last year's phone. You don't need a neural engine to browse Instagram, or a Snapdragon 845 to play Spotify. So in your case, you'd be totally safe to buy the S9+ right now. And since it's less than a year old, buying it used will save you at least $100 and still get you a great phone. - Okay, so we are in luck. It is a good time to buy a used S9+. But, where do you start? I mean there's a million different options. Personally, I always look at eBay and Craigslist first. Craigslist can be a little bit of a slippery slope. If a phone is stolen and then you go to turn it on and the serial number's flagged as stolen, you'll be out the phone and the cash. And you'll have no connection to the seller. So for this video, I'm gonna skip it entirely. But let's have a look at eBay. eBay has a ton of listings and I went onto Samsung's website to see what a brand new S9+ would be, it was around $840. So I'm gonna try to beat that. Now, for my sake, I'm going to search by Verizon because that's my carrier. There are unlocked devices, but you'll have to do research on your own to figure out if they'll work on your network. I've looked through a bunch of listings and I found this one. This is the most promising. It's a Samsung Galaxy S9+, 64 gigs, for $549. For me this looks nice because the photos are very clear, I can tell that there's no scratches on the device. Wow, they have a lot of five star reviews. 760 positive reviews and only six negative. When a seller has a lot of positive feedback like this, it's usually a pretty good sign that they're safe to buy from. Also when searching I've noticed a lot of stock photos used for the photo of the phones, this is something you wanna stay away from. It's really important to see your device in the photos and maybe that means reaching out to the seller and asking for a photo of a specific thing. Just to be sure that's the device and that he has it. So $549 on eBay. That's pretty good but if you know anything about me, you know I'm all about the deal. So I'm gonna keep shopping. There's this website called swappa.com that I really like. You're still buying person-to-person so there is a level of risk, but there's a lot more safeguards in place to ensure that you're getting the device that you're actually looking at. There's a few listings for the S9+ on here. They range from about 500 to $800. That mostly has to do with the storage but I'm looking for the 64 gigabyte model so it's not a huge problem for me. I'll be at the lower end. Okay so this one looks pretty good, it's $514. If you look at the photos you'll notice that there's a code in there. That's one of the safeguards that Swappa has. It basically is the code for the sell. So the phone that you're seeing in the photo, is the phone for that listing. I'm gonna scroll down, I'm gonna read some of the comments next. Maybe I'll go in and I'll see who the seller is, if he sold things here before. Kind of all the same steps as eBay. Okay so this looks pretty good and another safeguard is that Swappa doesn't allow the sell of broken or unusable devices. Now since you are buying used, it doesn't come with a warranty. So say down the line something happens to your phone or it glitches out. You're on your own to get it repaired. If you wanna little bit more reassurance when buying a used phone, you might wanna look at refurbished models. They come with a guarantee. So if there's a defect down the road, they'll replace the device for you. You can buy refurbs from a few different places, including the manufacturer and your carrier. But there's also sites like Gazelle or Best Buy. They often have cheaper prices on these. All right, Best Buy's website is a little confusing in trying to find refurbs, but if you scroll all the way down to the bottom where it says buying options, that's where you'll see them. Now you can open-box online, it's a little more expensive, or if you got into the store, they have cheaper options. But it's probably because they want you to actually look at it and know what you're getting before you leave the store. So gazelle.com has certified pre-owns as well, here's an S9+, 64 gig, through Verizon for $639. That's cheaper than Best Buy, but it's still not as cheap as Swappa or eBay was. So buying a refurbished device is definitely the safest way to buy a used devices. But, for me, I'd rather have the cheaper price and take the risk. So Swappa is the most appealing to me. The price was the lowest and although it doesn't come with a guarantee, the seller seems like he's sold things on here before and he has really good reviews. And I feel good about it. So I'm gonna go with Swappa for this one. And I'm gonna waive that whole guarantee so if something goes wrong, I guess it's on me. But what I will use Gazelle for is selling my old phone. It's not in great condition, but I definitely want it recycled properly and I no longer need. So you can go on their website, enter some info, if it has scratches, if it turns on at all, and then they'll offer you a price. They're gonna give me 10 bucks for this thing and free shipping, so I guess that means lunch on Gazelle? (soft music) All right, so sound off in the comments of your favorite way to buy and sell devices. And who's got the oldest phone out there? Anyone got me beat? Also, like and subscribe. We'll see you next time.",
    "transcript_keywords": [
        "buy",
        "phone",
        "good",
        "device",
        "buying",
        "devices",
        "Swappa",
        "pretty good",
        "eBay",
        "year",
        "Samsung",
        "seller",
        "pretty",
        "time",
        "good time",
        "photos",
        "Gazelle",
        "lot",
        "cheaper",
        "website"
    ],
    "transcript_entity_values": [
        "Chris",
        "September",
        "eBay",
        "Samsung Galaxy S9+",
        "Apple",
        "Verizon",
        "yesterday",
        "The Verge",
        "the summer",
        "Pixel",
        "one year",
        "October",
        "Google",
        "Spotify",
        "639",
        "only six",
        "two years",
        "549",
        "the S year",
        "Samsung",
        "760",
        "S9",
        "64",
        "1,000",
        "the start of each year",
        "March",
        "10 bucks",
        "514",
        "Chris Welch",
        "840",
        "July",
        "64",
        "the Galaxy S",
        "Best Buy's",
        "a million",
        "Swappa",
        "at least $100",
        "Verizon",
        "five",
        "first",
        "Instagram",
        "Craigslist",
        "last year's",
        "S7",
        "about 500 to $800",
        "64 gigabyte",
        "August",
        "April",
        "a ton",
        "less than a year old",
        "around $"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "MONEY"
    ]
}