{
    "id": "7awtSj4OCeo",
    "title": "Steam Chromebook",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-02-18T19:06:25Z",
    "video_url": "https://www.youtube.com/watch?v=7awtSj4OCeo",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 78881,
    "likes": 2397,
    "comments_count": 129,
    "description": "Would you buy a gaming Chromebook?  2022 Apple Event Leaks:  Galaxy S22 is Boring:  Steam Deck Doesn't Suck:  Android is BROKEN - Google Pixel 6:  Did Microsoft Break Gaming?   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Do your joke 0:40 Who uses Chromebooks? 1:01 Steam heading to Linux 1:54 RTX on Chrome OS? 3:30 HOW MUCH?!?! 4:07 Is RTX even worth it? 5:01 A 3060 in a Chromebook? 5:35 Blast from the past 5:45 Can Chrome OS Compete? 6:40 Possible display specs 7:05 Gaming Chromebooks are coming 7:26 These are NOT gonna be cheap 7:58 Is it better than Windows yet? 8:26 This makes sense for nVidia 9:00 We are sleeping on Chrome OS 9:40 What do you think?!",
    "description_links": [
        "https://youtu.be/tHTlQkJzAaA",
        "https://youtu.be/Qr5yTzbr7GY",
        "https://youtu.be/zbNRbCtO-Cg",
        "https://youtu.be/tktBL8CCC4Q",
        "https://youtu.be/fsCEfkCijtw",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Go ahead, do your joke - It's not funny anymore. - It never was. (static) Hello and welcome to This Is, Austin, are you ready to be doing some hardcore gaming on your brand new RTX enabled Chromebook? - Okay. This is a wacky story, but hear us out here. Chrome OS has an enormous amount of, I would say, sway in the market, right? A big reason why Android tablets aren't complete garbage, is because most Android apps are also designed for Chromebooks, which means that they are designed to work well on a larger display that can be resized, right? Before Chrome OS, and before Android apps worked on Chromebooks, that was not the case. Largely. Some exceptions, right? But there are a ton of kids and a ton of people in general, who use Chromebooks. - [Matt] I mean, a lot of those schools hand them out. - [Austin] Absolutely. It might not be like the highest percentage, but it is a very sort of, important demographic, I would argue. - All right, the story started floating around. - There's a bunch of different parts of this. - Yeah. So one of 'em is that, all right, Steam is gonna start coming to Linux-based Chrome OS - [Austin] Which makes 100% sense. So Valve has a clear interest in bringing out as many Linux games as possible to not only work on the Steam deck, but of course they wanna sell games on every platform that you will potentially buy them on. - And make a cool 30% on those sales. - Exactly. On top of that, there are enough people who buy Chromebooks. And really, if you think about the demographics of Chromebooks, there's a lot of gamers I would argue who are, you know, in school whatever the case is, who also use Chromebooks, right? So I think there's a natural fit to if your school Chromebook or your work Chromebook could also play some games on the side. Well, I mean, that seems pretty good to me, right? - Yeah, except most Chromebooks, especially once handed out by schools have the specs of half a potato? I wouldn't even say a full potato. - Would you say a wet noodle? - Yeah. It's so the other side of this story is that Nvidia showcased some some demos where they had RTX 3060, - [Austin] Yeah. - [Matt] on Chrome OS. - Yeah, so it was an arm processor. It was a MediaTek Kompanio 1200. I don't know why I said it with the accent, but I'm just gonna roll with it. But essentially, an arm-powered device that had an RTX 3060 attached. Now, it was very much, to be clear, a proof of concept. - I don't believe we're actually gonna see that configuration being sold, but you can imagine a dedicated RTX graphics card being sold in a medium to high end Chromebook that still is arm-powered that still has all the battery life, blah, blah, blah that you know, you don't need to use the GPU all the time. But unlike another device that maybe doesn't have a great battery life, or is super expensive, or whatever, you have that power you can fire up when you need it. - I don't think, correct me if I'm wrong, - but I don't think there's ever been a Chromebook with a dedicated GPU. I think everything has been- - No, no, no, no, no. Like, the best, sort of highest end Chromebooks typically are just like a core I5, maybe a core I7 in a few cases, but nothing that has dedicated graphics. As far as I know I could be wrong with some weirdo thing, but - I have, what do you think the most expensive Chromebook is? - Was it the Chromebook Pixel? That was fairly expensive. Or no the Pixelbook, the Pixelbook was even more expensive. - Not even close. - Is it some stupid, like, Enterprise Lenovo 9000? - I specked out an HP Elite C 1030. - Oh, those are actually really nice - Chromebook notebook PC customizable. - (laughs) Great name. - [Matt] So the base for this guy - Yep. - Is a 10th, a 10th gen I3. - [Austin] Okay. - [Matt] Eight gigs of Ram. - [Austin] Okay. - 120 gigs, NVMe storage. - Sure. - 1600 bucks. - Wow. That's a lot of money. - It's so much worse. So spec'd, fully spec'd - [Austin] Yep. - Is a 10th gen I7 with 16 gigs of Ram. - [Austin] Lot of Ram. - It's still HD, but I think it's like a- - Intake layer or anti - Yeah. Yeah, whatever. - Looking. But not, it's not like you're getting 4k. It's not like you're getting higher frame rate, whatever. $3,000. (inhales) And it's apparently in so much demand with chip shortage - No it is not. It is absolutely not, you're a liar. - [Matt] It will not ship until September of 2022. - Because no one's ever ordered that before Matt. They gotta do all the prototyping and figure out if that actually even exists as a configuration. - So that's, you know, when we talk about Chromebooks often we talk about - Yeah. - The price. - Yes. - Because when you're talking about a Chromebook that costs like 200, 300 bucks, no brainer. that that device can do most things for most people. You and I probably could both live on a Chromebook. - I can do 95% of my daily tasks on a Chromebook without any issue whatsoever. - You know, we don't use Chromebooks but they are really useful for that scenario. But when you start talking about like the premium Chromebooks, like I know Samsung has one That's like 600 bucks. It starts to be like, well, why why am I getting this versus an actual either, you know - Real laptop. obviously a prebuilt PC is, you could you could get a pretty decent PC for 600 bucks. - [Austin] Of course. Laptops can be really shitty for in that $400-500 price range. Definitely at 200 bucks, It's really bad. - [Austin] Yeah. - But you still get the full windows experience. Imagine you're shoving a 3060 into a Chromebook. I don't think you're getting out of there for less than a thousand bucks on even like the most modest Chromebook. - Absolutely. We're not talking about ultra budget Chromebook. We're talking about a Chromebook, which is accelerate not only in hardware but also just as a more premium experience. This actually reminds me of the very first Chromebook. Matt, do you know what the very first Chromebook was? - I do because our wonderful researcher Kinsey has it here June 15th, 2011. - I'm gonna show you something - She didn't give me the actual name of it, but you were there. - [Austin] CR 48 is the first computer built specifically- This is a video I made in February, 2011. - Why do you sound older? (laughing) - Chrome OS has come a very long way. And I think a lot of people disregard it as, oh it's just a browser, but like between Android apps between the ability to run full Linux. But especially if you throw things like games and steam on it and more powerful hardware, it does, I think, become a more full featured device where you can knock out even more things that you just straight up can't do like, oh no, I actually can game. Especially if there are any kind of compatibility layers like what steam has been working on or Valve has been working on for the Steam Deck to allow you to run some windows games as well. But the thing is, is you also need the other part of this equation, which is not just RTX graphics but the actual chips to run them, having an arm powered CPU something that's supposed to be super efficient, designed to be, you know, running tablets, everything and hook up a full graphics card is not something you can just do right off the shelf which is why we really haven't seen it. But the fact is they believe that there's enough of a market where they're putting in the time and the effort to develop this. And in fact, the immediate type processors they're actually even talking about stuff like, oh, you know what? It is gonna be, what three displays and 120 Hertz and you know, eight cores and all this kind of stuff like the levels of performance that you're gonna be able to see in Chromebooks as well as sort of Just Android tablets and whatnot. It is gonna be coming up it a bit over the next few years. So why wouldn't Nvidia want to jump on the bandwagon and make graphics cards available and at least build the software stack behind that. It seems very clear to me that gaming Chromebooks are coming, right? I mean, they might not be as powerful as an RTX 3090 in your, your laptop or whatever, but that's fine. Like they will have enough performance and theoretically with Steam and more and games being optimized for Linux they'll be up and running in a way that will be maybe not quite as good as on Windows, but good enough for a lot of people probably. - Let me ask you this. - [Austin] Yeah. 'Cause we know that this is not gonna be a cheap device. A thousand bucks would be the rock bottom minimum price for that. But I think it's closer to like 1500 bucks. - Well, it depends if they have lower end GPUs they could probably land in the 700 ish dollar range. Like it doesn't have to be super expensive to have some level of gaming performance. If you are a school and you're gonna be giving out Chromebooks to a bunch of, you know high school or college kids or what have you, it might make sense to give them something with a little bit more performance - Like a public school that gives out Chromebooks they're giving away the $200 Chromebooks. Again, I'm not trying to put down Chromebooks here but just arguably better - Who would spend money? overall experience to have just a full-fledged like Windows machine. That doesn't have the limitations that Chrome OS has. - Yeah. - And to spend that much money on it. I think it just makes more sense just to get a windows laptop or, or Mac or something. - Yeah, look, I'm not gonna disagree with that. I think for most people, this is probably not gonna make a ton of sense, but for some people it will. And ultimately it's one of those things where on a video side, they're just gonna put this together because it's probably not a massive investment and who knows where it might lead. You know, the next generation Nvidia book that doesn't use Intel, whatever the case is. And on the Valve side it completely makes sense to make Steam available because there is a huge market of Chromebooks that exist even today that don't have RTX graphics that could still play a lot of sort of simple ish- - There's a lot of games that can play on integrated graphics. - Absolutely. - Especially with the higher like there's some, you know, 10th gen, there's even 11th gen Chromebooks now. - Which have decent graphics, you know same thing on the AMD side, Right? So like, I think Chrome OS continues to grow and thrive as a platform. I think a lot of people sleep on it as like, oh it's just sort of a watered down device or, oh I've gotta use this for work or school or whatnot but it continues to get better and better. And between the Android app support and the Linux support and the fact that just Chrome OS just continues to grow and sort of gain new features. I think this is just another feather in it's hat and while no, it might not make sense for you and I to go out and buy a gaming Chromebook for a thousand dollars tomorrow as it gets better and better more and more people will start to find that maybe it actually is a perfectly acceptable compromise and that you don't have to give up huge parts of your workflow or your games or what have you to make Chrome OS a part of your life. But let us know what you think in the comments below. Make sure to subscribe! Ringaling that dingaling bell and never, ever forget that Austin did a CR 48 review before some of you were born. - Ouch.",
    "transcript_keywords": [
        "Chromebooks",
        "Yeah",
        "Chrome",
        "RTX",
        "RTX enabled Chromebook",
        "lot",
        "Steam",
        "Android",
        "people",
        "make",
        "RTX graphics",
        "games",
        "bucks",
        "graphics",
        "school",
        "school Chromebook",
        "Android apps",
        "Chromebook Pixel",
        "sense",
        "device"
    ],
    "transcript_entity_values": [
        "a thousand dollars",
        "Pixelbook",
        "dingaling bell",
        "Android",
        "one",
        "4k",
        "AMD",
        "300 bucks",
        "GPU",
        "Kinsey",
        "the next few years",
        "three",
        "September of 2022",
        "Chromebook",
        "Chromebooks",
        "I7",
        "95%",
        "February, 2011",
        "Windows",
        "10th",
        "less than a thousand bucks",
        "Linux",
        "Ram",
        "200",
        "today",
        "Chrome OS",
        "30%",
        "MediaTek",
        "eight",
        "Ringaling",
        "120",
        "CR 48",
        "Matt",
        "600 bucks",
        "CPU",
        "Enterprise Lenovo 9000",
        "Chromebook",
        "3090",
        "Chromebooks",
        "1500 bucks",
        "100%",
        "3060",
        "Eight",
        "Hertz",
        "Austin",
        "half",
        "3,000",
        "Samsung",
        "Chrome",
        "400",
        "June 15th, 2011",
        "$200 Chromebooks",
        "Valve",
        "first",
        "Nvidia",
        "Mac",
        "200 bucks",
        "Intel",
        "the Steam Deck",
        "Valve",
        "tomorrow",
        "16",
        "Linux",
        "A thousand bucks",
        "a ton",
        "HP Elite C",
        "11th",
        "700 ish dollar"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "PRODUCT",
        "LOC",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "NORP",
        "ORDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "MONEY"
    ]
}