{
    "id": "7DJpx_lXftc",
    "title": "Should You Buy the Ryzen 7 3700X for Gaming?",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2019-07-07T13:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=7DJpx_lXftc",
    "category": "Education",
    "tags": [
        "ryzen 7 3700X",
        "AMD Zen 2 launch",
        "ryzen 2700x",
        "3700X for gaming",
        "3700X vs 9900K",
        "zen 2",
        "3700X benchmarks",
        "3700X launch",
        "should you buy",
        "ryzen 7",
        "3700X review",
        "science",
        "studio",
        "computer",
        "technology",
        "3900X",
        "3700X FPS",
        "3700X GTAV",
        "3700X Fortnite",
        "9900K",
        "intel vs amd",
        "ryzen 3000",
        "zen 2 release date"
    ],
    "views": 888085,
    "likes": 18927,
    "comments_count": 1929,
    "description": "AMD's Zen 2 launch is here! In this video, we assess the viability of the 3700X for gamers in light of Intel's current 9900K \"king.\" Three CPUs are compared: the 2700X, 3700X, and 9900K. My decision to forego the 9700K's inclusion was a direct result of the 3700X's performance (which exceeded my expectations).   Check out the CPUs tested below on Amazon: AMD Ryzen 7 3700X:  Intel Core i9 9900K:  AMD Ryzen 7 2700X:   Other gear tested in this video on Amazon: Gigabyte X570 Aorus Master:  (Newegg) G.Skill TridentZ RGB DDR4:  NZXT Kraken X62 AIO:  Corsair MP600 NVMe 2TB:  be quiet! Straight Power 11:  Lian Li PC-O11 Dynamic:    Become a channel member:    Our Amazon storefront:    Our studio gear on Amazon: Sony A7 III (Primary):  Sony A7S II (Secondary):  2x Pixio PX275h IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Tribesigns L-Shaped Computer Desks:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our Reddit community:    Join our public Discord server with Tech YES City:   Subscribe to our channel!  DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our CJ account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #Ryzen #3700X",
    "description_links": [
        "http://geni.us/oZbJ",
        "http://geni.us/Dely4zf",
        "http://geni.us/c6wTc",
        "https://bit.ly/2XvmxeQ",
        "http://geni.us/oZPg8",
        "http://geni.us/EQ8zyY",
        "http://geni.us/XD5xDg9",
        "http://geni.us/7QSFmE",
        "http://geni.us/AvyNTpM",
        "https://bit.ly/2JsHRqO",
        "https://amzn.to/2PMpWPa",
        "http://geni.us/VNQk",
        "http://geni.us/nGAGx",
        "http://geni.us/MJISRP0",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/ZMHUcU",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/ShiftyStudioYT",
        "http://www.facebook.com/ScienceStudioYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://www.reddit.com/r/sciencestudioyt",
        "https://discord.gg/k9shr9v"
    ],
    "transcript": "You came here for the gaming benchmarks. You could have just navd to a few websites and checked graphs, but you decided to click on this video and I appreciate that. So were gonna jump straight into it. In this video, the Ryzen 7 3700X was put through the ringer in a couple of different formats. First, a stock configuration bundled with Gigabytes X570 Aorus Master. This was the motherboard used for our 2700X as well. A separate video will be uploaded within the week pertaining to our X470 testing, and then another for a few B350 and 450 boards with supporting UEFIs. The second config for the 3700X included a manual overclock. How far could I go? Well you might be a bit disappointed at least with my sample. Seems I didnt win the silicon lottery. 4.3GHz at 1.41 volts, a turbo-locked load line calibration and aggressive VRM preset. Not much more I could do here, and 4.4GHz wasnt gonna happen. But who knows? You might get lucky! And Im sure other reviewers had different albeit similar outcomes. The same XMP profile was configured for every tested CPU you see in this video thats the 2700X, 3700X, and 9900K. 3.6GHz for our 16GB kit of dual channel TridentZ DDR4 from G.Skill. This should be a sufficient combination of high frequency and low CAS to benefit Infinity Fabric latency dependencies as they pertain to both our 2700X and 3700X, although the implementations are different due to the shift in architecture and SoC layout. Our graphics card of choice: Nvidias RTX 2080. This particular variant is from ASUS and it was reviewed in this video right here. The boot drive utilized was a 2TB MP600 from Corsair which is PCIe 4 compatible. The operating system was reinstalled for each CPU swap to eliminate software and driver conflicts. And all games were loaded from a 2TB WD Blue hard drive. Alright. With all of that out of the way, lets dive into the benchmarks. Here are a couple of synthetic tests for a frame of reference, first. In Cinebench R20, our 2700X faired single and multi-core scores at stock of 433 and 4097, respectively. Not bad. This is with Core Performance Boost enabled, which effectively allows these CPUs to reach rated boost speeds out of the box without violating power limits. Disabling this would be the near-equivalent of disabling Turbo Boost in Intel CPUs. With a manual 4.2GHz overclock, our single core dropped slightly (a phenomenon we explained in a previous video. Well put the card here). However, our multi-core rose to 4223. The 3700X radically improved things across the board. At stock, things jumped by 61 points to almost 500 and, when overclocked, a score of nearly 5000 was achieved. The 9900K, the previous single core champ, retains its lead but only slightly at 509. This is with multi-core enhancement disabled, by the way. Our manual overclock to 5GHz across all 8 cores picked things up just a bit, but it is worth nothing that the 3700X comes awfully close to matching Intels Core i9. Geekbench 4 was the other synthetic I wanted to run before games. Here, a similar result holds. The Core i9 was a bit faster overall in the single core test, but the gap AMDs narrowed here with this launch is definitely worth nothing. In 3DMark Time Spy, the 2700Xs CPU score came back at 8584 at stock, 8857 when overclocked. A similar margin was observed for the 3700X, albeit with higher scores overall. Interestingly enough, the 9900K scored lower at stock than the 3700X in this test after averaging three runs. This flip-flopped in our overclocked scenarios with the 9900K squeaking out a nearly 300 point lead. Had our 3700X been a better overclocker, I imagine the red team would have taken this one. Grand Theft Auto V, while optimized fairly well, has always been a bit Intel-biased however, the tides have definitely turned with this latest launch. The 3700X averaged 147 FPS at stock, only 12 FPS lower than the 9900K. Considering this titles inherent preference for the later, Id say this is a pretty darn good result. Frame times indicate similar degrees of micro-stutter. One thing Id call odd is the fact that this game performed significantly better overall at stock in the case of the 3700X. Our lowest 0.1% of frames averaged 13 FPS lower when overclocked, suggesting heavy use of one or two cores. Under such situations, the chips max boost clock of 4.4GHz would come in handy. Our testing confirms that it rarely hits this frequency, but the smoothness of this title at stock is undeniable. Shadow of the Tomb Raider yielded interesting results. The 3700X came out on top overall, but struggled slightly under harsher loads, hence the slightly lower 95% averages. Ultimately, side by side, itd be impossible to tell these two apart and thats a good thing because the 3700X is significantly cheaper than the 9900K and significantly BETTER than the 2700X in this particular title. Resident Evil 2 is next. Here, without a doubt, AMD CPUs take the cake. In fact, I averaged higher frame rates with the 2700X than I did with the 9900K. This is running through the exact same checkpoints in the game. At stock, the 9900K really struggled by comparison although I doubt anyones gonna complain about a 200 FPS average. Overclocked scenarios, by the way, faired better across the board in the Balanced preset. Now another game I like to test because it struggles constantly with optimization parameters is PUBG. 1% and 0.1% lows tank hard here and seeing just how hard they tank can tell us a lot about how these CPUs handle adverse situations. The 2700X undoubtedly struggled a lot. Jumping from 170 FPS down to a mere 24 is a tough pill to swallow, but it isnt like our other CPUs faired much better. Intel won on the lower end with dips that werent as steep overall, but the 3700X kept up and nearly matched the blue team for the overall average and lowest 1% of frames. Basically, what this graph tells us is that all three chips had infrequent stuttering issues. The 9900K just didnt stutter as hard for as long. Is this a deal breaker if youre a PUBG junkie? In my book: no. I tested Fortnite to appease the younger audience. I absolutely hate this game and only play it for the purposes of benchmarking, so youll have to excuse my slow mechanics. I landed on top of the same building every time and ran the same route. I also tried to sync up the time of day in-game. On average, the 9900K edged out a victory, but again, only by a few FPS. This trend continues to the lowest 0.1% of frames, so I highly doubt anyone would be able to distinguish the two here even with frames being drawn on-screen. I should also note that our 2700X faired well here and suffered only slightly among the lowest 0.1% of frames when manually overclocked so if youre a huge Fortnite fan and are into streaming or the like, the 2700X at a deep discount may be worth considering over these more expensive processors. Just food for thought. Witcher 3 tends to be more graphically intensive than anything else with a few exceptions, and our narrower margins reflect this. Every CPU faired well in the high preset. The 9900K came out on top by around 7-10 FPS, but this is nothing to flip out about when were in the 200 FPS range. Perhaps more importantly the lowest 1% and 0.1% of frames. The 3700X nearly matched the 9900K for the lowest 1% and fell just shy among the lowest 0.1%. Visually, youd be hard-pressed to discern the two. F1 2017, though a couple of years old by this point, still exhibits a solid balance between multi-core and single-core optimization. The 3700X averaged between 175 and 177 FPS on average compared to 190 and 193 for the 9900K, although the former absolutely crushed the latter among the lowest 0.1% of frames. Im not entirely sure what went wrong here, but this occurred several times with no outliers, hence why its being included here. Universe Sandbox 2s Earth and Sphere of Moons simulation wrecks pretty much anything we throw at it and the case is no different here. The 9900K averaged 71 FPS when overclocked but dipped to an average of 18 FPS for the lowest 0.1% of frames. The 3700X had a lower overall average, but struggled to the same extent under the worst conditions namely when the moons orbiting Earth first collide. You can see how sharp the differences are in our frame times graphs. Obviously, this was the most intense section of the benchmark. The higher these plots, the longer each frame took to render. \\ Lastly, Ashes of the Singularitys CPU benchmark reveals just how big a difference frequency can make. 59 vs. 48 might seem small on paper, but Id be willing to bet most of you could see the difference on-screen. The 9900K took this one with ease but lets be real: how many of you actually play Ashes of the Singularity? So thats that. These were the games I tested. And the conclusion Ive come to is: WOW. AMDs done a heck of a job with the 3700X. Power draw is incredibly low. Package power topped out at around 100W and I was reading around 6-7 Amps under full load across the clamp meter. This is a 65W TDP chip, after all. The 7nm lithography works wonders for temperatures as well. While gaming, this thing remained under 70 degrees Celsius with our Kraken 62 after heat soak and idled well under 40C. The only thing I can really complain about here is the overclocking potential. I talked to a few other reviewers prior to launch and most of them expressed similar disdain with this. Had we gotten to 4.6 or 4.7GHz across all 8 cores, Id expect the 3700X to slay the 9900K in nearly everything. As of right now, however, weve got one heck of an octa-core CPU for a little over $300 USD. Thatll save you over $100 when foregoing the 9900K a CPU that only barely squeaks out leads in-game if at all. Going forward, its going to be very difficult to recommend Intels 14nm stuff. The presence of an iGP is definitely a plus for a few niche circumstances which well explain in our productivity benchmark video, but for a majority of you who game, stream, and content create with a discrete GPU, the 3700X is an incredible value. Its honestly what Intel SHOULD have priced their latest 8 core CPUs at. But unlike AMD, whove been giving us significant upgrades and additional cores and similar prices, Intels charged MORE for its new 8-core chips and the reality of it is unless they lower these SKUs to levels that directly compete with AMDs 7nm 8 core counterparts, gamers should almost EXCLUSIVELY consider Zen 2. Thank you all for watching. If you enjoyed this one, click that like button. And by the way, stay tuned for subsequent Ryzen coverage coming in the next few days. Weve got several videos lined up and were gonna space them out by a day or two apiece to avoid cluttering your feeds and directly competing with dozens of others releasing similar content. With that, click that red subscribe button, become a channel member, and Ill catch you in the next one. This is Science Studio. Thanks for learning with us.",
    "transcript_keywords": [
        "FPS",
        "CPU",
        "Core",
        "CPUs",
        "lowest",
        "stock",
        "frames",
        "FPS lower",
        "single core",
        "overclocked",
        "video",
        "similar",
        "lower",
        "frame",
        "cores",
        "core CPUs",
        "average",
        "game",
        "Intel CPUs",
        "Core Performance Boost"
    ],
    "transcript_entity_values": [
        "3DMark Time Spy",
        "three",
        "Corsair",
        "95%",
        "4.4GHz",
        "VRM",
        "iGP",
        "G.Skill",
        "Science Studio",
        "two",
        "Intels Core",
        "4223",
        "second",
        "2080",
        "70 degrees Celsius",
        "8",
        "Ryzen",
        "1%",
        "Kraken 62",
        "Intel",
        "GB",
        "The 9900K",
        "24",
        "8584",
        "Shadow",
        "Core Performance Boost",
        "4.3GHz",
        "61",
        "almost 500",
        "433",
        "B350",
        "Infinity Fabric",
        "4",
        "TB",
        "CAS",
        "193",
        "18 FPS",
        "3",
        "the next few days",
        "2017",
        "a little over $300 USD",
        "7",
        "4.2GHz",
        "one",
        "nearly 5000",
        "4.7GHz",
        "177",
        "8857",
        "Nvidias",
        "1.41 volts",
        "170",
        "9900K. 3.6GHz",
        "first",
        "59",
        "Earth",
        "dozens",
        "Zen 2",
        "4.6",
        "SoC",
        "Balanced",
        "Core",
        "Fortnite",
        "Singularitys CPU",
        "AMD",
        "R20",
        "nearly 300",
        "5GHz",
        "3700X",
        "7-10",
        "190",
        "only 12",
        "2700X",
        "around 100W",
        "XMP",
        "First",
        "AMD",
        "4097",
        "65W",
        "Grand Theft Auto V",
        "16",
        "TDP",
        "3700X",
        "FPS",
        "day",
        "Gigabytes X570",
        "the 9900K",
        "200",
        "48",
        "One",
        "1% and 0.1%",
        "14",
        "the week",
        "a couple of years old",
        "CPU",
        "2",
        "Intels",
        "509",
        "13",
        "GPU",
        "71",
        "450",
        "ASUS",
        "WD Blue",
        "Witcher",
        "2",
        "over $100",
        "between 175",
        "0.1%",
        "Turbo Boost"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "LAW",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "ORG"
    ]
}