{
    "id": "7Elgs5HzIbE",
    "title": "These Chips Are Better Than CPUs (ASICs and FPGAs)",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-02-25T20:13:40Z",
    "video_url": "https://www.youtube.com/watch?v=7Elgs5HzIbE",
    "category": "Science & Technology",
    "tags": [],
    "views": 502397,
    "likes": 24398,
    "comments_count": 580,
    "description": "Answer your emails faster, in the appropriate tone, and with confidence with Grammarly! Go to  to sign up for a FREE account and get 20% off Premium!   Learn about ASICs and FPGAs, and why they're often more powerful than regular processors.  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://grammarly.com/TechQuickie",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- Modern CPUs are awesome. You can play games, create content, and even watch tech explainer videos with handsome hosts... I guess it was supposed to be someone else. On the same machine. But as great as this versatility is, there are times when you'd really rather have a chip that can do just one thing but do it really, really well. Now, there are lots of electronics that contain chips called ASICs or FPGAs instead of regular CPUs, and we're gonna explain what these are one at a time, starting with ASICs. Not to be confused with the shoe company, ASIC stands for application-specific integrated circuit, and it does exactly what it sounds like: processes data for one application. This is because ASICs are built very differently from your typical x86 or ARM or RISC-V general processor. A regular processor can apply many different kinds of calculations depending on what a program needs, but ASICs are hardwired to perform only the calculations or to run only the algorithms that are needed for a specific task. This hardwiring can happen in a couple of ways. Some ASICs are manufactured in what's called a semi-custom manner where the fab has what's essentially a blank template of logic gates which are then permanently connected according to the design the client needs. Meanwhile, other ASICs are full-custom designs where the entire chip and every transistor is pretty much designed from scratch. Unsurprisingly, because ASICs are so specialized, they take a lot of time and money to develop. But because ASICs are usually for small, highly integrated devices that ship lots of units, the cost of an individual ASIC tends to be quite low. For example, the chips inside USB chargers or network switches or even electronic toys are often ASICs, but all of these are often low-cost products. Network switches are a particularly interesting application since a simple $15 unmanaged switch can handle network traffic better than a desktop CPU that costs 10 times as much. But of course there's a good chance you've heard of ASIC-based crypto miners designed to run cryptographic hashes much more efficiently than a graphics card can, and those are quite expensive due to both demand and the fact that they aren't as mass-produced as other ASIC-based devices. And, of course, there's the fact that they make you money. We'll tell you about the other kind of chip we're discussing today, the FPGA, right after we thank Grammarly for sponsoring this video. - Thanks to Grammarly for sponsoring this video. Communications through online email, Slack, or Discord can be easily misinterpreted and it can become a huge time block. This is why all working professionals need a tool like Grammarly. There's also Grammarly Premium which provides more in-depth feedback on your writing so you can really learn. We recommend checking out the Tone Transformation and Clarity tools. Oh boy, I could use that. I'm a jerk. They help you by rewording phrases to make you sound more confident and by removing unnecessary jargon to help you get your point across clearer, more clearerly. Work smarter, not harder. Go to grammarly.com/techlinked to sign up for a free account and get 20% off Grammarly Premium today. - Let's switch gears right now and talk about FPGAs, or field-programmable gate arrays. How are those different? You can think of these as sitting somewhere between an ASIC and a CPU. Their logic can be customized for specific applications, but unlike ASICs, they can actually be electrically reprogrammed after they've been manufactured. You can think of the structure of an FPGA as being kind of like Lego blocks. Once you put them together, they'll stay that way, but you can always take them apart and put them back together and make something completely different. Now, although FPGAs aren't quite as powerful as purpose-built ASICs, their versatility has made them increasingly popular for machine learning applications as they can be optimized for different AI model and neural networks yet still outperform traditional CPUs and even GPUs. But perhaps even more interesting is that you can reconstruct other kinds of processors inside an FPGA, including the ones from, say for example, retro game consoles. There have been some really cool projects that use an FPGA to recreate the retro gaming experience as faithfully as possible, such as the Nt Mini and the Mega Sg from Analogue. The FPGAs inside those consoles contain circuitry that very closely mimics the original NES and Sega Genesis processors respectively, meaning that it's a much smoother and more accurate experience than software emulation like what gets used by those classic plug-and-play consoles that have gained popularity recently. Another really awesome FPGA project is the MiSTer, another gaming device that actually allows you to choose between different old-school consoles and arcade games, then reprogram the FPGA on the fly according to what you want to play. It's kinda like a Transformer, but on the inside, like that time I washed down a Mentos with a bottle of Pepsi. Oh, subscribe. That's the end.",
    "transcript_keywords": [
        "ASICs",
        "FPGA",
        "Grammarly",
        "Grammarly Premium",
        "FPGAs",
        "Modern CPUs",
        "ASIC",
        "time",
        "CPUs",
        "Grammarly Premium today",
        "inside",
        "consoles",
        "chips called ASICs",
        "chip",
        "kind",
        "network",
        "ARM or RISCV",
        "CPU",
        "make",
        "Modern"
    ],
    "transcript_entity_values": [
        "NES",
        "Sega Genesis",
        "the Nt Mini",
        "Grammarly Premium",
        "Slack",
        "one",
        "20%",
        "USB",
        "FPGA",
        "ASICs",
        "ASICs",
        "15",
        "AI",
        "Grammarly",
        "Transformer",
        "the Tone Transformation and Clarity",
        "Pepsi",
        "Discord",
        "10",
        "ASIC",
        "the Mega Sg",
        "Mentos",
        "Analogue",
        "CPU",
        "today",
        "Lego",
        "FPGA"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "LAW",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG"
    ]
}