{
    "id": "7GwWK-njnz8",
    "title": "Laptop Keyboards are changed FOREVER",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-04-15T16:49:30Z",
    "video_url": "https://www.youtube.com/watch?v=7GwWK-njnz8",
    "category": "Science & Technology",
    "tags": [
        "aorus",
        "aorus 15g",
        "intel 10th gen",
        "rtx super",
        "rtx 2070",
        "rtx 2070 super",
        "nvidia",
        "intel",
        "gigabyte",
        "omron",
        "mechanical keyboard",
        "laptop",
        "gaming laptop",
        "rtx",
        "10th gen",
        "core i7",
        "cpu",
        "graphics",
        "gpu",
        "tech",
        "unboxing",
        "keyboard",
        "gaming",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 940143,
    "likes": 26954,
    "comments_count": 1964,
    "description": "The AORUS 15G with Intel 10th gen and RTX Super is a lot...but that keyboard.  Why AMD has suddenly gotten VERY good  The new episode of BROKE vs Pro   My new podcast The Test Drivers!  Our second channel @thisis !  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/Y4hV_OksQM8",
        "https://youtu.be/-naamtpQ8lw",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- This is the Aorus 15G gaming laptop. And well, yes! It has the brand new Intel 10th generation chips, as well as the RTX 2070 Super graphics. What I'm really excited about is what possibly could be the greatest keyboard ever put on a gaming laptop. Really the highlight here is absolutely this custom OMRON mechanical keyboard. And of course, gaming PCs have been taking advantage of mechanical keyboards for very long time. However, this is the very first time that I've actually seen a mechanical keyboard in a laptop. And it is something special. With 2.5 millimeters of key travel. While it is not quite as deep of a throw as what you would get with a standard mechanical keyboard, you get all of that tactile feel. So there's sort of a progressive click down and then you actually hear the spring compress and you do get the keystroke. It means that not only do the keys pop up faster, but well I mean, come on. If you ever used a mechanical keyboard, you know the advantages. To take a closer look, I decided to pop off a key and give you a little bit of an inside look at what the key switch looks like. All I can confirm is there is a little spring as well as, of course, a little plastic mechanism as well as something to kinda give you a nice clear RGB look. But the downside is, is that... I broke the switch. So if you would like to confirm, that your laptop has a mechanical switch, I would recommend, don't touch it. Don't try to take out the key cap, it's fine. Of course, there's more to this laptop than just the excellent mechanical keyboard. As this is the very first laptop I've had in the studio with the brand new 10th generation Intel Core H processors. Now in Intel parlance H series means that this is their sort of, high end gaming laptop variety SKUs. And it's a little different. So unlike 10th generation on something like the XPS 13 that I daily every day, which is a much lower wattage part. This is actually a continuation of the 9th generation which means that it is similar, I suppose. It is very, very similar because it's still based on that older Skylake architecture. Now running it through benchmarks, it is a clear step up. And this is the first time they brought eight cores to an i7, which means that this is actually roughly on par with last generation's Core i9. What is not is a major step forward. And it really does need to be a major step forward, because when you look at it side by side with the Zephyrus G14, which I've recently done a video on, which of course is powered by the brand new Ryzen Mobile 4000 series. It's not a particularly fair fight. Now when you put these two side by side, while of course they do compete in different weight classes, this is a thinner 14 inch laptop versus a much thicker 15 inch design. But one of the most important things here is just to see how far the AMD has pushed the envelope on the Zen side of things. So if I fire up Cinebench on both laptops, what you'll see is that while yes, Intel does have a single thread advantage. They can push up to 4.7 gigahertz. Pretty much sustained on this design. When you load up both systems with a very heavy eight core workload, what you'll find is that right now the Aorus is sitting at... I did it again! With my Windows fixed, which you can see. This guy sits at around 3.4 gigahertz on all eight cores with a quite loud fan, because it needs a lot of power to hit that. Whereas this guy is chilling at 3.7 gigahertz with no stress. A lot of that does come down to the fact that AMD are of course using a more advanced seven nanometer process on the Zephyrus as well as well specifically with the 4000 series of Ryzen. And there's also the fact that this Ryzen 4000 series is taking advantage of the Zen 2 core. Which not to get too far into nerd town, but it's simply a higher performing core right? The IPC is much much more powerful than the Skylake base of the 10th generation Core H processor. With all that being said, this is a step up. It is certainly a more powerful laptop and has certainly a more powerful 10th Gen chip than we had last time around. And if it was in a vacuum, it would be great. Unfortunately, it's not in a vacuum and AMD is absolutely caught up in a big way. Feel free to check out my video on the Zephyrus, if you wanna know more about it. But this really does put things into perspective. It is very, very fast. However even 10th Gen isn't the only brand new thing with this Gigabyte laptop. As we also have the brand new NVIDIA RTX Super graphics on board. And specifically, this is taking advantage of NVIDIA GeForce RTX 2070 Super Max-Q graphics, which I feel like NVIDIA took a page outta Samsung's book on that one. But essentially, this is a super version of the current RTX 2070 cards. But the main thing to keep in mind is that just with the original launch of the RTX series for laptops, you can't just look at the label right? Just because this has a 2070 Super Max-Q, it doesn't mean that you have a guaranteed level of performance. Cause it could be running at 85, 115 watts or anywhere in the middle. And of course this is nothing revolutionary, right? I mean, obviously you need solid cooling and a good system to support the chips that you have inside. However with these RTX chips, and of course, the super being even more powerful, it means that you're going to expect to see pretty wide variances and the performance of one 2070 Super laptop over another. Now all that being said, Aorus have actually done a very good job with this system. As the 2070 Super inside actually boosts to, at least in benchmarks, above 2080 Max-Q spec. Which technically it shouldn't, but I believe this is probably running on the higher end of that TDP. Regardless though, it's just one of those things where yes, the super chips are more powerful, but it's not a huge difference. But you should really pay attention to each individual laptop. Don't just look at it and say, \"Oh, it has the same i7 and 2070 inside. When the actual results and the actual performance may be very different. Also, a side note about the Aorus specific tuning with this laptop. They're taking advantage of the Microsoft Azure Cloud AI, which to be completely honest with you, I don't know exactly how much the cloud component of this really makes a difference. However, if you right click on this little gaming and professional icon here and turn on the learning, you actually see a significant performance boost. Now essentially what this is doing, is this is dynamically adjusting not at the power but also the cooling, between your CPU and your GPU. So for example, if you're not maximizing your processor, then actually it may allocate a little bit of that juice over to your graphics card, or vice versa. And while it doesn't make a huge difference on the processor performance, I've actually seen a pretty noticeable gain in the graphics by turning that on. And it has the side benefit of giving you the ability to not really have to worry about switching in and out of like different power modes, like going up to performance or battery saving or whatever, as it should pretty much handle everything by itself. And that's actually ultimately very important. Because if for example, I turn the fan up to the maximum mode, you can hear that it is incredibly, incredibly loud. Like so loud to the point where, yes, this technically should be faster. But when you actually turn on the AI mode, the fan runs slower and it's more powerful. I'm turning that off. That's just obscenely loud. Of course there's a whole lot more to talk about what the Aorus besides just the spec inside, as it has a really solid 240 hertz panel. However that's just become like, 'Oh yeah, you know gaming laptops with 240 hertz'. And of course it's a 15.6 inch display, and it is 1080p. What you're getting here, is honestly a fairly well calibrated display. So they are really proud of the fact that not only is it Pantone Validated, but each individual laptop is color calibrated at the factory. So of course for the 240 hertz display, I have to try to actually game at that resolution. So we're going to give CS GO a try, which is of course running at full max out 1080p settings. We could lower it a little bit if we want. Right now we're getting 170 FPS. Oh that is very smooth. One of the things about these super high refresh rate displays, is not only just the fact that they run at a high frame rate, but oftentimes they have very low latency and they have very little ghosting, right? So as I move back and forth, obviously you can't see this because it's YouTube video, but it looks very clear and smooth. Okay, well, I die the same. Of course. Yeah, we're staying pretty consistent at 183 FPS. Let me actually turn some settings down a little bit and see if I can get us to a locked 240. I'm gonna stay with pretty much everything turned down at 1080p. Oh! Okay. By turning all my settings down, I just crashed my game. Cool! That, that's fine. I'm not... I will say it's actually kinda hard to hit 240. I guess maybe I could turn the resolution down. But the thing is, I have 180 frames per second. So I don't really care. This is a really nice gaming experience though. It is so smooth. And that mechanical keyboard really does add to the experience, right? I mean, obviously with a gaming laptop, you never really expect to have like the greatest experience in the world with a keyboard and oftentimes you may even plug in a mechanical keyboard yourself. But having that built in, actually does make a big difference. Next up, we have a modern game which is truly cutting edge and demanding on all hardware. And that is F1 2019. I'm a liar. That's actually not that difficult to run, but you know what it is? It's this game I've been playing a lot lately. So I'm gonna try it here. I wanna see how close I can get to 240. So it should be a surprise to no one that this is also a game which really can take advantage of that super high refresh rate display. I might lock the brakes up a little bit but importantly the thing what we're seeing here is 125, 130 frames per second. And mind you this is like ultra settings at 1080p, right? Like I could certainly get more frames if I wanted to, but I don't really need to. What I do need is something which is not a controller to drive right now cause I feel like I have no consistency whatsoever here. Woow! No! No! No! (laugh) Gigabyte and Aorus are very proud of the design of this laptop, which is all new for this generation. And I'll give them some credit. It is actually a quite nice looking design. I particularly appreciate the aluminum. However there are some, well certainly some trade offs. So with this larger design, comes a fairly large selection of ports, which is absolutely a good thing. So not only do we have the ability to support up to three 4k displays, using HDMI, Mini DisplayPort and Thunderbolt 3. And side note, I always like to see Thunderbolt 3 on any laptop. But in specifically something like this, is it actually can be used as a fairly creator focused system. You have the SSDs you have the RAM, you have the display which to be fair, even though it's color calibrate, isn't super high resolution. But I mean, you even have things like an SD card slot which is really nice. The downside here though really certainly is just in the actual size of the system. 15 inch laptops are fine, but I am definitely someone who really values something which is nice and portable. I don't wanna have to carry around something which is super big, thick and heavy all day long. It's what she said. But the Aorus does a good job of sort of, straddling the middle. It's also what she... The Aorus does have a good blend of features though, including a fingerprint sensor built in, as well as a tiny webcam with a cover. Now I like the idea of a webcam cover built in, but I don't like is the positioning of this one. So if the webcam was in a normal place. This is where I would be looking. Instead, this is where the webcam is, right in front of the keyboard. So while yes, this certainly is better than the complete lack of a webcam on the Zephyrus G14, but beyond that, I mean, yeah, I like being able to just close this little flap, open it up and protect my privacy I guess. I just... Look man, I'll take a slightly larger bezel on the top. If it means that I don't have to look up my nose every time I'm on the webcam. I absolutely love this mechanical keyboard. Once you go mechanical, it is very hard to go back. And now that I've experienced mechanical laptop keyboards, it is going to be really, really tough to get used to anything else. Beyond that, though, the Aorus 15G is a solid package. Those RTX super graphics are a nice step forward. And while, the Intel 10th Gen chips are better, I still would like to see more there. I feel like we're in a very interesting time where there's some legitimate competition in the gaming laptop space, which is something we haven't really seen in quite a while. So I'm curious, would you buy a mechanical keyboard in your next gaming laptop? Let me know in the comments below. Absolutely make sure to subscribe for more videos like this. And until next time, I'm going to continue to try to fix the key that I broke. That was unfortunate.",
    "transcript_keywords": [
        "mechanical keyboard",
        "laptop",
        "Super",
        "mechanical",
        "gaming laptop",
        "keyboard",
        "RTX Super graphics",
        "Aorus",
        "RTX",
        "mechanical laptop keyboards",
        "NVIDIA RTX Super",
        "RTX Super",
        "gaming",
        "OMRON mechanical keyboard",
        "Super graphics",
        "Core",
        "Intel",
        "side",
        "super high",
        "generation"
    ],
    "transcript_entity_values": [
        "3.7 gigahertz",
        "Zephyrus",
        "240",
        "15",
        "14 inch",
        "CS",
        "Mini DisplayPort",
        "a little spring",
        "Ryzen Mobile",
        "2",
        "4000",
        "AMD",
        "Gigabyte",
        "130",
        "2070",
        "15 inch",
        "2019",
        "OMRON",
        "around 3.4 gigahertz",
        "up to three 4k",
        "Skylake",
        "Aorus 15",
        "Zen",
        "first",
        "IPC",
        "85",
        "eight",
        "10th",
        "Core H",
        "Samsung",
        "hertz",
        "RGB",
        "Intel Core H",
        "two",
        "AMD",
        "170",
        "HDMI",
        "all eight",
        "125",
        "2.5 millimeters",
        "183",
        "one",
        "1080p",
        "9th",
        "Max",
        "NVIDIA GeForce",
        "Aorus",
        "second",
        "the Microsoft Azure Cloud AI",
        "all day long",
        "15.6 inch",
        "Intel",
        "Super Max-Q",
        "CPU",
        "SD",
        "10th Gen",
        "TDP",
        "webcam",
        "Ryzen",
        "Cinebench",
        "4.7 gigahertz",
        "115 watts",
        "seven nanometer",
        "180",
        "Aorus",
        "One",
        "the Zephyrus G14",
        "NVIDIA",
        "2080",
        "GPU",
        "Skylake",
        "Gigabyte",
        "2070",
        "3"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "LAW",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}