{
    "id": "7H0IcioQYPk",
    "title": "LG Overclocked Their TVs to Compete - LG G2",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-02T18:56:19Z",
    "video_url": "https://www.youtube.com/watch?v=7H0IcioQYPk",
    "category": "Science & Technology",
    "tags": [
        "LG",
        "Samsung",
        "G2",
        "G1",
        "TV",
        "OLED",
        "WOLED",
        "QD OLED",
        "Quantum Dot",
        "Brightness Booster",
        "LG Display",
        "C2",
        "C1",
        "S95B"
    ],
    "views": 1728331,
    "likes": 52766,
    "comments_count": 2086,
    "description": "Go to  to get $5 off your first purchase and get Dad something nice this Father's Day  Check out the new AMD Radeon RX 6000 series graphics cards at   LGs G2 is out and its brighter than ever, but is it worth buying over last years G1 or this years onslaught of QD OLED? Is the Brightness Booster enough to keep WOLED in the fight?  Discuss on the forum:   Buy an LG G2:   Buy an LG G1:   Buy an LG C2:   Buy an LG C1:   Buy a Samsung S95B:   Buy a Sony A95K:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:00 Brightness 2:29 G1 vs G2 4:35 Testing 5:34 Samsung vs LG 8:45 How Do I Decide? 9:55 Burn In 12:49 Conclusion 15:01 Outro",
    "description_links": [
        "https://privacy.com/linus",
        "https://www.amd.com/en/graphics/radeon-rx-graphics",
        "https://linustechtips.com/topic/1434861-lg-overclocked-their-tvs-to-compete/",
        "https://geni.us/caIM4S",
        "https://geni.us/5VRtlIk",
        "https://geni.us/7ZMOl",
        "https://geni.us/RErbYbt",
        "https://geni.us/0frt",
        "https://lmg.gg/w1Imn",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(blows whistle) - It's a play we've seen many times over the years. Your competitor catches you completely by surprise with a vastly superior product. There's no time to develop something new so you reach for the nearest heat sink, slap it on the back and overclock this snot out of it. That's essentially what LG's done here. By adding an aluminum heat sink layer to the second gen OLED panel technology we saw them introduced last year, they claim they've managed to boost up peak brightness by up to 30%. It's actually not a bad move. OLEDs biggest problem is its low brightness, but is it enough to win a place in the family room of my new house? I guess it doesn't really matter unless I can pay for it somehow. With this money from our sponsor! - AMD. With features like the new Fidelity FX super resolution 2.0 or Radeon super resolution, you can take your gaming performance to another level, especially when paired with their new Radeon RX 6,000 series graphics cards. Learn more at the link down in the video description. - The brighter you run an OLED panel, the better the HDR experience. But this also comes with a downside: heat and the hotter the panel gets, the faster the diodes burn out. So LG is under pressure from two sides. They have to push brightness up in order to compete, but if they fly too close to the sun, they're gonna get burned... in. Get it? 'Cause customers are gonna return their TVs if they burn in. The brightness booster heat sink, as LG is calling it, appears to be an attempt to manage this heat in direct response to Samsung's much brighter QD OLED TVs and from our initial tests, it seems to work as expected. We weren't able to measure some of the 1000 plus nit claims that we've seen from other reviewers, but after finding and disabling the buried energy saving feature, we did manage to hit a respectable 930 nits in luminance stability testing, despite only hitting 880 nits in a 1% to 10% window. The problem though, is that while it's a good idea, it's not exactly a new idea. Sony's A90J OLED from last year features a similar approach and also still gets whomped by Samsung's new QD OLED lineup, which has a couple of other key advantages: much better color saturation from not needing a white sub pixel and much better efficiency, thanks to using quantum dots rather than color filters. Oh, and if you've been paying attention, you might already realize that better efficiency means that you can boost your OLEDs higher without them heating up as much, reducing the risk of burn in. We'll talk a bit more about that later, but first let's see how much LG has managed to improve over the last years flagship. Unfortunately it's pretty obvious which one is which because the bezel is so much skinnier on the... Wow, it's also a lot brighter. - [Cameraman] Right? - Huh, okay. Even, well I guess especially in a lit room, with all the studio lighting, that's very noticeable. Both of them support all the latest bells and whistles. G sync, auto low latency mode, variable refresh rate, HDMI 2.1, actually the G2 has two eARC ports which is kind of cool if you have multiple audio setups for whatever reason. But the main difference is immediately apparent sitting in front of them. The G2 is noticeably brighter. Similar color accuracy out of the box but the brighter you go, the more vibrant colors are perceived to be, at least all other things being equal. Are they both in filmmaker mode? - [Cameraman] Yeah, they should be. Well when they go to this, they're in theater home or something. The brightness does make a difference though. - Oh for sure. - [Cameraman] Yeah, yeah. - It makes it feel less like he's standing in a gray space and more like he's standing in overcast with the sun shining through the clouds. It really is, really is a very noticeable difference. Oh wow. - It's huge, you can see a ton of detail on this that just gets kind of lost here. Like if you pause it. - Oh yeah. - Yeah. - For sure, yeah, night and day. - But compared to the QD OLED, this is brown. It should be yellow and red. It's hard 'cause the glare from those studio lights. - And it doesn't have trouble hitting the highlights either. The highlights are brighter and the blacks are deeper and they're both Dolby Vision capable. LG has, I mean, it might not be elegant, but LG has certainly improved over last gen. I do wonder if part of this is LG just improving the color profile and then not doing it for the old one. - Maybe, maybe. - 'Cause that's really overcooked in terms of the blues. It doesn't change the end result. Whether it's software or hardware, it looks much better on the new set. As for out of the box color accuracy, our G2 in filmmaker mode got a respectable Delta E average of 3.6 in SDR and 7.2 in HDR without luminance errors. That's pretty good for a display that we got off the shelf at the local Visions and that doesn't come with a calibration report in the box. With that said, the S95BQD OLED from Samsung that we just reviewed beat it handily, both with and without their calibration app that only requires a newish smartphone to get a shockingly accurate picture. Oh and it comes in at $200 less than the G2. It sounds like you should just get the Samsung then, right? Well that's what we thought but when we took delivery of our G2, the visions rep mentioned that they've actually avoided putting the two models next to each other on the show floor because apparently compared to LG, the Samsung's blacks look downright gray but I haven't had a chance to look at them and confirm. That is, until now. Oh wow, I see it already. - The gray? - Holy crap, it's gray. - Yeah and when you turn off the lights, it looks black. But side by side, it does look super gray by comparison, right? Yeah, yeah, yeah. - Honestly, I don't even think it looks as good as Samsung's latest Quantum dot (indistinct). Is it just an anti-glare coating? - I don't know. - Because the glare is much less. So if you get the perfect blacks in the blackness and less glare, I wouldn't say it's a disadvantage. See what I thought when the Visions rep said, oh it looks gray by comparison, was that the pixels were not turning off enough. - Oh yeah, yeah, yeah. - But that's not what this is. This is, what I think it is, is a light reflecting and scattering anti-glare layer. - Turn the lights off. See now they're almost identical. It looks black on the bottom. - You know what else is almost identical? The performance of these two TVs to my bare eyes. If you told me that these are the same model of TV, I would believe that this was simply a batch to batch variant. - Yeah. - Now that particular movie, we're using the same HDR grade between the two, right? What if we pick something that supports Dolby Vision, does the LG have an advantage? - It might to the extent that Dolby vision will give you a wider range technically until HDR 10 plus is improved. The problem is we can't really do that with our splitter. - With our splitter. You know, I wonder if LG is juicing their greens a little bit. - It looks greener on this, right? Just a tiny but - To compensate for WOLED 'cause it does seem like a bit of an unnatural green. - Yeah, the LG looks just a little bit more Costco-y, but it's not necessarily a bad thing, right? Like it looks good. - It looks good. If I didn't see this next to it, I wouldn't pick it out as, oh they've just got the vibrancy cranked. Vivid mode, you know, it's not like that. - No, but in testing, I mean, this did do significantly better. We're talking really minor amounts, like if I looked at a 3.7 Delta E average and then I looked at a 2.7 Delta E average I'm probably not gonna be able tell difference. - And a lot of these differences could easily come down to filmmaker creative vision, as opposed to just this one is definitely more true to life because films are not necessarily graded in such a way that they are true to life anyway. But if this was the mood they were going for, this is a different mood. - Totally, this is more colorful, joyful and it's 1917, it's a war movie. So you kind of think that the Samsung with this not muted, but somber yeah, looks a lot more accurate or correct. I still like the Samsung more but they are almost identical. - I see why Visions didn't want them next to each other. - Right? - And it's not in a deceptive bad way, in a being fair to the Samsung way. Interesting. All other things being equal, choosing between these two is gonna be really tough. The speakers are decidedly better on the S95 B, but the remote and interface is as much better on the G2, while both of them have very similar input leg, in the neighborhood of 18 to 18 and a half milliseconds. There are some other bigger factors to consider though when choosing between OLED and QD OLED. Color fringing on text and burn in. Let's start with text. Because of the Pentile layout of the sub pixels on Samsung's new flagships, if you look closely enough, you can see some small amounts of color fringing when hard edges meet. Samsung actually responded to similar complaints when the AW3423DW QD OLED gaming monitor launched back in March. They said that this issue can also be found in LCDs and OLEDS using RGB Stripe on the right and left sides of high contrasting hard edges. But they said, because QD OLED has such a wide color gamut and superior contrast ratio (coughs) and pentile layout, it's easier to spot. They went on to say that this layout was chosen to optimize color gamut, brightness and durability, which brings us back to our image retention discussion. The panel type that LG has been marketing as OLED is actually WOLED or white OLED. It works by taking a blue emitter and coding it in a yellow phosphor to produce white light. That light is then punched through a color filter to produce the final image with the filter absorbing any unwanted light, reducing the brightness of the entire display in the process. The harder you drive the pixels, the more light can get through that filter, but the faster the panel will die because the organic material, the O in OLED? Well it decays. To increase perceived brightness while avoiding over driving their color pixels, LG uses a white sub pixel alongside the RGB, but it's not a perfect solution. Regularly watching TV or even playing video games is unlikely to damage your panel, thanks to technology like pixel shift and automatic static or screen brightness limit, or ASBL for short. The former shifts the image around by a few pixels every so often while the latter limits brightness on static elements so anything stationary doesn't get driven as hard, leaving a little outline for you. However, I have personally experienced temporary image retention using a 48 inch LGC 10 as my office monitor and Wendell from Level1Techs has experienced permanent burden on his. With QD OLED however, this may become a non-issue. Samsung's TV only has a basic warranty of one year, but Dell seems confident enough to give a three year warranty to this technology, as we saw on the A3423DW. This is thanks to Samsung's use of a blue self emitting layer and quantum dots. Since there's no color filter to pass through, we don't need a white sub pixel in order to boost brightness and bright colors are now achievable without driving the panel so hard. Quantum dots are crazy efficient when it comes to converting light from one color to another. Samsung is also able to monitor each of the three layers in QD OLED display, red, green, and blue and adjust the output accordingly to ensure that one layer doesn't wear out faster than the others. Is it perfect and is burn in a thing of the past? Probably not. Organic LEDs, in fact any LEDs, really do degrade over time. It's just that at least on paper, it should be much less noticeable now, especially since QD OLED is also taking advantage of pixel shift and pixel refresher technology like what we've got in the G2. Now that the lab is gearing up, we're excited to bring you guys long term burn in testing on OLED, QD OLED and all different kinds of panels but it's still gonna be a little while. So in the meantime, pick up a Wan hoodie and get subscribed on Floatplane for a ton of behind the scenes content that's not on YouTube, like Anthony's recent rant about trains. Gotta pay for the lab somehow. Back to these panels though, if in regular TV use, each of them is unlikely to end up with burn in, which one do you buy or more accurately, which one should I buy? I actually bought both of them so it's more like which one should I return and which one goes into my living room? I might end up returning both. LGS last gen G1 is nearly a thousand dollars less than either of these and if you have any semblance of light control in your room, it gets pretty darn bright. Furthermore, the next step down from the G2 in their current lineup, the C2 is only a few hundred bucks more than that last gen G1 and is supposedly so similar in performance to the G2 that LG only differentiates them by the onboard speakers on their website. I suspect there are other differences. If you want an even better bargain and you don't need that many nits in your mom's basement, at the time of filming a 65 inch C1 is just $1,600 with the C series also coming in a much wider range of sizes. That 42-incher is looking mighty tempting and I'll be checking it out for myself soon. We're gonna have links to where to buy all of these down below. To be clear, even budget OLED TVs are very expensive compared to a TCL LCD, but thanks to competition from Samsung and soon others, it seems like in the not too distant future, we will all be able to afford to move on from LCD. As for me, I've got one more that I've got my eyes on before I can make a final decision. Sony's QD OLED, the A95K. Then I'll be ready to make my move. Just like I'll be ready to make my move to tell you about our sponsor! - Privacy.com, lets you buy things online using virtual credit cards rather than your real ones. Father's day is coming up and the last thing you should have to worry about is getting your credit card information stolen online while you're shopping for a gift. If you're the victim of a fraudulent transaction, Privacy automatically declines it and notifies you immediately. You can set spend limits, pause and close cards at any time and there's no more jumping through customer service hoops in hopes of canceling or losing money on apps you never meant to spend on. Privacy.com also offers different plans for your goals, from cash back to teams plans. So head to Privacy.com/Linus and sign up for an account. You'll automatically get $5 to spend on your first purchase so you can get something a little extra nice for your dad. - If you enjoyed this video, check out our S95B coverage to get ready for the upcoming finale with the Sony TV. I can't wait. No, actually I can't wait. My family room doesn't have a TV in it. It's just a blank wall.",
    "transcript_keywords": [
        "OLED",
        "Samsung",
        "Yeah",
        "color",
        "brightness",
        "OLED panel",
        "Dolby Vision",
        "OLED TVs",
        "OLEDs",
        "light",
        "panel",
        "gen OLED panel",
        "OLED panel technology",
        "pixel",
        "burn",
        "brighter",
        "Vision",
        "Visions",
        "pixels",
        "heat sink"
    ],
    "transcript_entity_values": [
        "Sony",
        "Privacy.com",
        "the years",
        "one",
        "G2",
        "second",
        "LG",
        "first",
        "A3423DW",
        "Radeon",
        "G2",
        "C2",
        "3.7",
        "Fidelity FX",
        "just $1,600",
        "2.7",
        "RGB",
        "March",
        "Floatplane",
        "A90J",
        "up to 30%",
        "Dolby Vision",
        "LGS",
        "930",
        "last year",
        "5",
        "200",
        "3.6",
        "only a few hundred bucks",
        "SDR",
        "the last years",
        "48 inch",
        "Wan",
        "Dell",
        "Pentile",
        "RGB Stripe",
        "7.2",
        "a 65 inch C1",
        "a ton",
        "OLED",
        "nearly a thousand dollars",
        "Wendell",
        "HDR 10",
        "Dolby",
        "2.0",
        "6,000",
        "Delta E",
        "2.1",
        "three",
        "18 to 18 and a half milliseconds",
        "Anthony",
        "880",
        "YouTube",
        "Quantum",
        "G1",
        "42-incher",
        "1000",
        "Costco",
        "QD",
        "three year",
        "LCD",
        "two",
        "Samsung",
        "1% to 10%",
        "1917",
        "one year"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "LOC",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "DATE"
    ]
}