{
    "id": "7hapg51ZWl0",
    "title": "Anna Cleans Her First NASTY Gaming PC",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2022-04-02T13:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=7hapg51ZWl0",
    "category": "Science & Technology",
    "tags": [
        "dawid",
        "dawid does tech stuff",
        "PC",
        "gaming",
        "intel",
        "AMD",
        "Corsair",
        "Gaming",
        "Game",
        "Computer",
        "Gaming PC",
        "David Does Tech Stuff",
        "DDTS",
        "Tech",
        "Stuff",
        "anna",
        "cleans",
        "pc"
    ],
    "views": 144089,
    "likes": 9202,
    "comments_count": 1099,
    "description": "*Today's video sponsor* Go sign up to Linode here:   Anna tackles Mr Mcconaughey's nasty gaming PC form the recent Viewer Rig Roast video.  Check out the first video in this series here:   Get some AWESOME Dawid merch here:   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate-  Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "http://linode.com/dawid",
        "https://youtu.be/DoGmKBnr00E",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "Today we're going to clean the DIRTY McConaughey. But before that it's time for today's sponsor: Linode. Today's video is sponsored by Linode, a company that's been awarded by me for having the best name to say. Just give it a try. Linode. It feels good doesn't it? Linode is a linux based cloud computing and web hosting service, that offers multiple products to manage cloud storage websites, databases, game servers, Kubernetes, and they can even handle whatever computational load you can imagine. And regardless of what service you decide to go with, you will get access to award-winning customer support. If all of this sounds good to you sign up to Linode using the link in my description below to get a 60-day, $100 free credit. Thank you Linode for sponsoring today's video. We need to first clear this case of all of the super clear grime and we're going to be using a Data Vac for that. Okay, so now that we've dusted the pc and have removed the majority of the ickiness. I'm going to to dust the outside of the pc with this cloth and then I'm going to remove the side panels and remove the components and the cables inside the case, to give this case a bit of a deeper clean. Because you can see the panels are a little bit damaged and there's kind of like been residue that's literally eaten away at the plastic a little. So in some areas I don't know if I'm actually going to be able to get it looking beautiful. Okay, now i'm dipping a little cleaning liquor onto a paper towel to try and get some of some more of the grime off. First round of cleaning with cleaning liquor. *ewwwwww* oh [ __ ] look at that thermal paste! There's barely anything... That was when it was new, an insufficient thermal paste application. Look at that, oh my god, it's actually kind of peeling off. Oh okay yeah.. Okay, let's do some more blowing. This looks clean enough. I'm going to show you the top now. Look at how much is caked underneath the fans. Okay, so I'm about to take a graphics card apart for the first time ever. So this piece of plastic was still over the thermal pad. So now we're going to take the shroud off. Wow This is just insane. All right so i am pretty happy with this shroud. Um that came off of it, so i mean i must be right? And now i'm gonna start working on the board Poor little baby graphics card... so dirty Dawid: \"FOUR\"... Anna: *Laughter* All right, so I finished cleaning the pc yesterday. I am so proud. Um i think we managed to do a really good job. We got the graphics card clean, the power supply, the motherboard, the case, the cpu cooler was absolutely disgusting. Okay, although the gpu is also pretty bad. I don't know which one was worse. But we are now going to reassemble this bad boy. So let us begin! So we are going to start with the power supply. These are so unwieldy, like they're just so thick. Dawid: I'm gonna quickly intervene here, because one of the things that i noticed when i was looking at the system was that there are some unnecessary cables in here that we can unplug. So actually quickly take it out and then we can have a closer look. Um okay, so we've removed one of the cpu power cables because we don't need both of them and we're going to do the same with some of the gpu power cables which is apparently this one. Dawid: oh you're so knowledgeable Anna. Anna: I know right almost like you just told me what to say. *giggles* Now we are going to re-put the power supply unit into the pc with significantly less cables. Yay! Can i just push? All right so the first cable we're gonna try and route is the cpu cable. Okay okay so next up we're gonna plug the motherboard in okay so that's in PC components are really sore to push in because they've got these sharp plastic edges and like my little fingies don't love them. Okay so i'm now routing the storage connectors into the storage cages so that they can be accessed. Err is there.. does it matter with the order? Dawid: \"Yeah very much\" Okay okay so the next step is going to be putting in these two cards, which one of them is a sound card and one of them is another card Dawid: so with this one you can see that that connector is different yeah connector on this one and this motherboard only has one of the sound card connectors so it has to go into that slot Um do I just push? Now's my favorite part I get to plug in the graphics card! all right it's time for this beaut to be put into this beaut.. nice, so saggy it's like my mama's titties *giggles* sorrry *giggles* hmm Damn look at that difference. The CPU is just at like 51 degrees celsius. Before it immediately skyrocketed into the 80s. So that is a considerably lower temperature. but yeah with that let's show Anna the fruits of her labor! Anna: Ehhhh, oh my god Dawid: I know right The temperatures are sitting around 50 for both of them. Dawid: yeah that's down from the mid-80s and it's been running for ages oh what that's so cool Dawid: Good job, High five! *yeah* happy dance Now in terms of increased gaming performance, Unfortunately the lower temperatures didn't really help much although funnily enough cleaning the system did for some reason fixed the xmp profiles for the ram, so I could get the ram running at 1600 megahertz which then led to a slight overclock on the cpu which didn't really increase the average frame rate but it did lead to higher one percent lows and battlefield 5 did feel much better. Uh but yeah anyway with that thank you very much for watching! Anna did a great job cleaning Mr. McConaughey's system. if you like this video subscribe to the channel for more videos like this one and until the next video bye you",
    "transcript_keywords": [
        "Linode",
        "Dawid",
        "Today video",
        "card",
        "graphics card",
        "Today",
        "Anna",
        "Yeah",
        "cleaning",
        "cables",
        "cpu",
        "power",
        "video",
        "good",
        "case",
        "power supply",
        "clean",
        "power cables",
        "card Dawid",
        "sponsoring today video"
    ],
    "transcript_entity_values": [
        "first",
        "the mid-80s",
        "Dawid",
        "1600 megahertz",
        "Linode",
        "Kubernetes",
        "xmp",
        "Ehhhh",
        "two",
        "around 50",
        "60-day",
        "CPU",
        "Today",
        "100",
        "today",
        "FOUR",
        "one percent",
        "gpu",
        "the 80s",
        "one",
        "Linode",
        "Anna",
        "McConaughey",
        "First",
        "51 degrees celsius",
        "5",
        "yesterday",
        "cloud computing"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "LANGUAGE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}