{
    "id": "7j9LIiO9xmo",
    "title": "Mystery Deal Box - Jack Edition",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-09-30T16:59:56Z",
    "video_url": "https://www.youtube.com/watch?v=7j9LIiO9xmo",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "mystery deal box",
        "mystery",
        "deal",
        "box",
        "cool gadgets",
        "cool gadget",
        "ghostek",
        "stickit",
        "sugru",
        "best",
        "2016",
        "apple",
        "iphone",
        "video",
        "android",
        "inventions",
        "invention",
        "samsung",
        "smartphone",
        "phone",
        "iphone 6s",
        "awesome inventions",
        "new gadgets",
        "amazing inventions",
        "top",
        "new inventions",
        "awesome",
        "futuristic",
        "iphone 7",
        "cool technology",
        "cool inventions",
        "products",
        "crazy",
        "new technology",
        "amazing",
        "things",
        "future"
    ],
    "views": 1606577,
    "likes": 33453,
    "comments_count": 2660,
    "description": "VideoBlocks - 7-day free trial -  OTHER LINKS DOWN HERE  GHOSTEK Use discount code ubtnrg20 for 20% off site wide until October 5 -   STICKIT Use discount code UNBOXfor 20% off site wide for 72 hours -  SUGRU Use discount code UNBOXTHERAPY for 15% off site wide for 48 hours-   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/2cH2C0a",
        "http://bit.ly/2dcWCz7",
        "http://bit.ly/2dcXhAW",
        "http://bit.ly/2dx5YEn",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Welcome back to another episode of \"Jack's Mystery Box\", the mystery deal box. You see, he even put himself on the box this time! I know, it's incredibly creepy. Now, this episode has been brought to you by \"Videoblocks\". Who are Videoblocks? They are the largest repository for royalty-free, use-however-you-want, video clips on the planet. An example of Jack using the site: he was downloading these old-school astronaut video clips. He put together this really, like, dramatic short film? I don't know. I'm just saying if you like to get creative, if you want to start doing some video editing, give this a shot. It's a great way to get started. They've got a 7-day free trial so you can try it for yourself. All the details will be down in the description. For those of you that are new to this concept, this mystery box thing that Jack keeps telling me is such a good idea, this box is full of gadgets or cool things, objects...that are having deals right now. Deals just for you, and limited-time. Very limited. I'll be explaining it all as I go through it, but essentially what you've got here is a fancy box full of fancy deals. So let's get it started! Number one... [Lewis \"ooh\"ing] ...a backpack. This is from a company called Ghostek, and you're gonna notice right away it's not your average everyday backpack. This guy has a battery built into it for charging up all your gadgets. You can charge the whole thing up right from the outside of the bag. You put the power adapter in there, plug your bag in and keep it charged! On the inside, that's where the battery lives, in this little section right here. It clips out. This is a 7,000 milliamp-hour (mAh) battery. There's a little dock in there for it. And then on top of that, via the dock, you've got these various USB ports accessible to you. So there's one on the outside here for that kinda like quick charge. And then on the inside of the bag, you have a couple of female USB ports here so you can keep some items charged while they're in the bag and that'll all be coming off of this 7,000 mAh battery which you can check the status with this LED indicator on the front. This section comes down and you have a sleeve for a laptop. Jack, what's the deal? Not just this bag, but apparently Ghostek's entire website. 20% off for the next 48 hours from the point at which this video is live. Link for this and all the other deals will be in the description. Alright, what do we got next? Look at this thing over here!... \"stickithub.com\". \"The 3-in-1 magnetic phone holder.\" Concept here: you got this little base station right here and you can mount that to anything you want. It could be your car dash...and then this little ball acts as a pivot point to this unit right here, which is a strong magnet, and it-- [magnet clicks] ...you see what I mean? Now, on your device, you put this little metal plate here and then this thing comes on like this when you're ready to dock it down, or as the name implies, stick it! This thing becomes stand-alone when it's not near your pivot base, so essentially, just like this one on here, can stick to here -- that could be your locker -- and then this could stick to the outside of that. So that's the three-in-one part. You know I love magnets, I can never get enough! What can I say? What's the deal? Give them the deal, Jack! Okay, this is 20% off again for 72 hours. So you've got three days on this one from the point that this video is published. That's interesting... [Lewis playing with magnet docks] Next up: \"Rebel Tech Kit\" from Sugru. \"Moldable glue\"... \"14 brilliant ways to fix, hack, and improve the gadgets you love.\" Interesting. Oh, okay. I've seen this stuff. So this is this super-flexible material that you can use to repair various different gadgets, cables that are fraying... a cable rest, an extra grip for a camera. It turns into rubber after it dries so you can mold it around stuff. Extend the thumbsticks on a Playstation controller... 15% off for the next 48 hours. You gotta move quickly if you wanna catch those deals. The links and all the relevant information will be down below. Couple of cool items here on this episode of \"The Mystery Deal Box: Jack's Edition.\" Maybe there's an item you've been looking to buy for a real long time, but it never goes on sale and you never catch a deal. I want you to call out that company in the comments down below. Put 'em on blast and they gotta get in touch with us...gotta get in touch with Jack and bring their A-game 'cause you're an Unbox Therapy fan, and you deserve the best.",
    "transcript_keywords": [
        "mystery deal box",
        "Jack",
        "Jack Mystery Box",
        "Box",
        "deal",
        "Mystery Box",
        "deal box",
        "mystery deal",
        "deals",
        "mystery box thing",
        "video",
        "Mystery",
        "put",
        "bag",
        "thing",
        "Jack Mystery",
        "video clips",
        "Videoblocks",
        "episode",
        "battery"
    ],
    "transcript_entity_values": [
        "14",
        "Unbox",
        "Playstation",
        "72 hours",
        "the next 48 hours",
        "15%",
        "7,000",
        "USB",
        "7,000 milliamp-hour",
        "Jack",
        "Sugru",
        "Number one",
        "Rebel Tech Kit",
        "Ghostek",
        "Videoblocks",
        "3",
        "The Mystery Deal Box: Jack's Edition",
        "three",
        "20%",
        "7-day",
        "Jack's Mystery Box",
        "three days",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL"
    ]
}