{
    "id": "7jHpJ1VB568",
    "title": "I FINALLY can get WiFi on my ROOF! - TP-Link Archer AX5400",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-12-14T20:06:28Z",
    "video_url": "https://www.youtube.com/watch?v=7jHpJ1VB568",
    "category": "Science & Technology",
    "tags": [],
    "views": 388992,
    "likes": 12234,
    "comments_count": 580,
    "description": "Thanks to TP-Link for sponsoring today's video. Purchase the Archer AX5400 Dual-Band Gigabit WiFi 6 Router for just $149.99 for a limited time at:   10 lucky participants have the chance to win the Archer AX5400 Dual-Band Gigabit WiFi 6 Router, Archer AX73 at:   WiFi is basically a necessity these days, with almost all of your devices needing to be connected to the internet, like a fridge! TP-Link's Archer AX5400 router allows you to have all those devices connected without worrying about a slowdown. Let's install it in James' house!  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/AX73",
        "https://lmg.gg/AX73Giveaway",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Welcome to this on location, ShortCircuit, sponsored by TP-Link, who wants to show off their Archer AX73, Wi-Fi 6 router. And what better way to do that then to install it at my place. A three level townhouse condo with concrete walls and floors. All right, let's get this puppy out of the box. Oh God, I feel like it's upside down. It's upside down. Power adapter. And of course the unit itself. Oh my gosh, look at these antennas. And a little ethernet cable. Oh it's in one of these premium little bags. Damn, this is like a legendary pictures logos. This is pretty cool. Sleek design, not too gamery. This could easily be out in the open and fit your decor, even. You know what? And this isn't just a aesthetic. This is their new vent design. So like, basically the entire thing can radiate either top or bottom. Pretty cool. And of course, it's got the mounting hooks for just thumbtacks or whatever you wanna use. And it's solid. I don't really expect this to flex. - [Bell] How big is it? Oh God. It's about, I would say, what is that, 1.3 bananas in length and 0.6 bananas high. There are six adjustable high gain antennas with dual band speeds up to 5,400 megabit per second. And the single band speed on five gigahertz is 4,800 megabits per second. I can't leave these on here. Oh, this is not easy. Oh my God. I need like a lighter. Okay, let's try another one. See this one, this one's easy. That's how it's supposed to go. On the IO side, we've got four different LAN ports, your WAN port, power, and then on the side, a USB sharing port. And a cool thing about this is that it's compatible with one mesh extender. So you can turn this into a mesh ecosystem without having to buy into a whole new ecosystem. And mesh would be a good solution for this place, but that's not what I have today. So what we're going to do is hook this up so I can get wifi all the way up two floors higher onto my rooftop, but first let's do a speed test. All right, so we're on the second floor and here are the speeds I'm getting with my ISP's router. And obviously these aren't great. I'm getting just 15 megabits per second on the download. So let's head to the roof and do another test. Okay. Now we're upstairs on the roof, very far away, two concrete floors, and let's see what we get now. I don't even know if I'm still connected to it. Yeah. It's not even close. Okay. So now we're going to go down to floor number 2. Install a router. Hopefully that's very easy, 'Cause I'm not good at networking. And then we'll try again. There it is. I'm gonna choose the 5G one. I don't know the password. Do these things stand down on its own? Always reminds me of those crab things from Half-Life. So I think I'm pretty much ready to do another test. Wow. 334 megabits per second. That's actually faster than the advertised speed that I pay for every month. The Archer is definitely able to handle gigabit speeds if you need that over wifi. If that's available in your area and to your bank account, but this is more than enough for me. Oh, I got full bars still. We hit go. Not gonna pretend that it's not, like, an order of magnitude worse, but crucially, we still have enough bandwidth to stream an HD movie from Netflix, for example. Not 4k, but HD, 1080p. It works. But we got those results using the five gigahertz band, which of course is higher data density, but with less penetrative power and range. So now let's see what we get using 2.4 gigahertz. And that's more like it. Double the speed. So cool. I'm very satisfied with that. I'm probably never going to watch Netflix out here, but at least I can watch my friends' Instagram stories and crap like that. - All right. And here are the speeds from the TP-Link router, that's on the second floor, while I'm down here on the first floor. And yeah, 40 megabits down is a lot better than the 15 my ISP's router was doing from a floor away. Even the gigahertz band that usually has trouble penetrating walls, gets 26 megabits, which is quite a bit better. This is more like the performance difference most people should expect instead of the other results between the second and third floor, since the ceiling separating those floors is thicker. Now that I'm logged in and connected to my device, I'm greeted by a tour of all these premium features, like antivirus, parental controls, a family time lets you easily switch off a network to enjoy your time offline. That's exactly what I was just asking for. Okay. That's good. I might actually use that. And professional reports for, I suppose that's analytics. And other privileges, more advanced features like QoS to better control your network. You can even make a guest network for randos that are in your house. Maybe if you have an Airbnb or something like that. Not gonna set that up now, but that sounds like a cool feature. What else is in here? Home shield that gives you intrusion prevention, malicious content filter, and a DDoS protection to keep all your connected devices safe. That's pretty cool. And I can get a list of all the clients that are currently connected right now. In the good old days, it's just me and my Phillips Hue. But soon there'll be a bunch of other heap along here. Night mode. That's awesome. Since this is gonna be in a bedroom, unfortunately, it's great that I can turn on night mode. Okay. The LEDs are still on right now, but it's cause you can actually make a schedule. So from 10:00 PM to 6:00 AM, those LEDs are gonna be off. That's dope. Oh sick, you can share the wifi. So if someone asked what your wifi access ID or password is, instead of even describing it to them, you can have a very secure password and then just send them the credentials to their device so that no one has to write anything down or take a picture or hang it on your fridge or anything. That is super cool. This is actually a really useful app. So, for a quick summary, the Archer AX73 utilizes Wi-Fi 6 tech to provide you next gen wifi speeds up to 5,400 megabits per second. And four times the connection power, which is ideal for 4k or even 8K streaming, gaming, and the ever-growing number of devices connected in your home. Plus, home shield features the latest WPA3 encryption to give you full control of your network while keeping it secure. With fully loaded features and price, just under $200, it's a strong option to consider if you're thinking of upgrading your old router. With the holidays coming up, you need your wifi to be super solid and good to go. Cause you might have family coming over or even if you don't, you're probably gonna be gaming a lot. So take advantage of this. Just-in-time for the holiday season, TP-Link has a promo going on where you can get 50 bucks off when you buy your Archer AX73 router from Amazon, with no code needed, if you get yours before December 21st. So learn more and get yours today using the link in the video description. So thanks again to TP-Link for sponsoring this video. If you guys liked it, hit like, hit subscribe, and hit us up at the comm, damn it, I did again, this is the Techquickie outro. I don't know what to say for ShortCircuit. Just cut.",
    "transcript_keywords": [
        "WiFi",
        "cool",
        "floor",
        "router",
        "megabits",
        "speeds",
        "Archer",
        "floors",
        "speed",
        "pretty cool",
        "connected",
        "good",
        "God",
        "pretty",
        "ISP router",
        "features",
        "band",
        "gigahertz",
        "Power",
        "network"
    ],
    "transcript_entity_values": [
        "my Phillips Hue",
        "15",
        "ISP",
        "three",
        "26 megabits",
        "the good old days",
        "4k",
        "one",
        "8",
        "USB",
        "0.6",
        "ISP",
        "Amazon",
        "WAN",
        "five gigahertz",
        "TP-Link",
        "second",
        "2.4 gigahertz",
        "Archer AX73",
        "IO",
        "Instagram",
        "40 megabits",
        "LAN",
        "5",
        "15 megabits",
        "third",
        "first",
        "Techquickie",
        "Netflix",
        "the holiday season",
        "every month",
        "up to 5,400 megabits",
        "two",
        "December 21st",
        "200",
        "four",
        "DDoS",
        "10:00 PM to 6:00 AM",
        "Archer",
        "1.3",
        "the holidays coming",
        "QoS",
        "ShortCircuit",
        "Half-Life",
        "Airbnb",
        "six",
        "2",
        "five gigahertz",
        "334 megabits",
        "ID",
        "5,400 megabit",
        "50 bucks",
        "up to",
        "today",
        "4,800 megabits"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "FAC",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "QUANTITY"
    ]
}