{
    "id": "7KtB6_LeD8U",
    "title": "This Shouldn’t be Possible…",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-06-04T01:49:27Z",
    "video_url": "https://www.youtube.com/watch?v=7KtB6_LeD8U",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "petabit",
        "internet speed",
        "1 Pbps",
        "petabit per second",
        "data transmission",
        "Japanese research",
        "National Institute of Information and Communications Technology",
        "NICT",
        "Japan",
        "1 petabit per second",
        "internet speed test",
        "speed test"
    ],
    "views": 571130,
    "likes": 32567,
    "comments_count": 858,
    "description": "Get the ultimate Father's day gift with iFixit at:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 yOU aLReAdy KnEw 0:11 Japan achieves 1 Petabit per second 1:22 Tim Hortons app tracked users 2:06 NY State Crypto + Right to Repair bills 3:04 iFixit  3:43 QUICK BITS 3:50 Amazon invite system 4:20 War Thunder forums leak info again 4:53 Ford wants online-only EV sales 5:24 Pixel 7 Pro used by guy 5:53 PS5 State of Play announcements  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "http://ifix.gd/fatherlinus",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/7Ijks",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Oh, yeah. You know what time it is? - What time is it? - You are, You're so good at keeping track of time. That's why we call you \"The Watcher.\" - [Man] The what? (chuckles) - Truly blistering internet speeds just got one step closer, thanks to researchers in Japan who just managed to transfer data at a rate of one petabit, paid a bit? Per second across standard multi-core fiber. No, a petabit, doesn't have anything to do with animal rights. It's the equivalent of 1 million gigabits or 125 terabytes. We're talking about emailing a server's worth of information in one second. Now I know what you're thinking, but Riley, researchers at the same institute demonstrated petabit data transmission way back in December 2020. And yes, that's true, which is another reason we really appreciate you. But that test was conducted using non-standard optical fiber cables that required the signal to be unscrambled at the other end. This test used standard multi-core fiber and actually transmitted more than a petabit per second, 1.02 to be exact over a distance of 31 miles, meaning this kind of speed is a lot closer to commercial reality than before. I feel like we do this a lot on this show, but nice job Japan. Very cool. It's not a Kaiju Fighting Mech, which I would like more, but it's cool. - [Man] Close enough. - Tim Hortons, that bastion of Canadian culture named after its founder and professional hockey player, Tim Horton has betrayed us all. An investigation by our great nation's privacy commissioner has found that the franchise's mobile app collected user location data as often as every few minutes, even when the app wasn't in use. The finding strengthened the case being made by four proposed class action lawsuits attacking the company for being unclear about the scope of information being collected by Tim Hortons. But wait, there's hope. A co-defendant named in two of those lawsuits is American company, Radar Labs which helped Tim Hortons develop the app. I knew it, Timmy's wouldn't do this to us unless it was under the influence of the yanks. We should have never shared our Timbits with you. A New York State Senate has just passed two rather interesting bills with big implications for the tech industry. The first one is a moratorium on new permits for cryptocurrency mining operations which had flock to the state's many retired hydroelectric and fossil fuel plants, after China imposed heavy restrictions on crypto last year. Existing miners won't be affected, but for how long? Fossils don't just grow in trees. The second bill passed this morning is a massive win for the right to repair movement called the Digital Fair Repair Act. It requires electronics manufacturers to make device documentation, parts and tools available to basically anyone that wants it, even babies. That's not in the, that's not in there. I just... Both bills still need to be signed by the state's governor to become law. But at this point you're allowed to feel the kind of excitement you do when your team is up by two points with a minute left. Is that, was that accurate for sports? Is that? - Go sport. - Go sports. Now it's time for quick bits brought to you by iFixit, provider of the perfect father's day gift for dads at all price points, even dads that have barely any affinity for iFixing anything at all, like me. For the ultimate gift, check out iFixit's Manta Kit with 112 steel bits including standard Phillips and Flatheads, as well as Torx, Tri-point, and Gamebits as well. Those sound made up, are those real? The Manta Kit also has both a hefty quarter inch driver for full-size applications and a smaller four millimeter for precision work. All iFixit tools are backed by a lifetime warranty. So if something breaks, they'll replace it for free. Check out iFixit's gifts for dads using the link below. Quick bit sounds like something you could put in a screwdriver, but trust me, they do not like that. - [Man] Do not. - Amazon has launched an invite system for buying high demand, low supply products like gaming consoles, which the company says may prevent inventory shortages and price gouging. Any potential buyer will be able to request an invitation to buy an item. No $200 membership needed, (coughs) Best Buy! So hopefully this keeps the bots out and we can get back to the point where we have way more stuff than anyone will possibly ever need, the way it should be. - [Man] But we have no money. - But there's stuff. Classified military information is leaked on the forums for vehicular combat simulator, War Thunder, for the third time. After a Chinese player posted a photo of ammunition schematics for a Chinese tank with one of the actual rounds sitting on top of the paper. The games developer Gaijin Entertainment has since removed the post and banned the player who is trying to get them to make the tanks in-game assets more realistic. I mean, what is this? Advanced wars? Battle tanks for the N64? This is the tank game for historical scholars, like Jano. Ford's CEO, Jim Farley has publicly said he wants his company to move towards online-only sales for electric vehicles. A model prominently used by newer electric vehicle companies like Tesla. And Volkswagen has indicated they wanna do something similar for their Scout EV line. The problem is, in many jurisdictions it's actually illegal for traditional manufacturers like Ford to sell directly to consumers instead of through a massive complicated network of dealerships which add their own markups because the economy, duh? That Pixel Seven that showed up on eBay and Facebook Marketplace, apparently wasn't a one off. After reading articles about it, one Reddit user discovered that the Pixel Six Pro, he thought he had purchased a few weeks ago, was actually a Pixel Seven Pro, and it was remotely reset by Google presumably, the day after the sketchy Pixel Seven listings appeared in articles. So let this be a lesson to you, only by new phones from certified phone dealerships where this stuff does not happen. And as promised Sony held a State of Play event yesterday to announce some cool things, like the fact, that the remastered version of 2018's excellent PS5 exclusive Spider-Man game is coming to PC in August. Yes! I've been waiting so long. Is it good? - It's awesome. - It's pretty good. (crosstalk) It was it wasn't? - It was PS4s. - PS4 game. I don't touch consoles, so I didn't know that. We also got trailers for the upcoming open world, Street Fighter Six, what? A skating shooter hybrid game, Rollerdrome. That actually looks cool. A very Dead Space style game made by the people who made Dead Space called Callisto Protocol and Eternights, an action dating game. I don't know exactly the meaning of what I just said, but that's just how my life normally goes. But I do know when you can come back for more tech news, Monday. Why do I know that? It's just my gut.",
    "transcript_keywords": [
        "Tim Hortons",
        "time",
        "game",
        "Tim",
        "Pixel",
        "State",
        "Hortons",
        "helped Tim Hortons",
        "Tim Hortons develop",
        "petabit",
        "Manta Kit",
        "standard multicore fiber",
        "Dead Space",
        "company",
        "iFixit",
        "made",
        "cool",
        "iFixit Manta Kit",
        "York State Senate",
        "Kaiju Fighting Mech"
    ],
    "transcript_entity_values": [
        "Flatheads",
        "December 2020",
        "Senate",
        "Phillips",
        "yesterday",
        "the day",
        "Torx",
        "Jano",
        "last year",
        "the Digital Fair Repair Act",
        "Volkswagen",
        "Riley",
        "one",
        "Tesla",
        "the Pixel Six Pro",
        "The Manta Kit",
        "Rollerdrome",
        "iFixit",
        "Callisto Protocol and",
        "Google",
        "Japan",
        "1.02",
        "Gaijin Entertainment",
        "Scout EV",
        "Facebook Marketplace",
        "2018",
        "31 miles",
        "Amazon",
        "Tim Hortons",
        "112",
        "Reddit",
        "second",
        "one second",
        "four millimeter",
        "Ford",
        "Jim Farley",
        "American",
        "a few weeks ago",
        "Timmy",
        "125 terabytes",
        "August",
        "Eternights",
        "China",
        "third",
        "New York State",
        "PS5",
        "War Thunder",
        "first",
        "Chinese",
        "Sony",
        "N64",
        "Gamebits",
        "two",
        "Canadian",
        "Spider-Man",
        "Street Fighter Six",
        "200",
        "four",
        "Monday",
        "Seven",
        "Radar Labs",
        "eBay",
        "this morning",
        "Manta Kit",
        "every few minutes",
        "Dead Space",
        "Tim Horton",
        "a minute",
        "1 million gigabits",
        "iFixing"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "LAW",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "GPE",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "QUANTITY",
        "ORG"
    ]
}