{
    "id": "7N_tNfBxCxE",
    "title": "Ultra Gaming on a $200 PC - GeForce NOW",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-08T22:56:24Z",
    "video_url": "https://www.youtube.com/watch?v=7N_tNfBxCxE",
    "category": "Science & Technology",
    "tags": [
        "geforce now",
        "ces",
        "ces 2018",
        "nvidia",
        "geforce",
        "pc gaming",
        "gaming",
        "tech",
        "cloud gaming",
        "austin evans"
    ],
    "views": 1632396,
    "likes": 34179,
    "comments_count": 3337,
    "description": "Checking out Nvidia's GeForce NOW PC game streaming at CES 2018 - now for PC! Get on the (free) GeForce NOW waitlist:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.nvidia.com/en-us/geforce/products/geforce-now/mac-pc/waitlist/",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin and today I'm here at CES with NVIDIA about to take a look at GeForce NOW. So not only were they awesome enough to sponsor this video, but if you guys caught my video a couple of months ago where I took a look at GeForce NOW for the Mac you'll know that it actually works pretty well. So in that video I was using a 2009 MacBook I got for 200 dollars on eBay and playing proper PC games using the internet game stream tech. Which sounds really exciting and fancy. Now, not only is that still around but today we're actually able to also play now on the PC. One of the big advantages of GeForce NOW is that you can play games on hardware that you normally couldn't. So take for example, this. This is the HP Stream and it's a 200 dollar laptop. I've actually done a video on this a little while back. And while it's not a bad computer, gaming is definitely not its strong suit. Since this is cloud gaming we are relying on having a decent internet connection. So this guy is going to be hardwired in. But beyond that, the requirements actually aren't too crazy. In addition to GeForce NOW being available for the PC there are also now some Uplay games available which is why I'm playing Rainbow Six. Ah, Oh, Okay that's not good. This is a lot of fun. Something I'm noticing here is that the latency really just is not that bad. Even when I'm getting into gunfights Main thing that kills me is uh you know, my expert skills. One of the nice parts about this is that because we are playing via the cloud we're actually able to crank the settings up pretty high. So I'm curious where are we actually running at right now. Running at very high settings on a Tesla P40 because you know, that's exactly what I want to play on my 200 dollar laptop. Since I did my last video, GeForce NOW has seen some updates including there's now an actual search function. So if you want to look for a specific game, you can do that and what's even more exciting is there's now an ultra streaming mode. The idea here is that in the cloud the game is going to be running at 120 frames per second and then you're going to still get a 60 frame per second feed to your computer. The idea is, is that will help to cut down on some latency. Now it's not supported on all games. One game that is supported is Fortnite. Something interesting here is we're playing on a slightly higher end computer. So this is like a standard Ultrabook and while it has a nicer screen which is definitely helpful, the actual experience of playing the game should be the exact same. So like five seconds in, I can tell that this is actually a slightly smoother experience. So, while there's very little latency on this side having the game run at 120Hz even though I don't actually have a 120Hz panel just does cut down latency ever that much more. Also, I deployed my parachute way too early. (laughs) And actually what's interesting is, so we're in Las Vegas right now. The actual server we're playing this on is in Los Angeles, which is a few hundred miles away. Next we have PUBG which is the most popular game on GeForce NOW and well, basically everywhere else. So the demo here is we have two identical 400 dollar laptops one running the game natively at a slightly less than optimal two frames per second on low and the other running the game at full 1080p 60 on well, GeForce NOW. So, what's kind of interesting and something very helpful that Nvidia has provided is a full chart showing the performance gains you can expect when you stop using the integrated graphics on your laptop. As you can see, these numbers are much higher. Look, I don't have to do this. This is something that I don't need to do, but I'm going to try to play PUBG at two frames per second. Because I don't have a really good reason actually. I'm just going to try it. So, really impressive experience I got to say. The graphics are unrivaled and the frame rate is what some would call buttery-smooth. I mean, there's less than probably five seconds of latency between when I hit a button and when I actually see my character move on screen. If I stop There he stops. Anyway, I'm going to move on to GeForce NOW. I think that's... For real though, this is a great demo of what makes GeForce NOW really interesting. The idea that with a 400 dollar laptop that has pretty low end internals, I mean, this is like a Pentium, that's able to play games like PUBG at a really nice and smooth frame rate. Obviously, you need a good internet connection, but almost it even makes more sense with PUBG because you need a good internet connection to play it, anyway. Odds are if you're going to be playing this you're going to have an internet connection that's going to be decent enough to actually be able to stream the game. I mean, PUBG is maybe not the greatest looking game in the world, but especially the last few patches really have made it look nice. And the desert map, actually, looks pretty decent. Although I know nothing about where anything is right now. Oh, oh, hello, hello, hello. Nope, nope you don't! Yeah, there we go. I got one kill. I feel very proud and accomplished that I caught a guy as he was running out of a building and successfully got him. Okay. So, while the GeForce NOW beta for Mac has been out for a few months. It is now available for PC and it is still free. At least until Nvidia comes to their senses. Now the cool thing is that if you were already on the Mac beta you can get on this immediately, but if you haven't tried it at all yet you can get on the wait list and they're going to be adding more people every week. So, if you guys have not tried this it is definitely worth a look, but what do you guys think about GeForce NOW? Let me know in the comments below and I will catch you on the next one.",
    "transcript_keywords": [
        "game",
        "GeForce",
        "playing",
        "PUBG",
        "Austin and today",
        "Austin",
        "CES",
        "games",
        "running",
        "play",
        "video",
        "CES with NVIDIA",
        "play games",
        "internet",
        "latency",
        "guys",
        "internet connection",
        "dollar laptop",
        "Hey guys",
        "dollar"
    ],
    "transcript_entity_values": [
        "Ultrabook",
        "Las Vegas",
        "the HP Stream",
        "120Hz",
        "a few months",
        "like five seconds",
        "five seconds",
        "a few hundred miles",
        "Austin",
        "a couple of months ago",
        "two",
        "120",
        "2009",
        "Tesla",
        "Pentium",
        "400 dollar",
        "60",
        "second",
        "CES",
        "Nvidia",
        "200 dollars",
        "Fortnite",
        "GeForce",
        "eBay",
        "Los Angeles",
        "Mac",
        "Rainbow Six",
        "One",
        "200 dollar",
        "NVIDIA",
        "today",
        "Uplay"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "TIME",
        "QUANTITY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG"
    ]
}