{
    "id": "7Sr4LyliXIA",
    "title": "Android Security Myths (answers to some of the comments) #shorts #android #iphone",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-12-08T14:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=7Sr4LyliXIA",
    "category": "Science & Technology",
    "tags": [
        "android",
        "iphone",
        "omg",
        "omg cable",
        "hak5",
        "photos",
        "photo",
        "video",
        "remote phone",
        "ios",
        "android phone",
        "apple ios",
        "apple ipad",
        "apple iphone",
        "samsung",
        "hak5 omg",
        "kali linux",
        "kali linux tutorial",
        "ceh",
        "oscp",
        "kali",
        "rubber ducky",
        "hak5 rubber ducky",
        "rubber ducky usb",
        "rubber ducky hak5",
        "usb rubber ducky",
        "usb rubber ducky tutorial",
        "usb rubber ducky unboxing",
        "usb rubber ducky payloads",
        "hak5 omg cable",
        "hak5 bash bunny",
        "hak5 omg cable tutorial",
        "hak5 cloud c2"
    ],
    "views": 92768,
    "likes": 5655,
    "comments_count": 107,
    "description": "In a previous video where I ran a script against an Android phone, a lot of people commented that you have to give permission.. well... think again...  Previous video:   Myths that I've seen in the comments (but I couldn't cover them all in this video - let me know if you want me to cover more of these): 1) You have to give permission when you plug the cable in (not true) 2) You have to enable developer options (not true) 3) You have to enable debugging (not true) 4) I'm plugging the Android phone into the iPhone (no I'm not) 5) The iPhone and the Android phone need to be connected to the same WiFi network (not true) 6) You can only do simple things like taking photos (not true) 7) Never happened in the real world (not true) Read about Cottonmouth-I NSA cable:  8) I made and sell these cables (No I didn't - MG makes these and they are available from Hak5:  (see my Hak5 affiliate link below) 9) This doesn't affect iPhones (Not true - see my other video using the OMG cable against an iPhone   You can buy the O.MG cable here (affiliate link):  #wifi  #android  #iphone",
    "description_links": [
        "https://youtube.com/shorts/U-0v9zbL8dw?feature=share",
        "https://upload.wikimedia.org/wikipedia/commons/8/85/NSA_COTTONMOUTH-I.jpg",
        "https://twitter.com/_mg_",
        "https://davidbombal.wiki/gethak5"
    ],
    "transcript": "In this video I'm going to discuss some of the myths with regards to an O.MG cable and an Android phone this phone is running Android 14. I've reset this phone to factory defaults and then simply upgraded it to the latest version of Android. I haven't enabled developer options or any other options on the phone so it's basically a brand new phone. Notice what happens when I plug the O.MG Cable into the phone. No messages are shown on the screen. I don't have to give the cable permission or something like that but what I can do on another phone and please note I'm not connecting the Android phone to the iPhone I'm connecting the iPhone to a Wi-Fi access point running within the cable so in other words through Wi-Fi I can then remotely send commands to the phone. So I've opened the script by navigating to the web server within the cable and I'll press build and run. I'm not going to touch the Android phone and notice I was able to RickRoll you by sending high-speed commands to the phone.",
    "transcript_keywords": [
        "Android phone",
        "phone",
        "Android",
        "cable",
        "O.MG cable",
        "running Android",
        "O.MG",
        "video",
        "discuss",
        "myths",
        "running",
        "options",
        "connecting the Android",
        "commands",
        "Notice",
        "connecting",
        "cable permission",
        "iPhone",
        "WiFi",
        "factory defaults"
    ],
    "transcript_entity_values": [
        "14",
        "O.MG Cable",
        "RickRoll",
        "Android",
        "Wi-Fi",
        "O.MG",
        "iPhone"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}