{
    "id": "7Tf5QEdoO4Q",
    "title": "Sony CES 2024 keynote in 4 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-01-09T02:16:08Z",
    "video_url": "https://www.youtube.com/watch?v=7Tf5QEdoO4Q",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "Sony CES",
        "Sony CES 2024",
        "CES 2024",
        "Sony CES press conference",
        "Afeela",
        "Afeela Car",
        "Sony Afeela",
        "Sony Afeela Car",
        "sony ces 2022 2024",
        "Tech"
    ],
    "views": 163297,
    "likes": 2455,
    "comments_count": 245,
    "description": "Sony just wrapped up its press conference at CES 2024 where it teased a spatial VR headset. The spotlight, however, was on Sonys Afeela car, gearing up for its debut in Gran Turismo 7. And Izumi Kawanishi, Afeelas president and COO, driving the car on stage with a PlayStation controller? Heres everything you missed.  0:00 PlayStation spatial headset 0:45 Sony Afeela  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Welcome to Sony. PlayStation has been the leader in gaming innovation for decade. Today, we are happy to announce a new solution for spatial content creation with a crisp viewing experience and intuitive interaction for 3D design. We are enabling creators to shape and edit 3D models. We're expanding the creation space by overlaying virtual objects into physical spaces. With seamless access to virtual objects, creators can work in real space with an immersive development experience. There is another space with an opportunity to bring more creativity, the mobility space. - First, allow me to bring the latest prototype on stage, but today I will using this. (audience laughs) This is a PlayStation controller, Dualsense. (gentle upbeat music) I'd like to talk about two topics: AI for ADAS and the mobility as a creative entertainment space. AFEELA uses advanced sensing devices, using emit sensors, LIDAR and Radar. Here, we compare object detection using directional CNN or Computational Neural Network and Vision Transformer. As you can see, it's difficult to see hidden people behind the people in backlight. Or the truck in front of you at night. We are developing the ADAS simulator utilizing gaming technology over EPIC Games. Also it looks real, everything is recreated in the virtual space. From here, I like to talk about our incentive to involve mobility as a creative entertainment space by combining the ADAS simulator with AI. In addition map data can be also be used to broaden the possibilities within the development gaming and entertainment features. We utilized the gaming engine, Unreal Engine 5. We support the latest Unreal Engine 5, 5.3. To do so, we plan to establish diverse development environments to force, foster, create community, creative community among users and creators. Allowing access to vehicle data, driving data, and other related information and that you'll realize unique ideas. - So we are going from buttons on a screen to conversational and multimodal. From siloed apps and manual integrations to integration by default. Instead of the in vehicle experience feeling like a separate state, you can now bring your digital life into the vehicle with you. For mobility, safety and security for the customer and their data are top of mind. We believe the AI systems must be responsible by design. - Today, I have shared two topics. AI for ADAS and the mobility as a creative entertainment space. We have continued to redefine the relationship between people and mobility. Through the power of technology, aiming for the transformation of mobility lifestyle. PlayStation, thank you. - Thank you for being with us today, enjoy CES.",
    "transcript_keywords": [
        "space",
        "creative entertainment space",
        "mobility",
        "Sony",
        "entertainment space",
        "ADAS",
        "Unreal Engine",
        "creative entertainment",
        "ADAS simulator",
        "creative",
        "entertainment",
        "engine",
        "gaming",
        "Computational Neural Network",
        "Today",
        "data",
        "virtual objects",
        "virtual",
        "experience",
        "creators"
    ],
    "transcript_entity_values": [
        "today",
        "Sony",
        "Computational Neural Network",
        "Today",
        "CES",
        "CNN",
        "two",
        "Vision Transformer",
        "decade",
        "PlayStation",
        "ADAS",
        "5",
        "5.3",
        "EPIC Games",
        "Radar",
        "AFEELA",
        "AI",
        "Dualsense"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON"
    ]
}