{
    "id": "7VX-X8GMH8A",
    "title": "Chronos: The Cure For The Common Wristwatch",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-10-11T13:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=7VX-X8GMH8A",
    "category": "People & Blogs",
    "tags": [
        "chronos review",
        "chronos hands-on",
        "chronos watch",
        "chronos smartwatch",
        "smartwatch alternative",
        "smart watch",
        "chronos accessory",
        "mrmobile",
        "michael fisher",
        "eliot havok",
        "watch",
        "android central",
        "imore",
        "android authority",
        "pocketnow",
        "mister mobile"
    ],
    "views": 155866,
    "likes": 4195,
    "comments_count": 236,
    "description": "Smartwatches are great, but not all are stylish  and they're often packed with too many distractions for their own good. So what if you could graft the most essential smartwatch features onto a conventional wristwatch?  Thats the question Chronos hopes to answer with its tiny disc of the same name, and it's unlike any wearable I've used before. You just slap Chronos onto the back of your everyday watch and it gives you vibrating alerts and LED notifications any time you get a message. But how useful can a pseudo-smartwatch be when it doesn't have a display? Find out in MrMobile's hands-on tour of Chronos: the cure for the common wristwatch!   [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's Chronos Hands-On was produced following two days with a Chronos watch accessory attached to an Eliot Havok Oxford Watch, both of which were loaned from Chronos. The Chronos accessory itself was paired with an iPhone 7 Plus.   [PRODUCTS IN THIS VIDEO]  Chronos:   Eliot Havok Oxford Watch:   Casio WSD-F10:   Pebble:   Apple Watch Series 2:      [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  E-Business by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/2n",
        "http://mrmobile.tech/2q",
        "http://mrmobile.tech/2p",
        "http://mrmobile.tech/2s",
        "http://mrmobile.tech/2m",
        "http://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael Voiceover] I'm Michael Fisher, and I'm a big fan of smartwatches. While they're imperfect, I also they're think they're underrated. And they make my mobile life a lot more convenient. So what happens when you want the features of a smartwatch but don't wanna give up the style or sentimental value of your current watch? That's the question Chronos hopes to answer, and I spent a couple days getting to know it. (techno music) I haven't seen many concepts that are as elegantly simple as Chronos. It's just a little stainless steel disc with a polycarbonate ring to let its internal LEDs shine through. In fact, it kinda looks like an oversized watch battery. Installation is dead simple. You wipe your favorite wristwatch down with the included wet naps, peel the plastic off the microsuction pad on the disc and stick it on there. And Chronos sent along this Elliot Havok timepiece to test it with, which, if you're curious, runs about 80 bucks. But the idea is, you can use Chronos with any watch big enough to stick it to. Now, it does add some thickness. Your watch won't rest flush on your wrist like it once did, but we're only talkin' three millimeters here, so you get used to it pretty quickly, or at least I did. And yes, the disc is IP67 dust and water resistant. But Chronos doesn't guarantee that the microsuction will hold under water. Indeed, while it was really tough to pry off the watch after I fixed it dry, when I stuck it on there after wet-napping the watch, I didn't dry it completely and it just popped right off when I pulled it. So don't take it swimming. Pairing Chronos with your phone is as easy at downloading the app and turning on Bluetooth. It's iOS only for now, but Chronos promises an Android app sometime in November. Once it's paired, you've got a very basic smartwatch. When your phone rings or you get a message, it'll buzz your wrist with its little haptic motor and light up the LEDs. What color light and how many buzzes depend on you. You can set what you want for different alerts. I've got dark blue and single or double buzzes for Facebook, and yellow with a short triple buzz for Snapchat. If the lights are too flashy for ya', you can opt for no LED and just use the vibration mode. There's a familiar functionality going the other way, too. You can trigger the shutter while the camera app is open, silence the ringer or control your media player with taps on your wrist. Chronos will also let you keep tabs on how many steps you take over the course of a day, and sync that information with HealthKit, so it's a little fitness tracker, too. And of course, if you lose your phone, you can find it by tapping repeatedly on your watch until it starts ringing. (telephone ringing) You can also do the opposite move via the app if the thing you've misplaced is your watch. But, you better hope the room is dark and quiet because neither the lights nor the haptics are terribly strong. That's the biggest complaint I have about Chronos right now. Even when I max out the vibration intensity, it's not always easy to feel the wrist buzz when I get an alert. It's not always easy to tell how many buzzes I've gotten, and I can't always see what color it's putting out, especially in daylight. Considering that color and vibration count are the only things that allow me to tell apart a Snapchat from a text message, that can be frustrating. Also, there are a few bugs here. A spelling error in the app, yellow showing up as green, that kind of stuff. Obviously, this isn't the final software. I expect Chronos to iron out some of this as the launch goes on. And the company is also planning on offering more options for notifications, both in haptics and in lighting. When you wanna recharge it, which should be every other night or so depending on your usage, you just click it in to the included base and plug it into the wall. Given my short time with Chronos and the prerelease software, I can't yet offer a buy/don't buy recommendation. That's why this is a hands on and not a review. And, for $99 it's definitely something you'll wanna carefully consider. You can get a Pebble or a last-gen Android Wear watch for the same price. But, those are for people who want a smartwatch. The Chronos is for people who wanna make their existing timepiece a little smarter. I'm old enough to treasure some watches that were given to me as gifts, so I understand that. If you do, too, Chronos is shipping now. You'll find the link in the description below. Be sure to check out MrMobile's review of the new Apple Watch and that crazy Casio from last summer. And subscribe on YouTube to catch more MrMobile videos just like this one. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Michael Fisher",
        "Chronos",
        "watch",
        "fan of smartwatches",
        "Fisher",
        "Michael",
        "app",
        "Android Wear watch",
        "big fan",
        "wrist",
        "Chronos hopes",
        "question Chronos",
        "question Chronos hopes",
        "disc",
        "Pairing Chronos",
        "Chronos promises",
        "phone",
        "smartwatch",
        "buzzes",
        "expect Chronos"
    ],
    "transcript_entity_values": [
        "about 80 bucks",
        "a day",
        "Casio",
        "Snapchat",
        "Apple Watch",
        "YouTube",
        "smartwatches",
        "Facebook",
        "Chronos",
        "a couple days",
        "max",
        "Elliot Havok",
        "Michael Voiceover",
        "last summer",
        "Chronos",
        "Pebble",
        "99",
        "MrMobile",
        "November",
        "HealthKit",
        "Michael Fisher",
        "Android",
        "Pairing Chronos"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "FAC",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON"
    ]
}