{
    "id": "7y-Ywn0pDwU",
    "title": "People should buy these - Drop + EPOS H3X",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-01-29T20:15:20Z",
    "video_url": "https://www.youtube.com/watch?v=7y-Ywn0pDwU",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "drop",
        "headphones",
        "gaming",
        "cheap",
        "affordable",
        "budget"
    ],
    "views": 165280,
    "likes": 5923,
    "comments_count": 323,
    "description": "Thanks to MANSCAPED for sponsoring the video! Get 20% OFF + Free Shipping at   Drop is back with another gaming headset and their new H3X which they created with EPOS looks like it could be a great option for gamers with a more limited budget. Does Adam think these are worth the money or should you buy a video game instead?  Buy a Drop + EPOS H3X:   Buy a EPOS GSX 1000 2nd Edition Gaming Amp:  Buy a HyperX Cloud II Gaming Headset:  Buy a Logitech Zone Vibe I00 Wireless Gaming Headset:  Buy a Logitech G733 Wireless Gaming Headset:  Buy a Corsair Void RGB Elite Wireless Gaming Headset:  Buy a Razer Nari Ultimate Wireless Gaming Headset:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Awful puns 0:42 Unboxing 2:24 Design and build quality 3:40 Sponsor - Manscaped 4:05 Comfort, fit, and feel 5:04 Sound quality and mic impressions  7:12 Gaming and spatial audio 8:19 Overall thoughts 8:51 Outro",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://lmg.gg/nXd3l",
        "https://geni.us/zmOb",
        "https://geni.us/97V9",
        "https://geni.us/l11Q",
        "https://geni.us/BUMK0wO",
        "https://geni.us/aRkMjY2",
        "https://geni.us/wz6W6Fg",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- [Bell] Okay, Adam, start this video. Just whatever you do, just don't make a Drop pun. It feels dumb. - Oh man, that feels pretty EPOSsible. Ah, hecks, that was a bad one. You heard it here first. It's the Drop + EPOS Hex gaming headset. You might know of Drop. This channel has long history with that company. They used to be called Massdrop, but then they stopped selling things other than headphones and keyboards and now they're doing all sorts of crazy cool collabs in this space. They've released a lot of really exciting and interesting products like the Drop x THX Pandas, whole line of mechanical keyboards and their latest collab is with EPOS. Now, you might not be super familiar with EPOS, but they're a subsidiary of Sennheiser. They kind of focus on gaming peripherals and audio. I actually own one of their products. I have their GSX 1000 2nd edition gaming amp. They have a pretty broad selection of products over a pretty sizable price range. Today, we're looking at something more in the budget category and it is a gaming headset. Inside the box you got cardboard, a couple of bags, some warnings and stuff like that. Oh, a welcome note. That's kind of cool. They have a frequency response graph on here. So, what they're mainly promising with this is a more neutral sound signature. You can see that the old H3s were very, very, very basey with a 10 DB boost in the base just from like 100 hertz back. That's nuts. This only goes up to like 12,000 kilohertz. That just seems a little bit, a little sneaky. They make you think that it's gonna be really good, but they don't show the part that's the hardest to nail down, which is the high treble. We also got some cables. Oh, these are actually pretty nice. So, you got a split microphone and headphone cable to a TRS connector which is kind of annoying because it's less common. What I would prefer to see, if you're gonna do a switchable cable, would be just another 3.5 millimeter adapter or even a mini one just 'cause it's a more common cable. The other cable in the bag is the combo jack. It's three poles. It's got the microphone, the left and the right audio. It's a very nice weave to them, which is kind of unexpected 'cause this is at quite the low price point. This is another addition of their H3 headset, which retails for about $100 U.S. This is coming in cheaper at just 80. Ooh, that's a nice light price. One thing that inspires confidence for me is that they're not trying to be a wireless headphone at that price point. Being a wireless headphone at that price point would be really difficult. Once you had batteries and all the electronics and the wireless transmitters, costs add up really quickly. This is sticking just to the good old cable and that's really all you need. I actually don't like wireless headphones, because I have too many issues with them. I like 'em when I'm commuting. I don't like 'em at my desk. First off, these are kind of small. Do you think these, kinda like they're for kids? The headband looks like it extends a good amount. Let's look at what we got on the device itself. It's all plastic, very plastic. You got a shiny plastic and a dull plastic and a shiny plastic and a dull plastic. They're very light, but they don't rattle. They sound pretty solid. You have a mic arm which has a mute switch on the way up and down, so if you pull the mic all the way up here, it starts to mute. That's a surprisingly high actuation point for that mute, but still a great feature. Nice to be able to just toss it outta your head instead of trying to fumble through your window settings. On the right hand side, you have a volume dial. They only give you 180 degrees of motion. They don't give you a full rotation, even. That's it. There's no RGB. There's no buttons. The head band itself is cushioned and it has a bit of a, kind of a nylon weave to it. Plastic leather ear cups with, like, almost like a, like a suede texture, which is kind of surprising. I don't know. Heck yeah, they're removable. Always like to see that. If there's anything that's gonna go quickly on your headphones, it's gonna be your ear cups. A nice thing is that, because you're purchasing from a more established brand, you can feel relatively confident that you're gonna see some of these parts actually available, but never buy on future promises. Hopefully these are gonna be nice, durable ear cups. Do we have a gaming computer here? - [Bell] No, but we do have a sponsor. - Oh, MANSCAPED. This video is brought to you by MANSCAPED. Their performance package 4.0 kit is designed to contain everything you need to make grooming below the waist easy. It includes the updated LAWN MOWER 4.0, with wireless charging, a weed wacker nose trimmer, for those tricky areas, plus some other goodies, like the CROP PRESERVER and CROP REVIVER sprays, for deodorizing and toning. I don't know what you're toning down there, but it does it. Get 20% off plus free international shipping using the link down below. Comfort-wise, there's not a lot of space in this ear cup. I don't have the biggest ears, but I find that it touches all around the inside. Not to a point that's uncomfortable, but it could get annoying longterm. Blocking out sound. David, do you wanna say something to me? - [David] Marvel Snap is one of the worst games I've ever. - It's funny, it makes it sound like I'm really muffled, but I understood every word you said and I'm also hurt. There's not automated noise canceling, but it's just not a very isolating headphone. For plastic, it's quite a firm headband. I've had far more expensive headphones with far weaker feeling headbands. And I'd also found that the cushioning on the top is enough. These are such a light pair of headphones, being all plastic, that there's not gonna be much dig into the top of your head at all. Cable noise is a bit higher than I'd like. Definitely if it's kind of sitting around here or if you're wearing like a zipper and you're moving your head a little bit you're gonna hear cable noise up in here, in the left ear, which is a little bit disappointing. The stress relief on these feels pretty solid. For the price that you're paying, I think that they're, the build quality is fine. It's not exceptional. I wouldn't call it a deal breaker, at this point. They have a lot of base, but it's not very good. It kind of makes things sound a little farty. There's volume to it, but there's no definition or precision. It feels like I'm just hearing an overwhelming base as opposed to like a base hit. When you get further up into the mids things get pretty muddy pretty quickly. Instruments are not detailed, they're not separated very well, and on the high end you can hear that it's kind of that V-shaped audio where you kind of add a lot of sparkle to the treble to make it sound more vibrant and lively. This is far from the most egregious. It's not clinical. I would never say that this is for critical listening. There's a warmth to these that I don't mind, but the lack of definition and clarity is disappointing. And also, it's a very claustrophobic sound stage, which does not bode well for a gaming headphone, considering that you want everything to be as positional as possible. There is no side tone, so you won't be able to hear yourself when you're chatting with your friends. You'd have to set that up on your own system. A little bit disappointing. It would be nice to at least have that as a feature. Maybe it's enabled in software, but again, not a must-have. Some people also really hate side tone. They find it super distracting. I always like to have the option. The mic doesn't extend very far and it's bendable here. One of these like bendi mics that don't really ever stay in the exact position you want them and take forever to fiddle with, but they work. It gets the job done. And at $79, you kind of just want to be getting the job done. One nice thing is that these actually will also work with your consoles, as well, because it's just a audio jack, so you just plug it into your controller. This is a microphone test for the Drop EPOS H3X, or Hex, gaming headset. From what I just listened to, I thought it sounded pretty good. What do you guys think? Let me know in the comments below. If this microphone sounds good I'm actually pretty impressed, which is a great sign. I feel like, so far, I've been a little harsh on this, talking about it's poor music performance, stuff like that, but I wanna keep this all in perspective in that this is an $80 headphone. It's not gonna be this Hi-Fi audio file experience. And, so far, in terms of build quality, in terms of audio quality and in terms of mic quality, I'm pretty impressed. We're gonna do a little bit of gaming on it, get a sense for how it sounds with some spatial audio. Sometimes it could be, like, the music that I was deciding to listen to that made the sound stage sound particularly bad and it might be better with something with a more three-dimensional sound engine rather than just, you know, (beep). (guns firing) I didn't get 'em, but they didn't get me. I killed the entire enemy team. I only saw two of them. I killed three of them when my eyes were closed. Sound wise, you can kind of see why they've mixed things a certain way. When you shoot your gun, there's a great oomph to the base when you (gun firing) are listening for, like, noises, like enemies coming around the corner. There's a little bit of spike in the treble that helps, makes things clearer. - [Game] Counter terrorists win. - Counter terrorists won. Positionally, I'm getting a better idea of it. Still not amazing. There's no, sort of, additional software, like 3D spatial audio trickery, that they're doing. This is all just playing with the headphones and with the audio engine in CSGO. At the end of the day, these aren't perfect but what could you expect at $80? One thing to note is that there's a lot of competition in this price range, around the same price and just a couple of steps up. You've got things like the HyperX Clouds or some Logitech headsets. Also, you're on the cusp of wireless gaming headsets, so you need to take a look at the feature set that those other products offer before you go with this. But if you want something that sounds fine for the price, is plug and play, will work no matter where you use it and gets all of the basics down really well, this is a really good option. Good job, EPOS and Drop. (headset clicks) Thanks for watching \"Short Circuit.\" If you like this video why don't you check out my video about the Razer Barracudas. They were not worth the money.",
    "transcript_keywords": [
        "kind",
        "sound",
        "Drop",
        "pretty",
        "price",
        "plastic",
        "gaming",
        "EPOS",
        "audio",
        "bit",
        "nice",
        "Drop EPOS",
        "good",
        "cable",
        "headphones",
        "headphone",
        "Adam",
        "things",
        "EPOS Hex gaming",
        "wireless"
    ],
    "transcript_entity_values": [
        "180 degrees",
        "three",
        "Adam",
        "One",
        "the Razer Barracudas",
        "U.S.",
        "Drop",
        "20%",
        "MANSCAPED",
        "Logitech",
        "Today",
        "H3s",
        "the Drop + EPOS Hex",
        "Pandas",
        "H3",
        "Sennheiser",
        "David] Marvel Snap",
        "79",
        "MANSCAPED",
        "David",
        "Short Circuit",
        "CSGO",
        "about $100",
        "10",
        "first",
        "Massdrop",
        "12,000 kilohertz",
        "two",
        "4.0",
        "80",
        "the end of the day",
        "RGB",
        "the Drop EPOS",
        "First",
        "jack"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "LAW",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "NORP",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON"
    ]
}