{
    "id": "85o_x7OoET0",
    "title": "iPhone 8 Review [Part 1]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-09-22T11:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=85o_x7OoET0",
    "category": "Science & Technology",
    "tags": [
        "iphone 8 review",
        "iphone 8 plus review",
        "iphone 8+ review",
        "iphone 8 review official",
        "mrmobile",
        "michael fisher",
        "iphone 2017",
        "iphone 10",
        "iphone x",
        "imore"
    ],
    "views": 352750,
    "likes": 10478,
    "comments_count": 924,
    "description": "The iPhone 8 is already one of the most recognizable smartphones on the planet because you have to look really close to discover it's not just an iPhone 7 with a glossy paint job. But spending two days with an iPhone 8 and iPhone 8 Plus in New York City reminded me that you shouldn't judge a smartphone by its chassis. The iPhone 8 family carries the fastest processor on the market and better low-light cameras than the competition quite a far cry from the \"specs aren't everything\" Apple of years past. Join me for part 1 of my iPhone 8 review/iPhone 8 Plus review, and stay tuned for Part 2 coming the week of September 25!   [SPONSOR]  This video sponsored by Tech21. Get your own Tech21 iPhone 8 case here:  iPhone 8 Plus:  iPhone 8:    [SUBSCRIBE]     [ABOUT THE iPHONE 8 INITIAL REVIEW]  MrMobile's iPhone 8 / 8 Plus Initial Review was made possible by a collaboration with iMore. The review units featured in this video are pre-production samples on loan from Apple. They were tested over the course of two days and two nights in New York City on T-Mobile and AT&T.  Audio for this video was recorded on a ClipDigital lapel mic connected to an iPhone 8 Plus review device. Late in the editing process, VO input levels were found to be too low, requiring amplification in post. MrMobile knows it's sub-optimal  but not to worry! He'll be back in the sound booth for Part 2!   [FURTHER READING]  iPhone 8 Review at iMore:    [MUSIC]  Robot Town by Phil Gardiner, available at Premium Beat:   Rule the World by Gyom, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://bit.ly/2jPBxAR",
        "http://bit.ly/2w9URKE",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.imore.com/iphone-8",
        "https://www.premiumbeat.com/royalty_free_music/songs/robot-town",
        "https://www.premiumbeat.com/royalty_free_music/songs/rule-the-world",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] Do you know what this is? - [Voiceover] I know what this is. - [Mr. Mobile] Of course you do. How could you mistake the new iPhone for anything else. Put the iPhone 8 next to the iPhone 7, and subtle changes like the new glass back or the revised aluminum sides or the trim around the camera lens, they kind of fade away. It takes using the 8 and 8+ to see where they stand out, and I've spent two days doing just that. I'm Mr. Mobile, and this is my initial review of the iPhone 8 and 8+, brought to you by Tech 21. (energetic music) A lot of reviews have already gone up, so I'm not gonna retread all the stuff you already know about the iPhone 8. The new IOS 11 operating system, the true tone display, the spec sheet, this is stuff you can read about. And I'll suss out the important bits in the second half of this review, landing next week. For now, I want to talk about the three main standouts that have stuck with me during my time with iMore and their two iPhone review devices. To a great many of you, the first one is gonna be the least important. But you know what? I don't care. I love it. Since Palm introduced it in 2009, wireless charging has been one of the most misunderstood smartphone features. And I'm not gonna relitigate the case here, but I suspect Apple fans will already understand what I mean when I say this should have been on the iPhone years ago. The zen-like simplicity of ditching fiddly cables and ports for just placing your phone on a pad, it seems especially well suited to the iPhone. To be fair, even mighty Apple isn't immune to the drop acts of physics. The charge rate is just as slow as the included wall adapter. Slower than the fast wireless charging on the newest Samsung phones. I still think it's great that iPhone users now have the option though, and Apple's halo effect means we should see more wireless chargers pop up in more places now. Fun fact, you can charge the phone without taking your case off, which is nice. The second and by far the most noticeable standout, the iPhone 8's cameras. It wasn't immediately apparent just how much better they are, because Apple is still using LCDs for displays on these. Those colors just don't pop as much as the OLED screens on some Android phones. But the iMore team and I did an awful lot of photo and video capture with the new iPhones, putting them side by side with shots from Android flag ships, and I was surprised to see how often the iPhone photos came out on top in terms of detail and low light performance. If you've been following me on Instagram for a while, you know I almost exclusively shoot with Android phones, most recently the LG V30 and Samsung Galaxy Note 8. But in almost all of our side by side shooting this week, the iPhone has rendered pictures with less noise, or pulled more light from a scene, or done a better job stabilizing a bumpy walking video. Over on the iPhone 8+, I'm kind of not as enthused about the portrait mode, still. The new artificial studio lighting effects are really amazing to see in person, but you usually have to take four or five bad ones before you end up with one you'd want to share. I need to spend more time with this to decide how I feel about it, but I don't expect I'll label it a must have feature. Making up for that are the video upgrades. Shooting 4k in 60 frames a second is something even my primary studio camera can't do. And I filmed for 20 minutes straight with an A+ without it breaking a sweat. And there's slow mo in full HD at 240 frames a second. I'm sorry for getting all numbers heavy on you, but those numbers give you video like this, which you can't get at the frame rated resolution with any other phone right now. There's more slow mo phone dropping candy at the end of the video, by the way. Keep in mind, I edited this on Final Cut Pro before I got the high sierra update, so codec conversion has probably dropped the quality somewhat. This is something I hope I won't have to deal with when I publish part two of this review next week. Many of those camera features wouldn't be possible without Apple's new A11 SOC, which is my third big pillar of the iPhone 8 experience. I'm not a spec head, so it feels kinda weird for me to emphasize silicon, but by all accounts, the A11 is a beast of a chip. It's apparently so efficient that the iPhone 8 can run ARKit, Apple's augmented reality suite, using something like half the resources the A10 in the iPhone 7 did. The neural engine in the A11 also makes a lot of that photo magic possible, the stuff I talked about a second ago. And it's a more power efficient processor to boot. All that boils down to some significant future proofing. In short, the iPhone 8 should age well. At least, on the inside. Of course, despite all those awesome features, the predictably designed iPhone 8 won't the be phone to lure away restless would-be Android converts. That role falls to the better equipped iPhone 10, which offers a much bolder aesthetic to go with its stratospheric price tag. But the iPhone 8 isn't for them, it's for 6 and 6S owners who want a solid upgrade in a familiar form factor. Just beware, that familiar form factor is a glass sandwich. More fragile than it's metal backed predecessors. To protect it, snap up a custom case from today's sponsor, Tech 21. These folks have been building phone cases for ten years, and their materials are rigorously tested in partnership with the National Physical Laboratory. From ultra slim, lightweight designs, to wallet cases, Tech 21 gives you ten foot drop protection, designed specifically to keep you iPhone 8 covered drop after drop. Get yours at the link in the description below. More on the iPhone 8 from phone calls to portrait mode in part two of this review, coming next week. Oh and fun fact, I recorded the voiceover for this in a hotel room in New York City with a clip mic digital microphone plugged into an iPhone 8+. Please subscribe if you enjoyed this video. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "iPhone",
        "Apple",
        "phone",
        "Android phones",
        "review",
        "video",
        "Android",
        "iPhone review",
        "iPhone review devices",
        "side",
        "phones",
        "week",
        "Tech",
        "drop",
        "stuff",
        "Samsung Galaxy Note",
        "case",
        "camera",
        "Samsung phones",
        "iPhone photos"
    ],
    "transcript_entity_values": [
        "the second half",
        "third",
        "the iPhone 7",
        "Samsung Galaxy Note",
        "Instagram",
        "half",
        "2009",
        "4k",
        "the National Physical Laboratory",
        "Samsung",
        "6",
        "ten foot",
        "iMore",
        "iPhone 10",
        "Apple",
        "ARKit",
        "New York City",
        "iPhone 8",
        "60",
        "four",
        "two days",
        "Mobile",
        "A10",
        "today",
        "iPhone",
        "first",
        "five",
        "6S",
        "240",
        "A11 SOC",
        "two",
        "the iPhone years ago",
        "A11",
        "IOS",
        "20 minutes",
        "ten years",
        "second",
        "V30",
        "iPhones",
        "LG",
        "Tech 21",
        "11",
        "next week",
        "Final Cut Pro",
        "three",
        "this week",
        "Android",
        "8"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}