{
    "id": "8BrZHCQ_l28",
    "title": "Rivian's R2, R3 and R3X launch event in 5 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-03-07T19:44:24Z",
    "video_url": "https://www.youtube.com/watch?v=8BrZHCQ_l28",
    "category": "Science & Technology",
    "tags": [
        "rivian",
        "rivian r2",
        "rivian r3",
        "rivian r3x",
        "rivian r1t",
        "rivian r1s",
        "rivian review",
        "rivian stock",
        "rivian r2s",
        "rivian truck",
        "rivian suv",
        "rivian news",
        "rivian 2024",
        "rivian experience",
        "rivian r1s review",
        "rivian rumors",
        "rivian leaks",
        "rivian r2t",
        "ev",
        "rivian r2 platform",
        "rivian r1t review",
        "r1t",
        "rivian r2 suv",
        "cars",
        "transportation",
        "the verge",
        "verge"
    ],
    "views": 196066,
    "likes": 3856,
    "comments_count": 279,
    "description": "For years, Rivian has been promising to make a smaller, more affordable electric SUV that will sit alongside its pricier R1T and R1S vehicles, and that day is finally here. The R2 wont go into production until 2026, but when it does it will come with an estimated range of 330 miles, a 060mph time of three seconds, and a starting price of $45,000. We also got a look at the R3 the R2s sibling, and the R3X, the R3s performance trim which has a wider stance and smaller crossover shape. Heres everything you missed from the launch event.  #Cars #EVs #Transportation   Read more:   00:00 R2 01:41 R2 Battery and Range 02:55 R3 04:26 R3X 05:05 Charging Stations  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3wOe1tW",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- I'm so excited to have all of you here. Let me introduce you to R2. (tranquil music) And so we're gonna walk through the vehicle, but just starting here at the front, in the front of the vehicle, we have a large front storage trunk. This is great for putting luggage, backpacks, your gear. Now, if we go around the side of the vehicle and you just saw, or maybe you saw these quarter windows pop out. We leverage the negative pressure off the back of the vehicle to pull natural air through and it creates this beautiful open air feeling experience. And then the rear glass, which you just saw drop also opens. The second row seats fold flat, but also, the first row seats fold flat and the first row seats folding flat, (audience cheering) let's say you're camping or staying right in the vehicle, it creates this awesome in-vehicle camping experience. It's about 400 millimeters shorter than an R1S. And in addition to being shorter, or shorter in wheel base, it's also lower in height. One of the points of feedback was a desire for a glove box. (audience cheering) And on R2, we over delivered and we put two glove boxes in. (audience laughing) So we have these really nice large scroll wheels on the steering wheel. There's dynamic haptic feedback. So it allows us to adjust what it's feeling like when you're scrolling. A lot of work went into the doors. Moved the speaker out of the door, gives this space for a large water bottle here. And of course, it wouldn't be a Rivian, you have another flashlight in the door. (audience cheering) And we built an entirely new platform to underpin this vehicle. And it's built around a a 4695 cell. So it's a cylindrical cell, 46 millimeters in diameter, 95 millimeters tall. It's a much larger cell than the 21 millimeter diameter cell that we have in R1 today. So the battery pack in the floor actually makes up a big part of the vehicle structure. The top of the battery pack is actually the floor of the vehicle. We have a single motor, rear wheel drive variant. We have a dual motor, one motor in the front, one motor in the back, all-wheel drive variant. And then we have a tri motor, two motors in the back, (audience cheering) one in the front. And then the highest performance variance of the vehicle: zero to 10 in well undeR3 seconds. (audience cheering) Yeah, so it's very quick. And then all those motor combinations can achieve over 300 miles in range. And this has 11 cameras, five radars, you know, four radars in a corner, one long range radar in the front, which will label this to enable this to have a very high level of self-driving. And for us that represents being able to get on the highway, take your hands off the wheel, eyes off the road, and truly operate it where you get your time back. And so the R2 starting price will be $45,000. (audience cheering) And you can reserve one starting today. I'm really, really excited to talk about R2's sibling. - What? - Which we call R3. (audience cheering) (lively music) - [Audience Member] Oh my god, (audience cheering) (lively music) - So you didn't expect that one more thing here. (audience cheering) (audience laughing) So R3, it takes the package of R2 and the platform, it shrinks it, it puts into our take on what is a crossover. Up front, we have a front storage trunk, much like what we had in R2, but I wanna spend some time in the back. And what you just saw happen is the rear lift gate came up. Just like we saw in R2, the first and the second row seats fold flat. But when we close this, there's a second way to get to the back, which we call our flipper glass. And (audience cheering) what I love about this is it makes it easy to get things in and out, but this actuation can actually go to multiple heights. Same thing we had with R2 with the control wheels and the steering wheel. Lots of flexibility in terms of storage, two glove boxes. And of course, we still have a flashlight here. (audience cheering) But there's one more thing. One more thing. We wanted to take everything that's embodied and put it into an even higher performance package. And this is something we call R3X. (upbeat music) Lots of subtle differences. It's a wider wheel and tire, little wider stance, more ground clearance, tri-motor setup. This is an interior combination we internally call rugged playful because it looks rugged and it looks playful. But the use of materials and the use of how we laid out those materials with cork and with interesting weaves and interesting ways to anodize metal, it feels so uniquely Rivian, but also so unique to this vehicle and to the performance variant. We're gonna be pulling the timing in to allow R2 to start deliveries in the first half of 2026. (audience cheering) So we're also building a high-speed charging network. We call it a Rivian Adventure Network. It's rapidly being built out. Within a few years, we'll have 600 of these charging locations, and it'll be an open network, so it'll be Rivian vehicles, as well as non-Rivian vehicles. And beyond that, we, of course, integrate across the other third party platforms. And importantly, in fact, this month, our vehicles will be able to access the Tesla Supercharger network. (audience cheering) Thank you everyone so much for joining us today to hear about our future.",
    "transcript_keywords": [
        "vehicle",
        "front",
        "wheel",
        "motor",
        "back",
        "row seats",
        "Rivian",
        "row seats fold",
        "call",
        "vehicles",
        "seats fold flat",
        "network",
        "Rivian vehicles",
        "row",
        "seats",
        "thing",
        "seats fold",
        "flat",
        "cell",
        "fold flat"
    ],
    "transcript_entity_values": [
        "zero",
        "Rivian Adventure Network",
        "11",
        "45,000",
        "46 millimeters",
        "one",
        "seconds",
        "non-Rivian",
        "third",
        "four",
        "today",
        "Tesla",
        "about 400 millimeters",
        "R3",
        "a few years",
        "the first half of 2026",
        "R2",
        "R2",
        "this month",
        "two",
        "95 millimeters",
        "One",
        "over 300 miles",
        "second",
        "4695",
        "five",
        "Rivian",
        "first",
        "600",
        "21 millimeter",
        "10"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "LOC",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ]
}