{
    "id": "8CTkJmQXwnw",
    "title": "Dual-Screen Laptop Monitors! Mobile Pixels DUEX Lite & DUEX Plus Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-03-12T20:58:40Z",
    "video_url": "https://www.youtube.com/watch?v=8CTkJmQXwnw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Mobile Pixels",
        "Unboxing",
        "Work From Home",
        "WFH",
        "WFH Office",
        "WFH Monitor",
        "Best Monitors for working from home"
    ],
    "views": 344527,
    "likes": 9754,
    "comments_count": 617,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we are checking out two things that are not even out yet. So sit down, get hyped. We have two prototypes of these mobile laptop monitors by Mobile Pixels. I'm gonna put a link in the description if you wanna check out their Kickstarter and get all of the information about them. But I'm really excited about this because these new versions are smaller, thinner, lighter, and basically all around better than the previous versions. Now, I was so inspired by kind of their story of creating these. They've had several very successful Kickstarters. And now with the announcement and launch of these, it's sort of the perfect time because everyone is still kind of working from home and I feel like that's gonna be kind of transitioning into the next year. And a lot of people have laptops, but being able to have an external monitor or an extra screen is something that not everybody has the luxury of having, but with this, this is at a really great price point and it just attaches right onto your laptop and it kind of gives you that flexibility of using it when you want it and not using it when you don't want it. Thank you to Mobile Pixels for sponsoring this video and getting me these two prototypes to check out to show to you guys. So, let's open these up and then I'll show you guys in comparison to the previous versions, what's new? What's cool? And we're gonna test it out. Also did I mention? I know I didn't mention because I just started the video. You can actually connect your Nintendo Switch to one of these as well. I'm sold. (scissors snipping) (upbeat music) Whoa, okay, it's unboxed. Whoa, whoa, look at you. Whoa, okay, that's cool, that's pretty cool. Okay, let's open up the Plus. (upbeat music) Yeah, that's cool. So it looks like these just actually stick to the back of the laptop, like that's it. Okay, okay, cool. So what's cool is these monitors are powered by USB-C so not only is it powered by it, but that is how you'll actually be receiving the signal. They do have a little converter here. So if you don't have USB-C, you'll be able to use just regular USB 3.0, and you'll be good to go. I just wanna set this up to my computer now. Where are you? They did say that this will work on laptops from around 13 inch to about 15 and a half. It does work on windows and Mac as well. So we're gonna test out the light version first. I am very excited about the plus version because this one also allows you to connect to Android phone. It has auto rotation and you can connect it to your Nintendo switch. Let's try this one out first to get a feel for how this thing works. To the screen on here is 12 and a half inches. So it looks like we just attach these little magnetic pucks to the back of our computer. We're good to go. So we take off this adhesive. So now we're gonna flip this over. Cautious, I'm nervous. I think we're ready. Oh, yeah. Okay, alright, it's on, it's on. I did it I get it. That all makes sense. So you basically, you're just pulling this out and then the whole thing just slides like that. This is cool. I used to work at coffee shops a lot. Like I would take my laptop. I wish the coffee shops were open because this would be me. Look like I would be so cool. (keyboard clicking) Like people would always come up to me, say, \"What are you working on? \"What are you doing over there?\" I'd make a lot of friends in this way. I don't make friends now because it's COVID times. So the magnets on the back are actually sliding and it's allowing this to come all the way out. And because it's magnetic, like we just go like this. That's it. Oh, this is cool. This is cool. Let's plug it in and try it. I actually think I want my monitor come out this side. It makes it so easy, it's just magnetic. And these are what is allowing it to slide in and out. Look, look. I have a whole side desktop now. Hold on a second. This also flips all the way around like this. So if I wanted to show you something. Look, okay, let me put a picture. There you go. And now, if I wanna get back to my own content, I can. It's also kind of cool because I could use this as like a little monitor to the side, like it doesn't actually have to be on. I just love that I can just take this off and on so easily. Oh man, let's test out the Pro version now. So I liked that this has two additional USB-C ports which is nice for something like the MacBook Pro 13 inch because it only has two ports as is so you are giving up one port for the monitor and then you're gonna need to charge obviously so that doesn't leave you with a lot of port options. The Pro version is also bigger. And since we already have these magnets set up, we shouldn't have to do any switching. Okay, let's pop on this Plus, see what this looks like. It fits perfectly, right over the top of the magnets that I already had on with the light. Does have a really cool Kickstand accessory, which I don't currently have but that's also on the Kickstarter, Kickstand Kickstarter. It also has pass through charging so if you want to plug this in to charge your computer, that also works. I really like this black color. It's a kind of like a rushed aluminum type look. This has a nice matte black. And the buttons on the side, much like the light version. This is how you'll adjust the brightness of the monitor itself. Like I'm ready to do business. (keyboard clicking) Okay, this is actually pretty cool. I got a picture of me and Maddie there. Probably, you know, if I was working, I would have something open here maybe some extra footage, some graphics, maybe the timeline, or I can have this as like a preview browser or I could just be watching YouTube videos while I'm working on an Excel spreadsheet or a pages document or buying Bitcoin. Also don't forget, this comes off, okay. At my desk, when I'm normally working on my Mac Pro, I actually have one monitor set up vertical, and the other one just regular horizontal like this. And that's mostly because I like to be able to have a full screen of all of my thumbnails, or if I'm searching through footage, this just seems like a much easier way for me to kind of organize it. I'm basically replicating my desk set up (keyboard clicking) but on the go. So to show you guys a quick little comparison between the new versions and the previous older ones, what's really great about the new ones is you don't have to install any additional drivers. Everything just automatically works. And these ones are so much lighter than the previous versions. It's significant. The bezels on the newer ones are so much smaller so you're actually able to get a smaller screen but with a larger screen real estate because of these smaller bezels. I do really like the newer magnet placement because they're like these tiny little circles whereas the older ones have these rectangles and this doesn't actually slide. This gives you a lot more flexibility depending upon what size laptop you have. (gentle music) So setting up the Nintendo switch is actually very easy. So you plug in the original Nintendo switch charger and then plug in your Nintendo switch using the USB-C cable. Like I didn't even know that this is something that I needed until now I have it. How did I live without it? Okay, I'm still wearing my Christmas outfit and my hair is a mess because I haven't played the game in so long. I'm wearing a happy new year hat. I probably have cockroaches in my house. Look at there it is, cockroach. Get him, get him, get him, get him, get him, get him, get him, get him, get him, squish. Well, thank you guys so much for watching. I will put a link in the description if you wanna get more information about both of these mobile monitors. This is really cool to get a chance to check these out before they're even released. So if you guys want more information, again, link in the description, and I will see you guys in the next video. (upbeat music)",
    "transcript_keywords": [
        "cool",
        "Nintendo Switch",
        "Mobile Pixels",
        "Nintendo",
        "kind",
        "Justine",
        "guys",
        "monitor",
        "Kickstarter",
        "mobile",
        "versions",
        "version",
        "USBC",
        "Pro",
        "laptop",
        "Pro version",
        "Switch",
        "lot",
        "working",
        "previous versions"
    ],
    "transcript_entity_values": [
        "Kickstarters",
        "second",
        "one",
        "USB-C",
        "the next year",
        "Kickstarter",
        "Justine",
        "Bitcoin",
        "Nintendo",
        "Excel",
        "12 and a",
        "Mac",
        "Maddie",
        "around 13 inch",
        "the MacBook Pro 13",
        "about 15 and a half",
        "Nintendo Switch",
        "today",
        "two",
        "YouTube",
        "Android",
        "first",
        "Mobile Pixels",
        "USB"
    ],
    "transcript_entity_types": [
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG"
    ]
}