{
    "id": "8D9hNkj6GaA",
    "title": "Your Graphics Card WON'T Do This (Upgrading VRAM)",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-03-29T18:00:23Z",
    "video_url": "https://www.youtube.com/watch?v=8D9hNkj6GaA",
    "category": "Science & Technology",
    "tags": [
        "gpu",
        "memory",
        "graphics card",
        "vram",
        "video",
        "gddr",
        "hbm",
        "solder"
    ],
    "views": 525393,
    "likes": 23840,
    "comments_count": 942,
    "description": "Check out Bitdefender for your special offer:   Why can't you add more memory to your graphics card?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/xdygB",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Upgrading your main system memory is a piece of cake. You buy a DDR module, you slot it in, and enjoy. But have you ever wondered why you can't do that with video RAM on your graphics card? This is a far question, especially considering how much VRAM modern games can require. You see, VRAM stores textures and other visual assets that the GPU processes in order to render all those lovely frames that appear on your screen. And as games have gotten more advanced, these visual assets take up lots of room, especially if you're gaming at high resolutions or high settings. And not only that, but because of how fast your GPU has to spit out all those frames, it needs access to the information in VRAM, oh boy, very quickly. Ha. Additionally, graphics rendering is a highly parallelized process, la-la-la, which means your GPU's architecture is built to work on several data streams at once. You can learn more about that right up here. But the bottom is that VRAM has a lot more bandwidth than your main system RAM. For example, a 1-gigabyte GDDR6X chip has a transfer rate of around 84 gigabytes per second, compared to DDR4-3200 which is only about 26 gigabytes per second. All this speed is actually a huge reason why you can't just add more VRAM. You see, the high bandwidth necessitates a large number of physical connections. For example, think about how many pins your CPU uses to both move data and ensure it has a sufficiently stable power supply to do so. But there's only so much room on a typical graphics card, so instead of having a big old socket, like motherboards do, manufacturers instead solder VRAM modules directly to the graphics card PCB to save space. And some types of video memory, such as HBM, are actually combined on the same package as the GPU itself. Not only does this take up less real estate, but it also cuts down on the risk of data errors. You see, moving all that data around at such high speeds introduces the possibility of errors, kind of like how trying to type really fast means that you're likely to make more spelling mistakes. Soldering VRAM chips directly on the board and integrating them tightly with a GPU is not only cheaper than engineering a socket or slot that an end user could add VRAM to, but it also removes a layer of complexity that could result in more data errors. Although there were some older graphics cards from way back in the day where you could slot in more VRAM, the amount of speed you need these days means it just isn't practical anymore. And even if you just tried to solder a higher-capacity VRAM chip onto your graphics card, there's a chance, a pretty high chance, it wouldn't work, due to the card's firmware being specifically tuned for the VRAM configuration it's shipped with. Not to mention you'd probably end up bricking your expensive GPU, so... Just, I wouldn't risk it. But even though games are requiring more VRAM than ever, the culprit of poor performance is much more often an underpowered GPU rather than insufficient VRAM. So if you're having weird slowdowns or crashes in a game you're playing, do a bit of research and see if you really need a higher-tier GPU rather than just more VRAM. And if you're using an integrated GPU, not a discreet graphics card like this one, those solutions actually use part of your main system memory as VRAM, so if you find yourself running low, you can go into your computer's BIOS and increase the amount that's allocated for video memory. Man, if only it were possible to just download more VRAM, like you can with regular RAM. It'd be so much easier. Big thanks to Bitdefender for sponsoring this video. Bitdefender Total Security protects your family's data, photos, and devices with their award-winning security and performance. Literally award-winning. Bitdefender just won the Outstanding Security Product Award from AV-Comparatives. Bitdefender works on Windows, Mac, Android, and iOS, and it lets you adjust notifications and services when playing games or watching movies to help maintain performance. It features network threat prevention and ransomware mediation to keep you protected, and also webcam protection, VPN services, and anti-tracking to keep you private. Check with the link in the description for a special offer on the Total Security package from Bitdefender, right now, just do it. Stay safe out there, guys. So thanks for watching, guys. If you liked this video, hit like, hit subscribe, and hit us up in the comments section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "VRAM",
        "GPU",
        "piece of cake",
        "graphics card",
        "graphics",
        "card",
        "data",
        "Bitdefender",
        "Security",
        "high",
        "video",
        "Total Security",
        "RAM",
        "buy a DDR",
        "main system",
        "Upgrading your main",
        "memory",
        "Bitdefender Total Security",
        "games",
        "DDR module"
    ],
    "transcript_entity_values": [
        "only about 26 gigabytes",
        "the day",
        "VRAM",
        "Windows, Mac",
        "Total Security",
        "1-gigabyte",
        "Bitdefender Total Security",
        "la-la-la",
        "these days",
        "RAM",
        "Android",
        "HBM",
        "DDR",
        "GPU",
        "AV-Comparatives",
        "around 84 gigabytes per second",
        "the Outstanding Security Product Award",
        "CPU",
        "PCB",
        "Bitdefender"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG"
    ]
}