{
    "id": "8J-V3J3CBes",
    "title": "Microsoft Build event in 5 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-05-23T17:44:24Z",
    "video_url": "https://www.youtube.com/watch?v=8J-V3J3CBes",
    "category": "Science & Technology",
    "tags": [
        "microsoft build",
        "ms build",
        "microsoft",
        "windows 10",
        "chatgpt",
        "chat gpt",
        "build",
        "openai",
        "open ai",
        "Windows 11",
        "co pilot",
        "Edge",
        "bing",
        "bing ai",
        "ai",
        "microsoft build 2023",
        "artificial intelligence",
        "bing chat",
        "open ai chat gpt",
        "openai chat",
        "microsoft ai",
        "what is chat gpt",
        "msbuild",
        "openai chatgpt",
        "tech",
        "the verge"
    ],
    "views": 263055,
    "likes": 5880,
    "comments_count": 263,
    "description": "Microsoft announced some major news at its annual Build keynote. This years Build heavily focused on AI, with new additions of the CoPilot experience to Windows 11 and Edge, as well as new Bing AI and Copilot plugins for OpenAIs ChatGPT. Plus, Bing is now the default search for ChatGPT. Heres everything you missed. #Microsoft #Tech #News   Read more:   0:00 Intro 0:05 Bing and Chat GPT Updates 0:38 Plugins in Bing and Chat GPT 2:00 Windows Copilot 3:10 Microsoft Fabric  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/4238LMH",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Hey, it's fantastic to see you all. Welcome to Build. We are bringing search grounding in Bing to ChatGPT. - Let's take a look. Here I am in ChatGPT. And as you can see now, Bing is the default and when I come in and select it, I can now ask sort of real-time queries. For example, let's ask what I should expect to hear about Build and .NET. And what you can see is the results now are more up to date. They include fresh content and they include citations. In fact, if you can see the links on that page there, you can click those and those those will take you straight to a webpage that's sourced by Bing. We're also excited to announce that we're gonna bring interoperability between ChatGPT and Bing for plug-ins. So you write 'em once and they're gonna run everywhere. So as you can see here in ChatGPT, I've got Zillow and Instacart enabled but I wanna show 'em to you here in Bing Chat. So we'll flip over and you can see again I've got the same plug-ins now in both Bing Chat and in ChatGPT. And what we're gonna show you now is I'll do a search here for houses in Chicago and I can ask for a set of criteria, learn a little bit about the neighborhoods, and now I can automatically call Zillow by saying, hey, give me three houses in a certain price range that meet my criteria. And what you can see is now I get these great options and I'm also gonna get all of the other great things you get with Bing, like helpful city guides and maps and prompts. They're gonna work not just in Chat and ChatGPT, they're gonna work across the entire web courtesy of the Edge browser. So here's an example. I'm on a webpage here checking out a recipe for a cake and now I can call Bing Chat and ask it to tell me, hey, give me the ingredients from this webpage. And notice, Bing can read the context of the webpage, understand those ingredients, put 'em into Chat and then I can say, hey, give me a shopping list for this. And it'll automatically call the Instacart plugin, take those ingredients right off the page and put 'em into an Instacart shopping. And with one click, I can get those now delivered to my house. We're excited to announce the Windows Copilot. Here I am in encoding project on my PC but I wanna configure my PC to help me be more creative and more productive. All I have to do now is invoke the Windows Copilot. I now just come down here to the task bar. I click on that and that will pop up the Windows Copilot on the right. This side pane here will be consistent across every app that you use on your PC. And just like with Bing Chat, I can now ask you questions, like how can I adjust my system to get work done? And not only will I get a bunch of great suggestions, but watch this, I can now with one click take action on those suggestions. For example, I can put it into focus mode. I also know that as developers we like dark mode. There's is a suggestion here for dark mode. So with one click, I'm now here on the dark side, and to really get going, I wanna get that coding playlist going. So I'll pull the plugin from Spotify and say give me a great coding playlist. In this case, Chill Vibes will come up and now I'll have it ready to go. And finally, there's a suggestion here that says, hey, to organize your PC, let's take advantage of Snap. So with one click, it snaps all the windows right in the place I need them so I can be super productive. - We're really thrilled to be announcing Microsoft Fabric. You know, it really brings together compute and storage. So it unifies compute and storage. It unifies all of the full analytics stack product experiences. It brings together governance or it unifies governance with analytics. And most interestingly, it unifies the business model across all the different type of analytics workloads whether they're SQL, machine learning, whatever job you want, you can use the same compute infrastructure. - [Narrator] Introducing Microsoft Fabric, a unified data analytics platform. One product, one experience, one architecture, one business model. Unified data is stored in OneLake, a SaaS data lake for the entire organization. Data is integrated and stored in an open format, allowing one copy to be used to train machine learning models, visualize data and run SQL queries on the lake and data warehouse. A unified experience brings together all the tools data professionals need: pipelines for orchestrating data movement, experiments for training machine learning models, semantic models for defining key metrics, and much more. - We are, again, really on a fast pace to build things that help us build this next generation of applications, but build them with safety first. Thank you very much and have a fantastic Build.",
    "transcript_keywords": [
        "Bing Chat",
        "Bing",
        "call Bing Chat",
        "Chat",
        "Windows Copilot",
        "data",
        "Build",
        "ChatGPT",
        "click",
        "Hey",
        "Windows",
        "Microsoft Fabric",
        "Instacart",
        "Copilot",
        "call Bing",
        "give",
        "webpage",
        "unifies",
        "great",
        "analytics"
    ],
    "transcript_entity_values": [
        "Bing",
        "Zillow",
        "one",
        "Build",
        "Instacart",
        "Chat",
        "Data",
        "three",
        "Spotify",
        "Chill Vibes",
        "Bing Chat",
        "the Windows Copilot",
        "OneLake",
        "One",
        "SaaS",
        "Edge",
        "first",
        "Microsoft Fabric",
        "SQL",
        "Bing Chat",
        "Chicago"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "GPE"
    ]
}