{
    "id": "8JAWz9Da5og",
    "title": "Why Don't They Make BIGGER CPUs?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-08-18T18:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=8JAWz9Da5og",
    "category": "Science & Technology",
    "tags": [],
    "views": 1554333,
    "likes": 73840,
    "comments_count": 2385,
    "description": "Sign up for Private Internet Access VPN at    Would larger CPUs help performance?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/TechQuickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://www.amazon.com/shop/linustechtips",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Have you had a look at your motherboard lately? Even though the CPU is arguably your PC's most important component, it still has about as much space dedicated to it as it did in 1993. I mean, the entire CPU package is only about the size of a couple of postage stamps, which raises the question. If they wanted an edge over their competitor, why don't Intel or AMD just make their CPUs bigger? Imagine how many cores and how much performance we could have if we had a CPU the size of a grilled cheese. Or am I missing something here? To answer, we reached out to our friends Matthew Hurwitz at AMD and Ben Benson at Intel, and we'd like to thank both of them for their insights. One easy way to conceptualize this is thinking about how a car engine works. Even in a smaller car, you could theoretically throw in a high performance, 10-cylinder engine instead of the responsible four-banger that carries you to your cubicle job. But obviously, a 10-cylinder engine costs a lot more to manufacture than an inline four. And even though CPUs are far smaller than car engines, adding more transistors isn't exactly cheap. Not to mention that if you make the chips bigger, the manufacturers get fewer CPUs per silicon wafer, driving up the cost of each one. Additionally, a larger die means that there's a higher chance of a given CPU being defective. CPU fabrication is a very complex process and not every one of those slices we just showed you is going to be usable. In fact, a significant proportion of CPUs are discarded at the factory because of very small defects that can hurt performance or even make the chip unusable. So manufacturers don't want to add even more complexity that will push their yields of sellable chips down, hurting their margins. But even if yields were close to 100%, it still doesn't make a ton of sense for manufacturers to make a larger die. You see, it's actually very difficult to produce a large CPU with tons of cores that run at the same clock speed as a CPU that has fewer cores and is smaller. Not only do you need to contend with more heat, it can also harm performance because at the clock speeds of modern CPUs, even a few extra centimeters can make it difficult to keep everything in sync, forcing you to run at lower clocks. This is especially true if you're trying to support that extra processing power with additional cache memory. This is part of the reason that if you've ever looked up the specs for high core count CPUs, you'll have noticed that the clock frequencies are generally lower than they are for more mainstream chips. Similarly to how WiFi is a trade-off between speed and range, CPU design is a trade-off between speed and die size, or more specifically, core count. So instead of trying to make the largest CPUs with the most transistors, manufacturers instead, think about how the processor is actually going to be used and optimize for that. Because a huge CPU die would have to run at a lower clock speed, it might not be as good for an application like gaming, where trying to get fast performance in a single thread is generally the best way to go. Additionally, simply brute forcing performance by adding more transistors doesn't always yield the best results anyway. Instead, the architecture of a CPU can be adjusted with specific use cases in mind, such as Quick Sync Video on Intel platforms to help with transcoding, or AMD's inclusion of PCI Express Gen 4 to enable super high speed storage. So remember that bigger isn't always better, and besides if they made CPU packages super huge, where would you put all that sweet RGB? Speaking of, where would you put all that sweet, segue to our sponsor... Check out Private Internet Access, the VPN that masks your IP address and encrypts your internet traffic. PIA has reliable service with thousands of servers in dozens of countries, and they've got no bandwidth caps. PIA offers configurable encryption and an internet kill switch to keep you in control of your connection and your privacy. And when you combine PIA with private browsing best practices, you can make websites think you're in a different country. With a single account, you can connect up to 10 devices at once with their clients for Windows, Mac, Android, iOS, and Linux, and you can try it out risk-free for 30 days, Just go to privateinternetaccess.com/TechQuickie. We're gonna have that linked down below. So thanks for watching, guys. You can like or dislike, depending on how you feel. Check out our other videos. Leave a comment if you have a suggestion for a future fast as possible, we do read the comments. And don't forget to subscribe, because if you do, your mother will call you and be like, \"Hey, why didn't you subscribe to Techquickie yet?\" You don't want your mom to call you about that. It's just awkward.",
    "transcript_keywords": [
        "CPU",
        "CPUs",
        "make",
        "performance",
        "AMD",
        "speed",
        "Intel",
        "clock",
        "PIA",
        "core count CPUs",
        "die",
        "manufacturers",
        "CPU die",
        "CPUs bigger",
        "clock speed",
        "size",
        "huge CPU die",
        "entire CPU",
        "engine",
        "entire CPU package"
    ],
    "transcript_entity_values": [
        "Techquickie",
        "up to 10",
        "Intel",
        "30 days",
        "Private Internet Access",
        "One",
        "Ben Benson",
        "1993",
        "privateinternetaccess.com/TechQuickie",
        "PIA",
        "Windows, Mac",
        "Linux",
        "Quick Sync Video",
        "10",
        "close to 100%",
        "AMD",
        "thousands",
        "AMD",
        "Android",
        "four",
        "dozens",
        "Matthew Hurwitz",
        "RGB",
        "CPU",
        "tons",
        "PCI Express Gen 4"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}