{
    "id": "8n2RRK6JhCA",
    "title": "Apple has MORE competition! - Sennheiser Momentum True Wireless 3 Earbuds",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-04-25T22:40:06Z",
    "video_url": "https://www.youtube.com/watch?v=8n2RRK6JhCA",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "Sennheiser",
        "True Wireless",
        "Earbuds",
        "AirPods",
        "Airpods Pods",
        "Bluetooth",
        "Ear Bud",
        "Apple's AirPods finally has some competition",
        "Apple FINALLY has some competition",
        "Sennheiser is now directly challenging Apple",
        "Settings",
        "Equalizer",
        "Custom"
    ],
    "views": 582730,
    "likes": 17018,
    "comments_count": 917,
    "description": "Take your content creation to the next level with Joby at   Apple Airpods Pro is probably the reigning champs for wireless earbuds, but Sennheiser has continually nipped at their heels year over year. Now, their True Wireless 3 is amazingly customizable and priced as low as the AirPods pro.   Buy Sennheiser Momentum True Wireless 3:   Buy Sennheiser Momentum True Wireless 2:   Buy Apple AirPods Pro:    Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - Generic like Apple? 0:18 - Unboxing 1:35 - Size impressions 2:00 - True Wireless 2 vs 3 comparisons 3:15 - App setup impressions 4:12 - Sponsor - JOBY! 4:42 - App settings 5:45 - Listening to music impressions 6:30 - Setting up a custom EQ and impressions 7:30 - Touch control impressions 10:25 - Test call and wind mode 11:15 - Transparency mode 11:38 - Sound zones 12:40 - Final thoughts",
    "description_links": [
        "https://lmg.gg/JobySC",
        "https://lmg.gg/D9q1n",
        "https://geni.us/Fc0Ook",
        "https://geni.us/rtAO",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is one of the most generic looking boxes I've ever seen, look at it compared to the Momentum True Wireless 2s. It's almost the exact same. If these were on the shelf beside each other, you could easily grab the wrong one. What we wanna talk about is the Momentum True Wireless 3 from Sennheiser. Are they even Sennheiser anymore? Turn great sound into your sound. We'll talk about why they wrote that later. Oh, look at, they got the German right there, (speaks foreign language) Here's the actual charging case. It has a fabric look, kinda like the cases that Google was making for their pixel phones for a while there. And inside, ah, there it is. There's the earphones. Inside the box, looks like we were gonna get some ear tips. And what is this? Might just have to, ugh. (laughs). This looks like they go around the earphone on the outside. We'll try those in a bit. They're like wing tips to go into your, what is that called? Pinna, concha. I think that's a swear word in Spanish. Okay, here we go, a USB A to C Cable for charging that plugs into the front of the charge case. This also can charge wirelessly. They say seven hours on the earbuds themselves, which can be extended to a total of 28, so an extra 21 hours with the charging case. French. (paper thuds) Plug this in for 30 seconds. What is this trying to say? I'm not doing it anyway. I'm a hardheaded man-child. Tips, none of these are foam, they're all silicone. There's three sizes, extra small, small and large. Screw you if you're medium. - [Jono] No, I think there's medium installed. (speaking foreign language) - Let's get a look at them. Maybe I'll open up the box from the 2s so we can see how they're different. But first I wanna try putting this little ring on this side. Okay, it does come with one already. And so you can see there's this little bulge in it. Can you see that? Right there, there's a little bulge. And then this one's bulgeless. This one's, little bulge here. So that's just gonna extend further and further into your concha. I usually just keep the stock ones on. You know what I should do though, is I should probably put a different size on each one, because I feel like I always have a different fit on my left ear. All right, let's see what the 2s look like. Very similar case. Although I would say this new case... Ah, the new case is definitely smaller. It's like a millimeter or less taller, maybe a centimeter shorter, and the width seems the same. How many bananas diff... Oh my goodness. - [Jono] (laughs) Oh no, banana down! - So yeah, the case is definitely way more compact now. Just look at all the dead space they had between earphones before. So that's a nice improvement. And then they, for some reason, changed the position of the port. On the earphones, oh man, I don't wanna mix up who's who here. (both laughing) So they were a little shinier, brighter before. Now, these do come in three colors, there's basic black, white and graphite. I'm assuming this is graphite, but they're less silvery. They're still very shiny. I can see that there are three mics on this thing. There's one on the inside, and then there's two external ones. I'm gonna put on one of each and you guys can tell me which ones better. What do you think? Huh or nah? - [Jono] That one - Looks better? - [Jono] Yeah, definitely. - Hell yeah, that's what you want. The new one's the good one, cool. Get this crap out of my face. All right, let's practice with my phone and check with the app. I hate when apps have little flaws like this at the beginning. Just let me in. I'll allow the permissions this one time. No device found, so clearly I need to do something to start pairing them. There's no button in here, which is actually my preference. I like when there's a pairing button in the case. I find that's more intuitive than... \"Touch and hold both ear buds \"for three seconds and start Bluetooth pairing.\" Put 'em both in, touch and hold both. I hear nothing. I think I need to wake 'em up. I think I need to do this. I need a power source. Can I get a battery bank please? Pairing, cool. Let's get back in the action. Pairing successful, with a slight British accent, nice. It's weird that it has to look for the device when it's already connected to my phone. There we go. Okay, cool little interface here. Connections, just the Pixel 4. \"The Momentum True Wireless so you can connect to, \"can only connect to one device at once.\" Okay, so this whole... There's no reason for this page to exist. Oh, firmware update. \"The update will take 21 minutes!\" All right, I'll do this damn firmware update, 'cause that gives me a great opportunity to talk about iSponsor, Joby. Joby is known for the unique GorillaPod, but they now have a brand new lineup of creator focused audio gear. There's the Wavo PRO a flagship on camera shotgun microphone with active noise reduction the Wavo POD, a podcast or gaming microphone ready to plug and play with USBC, the Wavo AIR a high quality wireless mic kit that's modular and designed for the creator on the go, and the Wavo Lav PRO an ultra small lavalier microphone that pairs perfectly with the Wavo PRO. So take your content creation to the next level with Joby, using the link below. Wow, that update took a long time but we're back and we're into the app. Let's check out the equalizer options we start with here. So it ships with it all flat, which is cool. You can adjust the base mid and travel. And what are the steps kind of one DB steps up to plus or minus six DB. I'm gonna leave it flat for now. I doesn't look like there's any presets you can just save and name. Let's call this one too. Your own. Oh, there are pre other ones too. There's rock, pop, dance, hip hop, classical movie. And then my custom ones are down there. All right. All I'm gonna keep it like that. 'Cause that's the best way to evaluate something like this right off the bat. There's also base boost special EQ preset for more intense base. Podcast mode special EQ preset for enhanced speech clarity. So that's just gonna boost up the frequency range where the human voices. What, this thing just spoke to me. It said volume max. And I don't know why. I guess I tapped on it. That's gonna bring us to what the interface is like which I am excited to hear about. Transparency mode is off, adaptive noise cancellation off for now. Let's play some tunes. This is loud enough for me already at 60%. So that's a good sign. Yeah, max is pretty loud, it's not super loud, but it's pretty loud. (fingers snaping) I can't really hear my snapping right now. Let's see what happens when I turn on the active noise cancellation (Jono lapping) didn't really seem to change much. All right. Now I'm gonna turn that off. Keep lapping. Okay, no real change. But what I don't understand is am I turning off adaptive noise cancellation or am I turning off all active noise canceling. - [Jono] Oh right. And I don't know. They do sound a little bright but not really that impressed, honestly. I wanna do the hearing test now and see if the EQ that this app shoots out for me makes these songs that I love sound better. Oh, I need an account. I gotta play my own tracks. Oh, weird. Select the option that sounds best for you. I honestly cannot tell like, if you were pressing the button and I wasn't looking, I wouldn't even know you pressed the button. (Jono laughing) This is not what I was expecting for this flow. Oh wait, I can tell the difference on this. A and B are similar, but C is like way different. It's like this one guitar is getting put under water when I hit C. I think I like B. All right. It just boosted the crap out of the trouble. But the trouble was the thing I thought was too bright at the beginning, too harsh. So now like, I'm gonna save this. I'm on that preset now, I'm gonna go back to the song. I was playing a few minutes ago and see if I still think it's too harsh. I don't know. Am I just used to it now? This isn't a review, whatever. Let's see what the features are. Tap on the right, pause. Tap on the left did not unpause. Oh, that's transparency mode. Hey, what's up guys. - [Jono] Hey. - Hello. Can you hear me now? (Jono laughing) - Good. - [Jono] Banana phone. And now do, do, do, do do it's either A and C or not. Also what the hell's going on. Sometimes it's playing and changing transparency mode. Why is the music playing and pausing? Is there two functions bound to this one button? What kind of... I guess I'm just turning transparency on and off. And when you're on transparency, mode pauses 'cause you're trying to listen to somebody and then you put it back to A and C and it thinks, well you probably wanna also play music. Then I can pause it over here and A and C is still on. Okay, so it's making an assumption there. They made a design decision there, I guess it's defensible. Double tap. Next song. Triple tap. I gotta say, oh, what the hell? Google assistant on triple tap. Get outta here. I have to say the hapics are good every time I tap it seems to register a tap. There's also these little feedback sounds when I triple tap it goes, it doesn't just go. poo, poo, poo, it goes poo, poo, poo. Like the second and third hits have different sounds. Okay, so how do I go back a song? Is it double tap on the left? Yes, what if I triple tap this one? It goes poodook, but I'm not talking. I don't know what that is. I'm gonna look in the app, it'll tell me. Also, is there a long press volume max? Okay, so you hold and it goes ramps down. Can you see that on here? That's really weird. It's like the headphone has its own volume range that's decoupled from the phone. 'Cause I'm not seeing the volume meter go up and down here. And when I turn this up to follow your max, I'm still here. So it's like you have two volume knobs to adjust. It's like on your TV, you might have a stereo and you set your knob and you just leave that knob, and then you use your TV remote to like turn up and down. Might get annoying in the headphones. Kind of use case though. Touch control. Or you can just say able to touch controls completely too. That's that's gonna be handy. All right. So you get left and right. 1, 2, 3 taps and a hold. Sometimes what you see in these apps is with a certain interaction, like say one tap you only are allowed certain actions. You can't just do all the actions coupled with any of the interactions they limit you for some like artificial reason which is super annoying, here with one tap. I get a lot of options. It looks like I'm not limited in any way. You can make anything go from no function, plane, pause, next track, previous track the voice assistant and that's what this is bound to. And that's why it's highlighted volume up and down power on and off. So the triple tap is noise installation and the single tap is transparency mode. So that's what it was when it was going do-do but I couldn't tell I'm really impressed with the interface here. Can we get that fan going? I'm gonna try some, A and C on and off and I'm gonna try this wind anti-wind mode. I can feel this. I can barely hear it. It doesn't seem to be affecting the sound of the sound of music, but let's do a call. Hey, what's up buddy? I'm just doing a test call on short circuit. Really, I sound terrible. I have a fan pointed at me and I have the anti-wind feature on. I'm gonna turn it off and you tell me if I sound even more terrible, right? I'm gonna say one consistent note and then you tell me if it's how it gets better. - I'm gonna go. (hauling) Did it get better or worse throughout that, you couldn't tell. Okay, all right, thanks. I'm satisfied with that. See you later. Cold ended. I really like the voice. Oh, transparency mode with music. So I think that's the toggle. So what was the command before? It was single tap. Okay, so if I hit that off with music. We got there guys, we figured it out. Closed the loop on that one. It's a setting. Well, okay, it's cool. You seem to get a lot of settings with this. Oh man, I have such disgusting wet ear wax especially on the left, like the right's okay. But danm! Sound zones allow you to automatically apply your sound settings when entering or leaving a sound zone. That's dope actually, 'cause you could be like, all right, whenever I walk into this part of the office, I want transparency on. Like if I leave my desk, I want transparency on. If I walk into the gym, I want A and C on. Or if I walk into my home I want the volume maxed. (both laugh) Get away from me. Continue without our location permissions. Oh, whoa, sweet, okay. So I just zoom in. You can only go down to a hundred meters. Okay, you're definitely not doing rooms in your house and maybe if you have a big office this'll work, but okay. So the actions when entering the noise zone, noise control is the term for active noise canceling or transparency are off. You can choose a different EQ. That's kind of interesting. It's like pretty basic, but it's pretty cool. Great excuse to give away your location data. There are pretty good headphone the sound didn't blow me away. But one thing that's really nice is that somehow throwout a global pandemic, a chip shortage inflation hitting record numbers. These went down in price 50 bucks. The first and second models of this headphone were $300 Us dollars. Now they're 250, that's crazy. Were they making too much money before they just had an acquisition or they got sold? So maybe they got some synergies, I don't know, but they cut the price. They're competing in a different bracket now. I guess they're the same price as their pros pros. Now this case is definitely bigger and lamer or I'd like the experience of them a lot more than the sound necessarily but the sound is definitely good enough. This is my new rating system actually. I'm not giving recommendations or don't buy I'm not giving ratings outta 10, like we do on they're just movies, the movie podcast that you should subscribe. Instead I'm giving facial expressions. So this is good. This is the cent. And that's what these get. (both laugh) Right, thanks for watching \"Short circuit\" subscribe come back for more banana reviews. I like 'em when they're spotless and slightly green, but if they're black then you can make some bread with them.",
    "transcript_keywords": [
        "Momentum True Wireless",
        "Momentum True",
        "Tap",
        "sound",
        "True Wireless",
        "case",
        "Transparency",
        "Triple tap",
        "noise",
        "Transparency mode",
        "mode",
        "Wavo",
        "generic looking boxes",
        "True",
        "Momentum",
        "good",
        "volume",
        "Wavo PRO",
        "cool",
        "poo"
    ],
    "transcript_entity_values": [
        "USBC",
        "3",
        "French",
        "Spanish",
        "seven hours",
        "21 minutes",
        "2",
        "three",
        "2s",
        "one",
        "USB",
        "a few minutes ago",
        "28",
        "The Momentum True Wireless",
        "Google",
        "60%",
        "minus six",
        "three seconds",
        "second",
        "Sennheiser",
        "C Cable",
        "max",
        "30 seconds",
        "Jono",
        "third",
        "10",
        "first",
        "1",
        "the Wavo PRO",
        "a hundred meters",
        "Pinna",
        "an extra 21 hours",
        "two",
        "the Momentum True Wireless 2s",
        "the Momentum True Wireless 3",
        "Wavo POD",
        "German",
        "British",
        "EQ",
        "the Wavo PRO",
        "$300 Us dollars",
        "250",
        "Joby",
        "50 bucks",
        "GorillaPod"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "NORP",
        "LANGUAGE",
        "TIME",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "NORP",
        "NORP",
        "ORG",
        "LAW",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG"
    ]
}