{
    "id": "8nHzYNJd9z8",
    "title": "A high-tech wooden block…that’s all",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-01-07T03:13:53Z",
    "video_url": "https://www.youtube.com/watch?v=8nHzYNJd9z8",
    "category": "Science & Technology",
    "tags": [
        "mui",
        "smart wood",
        "smart",
        "wood",
        "smart home",
        "smart home tech",
        "smart home 2019",
        "smart house",
        "house",
        "smart home devices",
        "home device",
        "best smart home",
        "smart home setup",
        "google home",
        "amazon alexa",
        "amazon echo",
        "smart home gadgets",
        "ces 2019",
        "ces",
        "2019",
        "2018",
        "consumer electronics show",
        "ces 2018",
        "auto yes",
        "tablets",
        "desktops",
        "new tech",
        "gadgets",
        "technology",
        "tech news",
        "first look",
        "hands on",
        "review",
        "tech review",
        "tech",
        "latest updates",
        "did you know",
        "verge",
        "the verge"
    ],
    "views": 251899,
    "likes": 4674,
    "comments_count": 382,
    "description": "Instead of using an Amazon Echo Show or Google Home Hub to control your smart home, why not opt for an internet-connected block of wood? Mui is a minimalistic wooden display that can connect to smart home devices to control temperature and lighting, and display Google Assistant responses. Its deliberately designed to keep us away from digital distractions, and integrate seamlessly as home furniture.  Read more:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2LW6aP6",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(hip hop music) - Forget OLED screens, forget E Ink. The hottest new display in tech is wood. This is Mui and it's basically an internet connected block of wood that acts as a smart home hub. So this is the Mui and this is how you touch to wake. And, as you can see, the interface is pretty minimalistic and there's five icons on the screen that represent it's different functionalities. So this one controls or this one shows you the weather. And you can swipe across the screen to go to the different menus. This one shows what song is playing on your Spotify. Unfortunately, you can't really choose from your playlist on the screen like this. It's more just an interface display that you control through the app on your phone. Let's swipe again and you can see that it connects to the smart home hub. You can control your home temperature if you have a smart thermostat like Nest. Swipe one more time and this one connects to any smart lighting products you might have like the Philips Hue. You can control how bright you want your light bulbs to be. There's a slight lag. And this button here is for Google Assistant. Unfortunately, you can't use a wake word like \"Okay Google\". You have to tap the button on the screen. But you can say \"What's the weather in Las Vegas\"? And it'll display its response on the screen. A little bit slowly, so let's give it some time. So the designers intentionally left pretty much half the block blank and that was a purposeful decision for the sake of minimalism and it looks pretty good, but sometimes it does cut off the responses there. So what I like about the Mui is that, although it basically does the same thing as an Amazon Echo Show or a Google Home Hub where it's basically a display for your smart home hub. This is a block of wood. It's an internet connected block of wood and its unique and, instead of just being a device in your home, it's actually a part of your home as furniture and I can really see them selling this at Ikea or a lot of design home goods stores. It's really just a beautiful block of wood. So the Mui just finished a successful Kickstarter project and it's launching next week on Indiegogo InDemand for $549. If you want more videos like this check out the Verge.",
    "transcript_keywords": [
        "Forget OLED screens",
        "Forget OLED",
        "forget E Ink",
        "OLED screens",
        "smart home hub",
        "home hub",
        "home",
        "Forget",
        "Ink",
        "smart home",
        "OLED",
        "Mui",
        "screen",
        "Google Home Hub",
        "smart",
        "block",
        "wood",
        "hub",
        "Google",
        "block of wood"
    ],
    "transcript_entity_values": [
        "Google Home Hub",
        "five",
        "Ikea",
        "the Philips Hue",
        "Spotify",
        "Google",
        "Indiegogo InDemand",
        "one",
        "Nest",
        "Las Vegas",
        "pretty much half",
        "Mui",
        "Kickstarter",
        "549",
        "next week"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE"
    ]
}