{
    "id": "8NMCqjVoKHI",
    "title": "Sony Xperia XZ Durability Test - BEND test - Scratch Test - Burn Tested",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-11-04T00:04:49Z",
    "video_url": "https://www.youtube.com/watch?v=8NMCqjVoKHI",
    "category": "Howto & Style",
    "tags": [
        "Sony Xperia XZ",
        "Xperia XZ review",
        "Durability test",
        "XZ Durability test",
        "Sony XZ",
        "Scratch test",
        "Burn test",
        "Bend test",
        "How durable is Sony XZ",
        "Xperia XZ tested",
        "Drop test",
        "Liquid damage",
        "Wont work",
        "Android",
        "Smartphone",
        "JerryRigEverythig",
        "sony",
        "flagship"
    ],
    "views": 2130231,
    "likes": 25997,
    "comments_count": 2687,
    "description": "Current Xperia XZ pricing in the USA:   How durable is Sony's new flagship? The Sony Xperia XZ. Released in late 2016 this water resistant phone is going to end up in the pockets of a lot of people.  Mostly outside of the USA. I put this phone through a series of tests.  Scratch tests to see how easy the screen will scratch. And then I gently abuse the rest of the phone to see what it is made of. Is it a solid metal body like most flagships? or is there plastic incorporated into the design? My tests expose everything.  Sony Xperia XZ Teardown video:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2etngoN",
        "https://youtu.be/ZTSKqPIxC_A",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "On my desk today is the late 2016 flagship from Sony. The Xperia XZ. With an ip68 water resistance rating, dual front firing stereo speakers, and a headphone jack, it has the initial characteristics of a spectacular smart phone. Some people have complained that the phone is too much of a rectangle... These are the same people who haven't noticed that every phone is a rectangle. The only other Sony phone I have tested on my channel the Sony Z5 Premium. While it did not catastrophically snap in half, the metal rails on the sides were broken, and the camera lens was actually made out of plastic instead of glass. So it was definitely not one of the most durable phones from last year. Hopefully the new XZ phone fairs better for this year. [Intro] The Mohs Hardness test always comes first. This helps us tell what material the screen is made out of. Shatterproof screens like the Galaxy S7 Active, or the Droid Turbo 2, typically have a plastic screen. Which scratches at a Level 3. The average smartphone has tempered glass, and will scratch at a 5 or 6, and if any company decides to roll out a sapphire screen in the future, it'll be scratching at a level 8 or 9. This Sony Xperia XZ screen scratches at a level 6, So it should be safe around keys and coins, But its still always a good idea to keep a screen protector on it for those harder minerals and dust specks in the environment. The 13 megapixel front facing camera is protected by the same screen glass, so it is also scratch resistant. A unique thing about the XZ is that the NFC chip is actually located right here next to the front camera, instead of on the back of the device like most other smart phones. This little sticker marks its location. The top earpiece speaker grill appears to be made out of a thin layer of plastic. Its definitely more sturdy than the cloth speaker cover on the Google Pixel, But either way, it is pretty secure, and wont be sliding out on its own. But its unfortunate that its not a thicker metal grill like on the Samsung, or the newer iPhones. The bottom speaker is made out of the same material. It wont get punctured unless something is deliberately stuck into the slot. But... some times that will accidentally happen in your pocket or purse. On the back of the phone, the thin little bar along the bottom is made out of plastic. You can tell it is plastic by the way it is. Which is pretty neat. The larger portion of the back panel is definitely metal. [Trogdor Burninating the country side] Then you can add a little body to the wild hair, and look: its Donald Trump. The single colored LED Flash is covered with plastic, which is pretty standard across all smart phones. Its the camera lens that we don't want to be plastic, and lucky for us, Sony did decided to change their lens to a more durable and scratch resistant glass, definitely deserves a thumbs up for that. You wont have to worry about your 23 megapixel camera lens getting scratched or damaged easily. Last years Sony Z5 Premium camera lens was made from the more easily damaged plastic, so I'm definitely glad they changed materials. I wonder if Sony watches my videos. The sim and SD card try is made of plastic, and surprisingly the side bars of the phone are made of plastic as well. So if you are looking for a device that has a premium metal or glass feel from every surface of the phone, this device is not for you. You can see the color difference between the painted exterior plastic, and the unpainted interior plastic. Scratches or drops would expose the color difference between the plastic layers as well. Over time the plastic paint tends to wear down. Up here by the beautiful and incredibly useful headphone jack. The top edge of the phone is made of plastic. And if we flip the phone around to look at the USB type C charging port, we find another plastic panel at the bottom. Unfortunately the fingerprint scanner / power button is also made of plastic. The volume rocker and camera button are both metal though. So that part is at least good. The fingerprint scanner is not available in the US version of this phone unfortunately. Which is strange considering their high price point. It should be included. BUT... You aren't missing out on too much though, after superficially scratching the fragile fingerprint scanner with my razor blade, It was unable to read my fingerprint. Just remember that both the Pixel and LG V20 fingerprint scanners were un-phased by my scratches. Onto the burn test. The Xperia XZ is using a 1080p IPS display that can last 13 seconds under direct flame before the pixels go black and turn off. The screen does fully recover though. The screen is cool to the touch within seconds, and the pixels slowly come back to life after the flame is removed. The flame test is useful to us because we can tell its time to move onto the bend test. If you haven't subscribed yet, now is the time to do so! It is completely free and you'll stay up to date on the latest flagship smartphone durability. I flex the phone to check the internal build quality, and the overall structural integrity of the phone, You can hear the plastic side bars snap in two separate places. Near the SD card slot and right there in the center. But the phone does not catastrophically snap in half, and still functions completely. Ill bend the phone from the other direction, and we get one more small snap in the center of the side bar right next to the power button. But yet the phone still does not snap in half altogether. It maintains its rectangular integrity and passes the bendtest. This phone is definitely not a contender for the most durable phone of 2016, but it is still alive. So as long as you don't mind the plastic side bars, and the weaker scratchable fingerprint scanner, This phone is worth considering from a durability perspective. My Instagram followers got the results in real time before the video was edited and posted to YouTube, so follow me over there, if you want to be the first to watch my durability tests. I'm all about reviewing tech from the inside. Thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "phone",
        "plastic",
        "made",
        "Sony",
        "screen",
        "camera",
        "Sony phone",
        "made of plastic",
        "plastic side bars",
        "camera lens",
        "desk today",
        "fingerprint",
        "phones",
        "smart phones",
        "Sony Xperia",
        "fingerprint scanner",
        "plastic side",
        "glass",
        "metal",
        "lens"
    ],
    "transcript_entity_values": [
        "US",
        "9",
        "ip68",
        "the Google Pixel",
        "6",
        "XZ",
        "8",
        "the Galaxy S7 Active",
        "SD",
        "Instagram",
        "two",
        "jack",
        "Pixel",
        "Xperia XZ",
        "6",
        "Last years",
        "Sony",
        "Trogdor Burninating",
        "half",
        "this year",
        "23 megapixel",
        "5",
        "NFC",
        "seconds",
        "first",
        "last year",
        "the Sony Z5 Premium",
        "13 megapixel",
        "Samsung",
        "today",
        "un",
        "2016",
        "Sony Z5 Premium",
        "The Xperia XZ",
        "Donald Trump",
        "LG V20",
        "YouTube",
        "iPhones",
        "USB",
        "one",
        "1080p"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}