{
    "id": "8om1eJrO2lU",
    "title": "RAZR+ Impressions: Is This What You Wanted?",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-06-01T18:00:42Z",
    "video_url": "https://www.youtube.com/watch?v=8om1eJrO2lU",
    "category": "Science & Technology",
    "tags": [
        "RAZR",
        "RAZR+",
        "Razr plus",
        "MKBHD",
        "moto razr impressions",
        "motorola razr",
        "folding phone",
        "folding flip phone"
    ],
    "views": 4213249,
    "likes": 112238,
    "comments_count": 6323,
    "description": "Motorola's folding phone feels like the beginning of a second generation in 1 (huge) way  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds​​​​​",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat electronic music) - Hey, what's up? MKBHD here and welcome to a hands-on and first look of a really interesting new folding phone, the Moto RAZR Plus. So you know how a lot of these foldable phones have kinda felt like a small bump up from the previous one? They're all kinda similar for both the folding and flipping phones. Well this one feels like a big jump forward. For the first time in awhile, it feels like we're sort of leaping into the second generation of these flipping phone things and it's pretty obvious why. So this RAZR Plus, which is the fourth generation of the folding phone from Motorola, is going to have a gigantic screen on the outside cover. Now gigantic is of course a relative term but in a small phone that folds in half and fits in your pocket, having a 3.6 inch, 144-hertz POLED display that goes basically corner-to-corner all the way around the front and even has pixels around the cameras and the flash cutouts is pretty dramatically different from what we had before. Now the rest of the phone is pretty solid too, right? I can't quite call it a flagship since it doesn't really have the highest end available specs but it's pretty close. It feels like upper premium mid-range and the retail price is gonna be $999 when it launches in a few weeks this summer. They've kinda slowly dropped the retro throwback aesthetic from the first generation of this thing and they've tightened up the edges and modernized the whole thing. The huge chin is gone and inside, it's a Snapdragon 8+ Gen 1, eight gigs of RAM, 256 gigs of storage and a decent sized 3800 milliamp hour battery with 30-watt charging and five-watt wireless charging. So yeah, not any sort of crazy, world-beater flagship specs but still pretty solid. I will note that the 3800 milliamp hour battery is 1000 milliamp hours greater than the previous gen RAZR. This thing only had a 2800 milliamp hour battery. So that puts it right in line with the current Z Flip, the 4, which has a 3700 milliamp hour. And then on the inside, the main folding display is a 6.9 inch, 22-by-9, 1080p POLED display and it's a 165 hertz LTPO display. It's not the brightest thing I've ever seen but hey, for a folding phone, I think it looks really good. It's got the hole-punch selfie camera at the top. The bezels are even thinner and the crease, it's not revolutionary, it's about as subtle as I've seen in some other folding phones with its redesigned aluminum hinge mechanism. It definitely disappears when you're looking at the content and just using the phone. But none of that is why this feels like a new generation. It feels like a new generation of course because of the giant outside display. So let's talk about it. This new outside display is really interesting for two reasons. One, because it's basically what we're also expecting based on the rumors and leaks from what we've seen of Samsung's Next Flip, the Flip5 that's probably also coming out later this summer but also two, because this, it does throw a wrench in like how you use a phone like this. So like I said, this is a 3.6-inch, 144 hertz display that basically covers the entire outside of this phone right up to get near the hinge where I assume the digitizer is. The two primary cameras, the 12-megapixel primary and the 13-megapixel ultrawide slash macro and the flash are cutouts with even more pixels around them and in between them and so you can basically do anything you want on this outside screen. In its resting state, it's just a clock of course but you can change between a bunch of different clock styles. They all have black backgrounds, so they look pretty seamless on the OLED. You also get some basic notifications at the bottom-left corner and the ability to manage those notifications. When you swipe down from the top, you have a whole bunch of quick controls, things like brightness and wifi and a flashlight and whatever media is currently playing. But then when you wake it up and unlock with a swipe up from the bottom or a fingerprint unlock, you basically get this entire home screen with a wallpaper and a bunch of pages of these things, widgets, shortcuts, et cetera. Now these are limited preset pages. They're actually called panels and you can turn them on or off or rearrange them in the settings but they do have a variety of things. There's a home panel with the clock and the weather and shortcuts to other panels but then of course a calendar panel and a weather panel and a contacts panel and you can put them in whatever order you want. There's also a Spotify one. Apparently they've worked with Spotify to create this perfectly optimized one and I do think it looks pretty good. But also you can just use whatever app you want on the outside screen. There is a settings page that lets you enable almost any app on your phone to work on the outside screen and control the continuity settings so when you open and close the phone, the app stays open, which is super useful. Honestly, it sounds pretty great since you can take photos and navigate with Google Maps and pay with G-Pay and do all kinds of convenient stuff without even opening the phone. That's the whole point of the outside screen. But it also goes so much further than that. You can make and receive phone calls with the phone still closed. You can use a whole scientific calculator on the outside screen. There's a whole keyboard for typing out messages if you want to send emails or text messages from the outside. There's even games. Of course, these are bordering on gimmicky but there's literally games that Motorola built to play on this outside screen, like this one where you feed the marble to the end of the maze, which is of course the camera cutout. You can watch YouTube videos on this thing if you want to. It's gonna be a weird square aspect ratio with all of this but yeah, there's basically no limit to what you can do on this outside display. It's a super screen, it can do whatever you want the screen to do. But hear me out, I don't actually know if that's what people want. Because the more I think about it, just zoom out a little bit with me. Those hotdog-style folding phones, like the big folding phones, those are all productivity monsters. You got the screen on the inside and the outside. Those are for people who want to do as much as possible and fit as big of a screen as they possibly can in their pockets, great. But then these little flipping phones, they've always been smaller and they've always been a little bit more regular I think. It's also kinda nice to have a barrier between using your phone and not using your phone. So if there's just something small and there's a notification, you can clear it. But I won't get sucked into like scrolling through TikTok endlessly or Instagram Reels because I will have to open the phone for that. But now on this one, you can get sucked into TikToks on the outside screen. So is this a good thing? I mean for me, yeah. I love having tons of functionality on the outside. The more the better and they've even built some extra stuff. The whole outside screen can be a viewfinder for the camera and there's also this half-folded mode that you can use to hold the phone where it feels like an old camcorder from back in the day but the subject can still see themselves. There's a lot of cool stuff. But yeah, I wonder if the customer of a flipping phone like this actually has that super high on their priority list, you know? Something to think about. Actually, Motorola literally alongside this phone also announced the new RAZR. So this was the RAZR Plus we've been talking about with the huge screen for 1000 bucks. But the RAZR will come out later this summer and it's also a folding phone but with just the tiny 1 and 1/2 inch postage stamp-size display on the outside just like from the earliest flipping phones which I don't know, just seems to make a lot of sense and the rest of the phone will have just slightly lower end specs. Like it's a Snapdragon 7 Gen 1. It's a 144 hertz internal display instead of 165. It's 128 gigs of storage instead of 256. It's a vegan leather back instead of a Gorilla Glass Victus and it's still IP52 water-resistant. But they didn't tell us the price of this phone. So I'm guessing just based on context and knowing that it's probably going to be meaningfully cheaper for this new phone to exist, this might be like a $599 to $799 brand new folding phone and that's also really interesting. Plus also because it doesn't have the huge outside screen, it has room for a larger battery, 4200 milliamp hours and a larger primary camera, a 64-megapixel camera. So a little lighter on the wallet, a little bit more space for other things. Kind of interesting. Also speaking of wallets, this one's a little bit lighter in your pocket too. You can get it at shop.MKBHD.com. But that's it, let me know what you think of the giant outside screen on the flipping phone. Is it truly second gen? Is this where we're going with them all or is this kind of overkill? I'll hang out in the comments for this one. I'm really curious what you guys think. Either way, thanks for watching. Catch you later, peace. (upbeat electronic music)",
    "transcript_keywords": [
        "phone",
        "folding phone",
        "screen",
        "phones",
        "folding",
        "display",
        "flipping phones",
        "pretty",
        "RAZR",
        "milliamp hour",
        "milliamp hour battery",
        "thing",
        "Moto RAZR",
        "flipping phone things",
        "feels",
        "milliamp",
        "things",
        "kind",
        "basically",
        "POLED display"
    ],
    "transcript_entity_values": [
        "1000 milliamp hours",
        "Spotify",
        "Motorola",
        "3700 milliamp hour",
        "30-watt",
        "Google Maps",
        "One",
        "144",
        "the day",
        "this RAZR Plus",
        "256",
        "3.6 inch",
        "eight",
        "13-megapixel",
        "128",
        "$599 to $799",
        "64-megapixel",
        "fourth",
        "999",
        "144-hertz",
        "1 and 1/2 inch",
        "five-watt",
        "6.9 inch",
        "3800 milliamp hour",
        "4",
        "half",
        "first",
        "165",
        "Instagram Reels",
        "later this summer",
        "second",
        "1000 bucks",
        "RAM",
        "hertz",
        "2800 milliamp hour",
        "TikTok",
        "3.6-inch",
        "the Moto RAZR Plus",
        "two",
        "4200 milliamp hours",
        "a few weeks this summer",
        "Samsung",
        "12-megapixel"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY"
    ]
}