{
    "id": "8OV8bTLDwGU",
    "title": "One Plus 11 = Not quite back...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-02-28T15:05:00Z",
    "video_url": "https://www.youtube.com/watch?v=8OV8bTLDwGU",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 11",
        "new one plus",
        "flagship killer",
        "oneplus",
        "android",
        "samsung",
        "iphone",
        "oneplus 11 review",
        "oneplus 11 durability test",
        "one plus 11 scratch test",
        "mobile phone",
        "smartphone"
    ],
    "views": 1242394,
    "likes": 41026,
    "comments_count": 1817,
    "description": "Today - we durability test the new OnePlus 11. The Latest flagship from OnePlus comes after two previous OnePlus phones divided by zero. If you understood that joke - you are an official nerd. Welcome to the club! The New OnePlus phone looks cool on the outside... but is it durable? In this video... we find out.   Get my Shirts and Razor Knife here!    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  (GH6  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "OnePlus and I have had a rocky relationship recently. It kind of all started with the OnePlus 10 Pro and continued with the OnePlus 10T. But don't worry, OnePlus, with our relationship it's not you, it's me...but also a little bit you since most smartphones do not snap in half. Usually by the time a phone is released the next phone is already pretty far into the design phase. So I can't blame the biannual 10T for failing. However, OnePlus has now had a complete year to rectify this fatal flaw, and today we find out if OnePlus will be the first smartphone brand to strike out three times in a row, or if this new Eternal Green colored OnePlus 11 is the start of an ameliorated redemption run. Let's get started. [Intro] Inside the box I thought we might be getting a free case, but nope, just stickers. It does come with a free charger though which is nice. YouTube reviewers and advertisements might make it seem like everything is new and improved. This happens with every brand of smartphone every year, but in reality the only thing that actually changes yearly is the shape of the camera bump. And in this year's bump review OnePlus has done a solid job. I like the shiney liquid metal looking curves, the emeraldy green color is still a bit tame for my liking, but since we only get two colors to choose from this year, green is slightly more exciting than black and it's what we're going with. Right out of the box OnePlus has included a plastic screen protector. Very kind of them. Any protection is good protection. We perform the Mohs scale of hardness scratch test to find out what the screen is made of. Plastic would scratch at level 2 or 3, glass would be a 5 or 6, and sapphire would be an 8 or 9. OnePlus says they are using Gorilla Glass Victus on the screen and that coincides with our finding of scratches at level 6, with deeper grooves at a level 7. The screen is indeed scratch resistant and that same glass protects the 16 megapixel hole punch selfie camera that's scrunched up over here on the left. The phone starts at $699 which is not too shabby all things considered. There's a super thin earpiece slit, no grill or anything to worry about. The sides of the phone are tinted with the same shade of Eternal Green as the back glass, and they are made from metal. The power button is also made from metal, and we see an interestingly placed antenna line right where the previous two OnePlus phones snapped in half. Brave move. OnePlus did bring back the mute slider this time around though, switching between ring, vibrate, and silent is super easy and I'm a fan of that. There's a rather large hole at the top of the phone, larger than a microphone hole, but also has no grill or mesh, so I'm thinking it's part of the earpiece vent or maybe the loudspeaker opening. But we won't know for sure until the teardown video, or you know, the phone snaps in half, whichever comes first. The left side of the phone has more metal, antenna lines, and of course, our volume rocker. The bottom of the phone has our 80 watt fast charging USB-C port, loudspeaker vent, and dual sided SIM card tray, which does have a red rubber ring but this phone is only ip64 which means water resistant to a light spray. Personally I wouldn't trust an ip64 around any kind of liquid, but to each their own. The back glass is smooth and polished this time around. The camera circle itself appears to flash between the tinted Emerald Green and a black star speckled night sky. Pretty interesting. There is a 50 megapixel main camera, 32 megapixel 2x telephoto zoom, and a 48 megapixel ultra wide camera all tucked into the glass with a triple LED dual tone flash. The circular lens is surrounded by a polished liquid metal looking enclosure that has a slight seam where it meets up with the phone frame. Flipping the phone around, the screen of the OnePlus phones have been pretty impressive for a while now. It's a 6.7 inch 1440p AMOLED with 1 billion colors, and the ability to do that variable refresh thing from 1 hertz all the way to 120, depending on what the screen needs. It's 11/11...make a wish. And interestingly enough the screen lasts for more than 50 seconds with no damage to the pixels. Not too shabby. One issue though I did have is with the fingerprint reader. At first glance it seems to work extremely well capturing my fingerprint optically through the screen super quickly. However, when I add a bunch of level 7 deeper grooves to the surface it stops working entirely. Normally these scratches don't affect scanners at all, but this time around the scratches render the scanner inoperable and the OnePlus 11 is now unable to read my fingerprint. Not great. Now for the final test, the bend test. Remember, the previous OnePlus 10T snapped right below the camera bump and the phone before that, the OnePlus 10, snapped in the same exact spot. So let's see if OnePlus has used any of the last 365 days to strengthen their design. So far things aren't looking too good. There is a substantial fissure all the way through the back glass panel emanating from the very corner below the camera bump where the last phones (plural) snapped in half. It's also the exact point where OnePlus added an antenna line. The phone is still alive though so let's keep going. With the second bend the bottom edge of the rear glass cracks into little pieces. It seems like there is enough hollow area inside of the phone that the rest of the back glass can just be crushed and cracked with my bare hands. Probably should have added some wireless charging back here for extra support. However, bending from both the front and back again we are still left with a fully functional phone. While the cracked rear glass does not look pretty and is rather unfortunate, it is still just cosmetic and does not affect the functionality or useability of the OnePlus 11. So yes, this year the OnePlus 11 does survive my durability test, but only barely. If you buy this phone make sure you grab a case as well and everything should be just fine. Durability is just one aspect to consider when getting a new phone. If you have any questions leave them down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "rocky relationship recently",
        "glass",
        "OnePlus phones",
        "back glass",
        "screen",
        "OnePlus phones snapped",
        "camera",
        "back",
        "Green",
        "Eternal Green",
        "phones snapped",
        "phones",
        "year",
        "metal",
        "Green colored OnePlus",
        "relationship recently",
        "rocky relationship",
        "camera bump"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "more than 50 seconds",
        "699",
        "50 megapixel",
        "9",
        "Emerald Green",
        "OnePlus",
        "6",
        "OnePlus 10",
        "8",
        "ip64",
        "OnePlus 11",
        "two",
        "80 watt",
        "ip64",
        "120",
        "three",
        "6",
        "1",
        "6.7 inch",
        "half",
        "1 billion",
        "biannual",
        "Eternal Green",
        "10",
        "year",
        "this year",
        "5",
        "OnePlus 10 Pro",
        "first",
        "32 megapixel 2x",
        "second",
        "Eternal Green",
        "today",
        "3",
        "16 megapixel",
        "One",
        "YouTube",
        "48 megapixel",
        "USB",
        "11/11",
        "7",
        "the last 365 days",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "FAC",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}