{
    "id": "8PZ8W_g6Vvk",
    "title": "OnePlus 3 Bend Test - Scratch Test - Burn Test - Durability video",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-06-21T01:49:47Z",
    "video_url": "https://www.youtube.com/watch?v=8PZ8W_g6Vvk",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 3",
        "OnePlus Three",
        "Bend test",
        "OnePlus durability test",
        "Scratch test",
        "Burn test",
        "JerryRigEverything",
        "MKBHD",
        "One plus 3",
        "flagship killer",
        "durability test",
        "drop test",
        "op3",
        "OnePlus",
        "How durable is the OnePlus"
    ],
    "views": 2044890,
    "likes": 24232,
    "comments_count": 1658,
    "description": "Is the 'Flagship Killer' OnePlus 3 ready to be durability tested by JerryRigEverything?  I perform durability tests on all major smart phones. Bend Test, scratch tests, durability tests.  I assess the materials and see what the phone is made of. Literally and figuratively.  Join me as I put the newest phone from OnePlus to the test. The One Plus 3.  Is the phone really made from a single slab of aluminum?  Will the screen scratch as easy as the Galaxy S7 active? Lets find out.   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "In front of me I have the newest phone from the company One Plus. This is the One Plus 3. I've previously tested the One Plus 2 and the One Plus X. Both of which survived my durability tests... lets see what happens with this new design... which is supposedly carved out of a single slab of aluminum. [Intro] The One Plus 3 was bigger than I anticipated. It is the same size as my Galaxy S7 Edge. After admiring the reflective logo on the back... lets jump into the scratch test. It does come with a preinstalled plastic screen protector. So I will remove that. I have a set of picks that tell me where the hardness of the screen falls on Mohs Scale of Hardness. Each pick has a different material on the tip. The OnePlus 3 has Gorilla Glass 4 on the screen. So its no surprise that the glass does not scratch until a level 6. A much deeper groove is left with a level 7 pic. But this is normal, and on par with most every other smart phone that doesn't have a plastic screen, like the Galaxy S7 active. The home button is made of ceramic which is awesome. If you remember on my Galaxy S7, and LGG5 scratch tests, Both of those have plastic home buttons that can scratch easily. The Galaxy S7 Active even scratched to the point of not working anymore. That wont be a problem with this OnePlus 3. There are zero scratches. Which means the fingerprint scanner can last longer. Thumbs up for ceramic! The 16 megapixel rear camera lens is made of glass. So even though it protrudes out of the back of the phone a little, it is resistant to normal scratches. Unlike the plastic camera lenses of the Z5 Premium and the Blackberry Priv. Clear pictures are always important. Onto that solid slab of premium aluminum. The phone is pure metal, so there is no thick coating of primer or plastic like you'll see on the LGG5. And you can feel it. The phone is cold to the touch. I tried scratching the reflective logo, to see if it would pop out like the Lumia 950 XL or the Nexus 6, but it is very well embedded into the rear metal. So it wont be falling out on its own. So far this device is a champion. The volume buttons, alert slider, power button and even the sim card trey are all made of metal. So there wont be any warping of plastic buttons like we saw with the old Evo phones. Even the speaker grill is made of metal. Little things like that add up when making a quality phone. OnePlus did not skimp on materials. Onto the flame test. One Plus 3 went with an AMOLED Screen for this device. Lets see how it holds up to the extreme heat. The Galaxy S7 Edge lasted 14 seconds before turning white and not recovering. As you saw at the beginning of this video, it has a permanent white spot on the screen. The OnePlus 3 also made it 14 seconds before the pixels turned white. But after removing the heat, the screen slowly recovered and went back to normal. It was cool to the touch within seconds. Onto the bend test. While putting this much pressure on a phone at one time, most likely wont happen in every day life. It does tell us if the phone will survive any extreme accidents. AND all of the test together will show us what the phone will look like after 2 years of abuse. Cell phones are realistically the most abused pieces of technology on the planet. So, If you haven't subscribed yet, I would recommend it. It's free! And insures that you wont be buying a cheap phone in the future. The bend test scared me at first, because the screen popped out of the frame. But even after exerting a lot of pressure, the phone still wouldn't snap. Remember that I have tested over 25 phones now. 4 of them snapped catastrophically. But the rest survived. The OnePlus 3 is a survivor. Even after bending both directions, the front and back, there is no permanent damage. The best part is that there is no kinks in metal frame either. Some of the Huawei phones would have permanent damage or kinks next to the power or volume buttons, after a hard flex. But The one plus three can be straightened out to look just like new. Ill open up the phone during my tear-down and repair video to see whats inside and how to repair everything. Its fun to analyze tech from the inside. From a durability and build quality perspective. This is one of my favorite phones so far this year. I did do a behind the scenes snap story of the durability test on this phone. I'll also be snapping the tear down process. So if you are into disappearing videos... head on over to my snap chat. I hope to see you around! Thanks for watching.",
    "transcript_keywords": [
        "phone",
        "screen",
        "Galaxy",
        "phones",
        "test",
        "plastic",
        "newest phone",
        "plastic screen",
        "made",
        "OnePlus",
        "metal",
        "buttons",
        "scratch",
        "back",
        "Glass",
        "Evo phones",
        "Huawei phones",
        "normal",
        "bend test",
        "Edge"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "Evo",
        "25",
        "the Blackberry Priv",
        "Mohs Scale of Hardness",
        "XL",
        "6",
        "Galaxy S7 Edge",
        "The Galaxy S7 Active",
        "Huawei",
        "The Galaxy S7 Edge",
        "4",
        "zero",
        "Galaxy S7",
        "trey",
        "this year",
        "One Plus",
        "seconds",
        "the Z5 Premium",
        "first",
        "14 seconds",
        "2 years",
        "16 megapixel",
        "One",
        "OnePlus 3",
        "one",
        "every day"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORDINAL",
        "TIME",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE"
    ]
}