{
    "id": "8VfACuhTEoE",
    "title": "Animal Crossing Nintendo Switch Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-03-17T19:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=8VfACuhTEoE",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 1238831,
    "likes": 35628,
    "comments_count": 2879,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today I'm unboxing the new Animal Crossing Nintendo Switch. I'm honestly really excited about this, but I initially, when this was first released, I told myself, Justine, you don't need this, don't get it, don't buy it. So I missed the preorder deadline. And then as the time was nearing, I got got FOMO and I went on eBay and I did some things. And that's where we are today. This is one of my favorite games, it is so much fun, so the fact that I was gonna pass on this incredible Nintendo Switch, I'm not really sure what I was thinking, I think I was trying to be a responsible adult, and then I remembered, you're not, Justine. You're not a responsible adult at all. I know there's been a lot of delays in other countries because of all the things that are happening right now so hopefully some of you guys who did order this will get it within a reasonable timeframe. But if not, I feel like a lot of you guys already do have Switches, so thankfully, well, it's actually not thankfully, the game doesn't actually even come with this console, so if you did happen to order this and you already do have a Nintendo Switch, you can still play it. But I think one of the things that is up in the air is how will you be able to transfer your island to another Nintendo Switch. I think eventually that is something that obviously Nintendo is gonna have to address. Depending upon when you're watching this video, maybe they already addressed it, but from what I saw online right now, they haven't yet. Either way, I'm very excited about this, this comes out on my birthday, on March 20th, and it's crazy 'cause I feel like the last several years, video games have come out on my birthday, so it really is one of the best gifts. I mean, I could not have asked for a better gift than this to be released on my special day because I will be probably still quarantining myself in my house. Which I planned on doing anyway. Okay, let's unbox! The box is beautiful, everything is, oh, look at you. Oh, the blue and the green, perfect colors. What a great combination. Both of those colors also look really great with pink! So here is the console itself. Still, I know, this has been out for so long, the fact that this right here is a console, everything that you need is in here. So it's got a really cute little Animal Crossing design on the back. Tyler, have you played this game before? - [Tyler] No. (gasps) - Well, I know what you're gonna be doing! You're gonna love it and then you're also gonna be like, what have I done? What have I, like, you wake up in the morning and you start playing because it's real-time, like real-time with like your, yes. So, like, shops close if you don't get to them in time. It becomes a lifestyle. Okay, so we've got some of the usual goodies. We've got our little controller here to put both of the Joycons together. I love the colored straps! Look at this! Oh! The blue and the green to correspond to which controller to put them on. And your dock, oh boy! It's crazy because I've really been loving the Nintendo Switch Lite because I really don't ever dock and play games on my TV anymore. Look at this! Oh, it's really, really, really cute. Maybe I can get somebody to like paint my name right here, like, how cool would that be? - [Tyler] Have you seen Marco on Instagram or YouTube? - Is it the shoe guy? - Yeah. - You were telling me about me. Marco, can you, can you, no, you can't come over because we're all not allowed out of our house. Talk to me later. Talk to me later when things are back. 'Kay, here's our dock. Let's open up these Joycons. Oh. Ohh boy, look how pretty! Yeah, these look great. Actually perfect because one of my Joycons just broke on my other Nintendo Switch. And remember, you can always mix and match Joycon colors, so maybe I can like pop a little pink one on here. Here's the little Joycon attachments, I love the color matching of the little wrist straps. Okay, so here it is. I guess there's really not much else. There's really, this is it. I've already unboxed it. Now I gotta transfer everything over from my old Switch. (snaps) Oh, what a great sound. This is so much bigger than the Nintendo Switch Lite, it's so weird 'cause I've been playing that for so long. Look at you. 'Kay, so we've got our dock, let's put this Switch in. Whew. The puzzle has been completed. Yeah, this looks great, I can't wait to play this game. Wait, I have been thinking about this probably for, I guess, whenever the Switch originally first came out. If only they had StreetPass. Oh. Would you guys be interested in some Animal Crossing gameplay, perhaps? If so, gimme a thumbs up and leave me some comments below. Even if you don't want it, I'm probably gonna do it anyway. I am definitely excited about this game. I've been kind of actively avoiding watching any trailers or anything about it other than the initial little Nintendo Direct that they did before because I just kinda wanna go into this as more of a surprise. Anyway, I hope you guys are staying safe out there. I'm gonna have to postpone my birthday party, so that means maybe I'll have a birthday party vlog when I'm able to have it again. Or maybe I can make a birthday party vlog by myself. Maybe we'll do that. Or I could have a livestream, I can livestream my birthday party for myself! Oh, this is gonna be so fun! Okay, I'm gonna go. I'm gonna go set the Switch up now. I'll see you guys later. I'm feel so weird, everything is so weird! I don't know how to feel. (funky electronic music)",
    "transcript_keywords": [
        "Nintendo Switch",
        "Nintendo Switch Lite",
        "Crossing Nintendo Switch",
        "Nintendo",
        "Switch",
        "Animal Crossing Nintendo",
        "incredible Nintendo Switch",
        "Justine",
        "Animal Crossing",
        "Switch Lite",
        "Crossing Nintendo",
        "guys",
        "birthday",
        "birthday party",
        "great",
        "Nintendo Direct",
        "game",
        "Joycons",
        "things",
        "Hey guys"
    ],
    "transcript_entity_values": [
        "March 20th",
        "Animal Crossing Nintendo Switch",
        "Nintendo Direct",
        "one",
        "the last several years",
        "Switch",
        "Justine",
        "Nintendo",
        "Animal Crossing",
        "another Nintendo Switch",
        "Instagram",
        "Switches",
        "eBay",
        "Kay",
        "YouTube",
        "Switch",
        "Joycons",
        "Nintendo Switch",
        "Joycon",
        "today",
        "StreetPass",
        "Tyler",
        "first",
        "Joycons",
        "Marco",
        "Joycons",
        "Joycon",
        "FOMO"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG"
    ]
}