{
    "id": "8vLsoI-Swrs",
    "title": "What Camera does MKBHD Use?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-02-21T03:44:56Z",
    "video_url": "https://www.youtube.com/watch?v=8vLsoI-Swrs",
    "category": "Science & Technology",
    "tags": [
        "MKBHD",
        "MKBHD Setup",
        "MKBHD Camera",
        "MKBHD Camera Gear",
        "MKBHD Camera Setup",
        "MKBHD Setup Tour",
        "MKBHD RED Camera",
        "RED Monstro",
        "Monstro 8K",
        "RED Monstro 8K",
        "RED VV Full Frame",
        "Full Frame 8K",
        "RED 8K VV",
        "RED Weapon 8K",
        "tld",
        "jonathan morrison",
        "Tesla",
        "model",
        "model 3",
        "tech",
        "2018",
        "tesla model 3 review",
        "review",
        "unboxing"
    ],
    "views": 295959,
    "likes": 13867,
    "comments_count": 458,
    "description": "Curious what camera MKBHD uses? Here's a look at his RED 8K Monstro Camera and some BTS of his Tesla Model 3 shoot!  Full MKBHD Model 3 Video!   Sony A6500:   The Galaxy S9 Leak that will disappoint America -   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/9O5PhuW927w",
        "http://amzn.to/2CA17xw",
        "https://youtu.be/kG_wo1lM2Tg",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, today I've got a fun behind the scenes look at shooting with MKBHD, what gear he uses, what gear he recommends, and also the Tesla Model 3. (relaxing electronic music) So this was cool for me because oftentimes I prefer being behind the camera in terms of the creative process as opposed to being in front of the camera. Capturing the shots, the composition, that's all really fun to me so it was kinda cool to kick back, watch Marques do his thing but still capture everything from my perspective. (relaxing electronic music) - The camera is the Weapon carbon fiber body that I've had for awhile, but the sensor inside is new. It's the full frame Monstro 8K sensor and it's glorious. (loud engine roars) I mean, the obvious thing is all my lenses are wider now. I could never really use the 100mm macro for anything other than really precise set up shots. But I've found that I can actually use the 100 now for medium shots and weird other applications so that's pretty fun. My favorite lens now that I have a full frame is actually the Zeiss 55 Otus. It used to be that 18 to 35 and I still use Sigma's 24 to 35 for a lot of the same stuff but I really like that 55 now. - Now for a second, I wanna hop in because this has become kind of a slightly controversial and heated discussion of why YouTubers choose Red to shoot video when it's completely and absolutely unnecessary. I actually, to an extent, agree 100% with that and there are a ton of amazing creators and videographers out there shooting on GH5s, A6300s, A7s, Canon 5Ds, 6Ds, 80Ds, all kind of Ds. You get the point and I'm sure you've heard this a million times before. It's not what you shoot on but how you shoot on it. And yeah, I could not agree with that more. Myself, the reason why I decided to go Red was kind of the commercial work that came along with YouTube. Right now, I'm working on a commercial for Philips that lives outside this channel on their website. This was all shot on Red, and that's where these higher end cinema cameras, for me at least, start to make more sense. Now as far as Marques, there's not really much that needs to be said. There's a reason why he's at where he's at. Plus, he's constantly and has always tried to push the envelope in terms of video quality. So naturally, that makes sense. The other thing I think people often forget is even though we do this as a career, it's also what we do for fun. So just like someone would invest in their music gear or to cars, it's kinda similar to how gear is for us. I don't party, and I'm not really that into cars surprisingly. I do have a slight shoe addiction but other than that, video gear is really what gets me excited. And also, I'm sure Marques, like myself, has aspirations way beyond YouTube so really that's why we go crazy over video gear. With that though, if you're curious what camera Marques recommends on a budget? - Best YouTube camera under 1500 bucks? Ah, that's tough. I almost said iPhone 10, does that make me... A6500? Does that come in under $1500 right now? - [Jonathan] Pretty solid, yeah. - I think that's Sony Alpha A6500. - Also, when we hang out there usually seems to be some sort of gear purchase effect that goes on, I know Judner can attest. Recently I was able to scoop up a pedestal on eBay for an insane price. Honestly, that's really the only reason why I considered grabbing one. It was so new that Marques thought I was holding out on him. - This is life changing, I'm mad at you for not showing me this earlier. We just got new tripods in the studio and that's all fun, but there's only so much you can do with a tripod without wheels. This is a glorious tripod with wheels, I'm all in. I mean, so the classic vertical shot, whenever you see the camera moving up and down, it's usually a lot of work. I can demonstrate it on that tripod but it's just such a pain but this is literally weighted to the point where I've completely unlocked it, it's steady, and then one finger now is just lowering or raising the entire thing. Plus you have the head on top here so you can do these parallax shots. I was missing this in my life, but expect a step up in the video quality as soon as I get back. - Lastly, the Model 3, this was my first chance checking out the car. I was actually really impressed. I know I said I'm not that into cars and for whatever reason, that chromosome in me seems to be missing. I like them, I appreciate them, but I don't go crazy about them but the Tesla Model 3 actually was really freaking nice. The tech inside the Model 3 is incredible. I think the biggest downside though is it's nearly impossible to get one anytime soon unless you A pre-ordered one way back when or you own a model S, which kinda defeats the purpose of trying to buy a more affordable Tesla. Either way though, it's awesome. Again, if you missed that full Model 3 video, that is linked on Marques's channel down below. Hopefully you enjoyed this behind the scenes look. If you did and you are feeling like being awesome, make sure to smash that like button. This is Jonathan and I will catch you guys later. (relaxing electronic music)",
    "transcript_keywords": [
        "Marques",
        "Model",
        "gear",
        "kind",
        "MKBHD",
        "Tesla Model",
        "camera",
        "shooting with MKBHD",
        "video",
        "fun",
        "shots",
        "Red",
        "video gear",
        "camera Marques recommends",
        "thing",
        "reason",
        "Tesla",
        "camera Marques",
        "full frame Monstro",
        "full"
    ],
    "transcript_entity_values": [
        "18 to 35",
        "100",
        "Zeiss",
        "35",
        "Sony Alpha",
        "eBay",
        "100%",
        "1500",
        "Marques",
        "YouTubers",
        "Model 3",
        "Sigma",
        "S",
        "Judner",
        "a ton",
        "1500 bucks",
        "55",
        "second",
        "MKBHD",
        "Tesla",
        "first",
        "Marques",
        "one",
        "Monstro",
        "6Ds",
        "8",
        "YouTube",
        "Philips",
        "Tesla Model 3",
        "24",
        "A7s",
        "iPhone 10",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "MONEY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "PERSON"
    ]
}