{
    "id": "8x8Z2iDj5Ug",
    "title": "Top iOS 16 Features!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-07-27T16:31:13Z",
    "video_url": "https://www.youtube.com/watch?v=8x8Z2iDj5Ug",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 456906,
    "likes": 15008,
    "comments_count": 564,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys. So, today, we're gonna take a look at some of your favorite features coming out in iOS 16. Now, as with normal Apple scheduling, we can expect iOS 16 to be publicly released around the time of iPhone 14, which is usually in September. So we're getting an early look right now at the beta. I'm pointing to my laptop, but this has Ventura on it. This is my iPhone that has iOS 16 on it. Now, with all things beta software, there might be some things that might not look the same when it actually is fully released. But for now, this will kind of give us a pretty good look at what we could expect. Hi, Justine here, editing the video that you're watching right now. I came out with a really cool plugin pack for Final Cut Pro, Premiere and DaVinci, and it's called mKeynote by MotionVFX. I'm so excited about it. I've been using it in a bunch of my videos. Thanks, everyone, who has purchased the pack already and even shared some of your content with me that you have used the plugins in. It looks incredible, and it's so exciting to see it getting used in the wild. If you guys wanna check it out, it's called mKeynote by MotionVFX. And there's titles, there's transitions, there's all kinds of really cool boards, there's backgrounds, all kinds of fun stuff to really spice up your videos. It's all drag and drop, super customizable. Check it out and let me know what you guys think. So the number one thing that you guys said was your favorite is the new customizable lock screen. You can change the clock font, the colors, the wallpapers, and you can even add widgets. Focus Mode Filters is a new way to link up your lock screens with a specific mode, so you can have one for if you're sleeping, working, or you just don't want to be disturbed. You can set those up however you like in the lock screen customization settings. So here's something that I already have set up. And it's really cool because if you use a portrait mode photo, this will kind of overlap on the numbers, so it'll look a little something like this. And it does a cool little animation. You can see all of these different ones where I've changed the font, added widgets. And I love these little emoji options that you can add too. So let me show you how to add one. We'll just go to this new screen, Add New. You could use people, photos, shuffle, emoji, weather, astronomy, and different colors. I'm gonna show you how to add the emoji one. This one's really cool. So let's pick a couple of emojis and it'll give you different variations. You can do a small grid, you can do medium grid, large grid, rings or spiral. I think that I like this one, so let's keep that. Now, this is where you're able to add your widgets. Let's add some Stocks, let's add some News, and let's add my Calendar. Let's change this to be a different color. That's beautiful. Okay, maybe it's not my best work. We can try again. You have the option to set this as a wallpaper pair, so not only will it be on your lock screen, you can also customize your home screen. So this lets you have legibility blur to blur the background so you can actually see your icons, or you can just keep it just like that. There it is. There's your lock screen. There's your home screen. Another thing that I like is you're able to use these portrait mode photos. So here's one of myself, and I'm actually holding up a Samsung so that's kind of ironic. You can crop the photo, move it around, and you can kind of of place it over the time so it gives this cool little overlap feature. You can add different filters so it'll automatically change the colors and the fonts for you. Another thing that I like is being able to set these focus filters. So if I decide that this moon is my nighttime sleep focus, every time I put that lock screen on, it'll automatically say that I'm sleeping. One of the other features is in iMessage and this is the Unsend and Edit Messages feature. This is super exciting, and it's kind of interesting because I think a lot of people are a little confused as to how this works. You're able to send a message and you can unsend that message within 15 minutes. Now, this will be marked as unsent so the person that you sent this to will know that you unsent a message. Now, this isn't something that you can go back and unsend old messages. It's only the last message and you have 15 minutes to do so. It'll also remove the notifications. But if somebody's already seen the message, then, I mean, they've seen it. As with unsending, you'll be able to edit the text as well. So if you've sent someone the wrong date or the wrong time, you could just go in and edit it. Just like the unsend, they will also be alerted that you did edit the message. I also like that you have the ability to mark messages as unread. I am the type of person that I won't read a message until I know that I can have the time to respond to it. So being able to mark that as unread, which is my last message that says I've unsent a message, this is a really cool feature and I'm definitely excited to use that. So kind of in those same lines of unsending a text message, in the mail app, it's also getting an upgrade. So you'll be able to schedule emails, you'll be able to cancel delivery, and you'll be able to get follow up reminders. The next one we have, Max is saying that he's excited about copying images off of the background. And, ooh, I'm also very excited about this, and I'm very surprised how well this works. You are just going to hold down and it gives you this little option to copy or share it. So I'm gonna copy it and I'm going to paste it to Jenna. There it is. So it makes it look like a little sticker. So you also can touch and hold, and then you can drag it around, and then you can also just open up whatever app you wanna drag it into, and you can drop it in, and there we go. Now, lockdown mode is something that I really hope I don't have to use. It's a way that you're gonna be able to completely lockdown your phone as a security precaution for anyone who might be at risk of being hacked or targeted. Most message attachments other than images will be blocked. Link previews will be disabled. Incoming requests like FaceTime calls are blocked, if you haven't already sent someone else a message or a call, and you won't be able to use your phone with a wired connection or accessories. People have so much information and data on their phones that if they are in this situation where they are being targeted or hacked, most people don't really know how to handle that situation. So being able to have a simple, easy way to completely lockdown your phone and your device is gonna be really, really important for a lot of people. This is one of my favorite features, the new notification design. Yes, I'm very excited about this. And there's an example of the notifications that pop up from the bottom. It's so cool. And I love this because this is like where your thumb is when you're holding your phone, so you'll get easier access to those notifications. So far testing this out with notifications on the bottom, mm, huge fan. Another feature you guys are excited about is Shared Photo Library. Now, this is something I'm also excited about because I feel like anytime I'm with my family, we always take a ton of photos, and then we just kind of spam them in our text messages, which is great now, because I love that I'm able to download all of them and you're able to do the Shared With You feature, but this is even more specific, like I could share my entire photo library with my family. So anytime we go on a vacation, we could all put our shared photos into that library. Set up a shared library. So create a shared library to combine photos with the people closest to you. You can have one shared library, and whoever creates it will provide an iCloud storage for all items. So I'm gonna add Jenna to my shared library. I can add all my photos. I can choose by people or date, or I can choose manually. So if I do people, let's see. So all of the photos with Jenna will now be shared with her. Oh, my God. 23,000 items? That's a lot of Jenna photos. I can also choose manually. I'll share this picture with her, this cute doggy with her. I can preview my shared library. There it is. And there is our shared library. And it's cool because I could also go in here, and I can do my personal library. I can see both libraries at the same time. And now, I could share the link with her, And there you go, we have our shared library. Passkeys is also very interesting and this is something that many of you said that you're excited for. This is going to let you use face ID or touch ID instead of a password. Your password will be stored securely in the cloud and only be able to be retrieved with your biometrics instead of a password. Definitely looking forward to hearing more about this and, of course, trying it out. The health app will now have support for medications so you'll be able to track and get reminders when it's time to take your medications, and you'll be able to get alerted if there's any type of pill interactions with others that you might be taking. Thankfully, I am off my blood thinners now so I'm not taking any medications. But if I ever do have to go back on them, I will be so excited to have this pill reminder because remembering to take them at the same time every single day, it's definitely not easy, and I would love to be able to just mark off that I took it so in my mind, I will know and have a record that I did take the pills. Continuity Camera is one of the things that I'm very excited to try out. And this is something that you guys also said that you're excited about. This is a little disc made by Belkin. It is MagSafe. And this is what is going to allow you to attach your phone to your MacBook as a webcam. So we'll just put this on, just like so. This little ring pops out as does this. So we're gonna put that right there where your webcam would be. And now, this is already giving me an option to use my iPhone as a webcam. Continuity Camera lets your iPhone be a webcam for your Mac when both devices are near each other. Access these features in Control Center. You can do Center Stage, Portrait mode, Studio Light and Desk View. Both your phone and your MacBook have to be logged into the same WiFi and the same Apple ID. And up here in the video section, you can choose iPhone 13 Pro, and it should switch. And there it is. Yay. Okay, so now I'm using the rear camera of my iPhone as the webcam. This is so cool. I can also use that as the microphone, and then I can go over here and I can change my video effects. So I can turn on Center Stage. So when I move, oh, look at that, it moves with me. We can turn on the Portrait so I can have a nice blurred background even though my background is all white. See that? That's a blurred light. No Portrait. Portrait. Oh, we can also do Studio Light. Look at that. Oh, that made the lighting look amazing. Oh, yeah. Hello. And it changed like the color. Oh, this is great. Now, this is what I'm so excited to try. This is Desk View. Okay. Share with Desk View. When screen sharing, show both a top down view of your desk and your face at the same time. Okay. Continue. So here is, can we zoom out a little? Let's put some headphones here. Look at that. Ah, Desk View is so cool. I've also got some Apple stickers. I've got a knife. Isn't that nice? So I can adjust this a little bit too so you can see more of my desk. MagSafe. Nice, love that. This is so great. This is so cool because I'll actually be able to use my iPhone as a webcam for conference calls. And this will give you the ability to make this built-in webcam on your laptops so much better. So all the features that I showed you guys here today are coming out in a future release of iOS 16 which should be out in September, give or take a few days. We don't ever really know the actual timing of these releases, but this will be something that you'll be able to get on your iPhone 14. And, of course, that Desktop View and other sort of features like that will be available in Mac OS Ventura. If there's anything that I missed that you think that I should have covered in this video, please leave them in the comments below, and let me know what your favorite features are that you're looking forward to checking out. I will see you guys in my next video. Hit the bell to be notified when I post new videos. And I will see you in the next one. Bye. (bright music)",
    "transcript_keywords": [
        "shared library",
        "add",
        "message",
        "shared",
        "cool",
        "excited",
        "Library",
        "Desk View",
        "screen",
        "photos",
        "time",
        "lock screen",
        "guys",
        "View",
        "features",
        "iPhone",
        "kind",
        "people",
        "Desk",
        "portrait"
    ],
    "transcript_entity_values": [
        "iMessage",
        "23,000",
        "every single day",
        "MacBook",
        "iPhone 13",
        "Shared Photo Library",
        "iOS 16",
        "Belkin",
        "one",
        "MacBook",
        "Studio Light",
        "Apple",
        "Justine",
        "September",
        "Ventura",
        "Desktop View",
        "Portrait",
        "Mac",
        "iPhone",
        "MagSafe",
        "iOS 16",
        "16",
        "Center Stage",
        "a ton",
        "Continuity Camera",
        "the Shared With You feature",
        "Calendar",
        "FaceTime",
        "mm",
        "Desk View",
        "Center Stage",
        "mKeynote",
        "Samsung",
        "webcam",
        "Premiere",
        "Final Cut Pro",
        "15 minutes",
        "Unsend",
        "Control Center",
        "today",
        "iCloud",
        "DaVinci",
        "Mac",
        "a few days",
        "Desk View",
        "Max",
        "Jenna",
        "Focus Mode Filters",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}