{
    "id": "8XZ9UfAbPy4",
    "title": "The Smoke That Thunders - Worlds LARGEST Waterfall",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-08-06T21:29:26Z",
    "video_url": "https://www.youtube.com/watch?v=8XZ9UfAbPy4",
    "category": "Howto & Style",
    "tags": [
        "Victoria Falls",
        "The Smoke that thunders",
        "devils pool",
        "angels pool",
        "worlds largest waterfall",
        "Drone History.",
        "cool hikes",
        "outdoors",
        "travel",
        "zambia",
        "zimbabwe (country)",
        "victoria falls (waterfall)",
        "waterfall",
        "africa",
        "zambezi",
        "waterfall (geographical feature category)",
        "visit victoria falls"
    ],
    "views": 150214,
    "likes": 8895,
    "comments_count": 755,
    "description": "Victoria Falls was filmed with the DJI Spark & controller:   Victoria Falls is the worlds largest waterfall. Twice as tall as Niagara Falls, and over 1708 meters wide, and 108 meters tall. (For my USA peopel: thats 5604 feet wide, and 354 feet tall.)   Originally called Mosi-oa-Tunya, meaning The Smoke That Thunders.  The name was changed when explorer David Livingstone decided to call it Victoria falls, after the queen of Britain.   There are two pools where you can sit along the edge of the waterfall. Devils Pool, and Angels pool. In this video you see me and my friends swimming in Angels pool.   Here are my other Drone History videos! Hitlers Terrible Tower:  Stairway to Heaven:  Neuschwanstein Palace:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2wxDQK8",
        "https://youtu.be/fF2X6gcuZXU",
        "https://youtu.be/Lm9M0YMuqRI",
        "https://youtu.be/nA_f3sjyzbE",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Victoria Falls has been described as one of the seven most beautiful natural wonders in the world. Nestled between the borders of Zambia and Zimbabwe, Victoria Falls is twice as tall as Niagara Falls in the USA and is the largest sheet of falling water on earth. The water you see now is during dry season. Imagine the curtain of water after it starts raining. I'm currently flying my DJI Spark while standing in Angel's Pool. It's similar to Devil's Pool and is the safest of the unsafe places to go for a swim before the water falls 350 feet into the Zambezi River below. [Music] Dr. David Livingston was the first European person to set eyes on this world wonder. He was led there by the natives in a wooden canoe. The natives called the Falls The Smoke that Thunders. And then in typical white explorer fashion, David immediately took it upon himself to boringly rename the Falls after Queen Victoria. Personally, I think The Smoke that Thunders is much more accurate. Dr. Livingston's attempt to have royal brownie points didn't work out too well though since Queen Victoria never actually came to visit the Falls. Her daughter, Princess Victoria, did visit though in 1904, about 60 years later. None of them had the aerial view that you currently have on your screen right now though. Technology is amazing. [Music] This is the fourth video in my drone history series. I'll have the other three videos linked in the video description. Would you ever hike to the edge of these Falls? Let me know in the comments. This whole video was shot with the DJI Spark and controller. I'll add that link in the description as well. And hit that subscribe button if you want to see more videos like this in the future. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "Falls",
        "Victoria Falls",
        "beautiful natural",
        "Zambia and Zimbabwe",
        "Niagara Falls",
        "Queen Victoria",
        "Victoria",
        "Smoke that Thunders",
        "water falls",
        "DJI Spark",
        "water",
        "borders of Zambia",
        "tall as Niagara",
        "Angel Pool",
        "Devil Pool",
        "Princess Victoria",
        "David Livingston",
        "Zambezi River",
        "Pool",
        "video"
    ],
    "transcript_entity_values": [
        "Angel's Pool",
        "Falls",
        "Princess Victoria",
        "David",
        "Devil's Pool",
        "the Falls after",
        "three",
        "DJI Spark",
        "Zambia",
        "about 60 years later",
        "Victoria Falls",
        "Zimbabwe",
        "European",
        "the Falls The Smoke",
        "USA",
        "Queen Victoria",
        "350 feet",
        "first",
        "1904",
        "the Zambezi River",
        "David Livingston",
        "fourth",
        "Niagara Falls",
        "seven",
        "Livingston",
        "one"
    ],
    "transcript_entity_types": [
        "FAC",
        "PERSON",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "GPE",
        "NORP",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "LOC",
        "PERSON",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}