{
    "id": "8Yp84EHtMlk",
    "title": "2018 Tech Christmas Tree!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-12-21T15:20:19Z",
    "video_url": "https://www.youtube.com/watch?v=8Yp84EHtMlk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "tech 2018",
        "tech review",
        "lastpass",
        "christmass tree",
        "lastpass login",
        "password",
        "password generator",
        "lastpass chrome",
        "lastpass download",
        "lastpass premium",
        "random password generator",
        "generate password",
        "password manager",
        "recover",
        "lastpas",
        "laspass",
        "lastpass premium features",
        "delete account mobogram",
        "lastpass.com",
        "how secure is my password",
        "last password"
    ],
    "views": 137757,
    "likes": 5374,
    "comments_count": 697,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I am getting in the extreme festive holiday spirit by decorating a Christmas tree today and I'm excited because I'm joined by my sister here. She's hiding behind the other Christmas tree. - Oh I didn't think you could see me. - I could see you, you're standing right next to me. - I didn't think they could see me. - So I have a Christmas tree here in case this Christmas tree doesn't look good because sometimes when you buy things on the Internet, you never know what you're gonna get. So I ordered produce on Amazon and I thought this was the zucchini that I was getting. This is the zucchini that I actually got. Huge thank you to LastPass for sponsoring this video. You guys know I've worked with them in the past and I'm such a huge fan because I use so many different devices and what LastPass is is basically alleviates the trouble of having to reenter your passwords. But the best part about it is they can auto-generate passwords so that they can be super secure. - Secrets. - Super secrets. - Can't hack this. - LastPass will auto-fill your credentials, your usernames, your passwords so it makes it super simple anytime you have to log in. - That's nice. - I know. - I can never remember anything so that's great. - I know, it's great. And will also auto-fill on your computer, on iOS, on Android, so if you guys wanna check it out, I will put a link in the description to get more information. With that being said, now's the time to start decorating. - Oh boy. - What have you got, a knife for me? - Why don't you have a holiday sweater on? - It's red. (slicing sounds) Whoa, good thing you were not right here. - Believe me, I've learned my lesson. - I think I would've cut you. - I know. - Oh, I cut the box. - I'm loving this Christmas royalty-free music that I have chosen for this video. Are you enjoying it? - I can't hear it. - Well you won't hear it yet because I have to add it later. - It's a joke. - Yeah but the joke is-- - It's a joke on this-- - It's not even-- - Give me that. - Look at our little tree! - Lit Christmas music. - Oh I hope I can find an EDM remix. (EDM version of \"Jingle Bells\") - What are these moves, we don't go to the club. - The last time I went to the club, I can't-- - It couldn't even handle me right now, I was like exactly. Oh it's not assembled. - What is this? - How many feet is it? - Actually don't know. - Four and a half feet. - What does that mean, I'm five three. - It means we're gonna need more height. - We can use half of it. - I don't think it works that way. - What, I don't have to use the whole tree. - I'll just hold it. I feel like the Statue of Liberty. - Which side do we jam in first? - That's not-- - What? - Don't even. That doesn't seem correct. I'm helping. (Giggles) - I just think you jam it in 'cause there's actually no other way, I'm not sure. - Four feet, that's like if you cut my head off. - Oh it goes in! - So picture me without a head. - I wonder whatever happened to that tree that I decorated with Ro last year. (angelic harp chords) Put this around the tree. - Okay. Justine, I think you've got me in there. Justine, wait, you got me! - The most important thing before you decorate a tree is make sure the lights work. - So you did it wrong. Wow! - Can I get rid of the small tree? How 'bout I put it back here for that? - Well, the box was small. - What are we doing? - We're decorating the Christmas tree in a very festive tech spirit. - Oh. Cut my head off and see if we're the same size. - No, you're not. - Close. - Let me see what I have in here. Oh my stockings, look they're gonna be hung with care. Oh my gosh, remember these from last year? I was like do I get rid of them? No because we're gonna need them this year. Get freaking festive, put that on your head. These I got last year and since I didn't get a Christmas tree last year, I didn't take them out of the box but these are incredible. They are Star Wars ornaments. - I remember these were from my video. I have no idea what I made though. - Oh alright. - Get stacked. - Get stacked, she says. So sometimes when I think about how did I get to this point in my life that this is something that I'm doing. - Well I have three things on my head. What's this? - Stop putting things on me. - Come on, we gotta celebrate. - Yeah but look how cool this is gonna be. I want to show you this. What is happening to me right now? Ter-buh-ter. - No, stop! - I can't. See here's the problem. I don't have anything to hang this with. - Look here. - I don't have any hooks. - I do, I do! - Are you serious? - Oh I've got a hundred of 'em, baby. - You are a freaking genius. We've got a TIE Fighter, when you guys see these, you're gonna freak out. I wonder if they have them for 2018. These are the 2017 ones. This is so cool! - Okay, well you don't need to raise your voice. Where you gonna put it? - Up front and center. Wait, I have to plug it in. It has to be plugged in with this. - You plug it in? - Well yes, it makes noise, duh! - I dropped them, sorry. - Be very careful, it's the only thing that I care about. - I dropped it. You didn't care enough to get ornament hooks. - Well I thought that they were included. - I thought so too. I actually almost made the same mistake. - What a racket. - What's a racket? No ornament hooks. Do you plug them all in? - Yes. And then they interact with each other. (Ornaments making noises) Star Wars is incredible. I sometimes wish that I would've seen it as a child. Like I didn't see Star Wars until I was an adult, so I definitely had a different experience. So I thought that because I have a lot of tech stuff around the house, you know I get a lot of gadgets throughout the year, that I thought it'd be really fun to take some of those gadgets and make it into a tech Christmas tree. Okay, what else do we have? That looks good. Gosh, I'm loving-- - These came with ornament hooks. - Yes! It's my Garmin, it's my satellite phone because Jen and I once got lost in the forest. - There may have been a search and rescue. - There may have been a search and rescue called and I decided that this is probably something that could save our life. Oh, it's beautiful. I mean, I might as well just put this over here too, like why not? - I don't think that's where it goes. - I can do whatever I want because it's my tree and my video so if you sass me, I will sass you back. Oh yes, the Lenovo Mirage Solo Standalone Headset! Have you seen the tree topper for 2018 baby? This is everything, period, like the kids say. That's good, I'm gonna get us some cables. - This will be-- - That'll be like the-- - You stay down there. You're an ornament but you're like-- - No it's like the train that you put around the tree. - This is a very expensively-decorated Christmas tree. - The OnePlus USB-C cables are making a beautiful little ornament here. These ones haven't even been unwrapped. Ooh, AKG headphones, gotta have 'em on your 2018 Christmas tree. Artsier, oh that looks so good. I've got some things! I've got the Insta360 One X camera. Like we need to leave this hanging up for-- - [Jenna] Forever? - Yeah. I can't ever remove it. This Nintendo Switch controller is actually a perfect ornament. So I've got this OnePlus phone here. - I feel, oh jeez. - I feel pretty good about it. - [Jenna] No, it's missing something. - Are you gonna put the Dyson vacuum on it? - [Jenna] Ha, I was but I don't know why. - Oh, what have you done? - I think the Dyson's my favorite part. - [Justine] You would, it's so good. - Was that this year? It was this year. - It was this year, yeah. So most of this is 2018 tech other the Spark, that was last year. Oh and these Christmas ornaments were 2017 but I am very happy with how this looks. We're gonna have to somehow move this into the living room without disturbing the peace. - I just saw this phone there. - We've got the OnePlus 6T. I mean, this is really a work of art and I'm super proud of it. So Jenna, thank you for participating in the first annual tech Christmas tree decorating. - I had a good time. - Me too. - What's next year's going to look like? - I don't know, depends on what tech is out. Well thank you guys so much for watching. A huge thank you to Jenna for being in this video, participating. Go check her channel. I'll put a link in the description and that's it. Happy holidays, Merry Christmas if you celebrate. Happy New Year, I don't when I'm posting this video. I'm pretty sure it's still 2017, it's 2018! Oh my god, back to the future! - A re-do, a do-over. - I don't ever want 2018 to happen again. - Yeah, but look at the great tech that came out of it. - This is a redeeming factor. Alright, I'll see you guys later, bye! (cheerful holiday music)",
    "transcript_keywords": [
        "Christmas tree",
        "Christmas",
        "tree",
        "Christmas tree today",
        "tech Christmas tree",
        "year",
        "put",
        "Christmas tree decorating",
        "tech Christmas",
        "good",
        "tech",
        "ornament",
        "expensivelydecorated Christmas tree",
        "guys",
        "tree today",
        "video",
        "Star Wars",
        "Christmas ornaments",
        "head",
        "Yeah"
    ],
    "transcript_entity_values": [
        "New Year",
        "Amazon",
        "Garmin",
        "a hundred",
        "the Statue of Liberty",
        "Justine",
        "2017",
        "three",
        "this Christmas",
        "AKG",
        "Dyson",
        "Artsier",
        "Spark",
        "last year",
        "next year's",
        "the year",
        "half",
        "Merry Christmas",
        "five three",
        "Four feet",
        "Ter-buh-ter",
        "Jen",
        "Nintendo Switch",
        "OnePlus",
        "today",
        "this year",
        "a half feet",
        "Jingle Bells",
        "2018",
        "Android",
        "Christmas",
        "first",
        "LastPass",
        "OnePlus USB-C",
        "Jenna",
        "2018 Christmas",
        "EDM",
        "One"
    ],
    "transcript_entity_types": [
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}