{
    "id": "8zBkmrYpEx8",
    "title": "The Sneaky Thing About PCI Express - CPU vs. Chipset",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-11-30T19:56:07Z",
    "video_url": "https://www.youtube.com/watch?v=8zBkmrYpEx8",
    "category": "Science & Technology",
    "tags": [
        "pcie",
        "pci express",
        "chipset",
        "cpu",
        "bandwidth",
        "lanes",
        "motherboard",
        "bus",
        "m.2",
        "nvme",
        "bottleneck",
        "dmi",
        "sata",
        "shared",
        "graphics card",
        "pc",
        "computer"
    ],
    "views": 736404,
    "likes": 36185,
    "comments_count": 934,
    "description": "Check out the SteelSeries Aerox 3 Wireless at   Learn about why all PCI Express lanes aren't the same.  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://steelseries.com/aerox?utm_source=youtube",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You wouldn't be able to connect high-speed components like graphics cards and NVMe drives to your computer without the PCI Express bus that's been a fixture on our motherboards for over a decade now. If you're not familiar, you can connect your devices via PCI Express in a few ways. Most commonly, you insert an adapter card into one of these slots right here, or an M.2 SSD right over here. But did you know that not all PCI Express connections are the same? You see, PCI Express can connect your devices either directly to your CPU or to the chipset, which sits between your CPU and some of your other components, like your Ethernet jack or some USB ports. This might be a point of confusion, if you've seen a motherboard that supports, say, 40 PCI Express lanes, but the CPU can only run one graphics card at 16x speed or two cards at 8x speed each. I mean, shouldn't all those PCI Express lanes let you plug in more than just one or two adapter cards? This is where the difference between chipset versus CPU PCI Express lanes comes into play. Most consumer CPUs will have 16 or 20 lanes running directly off of them, which you should be using for your graphics card for the best performance. But then, why is that better than using the lanes that come off the chipset? Well, one reason is that having the extra step of routing data through that chipset introduces latency, which can slow down your performance. Perhaps a bigger reason, though, is the link that connects the chipset back to the CPU. You see, although you'll often see diagrams showing that 16 or 20 or even more PCI Express lanes come off of the chipset, the connection that it has to the CPU is actually quite narrow. It might be only four lanes wide. Now, chipsets provide lots of lanes to other components and peripherals because of how many things connect to it: firmware, SATA, audio, Ethernet, USB devices. But these are all either relatively low-bandwidth applications or they're very unlikely to all be fully utilized at the same time. So, having them bottlenecked as they send data to the CPU isn't all that big of a deal. That limited bandwidth can hurt you, though, if you try to connect something that moves considerably more data, such as a graphics card, while you're also trying to use all that other stuff. Now, the long 16x PCI Express slots on your motherboard, those are typically connected directly to the CPU, so you don't have to worry too much about accidentally connecting a graphics card to your chipset. But, because those, usually two, share the same 16 lanes, you can't run two cards in them at full speed, unless you have a higher-end CPU that supports more lanes. Additionally, if you have a standard 16-lane Intel CPU, this means that an NVMe drive installed in an M.2 slot on your board is going to be routed through the chipset. Now, you shouldn't see a ton of performance loss, but the aforementioned latency, plus any heavy network, SATA, or USB traffic being routed through those four lanes back to the CPU, could result in some slowdowns, depending on your workload. On a related note, this is actually why some SATA ports get disabled when you plug in an M.2 drive, since those ports are also connected to the chipset, and they share bandwidth. The good news, though, is that if you're trying to squeeze every ounce of performance out of a drive, Intel's upcoming 11th-gen desktop CPUs are supposed to have 20 lanes coming directly off the CPU, four of which are meant to support an M.2 drive. And if you're on a Ryzen platform, you're in luck, because you already have 20 or more lanes coming off the CPU. It's kind of like chip manufacturers widening the highway for us, but without the punitive speed limits. Speaking of limits, there's no limit to my segue to our sponsor. Check out the SteelSeries Aerox 3 Wireless mouse. At only 66 grams, it's one of the lightest mice available, and it boasts nearly zero latency, thanks to their Quantum Wireless 2.0. You can use either a 2.4 gigahertz connection, or, if you don't mind the latency, and you like convenience, Bluetooth, and enjoy up to 200 hours of battery life. It has USB-C fast charging, so you can get 40 hours of battery in just 15 minutes, and it also has their AquaBarrier technology to make it but first IP54 dust- and splash-resistant gaming mouse. So, check out the link in the description to get your Aerox 3 Wireless today. Thanks for watching, guys. Like, dislike, check out our other videos, leave a comment if you have a suggestion for a future video, and don't forget to subscribe, or you might miss the opportunity to buy this amazing mousepad at lttstore.com. Wow, you can tell it's winter, hey? The air's so dry. You hear the static? (static electricity crackling)",
    "transcript_keywords": [
        "PCI Express lanes",
        "PCI Express",
        "CPU PCI Express",
        "PCI Express bus",
        "Express lanes",
        "CPU",
        "Express",
        "PCI",
        "PCI Express connections",
        "PCI Express slots",
        "lanes",
        "versus CPU PCI",
        "CPU PCI",
        "Express bus",
        "chipset",
        "graphics card",
        "card",
        "connect highspeed components",
        "connect",
        "graphics"
    ],
    "transcript_entity_values": [
        "only 66 grams",
        "Intel",
        "a ton",
        "8x",
        "40",
        "one",
        "USB",
        "40 hours",
        "the SteelSeries Aerox 3 Wireless",
        "over a decade",
        "16x",
        "2.4 gigahertz",
        "CPU PCI Express",
        "nearly zero",
        "11th",
        "only four",
        "AquaBarrier",
        "Ryzen",
        "winter",
        "Bluetooth",
        "first",
        "Aerox 3 Wireless",
        "PCI Express",
        "16",
        "two",
        "Quantum Wireless 2.0",
        "Ethernet",
        "four",
        "IP54",
        "just 15 minutes",
        "SATA",
        "up to 200 hours",
        "CPU",
        "CPU",
        "20",
        "today"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "FAC",
        "NORP",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE"
    ]
}