{
    "id": "8zbQhb2siHs",
    "title": "The new metaverse gold rush",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-12-02T15:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=8zbQhb2siHs",
    "category": "Science & Technology",
    "tags": [
        "metaverse explained",
        "metaverse crypto",
        "metaverse facebook",
        "what is the metaverse",
        "metaverse",
        "virtual reality",
        "meta",
        "facebook",
        "facebook metaverse",
        "facebook meta",
        "mark zuckerberg",
        "mark zuckerberg metaverse",
        "mark zuckerberg meta",
        "fortnite",
        "video games",
        "microsoft",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 265224,
    "likes": 6182,
    "comments_count": 620,
    "description": "Tech companies like Meta and Microsoft are betting big on the metaverse. But what exactly is the metaverse? It's more complicated, older, and less inevitable than it sounds.  Read more:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22576316",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - It was like 1:00 PM on a Saturday in 2019, and my friends and I got together to go to a Marshmello concert. We got to the venue and there was a stage set up and lights and it's us and maybe like 60 other people, and it was weird. Dozens of people are doing the exact same dance moves at the exact same time. There are a bunch of other people just jumping up and down in place. (rhythm coming to crescendo) Fortnite is one of the few games that can always drag me back in for one event or another. There's a real novelty to a quote unquote, live concert happening in Fortnite. It's bizarre and uncanny, but it's also exciting. It feels like baby steps towards the future. - [Adi] Fortnite is much more than a wildly successful battle royale game. In 2020, it's publisher Epic, expanded the game with a noncompetitive party mode complete with in-game events. That Marshmello concert saw over 10 million attendees. Fortnite's virtual world is an example of what some people call a metaverse. Metaverse doesn't have a single definition. It can cover virtual and augmented reality, decentralized payment systems, and lots of other tech. But to a lot of people, it means a digital 3D world full of real people with virtual bodies. And Epic is just one of the companies trying to build it. The term metaverse isn't new. It first appeared in 1992, when author Neal Stephenson imagined it with the novel \"Snow Crash.\" It was basically a big VR world that people visited as avatars. These days, the term gets applied to anything that blends people's physical and virtual lives. Some people link the metaverse with Web3, an emerging type of online infrastructure. Web3 is a broad term for de-centralized systems like cryptocurrency. It's supposed to let money and data work across different virtual worlds, no matter what those worlds look like. A lot of people, especially Web3 designers, say the metaverse can't be run by a single company, just like the internet isn't a single website. If all this sounds kind of vague, well that's right. The metaverse's most powerful evangelists have different definitions for it, and don't even agree on how much it currently exists. If you talk to enough people, almost anything can start sounding like a metaverse. Is Google maps the metaverse? Is an NFT pixel art drawing the metaverse? Is this video the metaverse? Who can truly say? - [Mark] The metaverse will be the successor to the mobile internet, an embodied internet. You're gonna be able to do almost anything you can imagine. Teleporting around the metaverse. Makes things happened by thinking about them. Experience it yourself, but it doesn't fully exist. - But, what does Zuckerberg mean? What even is the metaverse? One of the biggest metaverse players is Meta, formerly known as Facebook. Meta changed its name in October 2021, to reflect CEO, Mark Zuckerberg's vision of the future internet. And it's got big plans for the metaverse. One of Meta's big dreams is that people are gonna go to work in the metaverse. So I used it's Horizon WorkRoom software to interview Verge Senior Reporter, Alex Heath. - Hey Adi. - Hey Alex. - My hands aren't like weird colors are they? - No, there normal colors. - Okay, cool. - What is Meta's vision for the metaverse? - [Alex] Well, it's something like this. I mean, this is not that great. This is actually probably the best version of what the metaverse will be that someone could experience right now, but eventually they want this to be way more immersive and not just like our floating torsos, but our full bodies. And we can not just sit at these desks, but walk around, go outside, right? Like there's, you know, outdoors here that we can't explore and maybe jump into other virtual worlds that are run by other companies. I mean, that's the idea, and eventually the idea is the tech is gonna get a lot better. Right now, this is probably the best we've got. - [Adi] The metaverse might sound futuristic, but real metaverse-like platforms have been around for decades. For just one example, let's look back to 2003, when a company called Linden Lab launched a virtual world called Second Life. - [Avatar] Welcome to Second Life. - [Adi] Second Life had lots of features people associate with the metaverse. And in fact, news stories use that exact word to describe it. Second Life users could make virtual items and buy yourself virtual land using an in-game currency called the Linden dollar that you could exchange for real money. People made entire careers this way. Like Anshe Chung, who was referred to as Second Life's First Millionaire in 2006. And offline businesses were taking notice too. American Apparel briefly opened a store inside Second Life. IBM had a virtual office where people could meet up as avatars. Second Life had some real hurdles to adoption, but almost 20 years later, it's still going with an estimated half million active monthly users living virtual lives. (electronic music) Most present day metaverse tech wasn't made for VR and AR, although platforms like Second Life and Roadblocks experimented with VR modes. Meta once that to change though. It's building VR-only spaces like Horizon Worlds, and it's made a huge investment in VR and AR hardware. Meta's pushed a lot further than many companies into VR and AR consumer hardware, whether that's the Meta Quest headset, a pair of camera equipped Ray-Ban smart glasses, or high-tech prototypes like a high resolution headset and a haptic glove. Virtual realities are really big part of the metaverse, for Meta specifically, that we're gonna be using headsets to work and to socialize and play games. VR is not a mass market technology right now. How realistic is its vision? - [Alex] I think it has the potential to get there. I think it's probably gonna take a few more years before it hits, like say, console grade sales, but the Quest 2, the headset we're both wearing, has already done roughly 10 million units in the first year based on third-party estimates, which is nothing to, you know, look down on. So I do think this has real potential. I think the tech is gonna improve dramatically over the next few years. - [Adi] Other companies do also see AR and VR as really important. Like Microsoft, which revealed the HoloLens Mixed Reality headset in 2015, bought the VR social network AltspaceVR in 2017, and just launched a collaborative platform called Mesh. There are some other smaller companies like Nreal that also sell consumer-focused mixed reality glasses. The tech they're making has been around for years, but it's gotten dramatically better and more consumer-friendly very recently. There are good reasons why Meta specifically cares so much about the metaverse. - [Alex] There's a sense of inevitability, I think that, you know, CEO Mark Zuckerberg feels about this. That this technology is just going to be so compelling for most people over the long arc of time, say a decade, that it's makes sense to invest early now and be the leader. And I think there's also a little bit of not wanting to repeat history, right? Because for the last 10 or so years, Facebook has really been under the thumb of Apple and Google on mobile, where they control the mobile operating systems, and that's led them to have to pay, you know, Apple 30% on things and not be able to do all those software experiences they wanna do. So I think they see an opportunity to really forge ahead on their own and kinda control their own destiny. And I think that's a large part of it as well. - [Adi] Apps like Facebook are losing younger users and attracting negative publicity, and a new platform could also give Meta a fresh start. But there are lots of open questions about the metaverse. If you're traveling the internet with a virtual body, harassment and invasions of privacy can feel a lot more personal. If AR tech starts taking over the real world, systems like facial recognition could track people at an unprecedented scale, and advertising could become a lot more invasive. - [Mark] You wanna know that when you buy something or create something, that your items will be useful in a lot of contexts, and you're not gonna be locked into one world or platform. - [Adi] Companies like Meta talk a big game about interoperability, saying they don't want to own the metaverse, but their actions tell a different story. So far they're building self-contained spaces that might include a bunch of different experiences, but don't actually connect well to each other. Let alone let you take things like virtual purchases across them. Meta says that it doesn't wanna own the metaverse, it just wants to be one part of this larger plan. Where do you think it sees its role? - [Alex] They haven't really shown interoperability yet. And so, you know, they're preaching that, but they have yet to show it. And I think it's gonna be a while before we see really what that means. I mean, the idea is that you could take, you know, your virtual goods and your clothes and take them with you to Fortnite in the metaverse, right? But that means that Epic games, which makes Fortnite, and Meta have to work together. They have to figure that out. Do you use blockchain technology? How do you even do that? All these things haven't been built. (chuckles) So this is all very early. For now, I think for the foreseeable future, we're gonna be living in like Meta's version of the metaverse. They'd like to own as much of it as possible. I mean, they're spending $10 billion, you know, just this year alone on this stuff, and they're gonna spend more annually going forward. - [Adi] While Meta might be making the biggest play for the metaverse so far, it's huge investment doesn't mean it'll come out on top. It's tried to launch VR social spaces before, and they haven't caught on compared to competitors like VR Chat and Rec Room, not to mention Fortnite, Roadblocks, and Minecraft. Right now, lots of metaverse-like services already co-exist with apps and websites, the way that phones compliment desktop computers, but haven't totally replaced them. The future might look like that too. And we might just call it the internet. So whatever people like Mark Zuckerberg say, the metaverse isn't necessarily inevitable. And if it arrives, it might not look like we expect. Hey, thanks for watching. You may be wondering, is the comment section under this video a metaverse? Let us know in the comment section, and as always, Like and Subscribe.",
    "transcript_keywords": [
        "metaverse",
        "Meta",
        "people",
        "virtual",
        "Life",
        "Fortnite",
        "Mark Zuckerberg",
        "world",
        "Saturday",
        "Fortnite virtual world",
        "lot",
        "real",
        "internet",
        "Zuckerberg",
        "Marshmello concert",
        "years",
        "virtual world",
        "lots",
        "big",
        "Epic"
    ],
    "transcript_entity_values": [
        "almost 20 years later",
        "2015",
        "American",
        "These days",
        "Second Life",
        "one",
        "third",
        "VR",
        "Apple",
        "VR Chat",
        "the next few years",
        "Nreal",
        "an estimated half million",
        "Quest 2",
        "Dozens",
        "Saturday",
        "October 2021",
        "Epic",
        "Verge Senior",
        "Google",
        "Alex Heath",
        "NFT",
        "VR",
        "a decade",
        "2017",
        "Mark Zuckerberg's",
        "60",
        "30%",
        "2020",
        "1:00 PM",
        "years",
        "Anshe Chung",
        "Fortnite",
        "Horizon WorkRoom",
        "monthly",
        "Neal Stephenson",
        "2006",
        "Meta",
        "IBM",
        "annually",
        "Metaverse",
        "VR",
        "2003",
        "Horizon Worlds",
        "10 million",
        "Zuckerberg",
        "the last 10 or so years",
        "One",
        "Facebook",
        "Mesh",
        "this year",
        "2019",
        "Linden",
        "Alex",
        "AR",
        "the first year",
        "Minecraft",
        "Second Life",
        "Linden Lab",
        "a few more years",
        "roughly 10 million",
        "Marshmello",
        "decades",
        "first",
        "Microsoft",
        "Mark Zuckerberg",
        "metaverse tech",
        "1992",
        "AR and VR",
        "Second Life's",
        "$10 billion",
        "Snow Crash",
        "Second Life and Roadblocks"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "NORP",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "DATE",
        "LOC",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "WORK_OF_ART"
    ]
}