{
    "id": "9-603kcKyMI",
    "title": "ASUS GL752 Review - 17\" Budget Gaming Laptop (Late 2015)",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2015-11-27T02:28:30Z",
    "video_url": "https://www.youtube.com/watch?v=9-603kcKyMI",
    "category": "Science & Technology",
    "tags": [
        "Review",
        "ASUS (Computer Manufacturer/Brand)",
        "GL752",
        "GL752V",
        "Macbook vs",
        "Alienware",
        "Alienware 17",
        "Best Gaming Laptop",
        "Gaming Laptop",
        "17 Inch Gaming Laptop",
        "18 Inch",
        "Most powerful Laptop",
        "Versus",
        "Budget",
        "Value",
        "G752",
        "G552",
        "G551",
        "MSI",
        "Razer",
        "aorus x7",
        "Aorus",
        "Laptop (Product Category)",
        "Razer Inc (Business Operation)",
        "Video Game (Industry)",
        "Gamer"
    ],
    "views": 451140,
    "likes": 5629,
    "comments_count": 1006,
    "description": "My review of the 2015 ASUS GL752V. A moderately priced 17\" gaming laptop. Review covers screen, keyboard, trackpad, build quality with video editing and gaming performance. Buy:  Is this the best valued 17\" gaming laptop? Is this thing good for gamers?  Review unit: i7/16G/1TB/960M   Be sure to check out my other laptop reviews: Dell XPS 15 -  MSI PE60 -  Alienware 15 -  Asus UX501 -   Music Credits:  Intro: Robotaki - Raton Laveur Background: FILI - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/1QoXMpV",
        "https://youtu.be/qA-8_OpUdEM",
        "https://youtu.be/0BwVW2-G0EU",
        "https://youtu.be/bMOtP68xR6g",
        "https://youtu.be/Z2vlynTXjqA",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how is it going, guys? This Dave2D and this is my review of the ASUS GL752. So, this is their mid tier, mid-priced, 17 inch gaming laptop, it's from there ROG line, so the Republic Of Gamers line and its new for 2015. It's not replacing a 2014 model or anything. It's got SkyLake, it's got a bunch of cool features, let's take a look. It comes in a big red box with a handle and inside you get the laptop itself, some pamphlets, some accessories, like a cable tie and a cleaning cloth and the AC adapter. The top surface of the laptop is aluminum, it actually comes in a plastic version, but this one is aluminum and it feels pretty nice and it doesn't show fingerprints readily. There is a pretty large ASUS logo up front, as well as an ROG logo and this lights up from the back lighting of the screen, so the brightness of the screen effects the brightness of the logo. The bottom of the laptop is plastic and this obviously feels way less premium, but it's very rigid and it's durable. There's also a subwoofer up top, we'll get into that later, and there's four rubber feet here, which are for grip. There's a hatch here that you can open up when you remove a couple screws and then when you do, you have access to two memory slots and the hard drive, which you can easily upgrade. There's also an area for a second drive and this would be for the m.2 PCIe stick. So you can put in some really fast drives in here. So, if you're doing video editing or if you're recording some gameplay footage, having a second drive here is nice, but if you don't need a secondary drive you can always put in a Caramilk bar. No, I'm kidding. It should be a Crispy Crunch. Ok, so the screen has some flex, it's not any more than I'd expect and actually for a screen this wide, I kind of expected it to be more flexible, so it's not that bad. And the chassis is solid, the whole keyboard area doesn't have much flex and the hinge also feels well made, it's covered with a piece of plastic, but it feels strong. Going around the sides, on the left side, you get the power connection with a huge exhaust vent, mini Display Port, HDMI port, an Ethernet jack, a USB 3 and lastly a USB 3.1 type-C port. On the right side we have a headphone jack, a microphone jack, a pair of USB 2 ports and a DVD drive. Case of the configuration I'm reviewing has a SkyLake core i7 running a 2.6 gigahertz, a 17.3 inch 1080p screen, a GTX960M with two gigs of video RAM, 16 gigs of DDR4 RAM and a one terabyte hard drive and all this is going for around a thousand dollars US. It's a pretty large laptop, it actually doesn't fit any of the bags that I have, you really need like a dedicated 17 inch laptop bag or a laptop sleeve to hold this thing. Opening it up, that palm rest is a really smooth plastic material and it shows fingerprints and smudges a little more than I'd like. The keyboard is ok. I mean I've used several keyboards with this kind of layout like the UX501, the G501 and the MSI P60, so I've gotten used to this kind of split, but if you're new to this kind of layout, it's a little disorienting at first that all number pad thing shifts everything over to the left. So, if you've never used one before, it takes a little bit of time to get used to it and the arrow keys can feel a little weird, because it's surrounded so tightly by other keys, but typing on it isn't bad, it's got 1.8 millimeters of travel which feels good and the three-stage back lighting is bright, but it's red. So, if red isn't your thing, you won't love it. The trackpad is ok. It actually feels a lot like the trackpad on the UX and the G501 and it can skip around, once in a while when you're tracking, but the texture is nice and the buttons are responsive. It's not the best trackpad, but it is a gaming laptop, so you'll often have a mouse connected to it anyways. The screen is a 17.3 inch IPS non touch panel, with a resolution of 1920 x 1080. The viewing angles are ok. It's not a particularly bright panel, but the color range is really good. Thankfully, it's a matte screen, so you don't have to deal with too many crazy reflections. It's a solid screen for the price of the laptop, but if you need really good color accuracy for photo or video editing, I would highly recommend calibrating it, but if you just plan on using this laptop for games, you're good to go right out of the box. The webcam up top is a 720p camera, the image quality isn't particularly good and the colours feel a little washed out, but it works if you need one. The drive that this model comes with is a 7200 RPM, one terabyte hard drive and I was actually pleased with the performance. So, if you edit videos, you don't want to use this drive, you want to grab an external or use the m.2 socket, but 1080p edits are smooth and 4k edits are pretty good, you just need a 4k monitor to see the extra pixels, but the drive that it comes with is not bad for just like regular use, for gaming and just regular stuff. So, speaking of which games run well on the 960M, games like CounterStrike GO, you're just going to rip through them, you're rarely going to see a drop below a hundred frames per second, with everything maxed out on 1080p. Slightly more demanding games are hot. So, if I put this on extreme graphics, so everything's turned up here, laying will still be like 70/80 frames per second, but a full team fight can drop this to under 40 frames per second. So, if you're competitive and you play the stuff for serious business, play on high graphics, because even really messy team fights will still get around 55 maybe 60 frames per second on teamfights. Remember, these numbers are for teamfight numbers, if you're solo laying, it can be easily double these numbers, but I don't care about those numbers, I'm talking about where matters, for teamfights. So, Followed 4 plays nicely on this laptop, you can get around 50/60 frames per second on medium graphics, but bumping it up to high, drops us to 35/40 frames per second. So, the sweet spot is definitely on medium setting for Followed 4. Rust is even more demanding, it's actually one of the most demanding games that I play and you have to drop your graphics setting to simple to get around 50/60 frames per second. It's doable and the game still looks alright, but you lose a lot of the detail. The speakers are up on the keyboard area and they sound really good. The sound is clear, is directed right at you and it can get pretty loud. Obviously it's not as good as an external speaker, but they're nice and I'm not gonna lie, I thought the whole subwoofer thing on the bottom was a little gimmicky, but it's actually really cool, like you can definitely hear and feel lower frequencies, at least much more than the average notebook. The fan noise of the system is reasonably quiet, it's about 25/26 decibels and I don't like most of that noise is coming from the mechanical drive and it's around 35 decibels under load. Thermals are also respectable, it doesn't go much above a hundred degrees when it's under load. It's a 120 watt charger and charging of the battery takes less than two hours. Now, battery life is really poor. So, this laptop has powerful components in there, with the GTX960 and there's a big screen to light up, but it only has a 48 watt hour battery, which is really small for a 17 inch laptop. So, battery life on normal use was around two and a half hours and this is just like regular use, using the web, doing a little bit of work; and playing games was under an hour. Now, most of the problem here lies in the fact that there's a DVD drive. It's cool to have an optical drive, but it really eats a precious real estate inside that laptop. So, its use has kind of forced to put in a smaller battery and this is what you get. Ok, let's do a recap.ASUS GL752, decent build quality with a mix of aluminum and plastic. The 1080p screen isn't that bright and it needs calibration, if you want to do any kind of color accurate work, but it's nice and big for games. The keyboard is comfortable to type on, once you get used to the whole shift of layout and the trackpad is ok. It wouldn't be bad if it didn't skip around, but it skips around. And on the inside, we have a speedy SkyLake i7 and the GTX960M that handles most games really well and video editing, a DVD drive that takes up a lot of space, 16 gigs of RAM that you can upgrade to 32 gigs, an upgradeable one terabyte SATA hard drive, an m.2 slot that you can put a drive into and lastly a really small 48 watt hour battery that will last you about two to three hours of normal use. Ok, so the GL752 is obviously meant for gaming and it does a pretty good job, it's running a 960M, so you're not getting crazy graphics, but it's pretty solid. I don't love the inclusion of that DVD drive, though. It's something that I would have left out, if I was designing these things. It's 2015, I feel like a lot of people won't be using this drive and it's using up space inside the laptop that could otherwise be used for batteries. The other thing I don't like is how thick it is. It's not like the thickest laptop in the world, but it's pretty thick, but you can forgive this all because of its price. It's priced a little bit over $1,000 and that gets you into a pretty solid system that has incredible upgrade potential. It's got 2 drive spaces that you can upgrade, it's got fully upgradeable RAM, it's pretty solid. So, if you're looking for a 17 inch gaming laptop, this is a really good option and take a look at it. That's the end of this review. Hope you guys liked it. Thumbs if you liked it, subs if you loved it. It's been nice, I'll see you guys next time.",
    "transcript_keywords": [
        "drive",
        "laptop",
        "DVD drive",
        "screen",
        "good",
        "pretty",
        "hard drive",
        "games",
        "inch gaming laptop",
        "feels",
        "gaming laptop",
        "frames",
        "inch",
        "nice",
        "kind",
        "inch laptop",
        "Republic Of Gamers",
        "battery",
        "terabyte hard drive",
        "DVD"
    ],
    "transcript_entity_values": [
        "2",
        "SkyLake",
        "7200",
        "the Republic Of Gamers",
        "SkyLake",
        "three",
        "1.8 millimeters",
        "4k",
        "a hundred",
        "70/80",
        "55",
        "60",
        "DDR4 RAM",
        "4",
        "GTX960",
        "under an hour",
        "2014",
        "four rubber feet",
        "ROG",
        "50/60",
        "about 25/26 decibels",
        "GTX960M",
        "one",
        "AC",
        "less than two hours",
        "the ASUS GL752",
        "UX501",
        "two and a half hours",
        "1920",
        "second",
        "48 watt hour",
        "17.3 inch",
        "2.6 gigahertz",
        "16",
        "the GTX960M",
        "G501",
        "around 35 decibels",
        "Display Port",
        "the MSI P60",
        "120 watt",
        "two",
        "SkyLake",
        "about two",
        "2015",
        "first",
        "CounterStrike",
        "35/40",
        "the 960M",
        "32",
        "3.1",
        "RAM",
        "ASUS",
        "UX",
        "ASUS GL752",
        "GL752",
        "960",
        "over $1,000",
        "USB 2",
        "1080",
        "17 inch",
        "around a thousand dollars US",
        "under 40",
        "hundred degrees",
        "Caramilk",
        "1080p"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "FAC",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "DATE",
        "QUANTITY",
        "NORP",
        "CARDINAL"
    ]
}