{
    "id": "91gH8gIVIMQ",
    "title": "Nokia 9 hands-on: too many cameras?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-02-24T15:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=91gH8gIVIMQ",
    "category": "Science & Technology",
    "tags": [
        "nokia 9",
        "nokia",
        "nokia android",
        "nokia 9 camera",
        "camera",
        "hmd global nokia",
        "nokia smartphone",
        "Nokia phones",
        "tech news",
        "smartphones",
        "nokia mobile",
        "Nokia feature phone",
        "android",
        "mwc",
        "mwc 2019",
        "2019",
        "mobile world congress",
        "mwc barcelona",
        "hands on",
        "first look",
        "did you know",
        "upcoming phones 2019",
        "live event",
        "release date",
        "price",
        "review",
        "smartphone",
        "phone",
        "phones",
        "latest updates",
        "event",
        "gadgets",
        "tech",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "live stream",
        "barcelona",
        "verge",
        "the verge"
    ],
    "views": 315664,
    "likes": 5188,
    "comments_count": 561,
    "description": "The Nokia 9 is HMD Globals new flagship at MWC 2019, and it might be the companys most ambitious phone yet. With a show-stopping five  count em, five  cameras on the back, this phone officially takes the crown for the most rear cameras ever put on a phone.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2H0CUXl",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey it's Chaim with The Verge and I'm here with the new Nokia 9, which, as you can see has five cameras. Look at it five cameras. Nokia just announced this at MWC 2019, and again the big feature is that this is the first phone with five cameras on the back. It's actually got six cameras because there's one on the front. So lets break down what exactly we're doing with all this. Five sensors. Three of them are 12 megapixel F1.8 monochrome sensors, and the other two are, again, same specs but color. So what Nokia's doing is that every time you press the shutter, it's firing all five of these sensors, to pull in all that extra color and depth data from every single shot. Now we can see some pretty beefy file sizes. Part of the reason some of those file sizes are so large is that the Nokia 9 can shoot in Raw DNG, and Nokia says that those features will be off by default for most people. But, if you're shooting with this you're gonna wanna be using those and it's something you should keep in mind. The five camera system does come with a couple big caveats. First off, this thing is kinda slow. It's powered by last years' Snapdragon 845 processor, but it still takes like 10 seconds between when you fire a shot to actually viewing in your camera roll for an image to finish processing, and another couple seconds for it to load in full resolution. Some apps are better equipped with this than others, Google photos struggled a bit, but loading things in Lightroom was much faster. Nokia's actually partnering with Adobe to specifically build Lightroom presets based around lens profile of the Nokia 9, so, when that rolls out, you should be able to get some really interesting and hopefully impressive results from Lightroom directly on the device without having to go to a computer, which is kinda the dream. As for the phone itself, the Nokia 9 is the top of Nokia's range that they're announcing here and it's got the build quality and design to match. The sides of the phone are machined out of aluminum. It's got Gorilla Glass 5 on both the front and the back. Now, Nokia's breaking from the trend of most 2019 flagships, you can see there's no notch, its just a regular 5.99 inch QOLED display. It renders a 2K resolution and it actually looks a lot like the Samsung Galaxy S9 or the smaller Google Pixel. The bezels on top and bottom are bigger than I necessarily like, but they're not egregious, and it looks really nice to just, hold. Hardware-wise, Nokia's including 120GB of storage, 6GB of RAM and a 3320 milliamp hour battery. Like Nokia's other phones, it runs Android One, it runs mostly pure Android 9 Pie. With Android One, Nokia's promising regular updates and you should be able to get like good software from this to come, they're really not messing a whole lot with what Google has given them. Which is honestly nice to see, cos Google has it good, like, don't mess with it too much. There are a couple other premium things that Nokia's including on this phone. There's in-display fingerprint sensing. There's proprietary Nokia design face unlock system that it's introducing with this years' models. There's USB-C, there is still no 3.5mm headphone jack. Sorry, folks. I mean Nokia's really like planting a flag here with this as a premium level device. Now the company does say that this will be a limited edition phone, it's not saying how many it's making, but it's not going to be a mass market device in the same way that of those other phones will be. There's also no real word on price or release date. Nokia says the global average price will be 599 euros, but we'll still have to wait for a word from regional partners to see where exactly this phone is going to show up, and how much it's going to cost when it does. So, obviously again one of the big things on the Nokia 9 is just how many cameras it has and this sorta design might look familiar to you from the Light L16. That wild, 16 lens camera that shipped last year. That's because Light has actually partnered with Nokia on here and Light's lux capacitor technology is actually what's driving these 5 lenses. Qualcomm says that it's Snapdragon chip isn't ordinarily equipped for this kinda thing, and that's why Nokia needs Light's help in just processing this many camera inputs at once. It is still a little early on to tell exactly how the Nokia 9 is going to work, but in our early hands on shots, the amount of detail its been pulling in, especially on like wood grain or textures or the skyline shots it's really kinda impressive, especially from a smartphone, and we're really gonna have to test this against other phones, other cameras to see just whether or not this investment into this cool 5 camera tech is actually worth it. It looks really cool, but, is it? We'll see. Another thing that stood out to me is what Nokia's using these cameras for, which is specifically just for color, detail and depth. We have seen other multi camera phones like the LG V40, which took a really interesting approach in putting different lens types on its phones and different focal lengths. Now, with this you're still just getting that one static shot, just better in theory. But, I can't help but wonder whether there's a better way to leverage sticking 5 cameras on a device than just making them all the same. Keep it locked here at The Verge, we'll have more great MWC coverage here the whole week. Make sure to like and subscribe and yeah.",
    "transcript_keywords": [
        "Nokia",
        "cameras",
        "camera",
        "Chaim",
        "phone",
        "Nokia including",
        "Google",
        "phones",
        "Light",
        "Lightroom",
        "Android",
        "kind",
        "Nokia design",
        "device",
        "sensors",
        "thing",
        "things",
        "color",
        "shot",
        "Nokia range"
    ],
    "transcript_entity_values": [
        "3.5mm",
        "last year",
        "last years'",
        "one",
        "845",
        "Snapdragon",
        "Chaim with The Verge and I",
        "LG",
        "Nokia",
        "6GB",
        "Lightroom",
        "Google Pixel",
        "Google",
        "2",
        "Light",
        "six",
        "Five",
        "120",
        "5",
        "years",
        "Three",
        "10 seconds",
        "Qualcomm",
        "Samsung Galaxy S9",
        "16 lens",
        "the Light L16",
        "V40",
        "Adobe",
        "Light's lux",
        "two",
        "jack",
        "5.99 inch",
        "Android One",
        "12 megapixel",
        "3320 milliamp hour",
        "2019",
        "DNG",
        "USB-C",
        "five",
        "all five",
        "MWC",
        "599 euros",
        "the Nokia 9",
        "first",
        "Android One",
        "the whole week",
        "another couple seconds",
        "RAM",
        "First"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "EVENT",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "ORDINAL"
    ]
}