{
    "id": "9_GwHU2Z_6w",
    "title": "How to Get VIDEO from your doorbell - Skybell",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-12-09T14:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=9_GwHU2Z_6w",
    "category": "Howto & Style",
    "tags": [
        "Video Doorbell",
        "How to install video doorbell",
        "How to install Skybell",
        "What is Skybell",
        "Is skybell good",
        "Live streaming doorbell",
        "Video feed doorbell",
        "Security camera",
        "Home Security",
        "Nest"
    ],
    "views": 76021,
    "likes": 2328,
    "comments_count": 204,
    "description": "Learn more about Skybell HERE:  SkyBell sent me this doorbell to install and review -- as always my opinions are my own.   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://bit.ly/jrigSKYBELL",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "I have this problem... that whenever I leave my house, an important package is delivered while I'm gone. Or maybe when I'm home, the delivery guy just doesn't even ring the door bell and leaves my new stuff on the porch. Today, Skybell sent me something that might just solve all my problems. [Intro] Skybell is a 1080p video doorbell that can detect and record movement, and allow you to see whats outside your front door whenever you want. Inside the box we have the Skybell itself. I have the silver version, it has a metalic finish, but the body is actually plastic, like most doorbells are. Below that we have a mounting plate and screws, a drill bit for brick houses, and a screw driver. Below THAT we get one more little adapter that you'll only need if your doorbell is digital. Pretty easy to install, but my doorbell is all mechanical, as you can see here. A digital doorbell will have a speaker instead of the metal tone bars. Installing a door bell is actually pretty easy. Its just a simple switch. You have two little signal wires that you disconnect from the old doorbell. If you touch these live wires together, your doorbell will go off. The vast majority of doorbells will use low voltage wires, so touching them is safe. BUT its your job to make sure that your own doorbell isn't using standard voltage wires, or this could very well be your last do it yourself project. I'm screwing the new backplate into one of the old holes, and then starting my own hole for the bottom screw. Luckily my door frame is wood. Drilling a new hole into brick is a whole different project for another day. The signal wires, get tucked below each of the little screws on the left. I find that its easier to tuck the wire at the base of the head, that way, as you tighten the screw, the screw pulls the wire deeper underneath it, instead of pushing it out. Like it would if you put the wire at the top of the screw. Make sure the wires are all tucked away, and then the Skybell will clip in on the top and screwed in on the bottom. It'll charge up for a few minutes, then when it starts blinking red and green, connect your phone to the wifi signal it is emitting. This will allow the Skybell app to sync with the doorbell with your home wifi, that way it can communicate with your phone wherever you are, even outside of your house. And you can immediately start recording live video. Now even though this particular video is 720p, it is extremely low bit rate, since it is live streaming. Here is some sample footage. Indeed the video footage does look pixelated. But just remember that you are literally watching a video feed from a doorbell. The future is here. Inside of the skybell app you can change several settings, one of the coolest is you can actually turn your door bell off. This is awesome if you have a sleeping baby inside the house, or me when I'm doing voiceovers. Your phone will still be notified that the door bell rang, but there will be no sound echoing inside of your house. You can change the motion detection sensitivity. The high sensitivity would go off whenever someone walked on that the sidewalk in front of my house, so I switched it to low. You can also change the color of the LED out front. It is way bright and kind of distracting, so I Just turned it off altogether... but you know, for Christmas or Halloween this could be a cool feature. Overall this is an interesting fun little piece of tech. Even though the angle of the lens wont let me see the packages on the ground of my porch, it is still useful in other ways. The motion detection feature might come in handy. Whenever the camera turns on, it will save the video feed to a cloud. But you can always download individual clips that you need to your phone storage. Big thanks to Skybell for sending me this interesting gadget. Ill keep the video description updated with my review on it as time progresses. Thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "doorbell",
        "Skybell",
        "wires",
        "video",
        "door bell",
        "door",
        "screw",
        "house",
        "Skybell app",
        "wire",
        "signal wires",
        "bell",
        "phone",
        "Inside",
        "voltage wires",
        "video doorbell",
        "doorbells",
        "important package",
        "signal",
        "change"
    ],
    "transcript_entity_values": [
        "two",
        "a few minutes",
        "Halloween",
        "Today",
        "Christmas",
        "another day",
        "one",
        "Skybell",
        "Skybell",
        "1080p"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}