{
    "id": "9_olmFunEp8",
    "title": "THEY SAID IT WOULDN'T WORK!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-05-05T14:04:00Z",
    "video_url": "https://www.youtube.com/watch?v=9_olmFunEp8",
    "category": "Howto & Style",
    "tags": [
        "Gold plating",
        "Electro plating",
        "gold",
        "laifen wave",
        "jewlery",
        "how to plate gold",
        "gold toothbrush",
        "golden",
        "precious metal",
        "gold apple watch",
        "apple watch",
        "iphone",
        "24k gold toothbrush",
        "expensive toothbrushes"
    ],
    "views": 784100,
    "likes": 20133,
    "comments_count": 8559,
    "description": "Plating Stainless Steel with REAL GOLD is some really cool science. Get 10% Off your own Laifen Wave Toothbrush HERE:  or on Amazon:  (Makes a great Mothers Day gift! - Show her how much you care!) I have always enjoyed the electro chemical process of gold plating. Having a real gold plated toothbrush would be amazing! Leave any comment below this video and Ill pick one random winner to receive this custom one of a kind Gold Plated Laifen Wave Toothbrush. Its probably the worlds most expensive toothbrush.  The Gold Plating setup we used in this video can be found here:",
    "description_links": [
        "https://bit.ly/4brlm1z",
        "https://amzn.to/3UoJGtX",
        "https://www.goldplating.com/collections/prolab-individual-module-set-up"
    ],
    "transcript": "In front of us today packaged uncannily like an iPhone is what we would get if a tooth fairy fell in love with a Cybertruck. This is a fully sealed watertight stainless steel toothbrush from today's sponsor, Lifen. And while stainless steel is incredibly awesome, we're going to level it up with science by electroplating the Lifen Wave's glossy surface with real 24 karat gold. We have some mad scientist level of alchemy coming up. And of course I'll be giving away the golden toothbrush to one lucky person watching this video so they can get their teeth royally cleaned. Plating an object with real gold is surprisingly easy while at the same time being incredibly complex. The large beakers we have lined up are the Prolab Modular Gold Plating System from a company called Gold Plating Services. The first beaker that we'll be using to plate the Lifen Wave is filled with a yellow solution that both cleans the stainless steel while making it meaning that liquid wants to cling to its surface. This might look like apple juice, but I assure you it is not. This same process is what we've used previously to plate an apple watch and jewelry. After the toothbrush is clean, I'll drop it in some deionized water, rinsing it twice, making sure all the electro cleaning solution is washed from its surface. And without giving the Lifen Wave any time to dry, it's on its way to the nickel free trivalve 24 karat acid gold strike. And this is where the magic starts to happen. One of the reasons why stainless steel is so stainless and durable is because it instantly forms a layer of protective silver colored oxidation that doesn't allow any rust to penetrate its surface like normal steel does. However, if we want this stainless to chemically bond with gold, we need this trivalve acid to etch the surface of the toothbrush. Basically poking microscopic holes in that stainless oxide layer while 5 volts worth of electrical current fills the microscopically tiny holes with a thin layer of gold ions which seals the surface, priming it for plating. And here's another shot of the trivalve gold strike working its magic on my stainless steel jerry-rig knife. The thin flash of gold from the acid bath stops the stainless from re-oxidizing when it comes back in contact with the air. And that same gold flash provides a perfect base layer for the gold bath, which comes next. The trivalve acid only needs about 20 seconds to do this job. Finally, the Life and Wave comes to our heated royal purple hard gold bath solution, which is heated up to a balmy 100 degrees Fahrenheit. The positive anodes inside the glass beaker are made from graphite as the current flows from the positive anodes to the negatively charged toothbrush resting on a titanium bus bar. The gold ions in the solution are pushed with 2.3 volts and 1.395 amps towards the toothbrush and collect on the surface. The current continuously funnels the dissolved gold ions from the liquid solution to the toothbrush where they can attach to the flash of gold we deposited from the acid etch we did earlier. The microscopic gold ions are clicking together just like little Legos to stack the gold thicker and thicker the longer it's left in the solution. The purple solution has about $3,000 worth of gold dissolved into the liquid. The aerated bubbles at the bottom of the tank act as an agitator, making sure the liquid stays moving and the gold is easier to transfer. For our purposes, soaking for about 10 minutes gives the Life and Wave about a one micron thick layer of hard 24 karat real gold, which should be durable enough for our toothbrush. And all within about the space of 15 minutes, we have a gold toothbrush that would make even King Midas jealous. One reason that someone might want to electroplate something with real gold, besides humanity's obvious fascination with shiny objects, is because gold is an extremely excellent conductor for electronics. It also has extremely high corrosion resistance and is microbial. The Life and Wave has a seamless IPX7 watertight design, which makes the gold plating process easier and harder for dust and dirt to accumulate, but it makes taking it apart quite a bit more difficult. And if I'm being completely honest, with the Life and Wave being seal tight IPX7, I just don't think it's going to survive what's coming next. I do however want to keep the custom gold plated wave as pristine as possible for the lucky winner. So we'll be taking apart the far less expensive aluminum alloy version, which only costs $79. There are three options to choose from. A food grade white ABS for $69, aluminum for $79, and the stainless steel is $99. At first glance, the aluminum body is cylindrical everywhere except for a small dention for the capacitive power button. There are three different settings with 10 different power levels that can be adjusted even while the brush is in motion. The only place we'll be able to enter is from the bottom edge. There's a small seam near the magnetic charging port. We can slice and dice a bit with my jerry-rig knife and slowly pry that cap away from the body. It does not come apart easily. It looks like there are two seals, a copious amount of caulk around the inner edge, and a thick rubber ring providing the second line of defense to keep water out. Removing the circuits requires a bit more finesse. Lifene is using a nano-molding process which allows for the subframe to mesh very precisely with the drawn body. If you've never seen a deep drawn metal forming process, you should definitely check it out. With both the inner clips compressed and a few love taps on the metal shaft, that holds the replaceable bristles. Voila! The drawn tube is removed with its inner feature visible once the circuitry is popped out. Thumbs up for seeing what technology looks like from the inside. Do you prefer the classy 24 carat stainless gold exterior? Or do you think Lifene should make a transparent version? Let me know down in the comments. And while the circuits do look cool, I think we can go even deeper. There is a battery filling up the bottom portion of the subframe near the charging port, which makes sense. Looks like it's a 900 milliamp hour capacity. There are a total of 5 Phillips head screws holding the battery housing the motor, 2 right above the battery, and another 3 near the rotating and vibrating bristle holder. I'll flip up the ribbon cable latch and pull the motor ribbon away from the motherboard. The 6 watt motor, which is 3 times more powerful than other electric toothbrushes, is also branded with the Lifene logo. If we pop off the metal end cap of the motor, we can get access to the internal rotor. This is the part that provides the 60 degrees worth of oscillations and 66,000 vibrations every minute. The oscillations and vibrations are what provide a 3 times better clean than just regular brushing. The stator is a tad harder to get our eyes on since it's the stationary part of the electric motor and extremely secure. Grandpa Jerry used to teach me to let the teeth of the saw do the work, and I think that advice is exceptionally relevant now when working on a toothbrush. With the casing mostly gone, we can get a better look at the copper windings of that stator used to generate force to move the rotor. And there you have it, the inner workings of a rather impressively manufactured and fairly reasonably priced premium electric toothbrush. I'll leave links for all 3 variants down in the description. Replacement bristles are also only $10 for a pack of 3. And of course, if you're a fan of the finer things in life, or just want to be the only person on the planet cleaning your grill with a 24 karat gold plated life and wave toothbrush, just leave a comment down below and I'll pick one random winner anywhere in the world to send this toothbrush to. With a brand new pack of clean bristles of course. And as always, thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "gold",
        "Lifen Wave",
        "tooth fairy fell",
        "stainless steel",
        "today packaged uncannily",
        "Gold Plating",
        "toothbrush",
        "Wave",
        "stainless",
        "gold ions",
        "Gold Plating Services",
        "Modular Gold Plating",
        "Gold Plating System",
        "Life and Wave",
        "real gold",
        "Prolab Modular Gold",
        "Lifen Wave glossy",
        "stainless steel toothbrush",
        "gold plated wave",
        "gold plating process"
    ],
    "transcript_entity_values": [
        "15 minutes",
        "100 degrees Fahrenheit",
        "about $3,000",
        "79",
        "iPhone",
        "King Midas",
        "69",
        "only $10",
        "1.395",
        "24 karat",
        "about 10 minutes",
        "one micron",
        "24 karat",
        "two",
        "Gold Plating Services",
        "three",
        "Grandpa Jerry",
        "about 20 seconds",
        "The Life and Wave",
        "Phillips",
        "10",
        "the Lifen Wave",
        "Cybertruck",
        "5",
        "24 carat",
        "66,000",
        "60 degrees",
        "first",
        "second",
        "IPX7",
        "Lifen",
        "today",
        "the Prolab Modular Gold Plating System",
        "5 volts",
        "2.3 volts",
        "6 watt",
        "24",
        "3",
        "One",
        "99",
        "one",
        "2",
        "the Life and Wave",
        "the Lifen Wave's",
        "Lifene"
    ],
    "transcript_entity_types": [
        "TIME",
        "QUANTITY",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON"
    ]
}