{
    "id": "9l3f1KrMQeo",
    "title": "Apple vs Right to Repair: Part 2!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-11-17T21:42:55Z",
    "video_url": "https://www.youtube.com/watch?v=9l3f1KrMQeo",
    "category": "Science & Technology",
    "tags": [],
    "views": 1777802,
    "likes": 89096,
    "comments_count": 3735,
    "description": "Apple vs Right to Repair has taken a step in the right direction!  What is Right to Repair? (Part 1):   Apple Newsroom announcement:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/RTbrXiIzUt4",
        "https://www.apple.com/newsroom/2021/11/apple-announces-self-service-repair/",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - So today Apple announced their Self Service Repair Program, in a pretty major flip on their stance on right to repair, and yes, there is still a bit of a catch, but my first reaction on seeing this was, well. I ain't never, ever see you act like this before. It does seem kind of crazy. We're seeing them add ports back to the MacBook Pro, going back on that stuff, and now flipping a stance on the right to repair, but my second reaction was why? So I made a video a little while back this year, all about right to repair, that I highly suggest watching, talks about the concept, a bunch of companies with various stances around the issue and why it's important. The concept of being able to repair the thing that you bought should be very simple, but in 2021, it's not. Now, Apple isn't the only company guilty of various bad practices like this, but they are one of the most influential consumer-facing companies ever, so any step they make in favor of right to repair is a pretty major deal. So here's the announcement they've made, and I'll link it below. Apple announced this Self Service Repair Program, which allows customers who are comfortable with completing their own repairs access to Apple's genuine parts and tools. This is starting with the iPhone 12 and 13 lineups, starting early next year, and soon will add M1 Macs after that, and the initial phase of this program will focus on the most commonly serviced modules, such as iPhones' display, battery, and camera. So basically, independent certified repair shops have had access to some tools and parts for some very basic repairs to stuff like the iPhone, and now, individuals, like you and me, will be added to the list of people who can get access to those tools and parts. That's the pretty big deal. So let's say you drop your iPhone or something on the ground, the screen cracks, okay, you've already always had the option to go to the Apple store and have them do it for that price, or you could take it to an independent repair shop and pay for them to do it, but now, you have the extra option, if you're a confident and competent enough person, to get that manual, get those individual parts straight from Apple and do the repair yourself, and then you can actually send back the old or broken parts to Apple so they can recycle them and then go get a credit back on your account for some of that value. That's not bad. So on the surface, I think this is great. I think it's huge, the potential e-waste being removed, the potential repairs that have been unlocked, the real choice that's being offered to us and the potential ripples this sends throughout the industry are all great, but it is definitely still a first step, and here's why I say that. So number one, it's still the pretty simple, fairly short list, so this goes back to the point I made in the original right to repair video, which is that devices like these phones and laptops are more complex than ever and are built way more tightly integrated than ever, which makes them much more difficult to repair. So even if an individual like you or me now has the instructions and the parts officially from Apple, some of the deeper repairs, like parts of the motherboard... I could do a battery or a screen, no problem, but some of the memory might be going wrong and you want to replace some of that, it's all still soldered together and it's integrated so much that you'd probably have to replace the whole thing. So that hasn't really changed. Now, I will say, I have seen some tear downs of the new 14 and 16 inch MacBook pros and the battery looks noticeably more repair friendly. There's pull tabs under some of the cells now, only a few screws to get inside the bottom, so this does appear to be premeditated, at least a little bit, but I still don't see people like you and I taking parts of the motherboard off, but then, number two, this is also something that a lot of independent repair shops and people like Louis Rossmann have already aired their grievances about, which is that the list of those repairs that are being supported by Apple is still so short. It's like batteries, screen, cameras. That's it, and if it's anything outside of that, there still will not be official Apple documentation or parts made available. That also has not changed. Now, the fact is most iPhone repairs will be under those three most common ones. Screens and batteries' gotta be number one and number two, and apparently, that's over 200 parts and tools already being made available, just for those big three. Macs being added to the list will add a lot more, and those are probably the only types of repairs I would, personally, at this moment, be trying to do myself, but for repairs beyond that, ports, buttons, speakers and mikes, and things like that, I would like independent repair shops to be able to fix those things with official Apple parts and documentation as well. Apple says the program will be expanding later next year, but as of right now, that has also not changed. So why did Apple do this? They've been notoriously against pretty much any right to repair stance for forever. This is so unlike them. Well, number one, I think a lot of the impending legislation caused by the right to repair movement has put pressure on them. There's FTC regulation coming down. There's also things in Europe in law that have pressured Apple and they're getting out ahead of it. Even a presidential order has gone through in the US. I think it needs a lot more work to be stronger, but Apple is seeing all this stuff and is getting out ahead of it a little bit, but also number two, this is fantastic PR. This is a great headline, especially for Apple. Now, again, a lot of the stuff, still unchanged. We have a lot of questions. We don't know prices yet, how much these parts are going to cost for individuals. We don't know the qualifications, if everyone's going to be able to get these parts or not, and there's still a bunch more details of the program that have yet to be unveiled when it does start next year, but it's a great first step. I will absolutely give them that. It's a great first step, and since it's a great first step for Apple, one of the biggest companies out there, it's a great first step for the industry as a whole. So I like it, but, yeah, this is great. I almost want to take a broken iPhone and just repair it, just for the hell of it, but I'm curious what you guys think. I don't know. It feels like a new look Apple, whether it's just them getting out in front of legislation and potential problems in the future, or maybe a little bit of them is also listening to what people are saying. I don't know. Either way, it got us here, so it's a good day for the beginning of the movement either way. That's been it. Thanks for watching. Catch you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "Repair",
        "Service Repair Program",
        "parts",
        "repairs",
        "Service Repair",
        "today Apple announced",
        "Repair Program",
        "great",
        "repair shops",
        "independent repair",
        "today Apple",
        "Apple announced",
        "Program",
        "back",
        "independent repair shops",
        "Apple parts",
        "official Apple",
        "lot",
        "step"
    ],
    "transcript_entity_values": [
        "their Self Service Repair Program",
        "Apple",
        "three",
        "one",
        "Europe",
        "this Self Service Repair Program",
        "13",
        "early next year",
        "this year",
        "iPhones",
        "16 inch",
        "first",
        "2021",
        "M1 Macs",
        "over 200",
        "iPhone",
        "14",
        "the MacBook Pro",
        "next year",
        "later next year",
        "second",
        "FTC",
        "US",
        "Macs",
        "number two",
        "Louis Rossmann",
        "two",
        "MacBook"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG"
    ]
}