{
    "id": "9omEhuB5SAo",
    "title": "Google Pixel 5A review: bigger battery, lower price",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-08-17T16:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=9omEhuB5SAo",
    "category": "Science & Technology",
    "tags": [
        "pixel 5a",
        "pixel",
        "google",
        "phone",
        "battery",
        "battery life",
        "screen",
        "5g",
        "water resistance",
        "specs",
        "review",
        "price",
        "mobile",
        "technology",
        "cellphone",
        "phone review",
        "pixel 5a review",
        "pixel review",
        "google pixel",
        "google pixel 5a",
        "google pixel 5a review",
        "tech",
        "gadgets",
        "android",
        "verge",
        "the verge",
        "best phone",
        "android phone",
        "pixel 5a specs",
        "pixel 4a",
        "pixel 4a 5g",
        "pixel 5a vs 4a",
        "pixel 5 vs pixel 5a",
        "pixel 5a leaks"
    ],
    "views": 315612,
    "likes": 8674,
    "comments_count": 589,
    "description": "Rumors of its demise have been greatly exaggerated and the Pixel 5A is here with a bigger 6.34-inch screen, IP67 waterproof rating, and a larger 4680mAh battery. And at $449, its also less expensive than the 4A 5G. Theres still no wireless charging or a fast refresh rate screen, but the 5A adds up to more than the sum of its specs.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This is the Google Pixel 5A with 5G, a mid-range phone that just a few months ago was rumored to have been canceled altogether. Clearly it wasn't because here it is bigger than ever with some small, but nice improvements. You won't find any flashy hardware specs here, and it's not fancy. Instead, Google is building on what was already a good phone and tweaking a couple of things here and there to make it even better. It has a bit bigger screen, IP-rated waterproofing, and a much bigger battery. And that's about it. Not the most exciting update, but it's an important one. Before we get into the details, you may be wondering, is the Pixel 5A the successor to the Pixel 4A or the Pixel 4A 5G? The answer is yes. Google says it will keep selling the 4A, until it runs out of parts for it. But effectively the 5A replaces both models. It's closer in size and spirit to the 4A 5G. So to keep things simple, we'll compare it against that. Let's start with what hasn't changed. The Pixel 5A uses the same capable Snapdragon 765G processor as the 4A 5G with 6GB of RAM and 128 gigs of storage. It also offers the same cameras, including 12 megapixel main, and 16 megapixel ultra-wide rear facing units. There's still no wireless charging and the screen still uses a standard 60 Hertz refresh rate. And there's one thing we're glad to see sticking around, the headphone jack is still here. So what's new on the 5A? There's a slightly bigger 6.34 inch display, and the battery gets a big boost up to 4,680 milliAmp hours, 20% bigger than the 4A 5G's. The 5A is built with a metal unibody and includes an IP 67 waterproof rating. Another important number that's different this time around is the price. The 5A will cost $449, which is $50 less than the 4A 5G's introductory price. Oh, and a few words about 5G. The 5A supports sub six gigahertz 5G, which its predecessor did too. But this time there won't be a version that supports millimeter wave 5G. That's the super fast, hard to find version of 5G that Verizon in particular has been pushing hard, and it's no great loss here. What's more worrisome is the lack of C-band support. C-band is the good mid band stuff that Verizon and AT&T will be adding over the next few years to make their 5G networks better. The Pixel 5A has the hardware and FCC approval to use C-band, but it doesn't support it at a software level. Google says it could add support later, but is being very non-committal about it right now. Plenty of mid-range phones being sold now already support C-band. So it feels like a miss not to include it right off the bat. All told, a bigger battery and screen and waterproofing may sound like a short list of upgrades and it is, but the key is that they're all really meaningful. Google has made some strategic updates to what was already one of the best devices in its class, and it hasn't messed with a winning formula. Take that IP rating for example, IP 67 means it can withstand being submerged in about three feet of water for up to 30 minutes. That's not quite as robust as the IP 68 rating that's more common among flagship phones, but any water resistance rating is pretty rare in the mid range class, same with the metal unibody, it makes the phone feel reassuringly solid, even if it's underneath a plastic skin. I'm also into the matte finish carried over from the Pixel 5. It doesn't get as smudgy as glossy plastic or glass. Hopefully you like black if you're considering the Pixel 5A because that's the only color option this year. No white, no fun greens, purples or pinks. There are some colorful case options like the lime green that came with mine, which honestly, I'm not crazy about, maybe it's the neon green accents, but it throws off the phone's minimalist vibe. I miss the fabric case. Please bring back the fabric case Google. Anyway, the Pixel 5A's screen isn't huge by any means, but 6.3 inches is just big enough that it doesn't look too out of place next to the 6.5 and 6.6 inch competition. It's also a 1080P OLED panel, that's plenty detailed and nice to look at. Some budget phones offer lower res or lower contrast LCDs that don't look quite as good, even if they outmatch it in terms of size. One improvement that anyone can appreciate about the 5A is it's much bigger battery. Google has been doing better in this department ever since the poor performance of the Pixel 4, but the new battery finally puts it on even ground with the competition. Specs don't tell the whole story when it comes to battery life, but it's not uncommon for budget and mid-range phones to include 5,000 milliamp hour batteries. This 4,680 milliamp hour cell definitely keeps up. After four hours of screen on time, I'm only down to about 70%. So it shouldn't have a problem getting through a couple of days of moderate use. Even though there's nothing new to report about the camera, it's a Pixel phone, so we have to talk about it. Google was already well ahead of the rest of the mid-range class in terms of camera capabilities, that it really didn't need to change anything to maintain its lead. Lots of mid-range phones can take decent photos in good light, but the Pixel is still the low-light champ of the budget class. In terms of hardware, the 5A covers the basics. There's nothing here that you don't need, like a low res macro or a depth sensor. The 12 megapixel main camera has optical image stabilization, which is pretty uncommon at this price point, and it helps you get more sharp shots in lower light conditions. There's also a good quality ultra wide, not a standout, but it gets the job done. Of course, what really sets Pixel cameras apart is the software, and that's still the case here. You get the excellent night sight mode, a convincing portrait mode, an impressive handling of high contrast scenes, thanks to some clever computational tricks. Colors are a little more subdued than you'd get with a Samsung phone, but that comes down to personal preference. Personally, I'd take the more natural rendering of the Pixel. Maybe in a year or two, when there are decent telephoto options for inexpensive phones, Google will have to revisit this whole formula. But at the moment, it's as good as it gets in this class. (upbeat music) So there you have it. The Pixel 5A is essentially the 4A 5G with a few updates that look minor on paper, but are actually kind of major. If you want something more exciting in the 400 to $500 range, you certainly have options. The Samsung Galaxy A52 5G has a faster refresh rate screen. The TCL 20 Pro has a fancy curve display and wireless charging. The Moto G Stylus 5G has a much bigger screen and naturally comes with a stylus, but the Pixel 5A has a pretty big software advantage. The user interface is simple and functional, updates arrive quickly, and you'll get three years of OS upgrades and security support. We recommended the Pixel 4A and 4A 5G for a long time with a couple of ifs. If you're okay with a smaller screen and if you don't mind the lack of an IP rating. With the 5A, Google has more or less removed any reason not to recommend it to someone shopping for a mid-range phone. The Pixel 5A might be a boring update, especially with the Pixel 6 already announced and around the corner. But honestly, it's the kind of update we'd love to see. Hey, thanks for watching. Are you gonna pick up a Pixel 5A, or are you holding out for the Pixel 6? Do you miss the fabric case? 'Cause I really miss it. Let us know in the comments below.",
    "transcript_keywords": [
        "Pixel",
        "Google",
        "Google Pixel",
        "bigger",
        "phone",
        "screen",
        "Pixel phone",
        "phones",
        "canceled altogether",
        "months ago",
        "ago was rumored",
        "midrange phones",
        "bigger battery",
        "battery",
        "midrange",
        "good",
        "support",
        "Pixel cameras",
        "Cband",
        "bigger screen"
    ],
    "transcript_entity_values": [
        "about three feet",
        "four hours",
        "a couple of days",
        "just a few months ago",
        "6.6 inch",
        "400 to $500",
        "one",
        "AT&T",
        "128",
        "20%",
        "Verizon",
        "the next few years",
        "16 megapixel",
        "Pixel",
        "6GB",
        "4A",
        "4,680 milliAmp hours",
        "A52",
        "Google",
        "6.3 inches",
        "5,000 milliamp hour",
        "year",
        "60",
        "5",
        "three years",
        "Samsung Galaxy",
        "4A 5",
        "6.5",
        "50",
        "20",
        "Hertz",
        "FCC",
        "Samsung",
        "two",
        "jack",
        "The Pixel 5A",
        "1080P",
        "449",
        "One",
        "12 megapixel",
        "this year",
        "up to 30 minutes",
        "Snapdragon 765G",
        "The Pixel 5A",
        "Verizon",
        "OLED",
        "5A",
        "G",
        "6.34 inch",
        "about 70%",
        "IP",
        "the Pixel 5A's",
        "the Pixel 5A",
        "67",
        "RAM",
        "the Pixel 5A",
        "millimeter"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "DATE",
        "DATE",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL"
    ]
}