{
    "id": "9TI8fStHMjY",
    "title": "DON'T Throw Away Your Old Router - WDS",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-03-02T18:59:10Z",
    "video_url": "https://www.youtube.com/watch?v=9TI8fStHMjY",
    "category": "Science & Technology",
    "tags": [
        "WDS",
        "wi-fi",
        "router",
        "static ip",
        "setup",
        "dhcp",
        "range extender",
        "ethernet"
    ],
    "views": 892961,
    "likes": 50387,
    "comments_count": 1586,
    "description": "Buy CORSAIR's HS70 on CORSAIR at   Learn about WDS and how it's like turning your router into an invisible Ethernet cable.  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/WjbJD",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Have you ever been in a situation where your WI-FI doesn't reach far enough and you can't run a cable, you could buy a repeater or another mesh node but those things cost... money. Fortunately, you actually might be in luck if you or a friend, has an old router lying around like this one! This is actually a new router. Many modern wireless routers, even cheaper ones have a feature called Wireless Distribution System or WDS. This essentially allows you to disable the features you're not using and deploy the router as a repeater with the added advantage of giving you access to the wired Ethernet ports on the back. Those babies. You can think of kind of like running an ethernet cable, but wirelessly. So how do you set it up? Although there's usually a simple on-off option for WDS in your router settings. It's wise to do a little bit of configuration work as well in order to ensure it works properly. Start by manually setting both your main wireless network and the secondary router to the same channel, so they can communicate. To keep the connection stable, You'll wanna give your secondary router a static internal IP address, but how do you do that? Well, on a home network, every connected device is assigned a private IP address that typically starts with 192.168. This system ensures any incoming data is sent to the correct device. Usually your router assigns these addresses automatically through a system called DHCP, but for WDS you'll wanna give your secondary router one IP address,it hangs onto permanently instead of having your main router automatically give it a new one periodically which can cause connection problems. Log into your main router and find the place in the settings that we'll show you a list of all the connected clients. Then go back to your secondary router and give it an IP address in the land settings, that isn't currently being used by any of those devices, make sure you start it with one nine, two.one six, eight.zero or one depending on which one your network uses and using a fourth number that's between 1 and 255. You can also set the second router static IP within the first routers DHCP settings by finding the second router's MAC address and putting it in there. After you do this, go ahead and turn on WDS. You'll get a prompt asking which wireless network you wanna connect to. So pick the right one and punch in the password. Make sure by the way, that you turn off the DHCP feature on the secondary router, your primary router will handle assigning internal IP addresses and having two devices on the same network handling DHCP functions. Oh... That can cause some pretty bizarre problems. Get flashbacks, From here, You're all set to use your secondary router. If you're trying to connect a wire device, just plug in the Ethernet cable, the one of the land ports, not the wind port! The land ports. If you're trying to connect wirelessly instead, punch in the credentials that your secondary router is using to connect directly to it. Although you can also give your secondary router the same login information as the primary one to have your WI-FI devices switch automatically between them. But wait, there's a big caveat with using WDS because WI-FI is a half duplex protocol that can't send and receive at the same time. WDS tends to be slower than using a single router. In fact, if you're connected to the secondary router wirelessly, your speeds will be roughly cut in half. Also keep in mind that you may not. Want to assign both routers the same login information, as client devices tend to hang on to the first access point they can connect to, for dear life! So your phone, for example, may not switch back to the primary router the way you would like to once it's in range, but while WDS isn't perfect. It's a great way to repurpose an old router. If you don't need the highest possible speeds and can be a lifesaver. If you have a wired only device you really need to use unless you don't mind tripping over the a 100 foot Ethernet cable you've snaked all through your house. It's an aesthetic dystopian, cyberpunk cables everywhere but if you're not into cables you might want to check out our sponsor. CORSAIR'S HS70 is HS70 Pro wireless headset. It features metal construction and a fully detachable unidirectional microphone. You get up to 16 hours battery life, adjustable onto your Memory Foam Ear Cups, and improved 40 foot range via low latency, 2.4 gigahertz wireless. It also features 7.1 surround via a 50 millimeter neodymium speaker drivers. so learn more at the link below. Wow! you watched the whole video. Thanks for that guys. Hey, you know what else you can do like the video but if you didn't like it, I dislike it. This is so dumb. Check out our other videos comment below the video suggestions and don't forget to subscribe and follow. I'll be watching...",
    "transcript_keywords": [
        "router",
        "secondary router",
        "WDS",
        "secondary",
        "things cost",
        "ethernet cable",
        "wireless",
        "mesh node",
        "routers DHCP settings",
        "DHCP",
        "Ethernet",
        "give",
        "routers",
        "network",
        "connect",
        "main router",
        "routers DHCP",
        "Wireless Distribution System",
        "primary router",
        "device"
    ],
    "transcript_entity_values": [
        "one nine",
        "half",
        "2.4 gigahertz",
        "secondary",
        "one",
        "192.168",
        "up to",
        "IP",
        "WDS",
        "second",
        "40 foot",
        "WI-FI",
        "CORSAIR",
        "7.1",
        "WI",
        "100 foot",
        "MAC",
        "50 millimeter",
        "first",
        "Wireless Distribution System",
        "two",
        "between 1 and 255",
        "DHCP",
        "Ethernet",
        "16 hours",
        "six",
        "HS70 Pro",
        "fourth"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORDINAL"
    ]
}