{
    "id": "9vf1jJ3Kc9w",
    "title": "Top 5 Tech Under $200",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2014-11-28T17:26:09Z",
    "video_url": "https://www.youtube.com/watch?v=9vf1jJ3Kc9w",
    "category": "Science & Technology",
    "tags": [
        "tech",
        "technology",
        "black friday",
        "deals",
        "black",
        "friday",
        "syma",
        "roku",
        "3500r",
        "roku 3500r",
        "leap",
        "leap motion",
        "hp",
        "hp stream 7",
        "stream 7",
        "moto g",
        "moto g 2014",
        "moto",
        "moto g 2nd",
        "unbox therapy",
        "unboxing",
        "unboxtherapy",
        "cyber monday",
        "black friday deals",
        "Black Friday (Holiday)",
        "cyber",
        "monday",
        "tech deals",
        "christmas",
        "Christmas (Holiday)",
        "review",
        "tech gifts",
        "gift ideas",
        "gift",
        "gifts",
        "gifts for men",
        "men",
        "cool gifts"
    ],
    "views": 3378985,
    "likes": 39490,
    "comments_count": 2067,
    "description": "Full list of featured products below.  $25 - Syma S107G 3.5 Channel RC Helicopter   $50 - Roku 3500R Streaming Stick   $75 - Leap Motion Controller   $100 - HP Stream 7   $200 - Moto G 2014   Special thanks to Austin and Dom. Check them out!  Austin Evans -   Dom Esposito -",
    "description_links": [
        "http://amzn.to/1U7BM3O",
        "http://amzn.to/1sZomMI",
        "http://amzn.to/1U7AAO0",
        "http://amzn.to/25HGpcd",
        "http://amzn.to/1UCcslk",
        "http://youtube.com/austinevans",
        "http://youtube.com/macmixing"
    ],
    "transcript": "Yes wooh oh I'll take it What's up guys lew here back with a brand new video and as you can tell I am in beautiful and sunny, Santa Monica That's cuz I'm on an extended trip out here in Los Angeles filming a top-secret project Shh, don't tell anybody I got my man austin evans running the camera Rig do a little Nod, Austin are you there he is? He's alive. That's my man, and I've also got dom from the very popular Mac mixing channel He's got a new video coming up Go check it out But the reason you're watching today's video is because there's all kinds of Hoopla going on regarding black Friday The holidays gifts and shopping and so on these two maniacs that I just mentioned to you they decided to switch the game a little bit on me to select five different items at various price points in the Technology world that could make good gifts. So they did 25 50 75 100 and then $200 here's the catch I don't know what the hell they've bought so I am going to be as surprised as you are Watching this video, and you can also hold them accountable responsible for these decisions Here we go top five gifts at various different price points. Let's start low, This one's under 25 Let me see it. What do you got Dom? Oh? What do you got Dom? Oh! We have the S107 metal series RC mini helicopter, so inside the box We are greeted with a number of different things. We have; A usb cable, that's gonna be used to charge it up. I'm sure first up. We have the controller Two thumb sticks lots of grip those teeth are biting into my thumbs right now. That's a good thing though Batteries in the back need a screwdriver from that did we think this through? laughs Did we, did we think this through on how we're actually gonna fly. It doesn't matter. We don't need to fly it right now By the way, happy Thanksgiving everybody You're probably eating turkey right now Turkey day get your turkey on the helicopter is free You can be sure if I put this baby up in the sky right now We're going straight to the Pacific Ocean. I'm Gonna, I'm gonna take this back and show this to will will's gonna really like this. What's up well I? Miss you be home soon. Ok! next up We're gonna do $50 am I right $50? Oh? Oh That's a Smart move I've actually never used one of these but as you can tell you're essentially getting something in a similar form factor to like the chromecast but; It's roku so, as opposed to just being able to like stream from some other device This has baked in programming essentially you know Netflix YouTube Amazon Etc Simple stuff plug it into any HDMi port it's about the size of a chromecast or a uSB stick Connected to Wi-Fi and start streaming. It looks like we also get a remote control to go with it So I guess that's another incentive over going with a chromecast for example Can you ask for any more fun than that happy streaming? Wow this is small? Look at that and light So all you have on here is an HDMI Connector and you've also got a micro usb connector now. Let me go ahead and check out the other items inside the box it's funny the remote is larger than the actual device up here you have your D-Pad home button back button and Then some quick buttons to get to specific applications Blockbuster, Netflix Amazon, thanks for that (Motorbike) Appreciate the audio and one of my favorite things whenever I buy a device Duracell batteries well not they're a cell specific. I mean I like duracell don't get me wrong but Batteries so that you can get started right out of the box Listen Brand manufacturers, please listen to me now this is a very important message from all the unbox therapy fans in the world if your product takes double-a batteries put them in the Damn, box so we've done 25 we've done 50 and now we're gonna step it up. We're at $75 I'm very excited Let's see what we got Whoa leap motion the remarkably accurate incredibly natural way to interact with your computer I've seen videos of this but I have never used one browse the web play games make music and more all with the wave of the hand or Lift of a finger so essentially this thing is able to track motion just like in real life so it's essentially capable of Gesture interaction, let me go ahead and open this up dun, dun, duunnn! Oh the anticipation Welcome to a whole new world Wow, that's small It's kind of got you know a macbook vibe to it the design you have this aluminum around the outside a usB connector there Obviously to interface with your system, so all the sensing I believe Correct me if I'm wrong is Gonna happen Via this Panel here on the top okay, so here's our usb connector They give us two but why two ah short one in a long one Whoa attention to detail much like the batteries Options baby, that's about it. So this one the Magic comes when we connect it I'm gonna be doing that back at the apartment very shortly, but there you have it seventy-five dollars the leap motion controller Look at that little baby. Okay, so now we've done 25 50 75 And I wanted to keep as many of the items below 100 as possible because I think that that's plenty of money to spend to get somebody something cool But now we're sitting at under 100 Let's see if this one can blow my mind dom. What do you got for me? whoa under 100 extreme 7 Hp tablet That's crazy. I mean I didn't know you could get this for under 100. So we're really compact windows tablet this is Gonna be a bit of a Learning experience for me because I have very little windows tablet past it's Full windows we have our set up screen here as you can see I'm one handing it very easily volume Rocker power button forward facing camera headphone as well as usb port camera on the back as well, and it has intel inside You're actually dealing with an intel atom processor at one point three three gigahertz This thing is a little bit fat boys and girls. I mean comparatively speaking Right that's all subjective if you did this in you know five years ago. This was paper-thin but Ninety nine bucks. That's the key characteristic and a windows experience for 99 bucks inside the box Micro usb standard stuff and then a power brick to charge it up obviously as you guys know this is a bit of a gift guide and not a Full-on review type experience, so I'm gonna have to go and Gather my first impressions But at 100 dollars we have the HP stream 7 Alright, so we are now at the top of the list we've done 25 50 75 100 and the next product is the grand finale the gift under $200 that's for the people that you really love. No I'm just I'm just kidding these are all great gift ideas and Personally the most exciting part of this is that I feel like we've unveiled Some great gifts at some some lower price points to make it easy to give back to those loved ones to those friends so This should probably be the most exciting at least I'm hoping so or maybe it's not let's figure out what we've got at the under 200 price point whoa You guys bought a phone for under 200 bucks Yes, because it's the moto G and if you don't know much about this phone This is one of the best values in the world right now on the marketplace I'm a big fan of the motorola stuff for example I've been using the new moto x for an extended period of time I like the fact that they don't change the os too much You know they leave a roughly stock Experience and in this particular case you're getting an unlocked device so you can take it To whichever carrier you like and you're doing it for under 200 bucks. You can see on the back here You have a five inch hd display stereo speakers. Which is actually different than the new moto x which is only Mono It's a good mono speaker But stereo is always better and eight megapixel camera and of course the curved design on the back there similar to the new moto x so inside the box we have the Device first some of the specs here Mm. 70 milliamp hour battery maybe you want a slightly bigger one, but come on. This is 200 bucks, please stop complaining Android of course interesting thing here you can actually run the latest 5.0 lollipop on this device Even though it's only a $200 device so while people with flagship devices out there are still waiting for an update You're they're rocking 200 bucks, and you're on the latest that's a baller status right there. That's a big man move Motorola dimple which gives you incredible confidence when holding it I really like what they've done with the construction and 5 inches is a really good compromise in between the Phablet and the smaller Smartphone world at least from my hand symmetrical design all the way through camera flash And then on the bottom your micro usb charge port other items in the box We're looking at a power brick to charge it up interesting thing here. No usb detachable power This is just a straight up power brick in white that's ok for most people a little bit of paperwork But really the story is all about the device itself one of the devices that I think is really a game changer In the marketplace right now and not not even just this marketplace here but emerging markets you can now get a device outright that you own that you can take to your choice of carrier and It's Gonna Perform Very close to some of those flagships 90% of the way at a fraction of the cost so good choice boys the new moto G comes in as The epic gift to the under 200 gift so there you have it We've counted down or counted up the top 5 or at least 5 different gift ideas From 25 all the way up to 200 to show the people in your life that you appreciate them with a cool piece of technology I'll link everything down in the description. I think you guys did a great job Remember they were a big part of it. We have Austin evans on the camera link to his channel down in the description We have Mr. Mac Makes a link to his channel down in the description definitely go and check them out also stay tuned for this crazy project That we're shooting while out here in Los Angeles You don't know anything about it yet? But I think you're gonna be really Excited for it if you enjoyed this content make sure to leave a thumbs up down below and if you want to know more about Any of these products the links will be down below. Thanks as always for watching and I'll catch you on the next episode I'm gonna go enjoy this sunset now alright later guys",
    "transcript_keywords": [
        "Santa Monica",
        "topsecret project Shh",
        "camera Rig",
        "device",
        "back",
        "usb",
        "project Shh",
        "Los Angeles filming",
        "beautiful and sunny",
        "filming a topsecret",
        "box",
        "price points",
        "gift",
        "usb connector",
        "Santa",
        "Shh",
        "Nod",
        "Monica",
        "Rig",
        "video"
    ],
    "transcript_entity_values": [
        "lew",
        "Gather",
        "25",
        "seventy-five dollars",
        "intel",
        "austin evans",
        "at least 5",
        "Two",
        "Batteries",
        "Magic",
        "five years ago",
        "99 bucks",
        "Los Angeles",
        "Android",
        "200",
        "Mono",
        "5.0",
        "five inch",
        "50",
        "today",
        "70 milliamp hour",
        "Friday",
        "first",
        "Austin",
        "Thanksgiving",
        "Mm",
        "Netflix",
        "the Pacific Ocean",
        "Duracell",
        "75",
        "Amazon",
        "Ninety nine bucks",
        "RC",
        "100 dollars",
        "5 inches",
        "two",
        "200 bucks",
        "Santa Monica",
        "7",
        "Turkey",
        "five",
        "Smart",
        "100",
        "200",
        "duracell",
        "50",
        "under 100",
        "Dom",
        "Amazon",
        "Connected to Wi-Fi",
        "Mac",
        "Micro usb",
        "Motorola",
        "HDMI Connector",
        "S107",
        "eight megapixel",
        "90%",
        "one point three",
        "5",
        "Austin evans",
        "up to 200",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "ORG",
        "DATE",
        "MONEY",
        "GPE",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}