{
    "id": "9Whx7gQaB0M",
    "title": "Is the iPhone 12 Pro Max Worth It?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-11-10T14:20:10Z",
    "video_url": "https://www.youtube.com/watch?v=9Whx7gQaB0M",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "iphone",
        "apple",
        "ios",
        "iphone 12",
        "iphone 12 mini",
        "iphone 12 pro max",
        "iphone 12 pro",
        "new iphone",
        "iphone 11",
        "smartphones",
        "best smartphones",
        "iphone 12 mini vs pro max",
        "tech",
        "technology",
        "best iphone"
    ],
    "views": 69441,
    "likes": 2495,
    "comments_count": 482,
    "description": "Do you prefer the size of the iPhone 12 Mini or iPhone Pro Max?   The Razer Book Is(n't) a Gaming Laptop:  BLIND Mystery Tech Challenge:  What PS5 & Series X Are Missing:  Xbox Series X vs Series S Unboxing!  Is the iPhone 12 Pro Worth It?   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/mKtnjV-LtI8",
        "https://youtu.be/_IvNqh8z4C0",
        "https://youtu.be/MugTyyYrTlM",
        "https://youtu.be/3B2OzImgn1g",
        "https://youtu.be/crjVuHr-j4M",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome, to This Is, Today we have the big old chungus is versus the little old chungus. - Matt, did you just say big chungus versus the little chungus? - I figured it is better just to lean into it, 'cause I know you're gonna say it anyway. We have the iPhone Max versus the iPhone Mini. - For so many years, there were rumors about an iPhone Mini, but that was back with the original iPhone and everyone kept making these mock-ups of like an iPhone that was this big. - They made a mock-up that it was gonna be like this size, which to be fair, - You're on top of that way too fast. - I would be totally okay with an iPhone this size. I'm not gonna lie. - Okay, well, - But. - The main reason why we're here, of course, is to talk about the iPhone 12 Mini. This is the first time they've done a small phone since the iPhone 5S and I guess the SE kinda counts. This is a little bit bigger than that, but way smaller than a big chungus like the Pro Max. - Which, so we're gonna unbox this. I imagine it's gonna be completely lackluster. - It's gonna be an iPhone. - This is gold. But I feel like this is more of a champagne without a G. - [Jimmy] Aye! - I was gonna say it looks like a band-aid. - I do not like that gold. - Wow! Oh my God! So I have not actually tried a gold iPhone at all yet this year. That is crazy, also, are you kidding me? This is a tablet. - This is huge. - That is - This is a big phone, okay? - Oh God. - This is so big that I'm gonna be in Matt's camera angle. Look, it covers up the whole camera lens. How can you use a phone that's covered up a whole camera lens, Matt? - It's heavy too. - Going into this. Well, yes we are comparing the Pro Max versus the Mini. I think we both already made the decision on what we're most excited about, which is the little guy. - Yeah, I have wanted a smaller phone for so long. The Pixel 5, is just like a smaller phone, it feels so great in the hand. This, this is per, I thi, I literally think this is perfect. This form factor is the one for me. - Thank you very much for watching. Make sure to subscribe to This Is, for other pearls of wisdom such as, iPhone big is big. - Really what it's gonna come down to with these two phones is the cameras. So the Pro Max is the only phone of all the 12 line that has a new and improved camera sensor. So this is, on paper, much better than the Mini. But we should test it out and see. - So something I'll immediately say this has a much larger sort of camera circle. So I don't know if you can see compared to the-- - [Matt] Yeah, it's noticeably different on - [Jess] That's a big difference-- - [Matt] Unlike, oh, yeah, I don't know how well the camera takes that, but like, - [Jess] It looks bigger. - [Matt] I would say like, almost like 20, 30 bucks. - Also just for a reference. That's the Mini versus the Max. - [Matt] That is - That is how much bigger. - so much smaller. - It's like 50% more phone. My main concern when it comes to smartphones is usually the size, because obviously there are a lot of things that are important, performance, camera, battery life. But at a fundamental level, I care about how does a phone feel in my hand? How does it feel sort of in my pocket? Like how is it just to live with? A lot of people think differently to me. And I know specifically for a lot of people, the smartphone is your primary computing device. Sure, you may have like a laptop or a desktop or a tablet or whatever. But most people spend the vast majority of their time on a phone. And if you're one of those people, I think it makes a lot of sense to go with a larger device like a Pro Max. It might not make sense for everyone, but I get it, right? Like, you want the biggest canvas to do whatever it is that you wanna do. - It would be one thing if there was more multitasking - [Jess] Yeah. - or if, you know, you have more windows, but because this is a phone, that's why I just don't see you gaining the huge benefit from it. This is just a big phone that I don't think anyone can use in one hand. That's where it just like, how, like do you, are you fine using two hands for this phone? - You have to use two hands. - At all times. - This is, okay, so for context, you may be familiar with the iPhone 11 Pro Max or the XS Max, right? That was already a big phone. This is bigger. And the thing is, because they've gone back to these sort of very flat sides, even though technically these devices are actually a little bit thinner than I believe last year, - They feel thicker. - They feel thicker. Now, on the Mini, that's fine because the Mini is such a small phone it doesn't really bother me. But on the Pro Max, it's a big sort of slightly unwieldy phone 'cause it's so heavy. - And so I know that there's a gesture to swipe down, to get like the top things here. But with how big this phone is, I can't even comfortably do that, Jess. Like I have to go back to another hand. And it's just like, again, if maybe if I had bigger hands, that'd be one thing. But like, I don't think that any device you should be stretching your hand like this. - Okay, but hang on. We're being a little unfair because look, we both like the smaller device. - [Matt] Yeah. - But I do think there are a lot of people who would be happy with the Pro Max. - [Matt] I agree. - That being said, I think the safe bet, if you were interested in a new iPhone, is to go for the 12. The standard 12 fits right in the middle. If I had thought ahead, I would have one to show you, but Jimmy will show you a Bureau clip of what exactly that phone looks like right now. - See, here's the thing, I don't even think that's the case Because I still say everyone should just go for the Mini. It is, - Everyone should go for the Mini - It is the same exact phone as the 12. - Doubt, but it's smaller. - It is smaller. - No, hold on. Are you tryna tell me that everyone should get the Mini? - Anyone considering an iPhone that doesn't need the camera that comes in the Pro Max, should just go for the Mini. - So, the main differences are between these two phones. They have the same 5G and if you live in the United States, you get not only sub six, but also millimeter wave. So that is exactly the same. - So all 12 people that works for in the US. - The next thing is you get the same performance. That has two more gigs of Ram. - [Matt] Yes. - I actually am still in the middle of testing. I do think this is gonna throttle maybe a little bit faster, but I haven't finished that up. So make sure you're subscribed for other iPhone content, but you may lose a touch of performance, but generally speaking, it should be at the same. The screen is smaller, but same rough pixel density. This is a slightly better, but it's in the same ballpark. And it's, they're both 60 Hertz, so you don't get that. - And I wanna talk about performance for a second. 'Cause that's one of the main things. We said with the iPhone 11, that that was pretty much good enough for any real tasks that we were throwing at it. And so this is slightly better than the iPhone 11, but even if it starts to throttle and we lose a little bit of the performance of this, it is still gonna be - Totally fine. - At worst, this is gonna be iPhone 11 performance. - I think and that's 100% still better than pretty much any other phone out there. - Yes, iPhone SE, which has the same processor as the iPhone 11 is the most powerful processor and it beats out any budget Android phone. When you say like, \"Oh, this might lose a little bit of performance.\" It is so negligible to what you will ever notice. - I think one of the main questions a lot of people have about these new iPhones are the cameras. This has two options. You have an ultra wide and a standard shooter. On the Pro Max, you have the exact same ultra wide. However, it has a telephoto, which is 2.5 times. So it's slightly better. Although you lose a little bit of light, so that's slightly questionable. But you have a telephoto, which is certainly nice over the Mini. And you have a bigger sensor on the main camera. - Yes. - Now, in theory, this is better, right? Bigger sensor means that you have a little bit more of that sort of natural depth of field. But if we actually do a little test here, and I take a photo of you and your bald head, let's see what the actual difference is. And, boom. There you go, hold on. Oh, look at that so much better. Okay, and okay. I can see a little bit more depth of field, if you look at the brick wall behind you. Your beard looks a touch, sharper. - [Matt] It, the fact that it's not a night and day difference. That's the point I'm tryna make. - I certainly wanna spend more time with the Pro Max. But based on initial impressions, I don't think the camera is a massive leap forward 'cause, I mean, sure, it is a very good camera. And if you put this whole package together, it is probably the best package on a smartphone. - And that's why I was gonna say the wild card in all of this is a feature that's not out yet. And that is ProRAW. ProRAW is there is Apple branding, where it takes raw photos, but still lets you keep all the AI neural processing that makes these photos look great. And the Pro Max is definitely the one that's gonna take advantage of that the most. - Yes. - Especially with the slightly larger sensor. I'll be honest with you. That was tempting for me who I take all of our thumb thumbnail photos with the iPhone. But, is that a feature that's gonna sway me to spend $400 more money and lose that form factor? - It's tough, right? I mean, look, that's a very niche feature. But that being said, this is called the Pro Max. There should be some pro features there. If you're someone who always takes photos with the standard camera app, you're not gonna notice any difference. You're not gonna even turn on ProRAW, and that's fine. But the idea that you can get those extra features on this, although to be fair, that is also available, the ProRAW on the standard 12 Pro. You don't actually have to get the big chungus. You can get the - [Matt] You need to get one of the pros. - [Jess] Medium chungus. But here, it comes back down to me. Why can't I get a Pro Mini? - [Jess] So basically you would have the Pro Max feature or the pro features be available on the smaller phone. - [Matt] Yes. - So let me hit you with a question. - Yeah. - Right? You're someone who's wanting a brand new iPhone today, keeping in mind that the SE exists. - Yes. - That the 11 exists, which probably is battery better battery life than any of these other devices. And you also have the Mini, the Pro, the Pro Max, the standard 12. If you're gonna recommend one iPhone this year for everyone. Your mom calls, whatever. What are you going to recommend? - I can't recommend just one. I can recommend two. - Okay, go for it. - So I personally am someone, I think if you're gonna get a new phone, get the newest phone. Because it's gonna be the one that's gonna be the updated for the longest, it's, you know, it's gonna give you that extra, like an extra year of compatibility. But if you're gonna go for the newest phone, it's the Mini. I think it's the, not only the cheapest-- - Do you think that it fits, the size trade-off is worth it for most people? - I think the size trade-off is worth it for most people. And I think it's the cheapest phone. I mean, it is the cheapest phone they make of the newest lineup. It's really hard to ignore the iPhone 11 with how that's discounted right now. It's 100 bucks less than the Mini right now. - You're losing 5G, which, totally fine. - Again, most people don't even have access to 5G. Like we said, the processing in the iPhone 11 is perfectly, it's great. - [Jess] It's great. - It's great, there's, there's like, it's not even being like it's a year old. It's still amazing. - The iPhone 12 is a fairly small jump in performance as far as camera goes. Well, actually, it's a small jump across the board. - [Matt] Right. - I mean, the only thing I think you really lose going to the iPhone 11 is the screen. The screen is a little bit worse. But honestly, it's still totally fine. - I, like I never once looked at my screen and be like, \"Man, I wish this was higher resolution.\" It's still a really good screen. - So I actually have a little bit of a different opinion. - Sure. - I like the Mini. I think we both are definitely on team Mini. - Yeah. - I do think for a lot of people, this might be a touch too small. I think that for a lot of people, the standard iPhone 12 is probably the best overall choice. The iPhone 11, as you said, absolutely a great phone. It's got a great price now. Like that phone, I think anyone would be happy with. But going spending just a little bit more to go up to that standard iPhone 12, means that you have all of the benefits of getting this latest iPhone with the camera and the screen and everything. But importantly, you also have a little bit more battery life and the screen size, which I'll be real, I think is probably best for most people. I actually do think the 12 is kinda like that sweet spot. - [Matt] Yeah. - But we're weirdos who likes small phones. - And I'm actually okay with this not being a major generation leap. Because for the first time I think in, I don't know how long, we have an iPhone at every price point, like every $100 price point. from like $400, onwards. - [Jess] To like what 14 or $1,500, where this thing tops out at? - Literally whatever you are looking for in a price point, there's an iPhone for you. - $100. - I mean, you could find $100 like iPhone 6Ses. - Yeah. - Yeah, fair. - People can no longer be like, \"I can't afford an iPhone.\" - Yeah. - This is like, there's now iPhones that are cheaper than most Android, even budget phones. - So I'm curious, What do you think about the iPhone 12 this year? Specifically, which phone would you go for? Do you think Matt and I are crazy for loving the Mini? Do you like the big chungus? Let us know in the comments below, make sure to subscribe. Until next time, you will have to wait until Matt's shiny head reappears.",
    "transcript_keywords": [
        "Pro Max",
        "iPhone",
        "Mini",
        "Pro",
        "phone",
        "Max",
        "Pro Max versus",
        "big",
        "iPhone Mini",
        "Pro Max feature",
        "iPhone Max versus",
        "camera",
        "people",
        "Pro Mini",
        "bit",
        "Max versus",
        "big phone",
        "Yeah",
        "iPhone Max",
        "smaller"
    ],
    "transcript_entity_values": [
        "11",
        "last year",
        "Today",
        "100 bucks",
        "like $400",
        "Android",
        "one",
        "Apple",
        "a year old",
        "iPhones",
        "2.5",
        "14",
        "Jimmy",
        "an extra year",
        "today",
        "the iPhone 11",
        "the XS Max",
        "iPhones",
        "Bureau",
        "Ram",
        "Mini",
        "Pro Max",
        "US",
        "60",
        "5",
        "Matt",
        "only sub six",
        "Hertz",
        "100%",
        "the United States",
        "two",
        "5S",
        "100",
        "50%",
        "Jimmy",
        "12",
        "ProRAW",
        "Jess",
        "this year",
        "400",
        "second",
        "iPhone Max",
        "30 bucks",
        "SE",
        "first",
        "iPhone",
        "Max",
        "almost like 20",
        "millimeter",
        "iPhone SE",
        "1,500",
        "iPhone Mini"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "EVENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG"
    ]
}