{
    "id": "_-WGvpgOEcI",
    "title": "TikTok is BANNED",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-04-07T16:15:41Z",
    "video_url": "https://www.youtube.com/watch?v=_-WGvpgOEcI",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 66075,
    "likes": 3300,
    "comments_count": 362,
    "description": "We'll have to find more clear TVs on Temu I'm Never Going Back:  Tech We DON'T Want to Come Back:  I bought Apples BIGGEST mistake:  The WORST Tech at Hot Topic:  The WORST Phones:   Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:24 TikTok might get BANNED 1:04 TikTok is watching your PUPILS 2:04 That sounds CREEPY 2:54 What is Project Texas? 3:58 Asking STUPID questions 4:48 The RESTRICT Act 5:52 A bad precedent 6:51 VPNs might also be banned 7:52 This wont protect you 8:58 It will get SCARIER 9:57 Its not just China 10:49 American companies track you too 11:50 Whats the potential? 12:55 Good intention, bad bill 13:45 What do you think?",
    "description_links": [
        "https://youtu.be/1gOgsgd3xP8",
        "https://youtu.be/KMdQkz5ID_E",
        "https://youtu.be/x3pmg6Hj6cc",
        "https://youtu.be/2-a6AUnrpVw",
        "https://youtu.be/Cz4L09CUoSE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to \"This Is\". Your Dance App Is About To Be Gone. - Are they getting rid of Musical.ly? - Vine's not coming back. - What? What are we gonna do, Matt? Are we gonna have to use Instagram stories? I mean, Reels? - Where did Instagram stories even get their content from? - That's a good point. - Because, usually, Instagram is just TikTok- - Right. - stuff from two weeks ago. - Yeah, yeah yeah. - But you may have seen in the news that there's been a lot going on about TikTok being potentially banned by the US government. - I feel great- - It's- - about our elected officials. - Yeah. - And their deep well of knowledge about how technology works. - It's so great that they just know exactly how the Wi-Fi works. - I'm just glad that 80-year-old white dudes are really very tuned in with exactly how all of our various bits of technology work. - Here's where I got depressed after watching some of the TikTok hearings. I like to pride myself as a humorous person. You know, I like to write comedy, and I don't think I will ever write something that will be as funny as the absolute (grunts) show that has been the TikTok hearings. - Should we take a look- - But... - at a couple of these? - Yeah. Let me see. - Let's get some highlights in case you missed them. (screen whooshes) - Can you say, with 100% certainty, that TikTok does not use the phone's camera, to determine whether the content that elicits a pupil dilation should be amplified by the algorithm? (Austin laughs) Can you tell me that? (screen whooshes) - How many buzz words can you shove in... - Wait, do we use the camera to determine the pupil dilation for the algorithm? No, they just see how long you swipe on it, idiot. God- - This is- - I haven't seen that one. That's so bad. - This is one of my favorite ones, though. (screen whooshes) - No, the only face data that you'll get, that we collect, is when you use the filters to have sunglasses on your face. We need to know where your eyes are. - Why do you need to know where the eyes are if you're not seeing if they're dilated? (Austin laughs) (screen whooshes) - If I'm using a sunglass filter, why the hell do you need to know where my eyes is? - If you track my dilation of the pupils, sir, you will be highly escorted outta this country. What the (grunts) was that? - Look... - Let's watch a couple more. Boy, sit down, buckle up, grab your popcorn. We're going deep today. (screen whooshes) - We rely on age gating, as our key age assurance. - Age? - Gating, which is when you ask the user what age they are. We have also developed some tools where we look at the public profile to go through the videos that they post to see whether- - [Mr. Carter] Well, that's creepy. Tell me more about that. - It's public. So if you post the video that you choose that video to go public, that's how you get people to see your video. (Austin chuckles) We look at those to see if it matches up the age that you talked about. - Ugh. - The complete lack of understanding of how technology works. (screen whooshes) - So, Mr. Chew, if the CCP tells ByteDance to turn over all data that TikTok has collected inside the US, even within Project Texas, do they have to do so- - Project Texas. - according to Chinese law? - Congressman, first, I'm Singaporean. (Austin laughs) - It's fine. But there are employees of yours- (screen whooshes) - Theoretically, from my understanding, the data is actually, like, held on, like, US servers. - They have a headquarters in Los Angeles. - [Announcer] Project Texas was a restructuring effort within TikTok, such that corporately, their US user data would be stored by Oracle based in Austin, Texas. - This video could get very off the rails really quickly if you start going down some of the rabbit holes, right? I don't wanna make it seem like we're just making fun of this, because I do think there are some legitimate concerns about not only TikTok, but I think if you're bringing up some of the stuff, you also have to loop in a wide variety of other social media platforms, YouTube included. And mind you, I do understand some of the concern here that TikTok and ByteDance are owned by a Chinese company, and that's a little sketchy, especially when you consider exactly how the Chinese internet is censored. Yeah, censored is the great word. So I get it. I don't wanna make this just seem like we're just completely making fun. This is like asking a bunch of idiots how to make a better rocket. It seems clear to me that there is a very low level of understanding of any of this. I'm sure there are members of Congress who are very well informed on these matters, and know how to ask accurate and representative questions. The problem is, is that when you've got someone who's up there yelling and screaming about the Wi-Fi, that's when it's gonna get all of the headlines, that's what everyone's gonna hear. And you know, there's a certain contingent of people who might be like, \"Yeah, get 'em. Rawr.\" It's like, \"No, you don't understand this at all.\" And I think the thing that really concerns me, is not so much this, which just feels like it was just a giant show to kind of make an example out of TikTok. But I think some of the stuff that could potentially come from this with regards to the restrictions and how to \"ban TikTok,\" and half of the open internet along with it. - Let's face it, banning TikTok is not the real story here. It is the bill that goes with banning TikTok which is- - Excuse me. (clears throat) - that restrict that. - It's the 118th Congress Bill 686, which is, and I'm going to quote you here, \"Restricting the Emergence of Security Threats that Risk Information and Communications Technology Act. Boy, I'm glad that's a short title. (laughs) - Okay. - \"Don't take my guns. Don't take any of my other things. Protect me from TikTok, please.\" - Yeah. - \"I need to be protected.\" - Like, I'm not gonna mince words. This bill might be one of the dumbest (grunts) things I've ever seen in my life. This bill is essentially net neutrality. It's Cocaine Bear of net neutrality. (bear growling) Okay? - Great way to describe it. - Look, essentially what this does, is it restricts access to apps, servers, websites, whatever you want from combatant nations. - Foreign adversaries. Okay. - Foreign adversaries. - This would include the People's Republic of China including Hong Kong, Cuba, Iran, North Korea, Russia, and Venezuela. Essentially what this would give, is the Secretary of Commerce, the ability to ban apps, website services. That's one of, actually, the biggest problems that I personally have with this. It's not like, \"Oh, this bans TikTok,\" which would be bad enough as is in my opinion. They would be able to ban, basically, any kind of tech-based product, website, app, service, whatever from any of the countries on this entity's list. At face value, you can understand why a bunch of old people, who maybe don't understand this very well, when we think, \"Great we'll keep that kids safe, we'll score some points with our constituents, and we'll ban TikTok and all the other things.\" But the problem is, once you start thinking about this, right, like there are many, many times throughout history, where good intentions can lead to very bad outcomes. I would almost say- - Most the time. - most of the time. - Most of the time. 'Cause it's not just a TikTok app, but like, when we talk about like, oh commerce or website. Off the top of my head, I could think of wish.com- - Yep. - Temu- - Yep. - Ali Express. - Yep. - Pretty much most things that you order from China. The way this would work, is this act passes, theoretically, then at that point, the executive branch, going through the Commerce Department can say, \"Hey, you know what? We don't like X company.\" So let's say it's Temu. \"Ah, they're collecting too much pupil dilation data from the users. They're now banned.\" So, at that point, Temu would be immediately kicked off of the App Store. But almost worse than that in a lot of ways, say, Matt, you still wanna use Temu, say, you still want to access it using one of these newfangled digital devices, say, you try to get around it, say, you try to use a virtual private network. - The penalty for trying to circumvent this ban is where this goes from absurd to absolutely ludicrous. - Let me read you this very, very eloquently-worded text. \"It would be unlawful for any person to violate any order or mitigation measure issued under the RESTRICT Act, with civil penalties up to $250,000 in criminal penalties, up to $1 million and 20 years imprisonment.\" - I have a shocking comparison to this. - Hit me. - Do you know what the sentence is for manslaughter? - Is it less than $1 million? - The slaughtering of man, (object clangs) is 11 years in prison. - Is it... (laughs) If I accidentally slaughter a man... - Don't say that, please. Don't say that. That's enough. That's enough. - I will go to jail for less time than if I buy a 99-cent ring from Temu. - Or you use a VPN to access TikTok. - Yeah. It's absurd that... like, the penalties of it. Because in order to \"protect you,\"- - Yeah. - They really- - Restrict you, actually. (Austin laughs) - Hence the quotation marks. You know, they're so worried about, like, in these hearings they're talking about how censored the Chinese internet is, and really, this is what the US governments basically... Like, the way we wanna avoid this is by doing the exact thing that we're claiming we're afraid of. - It's tit for tat. - Yeah. - It really is tit for tat. Right? The internet, since it's inception, has very much been founded on the idea that it is open and free for all. Now, obviously, that's not broadly speaking true. There are obviously lots of little sort of changes, and like, not everything is always like that. But the thing is, generally speaking, I can go on a website from pretty much any country, it doesn't matter, 'cause I'm on the internet. It just all... It's one thing. But we see this sort of gradual, sort of clawing back of power from a variety of governments that will sort of firewall things off, will block, will ban things. And if this were to pass, it would allow the US government to easily go right into that. Mind you, we're talking more like worst case, right? - We are, but- - More likely, if this passed, they would probably start to try to shut down TikTok or something. Like, that's the clear thing. But once this law is on the books, all it takes, maybe five, 10 years from now, a certain president of any kind decides, \"You know what? I don't like Temu or literally- - This is where- - any of these things.\" - it gets scarier. - Bam! - Because the decision, according to this bill, is from the Secretary of Commerce. - Which is under the executive branch, AKA, the president- - It is not- - tell them what to do, - an elective position. It's appointed by elective officials, but the position itself is not elected. So it has a whim of- - Yes. - The president. Whoever president- - Right. - is at the time. - Look, I'm gonna get a little conspiracy theory this time with you. - Please. - because this is just kinda how I am with it. Right now, like they've clearly said, these are the foreign adversaries list. But I don't like... - The pupil dilators. (laughs) - I'm gonna go back to 2001, and this is somewhat rhetoric, but like when France chose not to support the US in going to war in Afghanistan, a lot of US officials bonded together and said, \"We're no longer calling French fries, French fries, because France is no longer an ally.\" They've decided to call them freedom fries. And this is ludicrously stupid. But all it takes is, if you have a bill like this on the books, some guy's gonna start saying, \"Well maybe if something like this happens again, oh, I wanna use this bill to ban-\" - Whatever. - \"apps or whatever.\" In whatever country, we're not liking it at this point in time. That's messed up. And that's a really big potential problem for not just the US, but for the entire world because of how world economies work. - Once you start banning one thing, then it gives another country the incentive to ban your thing. - It's just how you have- - It spirals very quickly. - Yeah, you have competing sanctions- - Exactly. - and then suddenly, no country's able to trade with any other country. It promotes this massive amount of xenophobia. - That's actually the thing that these hearings really bothered me with. It's like, \"Whoa, evil TikTok.\" It's like, I understand there are some valid concerns about TikTok. I don't wanna just throw them all out, right? - No. - But in my opinion, what TikTok are doing is probably a little bit less invasive than what, say, Facebook or Google are doing. The amount of tracking in data and pupil dilation that is being tracked among these various different sites, it's enormous. - And the only reason that TikTok is getting singled out is because they're in China. - 100%. - Their parent company is in China. - Yes, ByteDance is a Chinese-owned company. - Yes. Yes. - Facebook tracks basically everything you do everywhere. Right? - Google has tracked every purchase that you've ever made through one of their ads. Where this is a problem, is how much of a slippery slope this becomes. - Yes. - Of what precedence it sets, what problems this could be in the future. There's obviously the ridiculous levels of penalties. These are worst case scenarios, but still- - But it's on the books, you never know. - what this bill allows is, if they suspect that you are participating in foreign adversary expertise- - TikTok use. - I don't know. - Let's just say TikTok use. - Sure. They can access your computer. - Well, 'cause you're a criminal at that point. - Right, so they- - Go straight to jail. Do not collect $200. - They legally can take control of the contents of your computer. They could even legally take your physical computer- - And put you in jail- - because it will be... - for 20 years. - Yeah, it would be evidence that you're, you know, doing wrongdoing? There is no privacy when that's a reality of it. - These things are challenging to talk about because what Matt is saying is 100% a potential. There is a scenario, in which something like this does pass and it ends up being hardly ever used and it's not a big deal. But there's, I think, in my opinion, just as big of a potential for something like this to pass. Maybe a few years go by, then a president of, whoever knows in a few years, whoever's running the country, decides, \"Oh, you know what? I don't like this or that,\" or, \"We need to expand this to this country or that.\" It like sets a dangerous president. At that point, it's very difficult to wind these things back. - As long as the people in control of that don't know that you have to use Wi-Fi to access an app... - Exactly. - Like, we say, it's only potential right now. But the complete lack of understanding how any of the infrastructure works, to the most basic of levels, is what pushes that potential more towards nefarious. - I don't wanna just say that all of these Congress people are dumb, because clearly they're not all dumb. A lot of them are probably just saying some things to try to score some points for their next, you know, ad or whatever. But once these things start to unfold, I think it just becomes incredibly dangerous for the internet and for people as a whole. Look, do you trust every member of every government from here to the end of time to not take advantage of something which could be a little bit nefariously used? Hell no. This is dumb. I think that there is probably some good intention behind this. I think that a lot of these Congress people are legitimately concerned. And again, that's their job. They should be concerned about some things. I think the method that they're trying to push through to \"fix\" these concerns, this is like using a sledgehammer on a nail. It is so ridiculously overkill, and could easily, not only hit the nail, but destroy the whole damn foundation around it. I'm not great with metaphors, but guess what? At least I know that TikTok uses the home Wi-Fi, and that my pupil dilation data is safe and sound at Google headquarters. - If you were ever going to call a congressman, this is the moment to do it. (hand thuds) I'm not a political person, but this right here affects everyone. - Mostly people in the US. 'Cause you can't call congressmen if you're not a US citizen, but anyway... - Unless you're using a VPN, at which point... - Then you're going directly to jail. (laughs) Right to jail. Right to jail. Let us know what you think about this stupid, stupid, stupid ban, this bill. Like, follow, subscribe, and we'll catch you in the next one. - Or we won't, because we'll all be in jail. - Yeah, because we shop on Temu too much. - Oh my God. I'm actually going to jail. Aren't I? - Yeah. (gentle music)",
    "transcript_keywords": [
        "TikTok",
        "Yeah",
        "things",
        "thing",
        "Temu",
        "bill",
        "ban",
        "people",
        "time",
        "jail",
        "country",
        "point",
        "Project Texas",
        "ban TikTok",
        "data",
        "pupil dilation",
        "great",
        "App",
        "pupil",
        "dilation"
    ],
    "transcript_entity_values": [
        "Los Angeles",
        "80-year-old",
        "France",
        "up to $250,000",
        "one",
        "less than $1 million",
        "Rawr",
        "five, 10 years from now",
        "the RESTRICT Act",
        "Oracle",
        "2001",
        "today",
        "Cuba",
        "Google",
        "the App Store",
        "Chew",
        "US",
        "Venezuela",
        "686",
        "up to $1 million",
        "a few years",
        "Matt",
        "Cocaine Bear",
        "North Korea",
        "Austin",
        "Afghanistan",
        "Reels",
        "two weeks ago",
        "100%",
        "Congress",
        "Restricting the Emergence of Security Threats that Risk Information and Communications Technology Act",
        "Austin",
        "half",
        "Russia",
        "Ali Express",
        "the Commerce Department",
        "Wi-Fi",
        "Carter",
        "Temu",
        "French",
        "Facebook",
        "Singaporean",
        "20 years",
        "Commerce",
        "ByteDance",
        "Iran",
        "the Wi-Fi",
        "11 years",
        "China",
        "200",
        "TikTok",
        "Texas",
        "the People's Republic of China",
        "Hong Kong",
        "VPN",
        "YouTube",
        "first",
        "Wi-Fi",
        "Instagram",
        "CCP",
        "Vine",
        "Project Texas",
        "Temu",
        "99-cent",
        "Chinese",
        "the Wi-Fi"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "GPE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "LAW",
        "ORG",
        "DATE",
        "DATE",
        "GPE",
        "ORG",
        "FAC",
        "PERSON",
        "GPE",
        "GPE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "GPE",
        "GPE",
        "GPE",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "NORP",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "GPE",
        "MONEY",
        "ORG",
        "GPE",
        "GPE",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "NORP",
        "FAC"
    ]
}