{
    "id": "_2oyfL9OwTw",
    "title": "Ripoff iPhone 12 Clone (with Fake Specs) - Krazy Ken’s Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-08-25T15:59:20Z",
    "video_url": "https://www.youtube.com/watch?v=_2oyfL9OwTw",
    "category": "Science & Technology",
    "tags": [
        "Ripoff iPhone 12 Clone (with Fake Specs) - Krazy Ken’s Tech Misadventures",
        "iPhone Clone",
        "Knock-off iPhone",
        "Apple",
        "iPhone",
        "iPhone 14",
        "iOS",
        "iPhone 12",
        "iPhone 12 Pro",
        "Android",
        "Android 6.0 Marshmallow",
        "Google",
        "SMOOREZ",
        "Scam",
        "Fake",
        "Hoax",
        "Alibaba",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Tech",
        "Smartphone",
        "Computer Clan"
    ],
    "views": 238567,
    "likes": 8275,
    "comments_count": 534,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Why buy a brand-new iPhone 14 when you can just get a $100 clone! With 24 million cameras and 16 GB of RAM, it's bound to be a good purchase, right?   Fake SSDs   I bought a $1,300 computer made for seniors   Get Ian's wallpapers   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Did you like the wallpaper on the iMac in the background? There's a whole pack designed by Ian Zelbo (RendersbyIan)   (affiliate link)  Download Computer Clan wallpapers    Batteries for vintage Macs   Battery tester   Multimeter    Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/_Yr6CaKstZw",
        "https://youtu.be/1TtXknHoeL4",
        "https://gumroad.com/a/209727315/vaxwm",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://gumroad.com/a/209727315/vaxwm",
        "https://thecomputerclan.com/wallpapers",
        "https://amzn.to/3oSNlka",
        "https://amzn.to/3vAJJXW",
        "https://amzn.to/3JyGEgL",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Rumors are reporting that the iPhone 14 pro's price is increasing. Why pay that money when you can just get a cheap clone? I mean it's basically the same thing right? With 12 gigs of Ram and 512 gigabytes of storage, you can't go wrong. Sponsored by Linode. (upbeat music) Hey everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken and I just bought this new iPhone. I mean it looks like an iPhone, smells like an iPhone, so it must be an iPhone right? Wrong. It's actually a Global Version Unlocked Big Screen Quad Camera Cellphone Smartphone i12 Pro Max mobile phone. It's kind of a long name. So we'll just call it the iPhony. Yeah, I bought it almost two years ago on Alibaba for like a hundred bucks and I haven't done anything with it so it's just been a good paperweight lately. But I love knockoff stuff. So I'd love to venture into other clone tech and cheap knockoffs of iPhones and things like that. So this should be interesting. So let's take a look at this thing and see if the Quad Camera spec is true 'cause if it is, that's something the real iPhone can't even do. So that's pretty amazing. Oh wait it's not a Quad Camera, it actually has 24 million cameras, my mistake. So visually it does look very iPhone-ish. If we take my real iPhone 12 Pro, which this is the i12 Pro, so I'm guessing it's supposed to look like an iPhone 12 Pro. If we put them side by side, you'll see there are some similarities with the rounded corners, the camera layout except of course this has four instead of three, and even the sides like the edges are similar with how they're straight and the antenna bands are in there, and also ignore the shattered back on my iPhone 12 Pro. This thing has a mind of its own. It found out I was cheating on it with this cheap Android phone and it self-destructed. We can see they even mimicked where the controls are located the mute switch, volume up and down, and even on the bottom, the holes are very similar. There's a few more holes on the iPhony, and even the port looks the same as well. And that is a lightning port. For some reason, I was thinking it might be USBC, but it actually is a lightning port. And on top we'll be able to see this more once I boot this up. They even copied the notch but they copied the notch very poorly. It's kinda sloppy. So here's some other oddball things I noticed about this iPhony. It looks like it has a screen protector on it. Like usually phones don't ship with screen protector pre-installed but this one is on it, and it's kind of misaligned. Feeling wise, yes visually, with the shininess and everything, it kinda looks like the stainless steel sexiness of the iPhone 12 Pro, but it's a hundred bucks, so it feels cheaper, it's plastic, in fact when I was trying to open up the back which is glued on, I feel like I was barely applying any pressure and I already cracked part of it. So I'm gonna be careful there. And just from looking at this camera array, three cameras look different than the other one. This upper left one looks different than these other three. So I'm willing to bet these three are fake. We'll see. And we'll see if the front facing camera works too. For a hundred dollar phone, I doubt this thing has five real working cameras let alone 24 million. And don't worry we will test those at the end. I'll do a little camera test and take some selfies and we'll see the quality of these things. But now let's take a look at the iPhony's mobile home. i12 Pro Max is the name they give this thing, and there's some specs on here, which just spending a couple years in the scam busting realm makes me think they're lying on this box, but let's take a look. US I mean maybe I guess this could be a US phone possibly. Gold. Gold is probably accurate. That one I think they're telling the truth on this does have a bit of a gold look. I'll give you one point there. This one's interesting. They highlight 12 plus 512 gigabytes. So that is the RAM in the phone 12 gigabytes, and then the storage of the phone, 512 gigabytes. I'm willing to bet there's not 12 gigs of RAM and a half a terabyte of storage in here for a $100 phone. That would be hard to profit off of. And if you've seen my fake SSD episode, really good episode by the way, you'll understand a bit more of what I'm talking about. Oh there's stuff on the back. Face recognition, I highly doubt that. HD Super AMOLED Screen. I mean it could be HD, but I doubt it's AMOLED. We can tell later by seeing how black the blacks are. High digital camera. It's been smoking something. It's just a high digital camera. So what do you say? Should we fire this baby up and see, what's really running on the inside? Let's do it. All right so I busted out my patented phone holder 9,000 so we can actually enjoy this thing to its fullest potential, which isn't saying much. So let's boot it up. Ah, yes that beautiful welcome with the nice reflection there. Hey SMOOREZ you like what you see? Eh, yeah? You wanna do a little window shopping? Check out that animation. Hollywood quality. Swipe up to go to the home screen. So I did poke around a little bit just to make sure the phone works, to put my burner account on it as well, and to connect it to wifi. But for the most part, I haven't explored with the system very much. Initially I'm looking at the icons and I was thinking, it looks like an older version of Android, but when I went into the settings, I learned this is actually Android 10, but then I would- (phone dings repeatedly) Yo, forgot to turn on the silent switch. Stop, stop, stop. Okay. Well, I now have 10,000 notifications from you guys telling me it's not Android 10 and I appreciate the concern. Scammers can change what version this phone is reporting. Who knew? Let's take a look at what real version of Android this is running. First for fun we might as well look at the fake version. So right here model number i12 Pro Max, but Android version 10. Initially I thought it's running version 10, but then why does it look so old? So that's why I was wondering is there a different skin on this thing? It's not actually a skin with Android 10. What version of Android is it? So if we go into settings here, go to apps, and there's like five different ways you can do this. If we take a look at the little menu here, go to show system, and down here we can look at Android system as well. There's a couple different things we look at. If we just poke at Android system here, will see the version number is version 6.0. So that's right. It's running a system that's four years older than what it's advertising. Isn't that just great. And this is actually another way we can debunk this. Android version 10, but if we rapidly tap that, ooh, what have we here? A mysterious bat signal. Oh look it's a marshmallow. It's Marshmallow! Android 10 is not Marshmallow, Marshmallow is 6. Fantastic. Get me out of here. What do I do? Do I rapidly? Oh, it's a jumper game. Holy crap. The Computer Clan's old iPhone app had a jumper game in it like many years ago. Okay I suck at this. I'm not used to the physics of this thing. We're gonna try that again. Okay, I'm used to like the Flappy Bird physics, this thing jumps way harder than Mr. Flappy Flap. What the, I barely tapped the screen you (beep) I think I've made my point clear. This thing is running Marshmallow, not Android 10. Well if they're lying about that, I wonder what other things they're lying about. I'll take a look at that soon. But first I need to do something very important. What I like to do is I like to christen these systems by putting my own wallpaper on them. However, I'm gonna do something different this time. You know, Ian Zelbo, that awesome guy that makes those cool 3D models for front page tech and all that cool stuff, he recently released a new wallpaper pack and it's awesome. You can grab it with a link in my description. I'm gonna go to my little web server thing. Allow browser to take pictures and record video. No, I just wanna download my wallpaper. Deny. There's four? Deny. Allow browser to record no, deny. Access phone? I mean, I guess we'll need that and deny contacts. What? It just closed on me? What the heck is this? Oh my gosh. Is it seriously gonna make me hit a allow for everything? I don't really trust this cheap phone from China I really don't. But I have a burner account on it whatever. If you wanna spy on me, that's great. You're not gonna see very cool things. I live 10 stories underground by myself. Exciting. So I guess we're on the site navigation we have how one, two, three, Baidu. That one I'm familiar with. Oh, there's also about blank. I love that website. Now for real let's christen this thing let's go to the computer clan.com. There it is. Set as wallpaper. Wow! That actually looks really freaking cool. Nice job Ian. Your wallpaper is the best part about this piece of crap iPhony. I said they lied about the system software right? So let's take a look at what else they're lying about. This was recommended to me, device info HW hardware. This will actually tell us what is really running on the phone to the best of its abilities. As you can see it's not perfect. It still is reporting Android 10 there. Memory. Do we have 12 gigs in here? No, we have one gigabyte. You lying (beep) We have 1/12 of what's advertised. We have one gigabyte of RAM. Internal storage 12.2 gibibytes. So formatted, that's the formatted capacity but yeah it's really 16 gigabytes. 512 gigabytes of storage? No, you get 16 load BS. Fake OS, fake amount of RAM, fake storage, I bet those cameras are fake too. Oh, the system-on-a-chip what do you got? Oh, a MediaTek chip. Well I'm so surprised. Cores 10. So according to this app, it has 10 cores. So the Deca-Core thing on the box might actually be true. Let's poke around a little bit since we have this thing here. The notch does look a little sloppy, especially with the screen protector on it, but software wise it actually seems to be interacting with it okay. Now let's see what else could we test the notch with? YouTube? I mean so far that looks normal. You need to update. Well let's see. We can go to my burner account here. I am not signing in my real Google account on this phone. I do not trust it at all. So yeah, we'll just hit update and see if this works. Let's look up Computer Clan. Wow, this guy looks so cool. I'm gonna subscribe to him. YouTube survey. Awful, poor, average, good. Wait, what am I answering? Oh, please rate your oh gosh. But yeah it's playing. It's not dropping frames. I mean I'm actually kinda surprised it does acknowledge the notch pretty well, but yeah the blacks don't look that black. It is probably not AMOLED. The resolution does look higher, but it does not look like any kind of all OLED display. I'll test it out in the dark and yep as you can see here, a really dark screen on this iPhony, compared to a real iPhone. Looks more like dark gray, not dark black, so it is not AMOLED. So now camera test, I'm gonna take some selfies, shoot some photos, shoot some video, and we'll see what the quality of this thing really is. And we'll see if it has actually four cameras on the back, which I doubt. (soft music) All right so I spent some time with this thing and yes this camera is the only real one. I put my finger over the other cameras while zooming in and out to see if maybe it was switching to a different camera with a different focal length like what the iPhone does, put my finger over them, nothing ever happens. So this one is the only real one. And the front facing camera does work as well. So I took some video, took selfies, I took other still life photos in different levels of light, so let's go ahead and have a peek at them. I took a picture of this BattleBots piece and it actually had the flash on an automatic setting. So there was one with the flash on which I believe was that one. And then I turned the flash off and it did take a while to auto focus. The auto focus was very slow. So some stuff was really blurry but when it did work, I mean it's okay. I mean it's a decent-ish photo for like probably what? Seven plus year old hardware for only a hundred bucks but still it's definitely no iPhone. And let's go ahead and poke into the metadata here unless that's fake too. Details. So it is a 4,096 by 3,072 spatial resolution. That's just the size of the picture. That doesn't really mean quality though. Exposure time 1/17. That is a problem with this. The low light performance is not that good, so it's gonna keep the shutter open for longer which lets more light hit the sensor, which means that grainy noisiness can go down, but the trade off is any motion now will appear as a blurry mess. Yeah lowlight performance is not so good, and still it did have to crank the ISO to 900-ish. So there's that? Oh, hey look some selfies. The front facing camera I mean as you may expect 'cause it's even this way on regular phones, much lower quality than the rear facing camera but it does work overall. Taking pictures with the front and the back does take a while. I'm not sure if it's because of the focusing or what, but you press the button, it takes probably like an extra half a second or so for the shutter to actually fire. So not so good but we're working with a cheap knock-off here what do you expect? Yeah look at that guy. He's looking good. Why is his head so BIG?! Here's some more still life. What I did this time was I used some brighter lights to see how the picture quality would come out and it does look a little less fuzzy. i12 Pro that's amazing. I did some stuff outside just to see how it handles brighter lighting. Yeah it looks okay for a cheaper thing. You get some shallow depth-of-field in some areas too. It's not terrible. I mean it's not probably the most amazing thing but when you have enough light. The details actually aren't too bad. Okay, this was the real one. That PowerBook Fuo back there, I dimmed the lights to see how it handles the automatic exposure and dynamic range. So I balance the exposure for the darker subject the PowerBook and everything else blew out. Less dynamic range, that means you're gonna have things blowing out and clipping much more easily. All this details just gone. And then I balanced it for the light. Again less dynamic range means the darker subjects they're gonna be really dark but the brighter subjects are a little better now. So some video, ooh man where do we begin with this? The video is very bad. 720p even if you're recording at 30 FPS it's gonna look a little choppy 'cause it's trying to keep that shutter open for longer to get the light in there. As you may assume there's not gonna be any nice iPhone bells and whistles like the nice stabilization and all that stuff. You're not gonna get any of that in a product like this. So yeah the video is very bad quality. And on top of the low quality camera, just a reminder again, the other three don't even exist or is it the other 23,900,000-something? Well, I'll tell you what does exist, Linode exists. They're not fake like this phone is. But here's the cool thing. At the core of Android is a Linux kernel, and Linode is all about Linux. I say it all the time if it runs on Linux, it runs on Linode. If you have a website or app you need a scale or deploy, Linode has the infrastructure and the 24/7 support you need. Linode offers out of box apps for game servers like TF2, CS:GO and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla content management system. There's so much you can do with Linode's affordable Linux virtual machines. And to boot they offer award-winning 24/7 technical support. Visit linode.com/computerclan and click one of the signup buttons. And when you do that, we'll give you a $100 60-day credit, just for watching this episode. And also when you do that, you're supporting the Computer Clan, so thank you very much. You know, I wonder what the shutdown animation is 'cause we did not look at that yet. We'll do a power off. Yes your phone will shut down, I'm aware of that thank you. Square. Oh, bye bye. Yeah, buy a better phone. Well now we get to see that amazing welcome screen again. I would do anything to see that screen. Ugh, I just want to center it, it's off centered. (ANGRY GRUNTING!) So unless you want like a gag gift or something for your friends, I don't know why you would wanna get this. But really I just love looking at knockoff stuff. So if you have any other suggestions for some, send them my way and feel free to subscribe for more tech episodes coming out every week. I love making episodes about rare and retro tech, new tech and of course scam tech. And hey, if you'll like this episode, you know what to do. Thanks and I'll see you next time. Catch the crazy and pass it on. (upbeat music) Hello? Is my refrigerator running? No! I don't even have a refrigerator.",
    "transcript_keywords": [
        "Android",
        "thing",
        "Camera",
        "iPhone",
        "phone",
        "pro",
        "Pro Max",
        "Quad Camera",
        "Version",
        "Screen",
        "Yeah",
        "things",
        "Android version",
        "cameras",
        "real",
        "Linode",
        "Screen Quad Camera",
        "fake",
        "real iPhone",
        "cheap Android phone"
    ],
    "transcript_entity_values": [
        "Quad Camera",
        "Android",
        "two",
        "Baidu",
        "1/17",
        "SSD",
        "10,000",
        "YouTube",
        "14",
        "a hundred dollar",
        "a couple years",
        "four",
        "one",
        "only a hundred bucks",
        "Ian Zelbo",
        "Computer Clan",
        "Android 10",
        "Linux",
        "100",
        "12 gigabytes",
        "Pro Max",
        "60-day",
        "Ram",
        "Seven plus year old",
        "a hundred bucks",
        "16 gigabytes",
        "Google",
        "24 million",
        "Joomla",
        "12.2",
        "16",
        "Linux",
        "Linode",
        "The Computer Clan's",
        "three",
        "iPhones",
        "Marshmallow",
        "one gigabyte",
        "30 FPS",
        "Alibaba",
        "6.0",
        "24/7",
        "ISO",
        "PowerBook",
        "SMOOREZ",
        "TF2",
        "YouTube",
        "Krazy Ken",
        "512 gigabytes",
        "a half a terabyte",
        "10",
        "iPhone",
        "Minecraft",
        "iPhony",
        "the Computer Clan",
        "512 gigabytes",
        "4,096",
        "BattleBots",
        "Hollywood",
        "every week",
        "HD Super AMOLED Screen",
        "1/12",
        "MediaTek",
        "China",
        "almost two years ago",
        "the Deca-Core",
        "6",
        "3,072",
        "USBC",
        "12",
        "23,900,000",
        "US",
        "RAM",
        "9,000",
        "Ian",
        "Yo",
        "five",
        "four years",
        "Flappy Flap",
        "First",
        "signup",
        "second",
        "Linode"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT"
    ]
}