{
    "id": "_3_ibMon2nU",
    "title": "iPhone 15 Pro Review - It's not a phone anymore..",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-09-19T13:05:02Z",
    "video_url": "https://www.youtube.com/watch?v=_3_ibMon2nU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 1054911,
    "likes": 27440,
    "comments_count": 1545,
    "description": "New iPhone 15 Pro is here and it's more than just a phone..  PINK USB-C CABLES:  Watch iPhone 15 Review here:   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "http://pinkijustinecables.com",
        "https://youtu.be/9plKXNvAQwU",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- Here it is, the brand new iPhone 15 Pro and Pro Max. (bright music) While everyone likes to joke that it's the same phone as last year, you'd be wrong. Especially for photographers and videographers, it is so hard to even call this a phone. With the introduction of USB-C for fast data transfer, the new 5X Telephoto and ProRes Log, it just so happens that my camera can make phone calls. (upbeat music) The camera of course is where the new iPhone 15 Pro shines but also this new titanium finish that comes in natural, black, white, and blue titanium. I've got the new natural color right here and also the blue and they are just so stunning like the way that they reflect the light, so beautiful. The thing that is also really surprising is how light they are compared to the previous version. It's only a slight weight difference, but with these new rounded edges, it has an all new feel to it. Now if you have an Apple Watch Ultra, this new natural titanium is a perfect match. Another huge design change is it now finally has USB-C. The Pro models will support up to USB-C speeds that are 20 times faster than the regular iPhone 15. This is because of the all new A17 Pro chip for enhanced performance. So they've now made an action button on the iPhone 15 Pros. This used to be where the silent switch was but now you can actually customize this button to do basically whatever you want. You can still have it silence your iPhone if you choose to, but you can select from focus modes, camera options, flashlights, voice memo, magnifier. You can create custom shortcuts, accessibility, or you can have it do nothing, which is kind of pointless. I don't know why you would even select that. I have mine set up to access the camera since that's pretty much what I use my phone for. You can even use the action button as a shutter button. The display has slightly thinner borders. Dynamic Island is back and ProMotion on the Pros give you a super smooth animation. You can choose from the 6.1 inch or the 6.7 inch sizes, but the Max version is the only camera that has the 5X zoom. Now speaking of 5X zoom, this new tech in the Telephoto is called Tetraprism and this uses a series of mirrors to reflect and magnify to keep the camera lens much smaller. That's one of the things that we always joke about. Each year, the camera bumps get larger and larger. So using this Tetraprism, this allows for you to keep the camera bumps much smaller and they don't have to be increased in size but yet we still get that 5X magnification. (upbeat music) So here on Catalina, there's this old casino and it's now turned into a museum and a dive shop and we're up here on the hill and I'm gonna show you guys a little demo of the zoom that we have on the new 15 Pro Max only. It'll go up to 5X, but the main camera now also can act as three lenses, a 24, a 28, and a 35 millimeter. So when you click through on the 1X, you'll be able to see those change just like this. My favorite demo though is going from the wide angle all the way into the 5X. This really shows you the perspective that you're able to get. This is equivalent to 120 millimeter focal length, pretty far out dude. I took the new phones to Catalina to test them out diving. (soft music) (upbeat music) They are water and dust resistant up to six meters for 30 minutes. But I use this new Oceanic+ housing which will let you turn your phone into a dive computer and also capture videos and photos up to 196 feet. Now I have a full review on this housing in another video, but it is so incredible. Now most of this video footage that you're seeing here I shot in 4K 60 because this lets me slow down the footage and post if I see a fast fishy or if I'm floating around too fast in a current. Oceanic+ is the same app that was launched last year with the Apple Watch Ultra to let you turn your Apple Watch into a dive computer. So it is so cool that you can now do this with your iPhone. (soft music) I love testing out taking photos and videos all around Catalina. My favorite thing we shot though was this Wes Anderson's To Health TikTok meme video using the ProRes Log. And I'm so happy with how it turned out. Behind the scenes of our Wes Anderson TikTok vertical content. (soft music) (soft music) (soft music) (food crunches) (golf cart starts) (soft music) (soft music) Shooting in Log is really cool because it gives you so much more flexibility in editing with color and it also can save some highlights if it's a super bright day. So let's test them out and see what we got. (upbeat music) I also didn't realize that you can shoot in ProRes on the front facing camera. So right now, shooting ProRes, front facing camera. Now the thing with ProRes though is it is going to increase your file sizes, which is one of the reasons why this feature is specifically on the Pros. Now if I want to shoot in 4K 60, this is where a little notification pops up and it says ProRes not supported, but it will be supported when recording to external storage. Now I'm gonna try recording externally to this little OWC drive, this is one terabyte. So we're gonna switch this into the ProRes Log and to 60 frames a second, plug it in, and it's time to record. (upbeat music) I was also super impressed with how well it shot videos at night. Here's the demo of a shot that was shot in Log and here is one that's just regular and you can kind of see here in the lights, how it's saved a little more detail and it's less blown out around the lights. Night Mode also got a little boost as well. So here's a few photos that I took handheld on the 15. You can see all of the detail here, especially in the 5X zoom, it's pretty impressive. This is a difficult shot 'cause there's like a lot of light. There's also not a lot of light. (warm music) (warm music) So testing out the new iPhone 15 Pro camera system because it is newer and it is the latest and the greatest. It's the best iPhone that Apple has ever made. I like to kind of test them out in comparison to the previous version. Let's see if we can tell the difference. (upbeat music) (upbeat music) We're gonna get ice cream. This is how you properly do an iPhone review. (upbeat music) There's a few new pro options now that you can quickly access here in the top menu. Now you do need to first turn these on in the settings. Now when you're in the camera, you can press to hold and quickly switch between the options as needed. I shot most of my photos just in normal mode and in RAW max. The HEIF mode will give you a higher resolution image at a much smaller file size, But since I have the one terabyte phone, I just shot in the Pro Max resolution for most of my photos when I wasn't shooting in the normal. It's golf cart time, this is my favorite part about Catalina is running a golf cart and going and exploring the island. (upbeat music) Now Action Mode isn't something new but it's still so impressive. You can also see in this demo here that we're on a super bouncy golf cart and it's able to really stabilize that footage so much better and it made it super smooth. These were also shot in Log, so here's what it looks like before the color and here's what it looks like after. I'm not gonna lie, I don't really shoot that much in Cinematic Mode normally, but when I do, I'm always so impressed with how great it looks. So now Cinematic Mode supports digital zoom from 1X to 3X, so you can tap one or two and then you can use the scroll wheel to go all the way up to three. Now in regular video you can do this as well but all the way up to 15. Something else I noticed is how smooth the zoom is. So when you're using the scroll wheel, you can really fine tune your zoom and get as close or as far away from your subject as you like. (warm music) I love being able to go in and edit in Cinematic Mode. So when you're in here, as you tap on something on the screen as you're playing the video, it'll change the focus from whichever point of interest that you want it to focus on. So as you'll see here, I've tapped on my face and then I've tapped back here on the background and now it's focusing not on me, it's focusing more in the background. And as you continue through on this timeline, this gives you the ability to reshoot what you already shot. It's also great because if you do bring a cinematic clip into Final Cut, you can do the same action and change the focal point there as well. (warm music) Obviously for me, testing out photos and video is my favorite thing, but a few of the other updates is the new wireless tech. With the new second gen Ultra Wideband chip, this enables precision finding for friends. Now, this is of course only if your friend wants to be found but when you turn this on, it'll give you precise turn by turn directions of getting to your friend, much like when you're trying to find your AirPods. So I love gaming and they are really turning this phone into a console level gaming device. With the new A7 pro chip, this is giving performance improvements for games like mesh shading and hardware accelerated ray tracing. I also really like that I can charge my AirPods or Apple Watch using the charge port and since it's USB-C, this is a great time to pick yourself up a nice pink iJustine USB-C cable to go with it, pinkijustinecables.com, shameless plug. Roadside assistance has also been added to the satellite emergency offering using AAA, which I actually have AAA, so hyped about that. This is pretty great if you get a flat tire or you break down and you need help, I've definitely been there. So it is nice to know that you can use the satellite for more than just a super emergency situation. So all in all, I have been loving the new phone and of course if you do already have an iPhone 14 Pro device, this isn't gonna be like some huge, massive overhaul physically, but if you are super into video, the new zoom and the ability to shoot in Log is so awesome. I love the new titanium finish and how light it is. It just feels so nice in your hand. It's fast, with all of the added iOS 17 features, it definitely does feel like a really great upgrade. I have a bunch of other Apple videos here if you wanna check them out after this. Thank you guys for watching and let me know what your favorite color iPhone is this season.",
    "transcript_keywords": [
        "Pro",
        "Pro Max",
        "camera",
        "Apple Watch Ultra",
        "Apple Watch",
        "iPhone",
        "Log",
        "shot",
        "Mode",
        "ProRes Log",
        "Cinematic Mode",
        "USBC",
        "phone",
        "Apple",
        "zoom",
        "video",
        "Pro camera",
        "Pros",
        "Pro Max resolution",
        "Max"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "1X to",
        "the Apple Watch Ultra",
        "Pro Max",
        "30 minutes",
        "AirPods",
        "second",
        "Catalina",
        "this season",
        "one",
        "USB-C",
        "Pros",
        "Telephoto",
        "24",
        "17",
        "Apple",
        "14",
        "Apple Watch Ultra",
        "Cinematic Mode",
        "OWC",
        "iPhone",
        "20",
        "Dynamic Island",
        "4",
        "three",
        "Tetraprism",
        "up to",
        "ProRes Log",
        "Cinematic Mode",
        "last year",
        "6.1 inch",
        "Oceanic+",
        "A17 Pro",
        "Wes Anderson's",
        "Oceanic+",
        "Wes Anderson TikTok",
        "Telephoto",
        "Health TikTok",
        "a 35 millimeter",
        "the ProRes Log",
        "six meters",
        "196 feet",
        "Ultra Wideband",
        "night",
        "3X",
        "one terabyte",
        "5X",
        "28",
        "6.7 inch",
        "two",
        "ProMotion",
        "60",
        "A7",
        "Cinematic Mode",
        "Final Cut",
        "first",
        "ProRes",
        "Log",
        "Apple Watch",
        "120 millimeter",
        "Max",
        "AAA",
        "15"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "NORP",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}