{
    "id": "_5RAn0w3SmM",
    "title": "Galaxy Watch 3 Review: Ticking (Most Of) The Right Boxes",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-08-15T22:30:47Z",
    "video_url": "https://www.youtube.com/watch?v=_5RAn0w3SmM",
    "category": "Science & Technology",
    "tags": [
        "best smartwatch 2020",
        "galaxy watch review 2020",
        "galaxy watch review",
        "samsung watch 3",
        "samsung watch review 2020",
        "smartwatch 2020"
    ],
    "views": 495766,
    "likes": 16687,
    "comments_count": 989,
    "description": "Sponsored by Surfshark. Get Surfshark VPN at   Enter promo code MRMOBILE for 85% off and 3 FREE additional months!   [SAMSUNG GALAXY WATCH 3 REVIEW]  A bigger display inside a smaller casing; a resurrected physical spinning bezel; and more responsive and consistent software than you'll find anywhere outside the Apple Watch. The Galaxy Watch 3 is one of the best smartwatches of 2020, and its everything Samsungs premier wearable should be  with two rather significant exceptions. Join Michael Fisher for MrMobiles Samsung Galaxy Watch 3 Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SAMSUNG GALAXY WATCH 3 REVIEW]  MrMobile's Samsung Galaxy Watch 3 Review was produced following ten days with a Samsung Galaxy Watch 3 review sample (45mm, WiFi/Bluetooth, model SM-R840). The device was tested with a Galaxy Note 20 Ultra review sample, also provided by Samsung. Production sample running consumer software. The lone sponsor of this video is Surfshark; neither Samsung nor any other company paid a fee or otherwise offered compensation in exchange for this coverage.  Several watchfaces shown on the Galaxy Watch 3 review sample in this video came courtesy of the Facer app. Special thanks to Facer for providing a free subscription to Facer Premium in order to experience this collection.   [PRODUCTS IN THIS VIDEO]  Samsung Galaxy Watch 3 (45mm) [Amazon affiliate link]:    [LINKS] Samsung Galaxy Watch 3 Review [Android Central]:   Facer: The Largest Watchface Platform In The World [Facer.io]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #galaxywatch3 #galaxywatch #samsung #smartwatch #samsunggalaxywatch",
    "description_links": [
        "https://surfshark.deals/mrmobile",
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1Sz",
        "https://www.androidcentral.com/samsung-galaxy-watch-3-review",
        "http://mrmobile.tech/1SA",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(cool music beats) - (Michael)This video is sponsored by surfshark VPN. (cool music beats) This is a very special bottle of wine. And oddly its story is Samsung specific. I'm really looking forward to telling it on a review of a product that breaks the mold in some way. (cool beats) The Galaxy watch3, is not that product. Not because it's not good, but because, it's a successful sequel with very few surprises. (upbeat music) The Galaxy watch3, is actually the second wearable to carry the Galaxy watch brand name. It comes into clearer focus if you remember 2016's Gear S3 though, which was the first to combine the circular design and rotating bezel of the prior year's Gear S2, with the hardier build and chunkier industrial design, that would eventually peak with 2018's Galaxy watch. With the Galaxy Watch3 , Samsung has maintained the same design language, while pulling off a familiar fit, in consumer tech sequels, that the display is larger than its fore runners, while the casing is thinner, narrower, and lighter. Shall we're talking millimeters and grams here, but on a product that lives on your wrist, every little bit helps. The old flat side keys have been replaced by proper pushers, one of which is customizable, while the other now carries this fun little branding accent. And while it tool has been minimized, I'm very happy to see Samsung retain the physical rotating bezel on its flagship wearable. It was cleverly virtualized on the company's watch active two, but I for one I'm tired of touchscreens taking over all our tech. Nothing beats the tactile satisfaction of spinning this disc to speed through Settings, Scroll through SMS, or set your stopwatch. Speaking of the stopwatch I'm happy to see that Samsung now includes that and the countdown timer has pre loaded apps which wasn't the case on the last Galaxy watch. On the whole Samsung's Tizen software continues to feel more consistent than my last few Wear OS watches. If you have notifications waiting an orange badge hovers over the nine o'clock position, and you can either swipe over on the touchscreen or click the bezel to see what messages have come over from your phone. If you need to respond from your wrist as Wear OS, you have the option of either dictating a message with your voice or Samsung goes an extra step and gives you the option of using T9 to do it as well. This is a much smarter use of space on such a small screen and for those of us who still have T9 muscle memory from a decade of texting on numeric dumb phones, it's an awesome option. (upbeat music) About the watch3 also,bundles a bummer too. Check the spec sheet and you won't find it. There's nothing here that jumps out is critically lacking. Even taking a closer look at the battery, there's no reason for concern. 340 milliamp hours is in line with the capacities of ios competitors like the Moto 360, Skagen falster3, and when using the watch3, as I use all my smartwatches, even the one and a half days between charges tracked closely with those competitors. So what's my problem? Well, one of my favorite features of the 2018 Galaxy watch, was its endurance of four days between charges. Which let me take a weekend road trip without packing a charger. You can also leave your charger at home with the galaxy watch3, but only if you bring along a Samsung phone with wireless powershare. Which is really finicky regarding where you put the watch by the way. (cool music) A huge part of my battery problem is my insistence on using the always on watch face because my belief that a wristwatch should always display the time. But even when I did that on the last galaxy watch, folks, I still got three days out of that old one. slimming down the new device meant reducing the battery size by 27% on the larger model. And my friend Hayato Huseman reports that with his smaller 41 millimeter device, he can only make it a day with the watch face always enabled. (cool music beats) Look, if you're content to stick your watch on the charger every night or while you're shower, then great there's no problem here. If you need more staying power though, Samsung just gave up one of its interesting edges over Wear OS. That's a shame. (cool music beats) The watch 3 does compensate for that omission with more, heart. As it leans harder into health tracking. My experience with blood oxygen levels along with pricing, after a quick word from my sponsor. (upbeat music) I'm not traveling as much as I have in years past, but I'm still using today's sponsor, just as often. While Surfshark VPN is great for safely browsing on a public hotspot, it's also a powerful tool for preserving your privacy , at home. Look, I make my living thanks to the advertising that goes alongside my content, but some ad's come with an uninvited guest. Malicious software. Surfshark helps fight that malware, and it also hides your IP address, which makes it tougher for bad actors to target you. If you think your internet service provider might be throttling your speeds based on usage, surfshark can help level the playing field. and it works on your computer, tablet and your phone. Try Surfshark now at the link below and use promo code MrMobile. You'll get an 85% discount and three additional months for free. Thanks to Surfshark for sponsoring this video. (upbeat music) Okay, health tracking. As this video goes live, the ECG function has yet to hit the watch in the US, despite having cleared the FDA, but the blood oxygen function is up and running. I became well acquainted with pulse oximeters, during my stay in the hospital back in February, and the Galaxy watch3 has been inconsistent. Sometimes it matches the monitor I keep at home, and sometimes it's under, by an average of three to five percent. That's the kind of number that would have made a difference to the hospital doctors wouldn't let me go home unless my reading stayed above 90% for a three minute walk, but i wasn't wearing this watch. But as the software repeatedly reminds you, this is meant to be a fitness tool, not a medical instrument. And the rest of the fitness stuff from auto detecting workouts, to periodically prompting you to get off your pasterior, works as expected and as designed. And finally the rest of the suite functions as you'd expect. From the display being bright enough to read and all lighting conditions, to the water resistance and durability ratings, to the Samsung Pay integration,(ping) to the removable bands, and standard sizes, - (watch speakerphone)To making and taking calls over Bluetooth on the watch speakerphone, which is actually a lot less tiny than I anticipated, and loud enough to be usable. (upbeat music) - (Michael)The Galaxy watch3 is available in two sizes, three colors, and a bunch of prices. depending on whether you need just Bluetooth and Wi Fi, or LTE enabled models. The cheapest you can find one, is a penny shy of 400 bucks, for the smaller 41 millimeter model, and if you want the one featured in this video, you're looking at almost 430. Adding LTE we'll take that with an Andrew Jackson range of 500 clams. Sure that puts it on par with the Apple watch pricing which may have been the idea, but if you take a look across the Android Wear OS, you can snap up most of fossils Gen5 lineup for under 295. And the excellent Moto 360 is on sale right now for 199. (upbeat music) Now I still prefer Samsung's snappier software and its health options are far superior, but Wear OS has improved significantly in recent months, as we hit the run up to a whole new wave of watches running, Qualcomm's improved wearable silicon, so definitely crush up the Samsung collection with the Wear OS catalogue, And if you do decide to pull the trigger on a Galaxy watch, take advantage of Samsung's trading program. They're offering 100 bucks, if you trade in your first Galaxy watch with other options as well. (upbeat music) So while the Galaxy watch3 doesn't push the frontier enough to justify uncorking my special Samsung wine, it does serve as a needed update to the company's flagship wearable. While I don't think that high price point is quite justified, I can say that if you do have the money, or you're gonna do a trade in, you'll be very happy with the smartwatch you'll get for it. (upbeat music) This video was made possible by a review sample provided by Samsung but there's always MrMobile works for you, not the manufacturers. Samsung provided no compensation, no copy approval, and was given no early preview of this video. They're seeing it for the first time right alongside you. Please subscribe, if that's the kind of review you'd like to see more of on YouTube, and check out my other smartwatch reviews which have got a number in the hundreds by now. Until next time, thanks for watching and remember to stay safe and mask up, while you stay mobile, my friends",
    "transcript_keywords": [
        "Galaxy watch",
        "Galaxy",
        "Samsung",
        "watch",
        "Galaxy watch brand",
        "Wear",
        "surfshark",
        "Samsung Tizen software",
        "video",
        "surfshark VPN",
        "Samsung Tizen",
        "Samsung phone",
        "Samsung Pay",
        "watch face",
        "Samsung specific",
        "Samsung wine",
        "special Samsung",
        "Samsung provided",
        "wearable",
        "home"
    ],
    "transcript_entity_values": [
        "three to five percent",
        "surfshark",
        "340 milliamp hours",
        "ECG",
        "three minute",
        "LTE",
        "three additional months",
        "27%",
        "Tizen",
        "Qualcomm",
        "Samsung",
        "Hayato Huseman",
        "almost 430",
        "Settings, Scroll through SMS",
        "Apple",
        "Gen5",
        "2016",
        "2018",
        "41 millimeter",
        "YouTube",
        "85%",
        "Skagen falster3",
        "hundreds",
        "Bluetooth",
        "four days",
        "3",
        "today",
        "US",
        "first",
        "recent months",
        "Andrew Jackson",
        "two",
        "above 90%",
        "Galaxy",
        "the Android Wear OS",
        "under 295",
        "Surfshark",
        "a decade",
        "Gear S3",
        "years past",
        "second",
        "VPN",
        "FDA",
        "199",
        "Gear S2",
        "500",
        "every night",
        "Wear OS",
        "Moto 360",
        "MrMobile",
        "the prior year's",
        "three days",
        "February",
        "three",
        "a weekend",
        "one",
        "100 bucks",
        "400 bucks"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "TIME",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY"
    ]
}