{
    "id": "_8s4SuuMMj0",
    "title": "AI assistants are so back | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-05-17T12:54:17Z",
    "video_url": "https://www.youtube.com/watch?v=_8s4SuuMMj0",
    "category": "Science & Technology",
    "tags": [
        "gadgets",
        "tech gadgets",
        "technology",
        "verge",
        "the verge",
        "tech",
        "tech news"
    ],
    "views": 27540,
    "likes": 586,
    "comments_count": 92,
    "description": "The Verge's Nilay Patel, Alex Cranz, and David Pierce discuss announcements from Google I/O and OpenAI's GPT4o event.  Further reading:   00:00 - Intro 03:22 - OpenAI releases GPT4o 25:45 - Google IO 52:40 - Gemini products explained 1:01:56 - AI Overviews in Google Search 1:14:11 - Lightning Round  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Tuesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/2024/5/17/24158505/ai-assistant-openai-chatgpt-google-gemini-vergecast",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-state..."
    ],
    "transcript": "(upbeat ambient music) - Hello and welcome to \"Recast Flagship\" podcast of multimodal search agents. They can kill you in a number of ways. Knives, guns, they're here. They're agents and they can do anything they want. I don't know why the industry has picked the word \"agents.\" I mean, I get it historically, but I don't know if they've ever seen the matrix in which the agents relentlessly try to kill Keanu Reeves. Hi, I'm your friend, Nilay. It's the Vergecast. Alex Cranz is here. - Hi, I am the AI of Alex Cranz. How are you today? (Nilay laughing) - Not enough emotion, Cranz. - More emotion. - Sorry. Hi. - Oh my God. Cranz is gonna flirt with you this entire episode. David Pierce is here. - Hi. I will not flirt with anyone this whole episode, I promise. - We should just turn up the knobs of how flirty our AIs are up like throughout the episode randomly. There's a lot going on this week. I don't know if you can tell from my voice, I am very tired. I just came home on a red eye flight from Google I/O on the West Coast. So Google had IO, it was very exciting. OpenAI had an event launching their own product. We should talk about those two things together 'cause they're kinda in direct competition with each other in actually kind of hilarious ways. And then a bunch of other stuff happened. David reviewed the iPads. A bunch of other emulators have launched for iOS. Continuing to reveal that Apple's application model for iOS. Maybe a little limiting. The CEO of AWS just unexpectedly stepped out. There's just like a lot going on and then there's like a Windows event next week in which Microsoft is basically being like, \"We're gonna beat the M Series processors.\" So a lot, just a big week. And I just got off a plane so, you know, who knows? Who knows where this episode of the Vergecast will take us? - Is it gonna be the shortest or the longest Vergecast in history? And no one knows. - So, you know, a thing that I have a new theory about red-eye flights. So, you know, in your 20s, you just take them 'cause they're cheap. - Yeah. - And you in your body can just take it. And then in your 30s, you get a little bit smarter and you're like, \"I shouldn't do that anymore.\" Like I have a real job. - And you still do sometimes. - Like, I wanna buy a real plane ticket. And then a thing that happens and I've only noticed this recently. I'm in my 40s now and I have a child and I take the red eyes 'cause I just wanna get home. - It's real. - My goal is to just be back at home. 'Cause I'm like, I've been places. At San Francisco, it's Milwaukee with rich people. Like get me outta here. Like going back to New York and then you look at the plane and the plane is like a gradient of like people in their forties going home to people in their 20s who are hungover. And that's a red-eye flight. - Yeah, that's about right. - It's very good. - One of my favorite early Nilay stories that I still tell is when I think we were in Barcelona for MWC and your go-to Red Eye advice was eat two McDonald's McGriddles right before the flight and you will instantly fall asleep because your body just shuts down and that's how you sleep the whole way home. - It's the level of sodium is control. - It's been a decade since you told me that. And I still think about it every single time I get on a plane. It's unbelievable advice. - My friends and I used to call it time travel. (Alex and David laugh) You just like eat two McDonald's sandwiches. You just wake up wherever you're gonna be. It's like, \"What happened to me?\" You're like desperately thirsty and extremely puffy, but you are- - And sweaty and yeah, it's bad. But you get there. - Anyway. But I'm back. I'm here. It was just a big week in AI. So let me set a little bit of the just competitive stage here. We have long known when Google I/O is. Right? It's around now every year. And they have it at the Shoreline Amphitheater, which is a big outdoor amphitheater at Google Loans right next to Google campus. And you know, they invite lots of people. Last year was a little bit smaller. They're coming outta pandemic, this year is big again. We just know when it is. Then there's this other company called OpenAI that likes to act like they're just a bunch of kids, even though they're some of the richest and most experienced people in all of tech. And they're like, \"Oh, we should have an event. We're not gonna have an event.\" And they literally did this move. They tried to upstage Google I/O but maybe leaking, maybe not leaking, maybe just like swirling some rumors. They were gonna launch a search product last week. And then Sam Altman was like, \"We're not gonna launch a search product.\" And then they announced a demo and they did a live stream called their Spring Event, which they announced, I don't know, 20 minutes before it started. They just created some anticipation that they were gonna have a big thing before I/O. - Well it was weird because there were rumors that it was gonna be GPT-5 which obviously would've been a huge deal. And then there were rumors that it wasn't gonna be GPT-5, but it was gonna be a search engine, which would also be a huge deal. And then right before the event, Sam Altman, I believe was the one who tweeted like, \"Not GPT-5, not a search engine, but we have something to share.\" So yeah, they're doing this very weird like awe shucks routine about like, \"It's not a big deal. We're just...\" And that's so on brand for OpenAI where they're like, they're both convinced that they are doing the biggest thing that has ever happened in the history of humanity. And like, I literally mean that precisely as I said it. Like they actually believe that. And also are just these like awe-shocked scientists who are Like, \"Oh look, we made a thing that will flirt with you. Isn't that fun?\" - Yeah, I would- - Let's hang out. - Again, I'm just pointing out. Some of the most experienced, richest people in tech. - Yeah, they know exactly what they're doing. - And they are very competitive, I guess is the way to put it. Like they're aggressively competitive with Google. I think they see that there opportunities to displace Google, whether or not there's opportunity to actually build a GI, we will come to that, right? Like one way or the other, OpenAI is gonna make a GI. You know. But in the show, we will also come to that. And so there was just that little gamesmanship there of are they gonna announce a big thing? Are they upstage Google? And then so they had their event, they announced their multimodal search. GPT-4o, o stands for omni that let's you search with video, with audio, with voice. It is natively multimodal. You know, the feeling at Google I/O and Alex Heath reported this in command line is that OpenAI did the demos Google was gonna do. Right? So this was the big upstage, like OpenAI saw what Google was gonna do or somehow heard about it and rushed to demo those same capabilities first to make sure that Google was in response to them. I don't know if that's true, right? That was just very much the feeling from Google folks. It's very much the feeling that Alex reported. But there is some real gamesmanship there. And I think the important frame for all of the news is it feels like OpenAI and Google have identified some kind of end state of an AI chatbot, AI search product. And now they're in a furious race to get there first. - I would actually frame it slightly differently. I think everyone has known this as the end state for decades. Like, the idea that you should have a Star Trek computer as a thing is what everyone has been talking about forever. Like you go back to the early days of Siri and Alexa and Google Assistant and they were talking about this stuff. But the sense that I've gotten is that I think the thing that has changed, and I think it's changed really recently, is that people think we're close. That there is a real sense that like not only is this the dream, but like, oh my God, we can build it now. And I think that was definitely the sense I got talking to Demis Hassabis, who runs DeepMind at Google and is in charge of all their AI stuff. It was kind of the sense you got watching the OpenAI stuff. They think it's here now. - Yeah. - And you get the sense that we've gone from like, oh, meet pie in the sky. A dream that someday we'll all get to. Which everyone has always known is the goal. Whether or not it's a good goal, it's still debatable. We've tried it a bunch of times, it hasn't really worked. Here we are. But there is this real sense that like, oh, it's happening now and we have to go get it right now. And it just feels like everyone has gone from running as fast as they could to like running even faster because there is a sense that like, you can sort of see the finish line now, which is really interesting. - Yeah, but they're running faster to a not particularly useful place. Like, just watching it, particularly the ChatGPT One was like going to, do you remember at CES until used to have a big booth and they'd always be like, \"Look at the power of what we can do with Intel. We can read your emotions with a camera.\" And I was like, okay. So when ChatGPT did it, I was like cool. I saw that demo from Intel four or five years ago. Oh cool. You can like read things when you hold the camera down on it again. I've seen that demo before. Like it fell like, it was like a nice demo. It was done very well and like I can appreciate that there was a lot of new technology there but it also didn't feel like it was doing anything new or fantastic. - Alex, I think you're under estimating the level to which the billionaires with Silicon Valley believe that people wanna bang an iPad. - Oh, this is true. Yeah, like where's your David Zaslav love? You've gotta like love people. Not not just devices. - Yeah, an FMK with David Zaslav an iPad? (all laugh) Like Sydney Sweeney is like a real, and I was like, \"I don't know, guys.\" - Beautiful lineup, incredible lineup. - Nightmare rotation. - It's tough one. I think Sydney's gonna lose. I'm real sexy. - Like a lot of people are gonna pick the iPad. You feel silly. - They are. - So that's the frame. And I actually wanna come back to that, Alex, because it feels like the core technology that everyone that has gotten everyone so excited has a fatal flaw with these hallucinations that everyone is ignoring and we should talk about that a lot but let's go through the news. So you know, we covered the hell out of OpenAI's event. Kylie Robinson, our new senior AI reporter talked to Mira Murati, their CTO about some of their technology. We sent an army to Google I/O like we always do. Soon, (indistinct) was on decoder, which we'll give a little preview of that's gonna come out Monday. So just a lot. We covered all of this stuff. Let's go through the news. OpenAI's news, pretty straightforward, right? The GPT-4o, that's the omni model, it's faster. They changed some of the pricing so you can just get it for free now. You don't have to pay for it like you did with GPT-4. There's a Mac app now, which is very funny because they have a gigantic Microsoft investment. By the way, their answer to why Mac app is that's where the users are, which is this both a true statement, and also the sickest possible burn that you can deliver to Microsoft, your major investor. They are letting people use the GPT store for free now. So like really it's like a pricing change, this new model and in classic sort of OpenAI fashion, you know. They announced Sora, their video generator. No one can use it. They announced GPT-4. Oh it's out, but the thing where you like wave your phone around and look at stuff, I don't think has hit yet. - No, you can get at the model and like every AI app on the planet has been integrating that model over the last whatever, 96 hours at this point. It's out there and by all accounts is very good. People like it, it's really fast. But yeah, the like super agent stuff that everybody is talking about is as far as I can tell, not anywhere really at this moment. - Yeah. And so the idea here, and this is where the idea that you're gonna bang an iPad comes from is you've got a phone, it talks to you, the voice is very much like Scarlett Johansson in the movie, \"Her.\" Sam Altman tweeted the word \"Her.\" Mira denied that it was this Scarlett Johansson voice. But boy is it close. But the idea is you're just like, looking at stuff with your phone, you're talking to an AI and it's much more personable, even a little flirty. It's like telling jokes. It's saying, \"You're looking nice in that hoodie.\" And it's like more powerful because it's not going from your voice to text into the AI model back out to text and back out to text-to-speech. It's all just happening natively, which is a speed up. But that's like the thing, right? Like the announcement here is very much this model can now talk, can like look at stuff with you and you can talk to it in a much more emotive way. - Okay. Can we talk about that actually? Because I was talking to somebody about this yesterday and they just sort of casually made the point that this is a user behavior that does not exist and doesn't make any sense. And I have not been able to stop thinking about it. And like I go back to the, when I was at the Rabbit R1 launch a couple of weeks ago. One of the demos he did was write a spreadsheet out by hand, just like a table of numbers and then point his R1 at it and say, I think it was like, \"Can you invert the rows and the columns and then send this to me?\" And it's like, cool technology. What the hell is that for? And is anyone in the world ever going to actually do this? And so many of these demos that we've seen both from Google and OpenAI this week are basically people walking around a room asking their phone what a thing is. And this goes back to Alex, your point of like, what is all this technology actually for? That's either a user behavior that we just have never developed because we've never had the technology for it or it's just not a thing people wanna do. And I'm increasingly leaning towards the second thing. - I mean if you can't see, probably, it would be very useful to point a phone. - Sure. - In a general direction and be like, \"What's there?\" - Yeah, granted, that's a good one. It's a good accessibility feature. No question. - Yeah. 100%. - The demos are weird because they need to create them so that you can verify that the thing is happening in the way that you think it's happening. Like the dumbest one I've seen so far is someone holding up GPT-4o at like Buckingham Palace and being like, \"Is the king here?\" And it's like, \"Yes, the flags are raised so the king is here.\" And it's like, dude. You don't need all this technology to get that. Like, they've been answering that question since the 1200s. (Alex and David laughing) You know, it's like that's why that's the thing. That's the whole thing. And there's just a piece of that where you need to construct the demo so it's obvious the computer is doing the thing and the actual use cases are yet to be seen because real people have to get the stuff and try doing things that no one's ever thought of doing. This actually ties in with what Google demoed, right? Which is, you have some sort of problem, you point your phone at it, you're like, \"Help me fix this problem.\" We will come to that because both of their demos were kind of weird for various reasons. But it's like that thing where it's like,\" I don't know what this part is called, but it's rattling. Fix it.\" And then like the computer knows some things and it like helps you get to that answer. Whereas all these demos, I think they're just trading on the fact that people will know the answers already. And what they're proving is that the various AIs can. And I think that's what you're getting at, David, is like these demos are not compelling because at the end of the day, they're designed so that you can see that it's doing the thing that you already know. - Right? Yeah, it was like the person, they were in the London Google office demoing Project Astra, which we'll we'll get to, but running around with the same kind of multimodal assistant and they point their phone out the window at King's Cross Station and say, \"What is this?\" And it goes, \"King's Cross Station.\" And it's like, \"Who did we help here?\" Like you're in Google's London office and you're like, gosh, what enormous station is that? Like, I don't know. And I think to your point, I think as a like search input, it's super interesting. But the idea of that as a sort of ongoing assistant that I'm just gonna like pipe the video of my world into all the time and it's just gonna chat to me about what I see, that, I am suspicious of. I just don't see that yet. - The funniest thing about that demo in particular is in the demo, I believe they also asked Astra, \"What is King Cross station known for?\" And Tom Warren on our team who is British, said, \"No Londoner would've given such a milk toast answer.\" They've been like, \"That's where you get hookers and cocaine.\" (Alex and David laughing) That's actually the answer. - If Gemini had said that, I would be more impressed. . Straight up. - You just like finally, billions of dollars of technology later, we're heating the oceans with all his GPU usage. But I can finally ask a robot where hookers. - Yeah, like, \"Hey ChatGPT, who in this audience is most likely to sell me drugs?\" Like now, we're talking. - So that's like the open eye news and the big piece of it is this emotion stuff, right? They're made the thing multimodal. But I think the thing that was compelling to most people in this demo was that it was flirting with the people who were giving the demos and in a voice that sounded very much like Scarlett Johansson. - Was it compelling though? I mean it definitely was flirting, but like, was it compelling? - So I'm just gonna caveat this with two things. One, it's been a long time since I was called upon to flirt with anyone and whenever I try to flirt with Becky, she's like, \"I don't know what you're doing.\" Like, those days are long gone. And so like I read it as like, this is what a bunch of nerds think flirting is. - Yeah. - Like you want a flirty female voice to be like, \"You look good in that hoodie, but it's like maybe you shouldn't be wearing a hoodie.\" - Like, like I don't want a computer to just reinforce all the bad stupid things I do all the time. I don't need that kind of hype person in my life. 'Cause they're not productive. - Yeah, I mean there's just an element where you should listen to it. It's hard to talk about it just like away from the actual thing. But if you listen to it, what they've added is a bunch of stutters and pauses and like intonations to what would otherwise be a pretty dry text-to-speech output. - It sounded the most human, I think that we've heard one of these sound, right? And I know that like back to that Project Astra demo too, they're actually saying, \"Don't talk to them like you talk to Alexa or Siri or any of these other ones. Talk to it more like you would a human.\" And that's like kind of compelling. But at the same time, I go back to I don't want a yes man. Like the yes man is how I ended up with a leather newsboy hat in the 2000s. My friend was just like, she wanted to just get out of the store. She was like, \"Yeah, get that hat Alex.\" I worked for weeks before she admitted it. And that's what like, I don't need that from a computer. - Yeah. No, our nation's teens during that same period of time was like, swing dancing. That's what we're gonna do. And like that's just a collective delusion that honestly, what you want is an automated system to put a stop to. - Yeah. (laughs) - And we just didn't have the technology at the time and now maybe the technology is pointed in the wrong way. I went through rant such a fate but I was a teen during that time. It happened to me. It's great if it's still happening to you, please. - How many people do you fling over your shoulder and then around your waist? - I guess when I say that, he's no longer interested in these antics. Like the thing that's always on my mind is, she is a divorce lawyer. Like, we just don't play. The thing about all that is what people reacting to is the personality and then all the demos at the bottom, it said, \"Check your facts.\" Right? The thing they have not improved is, is this thing getting more accurate and more useful or smarter? Which I wanna put a pin in 'cause Alex, you wrote a great piece about that. That also comes up in the Google example. But the part where everyone's excited about this enabling technology to build these experiences that everyone's always wanted, that David was talking about is like, is the thing good enough to do the thing that they want? Or is it just convincing enough? I actually don't know the answer to GPT-4o 'cause I haven't had a chance to use it very much. And the feature, the big feature isn't actually available to be used. - I do think it's becoming increasingly clear that it's getting convincing faster than it's getting good. Which I actually think is sort of scary. Like just looking at the reactions that people had to the OpenAI demos this week. Like, it made a lot of mistakes. It got a lot of things wrong. The interaction was kinda weird, but it was mind blowing to a lot of people. Just the fact that it sounded passively human and it made jokes and it was sort of silly and flirty and they could dial up and down the emotions. There's one point where it was two researchers who were doing this demo and one of them, he's sitting there and he asked a question and she responds and the other guy goes, \"Not enough emotion. Like, give me more drama.\" And it like correctly amps up the drama and like, to the point where it's funny. Like I laughed at the thing and that's remarkable. But I don't know that there's any evidence that it is making fewer mistakes in those moments so far than these things have in the past. Or that it is like meaningfully glister to getting to zero which is ultimately the only thing that actually matters. - Yeah, and zero is a hard place to get. Like people aren't at zero, but at least I you understand the failure mode of another person. - Right. (laughs) - You know, like you can evaluate whether a person is trustworthy or like you have some history or you can define a number of TikToks going through someone's entire backstory to tell. Right? Like there's a whole thing you can do to evaluate whether another human being is trustworthy or telling you the truth or they're experts or whatever in a way that like AI are just like a different kind of thing. - Yeah. - Yeah. - And we don't have the skills as a society or a culture to do it. And also we're gonna come to this, this is Alex's piece. Everyone seems to be just ignoring it 'cause it's fun. Right? And it's like, that's weird. - If I'm going to briefly defend AI, I will say there are a lot of things about these tools that are very low stakes that are fine, right? Like there's a lot of things for which there's not a right answer. And it doesn't matter if it gives you the slightly wrong answer. And again, I think the thing that we're learning is that more of the point is the interaction than we expected. Right? The more you hear about Kevin Russ's girlfriends in the New York Times. I loved that story. Like we've given Kevin a hard time. It is an unbelievable story idea and I'm very jealous of it. - Yeah, I mean his beat is what if you banged an iPad? I just wanna be it clear. - Unbelievable idea. - Incredible. - And you hear about like the Meta celebrity AI things that they have. Like, half the point of these things is just to use them. And I think I really underestimated that for a long time. I was like, \"These things are tools and the goal is to accomplish something as quickly and efficiently as possible. And having ums and ahs is actually just a waste of everybody's time.\" And for my own use, I actually still believe that. But I think in general, the fun of using it, it's a real, like the real friends with the friends we made along the way is like, (Nilay laughing) that's very much where we're at with a lot of AI. And I think it forgives a lot of the wrong stuff in a way that is a little scary but also if you're a company like OpenAI, really productive because as long as it's fun, people will forgive so much and they're making it fun. - I mean, but you're kind of getting the point where it's like, what if your computer was Calvin's dad from Calvin and Hobbes? (Alex and David laughing) You know? Just like, I don't know, I'm just gonna make some stick go away kid. Fine. And that was life before computers, like before Google. People would just make stuff up at parties, be like, \"Ah, that's what it feels.\" And fine. Like society made it through many moments without being able to Google stuff on their phone at a party. But it's just weird that we're at a place where we had that facility and now we're like, it's less accurate than before but it's flirtier. And the point is the interaction, that's a change. It's like worth remarking on. - That kind of mirrors like people's search behavior in general, right? Because everybody's like, \"I could use Google, which will take me probably to the correct answer.\" Or I could just go on TikTok and be like, does anybody know why this happens? And take the first answer I get, from the most charming person. - And the answer is, your water doesn't have enough hydrogen in it. - Yeah. (David laughing) - Just factful. - Not see the answer. OpenAI announced all this stuff. Which is interesting, right? Again, the timing. Then the day of I/O they announced that former chief scientists now Ilya Sutskever is leaving the company after all of the drama about Sam Altman getting fired. Ilya was one of the people that voted to remove Sam. And then he said he made a mistake and he went back and there was the whole thing. And now Sam is back with a bigger board, whatever. It always seemed likely that he would leave. And then they announced it on the day of I/O. And I only bring this up, you know, it's like, the sort of machinations of open eye are very interesting because of Sam getting fired. But it's interesting timing and that they made all this noise about, \"Maybe we're doing search, maybe we're doing a thing, but it's magic anyway.\" And also, our chief scientist who led a coup will be leaving the company. - Yep. - Don't pay attention to that. Pay attention to Google's news. Like, weird. It's just a weird, that I think OpenAI is in a weird spot where they are. It doesn't feel like this from the product side. I think the product has captured more imagination. But they are, as a company, like pretty reactive to Google. Like they're weaving their way around Google in a fairly interesting way. - Yeah. I think Google is getting powerful in this space more quickly than anyone gave it credit for not very long ago. - I don't think that, I think- - Do you remember 12 months ago when we were sitting around being like, \"Google blew it. They blew it. Where have they been? Google fucked it all up.\" Like that's not- - We think Google was like slow. But like, I don't think it's surprising that Google, one of the largest companies in the world is gonna run circles around this company that was originally created to be clear, to protect people from AGI while also creating AGI. Like they're still a startup. They got a ton of money from Microsoft and they're hunting for more investment all the time. But Google has been investing in this space for a very long time, investing in those resources, investing in those people. And like, I'm not surprised that it came up and said, \"Yeah, we're gonna do it and we're gonna crush it.\" Like of course, OpenAI is gonna be on their back foot the entire time. That's why they rolled out their store so quickly. That's why they've been moving so fast is 'cause they're like, \"Okay, we beat them to market now we have to keep beating them to market. 'Cause that's all we have. We don't have all of the infrastructure, we don't have all the resources that Google has. So this is what we can do.\" - Yeah, no, I buy that a lot actually. And I think that, you know, what OpenAI is good at is having a product and caring about a product and having the product be existential to the company and making a product good. And Google is not good at that. (ALex laughing) - Real bad. - Like Google has a product that it cares about for a long time, not in Google's core skillset. Hasn't been for a while. And you know, last year, they announced a bunch of stuff and we're like, \"Where is it?\" You know, again, they were at Bard last year, like, all that's gone. They already wiped out one whole set of products and replaced it with a long list of other products, all of which are named Gemini, which we'll get to. But they had, you know, their announcements at I/O were very confident. We should go through at least the chatbot stuff here. I did talk to Sundar afterwards. We talked a lot about sort of how people feel about AI, you know, that's coming on decoder next week, but it felt like he has a handle on it. You know, like he knows that he has to do this stuff and he knows that it's like very much like can't make an omelet without breaking some eggs. And he is like, \"I feel bad for the eggs.\" But he's doing it like they're in an aggressive posture. And the thing that I think the most aggressive posture on is Project Astra, is some of their search improvements. And it's the idea that they have the infrastructure to scale this stuff and make it cheap. Right? So Sundar said to Deirdre Bosa and CNBC, \"Our cost of queers are 85% like cheaper than it was a year ago.\" And that if you're OpenAI is like, \"Oh shit. Like Google can just deploy this stuff to everybody who has Google and it's cheap and they can like figure out their business on the back of search ads and all this other stuff. And we are at, well, 20 bucks a month was a lot of money and people weren't paying for it and now we're giving away the best model we have for free.\" Right? Like, there's a real challenge in there and you can see these companies kind of battling it out, each using their own advantage. OpenAI very much, their advantage is they can tell a compelling story about a product that everyone believes will be here a year from now. And Google's advantage is that it's huge. - Yep. - And you also just described basically the whole reason that Microsoft and OpenAI got so tied up because Microsoft promised AI that same level of scale and infrastructure. And I think if we've learned one thing, it's that it's very hard to do that in a partnership - Yeah. - In a way that it's much easier to do it inside of your company. And I think like, if you look at what we've seen across Google the last year or so, that company has just like relentlessly consolidated itself to be able to move all of that stuff faster. - Yes. - And that's like, that was the Rick Oslo story when they put him on top of hardware and on Android. It's to move AI into Pixel and Android more quickly. And the infrastructure stuff, like, one thing (indistinct) said to me is that the fact that Google's infrastructure exists is how you get Astra to be so fast. Like, if he just literally tied those two things together and he is like, \"We spent six months taking the tech that we had and making it fast.\" And what that meant is putting it in the rest of Google's infrastructure. Like that becomes the job. And you're right, cheap and fast are how you win. That is the next phase of this is we take all of this stuff and we figure out how to do it. We figure out how to do it in a way that is like economically sustainable and doesn't have latency because latency kills all of these products just as a user. Like if it's slow, it sucks. And that's where we are. - And Google has known that forever, right? - Yeah. - I mean, Google has always known its speed is the thing. So we should talk about some of Google's news. The main one is Project Astra, which is their natively multimodal, take a video of a thing, search for it, ask it questions. I did a demo of it with V Song. It was weird. Like there were Google executives there doing demos on their phones. Apparently. We didn't see that. We went into a booth where we put on like a gaming headset and there was, you know, a top-mounted camera pointing down on a big TV screen and we were asked to take objects out of like bins and like put them on the top, you know, so the top down camera can see them. And like ask questions about the objects, which to David's point is a completely insane use case. (Alex and David laughing) Like, you are just never gonna do this. - You know what? - But like, the idea is that it could see the things that could just like instantly, sort of latency free chat with you about them. So, you know, V picked three things and like said, tell me a story name the stuffed animal. Great. I broke it. Just instantly broke it. I had a spaceship, a pliosaur, like a plastic dinosaur. - Did you know it was a pliosaur or did it tell you it was a pliosaur? - I thought it was an ethiosaurus and it told me it was a pliosaur. I don't know by the way, I don't know who was right. I didn't have any like dinosaur people there with me. (all laughing) You know, the one dude from Jurassic Park was not there with me. But Alan, what's his name? - Alan Grant? - Yeah, Alan Grant was not there. - Yeah. - Good pull. There we go. - Who's the one who played Ellie? This is what I care about. - Laura Dern? - Laura Dern. - Yeah. Laura Dern. - That's with Laura. - Oh my god, I wish she'd been there with you. - Yeah, I just wish she's around. - So if Google's listening, the next time we do this demo, Laura Dern should be there. And I was like, \"Tell me a story about these three objects we're the Morocco is the winner,\" which to be fair is like an idea that can only come from my like booze old human brain. It was like, \"Get ready for a story.\" (Alex and David laughing) And I was like, \"I'm ready.\" And it was like, \"Once upon a time.\" And it just stopped just dead in its tracks. Like could not predict the next word in a sentence that added up to the Morocco will beat this dinosaur in his spaceship. Like it was, I don't know. - And there is nothing more awkward than that specific silence. Where you're like, is it about to happen? - Is it thinking? - Did it break? - Is it doing? - Or a hamster on a wheel somewhere? Like there's a data center on fire and the poor guy giving the demo just like hit this space bar. I was like, \"Get outta here.\" Like, he was like, \"We have other demos to give.\" Like I don't trust you anymore. And it's fine. Like, that is a weird demo. It's a weird use case. It doesn't make any sense. The point is to show that it can see, you can like use its camera and do text-to-speech like all at the same time in the same way natively multimodal. Like you would never walk, like if you ask a normal person tell me a story where the Morocco's a winner, they would also be like, \"Get ready.\" (all laughing) - And walk away. - But I think there's just a part of this where we're asking these things to do like incredibly esoteric things just to see where their limits are obviously. And you gotta bring that back to reality. So the one demo they gave, which is coming to Google Lens, it's like an extension of Google Lens, it's a video search, which is sort of related to Astra. Like Astra is a thing over here, but video search is a thing over there and it's weird to pull them apart. So Astra, you're just like talking to a computer, you're like waving your phone around, looking at stuff and talking to it. Video search and lens is you like take a video. Like you hold down the shutter button of a thing while you're talking and you say like, \"Why is this record player broken?\" Which is one of their demos, or why doesn't the lever on this camera move? Which is another one of their demos. And they feel to me like the very related ideas, but they are separate and classic Google fashion. Like these are not the same idea. They have different names. But the thing about it is the Astra demos, you know, they felt very esoteric, can Morocco win? The video search demos were very tactile. Like I could see how they would be useful. - Yep. - Right? This thing is broken. I'm just gonna take a video of it being broken. I don't even know what the parts are called. Help me fix it. So the record player won, which they did a lot of on stage is pretty good, right? They had a people know about record players. There's a weight on the back of the to arm. And if you don't have the weight balance, right? To arm just like skips around. Because you need some weight pushing down on the needle into the record to like hit the whole thing. If you're a record player nerd, this is like the most exciting demo that you've ever seen. If you are a normal person, you look at that and it just tells you this thing. Go watch the demo. I encourage you to watch the demo. It's like that it identifies the model, the make and model of the turntable. It's like, that's an audio technical turntable. And the reason that stone arm might be moving this way is because it's not counterbalance correctly. And it has a whole list of like things you could do to counterbalance correctly. And it's like, oh, this actually isn't useful, which I thought was fascinating. It's the right answer. Straightforwardly the right answer. Like, that's why it was doing that thing. But if you don't know what the tone arm is called, you've gone two steps too deep, too fast. - Right. - Right? You're like, the information you need is like record players work by putting a needle in a groove and you need to put pressure on that needle. And this round weight at the back is called the counterbalance. And you need to spin it so you put enough weight on the thing and the amount of weight you put on, it's actually dependent on your needle. You go, it's like, you fall down the rabbit hole and suddenly, you realize like you own four record players. - Yeah, then you're just an audio nerd. - It's just a thing that happens to you. That's fine. But like, that was really interesting to me, right? It's the right answer but sort of in a way that was like too far, too fast. - Oh, I think you're totally wrong. I think what you just described is Google search. Like, which is the way that it works, right? Which is that essentially- - But I'm saying like if you don't know the term that it's called, you couldn't follow the directions that were given to you. - Right, I mean, that's fair. But I think maybe a better example of the opposite case is one that Liz Reid, the head of search, talked about when she and I were talking, which is your dishwasher is broken and there's a light blinking and you don't know what brand your dishwasher is. You don't know what model it is. You don't know how to describe which- - You're just a baby. - You're just, my dishwasher's broken. Off the top of your head, do you know the model number of your dishwasher? - I could make up anything, right? - If you had confidently answered, I would've believed you. - Just be confident. Just make up enough. - Like, but again, that's not information most people have. It's not information most people need. It's not information most people should care about. It should just say, take out the filter in the bottom, rinse it out and put it back. You'll be fine. Like that is the answer. I don't need to learn about dishwashers. I just want mine to work. And it's like, I take my card, the mechanic, some people are like, \"Oh, I'd like to understand cars so that I can make sure that my car runs better.\" Most people come in, they go, \"My car's going (imitates rattling), fix it.\" That's the end of the interaction. - That's great. But if you're asking like, what is this thing and why is it broken? And it's like, here's how to fix it. Telling you what to do is actually important. Right? And here it was just like balance. - Yeah, but that doesn't require teaching me about it. It just says, \"Do you see the thing there? Pull it down.\" - Fair. I just thought that was a particularly jargony. Maybe it's 'cause I just like am a turntable person, but the answer there was like particularly jargony in a way that I thought was interesting. It didn't like, it didn't help you understand the actual answer. - Well I think you're also someone who thinks like you wanna understand the thing that you're talking about and the working with. Like, we're all gadget nerds. - Or I just wanna lie to David confidently. - Yeah, yeah, that too. But like. - I would've so proud- - We wanna know how the thing works. We wanna know all the processes. And it's true, like the reason, you know, when you first used Google Search 20 years ago, you would have to be really think about your search prompt, right? Like you'd have to think about what you type in and now you just type in like, \"My dishwasher doesn't work.\" - Yeah. - And people just don't care as much. But to your point, like, yeah, if the dishwasher said, \"Yeah, go replace the filter.\" I'd be like, \"Where the hell is the filter? What the hell is that?\" Like I would still, to your credit, like I would still wanna know all of that and I don't think it would necessarily get me there yet. - Well, I'm just saying I think that one's interesting 'cause it was the right answer. There's no question it was the right answer. That's the reason that tone arm was flying back and forth. It was just, is it a useful answer, right? And I think we can obviously disagree about that and we are, but that's the level that we're at. Like, is this actually useful for you to go sort of like spit out an answer like this where it's, fix the counterbalance, And you need to know some information to like, take action on that instruction. - Well, and there's a really interesting sort of AI all the way down piece of that too, which is that like, what that indicates is that the AI for sort of understanding what's in a video that you're sending to it is capable, right? Like, it did the job, it figured out the question you had by you pointing a video. That's awesome, right? Like, I actually think the video searching lens is a very good idea. And I think pointing your phone at something, being like, \"What is this thing that's happening?\" Is an actually totally normal user behavior. So I'm like all in on that. The output thing is actually much harder, right? Because it's like, okay, in this case, is the right thing for Google to do to just sort of give me an answer about the tone arm, which is not a term that I know to your point. So if it says pull the thing on the to arm, I'm like, what the hell is the tone arm? And you've lost me. Should it send me a YouTube video? Should it send me a compilation of stuff? Should it like super impose AR on top? Like that is just such a different problem from the sort of search query recognition thing. And my sense is Google is getting really good at the search query recognition, right? They did it with voice, they did it with video, they did it with images. Like, Google is very good at understanding what you're asking almost no matter how you ask it. And then the question of how to answer is so different and so much harder and full of thorns and wildfires. - So by the way, this is kinda exactly what I was getting at is what it presented was like a list of words, like vocab words. And then in the demo she was like, \"And here's a link to audio technical's manufacturer page,\" which is more words. And what you actually want is like a YouTube short where someone just does it in five seconds, - Right? Somebody just reaches down and pokes the thing and it works again, right? - And they're just like, \"Here's this thing. Like do this thing until it floats and then like turn the number to whatever number is on.\" Like, that's all you need to know. And like the actual answer to that is a video of someone doing it. And again, I just like, it got it right in one specific way, but it actually got it wrong in like another way, which is like the form of the answer is not the most useful thing, which is really interesting. Then there was the other demo, which, it was just wrong. Like wrong in a way where I'll just preview in the first question I asked Sundar Pichai in the Dakota interview was, is language the same as intelligence? Because the question was that someone was pointing a camera at a broken film advanced lever on a SLR, like a film SLR camera. And so these cameras are really manual, right? So you take a picture and you gotta move the lever to move the frame of film over in the camera. If you've never seen a film camera, this is like a very satisfying mechanical thing to do. You like, push the button the big, you know, the shutter goes junk and then you like move, you are literally pulling, you know, the notches in the side of film. You're literally like pulling the film over and winding it around. - Such a good thing. - You can expose the next shot, the next frame, when the next time you open the shutter. This is great. Like, I'm a nerd for these things. And the answer and the question was why can't I advance this thing? Why is this lever not moving all the way to advance the next thing? This is a problem with these cameras. They have them, there's a million reasons you might have this problem. Like one of them like old Cannons is like, there's a magnet at the bottom of the thing and one of the answers is like, get a magnet and like run it over the bottom of the camera. There's like folk tales and super suspicions like, you know, it's like, drink the blood of a goat and like wave at a crystal and like move your film advance lever. It doesn't matter. There's just like a lot of information out on the web of how to do this. And the answer that Google delivered in its own video and highlighted is the most wrong answer. Like, it's right in one way, which is as a last resort, just open the back of the camera. - It will technically work. - It will technically work. But if you open the back of a film camera, you expose all of the film, you ruin all of your photos, right? So when people do this, when I asked Becca and Veren and a bunch of other photographers on our staff, like when you have a broken film events lever, would you ever just open the back of your camera? And Becca was like, \"No, no, no, no, no. You go into the darkest closet you can find and you pray and then you open it and monkey with it because you don't wanna expose your film, you don't wanna lose your photography.\" And Vern was like, \"I've spent a lot of time in that closet,\" which is like a very funny thing, the most Vern thing you can say. Right, like these cameras break, they're finicky mechanical objects, but there's not a place where anyone with even the slightest bit of intelligence about those kinds of cameras would recommend and highlight, \"Just open the door and fix it.\" Because necessarily, you're gonna ruin all of your photos. So I actually asked Sundar about this and I was like, \"This is not a thing. I don't see the intelligence going up.\" I see the capability, right? Like David's saying, it can see in the video what's wrong. It can go search the web, it can synthesize some answer, but this answer is wrong. Like, this is not the thing you should advise people to do. And he is like, \"I went and talked to the team\" and they're like, \"Well in some cases, if you were willing to destroy all of your photos, it's the right answer.\" Which is correct. - Yeah. - That is the correct response. We should just run it. We should just run that clip. Let's run that clip now. - You know, ironically, I was talking to the team as part of making the video. They consulted with a bunch of subject matter experts who all reviewed the answer and thought it was okay. I understand the nuance. I agree with you. Obviously, you don't want to expose your film by taking it outside of a dark room. There are certain context in which it makes sense to do that. - Sure. - You know, if you don't wanna break the camera and if what you've taken is not that valuable. - Sure. Right. - It makes sense to do that. You know, it's a good example of you're right, there is a lot of nuance in it and you know, part of what I hope search serves to do is to, you know, gives you a lot more context and around that answer and allows people to explore it deeply. But I think, you know, these are the kind of things, you know, for us to keep getting better at. But to your earlier question, look, I think I do see the capability frontier continuing to move forward. I think we are a bit limited if we were just training on text data. But I think we are all making it more multimodal. So I see more opportunities there. - To me that answer is like, \"Yeah, we should have probably told you you're gonna destroy all your photos.\" Right? Like that's the answer. - Yes, - Yes. - But it's also like, why are we rushing into a world where the products like can't quite do the thing you need them to do? And Alex, this was your piece, which is, these things are hallucinating left and right and everyone's kinda like over it. - Yeah, I just keep being baffled by it because it just screws up constantly. Like if you give me one of these things, I can probably get it to hallucinate within four to five questions fairly easily. Like consistently, I could get it to screw up. And it's just because they're not good at it yet. Because they're computers, they're not people. Actually, all of the stuff that our brains do is really hard to do and they're not prepared. But these companies are like, \"Well, it's really cool. We're on our way. So like, enjoy, and this is now how we're gonna have everything work.\" And it's like, well no, stop that. I need my computer to know how to do my taxes. I don't need it to know like, what a nice accountant should sound like. (Nilay laughing) - Have you seen the one where people keep asking it how to get a man and a goat across the river. And literally, none of the models can like do it? Like the question is, you have a man, a boat and a goat, how do you get them all across the river? And it's like, first, you take the goat across, then the man comes back and he takes himself across and it's like, that's not the answer. - This is just a bad answer. Yeah, the AIs don't think like humans do. They're not meant to. And that is remarkable. And it's like, it is cool that we're now effectively engaging with like these alien thoughts and things, right? Because it doesn't think the way a human does. But it also doesn't think the way a human does and we keep asking it to, and we keep putting it in these situations and then we're like, \"Don't worry about it. So it hallucinated a little bit. So it like decided that Nilay wasn't the founder of the Verge and that Alex is a man. It's fine, keep going.\" And it's like. - Right. - Materially, those aren't harmful things to say, right? I think we'll both be fine if somebody said that. But it still shouldn't say it. And that's what you want to now become the new form of search? Like for me, it really feels like Google has lost the plot for what Google is supposed to do. And Google is supposed to get you to the information. It is not supposed to be the arbiter of the information. And increasingly, it feels that it needs to be the arbiter of the information. And that's like the whole point behind a lot of its new search products. \"We're just gonna tell you how to think.\" And it's like, well no, one, your company, you shouldn't tell me how to think. Two, you don't actually know because you're relying on these AIs that don't know. Just stop this. Like, this is a really bad path for them to go down. And I feel like it's gonna eventually bite them in the ass. But they're so financially incentivized that they just keep doing it. - I mean, this is the truly the competition between OpenAI and Meta and Google is ferocious. Microsoft obviously in the mix there. - Apple wants to be. - Apple's just gonna buy some model from the other, right? At least for this stuff that Siri outside your phone. That's the rumor. We'll see. WWC is coming up. But it just feels like there's that ferocious race to get to this product that everyone has dreamed of for a long time. Whether or not the core technology can do the task reliably. And you know, just go back and think about that film camera example for a minute. But if you had a friend who was like, you were like, \"For some reason,\" you're like, \"My film camera's broken, I can't move this lever.\" And they're Like, \"Yeah, just open the back.\" And then you open the back and it destroyed all the photos you've taken. And by the way, film's not cheap, which is the thing that Becca reminded me of instantly. Like, film is expensive. So you're gonna ruin all these photos, you're gonna ruin at your expensive piece of film. You would be pissed at your friend. - (laughs) Yeah. - Like, just as a matter of course, you'd be like, \"What? Dude? Like you could've told me to go to a dark room. Like I asked you 'cause I assume you know, this other piece of information.\" And there's none of that accountability with these tools. You can't just like be mad at it because you know, in a market, you would leave Google and go to OpenAI and it's like, it's gonna lie at you, but in a way, that suggests it might also have sex with you, like, fine. (laughs) You know, but that's the part where it's like everyone's building a really fast car, but they're not telling you that the engine just doesn't work about 20% of the time. And it's like, okay, but is there a path to stopping it? - That would be a bad car. Actually, I would put it slightly differently. I think they're building a fast car and not telling you how to use it. Right? And I think like the camera thing to me is such an interesting example. Because I would argue that's not a hallucination, that's a terrible UX mistake. Like, it gave you a true answer without the actual bit of information you needed to know what to do wit with that true answer. You can open the back of your camera to get the film out. That is a true thing. And so in a certain way, the model was successful. And like that's what I hear Sundar saying. It's like, it didn't get it wrong, it just didn't tell you what you actually needed to know. And so now we're in this place where like... - (laughs) I mean, that is... you're dancing on the pins, the heads of needles, whatever- - But like, I think, I mean, there are things that are wrong. Like Alex Cranz does not have a beard. That is wrong. Right? Like got it. Nailed. - Yeah. - But the way the rest of the answers on that list, that's the one I focus on 'cause it was the most destructive. The rest of the answers in the list that it generates are bananas. Like one of them is just like nudge the shutter a little bit, which is like, no. - I've already done that. - Don't do that. But I think that's not gonna help you. - One of the things I think a lot about with Google right now is Google used to make you do a lot of work, right? And that was the job, right? Like when you did Google Search, you did most of the work when you were interacting with Google. And now Google is trying to do most of the work for you and it creates this incredibly different version of Google that needs to exist. And what Google thinks is that actually it can just put a paragraph summary at the top and then let you use Google the way you normally would. Because if you wanna know more than just the paragraph, well here's regular Google. And I think that is like woefully underestimating how differently people are gonna start to use Google as a result. And so to me, it's like, making these things in such a way that is like weird and different is one thing, but to just push them at people and be like, \"This is a familiar thing that you totally understand,\" is a disaster. And that's so much of what we're getting is like, this thing sounds like a person, talk to it like a person. It works like a person. Like it super doesn't. Not even close. And it's all it's gonna do is run you into trouble. - Yeah. I mean, to me, this is the question that like all of these products have to answer, right? Is what are people's expectations and can you change them fast enough? I truly do not know the answer to that because I think what people are responding to is these computers are talking to them. And it turns out people confidently flirtatiously talking to you, charmingly talking to you is a great way to get a lot of people to believe a lot of lies. - That's how you get Alex Cranz in a news boy cap. - Yeah, exactly. This is how swing dance happened to America. (Alex laughing) I don't know if that's true, but like Google knows this because it operates YouTube. It knows this problem intimately, right? There's a lot of charming liars. Here we are, we're on YouTube. But it's interesting that it's like running full force into making the problem. And like you said, Alex, owning those search results, like that's Google's fault that they told you that answer. Whether or not you think that it's appropriate to pop open the back of a camera. That's Google's answers now. It's not some answer in a Reddit thread. It's not some answer from a friend that you're kind of mad at. It's just Google's problem now. It's gonna be OpenAI sproblem. There's a lot more to talk about. We should talk about search very briefly. We should talk about everything else Google has. We gotta take a break though. We've been at this for a minute. We'll be right back. (techno music) All right, we're back. Existential crisis about banging an iPad is on pause for the rest of this forecast. I know you wanted more of it. - I thought you were gonna say over and I was like, \"Well, that's a lie.\" But on pause, we can live with - No Kevin Russ wanders these streets, David. By the way, we're good friends with both Kevin and Casey at Hartford. That's what we- - Oh yeah. - Out of love. Although I do worry, out of love. All right. - Just not as much as we love our iPads. (all laughing) It's like my wife, my iPad, Kevin Russ is like, I would say the big three. - Man, the dog just got job. He's a child. (all laughing) - He's there, he's fine. (all laughing) He doesn't play me any YouTube videos. - Fair enough. Look, the OpenAI stuff and the Google stuff, right? These like video multimodal search chat interfaces, those are the main events. Google announced 10 million other things at I/O. All of which were named Gemini basically, or variations of it. It's very confusing. David, can you just run us down the stuff? - Sure. So basically, the theme of Google I/O is just Gemini in everything. There was Gemini in Google Photos, which powers a feature called Ask Photos that lets you ask questions of the photos in your Google photos. The example they gave was you can just search what's my license plate number and it'll find your license plate number in a photo in your Google photos. Which as somebody who only knows my driver's license number because it's in my Google Photos, rules. All about that feature. - Yes, by the way, that might be the single most important thing that they announced was AI search and Google Photos. - Oh, also, as far as I could tell, I wasn't there live but it got a big reaction as far as I could tell. Both live on the live stream and just in our office people being like, \"Yes, license plate search.\" - Well. (all laughing) - All right. - Turns out no one knows what their license plate is. You know what I think it is? Google Photos is so close to being able to do that now. So is Apple photos and it's why. That you start to ask it things it can't do. So if you ever search your Google photos, you quickly start to ask for things that it can't do because It's so close to being able to do that now. Right? So you can just ask it for like, show me all the people wearing a blue shirt on this day in the past and like, it will figure it out. Because it has some ability of that knowledge. I personally search for the word truck a lot, just a gaze. My now to party pickup truck. I needed to know my VIN number for I traded in the truck and I just searched for the words VIN number and it just like found it, right? 'Cause I'd taken a picture of it. The idea that you can extend that, I think people responded to it 'cause they're already trying. - Yeah. - So now you're gonna give the people what they want. It's like very good. - Yeah, yeah. So that was one thing. That got a lot of excitement. Sort of in the same vein of like things you already kinda wanna do. They announced a bunch of Gemini stuff in workspace. There's a thing where you can like ask similar questions of your email. The example they gave was if you have concert tickets or I think it was Nick's tickets was one of the examples they used, you can just say like, \"What time did the doors open at the next game tonight?\" And it'll actually look in your email for your ticket, to find that information. That kind of stuff is neat. There was a bunch of stuff in just the kind of general modeled universe. There was a new version of the Imagine Model, which is one of the ones that developers can use for creative tools. There was VO, which is Google's answer to Sora, which is a text-to-video model. - Which seemed really cool by the like. It seemed- - Yeah, really good. - Even better than Sora in a lot of ways. - It also debatable whether either of them actually exist in the world. So we'll see. There was a new thing called Gemini Live, which is like always on voice chatty thing. Basically very similar to the one that OpenAI announced. Project Astra is the big like long-term Vision Gemini Live is that just sort of specific voice thing. There was an update to synth ID, which is how Google is attempting to figure out a way to watermark AI-generated stuff. They're now doing it with text, which I thought was really interesting. But also with videos which goes along with VO and all the stuff they're doing there. Bunch of stuff for Gemini Advanced and Gemini Nano and Gemini 1.5 Flash, which is a new model just designed for all. Like, the names are insane. And I'm sure I've gotten 2/3 of them wrong and I don't care because it's Google's fault. - You've gotten them all right, so. - The names are dumb. There was a new one, there was a new AI thing in YouTube called Music AI Sandbox, which I confess I don't totally understand because there's been a bunch of kind of overlapping AI music things inside of YouTube and they glossed over it so quickly that I think it might just be kind of an amalgam of some of those things already. But that's the thing that exists. They're working with musicians on that stuff. New Gemma models, which are Google's open sourced AI models. Circle to search is in Android doing more stuff. They had a bunch of little things in Android designed to make kind of Gemini all over the operating system in interesting ways. - So the Android piece is really interesting to me, like in a big way. I don't know if any of it will come true because Google, but Dave Burke got on stage and started demoing AI features in Android and he's like, \"This works as we control the operating system.\" And you put that sort of right next to, we've combined the Android team and the Pixel team under Rick (indistinct). And you're like, oh, like if you make this really good, this is the thing that is actually compelling to switch from a Samsung phone or iPhone. - This is how Google thinks it wins. - Yeah. - For sure. Both with Pixel specifically and with Android in general. Like I think this is true or false, the thing they have identified as their chance to leapfrog Apple in a really big way. - But they've always thought AI was their way. - Yeah, but now it's like the user interface for the operating system is AI. Like they've built like a super rabbit. You know, it's like that's the thing that they're getting at. Is like you can just be on your phone and like circle a thing and like the robot will like go do it for you. Or like you can just talk to it and like use the apps for you. And unlike Rabbit, Google has some AI technology. - Yeah. - Well and there was one thing that they talked about where these sort of context awareness where it'll actually understand what's on the screen as you're talking to your phone. That's the kinda thing that you genuinely only can do if you control the operating system. Like no one else has that access. But also, Google has been trying to do this for forever. Do you remember Google now? Which was just the same thing. Like, the promise of so much of the large language model stuff right now is all this stuff we've been trying to do for 15 years, we can do now because the tech is better. Like these ideas are not new. It's so funny. They just think we have the tech to do it now. - Or the tech to do it convincingly. I just have to keep putting that asterisk there. To do it convincingly. Maybe not to do it. - That's fair. To at least make you want to try it. - Yeah. - Is as far as they have to go. There's more, there's a bunch of search stuff that we should talk about, but it was basically like, they made all the models better and are starting to introduce some more specific models. Like I think Gemini 1.5 Pro Flash in addition. - My god. - Unbelievably stupid name, - Horrible name. - Is really interesting because it's just a different version of Gemini that is just designed for speed. Its whole job is we just paired everything down and made it as fast as we possibly could. And I think you're gonna start to see more little things like that as they tune to these kind of specific use cases over time. So it really, top to bottom, was just, here's the thing, we Gemini'd it. Is it better now? Do you like it? That was the whole vibe. - So I will say, I think the most important one is Google Photos. It's the one that will hit the most people the fastest. I think- - that's right. - And change how people use that application, which I think is cool. Like really cool. Then there's the rest of it, which you know, I think the major criticism, I was like, there's too much stuff. It was too unfocused. Like they just said the word \"Gemini\" a million. Like if you just read that list of things named Gemini. Gemini 1.5 Pro, Gemini 1.5/Gemini Live, Gemini now, Gemini. Like it's insane. They announced the thing where they're like, \"Here's a prototype and idea where you have an AI teammate who has their own Gmail address.\" She just like yell at it. His name was Chip. That's like, this is a ridiculous. - I forgot you're vapor. - Like this is (indistinct). Like you are announcing vaporware, there's no reason to do this. Like you're just, why? You could pare it down to like, here's our product and here's all the things it can do and that'd be more focused. But I think Google thinks it has to like cover the waterfront of every idea you might have with AI and be like, we had that idea too. - And we have the infrastructure to pull off. - And we have Google Workspace so we can just deploy a hundred AI teammate teammates. Your Google workspace tomorrow startups. Don't you dare. (Alex laughing) - Yeah, I mean, I really like the way I've come to think about all of these things is that they used to be kind of half for developers and half for like the general public to sort of show the world what you've been working on. Now it's like a third for Wall Street. So that you can make sure investors trust that you have a real AI strategy. Because fundamentally, that's what a lot of this is about. Google is still fighting the idea that it got caught off guard by OpenAI and ChatGPT and is still trying to assert itself to investors specifically as a big player in the AI future, which means trillions of dollars if you can convince everybody that that's the case. So it's like, it's a third Wall Street, it's like 50% developers and then it's just a little teeny tiny slice left for regular people. - You almost did the rest of that math and you walked away from it at the end. - 17% regular people. - There you go. - And it's just like, you could just feel Google getting up there over and over and being like, \"We are good at AI.\" - We've done so much of it. - Yeah, like we did AI. - That's how I felt about Apple, the iPad event. They were just like the best AI piece. It's like, what are you talking about? And it's like this is made for analysts. So the one thing that's really interesting there, specifically in the context of Wall Street is AI overviews and search, which they announced very quickly. So Google has had this thing called search generative experience sort of in testing for a long time now, a year where you search for something and there's like an AI answer and it's like here's this stuff. And they've been tweaking it and messing with it and like seeing how it works for a while. And what they announced at I/O, which is a huge deal, is it's rolling out to everyone in the US Like this week, it's gonna be called AI Overviews and that's it. This is search now. And on earnings calls last year, Sundar was saying this is the future of search. Like search will be this thing. This is where we're going. And here we are where you search for something on Google and depending on the query, Google just reads the web and delivers the answer for you. And next to that, they have this thing AI powered like search page, which is basically what Arc browser is doing. Right? Where you like go ask Arc a question and it like reads the web and it like makes a little webpage for you with all the answers in it. Google's gonna do that now as the search engine results page, the SERP. Instead of 10 blue links, it will just like make a little custom webpage of like best anniversary restaurants in Dallas and be like, \"We've concocted this webpage for you.\" That's wild, Right? This is like flip the table on how the internet works in a big way. I would say the response from the media industry in particular is apocalyptic. Like that's the word I would use - Bear. - The CEO of the News Media Alliance, which I think we have to disclose. Like I think Fox media's in it. It's like not my thing, but someone's in it. - Sure. - We are in the media. - We are in the news media. - We run, we operate in the media business and our executives are in various media business organizations. I know that's their side of the house. I just complain. But there's a disclosure. But the CEO of the News Media Alliance said to CNN, \"This is catastrophic to our traffic. Like Google's gonna keep all the traffic and they're not gonna send us any traffic.\" We've been talking a lot about little sites that are already seeing Google traffic go to zero. I've been talking for years about this thing I called Google Zero, which if you've been listening to Verge has for a long time, you know that like our first big refer when we started was Yahoo. And we would like, write stories about phish technology because Yahoo algorithm loved phish and we would just like do that on Fridays to fuck with Yahoo and it worked. I don't know. That's how I built this business. It's like, I'm sorry. And then, you know, there's like Facebook traffic for a while and it went away and I'm always like the thing, it will go away. That's like, my inherent paranoia after all this time in the media. And I'm like, that number will go down. And that's Google and that's the last refer of note across the entire industry. I've been calling this Google Zero for years. Like, what are you gonna do if your Google traffic goes to zero. On decoder ask me the executives all this time. And this is the moment where I think it clicked into reality for a lot of those executives that Google is gonna start answering the questions by reading their sites and delivering an AI summary of the answer. And Google's response to this, and again this is, we move through this quickly 'cause I talked about this with Sundar and decoder quite a bit that's going on Monday. But Google's answer to this, Liz's answer to this, Liz, leader on search is actually, the links in the AI overviews get more clicks. That's their answer. Like straight up. They're like, \"Actually we're gonna send more traffic this way.\" No one knows if that is true. The only people who have the data to evaluate that are Sundar Pichai, Liz Reid. And it's like, well, if that's true, that's great. If it's not true. Or worse, if the halves get bigger. Like, you send more traffic to the big corporate sites and no traffic at all to anyone else. That's bad. That's bad. Right? That will reshape the internet in particular ways. And maybe you think this is great, like maybe you think that indie media or whatever, small sites, should build their own network of traffic and this is our belief, right? Like my belief very strongly is we should have our own audience away from platforms. But if you are just like operating today and you're like, \"Oh, my traffic is gonna go to zero. My Google traffic is gonna go to zero.\" You don't have the runway to like do the thing. - Right. They just turned it on like it's just on now. - Yeah, yeah. Like your business is gonna go away. And that is the thing that I think the pressure from OpenAI the competitive pressure from OpenAI and all these other companies, it pushed Google to do a thing very quickly. That's gonna reshape the internet in almost indescribable ways because the traffic flows of search traffic are about to like table flip. - Yeah, I do think the example that most immediately keeps coming to mind for me for this is the what time does the Super Bowl start? Kind of thing. And that to some extent, has already died thanks to the knowledge graph, which now is just like, it just pops up a thing at the top. But what I talked to Liz Reid a few days before I/O and one of the things that she said almost in as many words is that there is a type of information on the internet that Google just views as commodity information that I shouldn't need to go to another website to know the answer to. Right? Like before, if you wanted to know the years that Abraham Lincoln was the president, you would search that on Google and then you would click on a link. And Google at some point, has decided that that is just commoditized information that belongs to no one. And so I should have to go nowhere to get it. And then if you go all the way down the spectrum, you get down to like human perspectives and original stuff and really beautiful art. Right? And that is the stuff that I think Google earnestly believes should still belong to those people. And that Google's job is still to send you as the user to those places. And I think Google would like you to believe that it is very obvious where one of those things ends and the other begins. And in fact, the whole middle ground, which is most of the internet, is somewhere in between. And there is just no line that it is possible to draw between what is it just sort of out there in the ether that everyone can know? And the idea that you and I both used some of our time to write a story hoping we'd get some clicks and some AdSense? That's actually like a unnecessary thing for the enjoyment of the internet. And maybe that should go away. I'm somewhat receptive to that version of the conversation. Where that ends and good things that deserve to exist begins is now up to Google. And that is what scares me about this. - Yeah, and they have not really articulated anything beyond like the cream or rice at the top. - Yeah, they say high quality information and human perspectives and a bunch of just like vague buzzwords that don't give anybody anything. - Isn't this like just what Ask Jeeves was doing for decades? - (laughs) Yeah, yeah. With a better news. - Did we all decide that that was a stupid way to interact with the internet? And that's why Ask Jeeves still exists, but way fewer people use it now. I think it still exists. - It's ask.com now. - Sorry. - Jeeves was fired. Please (indistinct crosstalk) Some old tweets surfaced and Jeeves is no longer with us. - But again, Alex, that's a perfect example of like, none of these are new ideas, right? The only thing that's new is that everyone has decided it's now possible to do this well. - ask.com does TV show reviews now. - Oh my God. Sure. - So that's pure just like Google Day. - Perfect example, right? - I mean this is like why we spent a year last year covering the SEO industry because look, I think it's important to describe the thing as it was before you can understand how it changed. So we're like, these are the la these are the glory days of the SEO industry as it exists today, which is youbuyass.com and you search for which TV shows are trending and you shove a bunch of content onto a high ranking domain to collect some pennies. This is happening, by the way, across the media industry. And that's happening at like AI scale. Like you buy Sports Illustrated and you shove a bunch of AI content on it. It's real thing that has happened. - Yep. - Yep. - Right? You buy these like zombie domain names. What's the last one? - The All. - Gizmo. - Oh no. Was it the Hairpin? The Hairpin. - It is the Hairpin, yeah. - That's what I'm thinking of. Like this beloved women's blog and you shove a bunch of AI content on it. Like, that's already happening. This should wipe all that out, right? That's I think what Google would like is to wipe all that noise out. That implies by the way, that Google can make good determinations about what's good and what's bad, which the current state of Google does not provide a huge amount of evidence for. It also implies that Google will prioritize the beautiful human content over the AI content when a huge part of Google's business is making the AI content Weird. - And monetizing the AI content. - Yeah. - That actually Google has an incentive for that content to exist at giant scale. - It also kind of pulls the curtain back on like Google probably more than Google should want it to, right? Like, especially in our industry, we know that Google is an enormously powerful thing, that really controls a lot of conversations and stuff simply by virtue of the fact that if you want to engage in these conversations, you first go search for them and the first place you go search for them is Google. And so Google kinda dictates how you perceive these things. If Google just starts answering the questions, it is like the theater of, \"Oh, I search Google to figure this out and I have the agency of finding the answers,\" is gone. It's just Google, - Dude, this is the phrase, - Yeah. - They use this on stage. Let Google do the Googling for you. This was the frame, I never talked about search. - Horrible. Horrible way to do it. - It's a lot there. We can talk about this forever. Yeah. I mean, I personally can talk about this forever in rites some ways. And I assure you that if you work at Vox Media, you have heard me talk about nothing else for four years. Like a lot of the Verge is designed around Google Zero. And the point is, I don't think anyone deserves traffic from Google. Right? That expectation I think has actually been really unhealthy for the media industry that like, you we are entitled to traffic from platforms, especially for us because we cover the platforms. I would like some distance there in a real way. And also just like I'm a brat and I don't wanna be dependent on anyone ever for anything. But this is a pivotal moment like Google waving through, we're gonna do AI overview and search for everyone in the US and then sort of immediately pivoting to, \"Oh, and also you can search your Google photos.\" They like lit a bomb and they're like, and you can find your license plates. And they spent no time on it. It does not appear that anybody knew they were gonna do this. We'll see how it shakes out. I think the next 12 to 18 months are gonna be an absolutely bananas time in media. I think this is the thing that I would predict that there are some lawsuits filed over this from the various media lobbying groups the same way that they've already started suing OpenAI. There's gonna be a big shakeout from AI overviews and a huge part of it, and this is just what I'll focus on is Google's claim is that it will send more traffic. You cannot measure that claim. Inside of Google's own tools today or with any data that Google is providing. And if they want to close that loop, they have to make it like testable. That this is true. That you have to be able to see the data for yourself and say, okay, like we were the one that showed up in the AI overview box and we got way more traffic from it than when we were getting, like, you cannot measure that today. So we'll see. But I listen to decoder Sundar 'Cause we talked about a lot that's going on Monday, but we're gonna be talking about this. I guarantee you for about 18 months because the internet is gonna get reshaped around this particular feature in search - And it's gonna change a lot between now and then. The weirdest thing about this is like SGE changed a ton in a year and I think Google is maybe going to be surprised at how different it looks once you give it to everybody. - Yeah, it's gonna be weird. All right, we should take a break. We're gonna come back with the lightning round. Which as of yet is unsponsored, but the bites, they're coming. It's gonna happen one of these days. We'll be right back. (techno music) All right, we're back. It's lightning round. Sponsored by me. Nilay Patel. - Thank you. - The guy who coined- - I didn't get any of that money. I don't know. - I was like, \"You're so generous. Where is it?\" - I'm just moving money around my own house. I'm just doing tax fraud. There's kind of a lot in lightning round. David, you go first. - So there's a Microsoft Surface event on Monday, which there's been a lot of hype for because Qualcomm and Microsoft and others have been kind of quietly intimating that they were about to get a new generation of Snapdragon chips that are going to be like as good as the M series Apple chips and the war between Mac and PC is about to go on. And then we got a huge leak from Dell, I think it was a 311-page document detailing the next XPS 13 which is Dell's best laptop. It's like the default, which Windows laptop should most people buy is the XPS 13. And the things that they're saying on here are pretty unbelievable. 12 hours of battery life, 13 hours of battery life on the lower spec models, local video playback for 29 hours. Tons of power that like, at least according to the marketing copy, the things that we've been thinking might be true of this run of Snapdragon processors might actually be true of these Snapdragon processors. - I just wanna highlight that Apple last week, like in kind of a surprising move, announced their M4 processor in an iPad. And I don't think that's an accident, right? Like, Nilay, you were talking earlier about how a lot of these things are for Wall Street, Apple did it for Wall Street 'cause it is very aware that this is happening right now. - Yeah, we'll see. - We'll see, yeah. - I would be remiss if I didn't note two things. One, boy, we've heard this story before. So who knows? But two, a lot of our coverage is in Tom Warren's new newsletter, Notepad by Tom Warren. Which is his new newsletter about all things Microsoft's. Particularly AI the, future of PCs in this particular way and whatever Microsoft is doing in gaming, which I won't even continue to talk about because it will immediately be another hour of the first test. But you can sign up for a Notepad now. You can get it in a bundle with command line. We have two paid newsletters. You see our empires growing - I hope there's some like arrows pointing down saying, \"Buy now,\" - Subscribe to Sam's newsletter so that he can buy one of these new XPS 13s. That's really what Eli's saying here. - That's right. - Tom needs the battery life so he can write his newsletter. Please subscribe to Notepad. - Yeah, he's gotta write a lot of those every week now. - Okay. Alex, what's first? - Have you heard of PPSSPP? - That's a great name. - Sorry, what? - Otherwise known as PPSSPP. P-P-S-S-P-P. You could say it like that. Which is how it's supposed to be because, it's PPSSPP. - That's how you lure cats, right? You go pss. - You just keep saying it until somebody tells you to shut up and then you're like, \"Yeah, do you wanna play it?\" It's a new emulation software. It's PSP. Do you guys remember the PSP? - Oh yeah, I had a PSP. I had one of the great cartridges of all time. - Oh, I broke one of those cartridges but I loved the game and I was like poor. So I couldn't go get a new one and I'd always have to be like, flicking the plastic just to get it just right and then putting it back in. - Only Sony invents mini disc and then invents another mini disc. - Yeah. - For the PSP. - But somehow a little worse. Yeah. But now you can play it on the iPhone, which is really exciting because it was like a tank game and I really wanna play that tank game. And I'm gonna be able to play it on my iPhone now. And also RetroArch which is like the emulator software. So RetroArch lets you basically play just about any kind of, if somebody out there has created emulation software for a console you have never heard of, you can probably find it in RetroArch. - Nice. Yeah, that's real. - The software itself is a little... It is not the most user-friendly. It is not gonna be as neat and easy. - It's hideous. Just say it's ugly. It is the ugliest app. - First of all, ugly. But it works. - It does the job. - I just put it on my Apple TV and as almost as soon as we are done recording, I will be putting a bunch of games on my Apple TV and testing it for work and definitely just for work. But it's cool and it's just remarkable 'cause like, even a couple of years ago, you were like trying to figure out how to get all of these emulated games onto your TV and it was really limited and you could do it like a Raspberry pie, you could mess around with Android, all of that. And now you can just do it on an Apple TV and it's like, \"Welcome, Apple. I've been here for 10 years, but I'm excited you're here because I kinda like my Apple TV more than my Shield TV.\" I'm so sorry to all the Shield people. I'm sorry. - Dude, end to the show. - It's in the guest bedroom now. - It's the most, wow. - I have have been stewing on the idea and being increasingly angry about it that the Apple TV is the only good set top box left. They're all bad but it is the least bad because it is the one least destroyed by like ads and scams and all kinds of other- - I mean, it's still, I watched Palm Royale because it was like, do you wanna watch Palm Royale? And I was like, yeah Carol Burnett. - Apple's figured out that it can just be a Roku. And it's headed there and extra. - It's infuriating. But I will say RetroArch in particular being on the Apple TV, it's like a native Apple TV app and it just Native is strong. - Yeah. - But it exists on the Apple TV. - Yeah. - And some of the others work with like airplane stuff and are starting to be pretty good. But the Apple TV as a like retro console thing is going to be a big deal. - Yeah, you can just do it now retro. Like there's gonna be a lot more that will probably be much more user-friendly. But RetroArch is the big one. You can just go play it now and that's dope and feel weird. - I keep thinking about saying David said a couple weeks ago, which was all of this regulatory stuff was really like hard to understand and then the emulators happen and now everyone gets it. like a little bit of regulatory pressure, opened up the application model on the app and it's like, oh, everyone wants this. - Yeah. - And it's like, particularly for the Apple TV. Apple has insisted that you like do its dumb stuff and has not won. Like that product has not won and it's by far the smallest install base. It has the least... Like the idea that everyone's gonna be playing games and the Apple TV is like, did not come true. And now it's like, oh, shit. everyone's gonna be playing games with their Apple TV. - Yeah, I have never wanted to actually hook up a controller to an Apple TV before today. Like every other time they'd be like, \"You wanna play this game on your Apple TV?\" No. Don't ask me. I'm not gonna lie to you. Like, no. And now I'm like, okay, I wanna do that. I wanna play Go Sugar on my TV. - I think I honestly think the emulator stuff is just the biggest indictment of Apple's and like closed fistedness that you can get. 'Cause it's like the second you let people do good stuff, they're like more excited about these products than they have been in a long time. - Totally. - I have two in my lightning round. One of them is just telling David to talk about his iPad reviews, which I know you already talked about earlier this week, but I wasn't here. So it feels like everyone landed in exactly the same place, which is, boy I hope WWC involves an iPad OS update. - So yes and no. The conversation around this has actually been really interesting because the most of the reviews, including mine, basically say that. Like I actually worried I was going overboard. - You weren't. - Gushing about the hardware. There were others who went much further like, with the IED Pro in particular, like, it is a spectacular piece of engineering and design, but the question for is like, what is this thing actually for? And I think what has come true this week is there's been a subset of people who are like, yeah, this thing needs to be more like a Mac. Let me run Mac apps, open it up, let me do whatever I want, like give me a Mac in this body and I will be happy. And then there's a much different set of people who are louder than I thought who are like, \"No, that is not the point.\" Like, maybe I wanna touchscreen Mac, we'll have that conversation separately. But the iPad is supposed to be different. And one of the things I said in my review is that like, after talking to people at Apple and about the iPad, and I've just been covering this a long time, like Apple's running theory is that it can do like whatever the opposite of death by a thousand cuts is, that like, rather than have sort of one big thing that makes the iPad for everybody, it can have one that is for you, Nilay, and one that is for you Alex, and one that is for me David and we'll all buy iPads and we'll use them differently. And that that for Apple, is like the ideal outcome. And there are a lot of people for whom that idea is like really compelling and really romantic. Those people tend to be people who have that specific thing in the iPad already. People who love the pencil or people who like do the insane architect thing of like holding up the iPad and walking around the table to show somebody your designs, which I'm not convinced is real. - We got an email from someone who, I don't remember the email specifically, but either they are an interior designer or their partner's an interior designer and they're like, \"We just run the iPad to the ground like every day.\" - Yeah. It's a thing. - It's like, great, great. - Yeah. But so I think the question then for Apple is like, okay, do you try to find the big mainstreaming thing, which I think the obvious answer is make it more laptop-y. Or just like open it up so that people can do more stuff on it. Or do you keep just chipping away at this thing like one tiny use case at a time until you've built the magic. And I think like that second approach is way more fun and interesting and leads to something very cool in the long run. We're also 14 years into this. And Apple has found two. (Alex laughing) - Yeah, and to me, the thing that I got, I was, you know, like on planes all week, basically just like watching people angrily post each other on the iPad. And I was like, these are the same iPad reviews we've been writing for years. - Yeah. - It's the same iPad. - Like I forgot that I wrote this iPad review in 2013 when the first iPad came out. (laughs) Like the same exact review. Running iOS seven. Like, boy it'd be cool if I could do stuff with this. And then I wrote a version of that review in 2018 and then David you wrote a version of that review yesterday and then I just saw Dieter at the Google event. He is like, \"I wrote these iPad reviews.\" Like Dieter is the one I believe who coined the phrase, \"It's an iPad.\" - It's like, look directly to camera and be like, it's an iPad and you know exactly what that means. That's us. We did that here. And the thing that gets me about it, the reason I wanna talk about it right after emulators is it's Apple's business model that is holding this computer back. - Yes. - It is not the capabilities of the iPad or some idealism or blah blah blah blah blah blah blah. It is Apple's business model is preventing application developers from using the full power of the iPad. The fact that this thing cannot actually run a desktop web browser, they say it's ESI plus. It absolutely is not. - No. - Nope. - It just isn't. - Also, if you go to docscott.google.com in the browser on an iPad, it will punt you to the Google Docs app. - Most miserable experience in the world. - So what's really interesting is the Google Docs app. This is, you know, all our years reviewing the iPad. We would complain about this and Apple would always be like, \"Well, who cares? Only journalists use Google Docs.\" And then they realized the journalists who review the iPad use Google Docs. And so they fixed it by faking the user agent in Mobile Safari to tell Google Docs that it's desktop Safari. So you can run the good Google Docs in Safari in the iPad. What they did not do was make mobile safari good. - Right. Or fix it in Chrome or any of the other browsers that you can run on the iPad. - Right. And that the reason for that is straightforwardly, a business model reason. It's not that the thing isn't powerful enough to run. - No. - The regular Safari that you can run on a laptop. - It's stupid powerful, this thing. - Right? Yeah, I have an Intel Mac downstairs. I have a 2015 iMac sitting right over there. That is 1/10th as powerful as the iPad Pro. It runs regular Safari just fine. It runs Chrome in a way that suggests that I should buy a new computer but it runs Chrome. The reason Apple doesn't allow that to happen on the iPad is because the web is now the most powerful application distribution mechanism that has ever existed. It is by far the most popular in the world. And if you bring that to the iPad, the App Store goes away Because now, you just have a laptop, you have a Chromebook. - A nice Chromebook. - And Apple's business. A really beautiful Chromebook and Apple's business will not allow that to happen. And so this product is just absolutely held back by a business decision that maybe it's fair, I don't think, fine, make your business decisions. But we should be honest that this isn't a technical limitation or an idealistic limitation or blah blah. Apple is making a hard business decision about the application models on its products. Regulators are starting to crack that open and people are starting to see, oh, emulators are great. Like all this other stuff that we could do is great. And the last one to fall, I promise you is they will put a desktop class browser on the iPad and it will suddenly become 100 times more powerful as a computer. And more and more people will be like, \"I can just use this all the time.\" It's not the file system, although I love a file system, it's literally the application environment is completely neutered. - Yeah, no, I absolutely agree. And I think the browser solves a much bigger set of problems than like, you know, x86 interoperability with the old apps that you wanna use. 'Cause like, fine, there's going to be a bunch of apps. You can never use on the iPad. So be it. The web, there's no good excuse for that to not be one of those things - That doesn't even work anymore because all the laptops are ARM-based. - Yeah. - I mean that's true. Including Apple's. Yeah. - Like the most powerful laptop processor line is now in the iPad first. - Yeah. Yeah. I'm just saying like, the thing about the iPad, the thing that it's been missing to me from the discourse from the beginning is like, Apple designs every inch of this product. That they make this screen and the input devices and the operating system and they're like, there's not a thing in this that is not an Apple choice and this is the thing that they want. - Yes, fine. - But then you have to be like, Apple chose to limit this this specific way. - And I think there's a version of that trade that is more palatable at, you know, $349 for the 10th gen iPad than it like- - Yes. - I mean, I saw people spending two and $3,000 on the, and I just like, I think the argument that this should be a different device. That it's meant for different things. It does different things well. Like, no, at that price, it should do everything well that it is physically capable of doing and it just can't. And it is like, you're not letting it. - I do need to fight you on one thing, David. 'Cause I was one of those people that spent way too much money on an iPad Pro this week. - Yeah. - Do you love it? - Oh yeah. I got the 11-inch. It's that first iPad Pro I've had since the 2018 one. That magic keyboard case. Even though it's the new one and it's all much better, is horrible. - Really? - It's so thick. Like as soon as you drop that iPad into it, all of the magic of it goes away. And I was like, okay, so it's the exact same as my 2018 iPad, but the screen's better. Like, that was the immediate feeling I had. - Interesting. - In a really like, demoralizing way. - There is something to that. I mean, it doubles the size of the iPad. Like the keyboard at this point I think is both thicker and heavier than the actual iPad, which is bonkers and probably says more about how thin the iPad is than anything else. But also like, if it were a little thinner, it would be floppier even than it- - Yeah, it's one of those things- - It's just an unsolvable problem. - Yeah, I mean if it was the same feeling you get when you use like those inexpensive Chromebooks that are convertible Chromebooks or whatever, right? And it's like, okay, what do you want? And like yes, realistically, having it be feel like a laptop is more satisfying, but also I hate it. (Nilay laughing) - I get that. Yeah. - The surface does it better. - I'm gonna play with yours sauce 'cause I really thought- - I'll bring it in for you. - The Surface having a built in kickstand and then all you have to do is attach the keyboard is the correct way. - Yep. - I believe that with every fiber of my being. - Man, look, Mac versus PC is back on. Subscribe to Notepad by Tom Warren for all the latest on the newly resurgent Mac versus PC battle. Where everything old is new again. That was my lightning round one. The other one I was gonna point out is Andy Hawkins wrote a great piece about just like self-driving cars have hit a wall and I was gonna make the same comparison to AI, which is everyone got really excited about that technology and then it just didn't do the thing. And I would just caution everyone. Like, can they actually do the thing? But you should go read that piece by Andy 'cause it's very good. I think we're like five hours over. - Yeah, we should go. - Should we talk about search for a little bit longer? (all laughing) All right. There's much more to come on Monday. Again, we had the interview with Sundar. He and I got into it. I like talking to Sundar. I've talked to him once a year for a long time now basically. And he was fire in this one. So stay tuned for that on Monday. And then it says here on Sunday, we're gonna do the five senses of gaming, smell and taste. I don't know what that means. I'm very worried about what Liam and David are doing with the forecast. It sounds great. - This face on David is just- - Just officially know everything I need you to know. It's gonna be great. - All right. That's it. That's Vergecast. Rock and roll. (techno music) And that's it for the Vergecast this week. Hey, we'd love to hear from you. Give us a call at 888-VERGE-11 The Vergecast is the production of the Verge and Vox Media Podcast Network. Our show is produced by Andrew Marino and Liam James. That's it. We'll see you next week. (techno music)",
    "transcript_keywords": [
        "Google",
        "thing",
        "Yeah",
        "things",
        "Google Photos",
        "people",
        "Apple",
        "Google Docs",
        "search",
        "Google search",
        "answer",
        "stuff",
        "Recast Flagship",
        "lot",
        "iPad",
        "Google answer",
        "time",
        "Google stuff",
        "back",
        "Gemini"
    ],
    "transcript_entity_values": [
        "zero",
        "Pro,",
        "New York",
        "Morocco",
        "2013",
        "Android",
        "CTO",
        "Google Lens",
        "the Google Docs",
        "the App Store",
        "Sam",
        "Nilay",
        "Fox",
        "Jeeves",
        "Vox Media Podcast Network",
        "85%",
        "Vision Gemini Live",
        "2018 one",
        "Andrew Marino",
        "three",
        "yesterday",
        "Dave Burke",
        "the day",
        "British",
        "11-inch",
        "this day",
        "about 20%",
        "Alex Heath",
        "Nick",
        "Ellie",
        "the end of the day",
        "the News Media Alliance",
        "Alex Cranz",
        "iPads",
        "Dieter",
        "two and $3,000",
        "Native",
        "Safari",
        "a year from now",
        "Meta",
        "Laura Dern",
        "a year last year",
        "Scarlett Johansson",
        "Sports Illustrated",
        "a couple of years ago",
        "the iPad Pro",
        "Buckingham Palace",
        "iPad Pro",
        "the West Coast",
        "50%",
        "12 hours",
        "iPad",
        "Sundar",
        "One",
        "Two",
        "Gemini Nano",
        "Sam Altman",
        "four years",
        "Chrome",
        "Tom Warren",
        "billions of dollars",
        "Alex",
        "Fridays",
        "Gemini",
        "a million",
        "Raspberry",
        "TikTok",
        "Liz",
        "YouTube",
        "Music AI Sandbox",
        "Microsoft",
        "Shield TV",
        "Kylie Robinson",
        "Tom Warren's",
        "Project Astra",
        "Vox Media",
        "AI",
        "SERP",
        "Demis Hassabis",
        "Arc",
        "David Zaslav",
        "David Pierce",
        "Vergecast",
        "six months",
        "about 18 months",
        "Intel Mac",
        "2015",
        "a hundred",
        "this week",
        "five seconds",
        "third",
        "P-P-S-S-P-P.",
        "Star Trek",
        "Google Workspace",
        "another hour",
        "Hobbes",
        "GPU",
        "iMac",
        "888",
        "Google Search",
        "VIN",
        "Snapdragon",
        "Astra",
        "Nilay",
        "13 hours",
        "Chromebook",
        "10th",
        "Tom",
        "Verge",
        "1.5",
        "Deirdre Bosa",
        "Chip",
        "Google",
        "Google Photos",
        "Mobile Safari",
        "OpenAI",
        "the 2000s",
        "Cannons",
        "Casey",
        "Yahoo",
        "those every week",
        "a couple weeks ago",
        "iPad Pro",
        "iPad",
        "30s",
        "Gemini Live",
        "Qualcomm",
        "Liz Reid",
        "Nilay",
        "Samsung",
        "349",
        "YouTube",
        "CNN",
        "a big week",
        "Carol Burnett",
        "Milwaukee",
        "Rabbit R1",
        "the Super Bowl",
        "XPS 13s",
        "this year",
        "King's Cross Station",
        "the Imagine Model",
        "weeks",
        "40s",
        "MWC",
        "10 years",
        "IO",
        "decades",
        "first",
        "Ilya Sutskever",
        "SGE",
        "Palm Royale",
        "Liam James",
        "20 years ago",
        "McGriddles",
        "a year ago",
        "17%",
        "14 years",
        "a ton",
        "Rick",
        "Roku",
        "10",
        "Google Loans",
        "GPT",
        "London Google",
        "Ilya",
        "Astra",
        "last year",
        "a few days",
        "Surface",
        "96 hours",
        "Dell",
        "Hartford",
        "four or five years ago",
        "Mira",
        "311",
        "AI",
        "Laura",
        "1.5",
        "Windows",
        "M4",
        "Andy",
        "Sundar Pichai",
        "Silicon Valley",
        "a decade",
        "Jeeves",
        "RetroArch",
        "the early days",
        "US",
        "Jurassic Park",
        "Sora",
        "the Shoreline Amphitheater",
        "King's Cross Station",
        "Becca",
        "100%",
        "Alan",
        "VO",
        "Sydney",
        "2/3",
        "Calvin",
        "Welcome, Apple",
        "iPads",
        "Bard",
        "CNBC",
        "Pro Flash",
        "a couple of weeks ago",
        "20 minutes",
        "Vern",
        "15 years",
        "Eli",
        "all week",
        "Last year",
        "10 million",
        "trillions of dollars",
        "Nilay",
        "Facebook",
        "Google Photos",
        "20s",
        "last week",
        "the last year or so",
        "second",
        "2018",
        "Keanu Reeves",
        "OpenAI this week",
        "five",
        "Monday",
        "20 bucks",
        "Intel",
        "Becky",
        "Kevin",
        "San Francisco",
        "Veren",
        "tomorrow",
        "12 months ago",
        "the New York Times",
        "a minute",
        "AI Overviews",
        "Dallas",
        "CES",
        "AWS",
        "one",
        "Mac",
        "four to five",
        "Apple",
        "Nilay Patel",
        "WWC",
        "four",
        "McDonald",
        "UX",
        "29 hours",
        "today",
        "Alexa",
        "Red Eye",
        "this Google Zero",
        "XPS 13",
        "Abraham Lincoln",
        "Vern",
        "Kevin Russ",
        "Cranz",
        "Andy Hawkins",
        "Mira Murati",
        "AGI",
        "Kevin Russ's",
        "tonight",
        "Google Day",
        "their Spring Event",
        "years",
        "Alan Grant",
        "Reddit",
        "YouTube",
        "Shield",
        "King Cross",
        "Dakota",
        "Barcelona",
        "half",
        "America",
        "PPSSPP",
        "Apple TV",
        "London",
        "Siri",
        "two",
        "thousand",
        "David",
        "Sunday",
        "Liam",
        "the next 12 to 18 months",
        "next week",
        "earlier this week",
        "20s",
        "SLR",
        "Sony",
        "Google Docs",
        "iPhone",
        "Mac",
        "Sydney Sweeney",
        "Hairpin",
        "100",
        "seven",
        "1/10th",
        "ESI"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "GPE",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "NORP",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "LOC",
        "PERCENT",
        "TIME",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "NORP",
        "TIME",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "GPE",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "LOC",
        "EVENT",
        "PRODUCT",
        "DATE",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "LOC",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "FAC",
        "PERSON",
        "FAC",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "EVENT",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "EVENT",
        "EVENT",
        "DATE",
        "PERSON",
        "NORP",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}