{
    "id": "_B6vtMa-US4",
    "title": "THANK YOU NVIDIA!! - RTX 4060 Ti Review",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-23T13:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=_B6vtMa-US4",
    "category": "Science & Technology",
    "tags": [
        "nvidia",
        "RTX",
        "DLSS",
        "FSR",
        "4060 Ti",
        "8GB VRAM",
        "AMD",
        "Intel",
        "Arc",
        "Radeon",
        "Graphics Card",
        "GPU",
        "128-bit bus",
        "40 series"
    ],
    "views": 2342095,
    "likes": 71045,
    "comments_count": 5351,
    "description": "See what makes Gorgias different from other help desks at   Try Pulseway FREE today, and make IT monitoring simple at:   The 4060 Ti is here, and the rumors are true: it's an 8GB card launching at a time when 8GB of VRAM is barely enough for AAA titles at 1080p. That being said, the raw performance isn't TERRIBLE and they didn't raise the price from the last generation, so... good?  Discuss on the forum:   Buy a Nvidia GeForce RTX 4060 Ti FE Graphics Card:  Buy a XFX Speedster AMD Radeon RX 6700 XT Graphics Card:  Buy an Intel Arc A770 Graphics Card:  Buy a Gigabyte GeForce RTX 4070 Windforce OC Graphics Card:  Buy a ZOTAC GeForce RTX 3060 Ti Twin Edge Graphics Card:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 2:26 1080p 3:26 1440p 4:26 2160p 5:30 Memory 8:06 Power and Thermals 9:00 Pricing 11:28 Outro",
    "description_links": [
        "https://partner.gorgias.com/LTT",
        "https://lmg.gg/LTT23",
        "https://linustechtips.com/topic/1508727-thank-you-nvidia-rtx-4060-ti-review/",
        "https://lmg.gg/7XgQN",
        "https://geni.us/2wmeFZz",
        "https://geni.us/0gSoOAK",
        "https://geni.us/TZKm6lQ",
        "https://geni.us/drA0xm",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I, for one, think we should be grateful to Nvidia for the 4660 Ti. I mean, sure, we've waited over a year for a card that's only 10% faster in rasterized games, and sure, they didn't upgrade the 8GBs of VRAM from last gen, but at least they didn't downgrade it like they did with the memory bus. And besides, it's just $100 more if you want the other 8GBs. That seems totally reasonable when Nvidia's cost is somewhere between $20 and $35. At least you won't have to wait months for the drivers to get good. Okay, that last one wasn't sarcasm, though. There is legitimately a fair bit to like about the RTX 4060 Ti. It supports all of Nvidia's latest ray tracing and AI upscaling bells and whistles. It's much more power efficient than the card that it replaces, and it supports AV1 encoding, which is a huge deal if you stream to YouTube. But you also shouldn't pull the trigger without getting the full story here. There's been a lot of talk lately about how 8GBs of VRAM just isn't enough anymore, and I've got some bad news. It's not FHD at max settings, but only 1080p resolution. \"The Last of Us Remake\" gobbles up a whopping 8.9GBs of video memory, meaning that with an 8GB card, some of that is gonna spill out into your system memory which significantly harms performance. Or even worse, if you have an older system, and not even that old, just one that doesn't support resizable bar, there is no overflow. You simply will need to turn down your graphical settings. And this isn't an isolated problem. We didn't test \"Jedi Survivor\" for our sweep today, but that's another recent game that is reportedly using up to 10GBs of VRAM at 1080p epic settings. Yikes. \"But Linus,\" you might say, \"I don't need epic or ultra settings. They don't even look that much better.\" And you are right. We've even got an entire video about why it's kind of pointless to turn the slider all the way to the max. But here's the thing. Even if trying to fully futureproof is foolish, I'm not talking about some hypothetical future need here. If your card isn't equipped for ultra today, how do you think it's gonna fare in two or three years when ultra is the new medium? Not good. You know what it is good, though? Our new Sticklocks joystick covers. Who needs your sticks getting knocked around when your console or your controller is in your bag? Check 'em out @lttstore.com. With that out of the way, if we look purely at today's performance compared to the rest of Nvidia's lineup, the 4060 Ti looks like a pretty decent buy. It costs 40% less than the RTX 4070, while being only about 20% slower, except in \"The Last of Us,\" probably because of that VRAM issue. With that said, that might be more to do with how bad the 4070 is. If we add some inconvenient truths to our numbers here, the picture gets a little less rosy. AMD has made some very aggressive price cuts to their last gen, and the 6700 XT performs nearly as well, sometimes even beating the 4060 Ti, all while costing about $50 less, and while including 12GBs of VRAM without $100 upcharge. So if all you care about is pure rasterized performance per dollar, you should probably be making the switch to Team Red. But with that being said, there is an efficiency story here that we're gonna get into later. First, I wanna talk about higher resolution gaming. Because even if Nvidia isn't talking about it, because only ray tracing exists for them now, this is a very solid 1440P rasterized gaming card. Most games had 1% lows that were either close to or above 60 FPS at ultra settings with ray racing and DLSS off. Meaning that on a 60 hertz monitor, you can expect a consistently smooth gaming experience. Want even more frames? Hey, just enable DLSS, or turn down your settings to a more modest preset, and you're off to the races. 1440P is just such a great middle ground. It offers a much sharper image compared to 1080p, assuming the same screen size, but without the same major performance hit that comes with 4K. And it also comes with this message from our sponsor. Pulseway. Managing IT systems can be a pain, but with Pulseway's remote monitoring and management software, it's a breeze. You get real-time system monitoring, instant alerts, and audio remediation, all from one platform at any time using any device. Start your free trial today with the link down below. Speaking of 4K, you can, but shouldn't. Some of our results were okay. And if you've got a nice 4K TV nearby, or a secondary 4K monitor, depending on the game and settings, you could expect anywhere as high as 68 FPS average in \"Forza Horizon 5,\" with even ray tracing staying playable, to as low as 11 FPS in cranked out \"Cyberpunk.\" Games, though, who needs them, right? Blender loves Nvidia, and if we only look at this productivity benchmark, the 4060 Ti slots in exactly where you'd expect, but if we take a close-lier look at, say, DaVinci Resolve with AV1, H.264 and H.265, well now we're losing to not only several AMD cards, but sometimes Intel's Arc A770 and, this one hurts the most, even the 3060 Ti. And the worst part, is this isn't isolated. Digging into our SPECviewperf benchmarks, the 6700 XT and the 3060 Ti often come out ahead, or basically on par, with Nvidia's new hotness. But why? Okay, while I often say that the specs for a GPU don't matter, what matters is the performance, sometimes the performance makes no sense and we've gotta dig into the specs to find out why. The 4060 Ti is based on an AD106 Die that boosts up to 2.5 gigahertz with 4352 CUDA cores, 136 4th gen tensor cores, and 34 3rd gen ray tracing cores. All of which sounds sufficiently next gen. What doesn't, is that the 8GBs of VRAM, that we've talked about so much already, is on a 128-bit bus. Compared to the 3060 Ti, which had double that, that is a major cost cutting measure that seems to have significantly harmed the 4060 Ti in memory intensive applications. For context, guys, back in the 600 series days, you had to go all the way down to the 650 Ti, which cost $150, to find such a budget-conscious memory interface. But, to Nvidia's credit, cheap bastards that they are, you can't ignore how well it kept up the majority of the time. And according to Nvidia, this is largely thanks to the 4060 Ti's massively upgraded cache. They claim, and our numbers do bear this out, that it improves performance, reduces latency, and increases power efficiency. So yeah, a narrow bus does limit data transfer speeds to VRAM, and in a perfect world, we wouldn't have to give that up, but the more we can store in the cache instead of VRAM, the better. Now, I'm not a GPU architect, so I can't say this for certain, but it seems like this trade-off might be contributing to better performance in hybrid applications, like gaming while also taking advantage of the 4060 Ti's ray tracing cores and its AI engine. I mean, looking at performance in games with ray tracing, it's clear that this isn't some feature that's tacked on now. It's actually usable. And unless you have $600 to blow on a 4070, this is the best next next-gen gaming experience on the block. And the same goes for when we turn on DLSS AI upscaling, which, in general, turns playable into smooth and smooth into smooth-lier. It isn't perfect. There are still some visual anomalies from time to time, and we did find outliers where performance did not improve. For example, using DLSS 3 in \"Returnal\" resulted in a degraded experience, whether we had frame generation enabled or not. Super bizarre. But it has improved to the point where some games not only look the same and perform better, but will even look better with DLSS. It's definitely a nice-to-have. And what makes it even better, is that the 4060 Ti draws significantly less power than its predecessor, sometimes staying within 140 watts, depending on the game or workload. That is really impressive, and could even be the difference between needing to upgrade your power supply or not needing to upgrade your power supply. This part's anecdotal, we're still waiting on our sound chamber, but in terms of acoustics while gaming, it's no louder than really any other card, which is good, I guess, considering that it only reaches 66 degrees on average during our \"F1 22\" loop with a max temp of 79 on the hotspot. We're gonna have way more concrete testing on GPU noise and thermals down the line, so make sure you stay tuned for more Labs updates. So, then. At $400, is it a good product at a good price? Let me put it this way. When Nvidia CEO, Jensen, told all of his Pascal gamer friends that it's safe to upgrade now, it wasn't. 3060s and 3060 Ti's might as well have been made of unobtainium, but now, honestly, yeah, I agree. The only question, is whether it's safe to upgrade to Nvidia. The 40 series is already a mixed bag, and now the 4060 family looks like it's gonna be similarly all over the map. At $300, the non-Ti version could make sense, but then, if these specs are anything to go by, you're gonna be leaving a lot of performance on the table. Then at $400, we've got good performance, but do you really wanna hamstring yourself with only 8GBs of RAM? And then $500, I mean, gee, that's an awful lot of money to spend on an entry-class cheapo 128-bit GPU that's masquerading as a performance tier card. It seems like Nvidia has just completely decoupled their manufacturing cost from their retail price here. Look no further than the $100 upcharge for 20 bucks of memory. So, if I was a cynic, and I am, I would say that the pricing structure here is just a way of manufacturing FOMO so that you'll upsell yourself to spend more than maybe you should. Thankfully, though, we do still have some competition in the space. If power consumption, ray tracing and DLSS aren't major concerns for you, the 6700 XT from AMD is a compelling option, with more rumored to be coming. And, this one was a big shocker, ARC actually put up a pretty decent fight today, especially if you consider the $350 price. And especially-er if you consider our sponsor. Gorgias. Gorgias Help Desk is a customer support platform that aims to revolutionize the way that businesses interact with their customers. Their single, unified dashboard makes staying organized simpler than ever. We've even utilized Gorgias on lttstore.com to help with our customer support, which is a big part of why it's a lot better lately. A big part of that decision was how easy it is to integrate Gorgias with platforms like Shopify and Facebook. As a business grows, so does their need for efficient and effective customer support. And Gorgias can come in clutch with their automated systems, as well as their insight and analytics tools. And since everything is centralized, you can respond to customer inquiries via email, chat, and social media messages without drowning in a sea of Chrome tabs. Our switch to Gorgias Help Desk was simple, pain-free, and it fit our customer support needs. It's certainly been easier to provide customers with fast and personalized support. So see if they can help you, too, by checking out Gorgias at the link down below. If you guys liked this video, make sure to check out our 4090 coverage. It's super expensive, but it's a really impressive card.",
    "transcript_keywords": [
        "Nvidia",
        "performance",
        "VRAM",
        "ray tracing",
        "Gorgias",
        "card",
        "ray",
        "DLSS",
        "settings",
        "tracing",
        "good",
        "customer support",
        "support",
        "gaming",
        "power",
        "memory",
        "games",
        "ray tracing cores",
        "GPU",
        "customer"
    ],
    "transcript_entity_values": [
        "40",
        "4th",
        "40%",
        "one",
        "10GBs",
        "300",
        "4070",
        "3060s",
        "GPU",
        "79",
        "Gorgias",
        "an AD106 Die",
        "AI",
        "400",
        "FPS",
        "AMD",
        "VRAM",
        "4060 Ti",
        "YouTube",
        "Facebook",
        "Linus",
        "just $100",
        "4352",
        "F1 22",
        "GB",
        "1440P",
        "First",
        "1440P",
        "SPECviewperf",
        "Labs",
        "FOMO",
        "months",
        "4060 Ti's",
        "4",
        "4060",
        "60",
        "650",
        "Returnal",
        "Intel",
        "140 watts",
        "20 bucks",
        "Jensen",
        "8GBs",
        "1080p",
        "FHD",
        "Forza Horizon 5",
        "136",
        "only about 20%",
        "150",
        "8.9GBs",
        "XT",
        "secondary",
        "DLSS",
        "DLSS AI",
        "Shopify",
        "12GBs",
        "as high as",
        "34",
        "600",
        "600 series days",
        "Sticklocks",
        "Pascal",
        "3060",
        "a year",
        "128",
        "6700",
        "DLSS 3",
        "only 10%",
        "Team Red",
        "66 degrees",
        "today",
        "Pulseway",
        "1%",
        "350",
        "DLSS",
        "about $50",
        "4090",
        "CUDA",
        "RAM",
        "8",
        "K TV",
        "The Last of Us",
        "between $20 and $35",
        "AMD",
        "8GBs",
        "Nvidia",
        "two or three years",
        "100",
        "2.5 gigahertz",
        "3rd",
        "500",
        "DaVinci Resolve"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERCENT",
        "MONEY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "PRODUCT",
        "NORP",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "MONEY",
        "PERSON"
    ]
}