{
    "id": "_BkdIqacnKo",
    "title": "Rare iBook G3 Prototype (with WEIRD Bug) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-12-23T16:59:22Z",
    "video_url": "https://www.youtube.com/watch?v=_BkdIqacnKo",
    "category": "Science & Technology",
    "tags": [
        "Rare iBook G3 Prototype (with WEIRD Bug) - Krazy Ken's Tech Misadventures",
        "iBook G3",
        "iBook Prototype",
        "Apple Prototype",
        "Prototype Mac",
        "Mac OS X",
        "Mac OS 9",
        "Mac OS X Tiger",
        "Mac OS Internal",
        "Apple Internal",
        "FireWire",
        "MediMac",
        "Apple Development Team",
        "Rare Mac",
        "Vintage Mac",
        "PowerPC",
        "IBM",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Hrutkay Mods",
        "Computer",
        "Tech",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan"
    ],
    "views": 132872,
    "likes": 4496,
    "comments_count": 177,
    "description": "You can support this channel on Patreon! Link below This rare iBook G3 prototype has some \"features\" that didn't make it to the public release, and it's also running an internal build of Mac OS 9.1 with a WEIRD bug. Get your own autographed Notch Book    Thanks @HrutkayMods for the Mac   Download our epic wallpapers   Check out our rare tech playlist    Support our channel and get cool stuff   Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  0:00 - Introduction 1:02 - FireWire and Stickers 3:37 - Inside / EVT Label 4:37 - Optical Drive Comparison 5:04 - A Cool Thing I Made! 6:00 - Boot Up and Weird Bug 9:47 - Mac OS 9.1 Internal (File System)  #KrazyKen #AppleProductHistoryCC #ComputerClan",
    "description_links": [
        "https://etsy.me/3EhWzfi",
        "https://youtube.com/hrutkaymods",
        "https://thecomputerclan.com/wallpapers",
        "https://bit.ly/clan3zlKXX9",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- It looks like a regular iBook G3 Clamshell, but nope, it's a rare prototype. Let's take a look at this thing. Sponsored by \"The Notch Book\". (upbeat electronic music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken. And like I said earlier, this may look like your regular iBook G3 Clamshell Blueberry, but it is in fact a prototype loaned to me by the awesome Greg Hrutkay from Hrutkay Mods. So thank you very much. So today we're gonna take a look at the outside and look at some of the prototypes features that didn't make it into the retail version. And we'll also look at some of the labels and stickers that are used internally by Apple. Then we'll do a little bit of a tear down to look at some of the stuff on the inside. And then finally, of course, we'll boot it up and it is running a pre-release version of Mac OS 9.1 generously supplied to us from Hap at alittlebytedifferent.com. So the biggest feature difference I would say is the FireWire port. This particular prototype has a FireWire 400 port on it. And some people have tweeted me saying, oh, Ken, iBook G3s had FireWire ports on them in the later versions. Well, yeah, they did. But those later versions didn't come in Blueberry. The Blueberry iBook G3 did not ship with a FireWire port. In fact, when you look at it, the retail version, you see kind of a big gap between the USB port and the headphone jack and well, that's because Apple got rid of a port. They were experimenting with a FireWire port there at one time. So on the backside, we do have a label here. We'll take a look at it in just a sec, and then here's the FCC noncompliance label. So these electronic devices have to be approved by the FCC, but during the prototyping phase, that's not usually a thing that happens. So there's a warning on there saying this has not been certified by the FCC. It's a little faded out, but it is there. So we'll take the battery cover off and reveal some more cool stickers. So Apple Development Team, that's the team that, well, one of the teams that worked on this product, and this is most likely some sort of asset tag that can be scanned so the inventory can be tracked internally. And then we get to the MediMac sticker, which is probably one of my favorite stickers to see on a prototype. But essentially it's an internal team at Apple. This team plays an integral role at forming prototypes and they also provide support. So if there's other people inside the company, maybe an executive or something that's working on a prototype and they're testing it out and they're having problems, they can contact this internal team at apple called MediMac. And over here, this label indicates the types of parts that are inside this unit, because sometimes Apple will test different things in different models. There's even some cool code names on here. So if we look at the processor, which is actually just abbreviated process, we see IBM Sidewinder 466 megahertz. So that's the clock speed of the CPU. And IBM is the maker, but Sidewinder was the code name for this particular type of G3. There's some other items on here too. They also mention certain brands for certain parts. So like the battery is a Sony battery, 1800 milliamp hours. IBM made the LCD, the hard drive, Toshiba six gigabyte. Now you'll see in a sec, this is not the original hard drive that's in here. It actually has an SSD in here right now, with that pre-release version of Mac OS on it. But this original prototype looked like it used a Toshiba six gigabyte hard disc drive. And I always think it's cool to see handwriting on these things because that really gives it that internal prototype feel. So seeing this handwriting right here is really cool. And also on certain prototypes, at least with Apple prototypes, you'll see a tester's name written on here, but out of the sake of privacy, we did tape over that, but there's some handwriting stuff on there as well. So now we'll take a look at the inside just a little bit. So on the iBooks here, you could just pull these little tabs here and the keyboard comes off and we already did some of the work for you. You know, just like in a cooking show, just to speed things up. So what you do here is you pull the tabs, keyboard comes off, the AirPort card would be here. The RAM goes in here and then beneath that on the board here, it says EVT, which stands for engineering validation test. And that's a stage of prototyping where in most cases, generally speaking, you now have a working prototype. It's time to start testing the crap out of it, in a smaller quantity still, but still it's time to start testing things. And the hard drive is installed right here. Now, when Greg received this particular unit, it did not have the original hard drive in it. In fact, even in my experience, when I get prototypes, like the iMac that's chilling back there, it didn't have the original hard drive in there either. The hard drive that was actually in here was circa 2004, but then Greg had decided to put an SSD in here, which I think is really cool, 'cause you can get some of that super speed. So anyway, that's what that is right here. Another prototype part of this unit is the DVD drive. And for comparison, we have a first-generation iBook CD drive. The first gen iBooks only came with a CD drive option, but later there was a DVD drive option for the second gen. However, the DVD drives weren't in Blueberry. So they looked similar except they were in different colors in the future versions. So that's another indicator that this is a prototype part because it's in a color that never went to retail. Now, before he boot this thing up, I just wanted to talk about this cool product I have that's actually available for purchase right now. It's called \"The Notch Book\". Thank you, mysterious disembodied hands. So \"The Notch Book\" is a photo book of Apple products and other tech that have notch shaped things in them. We all like to make fun of Apple and their notch on the iPhone and on the MacBook Pro, but it turns out notches were actually in several Apple designs throughout history. So this is a cool photo book that shows many of them. And there's some other cool things in it, too. There's also a secret code in here that gives you some more bonus stuff. I can't show it to you now, but it is in here, and I will also autograph these. So I have autographed hard cover copies on my Etsy store, right now you can go grab them. There's a nice matte laminated finish on them. So I'm really happy with how it turned out. I hope you like it too. You can go ahead and use the link in the description to go to my Etsy store and grab a copy yourself. And if you're a patron, you also get 10% off. So go ahead and check that out, too. All right. Let's get back to iBook. And while we're testing it out, I actually wanna show you this weird bug, too. When you start booting up into 9.1 internal, this alpha build, the clock speed is read as 600 when it's really 466 and it runs really fricking slow. Okay, so let's go ahead and load up the boot picker. We have Tiger on here, 9.1 internal and 9.2.2. And just to note, it was labeled after the fact, internal, it didn't come that way, but there are some internal documents and file names that we'll take a look at in a sec too. And now we wait for it to start up. We're just waiting for the jellyfish to load here. So let's go to the system profile here quick. And this is what I was talking about earlier. There is a 466 megahertz G3 in here, but with this build of Mac OS 9, it reads as 600. (beeps) Don't beep at me. So right here, processor info, PowerPC G3 machine speed, 600 megahertz. So it kind of sounds like, oh, hey, it's magically faster now. But the weird thing is after you boot into the system and it reads the wrong clock speed, every other system you boot into afterward until you reset the CUDA operates very slowly. And you're about to see how slow I'm talking about. So let's reboot into Tiger here and we're starting up here. Now, keep in mind, this is on an SSD and it's still going kind of slow probably because of that clock speed issue. Now, imagine if we were still on a mechanical spinner, this might take an eternity. So if we go to the menu here and go to about this Mac, you'll also see Tiger indicates 600 megahertz. So now I'm just gonna try to use this system and see how well it operates. Let's just open up a hard drive here. That wasn't a terrible delay, but definitely a little bit more of a noticeable delay. Scrolling seems to be chugging a little bit. Let's try opening some applications. Let's open TenFourFox and system preferences. Okay, yep. I can see where the sluggishness is coming in. We got a beach ball and system preferences' window. There, now it finally showed up. TenFourFox is still bouncing. Okay, so while that's loading, let's just try changing a setting. Let's just look at desktop and screensaver. Some nice delays here. Loading, look how slow that's going. (laughing) That's awesome. Oh, it's just loading up little thumbnails until they got the one. Come on, let's cheer it on. Load those thumbnails, you can do it G3! Load those thumbnails! There we go, we got two! We got two thumbnails, three! Oh my gosh, this is horrible. That's just a great demonstration as to how screwed up the system gets with this internal build. So we have to reset the CUDA with the little switch thing here that's, you gotta use a, oh, thank you, disembodied hands once again. We gotta use a little SIM card tool to poke that thing and reset the CUDA. So let's go ahead and shut down here. So now we'll reset the CUDA switch and hold down the button for 10 seconds. One, two, 10. (humming fanfare) CUDA reset successfully. See, there you go. That's how you know you did it right. All right, so we're starting back in the Mac OS 10. Loading the desktop and there you can see 466 megahertz PowerPC G3. Very fricking weird bug, such is the life of alpha software. So now let's take it for a quick spin and this should be way faster than it was earlier. And go to the desktop and screensaver and load those thumbnails. Still a little slow, but still way faster than before. Let's go to Apple images. Boom, all those showed up immediately. So that was a good test. And back to plants, there they are, just open up more folders in the preferences here. You can see they're loading way quicker than before. Okay, so now let's take a look at the 9.1 internal file system. And to do that, we will boot into 922. Yes, the system is triple-booted. So let's go ahead and do that. So now we're in 922, where we can with speed and efficiency actually browse the file system on the 9.1 internal install. It looks like everything is normal compared to the retail version in these other folders, application system folder, et cetera. The interesting one is the internal installed disc files. And I can't say for sure if certain things in here are unique to an internal build of the system, or if some of these things are actually available to the public, I can't confirm all of that. So take this with a grain of salt. And I've noticed Apple also does this thing where they have a folder with no icon on it. Just to have some text there as like an instruction in the window. For example, in the diagnostic area, they have these instructions here. So the tester or whoever can see that. But really these items are just folders with no icons and you can actually open this up and it just says, it's a folder. Yeah, I'm noticing some things on here I haven't heard of before, like MacTest Pro Emergency. I don't know if these are available to authorized repair places or whatever, or if these are internal only, I have never heard of these before, when you open them, it gives you kind of a diagnostic interface. It closes everything else down. And if it go to the about screen, you can see here MTP Emergency for G3, copyright Apple Computer 1991 to 2000. So that's pretty cool looking. If we go back to this window, you can see Apple's doing the same thing again here, with these folders, except this time it's not a folder, it's a text file and that is really cool. The text file actually says Apple internal use software. That's pretty cool. Now let me check here. I don't remember if I checked this or not, nope. See, there's nothing in these folders. They just put them there for instructions, which I guess is just a MacGyver-y internal way to say, hey, do this, do that. Macintosh software, I wanted to look in here. So the interesting thing is I see these files here, too. And I saw these earlier. I thought it was really fascinating when you open them. This isn't like an Apple branded read me file or anything. This is just some internal thing that one of the employees wrote with this font, this Times New Roman-y font and- Oh, this one's really cool. Look at that. Reminder to Apple employees, temporaries and contractors. So very internally type language there. That is really cool to see. But I just absolutely love this one. Just a little read me with no brand or anything on it. So that begs the question, what is in this guy? 'Cause it is a folder, yep. Oh, hang on. Ooh, 12 kilobytes on a disc for one item. There's something in here. Central STN software. This is a server alias. I'm guessing STN is short for station. Let's see. It's not gonna be able to connect to anything, but I'm just gonna see if we can open it here. But if this was being used internally, you would- yep. You'd be connecting through Apple's network to get to the server. So yeah, let's take a look at where it was pointing. IL1, that must be short for Infinite Loop 1. So at Apple's campus, there's I think six Infinite Loop buildings. And they're labeled aisle one, two, three, four, five, six. Yeah, this must've been some sort of server in the aisle one building. It says fourth. Holy crap, that is really cool. I have been to the campus. I haven't been inside of it, but I have seen the Infinite Loop buildings in person before. And that's really freaking cool. So here's another interesting folder I noticed, servers. Again, not sure how exclusive this is to internal stuff, but there's a bunch of different countries in here. Apple Holland, Germany, France, Cork, and inside of here. Oh, Sydney server's IP. I haven't seen this one, site license software that relates to one of those read me files we were looking at earlier. This looks like it's pointing to aus.sydney ethernet communication server site license software. It's cool that we can still see the server paths, even though I don't see how we could even connect to them at all anymore, but it's still cool that we can see the paths that they were pointing to. Austin, I'm assuming this is referring to Apple's support center in Austin. System software, let's see here. Yep, original path for these shortcuts or these aliases in the Apple Austin folder point to Austin support center. So yeah, this must just be stuff that was all used off of a server from different locations around the world. I don't know what any of this stuff is. I can't open any of it, but you see the icons and you see the original network paths. So that's pretty sweet. So thanks again Greg Hrutkay from Hrutkay Mods for loaning this to me. Feel free to check out his tech channel right here. And also thank you Hap from alittlebytedifferent.com. And feel free to subscribe for more tech episodes coming out all the time. I love making episodes about rare and retro tech, new tech, and of course, scam tech. And hey, if you liked this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "Apple",
        "cool",
        "internal",
        "hard drive",
        "drive",
        "system",
        "thing",
        "prototype",
        "things",
        "hard",
        "original hard drive",
        "Apple Austin folder",
        "speed",
        "folder",
        "open",
        "Notch Book",
        "Apple Development Team",
        "Mac",
        "CUDA",
        "prototypes"
    ],
    "transcript_entity_values": [
        "466 megahertz",
        "G3 Clamshell Blueberry",
        "Sydney",
        "922",
        "IBM",
        "two",
        "SSD",
        "six",
        "The Blueberry iBook G3",
        "six gigabyte",
        "fourth",
        "jack",
        "four",
        "one",
        "Austin",
        "12 kilobytes",
        "G3",
        "Infinite Loop",
        "600 megahertz",
        "iBooks",
        "Austin",
        "9.1",
        "AirPort",
        "Cork",
        "Sidewinder 466 megahertz",
        "1800 milliamp hours",
        "Sony",
        "Apple",
        "Hap",
        "Mac",
        "Loading",
        "five",
        "Apple Development Team",
        "first",
        "MacTest Pro Emergency",
        "Greg",
        "iBook",
        "iMac",
        "G3",
        "Hrutkay Mods",
        "TenFourFox",
        "sec",
        "three",
        "USB",
        "Ken",
        "Apple Austin",
        "FireWire",
        "the MacBook Pro",
        "MediMac",
        "Times",
        "MacGyver",
        "Etsy",
        "Tiger",
        "Apple Holland",
        "600",
        "today",
        "Germany",
        "Krazy Ken",
        "Blueberry",
        "The Notch Book",
        "France",
        "CPU",
        "CUDA",
        "10",
        "Sidewinder",
        "FCC",
        "Toshiba",
        "iPhone",
        "Apple Computer",
        "Greg Hrutkay",
        "10%",
        "400",
        "Mac",
        "Macintosh",
        "iBook G3 Clamshell",
        "LCD",
        "10 seconds",
        "RAM",
        "Infinite Loop 1",
        "466",
        "One",
        "second",
        "New Roman",
        "466 megahertz",
        "Mac OS 9"
    ],
    "transcript_entity_types": [
        "MONEY",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "PERSON",
        "GPE",
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "QUANTITY",
        "EVENT"
    ]
}