{
    "id": "_DAtbQWIPRk",
    "title": "Apple Buying EA",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-05-29T18:04:21Z",
    "video_url": "https://www.youtube.com/watch?v=_DAtbQWIPRk",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 63363,
    "likes": 2841,
    "comments_count": 230,
    "description": "What if Apple owned Apex Legends and Madden PS5 Pro:  Apple Switch:  Best Handhelds that ARENT the Steam Deck:  15 Laptops BETTER Than the MacBook:  Dumbest Products Apple STILL Sells:  This Tech Is Older than You Think:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Uh oh 0:11 EA is on the Trade Block 0:57 EA is worth HOW MUCH?!?! 1:57 Apple Would Hate EA.. 2:48 Would Apple Fire Andrew Wilson? 4:07 It Makes More Sense for Disney.. 5:10 What about Amazon..? 6:20 EA Would be Available on Luna 7:28 Disney Could Own Star Wars Devs.. 8:37 Will EA Games be on Apple Arcade? 9:17 What If Apple Removed the Microtransactions.. 10:26 Its Not the Game That Makes Money 11:37 What Do You Think?",
    "description_links": [
        "https://youtu.be/f9KdYp0upfE",
        "https://youtu.be/fcTtxeBgvNs",
        "https://youtu.be/0CZ9y9Tj8aw",
        "https://youtu.be/kLpsDyKBCqE",
        "https://youtu.be/-2syLrlgiqo",
        "https://youtu.be/T7MBROCaVGQ",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Hello and welcome to \"This Is.\" - Oh, that happened. - What? - Hello and welcome to \"This Is.\" Our air conditioning's out, and we some hot news here for ya. - It's spicy in here. - So EA is on the trade block and by trade block, I mean someone wants to buy them. - The rumor mill is ridiculous right now. - Apparently they wanna get bought. - Yeah. - So they're the ones who are looking for a suitor. - Yeah, they're actively soliciting bids from pretty much all the big names out there. Amazon, Comcast, Disney. Apparently they actually got fairly close to a deal with NBC Universal, which is kinda what kicked this whole thing off. And it's something that we've talked about multiple times on \"This Is,\" in fact if we can do a little flashback sequence to us being right about how that would kick off a wave of mergers. - I have a feeling that we'll end up talking about this several more times. We're at the start of this massive arms race. I think that 67 billion is just the beginning - Now, even EA, one of the absolute biggest gaming companies in the world is actively trying to be sold. - So apparently EA's market cap is currently $37.62 billion. - Wow, I always think EA is actually a lot bigger, but to be fair they did just lose the FIFA thing that kind of started to crumble a little bit, also Battlefield I think has had a rough few years, whereas Call of Duty breaks in piles of cash for Activision. - So as far as like people who might buy these. - Yeah. - The reason I think Apple makes the least amount of sense is because their whole philosophies are so incompatible. - I agree. - Every one of EA games is just built around micro transactions. - Which is a very profitable business model, to be fair. - Yes. - Now the thing is when a big company like this goes up for sale, it is one of those things where you're gonna hear a lot of rumors about different companies kicking the tires, right? Someone from Apple's like, you know what? We're gonna take a meeting, we're gonna do an exploratory kind of thing. It doesn't necessarily mean that anything serious will happen, but there's only so many companies in the world who could buy a 30 something billion dollar company like EA, right? So everyone's gonna at least be curious to kick the tires on it. - If their whole business model is micro transactions. - Yep. Mostly. - Apple's whole thing has been anti micro transaction with Apple Arcade. One thing I want to be clear on with someone buying EA, or any of these companies buying EA, it doesn't necessarily mean oh, NBC or Comcast, whatever is gonna start their own streaming game service. Not every game acquisition is gonna mean, oh we're gonna put this into Apple Arcade, or we're gonna put this into Disney Plus. I think Disney makes the most sense to buy EA, just because so much of their IP has been like \"Star Wars.\" - I think there's a couple ways of looking at this, right? There's two big questions when a big rumor like EA, which again, one of the absolute biggest gaming companies in the world is potentially up for sale. First of all, will it happen? Second of all, who would actually be interested? When you look at a business like EA, there's no scenario in which even if Apple or any of these other companies buy it. Immediately, EA is all just like rolled into Apple Arcade. So they have specifically said that if they get sold, that they want their CEO to remain in charge of EA. The way that Sony has bought Bungee, of just like, Bungee's gonna continue to be autonomous. We're gonna keep doing our own thing. We're just gonna be under the Sony umbrella. - [Man] Right. - That is exactly what EA is looking for, as far as being acquired. Some of the motivations for a deal like this partially is obviously the stock market is down quite a bit, so if you're a big company and you're sitting on a fat stack of cash, you're going for a shopping spree. You're like, you know what? I can buy EA at a bargain price, relatively speaking. No one who would buy EA is just gonna buy it and sit on it, right? Everyone's gonna be able to try to find like, oh, we can incorporate some EA exclusives on our service or whatever. It's one of those things where if a deal like this were to happen, there's a lot of ways that a company can look at EA and go, oh, we can, you know, take this license, we can do this, that. But generally speaking, I don't think regardless of what happens with EA being sold, it's going to make a huge difference to you, the gamer, right? It's easy to make these sort of big apocalyptic things of EA is gonna be molded down into the Apex Legends machine or whatever. That kind of stuff I don't think is going to happen, but what I do think is very likely to happen is that someone will buy EA. It's not a guarantee. Again, these are big, big numbers, and there's only a handful of companies on earth who can really feasibly try to actually make a purchase like this, but all of them are super fascinating to think about. - Where I think the bit that makes sense for Disney to buy these is how many of these IPs that they have. - [Man] Yeah. - Are good ideas for movies. - Ooh. - For TV shows. - That's a good thought. Yeah, yeah. - So when Sony bought Bungee, that was why I thought they bought 'em. Bungee wanted to break into more television and movies. - Yeah. - Not gaming. Look at these IPs that would make amazing TV shows. - Okay. - Mass Effect? - Yep. - That'd make a great TV show. - Yep. - Apex Legends could make a pretty good one. - I think so. - I would watch the crap out of a Sims show. - What? - Yeah. - What would a Sims show be? - That would be an hilarious sitcom. They're making a damn Barbie movie. - Wouldn't the whole movie have to be Simlish? - Yeah. No. (man laughing) - What if we actually break down each of these companies and what it would look like if they were to purchase EA? Disney, I don't think they have the strongest gaming arm. Obviously, Disney does have a publishing arm, they have games, but they've never been all that interested in gaming. But I think you have a great point that there are a lot of interesting IPs and projects that they could take from EA. Now I think one of the things that I think is more interesting than Disney specifically is the Amazon model, 'cause Amazon are sitting on again, a fat pile of cash and they could pick up EA at somewhat of a bargain. - Are we call 'em 37 billion a bargain? I mean, we don't know what the purchase price is because there hasn't been talked. - Of course. - But like right now the market cap is 37 billion. The reason I'm asking this is because you look at how wide these numbers have been over the past couple years. Take-Two bot Zynga for 12.7 billion. Microsoft bought Activation Blizzard for 69 billion. - [Man] Nice. - But then here's the thing, EA has been over the last few years, buying their own studios. - [Man] I will tell you just looking at the stock price, right? EA has generally been trending down over the last year or so. Obviously, has spiked it massively because there are thoughts about an acquisition. - Right. - Just the idea of an acquisition will mess up the price. But yeah, I think that 40 billion range is reasonable. Certainly less than the almost $70 billion of Activation, but that's a very, very large pile of cash, but we live in a world where there are a lot of companies such as Apple, such as Amazon, who probably sitting on that kind of cash. For Amazon, I think there's a lot of ways that EA couldn't make sense. They've clearly been super interested in the gaming space for a number of years. - For the three people who know what Luna is, I'll tell you what it is for the rest of you. The way that Luna was pitched would be a game streaming service. It's basically cable. You have channels. - [Man] Yes. - So you might have like the Ubisoft channel. What is essentially is EA Play right now, the existing service would just be a channel on Luna. - So they would have the gaming, streaming side of things, and they also have the Twitch integration, the aspirations. If you've got an as giant company like EA behind you, then Amazon are suddenly much more interested in throwing their weight around, making their own console, making those own service. There's a lot of things they could do. They would instantly own Origin, for example. The con here, and I think what maybe breaks this a little bit is that while Amazon could do it, all these things feel like they're very sort of tangential, almost feels like this would just be a new business, right? Because you think about Amazon, they make an enormous amount of money on eCommerce. You can imagine that, oh, you know what? Amazon is just this massive conglomerate who have all these different arms. Now they have one of the biggest gaming companies in the world, in addition to one of the biggest eCommerce. You can see kind of how that becomes sort of some evil Megacorp in 50 years as they keep kind of expanding like that, but I think Amazon does make sense here because they've got some cash, and I think they're motivated to make something like this happen. - I agree with everything you're saying. I do think it makes a lot of sense for EA to go to Amazon. The reason I'm gonna argue again for Disney is, well, they have a lot of \"Star Wars\" franchises with like \"Jedi Fallen Order\" and \"Battlefront.\" If Disney owned the main studio that has been producing \"Star Wars\" games, that franchising opportunity for those just expands that much more. - But they don't have to buy EA to get the license for their own games back. - No, but it's... - 'Cause if just you really cared, they could buy a couple of smaller studios and just do that themselves. - Yeah, but why start from scratch when you have an established, you know...? Dice has been doing this for a decade at this point. They have this locked in pretty well. They just have the rights and then creative control over everything. - [Man] Yeah. - In a way that they would never have had before, which I think is just better overall for the franchise. - So we've gone through the Disney case, we've gone through the Amazon case. Let's sit here and honestly tell the audience why we think Tim Cook would write a $40 billion cheque for EA. - One, it does make sense because they wanna break into gaming. We literally just did a an episode about how they're building consoles again. If they add EA to their mix, they have a lot of triple a games. - [Man] Yep. - Under their belt. Does it make sense for it to go to Apple Arcade? Probably not. - I think it's a mix. You can imagine, you know, the Mass Effect, you know, remaster part 17 gets ported or whatever. I can assume that the Apple Arcade part would be a significant chunk. I can also assume that this would massively bolster the ambitions of Apple's gaming team, right? The biggest downside to this for Apple, in my opinion, is the fact that EA and honestly, a lot of gaming companies, tend to have a little bit of a toxic reputation, whether it's the actual employees, or the fans or the culture, and I can't imagine the toxicity of a bunch of Apex fans being an easy thing for Apple to absorb. That's, I think, the biggest thing of like... - Here's what I'm about to pitch would be so delicious. - Oh God. - That I wouldn't even be able to finish. It would be so rich and fluffy. If apple bought EA. - [Man] Yeah. Okay. - And anti EAd it, people's mind would explode. If apple was the white knight that... (man laughing) Because right now Apple is the best place to play some of those old games legally, without having to emulate 'em. - Sure. - For a reasonable price. You could get the entire GTA original trilogy for $6. Imagine Apple buys EA. - Apple bought EA. - All those micro transactions that you have to pay for in Apex, or you have to pay for in Battleground, gone. I do feel like Apple Arcade would have to increase in price. - Of course. - 'Cause right now it's five bucks a month. Again, it's all mobile games. There's no AAA games on Apple Arcade. Which is for five bucks a month, that's fine. But if they were to say like, oh it's gonna be 10 bucks a month, and then suddenly you had all these EA games, which everyone hates because of the micro transaction. What if Apple is the white knight in that scenario? - The thing is- - People would lose their mind. - They could do it. The downside would be that without micro transactions, how does a game like Apex actually make money? Which would be my big concern. - It's not the game that's making money for Apple. It's the ecosystem, it's the subscription, it's getting you onto the App Store for whatever other purchases you do. It makes them a legitimate player in the gaming space. I'm gonna bring up Balloons again, like I do every video that we talk about games. Balloons, if you go on Steam, has a lot of micro transactions. - Right. - You can easily go and drop 20, 30, $40 in Balloons right now and not unlock everything. Which is cool, if you wanna pay to win, blah, blah. However, I can go on my Mac right now, download it and not pay a cent for anything. - I mostly agree with you, Matt. I think that there are some things there, but also I think this would be an incredibly complicated, difficult thing for Apple or anyone to try to unwind, because this business model is a business model that has enabled a $37 billion company to exist and make a profit. - I also don't think it's a one size fits all. - Yeah. - Like Apex maybe goes on Apple Arcade. - [Man] Sure. - But then whatever FIFA, yeah, (indistinct chatter) that stays because the teams that you build, like, you know, the legacy teams, stuff like that, maybe those are still based on micro transaction, and you're still making those. But now, again if Apple buys it, you're buying it through the App Store. - My big question is this. Should we liquidate the entire next 47 centuries of \"This Is\" budget and put it all on the line and make a bid for EA? - We can't even afford to keep the lights on, or the air conditioning on. - It is currently 90 degrees or 32 degrees Celsius right now because that's how dedicated we are to bring you the hottest, latest news. So thank you for your subscription. Thank you for your view, and until next time, Matt. We appreciate you and we love you dearly. Unlike EA apparently. (upbeat music)",
    "transcript_keywords": [
        "Apple",
        "Apple Arcade",
        "Amazon",
        "make",
        "Yeah",
        "Disney",
        "thing",
        "buy",
        "lot",
        "gaming",
        "Arcade",
        "companies",
        "Apple buys",
        "billion",
        "games",
        "things",
        "big",
        "gaming companies",
        "apple bought",
        "make sense"
    ],
    "transcript_entity_values": [
        "Luna",
        "Activation Blizzard",
        "40 billion",
        "three",
        "$37 billion",
        "Battlefront",
        "the last few years",
        "69 billion",
        "Sims",
        "Apple Arcade",
        "20",
        "Zynga",
        "One",
        "Bungee",
        "67 billion",
        "Microsoft",
        "50 years",
        "30",
        "Call of Duty",
        "Second",
        "32 degrees Celsius",
        "GTA",
        "Barbie",
        "a number of years",
        "$40 billion",
        "37 billion",
        "NBC Universal",
        "the beginning - Now",
        "Matt",
        "AAA",
        "10 bucks",
        "EA",
        "eCommerce",
        "IP",
        "Megacorp",
        "Comcast",
        "Luna",
        "Twitch",
        "Simlish",
        "Apple Arcade",
        "Sims",
        "a decade",
        "Disney",
        "6",
        "five bucks",
        "90 degrees",
        "Activision",
        "Battleground",
        "Disney Plus",
        "the last year or so",
        "Apex",
        "the past couple years",
        "12.7 billion",
        "Origin",
        "$37.62 billion",
        "First",
        "FIFA",
        "Apex",
        "a cent",
        "37 billion",
        "one",
        "Apple",
        "the App Store",
        "NBC",
        "few years",
        "almost $70 billion",
        "17",
        "Balloons",
        "Tim Cook",
        "Ubisoft",
        "two",
        "Amazon",
        "Apex Legends",
        "40",
        "30 something billion dollar",
        "Sony",
        "Mac"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "MONEY",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "LOC",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON"
    ]
}