{
    "id": "_HCCaUxSdE0",
    "title": "Rivian CEO RJ Scaringe on ramping up R1T production and competing with the Cybertruck",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-10-10T14:00:32Z",
    "video_url": "https://www.youtube.com/watch?v=_HCCaUxSdE0",
    "category": "Science & Technology",
    "tags": [
        "rivian",
        "rj scaringe",
        "rj scaringe interview",
        "electric vehicles",
        "code 2023",
        "code conference",
        "decoder",
        "decoder podcast",
        "nilay patel",
        "cybertruck",
        "tesla",
        "elon musk",
        "ev",
        "transportation",
        "automotive industry",
        "supply chain",
        "ev early adopters",
        "ev companies",
        "technology"
    ],
    "views": 49555,
    "likes": 882,
    "comments_count": 130,
    "description": "Rivian CEO RJ Scaringe kicked off last months Code Conference with a conversation about supply chain challenges, the companys Amazon deal, and whether the R1T will compete with the Cybertruck. #Code2023 #Rivian #EVs   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://www.theverge.com/e/23672708",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "(upbeat music) - Thank you so much for being here, RJ. And for being a relatively late ad, as Casey mentioned, (Nilay laughing) we did have Mary Barra scheduled, but there is a big United Auto Workers strike, which has prevented her from being here. You make cars. What's your view of the labor situation right now? - It's a complex situation for sure, and it's something that we're watching really closely. And for us, we're incredibly focused on ramping production, our facility, building our one products, our consumer products, and our commercial products. And of course, thinking about what comes next, we're building a production facility in Atlanta. So, as we think about labor issues across the country, these are things we certainly are watching. - And there has been a lot of conversation that's maybe some of these new labor costs and the new contracts will actually benefit some of the non-unionized EV companies, not only Rivian, but also maybe Tesla. So, how do you see that? Will it really benefit you if these other companies are paying more? (RJ clears throat) - At the end of the day, customers ultimately need lots of choices and we hope there's lots of products that give customers different form factors, different brands, different features. And so, we're very focused on making sure our products are deeply desirable. They combine a set of features and attributes that's unique. - This is a very nice answer. - And we do that well and we do that well, and regardless. - If GM's costs go up, does that help you out? - I think the co... Certainly, we have to compete on cost. I think the thing we should recognize is that the cost of manufacturing in United States flows into supply chain, it flows into the manufacturers. So, it's a fairly complex and nuanced issue that it's hard to predict how that will play out across the entirety of the supply chain, across the entirety of the industrial complex United States. - Yeah. I was looking at some numbers. It looks like in the first half of this year, you've made as many vehicles as you made in all of 2022. For a minute, it was almost impossible to get an R1T. I would've gotten one, but it was impossible to get. - Yeah. - Is that changing for you? You mentioned you're planning at Atlanta. Are you gonna be able to meet demand? - We still have a really long backlog. It's our number one complaint from customers is that you order a Rivian, and yes, so when am I gonna get it? And it's not next week, it's not next month. In particular for R1S, it's quite the lead time. So, we are really focused on ramping production. It is incredibly high class problem to have, to have this backlog, this immense demand. But we're working to ramp production, to get demand or to get to supply to equal demand. - So, when will you be able to close that gap? - Well, in some ways, it's good to have some backlog. Whether six months to nine months is the ideal amount versus a year and a half. That's how we think about it. But I think we'll always be in a situation where we have some level of backlog. - Yeah. The flip side of this is demand. There's kind of some conventional wisdom out there that the RV early adopters have all done it. And if you look at the market, Ford is discounting Lightnings now. - Yeah. - You had a sale at your plant in Normal. Is that what's happened that the early adopters have all bought in and the mass market's still trying to catch up? - It's interesting. So, I started the company in 2009, and when I first started the idea of electric vehicles becoming something that was every vehicle on the road was this crazy wild thought. And fast forward to today, and it's remarkable that almost every customer that's buying a car, gas, internal combustion or electric, is at least thinking about the fact that if it's an ICE vehicle, this might be my last internal combustion purchase. And so, the fact that electric vehicles have become such a top of mind consideration for every consumer is remarkable. Now, there may not be a form factor or price point or a brand or a product that draws someone in, but we do a lot of looking, we look at this really closely. It's now something that almost everyone is considering or at least thinking about, which is amazing. So, to be in that moment in time where we're seeing this whole transition play out, and whether it plays out over the next 5 years or 15 years, it's gonna play out pretty quickly. And I think the scale of it is sometimes hard to appreciate how massive that's gonna be in terms of what it means from a supply chain point of view, what it means from a societal point of view, air quality point of view. It's gonna be a big shift. - Yeah. You launched into the hottest categories, big pickup trucks, - Yeah. - expensive pickup trucks, expensive SUVs. - Yep, yep. - They're both great cars. I have to ask you. - Mm. - You're about to have a competitor on the horizon here. What do you think of the cyber truck? - I think if you were to think of the Venn diagrams of customers, there's probably not a lot of overlap in terms of... (Nilay chuckles) But I think it's great that a product like that exists in the world. As I said a moment ago, if we really truly wanna electrify everything that's produced, and to give this some scale, there's one and a half billion cars in a planet. We as a planet produce about 90 million a year. Customers want lots of different things. - Yeah. - So, we need to have a choice, we need to have variety. So, it's great to see something that's so different that's there. And I hope there's lots of different choices that give lots of different types of customers things- - But you own the high-end electric pickup market. There's very few competitors to- - We're one of the largest, we have one of the largest market shares at vehicles over $70,000. So, we're extremely successful with our flagship product. But I do think it's important, often in the context of like the tech space, we think of a single winner or maybe a small set of winners. And transportation, by definition, there needs to be many winners. So, there needs to be 20 to 25 successful auto manufacturers building electric connected vehicles. And so, our success doesn't require someone else's failure and vice versa. And it's just very different than when you think about traditional big tech where there's one or two really highly concentrated winners. - You haven't shot into a meeting room and been like, this triangle's gonna kill us. - No, no. - And you think one big wiper, how do you feel about one big wiper? (attendees laughing) Is this the future? - I think if you like that, (Nilay laughing) it's good, yeah. (everybody laughing) - I'm very curious how that wiper goes. - Nilay's a car guy. He obviously loves the cars. (Nilay laughing) What I'm really curious about your business is the whole other side of your business. In so many ways, yes, you are competing directly with Tesla, but you're also playing a very different game with your fleet business. And the fact that you have this enterprise deal with Amazon, how much of your business, both now and the future, do you expect this enterprise business to be? And what's the split now and what will the split be in a couple years? - Yeah, as you said, when we went about building the company, we made a decision to invest really heavily and vertically in integrating a lot of technologies. So, we own all the electronics in the vehicle, so all the computers, we design and build. The software stack that sit on top of them. And then, the propulsion layer, the high voltage layer within the vehicle, we control as well. And so, that investment, we said, how do we leverage this as much as possible? So, we have a consumer side of the business. And then, as you noted, the commercial side with really an anchor customer fuel with Amazon. And so, being able to have that large single customer to start allowed us to really think more than just the vehicle, but how does that extend into the vehicle as a part of Amazon's business? And we designed a whole bunch of smart, what we call FleetOS, but basically software platforms that allow us to run those vehicles more efficiently. When they charge, how they charge, predictive service. We do a whole host of things around the driver. And it's an amazing platform that allows the operator, in this case Amazon, to be much more efficient. And to be able to develop that toolset or that platform with really active, and I mean really active feedback from our friends at Amazon, was outstanding, because it allowed us to get it robust and get it to a point where, of course we wanna sell this to lots of other enterprises, as you said. So, we're excited about the enterprise space. It's certainly not as big of a market as the consumer space, but it's a very different market in that we see it as quickly going to Software as a Service platforms, where you have these types of things like FleetOS. - It's not as big of a market in terms of the number of vehicles on the road, but it could be a market that you would have bigger market share of. Ultimately, do you think that'll be a bigger piece of your business than the consumer business? - We think the consumer will still represent a larger slice. We've typically think of it as about 80% of our business will be consumer, but the commercial space to also point out, it's an opportunity to have huge impact. So, one commercial van being replaced with one of ours, the vehicles are there all day, they're no longer idling. So, when you think of it from a carbon point of view, it's like, has a 10x multiplier. So, 1 van is worth 10 consumer vehicles. - Do you have any other deals you wanna announce beyond your Amazon deal? - Well, that'd be fun, but I don't have any to... (Julia chuckles) Not gonna say anything today. - To me, what's so interesting about the software, and you have driver assist and you have the potential it seems like, to really have more autonomy and autonomous technology in these big vans. But I'm curious both your approach to autonomy and also what you're learning from these vans that are out there now from that software, from all the feedback you're getting from Amazon, that you're able to use and bring to the consumer product. - Yeah, if you were to think about or contemplate what's an ideal fleet of vehicles to run or operate as a learning platform that would benefit us as a technology company, you'd design something that looks almost identical to our relationship with Amazon. It's a highly concentrated fleet in the sense that there's one customer, we have complete visibility in how the fleet's being used. The vehicles leave and depart from the same location every day. So, things like data being pulled off the vehicles very straightforward. And you'd have a very deep relationship with that customer, so that there's free movement of data back and forth in terms of feedback and use cases. So, we have all that. And so, that benefits all sorts of things within the vehicle. It benefits our diagnostics platform, which is predictive and AI elements built into it. It benefits our self-driving platform from a perception, feeding our perception learning platform. And then, as we think broadly and long-term about what we're building in our self-driving platform, we've taken the approach and what we'll be introducing in future variances is a very thoughtfully laid out set of sensors that drives a perception stack that's drives very early fusion and it allows us to upgrade sensors while maintaining the platform over time. Because we see a lot of progress happening in the sensor space. We see cameras getting better. We see radars getting cheaper and better. We see new sensing modalities coming into the space. But being able to create an early fusion process whereby that feeds an ever-improving compute stack is really powerful, and it's hard to fully appreciate just how much that's gonna evolve over the next five years. - So, you're describing, you keep saying platform. And then, thinking of a car as a platform, you have a big enterprise customer that's a great recurring revenue stream. That's a business you can build at scale. You can get potentially software style margins on that kind of business. A lot of that is coming to the consumer side as well. - [RJ] For sure. Yeah. - We see attempts to build recurring revenue into all kinds of new cars. - Yeah. - I think BMW famously was gonna charge a monthly fee for heated seats. - [RJ] Yeah. - Which I think is just like, they just moved the Overton window, so then anything else they did sounded less evil. Is this something you think about with your... Because you don't have any of that stuff baked in the car right now? - Yeah, I think in the commercial space, the path to recurring revenue models is really clear, 'cause businesses are doing - Yeah. - TCO analyses. They really understand their cost structure. So, if you can provide cost savings through a software platform, it's an easy sale. In the consumer space, we have a philosophy we deeply hold as we think about this, as we wouldn't want to charge features, charge customers for features that are like a binary on/off. So, like a heated seat is a real example, 'cause we're not working that hard on that software. (Nilay laughing) - [Julia] Yeah. - So, we think there's an opportunity to charge customers where there's like significant amount of ongoing R&D associated with a feature set. And the market's proven this as well, where you see in the self-driving space where customers are willing to pay more for enhanced features that are software-enabled. But those software-enabled features are not like a binary on/off. They're hundreds of engineers working around the clock to make a feature set stronger and better. And so, that's how we think about it. I think that we're gonna see an evolution of that over the next five years where some of these early ideas of how you monetize things on a variable basis will disappear and we'll realize customers won't put up with that. It'll just be table stakes, cars have heated seats, for example. (Nilay laughing) But I think some of these heavy ongoing R&D efforts, we'll start to- - So, you're gonna do subscription products in Rivian vehicles? - Yeah, I think I... Well, so we're certainly planning that in future products. We also, we believe that's gonna be really the ongoing model. - But things like autonomy or driver assist or what do you think those features will be? - I think for us today, I think what we're beginning to see is consumers start to become more and more comfortable with autonomy. And this topic we say autonomy and I could say level two, level three, level four, there's all these different levels. It's actually a very confusing topic to folks that aren't deep into the technology space. And we paint with a really broad brush, this idea of autonomy where everything is like, we look at everything as if it's the same. The reality is there's very different sensor set topologies, compute topologies for very different use cases. So, a level four, robotaxis, so a vehicle that doesn't have anybody in the front seat, has a very different, and by the way, much more expensive sensor set than something that you can purchase and drive and what you might think of as like a level two or a level three. And so, what we launched with was a level two system. You can drive on the highway, the vehicle's capable. We're of course working on things that are significantly more capable than that. And as we launch those hardware platforms, we'll launch them with enhanced ways to access them as well. - Do you think... Actually, I love asking (indistinct) this question. How long until you ship a car without a steering wheel? - Us? - Yeah. - That's not in our roadmap today. I think the challenge of a vehicle without a steering wheel is it ends up with a relatively constrained set of use cases where as a robotaxi in an urban environment within a geofenced set of domains, it can work really well, but if you want to take that vehicle to let's say, Montana, it's very hard, because those roads are much harder. And a lot of those pathways to get there are gonna be much harder to qualify. So, I think much like battery size creates strength anxiety, I think removal of a steering wheel creates steering anxiety. Like you wouldn't be able (Nilay laughing) to go beyond a tethered set of roads that it's validated for. So, I think robotaxis makes sense, but for consumer-owned vehicle, it's gonna be challenging. - Speaking of steering wheel anxiety, we should talk about range anxiety. (Nilay laughing) And this whole question of whether or not the lack of charging stations and real charging station infrastructure, as well as the fact that cars are still range-limited. And obviously, the ranges have gone up, but that could be a key factor that's preventing consumers from making the switch to EVs. - Yeah. - How do you see that changing? - One of the things that we have to recognize is we're still in the really early days of the world electrifying. So, the vast majority of consumers haven't even been in an electric vehicle. And more than that, they haven't fully appreciated the charging dynamics. One of the things I love to remind consumers of is most of your charging is done at home. So, depending on the brand, it's around 90% of your charging is done at home. And so, that 5 to 10% of charging that's not at home is the road trip or the off chance that you weren't able to fully charge at home, you need to pick up charge somewhere else. The reason that's important is it's a very different dynamic than what we have with gas stations today, where gas stations, 100% of them are providing your fuel. Very, very few people have their own gas station at the house. (Nilay laughing) So, the dynamics are you just go to charging stations far less than you think and the number of charging stations that are needed to connect the map is lower than what we would think as well, because we don't have to replicate what we saw with fuel stations. - This is the answer that I've heard pretty often, but there's been a big change in the market recently. It seems like Ford agreed to use the Tesla connector and the rest of the market. - Yep. - You all agreed, but basically, everyone's using it now. - [RJ] Yeah. - What was that conversation like? It was just everyone's doing it, we're doing it too? Or was it a more collective decision? - How long do you have? This is a complex one. So, the- - You got all the rest for this, we got all- - Yeah, I think that there's a few things to think about. So, first, there's the charging adapter or the charging port design. - Yeah. - So, Tesla developed a really elegantly laid out AC/DC integrated charging connector, which was different than the standard that every manufacturer was using including ourselves, which was called the CCS standard. And we originally selected CCS, because it was the one that everyone had, the industry was moving towards and it made sense to be on a platform that others were using. But many of us, many manufacturers, ourselves included, said, boy, that's a nice connector that Tesla has. (Nilay chuckles) It's smaller. And so, a lot of discussions amongst us and Tesla and Tesla and other manufacturers ensued. And not surprisingly, we arrive, or not, now very evidently, we arrived at let's use that connector and as part of that, gain access to the network. In our case, it's a bit unique, because we're also building a charging network. So, today, we have, if you look at Tesla's a thousand plus supercharger stations in the United States, we have 50. So, we're in the early days of building our network, but the number of charging stations necessary to create really useful density, meaning I can drive from, let's say here to San Francisco or San Francisco to Jackson Hole, is not as large as you'd think. So, with a few hundred charging stations, you can essentially connect most of the dots in the map, and then you're infilling. Then, you're adding stations to create density to deal with the size of the car park. So, one of the things that us making the switch to NACS really also enables. NACS is what Tesla's called their charging connector design. So, North American Charging Standard, is it allows us to actually have Teslas utilize our charging network as well. And why is that important? It allows us to make the network profitable much quicker. So, with about four charging events per location, a location becomes profitable. And the challenge of building a network like this, it's a huge investment, call it a billion-dollar investment. But in the beginning, you don't have a car park, you don't have a lot of cars to use it, so it's underutilized. So, if you can pull other vehicles onto that network, it very quickly becomes profitable, allows you to build it faster. So, that was the logic. And so, what we think is gonna happen over the next five years as we think there's gonna be a relatively small number of networks, charging networks that become primary or dominant networks. Tesla we think will be one of them. Of course, we think we will be one of them. But surprisingly, there hasn't been other third party networks that have really done a great job, to be honest. - [Nilay] Yeah. - The uptime is poor. The payment platforms are challenging to say the least. Locations are highly compromised. So, we think to the point that was made, we have real work to do to build the network out, but it's something we're really investing heavily in. - So, Tesla calls it NACS. They say it's a standard. I'm a standards nerd. To use their connector, you wanted access to their charging station. Are there deal terms here or is it actually, okay, we're just gonna use the standard? - There's been all sorts of incorrect postulation around what that deal looks like. - Clear it up. - It's very simple. We agreed to use a connector. And as part of that, we also agreed to have access to the network, but there's not data exchange or anything like that. It's access to a network and access to what has become now an open charging standard, which is the NACS adapter design. - Before we open up to questions and we are gonna have questions, so you can start thinking about those microphones there. I wanna dig in a little bit deeper on sustainability. There are a lot of questions still about the sustainability of the batteries themselves in Evs, - Yeah. - and then also questions about the supply chain and reliance on China for some of these materials. - [RJ] Yeah. - What can you tell us about your own ability to be independent, - Yeah. - energy-independent, if you will, from some of these supply chain issues in China? - I love this question. I think there's a lot of... First, there's a lot of misinformation that's been put into the world around the carbon efficiency of an electric vehicle or the efficacy of an electric vehicle in terms of driving a path towards carbon neutrality. But in putting that aside, and I'll come back to that, I think it's helpful just to zoom out for a moment, take a big step back. And if we look at how our planet runs today, we built a massive, massive industrial complex, as we think about the way we're sitting in a room with lights and condition air. We drove in cars, flown planes. That whole system's been built in the last roughly call it 120 years. And it's been built on a platform that relies on hundreds of millions of years of accumulated carbon largely from plants that accumulated on the surface of the earth over half a billion years. And we as a society have used, depending on if it's a liquid (audio breaks) fuel, somewhere between 40 and 50% of that in a couple of generations. So, if we wanna continue living the lifestyle that we live as a planet, we could continue keep our heads down just status quo and we will run out of a finite supply of fuel. It will happen. This is not a debate. We know there's a finite supply of liquid fuel and solid fuel in the planet. And in the process, put all that carbon back into the atmosphere and create real substantial climate risk for us as a planet and therefore as a species. Or we can do what we will eventually have to do undeniably, which is to switch to renewable energy. And ultimately energy that largely comes from the sun. We'll harvest some from the wind, which is just an indirect source of solar power. And so, we have to do that and it's, I think it is the ultimate challenge. And how lucky are all of we to be alive in that transition period that you can imagine history books 500 years from now, they're gonna look at this moment and say, this generation, the 2020s, the 2030s, the 2040s when we really switched how we ran the planet. And so, the reason I give that context, the scale of this transition is huge. We're burning a thousand barrels of oil a second roughly. Just think about the scale, a thousand barrels of oil a second. And we have to take that whole giant massive industry and convert it to something that's running on renewable energy and storing renewable energy. And so, it's hard. There's no perfect answer. There's not a solution that's immediately carbon-neutral. So, that means we're building electric vehicles with, that are built with batteries, that have challenging supply chains. The supply chains may not be the most sustainable, but it is a path to a future state. - But what about your batteries and your supply chain? - So, that was my long answer to just say, (Nilay laughing) this is a must do for us as society is to move to sustainable energy. I think that the thing to recognize is on all of us, on us, Rivian as a company, myself as a leader of the company, folks that are in this space, we have to go build supply chains. We have to build new businesses. And so, in the battery space, it's complex. It's complex, because the materials we need aren't always in the places we'd like. So, 90% of the world's nickel comes from Indonesia. That's a fact. We could try really hard to hunt for nickel in places in the United States, we may find some, but to recreate the nickel supply chain will take decades. And so, that means policy plays a huge part. Trade agreements play a huge part. Relationships and partnerships with other businesses. And it's not simple. It's very complex. - But so, how much of your battery in the components come from China? - Ah. Well, it's fairly complex. So, if we think of, depending on the battery cell chemistry, so in our R1 products, - Yeah. - we use a high nickel cell. Most of that material comes from outside of China. But there's a lot of supply that exists in China. So, this is a real challenge for us as a country is to think about as the number of electric vehicles in the road grows, we need to find ways to either build relationships with China or to build supply chains that exist outside of China. But it needs to be built. It doesn't exist today, especially with lithium. - Yeah, I'd like to invite people to come up to the microphones, ask questions. And as they line up, my quick question to you is what do you say to people who say, oh, electric vehicles are just as bad for the environment, because of the batteries? - Well, that was the point I was making is if you were to do a carbon analysis on this and do it honestly, an electric vehicle is significantly more efficient from a carbon point of view and an energy point of view than a combustion vehicle. And even with today's grid, and the reason I point out that last point is what's really cool about an electric vehicle is you buy an electric vehicle today and it's four or five times, depending on the vehicle type, more efficient in terms of energy and in terms of carbon than its gas comparison. But it gets better over time, 'cause the grid keeps getting cleaner and cleaner and cleaner. So, 10 years from now, it'll be even cleaner. 20 years from now, it'll be even cleaner. And so, what we have to be really thoughtful of as a society is this is a transitional moment. I really wish we could pull a lever (Nilay laughing) and immediately be perfect carbon-neutral, car companies, supply chains, energy grid infrastructure. But it's not possible. There's 8,500 coal power plants in the world, all of which, hopefully in my lifetime, get turned off. But we're talking trillions of dollars embedded investment that needs to be turned off. So, this is a long lever we're gonna have to pull (Nilay laughing) to transition. But I really do hope it's a lever that gets pulled over the course of my life. - Yeah. Please introduce yourself. Ask a question. - Hi, my name's Jay Peters. I'm with \"The Verge\". The problem with most EVs right now, or a huge problem is that they're just too expensive. - Yeah. - So, how do you eliminate costs from production to make a truly affordable EV? Like how do we get a Toyota Camry of EVs? - Yeah. Julie asked about it that battery supply chain has lots of challenges from a geopolitical point of view, from a capacity to create enough supply. But a big part of that is also the cost. And the biggest cost difference between a electric vehicle and a combustion vehicle is the cost of the battery. And we're talking, depending on the size, it's 8, 9, $10,000 in battery. So, this is a core focus for us. It ties really heavily into where you get the raw materials from. About 75% of the cost of the battery is just raw materials. So, that is ultimately what we'll have to do is we have to take a lot of costs out of the battery. And the reason you see most electric vehicles starting at higher price points is this is, as all of you know so well, this is very typical for a technology curve. You'd see the initial products that are embodying new technology coming in at the high end, and then over time, iterating to introduce lower cost variants. So, for us, we launched with our flagship products. Next, we bring on something that's more moderately priced and we hope to continue driving down that cost curve. - How long do you think into the mass market affordable level though? Like if you had to give an estimate? - I think in this decade, we're gonna see, like in the next handful of years, we're gonna see some very interesting products across all the price ranges, for sure. - [Jay] Thank you. Yeah. - Hi there. Thanks for coming in and taking Mary's place. My name is Joy. I own a solar company in Arizona. So, I had two questions in my mind. One is vehicle to grid and connecting solar into the battery side. But then, I also serve on our fire advisory board as the chair. So, I'm gonna lean to fire and first responder protection. What we've seen, at least in Phoenix and when I follow it, is electric vehicles basically have to be put into a container if they catch on fire. - Yeah. - Put into a container filled up with sand and you hope the stranded energy depletes by the time you move the sand out or it'll reignite. So, we have tow trucks that are being caused problems, re-ignition. So, my curiosity is just where is Rivian in that conversation with first responders and how are we going to be dealing with this very real issue? - Great. So, to answer the latter question first. So, there's a perception that electric vehicles have a higher frequency of fires or higher frequency of issues where you have to involve putting them in a container, as you pointed out. It's obviously manufacture-dependent, vehicle-dependent, but it's a much, statistically, it happens far less than in a combustion vehicle. Now, when it does happen, as you said, you have a lot of energy in a battery that needs to be managed. And so, this is a core focus of how we design the battery pack. And essentially, preventing the ignition of not just one cell, but preventing it from propagating across all the cells. And this is important for us. We've haven't had a single instance where a vehicle has had a fire that's related to the battery pack. There's been fires for other reasons. Often, or the ones that you'll see is the charger started on fire, and then jumped to the vehicle. But we've put such a huge emphasis in this and I think what we're gonna start to see across all manufacturers is more consistency with how important, how much importance is placed on that. Some of the early vehicles that were developed by their manufacturers didn't have that same level of focus, and therefore had more frequent fires, and therefore led to some of the perceptions that you've spoken to. On the grid point, this is wonderfully interesting, because our grid today, we talk about the grid and when you say grid, it makes it sound like there's some sophisticated supply-demand matching, (Nilay laughing) and that's not what it is. It's largely a system of wires connected to a bunch of power generation sites. And the vast majority of those power generation sites are running on spinning turbines, either direct from a gas turbine like natural gas or through steam that's generated from burning coal. And in a few cases, steam that's generated through nuclear action. As we move to more and more solar, you remove spinning turbines. And the spinning turbines have a wonderful benefit, which isn't talked about enough if they have physical inertia. So, they provide the grid stability. It's embedded with like physicality of inertia. And when you take inertia out, the grid becomes inherently less stable, because again, there's no super sophisticated supply-demand matching. And we've seen this, this played out on the big screen so to speak in Texas. And so, the answer to this is we need to put shock absorbers, so to speak, into our grid. And those shock absorbers are likely to come in the form of batteries. And these batteries are gonna help absorb big current draws, current needs, or current absorption. So, your question's spot on, because the obvious sort of thing to think about is, well, if our vehicles can play a role in grid stabilization and energy storage, that will help as we put more and more solar, particularly distributed solar, rooftop solar. But then, the question is like, who's paying for that and how do you compensate for that? So, this is something we're spending a lot of time on. We think over the next five years, it will become status quo for vehicles to have bidirectional capabilities. So, the vehicle can be charged from the grid or it can put energy back into the grid. And there's gonna be a host of really interesting revenue models that exist for consumers to say, I wanna make money on my vehicle to essentially play the role of what a peak plant used to do. So, peak energy usage to put energy back into the grid. So, again, there's many businesses that I think are gonna be started in this space. We're gonna participate in this space. I imagine many other vehicle manufacturers will as well. - All right, We gotta wrap it up quick, quick, quick. - Sure. Sanja Verma. Question I have is quite related to this issue. As the number of batteries increases exponentially, which is happening, the recycling will become an issue. And how do you think about that? I hear, and I'm novice in this area, but I hear about all of the chemicals that go in. We always are careful - Yeah. - about even small batteries that we are at home. - Yeah. - So, there's a lot of chemicals and is it a situation where you have to bury it under a mountain like nuclear fuel or do we actually have a solution? - All right. Solve this problem in 30 seconds or less. - Yeah, we'll solve it in 15 seconds. So, there's a perception that the battery at end of life is chemicals that are unusable. The reality is all those are wonderful things to use and reharvest. And the future state of our lithium supply chain will be used batteries. So, it'll be just a closed loop. I think there's a misperception, probably because of your energizer batteries that you throw in the waste bin. The recycling rate on a lithium-ion batteries is a hundred percent, there's too much value. Just to make the point, one of the most highly recycled products in the world is a lead acid battery, and the value of the materials in a lead acid battery are far, far lower than the value of the materials in a lithium-ion battery. - So, the- - We'll see a hundred percent recycling rate on that. - The answer is recycling. We're gonna have to leave it there. RJ, thank you so much - Yeah. - for joining us here today, talk about everything. - Yeah. (attendees clapping) - Thank you very much, sir. - Thanks as well. - Thank you. Thank you. We're gonna go over this side. - [Nilay] All right. (attendees clapping)",
    "transcript_keywords": [
        "Yeah",
        "vehicle",
        "vehicles",
        "electric vehicles",
        "charging",
        "lot",
        "supply",
        "electric",
        "Tesla",
        "supply chain",
        "battery",
        "point",
        "things",
        "big",
        "years",
        "grid",
        "platform",
        "space",
        "energy",
        "products"
    ],
    "transcript_entity_values": [
        "a thousand",
        "three",
        "10,000",
        "the end of the day",
        "15 seconds",
        "EV",
        "a thousand barrels",
        "over $70,000",
        "One",
        "50",
        "the 2020s",
        "Julie",
        "AC/DC",
        "Nilay",
        "About 75%",
        "CCS",
        "hundreds",
        "third",
        "Sanja Verma",
        "GM",
        "Overton",
        "Nilay",
        "Jackson Hole",
        "90%",
        "NACS",
        "Casey",
        "the first half of this year",
        "the next 5 years or 15 years",
        "Mary Barra",
        "six months to nine months",
        "2009",
        "RV",
        "Toyota",
        "about 80%",
        "China",
        "around 90%",
        "Texas",
        "500 years from now",
        "decades",
        "BMW",
        "first",
        "8,500",
        "10",
        "10 years from now",
        "North American",
        "Mary",
        "The Verge",
        "Tesla",
        "20 years from now",
        "the really early days",
        "the early days",
        "Arizona",
        "8",
        "this decade",
        "hundreds of millions",
        "100%",
        "RJ",
        "the next five years",
        "Phoenix",
        "20 to 25",
        "next month",
        "billion-dollar",
        "trillions of dollars",
        "9",
        "120 years",
        "Lightnings",
        "second",
        "Indonesia",
        "five",
        "Camry",
        "Venn",
        "about 90 million",
        "San Francisco",
        "Joy",
        "1",
        "First",
        "a minute",
        "30 seconds",
        "Ford",
        "one",
        "a couple years",
        "Julia",
        "four",
        "Jay Peters",
        "a hundred percent",
        "today",
        "Montana",
        "a year and a half",
        "monthly",
        "the United States",
        "Evs",
        "two",
        "all day",
        "Amazon",
        "5 to 10%",
        "next week",
        "a few hundred",
        "about four",
        "United Auto Workers",
        "Rivian",
        "United States",
        "Atlanta",
        "2022"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "TIME",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "LANGUAGE",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "GPE",
        "PERCENT",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "GPE",
        "PERCENT",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "NORP",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERCENT",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "GPE",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "GPE",
        "GPE",
        "DATE"
    ]
}