{
    "id": "_HvjBbbzx7w",
    "title": "CES 2021 - Behind the Scenes of the all new digital CES!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-01-11T02:35:14Z",
    "video_url": "https://www.youtube.com/watch?v=_HvjBbbzx7w",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "CES 2021",
        "hosting CES",
        "microsoft"
    ],
    "views": 155567,
    "likes": 7645,
    "comments_count": 475,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Welcome to the all digital CES set for 2021. I'm so excited. Rich is over there. Look at you, working away. - Oh, I'm actually formatting the stage computer so I can use that as my own. - We're on set getting ready to host this week. It's going to be so much fun. I look forward to seeing you guys all there and this is the set. Oh my God. It's so beautiful. I wish that I could shoot all my YouTube videos here. Maybe, maybe I just won't leave. Welcome to my CES. 2021 vlog. This vlog might look a little bit different than previous years. That's because CES is all digital this year and look here's my host, Rich! - What's up? - Can you believe that we're hosting again CES? When we hosted, when was that? - It had to be like eight years ago, nine years ago? I'm guessing. - We had a billboard. It was so cool. Okay, we got to go, we're doing rehearsals. [Upbeat Music] - [Justine] Look at this, look at that. - [Rich] That's CES right here - We are CES ready. This set is so incredible. Like this is the coolest thing I've ever seen. Are you guys available for, for vlogging? - I just want to spin around and get this whole set. - So at my desk, I have my yerba mate, my water, my empty cup, my mask, my surface duo and my other surface devices. There's a lot of surfaces happening surface hub. Okay, so this is the green room. It's really weird being on an actual set again because I haven't been on a real production in over a year. So everything is so different because everybody is basically more than six feet away. And there's different entrances and different ways that you have to go so that you're not actually passing by people. Another thing that's really different about craft services is they don't have that anymore because you can't have cross-contamination of food. But this, look at this, pancake breakfast, quiche breakfast. And instead of there being food actually in here, well there is food in there but they're all individually packaged. And of course there's never a shortage of coffee. Okay. We are heading back onto the studio now. [Upbeat Music] Day one of rehearsals is complete and tomorrow we're starting very early again, but the next morning, our call time is at 1:40. Like I have to be camera ready by 1:40 AM. So I'm going to bed at 6:00 PM right now to start prepping for the very early call time. So good night Morning. It is day two of CES, not technically even CES yet, but we have rehearsals and I woke up at 3:00 AM because tomorrow we have to get up at actually I have to get up at midnight to get ready for the actual show day. So I just did about, a five, five mile run. I only planned on doing like two miles and then I got a little lost. So I actually didn't have a choice. I had to keep going to, to make it back to my hotel. I thought it was gonna be freezing out but it was actually a really nice run. So time to get ready and start this, start this day. This is, this is what we look like now. It's still shocking to me that this is the new normal, this is it. Another normal, I had this delivered from Amazon prime now from whole foods before I even got to the hotel. When I got here, the guy was like, we had to check you in early because you had so many packages here that we didn't know what to do with them. So my yerba was waiting for me when I got here All my Microsoft goodies. We are ready for rehearsals, there's Rich. He already got me on his camera. Are you vlogging? - I'm you know, I'm going to do a little behind the scenes. Yeah, why not, for KCLA. - [Justine] That's exciting. That's so great! - I think people like to see the process. - I think so because it is a very new and interesting process that we're all kind of going through like a production in COVID, CES, the first ever digital one. It's pretty cool. And we're actually at Microsoft filming and shooting this at their studios. So I brought all the Microsoft goodies out and there's even Microsoft coffee cups. There's even a Microsoft pen that I don't have right now. But there is one and it has like a stylist on it at the end. It's pretty exciting. Time to rehearse - Third largest economy into a hub of innovation. CTA is Gary Shapiro recently spoke with secretary, Oh let's take a look. - [Justine] Let's take a look rich. - Let's take a look. - [Man Off Camera] Content they were calling out the French tech. - This J seven? Want to get the most out of your CES experience? Of course you do. So to help you with that here, are some tips and tricks on how to make this show all your own, check it out. - [Rich] That's the short one we'll be going in the back of the tag board. - [Justine] I'm going to say, I think we're further than six feet apart. - I think so. - Yeah. This is our cool little CES tracker here. So you could see all of the tweets, the popup whenever anybody uses hashtag CES, 2021. Look there's Brian and Naomi! So they're hosting after us. Rich and I have the morning shift. And by morning, we mean like, as soon as it hits am we're up. - Yeah. - [Justine] Very early. - It's maybe like the midnight shift. - It's so early. This is the surface hub and they don't know it yet, but it's coming home with me. I'm gonna bring it home. - [Rich] Justine, what's happening on the big board there? - Oh, we have so much happening. And it's really incredible because everybody at home can participate by just tweeting and using the hashtag CES 2021. And rich and I are here in the studio. That's the one challenge is once you have your hair and makeup done and you put a mask on, you basically mess it all up. So this face shield is pretty awesome. Jenna was making fun of me because she said, if I go outside in the rain and it's basically just like a funnel and it's just going to collect a bunch of rain. We're inside there's no way. Like, look at this control center over here. We have so much stuff. - [Rich] Mostly for Justine's, but I'm still here. - Check out this behind the scenes shot. We're now directing the vlog. Yeah we're ready. Look at that. Wow. Oh my gosh. That looks so amazing, incredible. I just did an interview, and right now I might be on the screen in a second. There I am, that's me! Guys, the studio is so cool. It's like, how am I ever going to go back to my normal studio again? So that's the end of this video. I'm so excited for CES. If you guys haven't already registered. I'll put a link in the description. If you guys want to check it out for more information. If you do want to watch and participate it is a registered event. So you do have to register to be able to watch all of the live streams and all of the content. And some of you guys, I posted a picture of my lightsaber and you're like, why would you travel with lightsaber? Well, my friends, Jedis never quit. And, very soon, I'm going to be a Jedi. Just not yet. I'm still practicing.",
    "transcript_keywords": [
        "CES",
        "ready",
        "Microsoft",
        "Rich",
        "set",
        "guys",
        "digital CES set",
        "hashtag CES",
        "early",
        "CES set",
        "CES ready",
        "surface",
        "morning",
        "studio",
        "time",
        "Day",
        "Yeah",
        "rehearsals",
        "digital CES",
        "back"
    ],
    "transcript_entity_values": [
        "second",
        "Amazon",
        "KCLA",
        "one",
        "2021",
        "Justine",
        "CES",
        "1:40 AM",
        "the next morning",
        "midnight",
        "two miles",
        "morning",
        "six feet",
        "3:00 AM",
        "6:00 PM",
        "Brian",
        "nine years ago",
        "five",
        "CES",
        "Gary Shapiro",
        "eight years ago",
        "this week",
        "five mile",
        "this year",
        "Jenna",
        "seven",
        "YouTube",
        "Microsoft",
        "previous years",
        "this day",
        "over a year",
        "first",
        "Jedis",
        "tomorrow",
        "French",
        "day two",
        "Naomi",
        "CTA",
        "more than six feet"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "TIME",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "TIME",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "NORP",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY"
    ]
}