{
    "id": "_J-hJBQmBKQ",
    "title": "The Xbox Masterplan.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-09-25T18:30:59Z",
    "video_url": "https://www.youtube.com/watch?v=_J-hJBQmBKQ",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "xbox",
        "series x",
        "series s",
        "game pass",
        "xcloud",
        "game pass ultimate",
        "nvidia",
        "google",
        "microsoft",
        "stadia",
        "geforce now",
        "game streaming",
        "cloud gaming",
        "stadia dead",
        "consoles",
        "psnow",
        "amazon",
        "amazon luna",
        "luna",
        "best game streaming",
        "playstation",
        "sony",
        "gaming",
        "games",
        "video games",
        "videogames"
    ],
    "views": 86031,
    "likes": 4506,
    "comments_count": 489,
    "description": "Did you know Stadia was still a thing?  Dont Buy New MacBook 2020:  Does @The Slow Mo Guys  ACTUALLY Know Slow Mo?!  Does Austin Evans Actually Know Tech!?  The IMPOSSIBLE Gaming Challenge ft.  @Kevin Kenson   Can you TRUST Gameranx?! ft. Jake Baldino:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/ZRxe9AqkI6A",
        "https://youtu.be/wm9Ezth7Iyo",
        "https://youtu.be/wm9Ezth7Iyo",
        "https://youtu.be/1PNBEqw_Fmk",
        "https://youtu.be/e15q1y6cxtw",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to \"This Is.\" Matt, you have a theory that the fine wonderful audience who I am dearly and deeply in love with and I always agree with on all points, is wrong. How dare you make an insinuation like that? Please explain yourself. - First off, way to butter them up so they're on your side immediately. Second of all, yes. I think that most of our audience is 100% wrong about streaming game services. And I'm going to tell you why. - I feel like you just said that for the thumbnail. - You're wrong, you're wrong. I'm going to pull an Austin, you're wrong. - I like it. I like it. Okay. What are we wrong about? - So, so many people just don't understand what streaming games services actually are. - Okay. - Let me start with Stadia. - I have an open mind. - That was the first one because Stadia has probably the biggest amount of hate that I've ever seen from like a service in recent memory. I bought it with my own money. We have a controller right there but so many people didn't know what it was. And that's a big ... And I'm not saying that they were misinformed is because Google did a horrible job at explaining what Stadia was. But a lot of people thought that it was a supplementary service to games they already owned. It wasn't. It was a new console. It was a brand new platform. - I get the idea that Stadia is obviously something different because when you look at what it was generally compared to something like X-Box Game Pass which takes advantage of games that you already have access to through Xbox Game Pass, you don't ... Literally you could buy an Xbox Game Pass subscription never pay for a game, never own an Xbox. That's a standalone thing. Things like G-Force now will take advantage of games that you already own on Steam or whatever the case is. But the idea of streaming games I think is a sort of ... It's a nefarious one because I think a lot of people think about it, like you said, as sort of like an add on, right? - Right. - I have these games. I play them on my PC when I'm at home or my console. When I'm out and about and I want to play on my phone, I'll be able to stream them but it's not like the full experience. - I'm not going to defend Stadia. Stadia completely dropped the ball. I was super excited for Stadia and they completely uh that up. What I am going to say is everything that Stadia did wrong, X-Box and Microsoft are doing 100% right. With the inclusion of now xCloud, you get that. This is what people thought the Stadia was supposed to be. - [Austin] So essentially xCloud is a bunch of Xboxes that are running in the cloud and it will be streamed to your mobile device or to your PC or to a wide variety of things. - Right now just Android and PC, no Mac support, no iOS support which a bummer. - That's an Apple thing. - Yeah. So with xCloud, and now it is known as Xbox Game Pass Ultimate. For $15 a month, at the moment of recording. So obviously this could change. As of right now for $15 a month, you get access to a bunch of games for free on PC that are included. You get access to a bunch of games on Xbox. You get Xbox Live Gold. You get EA Play, EA Access. Whatever it is. - That's not active yet but yes. - You will have to be able to have that. - You will be able to get that. - The main thing is for this video, you also get access to games streaming. So I have it right here on my Z Flip. You can hook up a controller or something and essentially what you get ... - We have a bunch of different ways to hook it up. - We do. We do. But basically the way it works is that all the games that are available on Xbox Game Pass for Xbox, which is a hundred, 150, there are few games, right? - [Matt] Yeah. - But importantly you can also stream them to your device. So that's I think the main difference between what Microsoft are doing with the next generation consoles and Game Pass and everything versus what Sony is doing with say PlayStation Plus which for the PS5, you're going to get a selection of games included and they do the three games, but it's not the same thing. Certainly on the streaming side, it's not going to give you that same result of that ... One thing I think to keep in mind is that the line between streaming and subscription stuff, this gets confusing. So streaming games are instant, right? On my phone. I load it up. It will pull up from server. In fact, I'll open up, I don't know, Shadow of War here. Right? So it will launch an instance on the server. It will stream it. However, if I'm on an Xbox, I will actually download that game. So it's running natively. So there's no downside to playing an Xbox Game Pass Game on PC or Xbox because you're just downloading it and running it natively. - And I think that's one of the biggest misconceptions with something like the Series S with no disc drive. So many people think that because it doesn't have a disc drive that they are streaming the games and like ... Look, you know, the number one comment is, \"My Internet's not that good so I can't play those games on the One S.\" which is just incorrect. Here, yes. You do need a good internet connection for this to work. However, for Game Pass, you still download the full 10, 15, 30. Whatever gigabyte. - 100 - Yeah. - There's multiple different types of streaming because you also can stream locally. And that's generally free and included. Like Steam will do it. You can do it from your Gravis card. Xbox and PlayStation will both allow you. So if I have an Xbox, you know, on my wifi, a few feet away, I can also stream it to my phone. - [Matt] Which is local play if you're get technical. Now, so that's where again, Microsoft is doing ... They're succeeding because they're getting giving you literally all of it. - Yes. - But I think the key thing right now is that we are in a state of good enough for this to start catching on. And it's only going to get better from here. So you had some trouble playing like Forza. - The thing is, none of these games are perfect when it comes to streaming, right? Like I think on a phone screen, a lot of like the compression artifacts or any kind of issues are actually kind of fine because you don't really notice it that much. Well, you do have to keep in mind that you don't have to have a good internet connection. Like it is certainly not perfect. But I think one of the things that you have to keep in mind is that there's so many games that are available on Game Pass and specifically when you look at Microsoft buying Bethesda. - [Matt] Yeah. - So we are going to have tons of exclusives, not on the Xbox side but also going to have all those games coming to Game Pass essentially. - [Matt] So that was the biggest critique of Microsoft and Xbox's generation is so many people are like, \"Well, who cares? Who wants to buy an Xbox? There's no good games.\" - Yeah. - But now, was it $7.5 billion acquisition of Bethesda? - A lot. Okay. Yeah. - Like you have some of the biggest franchises in gaming history now that are theoretically exclusive to Xbox. I think they're going to be ... - [Austin] I'm ready for super Microsoft Bros where we have Master Chief and Doom Guy and a Brawler. I think we can play that. - Yes. Super Smash Brothers is going to have a lot of competition. So again, one of the misconceptions is that you have to buy the games on Game Pass in addition to the $15-a-month service because that's what Stadia had. That's not the case with Game Pass. 15 bucks gets you every game on Game Pass. - So with Xbox Game Pass, the games, like something like Netflix are not guaranteed to be there forever, right? - Correct. - Games do come off of Game Pass. - [Matt] Right. - You will no longer be able to play them. Now I do think that when they're coming off or at any point you can purchase the games at like a little bit of a discount or something, but regardless it is one of those things where you don't always have access to these games. So that is one negative. And I think that there are a lot of people who like to either own the physical games or at least the digital games because that's their game forever. But all that being said, I do think Game Pass makes a lot of sense. I think it's reasonably priced. I think you get a lot of different perks between the streaming, between the ability to play on PC and all the other stuff. I think it makes a lot of sense. I do think that this is sort of the next generation Xbox right? We've all kind of made jokes about like, \"Oh the new Xbox is just a Game Pass Box.\" But in a lot of ways especially the Series S I think that is absolutely the case. I like xCloud. I like being able to play Game Pass games on my phone, but it is certainly not a perfect experience. The compression stuff like I said, like it's fine on a phone because of the small screen. - It's not made for it, that's like key to it. Is like, if you try and compare one to one these are made for a, let's be real like a 55-inch TV. So trying to do ... Like a lot of people try and do a one to one comparison on you know, something that's made for a giant TV being scaled down. - Well, the scaling actually I think is helpful but that being said, there's still latency involved. I still can tell the difference. - [Matt] The latency is really the only hurdle that we don't have a good answer for. - [Austin] There are also some audio issues with Game Pass from a ... Well, from time to time, audio doesn't sound quite right. And honestly, audio is almost as important if not more so than the video. So like streaming games are in the future, there usable now. And I think it's a nice add on. I do agree that the Game Pass model of it is a bonus that you already have with all the other things that you get with your Game Pass subscription, is good. I think that something like Stadia was in hindsight, a real misstep, that they were charging you full price for games without giving you that full experience. - The last point I want to make with streaming services is the amount of internet you actually need for this. If you can stream Netflix to your phone, if you can stream YouTube to your phone you can stream games to it. It's the same, roughly the same size file of like data rate I think with like Stadia was like at most 35. - It depends. If you're just purely talking about the bandwidth, I agree. - Right. But it is a little more than that because it's the latency, - [Matt] You know I'm getting a better experience because I'm close to Google's, you know, data centers. I'm vaguely close to Microsoft's data centers. - Essentially. The way it works is when you look at the bandwidth that you need, right? So it's basically like you're watching like a 60p video but the difference is, is that YouTube, Netflix, they will buffer video. So if you have a little bit of like a choppy, LTE connection, if you can get it enough to where it will load it in the background, that's fine. Whereas when you're actually doing game streaming there is no buffer. There's no latency sort of benefit whatsoever. If you go through a tunnel or someone next to you starts downloading something that cuts your signal off for even like a split second, that means that you lose your game for that split second. That's I think the main difference it's not much it's going to kill your data cap, which I mean, it will just like watching a lot of 60p video but importantly that latency and the experience can be impacted very very easily on mobile. - If they can get smart about how they're buffering this. Say, \"Oh, we know he's getting to a cut scene.\" Just the natural progression of, you know, \"Oh we're in a zone where a cut scene is ready. Let's buffer that cut scene.\" - When it comes to the games that you play right now, via streaming, like, so Shadow of War right now doesn't know that I'm playing on a phone. Like it's just an Xbox game that is being streamed. - But if you start developing instead of saying, \"Oh we're going to build ...\" You know, instead of Microsoft saying, \"We're going to try and manufacture 10 million consoles in order to be ready for Christmas.\" They say, \"Oh, we're going to build a couple more data centers.\" And that's why I say this is ... We're in a good enough spot right now where it's usable. People can get used to it. People can start to enjoy it. For a lot of people, I would say don't even bother getting a console, period. - Just Game Pass by itself. - I would say for a lot of people and I'm talking casual. I am not talking anything competitive. Let me be clear on that. - Yeah. - For 15 bucks a month, there's a lot of really good games that don't you know, make or break on latency. - I'm sorry. I was too busy playing my X-Box. Yeah. - [Matt] You got nothing to say. So let me know in the comments, how much you think I'm full of uh as you always do, because- - It's gonna be bad today man. It's gonna be bad. - You know what? Like you guys already hate me so I'm just going to go full into it. Let us know, check out all their videos and we'll catch you in the next time. - I'm so sorry. I'm so sorry for all of this but thanks for subscribing and let Matt know that you don't actually hate him. Who could hate a face like that?",
    "transcript_keywords": [
        "XBox Game Pass",
        "Game Pass",
        "XBox Game",
        "games",
        "game",
        "XBox",
        "Game Pass Game",
        "Pass",
        "Stadia",
        "Game Pass subscription",
        "play Game Pass",
        "streaming games",
        "Game Pass Ultimate",
        "Game Pass Box",
        "lot",
        "streaming",
        "people",
        "Game Pass makes",
        "Microsoft",
        "Game Pass essentially"
    ],
    "transcript_entity_values": [
        "PS5",
        "Stadia",
        "Android",
        "30",
        "one",
        "Mac",
        "Second",
        "Apple",
        "three",
        "a hundred, 150",
        "60p",
        "LTE",
        "today",
        "15 bucks",
        "15",
        "Bethesda",
        "35",
        "a few feet",
        "Stadia",
        "Google",
        "Game Pass",
        "Forza",
        "55-inch",
        "Shadow of War",
        "Matt",
        "EA Access",
        "Christmas",
        "Austin",
        "Gravis",
        "15",
        "100%",
        "Doom Guy",
        "Austin",
        "G-Force",
        "Super Smash Brothers",
        "EA Play",
        "10 million",
        "One",
        "Xbox Game Pass",
        "Xbox",
        "Xboxes",
        "the Series S",
        "Sony",
        "Game Pass",
        "10",
        "second",
        "PlayStation Plus",
        "Shadow of War",
        "Xbox Game Pass Ultimate",
        "Xbox Live Gold",
        "Microsoft",
        "first",
        "$7.5 billion",
        "Netflix",
        "YouTube",
        "PlayStation",
        "Xbox Game Pass",
        "xCloud",
        "Xbox"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "EVENT",
        "PERSON",
        "QUANTITY",
        "EVENT",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "FAC"
    ]
}