{
    "id": "_k5PI3fkNiY",
    "title": "Samsung Galaxy Unpacked 2022 in 8 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-02-09T16:31:01Z",
    "video_url": "https://www.youtube.com/watch?v=_k5PI3fkNiY",
    "category": "Science & Technology",
    "tags": [
        "samsung unpacked",
        "samsung unpacked 2022",
        "galaxy s22",
        "galaxy s22 plus",
        "galaxy s22 ultra",
        "galaxy tab s8",
        "samsung ss22 ultra release date",
        "new galaxy phone",
        "s-pen",
        "oled",
        "galaxy unpacked",
        "galaxy s22 series",
        "galaxy s22 price",
        "galaxy S22 lineup",
        "new galaxy",
        "snapchat",
        "samsung galaxy",
        "samsung tv",
        "samsung phone",
        "samsung s21",
        "samsung watch",
        "supercut",
        "first look",
        "hands-on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge",
        "samsung galaxy s22",
        "samsung"
    ],
    "views": 280234,
    "likes": 5472,
    "comments_count": 645,
    "description": "Samsungs latest flagships are here: the Galaxy S22, Galaxy S22 Plus, and the Galaxy S22 Ultra. Plus, a look at the new Samsung Galaxy Tab S8 with a giant 14.6-inch display. Here's everything you need to see from the 60-minute event in just under 8 minutes.   Everything announced at Samsungs Galaxy S22 Unpacked event:   Samsung Galaxy S22 Ultra hands-on:   0:00 Samsung S22/S22+ 1:27 Samsung S22 Ultra 5:40 Samsung Galaxy Tab S8  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3gA2cvV",
        "https://bit.ly/3Ll8w8y",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hello and welcome. This is an unpack, like no other. - Your Highness, I give you the Samsung Galaxy S22. - [Woman] Galaxy S22 and S22 Plus, are based on the iconic S series design and are available in four stylish shapes. A new 50 mega pixel wide lens, provides enhanced resolution. There's also a new 10 megapixel tele lens with three times optical zoom, but with Super HDR on your S22, you can capture once in a lifetime moments, in well defined videos. Even with back lighting, even when I'm on the move, my video is stable. That's because of a 58% wider correction angle of Optical Image Stabilization and Video Digital Image Stabilization. The front camera takes great portraits, even in low light and the results are bright and clear. (camera shuttles) AI Stereo Depth Map is now integrated into portrait mode. (camera shuttles) We partnered with Snap to provide a more integrated camera experience. Now you can take advantage of S22 smooth zoom with tele lens and night mode, all right, from the Snapchat app. With the new 50 megapixel wide lens with the larger sensor and a new 10 megapixel tele lens with three times optical zoom, Galaxy S22 will be available for $799 and S22 Plus will be available for $999. You can, pre-order both starting today. - Meet the Galaxy S22 Ultra. We seamlessly integrated the camera lenses into the phone and it comes in four bold classic colors Phantom black, Phantom white, Green, and a sophisticated all new Burgundy. And today we're thrilled to introduce the first Galaxy S series model ever with a built-in S Pen. Compared to the Galaxy Note 20 in the S21 Ultra we made this display three times more responsive to the S Pen. Based on extensive analysis we enhanced our AI based point prediction software. Now Galaxy S22 Ultra can better predict the next point of year S pen. We used our highest quality materials to create the Galaxy S22 series, including our strongest armor aluminum frame yet, and Corning Gorilla Glass Victus+. Gorilla glass Victus+ is on both the front and back of the device and is currently exclusive to the Galaxy S22 series. With the Galaxy S22 Ultra, we're bringing you an immersive 6.8 inch Dynamic AMOLED, 2X display with adaptive refresh rate. It can reach up to 120 Hertz for super smooth scrolling on social media and optimize viewing for video and games and go as low as one hertz to save energy when you're doing something less intensive. Thanks to the all new vision booster algorithm, Galaxy S22 Ultra has our most advanced display yet. The Galaxy S22 Ultra comes with a powerful four nanometer processor, and we work to regulate the temperature of the Galaxy S22 while maintaining its powerful performance. - Introducing an AK video and a 108 megapixel for the camera. This camera produced a vivid 108 megapixel image using a Re-mosaic algorithm to remap pixels into a conventional RGB pattern. Now, the Galaxy S22 trust camera uses Adaptive Pixel to merge multiple frames into one. It combines a detailed 108 mega pixel image with a nona-binning 12 mega pixel image with the more light. This combination creates an optimally bright 108 mega pixel image providing crisp clear resolution throughout the day. Our designers and engineers, combined powerful software with a powerful hardware to introduce a quadruple lens camera, with a hundred times space zoom at the heart of our innovation is the AI engine, a neural processing unit capable of deep learning. Introducing Nightography. - [Man] Galaxy S22 Ultra is equipped with a 2.4 micrometer large pixel sensor that takes in more light and has an anti-reflective nano coating on the glass and lens. When taking photos in low light, night solution kicks in. It uses multi frame processing to capture a series of images in an instant, removing frames that have noise or blur. Then, it merges the remaining frames into a single clear shot and uses an AI powered ISP algorithm that enhances the objects true shape, color tone and details. To provide clear and stable night video, Galaxy S22 Ultra employs an intricate dual track image stabilization solution with OIS and VDIS. To capture brighter videos at night, Galaxy S22 Ultras camera automatically changes the frame rate between different FPS in response to subtle changes in lighting. - We're giving you more advanced functions like Pro Mode. In Pro Mode, you can manually adjust your shutter speed, ISO, (camera shuttles) manual focus and white balance. And with S22 for the first time, Pro Mode gives you the choice to extend these powerful capabilities to all of your lenses. And for the true pros out there, Expert Raw, a multi frame based raw format provides even more flexible option. With the best Galaxy camera and embedded S pen, a four nanometer processor and our brightest display ever, it sets a new standard for smartphones. Galaxy S22 Ultra will be available for pre-order starting today at $1,199. - Today, we're proud to introduce a new generation of tablets. Introducing the Galaxy Tab S8 series. We're introducing three new additions to the Galaxy Tab S8 series, including a new incredible member of our lineup. We are bringing the power of Ultra to our tablets for the very first time with the Galaxy Tab S8 Ultra, with its 14.6 inch super am display. This display is clear and bright with up to 120 Hertz refresh rate, which means stunning graphics and a smooth scrolling experience. They crafted a 6.3 millimeter bezel. So now you can enjoy the slimmest and largest display of any Galaxy Tab yet. With Dual cameras positioned on the long side of the tablet, combined with innovative auto framing and the powerful three way microphone with AI technology, the Tab S8 series brings a digital and analog experiences together with the S pen. The Galaxy Tab S8 series is equipped to record in 4k video, with both the front and rear cameras. It has a four nanometer processor, the first we've ever put in a tablet. And with up to 16 gigs of Ram, the Tab S8 Ultra will stay responsive and ultra fast. The Galaxy Tab S8 series comes with expandable storage, which means you can increase storage by up to one terabyte. With our most powerful performance yet, and our most expansive tablet display ever, this series will bring your biggest ideas to life. Galaxy Tab S8 Ultra will be available for $1,099, Tab S8 Plus for $899 and Tab S8 for $699. Pre-orders start today. And if you pre-order, you'll be able to experience the book cover keyboard on us. - Thank you for joining us. Stay safe and see you next time. (electronic sound)",
    "transcript_keywords": [
        "Galaxy Tab",
        "Galaxy",
        "Ultra",
        "Tab",
        "series",
        "Samsung Galaxy",
        "camera",
        "Image",
        "lens",
        "display",
        "Pro Mode",
        "Image Stabilization",
        "mega pixel image",
        "Galaxy camera",
        "pixel image",
        "video",
        "Galaxy Note",
        "pixel",
        "Pen",
        "powerful"
    ],
    "transcript_entity_values": [
        "ISP",
        "Today",
        "AI Stereo Depth Map",
        "the S pen",
        "Corning Gorilla Glass Victus+",
        "Galaxy S22 Ultra",
        "108",
        "2.4 micrometer",
        "4k",
        "the Galaxy S22",
        "four",
        "1,099",
        "999",
        "Green",
        "Burgundy",
        "AK",
        "Tab S8 Plus",
        "three",
        "Snapchat",
        "Galaxy Tab",
        "AI",
        "the day",
        "ISO",
        "today",
        "four nanometer",
        "Optical Image Stabilization",
        "Galaxy S22 Ultras",
        "6.3 millimeter bezel",
        "Video Digital Image Stabilization",
        "120",
        "14.6 inch",
        "The Galaxy S22 Ultra",
        "the S Pen",
        "a Re-mosaic",
        "Tab S8",
        "6.8 inch",
        "RGB",
        "20",
        "night",
        "Hertz",
        "up to one",
        "Phantom",
        "1,199",
        "Galaxy",
        "899",
        "12",
        "the Galaxy Tab S8",
        "Adaptive Pixel",
        "Galaxy S",
        "Pro Mode",
        "Ram",
        "50",
        "hundred",
        "10 megapixel",
        "year S pen",
        "Tab S8 Ultra",
        "first",
        "50 megapixel",
        "the Galaxy S22 Ultra",
        "the Galaxy Tab S8 Ultra",
        "799",
        "58%",
        "Pro Mode",
        "Galaxy S22",
        "16",
        "2X",
        "S Pen",
        "S22 Plus",
        "699"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "LAW",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "MONEY"
    ]
}