{
    "id": "_LEyXAIS8mE",
    "title": "Apple Wanted This Product Name BADLY - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-03-09T17:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=_LEyXAIS8mE",
    "category": "Science & Technology",
    "tags": [
        "Apple Wanted This Product Name BADLY - Krazy Ken's Tech Talk",
        "iPhone",
        "Apple",
        "CIDCO",
        "InfoGear",
        "InfoGear iPhone",
        "Original iPhone",
        "Bob Ackerman",
        "Gil Amelio",
        "Steve Jobs",
        "iOS",
        "Cisco",
        "Trademark",
        "Lawsuit",
        "Telephony",
        "Dial-up",
        "ISP",
        "Telnyx",
        "FreePBX",
        "Linode",
        "Linux",
        "PSTN",
        "POTS",
        "Public Switched Telephone Network",
        "Plain Old Telephone Service",
        "PBX",
        "History",
        "Retrospective",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Phone",
        "Tech",
        "Computer Clan",
        "Thin Client",
        "Linksys",
        "VoIP"
    ],
    "views": 228035,
    "likes": 7681,
    "comments_count": 535,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below We all know the Apple iPhone, but do you know of the true, ORIGINAL, InfoGear iPhone from 1998?  See more rare & retro tech   Check out my tech scam-busting episodes   Patreon!    Follow me on Twitter   Facebook   Shop for cool stuff on my store   Hey! I have a Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to everyone who helped with this episode: Sage:  Steve from Mac84:  Gabe (@lhwhistler01) Brent (@PenroseFilms) Stubbertville Sonic Artist:  And thanks to my amazing Feedback Team who works behind the scenes!  Download Computer Clan wallpapers    Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://youtube.com/@SavvySage",
        "https://YouTube.com/Mac84",
        "https://twitter.com/speendlexmk2",
        "https://thecomputerclan.com/wallpapers",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Oh, hey there, sport. I bought you a new iPhone for your birthday. What do you mean? It says iPhone right there. Are you saying I got the wrong one? Oh, son of a, Martha! - Sponsored by Linode, cloud computing from Akamai. (cheerful chiptune music) (machinery humming) (camera whooshing) Hey, everyone, how are you all doin'? If you're new here, welcome. My name is Krazy Ken, and this is the CIDCO iPhone. But wait, this is the InfoGear iPhone? Two different companies using the same brand name years before Apple did? That's right. There's a lot to unpack here. So let's start with InfoGear and CIDCO's history. (transition whooshes) Circa 1995, three engineers at National Semiconductor, Chaim, Yuval, and Reuven, were working on a product codenamed Project Mercury, a multifunction phone and Internet device, or Internet appliance, which was a late '90s fad consisting of devices which performed usually one Internet-related task, like emailing with this VTech Companion. Around the same time, Venture Capitalist Bob Ackerman was consulting with the company, and during a meeting, he discovered Project Mercury. Seeing potential in this device, Bob worked with his colleague Jeff Oscodar to convince National Semiconductor's CEO to move the project forward and form a startup company. And guess who National Semiconductor's CEO was at the time? It was Gil Amelio, Gil freakin' Amelio, who would become Apple's CEO in February, 1996, and then succeeded by Steve Jobs. Small world. Anyway, the result of this collaboration was the InfoGear Technology Corporation, founded in November, 1995. InfoGear had the technology and the brainpower to build this amazing phone appliance, but they needed manufacturing and distribution. This is where CIDCO comes in. CIDCO Incorporated was founded in 1988 as the Caller ID Company. And on May 7th, 1996, InfoGear officially announced its partnership with them. The final result was iPhone, or Information Phone if you like extra syllables. The CIDCO iPhone was marketed as an entirely new type of product, \"The Telephone for the Next Millennium, Today.\" And it launched publicly in January, 1998, for $499. So now let's take a look at the hardware itself. (transition whooshes) The first-generation CIDCO iPhone featured a sloped, curvy design with a beige case and matching handset. On the top bezel is the CIDCO logo along with the activity light and stylus holder. In the middle is a 7.4-inch LCD touchscreen with backlight, running at 640 by 480 resolution with 16 shades of gray. And although iPhone comes with a stylus, you can still use your finger. - [Steve] Who wants a stylus? - On the right side are brightness and contrast sliders. And beneath the screen is a telephone keypad, Hold, Mute, and Speakerphone buttons, volume controls, and scroll buttons. And on the front is a spring-loaded miniature keyboard which pops out with a push. On the left side, under the handset, is the built-in speaker. And on the back is a port for an external keyboard, a printer port, the power port, and an RJ11 port for the telephone line. Yeah, only one telephone jack on the back. That means you cannot call and browse the web at the same time. But hey, let's not dwell on the negatives. Check out the mind-bending performance of this beast. - [Announcer] 16-bit processor, one megabyte of RAM, and a 14.4k modem. (modem handshake blaring) (duck quacks) - Okay, so maybe it's not a beast, but hey, it's 1998, and it's a small, compact, and lightweight phone. It's not a computer; it's an appliance. I just realized, I have 1,000 times the amount of RAM on my frickin' wrist. Holy sh... Now, the hardware is nothing without the software. And we will talk about that soon, but first, we don't want to neglect the second-gen iPhone, now do we? The second-gen iPhone carried the InfoGear branding instead of CIDCO. Why did they change this? Well, unfortunately, CIDCO'S caller ID business was collapsing. And according to Bob Ackerman, their share price was under $3, so they couldn't work with InfoGear any further. But InfoGear took on the extra workload, and they pressed onward along with some new investors like Cisco and Intel. And in 1999, they released the second-gen iPhone. (transition whooshes) The new model introduced many features, including an optional black color. The display could now tilt, and the keyboard was full size, making it much easier to type on. The modem was upgraded to 56K speed, and you could now call and use the Internet at the same time. That's right. The second-gen iPhone had two RJ11 ports. Another useful feature, the power supply brick on the power cord was in the middle of the cord. So at the end, you actually had a normal-size plug you could plug into your wall outlet instead of this huge chonker that was on the first gen. In addition, the button arrangement was slightly tweaked, but it was mostly the same. However, there was a new Flash button for switching between calls and new activity lights for voice and data. So that, my friends, is the iPhone hardware. But now let's look at the software. The menu screen has big square icons which link to applications and websites. There's also a black status bar on top and a persistent toolbar at the bottom, which is always accessible in any application. And the icons change based on the user's task. When you're in another application, the menu button is always in the lower left so it's easy to access, kinda like the Start menu in Windows. The Phone button also is in the same place in all applications. When you tap it, the phone interface slides out on top of the background app. Picking up the handset or pressing the dial pad also summons this interface. The built-in applications are Directory, Internet, E Mail, How To, Phone, Call Log, and Settings. The other icons on this home screen are web links. And just a heads up, these Internet-based applications are a whole other can of worms, so we'll dive into those later. Directory lets you add contacts with names, phone numbers, email addresses, and physical addresses. How To contains instructions to help users with their iPhone, but half of the buttons require an Internet connection to display the content. Settings lets users change iPhone settings. Gee. Thanks, Captain Obvious. (snaps) You're welcome. You can change your ringtone- (phone ringing) Your speed dial buttons with customizable icons, your answering machine greeting- - [Recording] Hey, what's poppin'? It's Krazy Ken. Leave a message after the beepity boop. - And you can recalibrate the touchscreen. You can also save up to four email profiles with different settings, and you can change Internet connection settings too, which is something I'll be tinkering with for hours. The call log stores call records if you're subscribed to caller ID from your telephone company. And yeah, I don't have any friends, so I just call myself a lot. Now, in the '90s, what's the main thing we want a phone for? Phone calls, so to do that, we need something called a... landmine. So I'm having Old Man Ken install one of those ASAP as possible. - [Old Man Ken] Okay! Your landmine is ready to go. (explosion booming) (1000 Hz sine wave tone) - Oh, it's a land... line! Sorry about that. - These kids today with their hula hoops and their landmines. Uh... Oh, it's the wrong way. Okay, you're good to go! - Ah, that sweet, naive Old Man Ken. We love him. Anyway, telephone signals usually aren't delivered through wall jacks anymore. These jacks connect to POTS, or the Plain Old Telephone Service, but this is seldom used. Instead, ISPs offer Voice over Internet Protocol, or VoIP services, where you can plug your phone into your modem's voice port, and your phone thinks it's connecting to POTS, and your phone doesn't know any better. So that's what we'll do today. I plug the RJ11 cable into my modem and then into my iPhone. And now I'll call a completely random and certainly not planned phone number. (phone ringing) - [Brainiac Brent] What's up? - [Ken] Uh, how do you think Craig Federighi gets his hair to look so good? (bell dings) - [Brent] Uh, I believe it's mousse? - (laughing) You can't put a moose in your hair. They're ginormous! So calling works on the CIDCO iPhone. I tried it on the handset, I tried it on speakerphone, and both work. But there's more features than just phone calls. The phone application gives quick access to your speed dial buttons, but you can also switch to the answering machine tab to review messages. The Calling Features tab provides one-tap shortcuts for vertical service codes. For example, you can press Call Return instead of dialing *69. Three-way calling was also available. You can also press the Memo button to record a voice message and play it back in the Answering Machine tab. - [Recording] Note to self, remind you to figure out how Craig gets his hair to look so darn good. - So iPhone is filled with a bunch of awesome phone features, but now let's talk about the Internet. To get this thing online, we can't use any of that newfangled Wiffy. - [Sonic] It's actually pronounced Wi-Fi, Ken. - Shut up, Mario. I can't use Wi-Fi on this thing, not even Ethernet. There's only an RJ11 port. Buckle up, because this is where things kinda turn into a big cluster-fornicate. Getting old technology to work with modern technology can be a PITA, but I want to try. In the olden days, I could connect this cable to the wall and subscribe to a dial-up service. But physical operational landlines in houses and dial-up services aren't very common anymore. And using VoIP with a modern ISP plan could cause compatibility issues. So what do we do? Conversion technology is always here to save the day. I'm going to use a Raspberry Pi with some help from my friend Steve from Mac84. Along with the Pi, we need the DreamPi software, a Linux-compatible USB dial-up modem, a telephone cable, and an Ethernet cable. This particular modem doesn't have a line voltage inducer, so Steve offered to hack one together with a nine-volt battery, a 380-ohm resistor, and a .47-microfarad capacitor. This will supply enough voltage to make the connection work. I downloaded DreamPi 1.6 from Kazade's Internet Address. Gosh, I hope I'm pronouncing that right. And I flashed it to the card with balenaEtcher. Then I inserted the card into the Pi, and I got a rainbow screen. (duck quacks) Okay, so that failed. Let's try a different program. This time, I used Raspberry Pi Imager to flash the card, and I still got a rainbow screen. Dang it, Linux. Why do you have to make everything so hard? That's what she said. So this is the problem with following old tutorials. Yes, they can still be useful, but sometimes you'll get linked to old software. I have a Raspberry Pi 3 B+, which needs 1.7 of the software, not 1.6. (transition whooshes) So I flashed the new image to the card, and et voila! It worked! Now that the Pi is up and running and connected to the other components, let's plug it in and test it out. (Windows XP Critical Stop error sound) Well, sadly, I can't get any webpages to load. I only get a \"Line is not available\" error. Was the Pi malfunctioning? To test this theory, I plugged the Pi's RJ11 cable into a Macintosh PowerBook and dialed. Sure enough, it worked fine, and browsing in Internet Explorer functioned properly. Okay, so the Pi isn't at fault. Something must be wrong with the iPhone. And my theory is that it's just picky about the connection. There's a lot of conversion going on here, and there's a generational gap between these products, so it gets the dial tones and just goes, \"Huh?\" So it's time for take two, which means I'm gonna have to erase your memory and just, you know, casually forget about everything we just tried. Yeah, I don't have one of those neuralyzers from \"Men in Black,\" so this flashlight will have to do. (button clicking) That should be effective. Oh my gosh! We're going to create a gateway to the PSTN, public switched telephone network, using a Grandstream ATA, or analog telephone adapter, FreePBX, and Telnyx. And by we, I mean Gabe and Braniac Brent because they know way more about this stuff than I do. But one thing I know for sure is where we're gonna host FreePBX: in the cloud, of course! Thanks to Akamai and Linode, this is pretty easy. Hey, if it runs on Linux, it runs on Linode. So we hosted FreePBX in Linode's cloud and purchased a DID, a direct inward dial number, via Telnyx. Then we pointed the ATA to our FreePBX installation in Linode's cloud, and all together, this should theoretically connect the iPhone to a virtual landline that can dial in and out. What do you think? Shall we make a test call? (dial tone humming) (keypad beeping) - [Automated Voice] Welcome to Apple. Calls are recorded for evaluation, to train personnel, and to improve contact center technologies. - Great! Phone calls work. Now we need to get dial-up service. And this is kind of a pain because a lot of dial-up services I found require a client, which will not run on this iPhone operating system. It's not as popular as Mac and Windows. Thankfully, a generous viewer provided me with a phone number we can use for dial-up service that does not require a client. So let's test it out on a Mac first. (transition whooshes) (modem handshake screeching) Okay, something is not working right. With all of this technology corralled together, it can create some complications. There's a lot of compression and conversions going on, and the signal might just get mixed up a little too much for it to work properly. But then I had an epiphany. Occam's razor, the simplest answer is most often the correct one. Why don't I just use my ISP's voice plan? Now, like I hinted at earlier, I originally avoided this path because modern ISP voice plans may not be compatible with dial-up due to compression in the signal and other factors. I've heard stories about people's fax machines not working with ISP voice plans either. However, since the other two plans failed, I want to take a chance. I plugged my ISP's modem into the Mac to test the dial-in service. And boom, it worked on the first try. So now we confirm the dial-in number works, and we can use dial-up with an actual ISP instead of using something like DreamPi. So now it's time to plug the modem into iPhone. Moment of truth. (dramatic orchestral music) And it's stuck on the \"Modem handshake ok\" status. Mm, yeah, frankly, I don't know what to do anymore. I spent hours and hours testing these things with multiple different people trying to help me out. And ultimately, all the solutions fail. But I think I know why. The CIDCO and InfoGear iPhones are thin clients, meaning they are simplified and usually low-performance computers which access resources from a server. In other words, the server takes on the workload of downloading and processing data from the Internet and packs it into a compressed format for the client. This simplified model represents how InfoGear likely handled their webpage delivery back in the day. But in a modern professional setting, thin clients usually connect to a server with a Remote Desktop Connection, meaning the entire user interface is rendered server-side and transmitted to the client. This allowed iPhone to sell at a lower cost and operate quietly without a fan. If we were doing all of this processing internally on the hardware, we would need faster processors and higher capacity storage chips, which would drive up cost. And then that stuff consumes more power and outputs more heat, so then we'd need a fan in here. So now it might make noise, and now you're starting to make a PC, not an Internet appliance. So to achieve this thin client vision for iPhone, InfoGear developed a client-server architecture. InfoGear referred to their client products like iPhone as client gear, and their server gear software, which was integrated with ISP networks, acted as an intermediary between the client gear and content providers. Unfortunately, this architecture was shut down years ago, so iPhone is trying to communicate with it, but it can't find it, so it just sits there confused, wondering why it can't go anywhere. So I don't think there's a solution to this problem. But to make everyone happy, including myself, I created a simulation. Here's what web browsing probably looked like on the iPhone's 640 by 480 display with 16 shades of gray. Beautiful, but we won't stop there. There's still some web-based features we can look at even though we're in offline mode. (transition whooshes) The email client displays a message list in a three-column view. And when you tap the Compose button, you get a typical email compose window that basically looks like the same thing we use today. And I absolutely love how the default signature is, \"Regards, I am an iPhone user.\" Oh, yes, that sounds so fancy, pinky out and all that. Yes. The web browser application has a packed toolbar with standard controls like Back and Reload and a bookmarks manager. Sadly, we can't use the search feature without an Internet connection, but we can still load up the Go screen. This is where I was trying to connect to websites this whole time. You can type in an address, or you can tap a recently visited page. And the How To app is basically a reskinned version of the web browser. The pages are stored locally, and you can even see part of the URL at the top. Now, you're maybe wondering what this giant Big Planet logo is for. Me too, so let me know if you find out. Just kidding. So, iPhone could sell with ISP bundles. So you can maybe get the hardware for cheaper if you subscribe to a plan. And Big Planet was one of these providers. And Big Planet Incorporated is an Internet services company owned by a skincare products company, Nu Skin Enterprises. Still trying to figure that one out. Anyway, remember those links on the menu screen? Several of these are Big Planet services, including a concierge, which can help users shop online or find answers to questions. You can even find sold-out concert tickets, or so they claim. I haven't tried it myself. So two big questions remain, and the first one is, where is InfoGear now. Clearly, the iPhone name stuck. Apple uses it. Heck, there's over 1.5 billion active iPhones today. So it worked out in the end, but at this time, InfoGear still owned the trademark. So how did Apple get it? On June 5th, 2000, Cisco, not CIDCO, completed the acquisition of InfoGear for $300 million in Cisco stock, which collapsed about 75% over the next 10 months, but (laughing) we don't know that yet. But practically nothing happened with the iPhone name. The InfoGear iPhone line was discontinued in 2001. So for the next five years, the iPhone name basically did nothing. But then, on December 18th, 2006, Cisco's Linksys division launched a new family of VoIP phone products named iPhone. And this was 22 days before Steve Jobs was going to announce the Apple iPhone at Macworld. Interesting timing? The iPhone family consisted of a rebranding of some existing phones, but there was a new model, the Wireless G-Phone for Skype, or iPhone, or WIP320. I don't know, it seems like every phone has two to three names in this product line, so frankly, I'm a little confused. Regardless, this model stood out to me because it's literally the only phone in the iPhone family to have the iPhone logo on it. Overall, in my opinion, this just seemed like a rushed and, do I dare say, lazy rebranding strategy, but whatever. Cisco owns the trademark. They can do what they want. But there's a certain fruit-flavored company that wanted the name. Apple first registered the website iPhone.org on December 16th, 1999, with trademark filings dating back to 2002 in China and Australia. In early 2007, Apple was gearing up to announce the first ever iPhone, and they wanted the name badly. And guess what happened one day after the Apple announcement? Cisco sued them. (intense music) (music stops) But it wasn't that exciting. The whole thing only lasted about 42 days. On February 21st, 2007, Apple announced they reached an agreement with Cisco. The full terms are confidential, but the agreement states both companies are free to use the iPhone trademark. According to Adam Lashinsky's book \"Inside Apple,\" Steve Jobs phone called Charles Giancarlo, a Cisco executive at the time, during his Valentine's Day dinner to talk about this issue. Ah, classic Steve Jobs tactic right there. And hey, I'm sure more drama will ensue when Apple wants the IOS name next, right? Heck, even InfoGear was working on a prototype tablet dubbed the iPad way before Apple released their own iPad. It's like Cisco and InfoGear somehow knew every name Apple wanted to use. Psychics. In the end, it all worked out, because when a consumer hears the name iPhone, I'm pretty sure they don't think about Cisco. So now that second question, did the InfoGear iPhone fail? Yes and no. If you look at it narrowly and see that they only sold a 100,000 units and it only lasted two generations, yeah, you can maybe consider that a fail. But failing isn't always bad. There's a lot you can learn from failing forward. And ultimately, the main factor in the iPhone's downfall was timing. It was positioned to be an Internet appliance, but at the time of Project Mercury's inception, only 10% of households had Internet access. So the market just really wasn't there yet. But hey, nothing ventured, nothing gained. Conversely, the InfoGear company itself still sold for $300 million. And I don't know about you, but that's a lot of money, and I would call that a win. Plus, the design of the iPhone can still be seen today in modern IP phones around the office. So perhaps some InfoGear inspiration trickled its way through the industry. And I believe Chaim, Yuval, and Reuven should be applauded for bringing life to Project Mercury many years ago at National Semiconductor. And I think another round of applause should go to Linode. Earlier, we used them to host FreePBX, but they can do way more than just that. If you have an application or website that you need to scale and deploy, Linode has the infrastructure and the 24/7 support you need. Linode offers out-of-box apps for game servers like \"TF2,\" \"CS:GO,\" and even \"Minecraft.\" You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system, or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. Visit linode.com/computerclan and click one of the sign-up buttons, and we'll give you a $100 60-day credit just for watching this episode. And when you do that, you're also supporting the Computer Clan, so thank you very much. Thanks for goin' on this journey with me, and I hope you enjoyed learning about the true original iPhone. Catch the crazy and pass it on. (upbeat electronic music) (phone ringing) Hello? - [Caller] We've been trying to reach you about your car's extended warranty. - Son of a b-!",
    "transcript_keywords": [
        "iPhone",
        "Internet",
        "phone",
        "CIDCO iPhone",
        "InfoGear",
        "Apple",
        "CIDCO",
        "National Semiconductor CEO",
        "InfoGear iPhone",
        "National Semiconductor",
        "Cisco",
        "Linode",
        "Project Mercury",
        "Internet connection",
        "ISP",
        "time",
        "secondgen iPhone",
        "Telephone",
        "Internet appliance",
        "Steve Jobs"
    ],
    "transcript_entity_values": [
        "ISP",
        "Big Planet",
        "Gabe",
        "Telnyx",
        "one day",
        "1988",
        "Yuval",
        "Gil",
        "Voice",
        "Big Planet Incorporated",
        "7.4-inch",
        "499",
        "Jeff Oscodar",
        "two",
        "VoIP",
        "640",
        "InfoGear iPhone",
        "National Semiconductor's",
        "ISP",
        "Mm",
        "jack",
        "ISP",
        "Bob",
        "one",
        "up to four",
        "480",
        "Ethernet",
        "about 75%",
        "Two",
        "CIDCO iPhone",
        "Internet Explorer",
        "early 2007",
        "November, 1995",
        "Amelio",
        "56",
        "1999",
        "Steve",
        "about 42 days",
        "VoIP",
        "Skype",
        "CIDCO Incorporated",
        "Three",
        "Circa 1995",
        "Memo",
        "many years ago",
        "the InfoGear Technology Corporation",
        "Project Mercury",
        "years",
        "Gil Amelio",
        "Apple",
        "Linux",
        "the next 10 months",
        "1,000",
        "Occam",
        "100",
        "Brent",
        "Remote Desktop Connection",
        "Cisco",
        "60-day",
        "FreePBX",
        "Charles Giancarlo",
        "Wi-Fi",
        "Mac",
        "iPhones",
        "the Plain Old Telephone Service",
        "DreamPi",
        "Call Return",
        "Akamai",
        "Braniac Brent",
        "1.5 billion",
        "\"Inside Apple",
        "first",
        "Bob Ackerman",
        "Joomla",
        "Nu Skin Enterprises",
        "Phone",
        "National Semiconductor, Chaim",
        "16",
        "December 18th, 2006",
        "two to three",
        "1998",
        "the InfoGear iPhone",
        "InfoGear",
        "Linux",
        "Linode",
        "years ago",
        "a Raspberry Pi",
        "Macworld",
        "three",
        "14.4k",
        ".47-microfarad",
        "USB",
        "Ken",
        "Telnyx",
        "\"Men in Black",
        "Wiffy",
        "IOS",
        "VTech",
        "380",
        "Linux",
        "Adam Lashinsky's",
        "December 16th, 1999",
        "CIDCO",
        "only one",
        "the Caller ID Company",
        "100,000",
        "24/7",
        "Craig Federighi",
        "Pi",
        "PowerBook",
        "Mario",
        "a Raspberry Pi 3 B+",
        "'90s",
        "TF2",
        "iPad",
        "Chaim",
        "today",
        "Krazy Ken",
        "the olden days",
        "Kazade",
        "Project Mercury's",
        "Minecraft",
        "only 10%",
        "Martha",
        "the Apple iPhone",
        "Today",
        "one megabyte",
        "1.7",
        "Windows",
        "Steve Jobs",
        "22 days",
        "nine-volt",
        "iPhone",
        "Information Phone",
        "hours",
        "3",
        "PSTN",
        "Flash",
        "the Computer Clan",
        "Compose",
        "May 7th, 1996",
        "February, 1996",
        "half",
        "The Telephone for the Next Millennium",
        "the CIDCO iPhone",
        "1000",
        "Craig",
        "Call Log",
        "Linksys",
        "China",
        "National Semiconductor",
        "1.6",
        "Big Planet",
        "June 5th, 2000",
        "Macintosh",
        "DreamPi 1.6",
        "$300 million",
        "LCD",
        "February 21st, 2007",
        "hours and hours",
        "January, 1998",
        "the next five years",
        "2002",
        "The CIDCO iPhone",
        "PITA",
        "RAM",
        "Reuven",
        "Mute",
        "2001",
        "Cisco",
        "the '90s",
        "second",
        "Intel",
        "Valentine",
        "Linode",
        "Australia",
        "69",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "LOC",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "DATE"
    ]
}