{
    "id": "_mHXxtXKJoo",
    "title": "Why IS This COOL Cable Dying? - TOSLINK Optical Audio",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-04-17T17:28:10Z",
    "video_url": "https://www.youtube.com/watch?v=_mHXxtXKJoo",
    "category": "Science & Technology",
    "tags": [],
    "views": 610043,
    "likes": 24331,
    "comments_count": 1535,
    "description": "Download Vikings War Of Clans for free below.  IOS:     Android:  Get 200 Gold and a Protective Shield for free Do their test and find out what kind of Viking you are  Bonus: get fast leveling tips from Einar the Wise  Why is the optical TOSLINK audio connector disappearing?  Techquickie Merch Store:   Follow:   Leave a reply with your requests for future episodes, or tweet them here:   License for image used:",
    "description_links": [
        "https://clcr.me/bh9ABl",
        "https://clcr.me/yaUqXK",
        "https://clcr.me/dXP9fD",
        "https://www.lttstore.com",
        "http://twitter.com/linustech",
        "https://twitter.com/jmart604",
        "https://creativecommons.org/licenses/by/3.0/legalcode"
    ],
    "transcript": "- Of all the technologies that we have right now that suggest we really are living in the future, perhaps nothing sounds more futuristic than the fact that we can transmit data with laser light. Indeed, many of the highest capacity cables that form the backbone of the internet use fiber optics. And fiber to the home connections that deliver very high speeds, have become more popular in recent years. But did you know that one optical technology that used to be pretty common place in home audio, is now getting replaced by good old fashioned copper? I'm not talking about CDs, which you can learn more about up here. I'm actually referring to the Toshiba Link or Toslink connector. If you're not sure what that is, there's actually a good chance you have one, on the back of your desktop PC. It's a square-ish looking connector that's lit up with red light. They were also extremely common, not so long ago when DVD players ruled the world. You see although Toslink was originally developed in the 1980s to connect CD players to other audio equipment, it made its way into DVD players and computers as an easy way to deliver digital audio over just one cable. So if you had a 5.1 surround setup for example, you could use a single Toslink cable to send a digital signal to a receiver that would then decode it. Rather than one RCA cable for every channel, which would suck and it did. And another cool thing about Toslink was that because it used light, it wouldn't suffer from interference from other nearby electronics. So what we had was a convenient, clean, futuristic pathway for high resolution audio. So why is it going away? Well one reason is that it's actually not very good at carrying signals over any kind of significant distance. Which is counterintuitive because those fiber optic cables on the ocean floor use light to transmit data and they work for huge amounts of information being sent thousands of miles away. So, what gives? The answer is in how the cables are physically constructed. Unlike higher spec, high bandwidth fiber optic cables, optical Toslink cables are often built with how you say cheap plastic as a transmission medium inside, contributing to the light attenuating or losing its strength as it travels down the pipe. This means that not only do Toslink cables have a maximum length of around 10 meters or 33 feet, but also that they are bandwidth limited compared to other solutions. The latest version of Toslink has data rates up to 125 megabits per second, which is certainly fast enough for a high res audio and even theoretically for high def video at the same time. But the release of HDMI in the early 2000s, created a very sticky situation for Toslink. Not only did HDMI offer a relatively easy one cable solution for both audio and video, even the very earliest versions of HDMI, were a lot faster than Toslink. Meaning they were not only good for consumer applications but also professional settings where users needed to work with uncompressed video or an audio. Despite the fact that HDMI just uses copper cables without any fancy optical data transfer, their construction meant that they could carry faster signals over longer distances. And Toslink cables also had a bad habit of breaking if you bent them too much due to their more rigid cores, something that HDMI cable could withstand a lot more easily. So as time went on, the industry concentrated on expanding the HDMI spec to support more and more audio standards such as losses DTS Master Audio, Dolby TrueHD, and the newer DTS:X and Dolby Atmos, which you can learn a lot more about up here. Toslink on the other hand was more or less left to languish. Although it certainly would have been possible to update the spec and make it compatible with newer fancier formats, no one ever really got around to it because HDMI largely made it irrelevant. But that doesn't mean that Toslink is totally useless today. It still works well as a simple hookup for a compressed digital audio like bog standard, Dolby digital or DTS 5.1 and you'll still find it on many soundbars out there as an easy way to connect to a display even if there's no HDMI out available. Even some small devices use mini-Toslink, which can be combined with a standard 3.5 millimeter Jack in order to save space. And if you're using a vintage or a audio receiver, maybe that doesn't have HDMI, so you gotta get to your TV somehow. So it's not quite dead yet, okay? Just don't tell those corners from Monty Python and the Holy grail. A reference from before you were born, probably. Speaking of death, today's video is brought to you by Vikings War of Clans. A strategy RPG game that is free to play and allows you to team up with your friends to build and battle together. You can do PVP or PVE, follow your character progression or play the economy and expand your city all while enjoying high quality visuals and a custom sound track. We play the sh(beeps) out of it here. I got 120 hours sunk in two days (giggles) We've played here at Lyons Media Group and I can tell you that a good choice would be to plan every battle strategically. But we'd like to go on with a giant army has no coordination and just see how the battle plays out because, why not? We're dumb. Download it for free now through the link below and get a bonus of 200 gold coins and a protective shield. Which is great for new players so you have time to catch up without worrying about being attacked. The Devs have also prepared a surprise for you. So, do the test and find out what kind of viking you are. And don't forget to join our vikings clan under the name Techquickie. Yes we have a clan and yes it's called Techquickie. So thanks for watching guys. If you liked this video, give us a thumbs up, give us a subscribe and be sure to hit us up in the comment section with your suggestion for topics that we should cover in the future.",
    "transcript_keywords": [
        "Toslink",
        "HDMI",
        "Toslink cables",
        "audio",
        "cables",
        "cable",
        "optical Toslink cables",
        "high",
        "fiber optic cables",
        "light",
        "good",
        "DVD players",
        "video",
        "HDMI cable",
        "single Toslink cable",
        "digital audio",
        "laser light",
        "DTS Master Audio",
        "fiber",
        "players"
    ],
    "transcript_entity_values": [
        "Toshiba",
        "125 megabits",
        "Techquickie",
        "120 hours",
        "thousands of miles",
        "around 10 meters",
        "one",
        "5.1",
        "RCA",
        "Jack",
        "PVE",
        "Devs",
        "200",
        "Dolby",
        "the 1980s",
        "Toslink",
        "Lyons Media Group",
        "Vikings War of Clans",
        "recent years",
        "vikings",
        "HDMI",
        "3.5 millimeter",
        "33 feet",
        "RPG",
        "Monty Python",
        "two days",
        "Dolby Atmos",
        "the early 2000s",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PERSON",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE"
    ]
}