{
    "id": "_mXJmO726Yg",
    "title": "Bitcoin is Going CRAZY",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-03-16T19:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=_mXJmO726Yg",
    "category": "Science & Technology",
    "tags": [],
    "views": 190140,
    "likes": 12824,
    "comments_count": 1122,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   What's behind the latest surge in Bitcoin?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- A while ago, we did a video covering the major Bitcoin decline that happened in late 2018 and what led up to it. But while many pointed to the Bitcoin crash as proof that crypto is just a fad or a giant bubble, it's come back in a big way, with Bitcoin recently topping 50,000 US dollars. It's gone up in value 15-fold since the crash. But why has Bitcoin swung back the other way so sharply? Part of the answer has to do less with the technology and more with a classic problem in economics: inflation. You see, as more and more money is added to circulation, the relative value of a dollar goes down over time. And while most economists agree that a low but non-zero rate of inflation is a good thing for reasons that are outside the scope of this video, the rate of inflation of the US dollar has been higher since around 2010 and hit a large spike recently with the government-issued stimulus checks, which pumped tons more money into the US economy. All this inflation devalues the dollar, making Bitcoin attractive as an investment because it's resistant to inflation, leading some folks to believe it'll end up holding its value better. But why is that? Well, turns out, it's actually written into Bitcoin's code that only so much of it will ever exist. Unlike a country's central bank, which can just keep printing money whenever its government wants, Bitcoin has a hard circulation limit of 21 million Bitcoins, and over 18 million of those have already been mined. Because the difficulty of mining increases over time, it'll actually take until the year 2140 to mine the remaining two million-plus Bitcoins. And although this has been true of Bitcoin since the beginning, the stimulus programs developed in response to the pandemic have caught the attention of people other than individual investors or folks mining Bitcoin on their home gaming rigs. Large institutions, like banks and well-known corporations, started recognizing Bitcoin's potential as a real store of value this year. BNY Mellon, one of America's largest banks, announced it would start holding Bitcoin for customers, and Apple Pay and Mastercard have started supporting Bitcoin payments as well. But one big criticism of Bitcoin has been the fact that folks who dabble in it aren't really doing more than mining it and trading it for actual currency. They're not using it to buy TVs or burritos or whatever. But the idea that Bitcoin could become a more mainstream way of paying for actual stuff is gaining more traction, as Elon Musk's Tesla notably bought a billion and a half dollars' worth of Bitcoin and announced customers could use theirs to pay for their cars. And it helps to remember that Bitcoin is still a relatively new player on the financial scene. I mean, it was only invented in 2008, and it was only 11 years ago that a programmer spent 10,000 Bitcoins on a couple of pizzas. Oof. This means that the infrastructure that underpins Bitcoin has needed time to mature. And it has, to a large extent, with prospective exchanges making it easier than ever to buy and sell crypto. Of course, that doesn't mean that these exchanges aren't still vulnerable to manipulation by folks carrying out pump-and-dump schemes, which we explained in our previous video on the 2018 Bitcoin crash. However, as Bitcoin rises in popularity and value, government regulators are taking a much harder look at cracking down on market manipulation, which may help prevent drastic drops in value in the future. Don't get us wrong, though. Bitcoin isn't well-regulated yet. And it still is very much a speculative investment. So we're not telling you to dump your life savings into it, but it seems that more and more people have been willing to take a chance on it, as interest rates are currently being kept low to encourage borrowing and spending during the recession caused by the pandemic. These low rates also mean that many people aren't getting as high of a return on their investments as they're used to, further fueling interest in Bitcoin. If you choose to buy some, though, keep your fingers crossed that Bitcoin mania will last longer than the Beanie Baby bubble. I still haven't recovered from that. Thanks to FreshBooks for sponsoring this video. FreshBooks is an easy-to-use accounting software designed specifically with you in mind, the small business owner. FreshBooks has everything you need to manage your books: invoices, expenses, time tracking, and more. It's designed to be easy to use with built-in automation, so you spend less time dealing with accounting and more time focusing on your craft and doing what matters most: growing your business. Whether you're a tradesperson, a creative agency, or a YouTuber, you can choose a plan that's right for you. Plus, they have an award-winning Toronto-based support team, who are always happy to help if you need it. Try FreshBooks for free for 30 days today with no credit card required at freshbooks.com/techquickie. So thanks for watching, guys. If you liked this video, hit like, hit subscribe, and why not hit us up in the comments section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "Bitcoin",
        "major Bitcoin decline",
        "Bitcoin crash",
        "major Bitcoin",
        "Bitcoin decline",
        "covering the major",
        "decline that happened",
        "happened in late",
        "Bitcoins",
        "Bitcoin recently topping",
        "inflation",
        "time",
        "Bitcoin swung back",
        "folks mining Bitcoin",
        "video",
        "Bitcoin recently",
        "crash",
        "mining Bitcoin",
        "video covering",
        "folks"
    ],
    "transcript_entity_values": [
        "non-zero",
        "America",
        "30 days",
        "one",
        "US",
        "Tesla",
        "a billion and a half dollars",
        "2018",
        "this year",
        "Mastercard",
        "Apple Pay",
        "10,000 Bitcoins",
        "FreshBooks",
        "around 2010",
        "BNY Mellon",
        "Toronto",
        "late 2018",
        "21 million Bitcoins",
        "15-fold",
        "Bitcoin",
        "50,000 US dollars",
        "over 18 million",
        "two million-plus",
        "Bitcoin",
        "Elon Musk's",
        "YouTuber",
        "2008",
        "tons",
        "only 11 years ago",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "PERSON",
        "NORP",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE"
    ]
}