{
    "id": "_OjQIh4Ro5A",
    "title": "How to Turn on the Mac Startup Sound - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-03-12T20:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=_OjQIh4Ro5A",
    "category": "Science & Technology",
    "tags": [
        "How to Turn on the Mac Startup Sound - Krazy Ken's Tech Talk",
        "How to Turn on the Mac Startup Sound",
        "Apple",
        "Mac Startup Sound",
        "Mac Chime",
        "MacBook Pro",
        "macOS",
        "macOS Mojave",
        "macOS Catalina",
        "dosdude1",
        "Mac Terminal",
        "Terminal",
        "how to re-enable the Mac sound",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan"
    ],
    "views": 356537,
    "likes": 8413,
    "comments_count": 886,
    "description": "Apple brought back the Mac startup sound, but it sounds different? Today, we'll take a listen, and show you how to re-enable the sound on your Mac! Check below for the Terminal command and more  UPDATE: in macOS 11 Big Sur, Apple has officially implemented an option to turn the startup sound on or off.  Watch our start up sound history video   Watch more videos like this!   Want to be in the shows credit roll?   Subscribe for more tech videos!    Follow the us on Twitter   Like the us on Facebook    Krazy Ken's Tech Talk - How to Turn on the Mac Startup Sound  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Get dosdude1's ChimeEnabler    Special thanks to Greg Hrutkay (from Hrutkay Mods). Watch his tech channel here:   Terminal Command: sudo nvram StartupMute=%00 NOTE: This command did not work in our macOS Mojave test. You'll likely need the latest macOS 10.15.x (Catalina) update for this to work!  Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen #ComputerClan",
    "description_links": [
        "http://bit.ly/clan2Gdujxd",
        "http://bit.ly/clan2UrG7G5",
        "http://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://Patreon.com/KrazyKen",
        "http://dosdude1.com/apps/",
        "http://bit.ly/clan2WxsUNc",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(clicks) (chiming) - Shh, have a listen. (keyboard clicking) (computer chimes) Oh, yeah, the sound is back, but did it sound a little bit different to you? Huh. (electronic music) Hey, guys, how you all doin'? Really, that's just great. You know, I'm doin' pretty great today too because Apple finally brought back the iconic Mac start up sound. But the weird thing is it sounds a little bit different than normal. But we'll take a listen to that in a bit and analyze it. For now, let's take a look at how we can actually re-enable the Mac start up sound. (whooshing) First, open the Terminal then enter sudo nvram Startup Mute=%00 hit Return, enter your password then hit Return again. Then reboot your Mac and enjoy. (computer chimes) And if you want to disable the sound, replace the %00 with %01. Now if you don't wanna use the terminal, dosdude1 released a handy app on his website. Go ahead and download that and run that instead. This will let you turn the sound back on or off without using the command line. You know, I find it kind of amusing that Apple back peddled in a way and let you re enable a feature they killed off for years. In fact when they did kill it off, we did a little history video about the Mac start up sound and we also said, \"Bring back the bong.\" So I guess in a way Apple kind of listened to us. But anyway, if you haven't checked out that history video do check it out because its a good one. Anyway, now that we have the sound back we can be happy again. But like I talked about earlier, it does sound a little bit different. In fact, several of you on Twitter pointed that out to me as well. So it's not just my ears going crazy. So let's compare it and take a listen. (whooshing) Here's the start up sound playing on my 2013 MacBook Pro, which comes with the sound turned on by default. (computer chimes) Now here's the sound playing on a 2018 MacBook Pro, which does not have the sound on by default. (computer chimes) It sounds a little lower pitched, doesn't it? Is it the different speakers creating this effect? Well that's what I thought at first but then I thought, maybe not. In fact if we go into Mactracker on the same computer and play the start up sound file, you'll notice it doesn't sound lower pitched. (computer chimes) So try it out for yourself, let me know what you think. I know not everybody likes the start up sound, but if you don't like it, you can keep it turned off. I like it so I'm gonna keep it on even though I have an older machine and it's already on by default. Whatever. I'm happy, to each his own. Thanks dosdude1 for creating that handy app. Thanks Greg Hrutkay from Hrutkay Mods for convincing me to make this video. And thanks Maniac Mike for actually loaning me your computer so I could do this. 'Cause, I still have this 2013 system. You guys are all great. Thanks for sticking with me everybody. Catch the crazy and pass it on. (pumping electro music)",
    "transcript_keywords": [
        "sound",
        "Mac start",
        "Mac",
        "start up sound",
        "start",
        "back",
        "bit",
        "sound back",
        "Apple",
        "hit Return",
        "sound playing",
        "sounds",
        "great",
        "listen",
        "Return",
        "default",
        "iconic Mac start",
        "Pro",
        "MacBook Pro",
        "fact"
    ],
    "transcript_entity_values": [
        "Maniac Mike",
        "MacBook Pro",
        "years",
        "Apple",
        "the %",
        "Mac",
        "2013",
        "Mac",
        "today",
        "2013 MacBook Pro",
        "Terminal",
        "dosdude1",
        "Mactracker",
        "first",
        "00 with %",
        "2018",
        "Twitter",
        "Hrutkay Mods",
        "First",
        "Greg Hrutkay"
    ],
    "transcript_entity_types": [
        "PERSON",
        "EVENT",
        "DATE",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERCENT",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON"
    ]
}