{
    "id": "_PFXssNKGLA",
    "title": "Surface Laptop 3 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-02T15:30:04Z",
    "video_url": "https://www.youtube.com/watch?v=_PFXssNKGLA",
    "category": "Science & Technology",
    "tags": [
        "surface laptop 3",
        "microsoft surface laptop 3",
        "microsoft surface",
        "microsoft",
        "surface",
        "surface laptop",
        "surface laptop 2",
        "surface pro 7",
        "best laptop",
        "surface pro 6",
        "surface pro",
        "new laptop",
        "microsoft laptop",
        "windows 10",
        "surface book",
        "surface book 2",
        "laptop",
        "laptops",
        "microsoft event",
        "event",
        "keynote",
        "microsoft keynote",
        "hands on",
        "first look",
        "review",
        "microsoft surface pro 6",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 556749,
    "likes": 5546,
    "comments_count": 428,
    "description": "Microsoft announced the new Surface Laptop 3, a successor to last years Surface Laptop 2, which is now available in two different sizes and with two different processors. Its the first Surface Laptop model to be available in a 15-inch version, and the first Surface product to use an AMD processor.  Surface Laptop 3 hands-on  read more:  Microsoft Surface Neo first look:  Surface Pro X and Surface Pro 7 hands-on:  Surface Earbuds hands-on:  Top announcements from Microsofts Surface event:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2ovb5za",
        "http://bit.ly/2owUIC3",
        "http://bit.ly/2owDKnv",
        "http://bit.ly/2n4Dpbi",
        "http://bit.ly/2n1n9I0",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(techno music) - Hey, this is Dan with \"The Verge\", and this is the new Surface Laptop 3 from Microsoft. As you can see, it's actually two laptops. It's the Surface Laptop 3, 13 inch, and the Surface Laptop 3, 15 inch. They're really similar, but they're a little bit different in some important ways. The Surface Laptop 3, 13 inch is gonna be pretty familiar if you already know the Surface Laptop and the Surface Laptop 2. It's got the same size screen, same dimensions, same kind of overall design. There are a few design differences to be aware of, though. It's got a bigger track pad, Microsoft says it's 20% bigger than before. It's got a new USB-C port on the side here, which you can use for video, and data, and charging. It's a USB-C 3.1, it's not Thunderbolt 3, so you can't use an external GPU with it, but you can still output to a display. And the other things, is it comes in new colors, as you can see this is the sandstone gold type of color. You can still get in black, blue, or silver. And as part of the sandstone color and as part of the black color, it's got a new aluminum deck. So, instead of the Alcantara fabric that you get on the blue or the silver models, you got a, kind of a familiar, traditional, standard aluminum deck here. Otherwise it's basically the same Surface Laptop as before, but with upgraded internals. This has Intel's tenth generation IceLink processors. You can get them in Core i5 or Core i7 variants. So it's got the latest generations from Intel, and it's gonna perform better than before, but it's gonna be a very similar experience. (techno music) The Surface Laptop 3, 15 inch is a whole new thing. But as you can tell it still looks really familiar. This is basically if you took a 13 inch model and blew it up to a 15 inch size. So you got 15 inch display, got a slightly bigger keyboard, slightly bigger track pad than even on the new 13 inch model. But otherwise everything's gonna be pretty familiar. Same clamshell design, same overall wedge shape. The 15 inch only is available with the aluminum deck, you don't get the Alcantara option on it. But you still have the surface connector on the side, you still have the USB-C port, USB-A port, and then your headphone jack. Inside the Surface Laptop 3, 15 inch is a new processor that is not available in the 13 inch model. Microsoft worked with AMD to put a Ryzen 5 or a Ryzen 7 chip in this. And they worked with AMD to create a custom Surface edition of this chip that's got a little bit more graphic power than your typical Ryzen set up. Now Microsoft says that it put this processor in the 15 inch model because they were able to get better graphics performance out of the integrated chips than they can on the Intel side. And they expect that with a 15 inch laptop, you're gonna be doing more 3-D demanding things, whether that's in CAD or Photoshop, maybe some light video editing. That's not to say this is a gaming laptop. You're not gonna be doing 60 frames per second in Tomb Raider or other AAA games. You might be able to do some light gaming on it, but this is still a 3.4 pound, under 15 millimeter thick, portable laptop. This isn't really like a big gaming rig. (soft techno music) So those are the new laptops from Microsoft, the Surface Laptop 3 line. The 13 inch is gonna start at $999, the 15 inch starts at $1,199. They're available for pre-order starting today, and they're gonna be shipping on October 22nd. We're gonna have way more to say about these once we get them in for a proper review. This was our first preview, first look at them. So be sure to stay tuned for that. And also be sure to check out our other coverage on everything else that Microsoft's announced today. There's the Surface Pro 7, Surface Pro X, and something new, like a Surface Neo. I think we've got an exclusive look at that as well. So check it out, theverge.com, YouTube.com/theverge.",
    "transcript_keywords": [
        "Surface Laptop",
        "Surface",
        "Laptop",
        "inch",
        "Surface Pro",
        "Microsoft",
        "inch model",
        "Verge",
        "Dan",
        "inch laptop",
        "USBC",
        "Surface Neo",
        "laptops",
        "Intel",
        "USBC port",
        "Ryzen",
        "model",
        "bigger",
        "familiar",
        "design"
    ],
    "transcript_entity_values": [
        "Surface",
        "the Surface Pro 7",
        "3.4 pound",
        "AMD",
        "999",
        "20%",
        "GPU",
        "Surface Laptop",
        "13 inch",
        "The Verge",
        "USB",
        "Tomb Raider",
        "15 inch",
        "today",
        "CAD",
        "October 22nd",
        "60",
        "Alcantara",
        "Photoshop",
        "15 millimeter",
        "Ryzen 7",
        "3",
        "AAA",
        "1,199",
        "two",
        "jack",
        "Ryzen",
        "Core",
        "second",
        "Surface Laptop 3",
        "Microsoft",
        "first",
        "Intel",
        "Dan",
        "the Surface Laptop"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERCENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "LAW",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG"
    ]
}