{
    "id": "_rBO8neWw04",
    "title": "Detergent packs are kinda wishy-washy (Dishwashers Explained)",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-12-20T15:45:35Z",
    "video_url": "https://www.youtube.com/watch?v=_rBO8neWw04",
    "category": "Science & Technology",
    "tags": [],
    "views": 5514871,
    "likes": 171944,
    "comments_count": 21576,
    "description": "Ever wonder how dishwashers work? Are you ever bummed by the performance of yours? Well, this video can answer your question and possibly provide you with a solution! There's a PART 2:   Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. It's how I can yell at Cascade with aplomb! If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! Sebastien De Groof, Robert T Kirton, Alex Ferriroli, Juha Kuikka, Maggie Danger, Jay 'Unionize Everything Except Cops' Logan, Conduit of Queerness, Mage of Life, Matthew Lowe, An Ho, Steven Byrum-Bratsen, Sean Callinan, Scott Schreiber, Mitch Buchan, Sarah Collie, Maxime Andr, Chaos215bar2 , Michael Grados, Daniel Nefzger, Matias Mariani, Christopher Barback, yetanothername , Synoiz , Chip , Ulises Vargas, Jennifer Rae Fuchek, Adrian Bridgett, John Gjonola, Yannick , Chad Gertz, Zhongchao Qian, Sean Murphy, Erica Eagles, Robey Pointer, Hayden Taylor, Aimee Kidrick, Alexander folk, Matt Gibbons, Omnizen, Zach Bean, mstar27, Jack Knight, Peter Bergstrm, Peter Amling, David Ziemlak, GGreathouse , Stephen A. Wilson, Sam Becraft, Chris Benejam, Veronica Cary, Vincent Sandstoe, Robert Mikhayelyan, Corey Ogburn, Harlan , Mike Stunes, William Leonard, Cory King, Matt Braun, Eugene Arutchev, Steven Fazzio, Harrison Co, Michael Cafarelli, Gabriel, Justin Patriquin, Olof , Vincent Venezia, Doug Wallace, Brad Quinn, Jim Puls, Zachary W Collins, Alex, Ross James, Jonfidential, Lillian Fleming, Jason Durbin, Kevin McClaning, Keith Ditchman, ventusignis, Jeremy Iamurri, Michael, Skoddie , Alix Odendhal, bd_, Benjamin Gouveia, Ryan Doucet, Billy, Sean Crocker, Phillip M, Robert Cole, iain , Ross Carter, Jakub Strzyewski (jeikobu__), Robert Fares, Neptunium Fluoride, Fangzahn Aviation Studios, Aaron Binns, Matthew Yu, Johannes Wller, Adam Golden, Rustmane Skytrekker, John J Yang, Matthew Hilder, leastbad, Joe Pannullo, Alex Conner, Colin Williams, Alex Lindeman, Jim Gilsinan, Kohana Coyote, Michael Goode, Julian Freeman, Ed Torres, Jon-Hkon Rli, Matt Wright, Gunplumber , Bane Williams, Villodre , vinny rapisarda, Manuel Garcia, Matthew Lucas, Doomerdinger , Udo Strass, Jonathan Polley, SomeonesGonnaPayForThis , Thomas Rowan, Robert Valdimarsson, Atsumari, Alex Groom, Blythe Rathi, Brian Beck, Billiam , LazySpoon, Greg Lindsey, Robert Haynes, David Nelson, Eli Youngs, Paul Hackett, Alex H., John Curley, Benjamin Dykstra, Dan Cortes, Vy-let Cybra, Joseph Fickus, Raymond Ernesto Coln, Mike Berman, Kay Ohtie, Cysioland, Pathite , Mr.Bright, Frode Hauge, Stu Kabakoff, Carmichael Keane See, Chris Jordan, Steven V, Brian & Laura, Brian Holder, Mindy B., Patrick Khl, NoFriendsThatSlav , Jeremy Whaling, Sunshine Heart, VMRosetta, Nathan Walters, Michael Yeo, Massimo Fierro, Grant Blayney, Jake Sanders, William McKinnerney, Elizabeth, Amy Cable, Rafael De Los Santos, heyitsleo , Paul Sutton, Timothy Dunn, Duncan Sanford, Jack Alderson, Eric Kalenak, Lukas Svec, Mike Nichols, Roman, Ari Kestenbaum, Sean Harding, Bryan Helmig, Luis Calvo Mayo, Felix Huang, Blake Palacio, Jonathan Cotton, Isaac , Spencer Golde, William Willing, Pedro Soto, Vincent McBeigh, Ramon Perez, Xtr3m3 , Steve Fallon, Punkey , Sascha Strau, Scott Kuker, V. Legrand, Igor Cananea, Shane Chambers, Jacob Oost, Donald Garwood, Aeryn Light, Brian B., CyborgHobbit , Dan Basterfield, Casey Keeney, James FitzGibbon, MegaZone , Brian Ingalls, Aaron Carson, Erik T, Gregg Medley, Zackary Wojtan, Cody Bittle, Patrick, Andrew Hoddinott, Benjamin Rister, Shay Sandik, Daniel Marcinkowski, Jayde Coler, Fauxfreshness , Patrick Kennedy, Jesse S, Oswyn Brent, A tall shade of the color red, Colin Gagich, Mike McCaffrey, Michael Olpin, Charles Hayward, Andrew Krew, Devedander, Bryan Countryman, David McGrath, Richie Gaiser, Matt Christensen, Ben, Truls Zhong Konstali, Cuervo , Mauve Co, Martin Rempel, Eric Graves, Philip Cheek, Alexander Schlickenmaier, Jesse Weaver, Thomas Kula, Ed McCloskey, Harold Godwinson, Johann Thomsen, Jordan DeLong, Keith Hemenway, Aaron Greenberg, Matt Brown, Benjamin Douel, mooncow , Oliver White, Andrew Eslick, Brent Medling, Joel V, Philip Rehorst, John Harris, Mike and Zack, DCBuffalo, Emilio Mendoza, Patricia , Cody, Henry Dwyer, Colin Coyle, Cuddlefisch , nate grover, Martin Smith, Darryl !, bagel mode",
    "description_links": [
        "https://youtu.be/Ll6-eGDpimU",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "These things annoy me. This is a dishwasher detergent pack, actually one of two that came with my new dishwasher. Detergent packs have become wildly popular lately, and ya know what? Thats cool. I get it. No mess, pre-dosed, convenient. Those qualities are worth a premium! Just dont eat them. I cant believe that ever needed to be said Trouble is, these fly in the face of the way most dishwashers are designed to operate. Including the one this came with! I have a feeling these guys are responsible for a lot of dishwasher dissatisfaction these days. See, if you use them exclusively, you may be significantly limiting your dishwashers ability to clean. Now, have no fear, your Tide pods are fine. This problem affects dishwashers specifically. To understand why, lets take a look at a dishwasher so we can learn how it works. Luckily, I have one! Riiiighhht here. [various shuffling and struggling] [struggling intensifies] Hi. This is a fairly typical and basic household dishwasher built for the US market. Cue the comments about how European models are different. Actually, yes, before we go too far - my experience is with the North American market and there seem to be vast differences between the continents. I suspect the main point of my video here will apply to many of you over there, but I could be wrong and in any case Im sure there are lots of particulars that will seem odd or different. Please do comment about them, it boosts engagement! On that note - before we get into the main point, theres a bit of advice I want to give to North American viewers specifically. Our dishwashers... [audio fades] [voiceover] OK I spent way too much time on this. Basically, because its always been this way, North American dishwashers are hooked up to hot water. Now, because of this, they dont expect to heat the water for the first rinse. But, since you probably dont get hot water right away at your kitchen sink, it might start washing with cold water and that alone will really affect performance. If you arent already in the habit of doing so, you should run your kitchen faucet until you get hot water before you start the dishwasher. Since the dishwashers almost always hooked into the kitchen sink, this ensures it starts washing with hot water. Yes, this wastes a bit of water, and the entire practice of hooking it into hot water is questionable in the first place, but thats just the way it is and if you think your dishwasher sucks you should really try this if nothing else. Anyway... Being a more basic model, this dishwasher is constructed mostly out of plastic. Normally its installed under the countertop which is why they only bother to give it good looks on the one side, though so-called portable models (which really just means theyre on wheels and dont require permanent installation) as well as countertop models are available if uncommon. Also, comes with this nice blanket to keep it warm! Or maybe its for sound-deadening. Probably that. Dishwashers are actually very simple appliances and they havent fundamentally changed since, well, since they were invented, actually. Thats right, Josephine Cochranes dishwasher design [she later changed the spelling of her name, pedants] patented all the way back in 1886 and considered to be the first modern automatic dishwasher, worked more or less exactly how this one does. And really, that shouldnt be too surprising because its not like the physics of washing dishes have changed from then to now. Speaking of, how does one wash dishes? Great question! First, you get some dishes. Then, you use them to help you prepare and consume a meal. After thats done, now ya got dirty dishes! To clean them, all youll need is some hot water, some soap, and something to scrub with. Fill your sink up with some hot water, add some soap, and go all scrubby scrubby. The mechanical action of your scrubbing combines with the cleaning actions of the soap and the heat of the water to break food residue apart and release it from the dinnerware. Now just give it a good rinse and you have a clean plate or whatever. And if you work in a commercial kitchen, dont forget to fill the third compartment of your three compartment sink with an approved chemical sanitizer solution or extremely hot water. Remember: Wash. Rinse. Sanitize! But heres the thing - you dont actually need something to scrub with to wash dishes. Scrubbing with a towel, sponge, what have you imparts mechanical force on food grime releasing it from plates, silverware, et cetera. Water by itself can accomplish the same thing, though. Ask any canyon and itll tell you just how abrasive water can be. Well, OK were not talking about erosion here but water is heavy stuff. A jet of water can impart a fair bit of force simply because its moving at high speed and has a substantial mass. Youve sprayed dirty boots with a garden hose before. Or something like that anyway, so youve seen this first hand. Dishwashers use this same principle. Combine it with a bit of soap and time, and youve got automatic dishwashing. Now, you could simply use the water in your homes pipes, send it through nozzles to create jet streams from the pressure, and spray the dishes but that would be very wasteful. So instead, dishwashers fill themselves with some quantity of water and use an electric motor to drive a pump which creates its own pressure. The same water will be recirculated through the dishwasher for long periods of time, which also means that any detergent thats added stays in the water and doesnt get flushed away immediately. How and when detergent gets added to the water is important. Foreshadowing. When necessary, a second, smaller pump is used to drain the water, although the mechanical particulars there vary from model to model. Inside the dishwasher are a series of sprayer arms which, you guessed it, are armed with sprayers. The main pump sends the water it moves into these arms which, by restricting the flow from the pump and causing a build-up in pressure, create a series of waterjets to be directed at the items to be cleaned. The jets are pointed in all sorts of different directions, a definitely deliberate design decision, distributing a deluge of detritus decongestant directly at dirty dishes. Importantly, the spray nozzles are arranged so that the reactive force produced by the water exiting the nozzles causes the arms to rotate for more complete cleaning coverage. Lets now take a look at the various components of this dishwasher. The large plastic box which forms the bulk of its structure is called the tub. Its not always plastic, and for a name like tub it seems to be on its side, but it is the tub nonetheless. A small cavity at its bottom known as the sump houses the pump assembly and provides much of the space for the water that it will fill itself with. When cleaning, the pump takes in water through these filter screens and forces it through a pair of pipes which lead to the sprayer arms. One pipe leads directly to the bottom sprayer, and in this case theres a suspended sprayer arm below the top rack as well as an adowable wittle one at the very top; those two are fed by a pipe traveling up the rear of the tubs exterior. All of the mechanical bits of the dishwasher hang from the bottom of the tub, and you might be surprised at how few there are. Only four things need to be controlled here. First theres a solenoid valve which allows clean water into the tub. Second there are the two electric motors that drive the pumps - the large one provides the pressure for cleaning and discharges through the sprayer arms, and the smaller one discharges to this hose for draining. And finally there is the resistive heating element, with its terminals protruding through the tub here. And thats it. Since this is a modern dishwasher there is a microprocessor at the helm, and it monitors a few sensors. This one here is a mechanical float switch which signals that the tub is full. However, this is a backup input. It doesnt actually fill the tub anywhere near this full - instead, there is a second, hidden sensor here. I suspect the float switch is there mainly to guard against overfilling in case the main sensor fails or the solenoid valve gets stuck open. Or some other thing. Lastly, there is a temperature sensor which helps it know when it needs to heat the water. Oh, and of course there is also a door switch so it can tell if the door is open or not. Speaking of the door, now lets talk about the door! This is where the brains of the operation are, including the logic board and user input panel, as well two more things the dishwasher has control over. Built into the door at the top is a vent that opens when drying, and about midway up the door on the inside is the star of the show: the detergent dispenser. See, because of how dishwashers work, it would be best for it to be able to release detergent into the tub at a specific point in the cleaning cycle. That is after all the entire point of having a detergent dispenser. It wouldnt bother with one if it didnt want control over when its introduced to the wash water. And this is where, in my opinion, dishwasher detergent packs are making things worse for all of us. Well, those of us with dishwashers, anyway. To explain what I mean, we need to observe the dishwasher in action and uncover its sequence of operations. When a cycle is started, after running the drain pump for a while to get any stray water that might be in the tub for whatever reason out of it, the water inlet valve is opened and water is let in. Once its full, it runs the main pump and starts cleaning in earnest. Remember that this water isnt being heated by the dishwasher, so unless you ran your kitchen tap this may be stone cold. Because the dishwasher has filled itself with so little water, hardly even a gallon (or 4-ish liters) it cant run the bottom and top sprayers at the same time. So, it periodically switches which ones are cleaning. I believe it accomplishes this simply by reversing the direction of the pump motor, as I dont see any sort of valve anywhere. When its not cleaning the bottom rack, water is redirected out the rear supply pipe and sent into the top sprayers. This does have the unfortunate side-effect of making the wash cycle much longer, but comes with the benefit of reduced water usage. In many dishwashers, including this one, the impeller of the main pump acts something like a garbage disposal. It shreds food particles apart so that they can easily be drained and wont harm your plumbing. This isnt universal, though - some dishwashers, notably models made by Bosch, instead use filter screens to trap particles, and these require periodic cleaning. Sounds gross, but whatever. This dishwasher is of the pulverizing variety, and its actually got a really clever design feature. The bottom sprayer arm shoots jets of water along the bottom of the sump to push solids into the main pump intake where they will be shredded into gloop. Neat! This first fill of water is responsible for well, a lot. The dishes are as dirty as theyll ever be when you first start the dishwasher, and theres a lot of grime to take care of. That means this fill of water gets filthy fast. So it doesnt spend much time with this water. Only about fifteen minutes. It then drains it away. And it fully expects this water to be friggin nasty. The next step in its program is to fill with just a bit of water, and run the pump in a few short bursts. This dilutes whatevers left of the nastiness (after all there will always be at least some water left in the sump from the last fill) and probably helps ensure the pump doesnt clog. It then drains this small quantity of water. Now, notice that this entire time the detergent dispenser has remained closed. Because the first fill is the nastiest and also the shortest, it doesnt make sense to release the detergent right away. Again, that is the entire reason the dishwasher has a mechanism to hold and release detergent. It has to get the nasty stuff out first, and if it had released the detergent, well the detergent would have left with all the nasty stuff in the first 15 minutes of the cycle. Thats no good. But wait, you say. Isnt detergent, like, there to help it clean? Wouldnt it be good to have some in the first fill to help it get more gunk off faster? Why yes! It would! And this is why many dishwashers, and in fact every single model Ive encountered personally, have not one... but TWO places for you to put detergent. One of which, the pre-wash compartment, is open to the tub to release detergent immediately for the first fill (in this case through these little vents) and the other, the main wash, is sealed until the dishwashers program calls for it. Are you starting to see why I dont like detergent packs? Quick note, for those of you with dishwashers that dont have a pre-wash basin, hold your commenting fingers because well get to you. So, this dishwasher like many, many others out there is designed with the expectation that some detergent will be in that first fill, and that *more* detergent will be available to it when it wants it. And sure enough, after it drains the real nasty water out of itself and does that little purge routine, it fills up with fresh water, this time completely, so it can start cleaning again. Shortly after it begins, it opens the detergent dispenser. It spends a long time with this water: nearly an hour. With most of the real nastiness long gone, it can really work to clean the stubborn bits with very soapy and mostly clean water. This is also where it turns on the heating element to heat the wash water further, if needed. Which, since 15 minutes has passed since the last fill, is almost a given. Again, we might want to rethink this whole dishwashers are hooked up to hot water business because I think it might be more harmful than helpful. Your water heater ends up heating a bit of water that gets cold again by the time the dishwasher actually needs it. Its not great. Now, after its done cleaning, it needs to rinse your dishes to make sure theres no detergent left on them. To do this using as little water as possible, this dishwasher takes special care in the draining of the main wash. It adds a bit of water while the drain pump is still running to dilute whats left in the sump. Then it does the same small fill and purge routine it did after draining the first fill. This further dilutes whats left. And to be extra extra sure the detergents gone, it again lets water in at the same time it drains the purge water. Finally, it fills completely and pumps the rinse water around for about a half hour while also heating it. If you have a sanitize option, this is when that happens. In the US, the rinse water will be heated to at least 150F per the NSF specification on residential dishwashers. After the final rinse, it drains this water away and runs the heating element to dry the dishes, if desired. Lets step back a moment. What do we need detergent for in the first place? What does it actually do? Well, a number of things. Dishwasher detergents are concoctions of various chemical surfactants and enzymes with three particularly useful properties for washing dishes automatically: it helps break down proteins in food, and it acts as an emulsifier and a dispersant. They also dont produce suds, an absolute necessity when pumping water around in a machine. This is why you cant use plain dish soap in a dishwasher - otherwise, this happens. Fun. Except, not at all. Oh, and dishwasher detergent is the main reason some things arent dishwasher safe. Its more aggressive than just plain soap, and so can harm certain items or finishes. Anyway, you know that oil and water dont mix, right? This presents problems when cleaning dishes because we often have various oily substances in our food which in turn end up on the dishes. Emulsifiers can ease the tensions between oil and water. Dishwasher detergent, and in fact soap more broadly, is an emulsifier. It allows oil and water to mix by encapsulating tiny oil droplets in structures called micelles which then become suspended in the water. The emulsifying action of the detergent thus allows you to clean oily things using water. Fun fact! Egg yolks are an emulsifier, which is why eggs are often called for in recipes for baked goods where oil or butter is to be mixed with flour and water. You need them to keep the oil or butter from separating out of the batter, dough, etc. Which leads us to the dispersant properties of detergent. Dispersants, also known as dispersing agents, are used to keep you in suspen - I mean keep things in suspension. I will now read this amazing sentence from Wikipedia: Dispersants are widely used to stabilize various industrial and artisanal products, such as paints, ferrofluids, and salad dressings. The main benefit of having a dispersing agent in the dishwasher detergent is that it helps keep oil droplets, food particles, what have you in suspension so they dont settle out of the water and form a nice buildup of residue. Cause thatd be gross. Plus, it keeps them from redepositing on the dishes, as that would be counterproductive. So basically, detergent helps break down food things and helps them mix with the water which makes the water more effective at getting food things off plates and stuff. Thats a really simple way to put it but its more or less correct. And so I ask you, would it not be beneficial to have some detergent from the beginning? After all, if the point of the first fill is to remove and pulverize the biggest, nastiest, grossest food bits and get them out of the wash water quickly, would we not want it to be able to emulsify oils and break down proteins, remove more food particles as a result, and keep those particles in suspension until it can drain them away by adding a little bit of detergent to the water from the start? Personally? Yes. I want that. And these little buggers have taken this away from me and you and everyone you love. Well, OK, thats not strictly true, but their popularity has caused most consumers to bypass the very helpful and in my opinion necessary addition of detergent in the first pre-wash fill. Dishwashers can clean much more effectively if they have detergent in both the initial fill and the main wash. You really shouldnt need to pre-rinse the stuff you put in a dishwasher because thats what the first fill does! Without detergent in it, though, it cant do nearly as good a job. And now that detergent packs are the de facto form of detergent, your dishwasher simply doesnt work as well as it should. I mean, look, this box of Cascade powder even says For best results, fill both the pre-wash and the main wash cups completely. How am I supposed to do that with one of these, Cascade Lets do some experiments, shall we? Ive prepared a few pairs of dirty plates soiled with various grossness. Here we have baked-on pasta sauce. This bowl is filled with remnants of pancake mix. We have a plate on which scrambled eggs were eaten. And finally, theres 2 tablespoons of butter and about a quarter cup of shredded cheese microwaved to make this mess. And, these have been sitting undisturbed for about 3 days. Yummy! Ill be running them through a normal cycle on this dishwasher, but Ill be stopping it after it drains the first fill so we can see how much gets done in that first 15 minutes. The water entering the dishwasher will be as hot as the tap allows. For one run no detergent will be added to the pre-wash basin, and for the next run there will be. And its nothing special, just this Great Value lemon scented gel. Lets see how it goes. Heres the first attempt. Remember, theres no detergent in here at all; its cleaning with water only. Its doing surprisingly well at getting the pasta sauce off. That waters looking pretty gross and here it comes. Look at that deliciousness. Mm-mm good! Now, lets do this again but this time with some detergent. Its been placed in the pre-wash area and you can see it oozing out. Actually, it doesnt need to be here at all, in fact I think it would be better just to squirt some into the tub, but Ive done it because its prim and proper (plus its the amount the dishwasher manufacturer recommends because, well, it is a measuring cup after all). Alright, and washing washing done! Or, well, no 15 minutes of a two hour cycle but now lets compare! Ill admit that I was surprised just how much water alone was able to accomplish, particularly with the pasta sauce. And, believe it or not, the run with pre-wash detergent actually did worse with the pancake mix. But the devil is in the details, and there are some important and significant differences. While the difference looks slight at first glance, more pasta sauce was removed and more completely when there was detergent, particularly in the areas it had been burned onto the plate. There are many more flecks that stuck behind when there wasnt detergent in the water. Next, notice that a fair bit of butter remained on the buttery cheese plate. With detergent in the water, all the butter had been dissolved into the wash water. Thanks to the emulsifying action of the detergent, of course. There doesnt seem to be much of a difference when it comes to the cheese, but remember that what doesnt leave in the first fill will stick around for the main wash. This glob of butter will take up a lot of the detergents ability to emulsify oils in the main wash, which will make it less effective, whereas when there was pre-wash detergent it was all gone. Last but certainly not least, the eggs. Eggs are notoriously difficult for dishwashers to tackle, and sure enough it doesnt look like much has been accomplished here. But look closer. The run with detergent removed much more of the surface residue than water alone. This is probably thanks to the enzymes in the detergent beginning to break down the proteins in the eggs. It doesn't look like it at a glance, but to me this is the most compelling evidence of the benefits of pre-wash detergent. Remember that these results are after only 15 minutes into the cycle, and more detergent (and clean water) would be on the way were the cycle to continue. The simple addition of detergent to the first fill, and honestly not all that much, increased the amount of food it removed in just the first few minutes of washing. If it can get more out in the first rinse, it will obviously do better in the main wash. Not only that, but without detergent, a disgusting amount of sludge built up at the base of the sprayer arm and pump intake. Most of that was the butter, Im sure, because it doesnt mix well with water alone. A little detergent, though, greatly reduced that sludge buildup. And, of course, that means the main wash would have less to deal with. Again, I know Im repeating myself here, but there are two places to put detergent for a reason! I hope through this you can see why. No matter how fancy your detergent pack may claim to be, it will be working harder than it needs to without a little help in the pre-wash. Except, of course, for the dishwashers that dont have a pre-wash basin. It seems Bosch in particular has just given up and conceded that everyone buys detergent packs these days. They no longer include a spot for pre-wash detergent, which is particularly odd because they still have a dispenser and still hold it shut until the second fill. You would imagine that they would want their dishwashers to perform at their peak, and I can all but guarantee they could do with a bit of detergent in the first fill, nevertheless they dont bother to encourage it anymore. I suspect this is a reaction to the proliferation of detergent packs, and not because the pre-wash detergent doesnt help. Weve just seen that it does significantly. My guess is that Bosch has optimized their wash programs for only one introduction of detergent, and Id bet thanks to detergent packs. However, my new KitchenAid dishwasher, with such fancy features as a third rack for flatware, mugs, and glasses and a turbidity sensor which can determine how dirty the wash water is, still encourages you to add a little extra detergent. In this case theres a divot on the sliding dispenser door, and detergent placed here will just fall into the tub. But you cant do that if you buy detergent packs. I mean, sure, I guess you could just use two with each load but that would be a little silly. And still, some dishwasher manufacturers like LG say that if you are to use a detergent pack, you should bypass the dispenser altogether and instead place it directly into the tub. But thats horrible advice, particularly since many packs are nothing more than plain powder detergent in a dissolvable membrane, with maybe a little extra flair. It will all be gone after the first drain if you just throw it in the tub. Really, dishwasher detergent packs just... dont make sense to me. One of the great benefits of using an automatic dishwasher is that it greatly reduces the amount of water needed to wash dishes compared to washing by hand. This is all the water this model uses in a normal wash cycle, which can tackle more than 8 place settings! It only takes 4.2 gallons, or about 16 liters, precisely because the detergent keeps food particles suspended in the wash water, allowing the same water to provide cleaning action for almost an hour. Oh, and it only used 1.2 kilowatt hours of energy! But you hinder your dishwasher greatly when you only introduce detergent once. I suspect that a lot of complaints surrounding modern dishwashers not cleaning as well as old ones have detergent packs to blame, at least in part. Oh, phosphates you say? Yeah, quick note, there are a lot of folks out there who are convinced that phosphate-free detergents, which were introduced to combat the environmental damage caused by phosphates being introduced into the waterways, just doesnt work as well as old fashioned phosphate-full detergent. Personally? I dont buy that. I... I just dont have issues with my dishwasher not cleaning well with really any detergent I've used. Plus, phosphates were added to reduce limescale deposits from hard water, not exactly a function of cleaning. Using a rinse aid product will help, so if you arent doing that, well start doing that. Heres an anecdote for you. This pan was used to make a cheese and bean dip I make every once in a while. Ive let it dry out, theres caked on cheese and oil and in general its, uh, well it's kinda nasty, but I know it will be cleaned just fine by my dishwasher. It's done it many times before. Even if Ive let it sit for days before I clean it. And for the most part I buy cheap, store-brand detergent! All I do is put it in both places my dishwasher asks me to and it cleans excellently. Even this old one did a great job - I only replaced it because its control board is starting to get a little loopy, and sometimes it crashes and doesnt finish a cycle. It only happened twice during the making of this video! It might have been an easy fix, but its also kinda loud, and so was the perfect candidate for cutting a hole into. I never pre-rinse my plates, cookware, even stuff like this skillet. The first fill, with a bit of detergent, does that for you. Thats the point! Granted, Im no chef, but I just put whatever is dirty in the dishwasher without thinking, and rarely do I ever find something that wasnt cleaned perfectly. Usually its just something like a random fork with a stuck on piece of celery or junk like that. Even this giant skillet, after making something like beef with broccoli with its gross and sticky sauce, it comes out perfectly clean without any pretreatment. And with cheap detergent. If youre constantly underwhelmed by your dishwasher, well first you should probably buy a dishwasher cleaning product and run that through it according to its instructions, also check to see if there are any filters to clean, but seriously, go buy some basic powder or gel detergent, and put it in the dispenser AND the pre-wash area (wherever that is) and see how it goes. You might find it did a better job than it ever did with the fanciest of packs. And also, now I get to be grumpy, its getting hard to buy plain detergent these days! Everybody wants packs, and I would be OK with that were it not for the fact that using a single detergent pack is antithetical to the proper function of most dishwashers. The pre-wash basin would not exist if the manufacturer didnt think it might be helpful. And truthfully, I think that adding in a bit of detergent to the tub even on models that dont have a specific pre-wash area would provide a dramatic improvement to cleaning performance. You might want to give it a try yourself, it really wont hurt anything. Now, heres a caveat. Pretty much every dishwasher has different programs to choose from. You may have an express wash option or similar which does indeed open the detergent door right away. For these wash programs, if you use them, it simply makes the first fill the main wash, and so adding pre-wash detergent wouldnt make a difference there. But most normal cycles will behave like weve seen here - theres at least one pre-wash fill before it opens the detergent dispenser to get all the nastiness out quick. And in that case, youll get better cleaning with a little detergent in there from the get go. I said \"get go,\" not gecko. Anyway, youre right. The main point of this video was for me to tell you about the existence of the pre-wash detergent basin and show you that, if you actually use it, your dishwasher will work a lot better. I want you to experience the full potential of your dishwasher. So many people seem to think that dishwashers need to be babied, that you need to rinse anything remotely dirty off before you load it up, and thats just never been the case for me. Either Im the luckiest person alive, or pre-wash detergent makes a huge difference. I think its the latter - when it has soap from the start, it can work so much better. Thanks for watching, Id really love for you to give old fashioned detergents a try. Theyve never let me down, despite being the value option. And truthfully thats not my motivation, I just dont get how a detergent pack is gonna be a better option because thats not how dishwashers work! And the popularity of, like, those Finish tabs that are individually wrapped? Dont get that at all. Thats way more annoying than just squirting some gel into a couple of cups. If you like the convenience or accessibility of packs, which I can absolutely appreciate, my advice would be to try the cheapest ones and use two with each load. Put one in the dispenser and throw another one in at the start. That is, of course, if your dishwasher behaves like this one. Which, on a normal cycle, it probably does. Now, you can usually hear the detergent dispenser open, and if it does a fill and drain before that happens, I really think youll have better results with basic detergent but twice. Its worth a try, anyway, and please - feel free to come back here and tell me if I was wrong. My experience may simply be outliery. And also, I would very much recommend against doing this to your dishwasher. Despite using gobs of silicone and letting it cure for three days, the seal failed. Yeah, that was fun. Nothing quite like fighting a water leak near live electrical connections. My second attempt worked, but only because I sealed both the inside and outside. And I can tell that the inner seal has failed, as waters trapped behind the glass. Its almost like dishwashers are designed to clean things using high-speed jets of water or something. Whodathunk. phosphate-free smooth jazz Though, so-called portable models, which really just means theyre on wheels and so dont require bo! Not \"and so\". No! With most of the real nastiness long gone, it can easily work to clean the stubborn bibts mmm! It, well I think they all do, you may ha [extremely weird noises] Sounds gross! But whatever. This dishwasher is of the pulverizing variety, and its actually got a reaaally cleugh I dont like how this lines being delivered! Exactly how this one does, and really that shouldnt be all to surpri - [just crashes like a computer or something] ...acts like a garbage disposo. It shreds disposal. I Disposo the Clowns coming back! Remember him? I imagine the comments are going to be filled with everyone's dishwasher takes. And I mean, that's fair, that's basically what this entire video is. One giant dishwasher hot take. Yes I am grumpy and insufferable, why do you ask?",
    "transcript_keywords": [
        "detergent",
        "water",
        "dishwasher",
        "dishwasher detergent",
        "Detergent packs",
        "dishwasher detergent packs",
        "prewash detergent",
        "Fill",
        "hot water",
        "wash water",
        "wash",
        "detergent dispenser",
        "cleaning",
        "prewash",
        "main wash",
        "main",
        "tub",
        "pump",
        "dishes",
        "packs"
    ],
    "transcript_entity_values": [
        "the first few minutes",
        "Only four",
        "at least 150F",
        "third",
        "I Disposo the Clowns",
        "4.2 gallons",
        "Second",
        "Bosch",
        "Cascade",
        "no 15 minutes of a",
        "2 tablespoons",
        "the first 15 minutes",
        "only one",
        "Cascade",
        "Finish",
        "two",
        "more than 8",
        "European",
        "gallon",
        "NSF",
        "about 3 days",
        "two hour",
        "Only about fifteen minutes",
        "at least one",
        "North American",
        "US",
        "Riiiighhht",
        "one",
        "first",
        "15 minutes",
        "three days",
        "Wikipedia",
        "these days",
        "TWO",
        "1886",
        "nearly an hour",
        "that first 15 minutes",
        "only 15 minutes",
        "One",
        "fed",
        "1.2 kilowatt hours",
        "LG",
        "4-ish liters",
        "Great Value",
        "KitchenAid",
        "First",
        "second",
        "about a half hour",
        "days",
        "Josephine Cochranes",
        "Tide",
        "three",
        "almost an hour",
        "about 16 liters"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "TIME",
        "CARDINAL",
        "NORP",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "QUANTITY"
    ]
}