{
    "id": "_rhYn8M_rvw",
    "title": "The Perfect MacBook Setup",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-05-05T03:48:50Z",
    "video_url": "https://www.youtube.com/watch?v=_rhYn8M_rvw",
    "category": "Science & Technology",
    "tags": [
        "MacBook Setup",
        "MacBook Setup Tour",
        "MacBook Setup 2016",
        "MacBook Setup Display",
        "MacBook Setup 12 inch",
        "Best MacBook Monitor",
        "USB C Monitor",
        "USB-C Monitor",
        "best macbook setup",
        "ultimate macbook",
        "macbook 2016",
        "macbook pro 2016",
        "12 inch MacBook Monitor",
        "MacBook 12 Monitor",
        "MacBook 12 Display",
        "TLD Setup",
        "TLD Desk Tour",
        "tldtoday desk",
        "dream desk",
        "jonathan morrison",
        "jonathan morrison setup"
    ],
    "views": 1580596,
    "likes": 37074,
    "comments_count": 2056,
    "description": "A tour of best USB-C monitor + dock setup for your 12\" MacBook. Catch up on the Dream Desk:   The ideal way to make a killer workstation desk with your 12 inch MacBook, whether you have the 2015 or 2016 model.  Free Slickwraps Skins:   DNXRF21C - Expired LM125LQJ - Expired  6W7VA3 MEIMQN  Acer Monitor:  Twelve South MacBook stand:  Keyboard:  Mouse:  HiRise stand:  Groot:    Free Slickwraps Codes! (Single use/first come, first serve). N24SOBFB ZFEKR8EV 6CE7684Z X5QGXJJ8 Z5QIO7H3 0FCAPTSW XM7IX7LQ 98CFBSOX C34V10LA F1Y7RDST HZL0IC82 UC1QBC4Q E9C0OPPJ FOKN4QAK 33YIKOL9 IQBTM3OE ADE85BZF GYF5LFN3 F3GM1BZ9 LARY412G DMNRPTWO IM7U7179 LFW5QDSR PC63N3WQ ZH20P1VM YLQ4VFRB I3MUFFEH H2M75KYQ 5AS9N4J4 GSZ670L0 VIC7SGCF WBRVSDIU  Snapchat:  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/playlist?list=PLqcaiHQwxA9iRubBGd4zVL4qKcie2-OxJ",
        "https://www.slickwraps.com/devices/helmetica-series.html",
        "http://amzn.to/1rW8TNN",
        "http://amzn.to/1TueMHN",
        "http://amzn.to/1rwU1VE",
        "http://amzn.to/24vfb85",
        "http://amzn.to/24vfijS",
        "http://amzn.to/1TL2I7H",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- So, what's up guys? Jonathan here. And this might be the perfect Macbook setup. Specifically, I'm looking at the H277HU from Acer which is a 27 inch IPS display with a trick up its sleeve. First off, it is really, really pretty. The base, which is made out of metal, and not plastic, has this gold finish, which looks killer paired with a white back. And there's something strangely satisfying with metal versus plastic. It feels premium and is cool to the touch. You combine that with the bezels, or rather, lack thereof, and that makes this one of the best looking monitors I've ever seen, and a great starting point for a minimal, but great looking, setup. On the back, you will see a couple of USB3 ports, display port, and HDMI, but where the magic happens, is this guy right here: a USB-C port. Normally the idea of a 12 inch Macbook hooked up to a monitor would sound like a nightmare. There would be cables and dongles everywhere, but this monitor fixes that. It's essentially a giant hub that allows you to dock the Macbook, transfer data, but what seals the deal, is that it charges the Macbook, and all through a single USB-C cable. Keep in mind this is done through the monitor's power supply. So that's going to mean a couple of things. One: you're not going to need the Macbook charger, and two: you now have two USB3 ports at your disposal. Personally, I love the implementation of a dock set up, but it's even better when you're connecting and disconnecting with a single cable. Now, one slightly annoying thing is because there are different kinds of USB-C cables, not every one will work with this monitor. The ones that come with the Macbook and most phones are USB2 and those will not work. So what you're going to need is a fully compatible USB 3.1 USB-C cable, which fortunately is included. But the problem is, to the naked eye, there really isn't an easy way to tell the cables apart. So, for this instance I have a wireless keyboard and mouse going through a single USB receiver. That is a preference because I like these models, but if you do want to go blue tooth, that's going to keep that port open. Another example of how this could be useful is with external storage. So in my case, I have a USB3 SSD hooked up. This is rad, because this particular model does not require an external power supply, so it keeps the setup even cleaner. But, even if you did want to go with a more traditional external hard drive, that does require an external power supply, it's not going to be a big deal, because that's staying there docked with your setup. As far as the display goes, it's a really good looking 1440p IPS panel. My only gripe is that if you're used to using a 4K, or even 5K display on something like an iMac, it is a little hard adjusting screen real estate-wise But, if you're coming from 1440p, or especially 1080, it's going to look killer. Viewing angles are great, the colors are rich, they're vivid, and overall, it's a really enjoyable experience, whether you're working or consuming video. Now, for this setup, I'm using a 2015 baseline 12 inch Macbook, and performance was smooth. There was no lag with the keyboard or the mouse. Which, in between windows, was seamless, and streaming 1440p video worked perfectly. In this setup, I'm using the Macbook docked, enclosed with the Acer as the main and only display. But, you could just as easily leave the Macbook open, and use that as a second display, just in case you need more room, which makes for an extremely flexible setup. One thing worth mentioning is that the resolution from the Macbook and this monitor are nearly identical. So the performance isn't surprising, but it's nice to know that it works well. Plus, the fact that it works well with a 2015 Macbook, if you're going 2016, it's going to work even better. So, overall this monitor is really solid. It's a little on the pricey side, but if you own a 12 inch Macbook, you can see why it's a perfect match. Speaking of Macbooks, and 2016 Macbooks, mind you, there's still a giveaway going on. So drop a Like if you want to win one, details in that are down below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Macbook",
        "inch Macbook",
        "setup",
        "monitor",
        "USBC",
        "USBC cable",
        "display",
        "Macbooks",
        "Macbook setup",
        "single USBC cable",
        "perfect Macbook setup",
        "inch",
        "inch Macbook hooked",
        "external",
        "power supply",
        "cables",
        "cable",
        "port",
        "work",
        "Macbook hooked"
    ],
    "transcript_entity_values": [
        "two",
        "5",
        "One",
        "2015",
        "1440p",
        "2016",
        "4",
        "Acer",
        "USB",
        "27 inch",
        "iMac",
        "Macbooks",
        "second",
        "USB3",
        "12 inch",
        "First",
        "SSD",
        "1080",
        "USB2",
        "Macbook",
        "HDMI",
        "IPS",
        "Jonathan",
        "USB-C"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG"
    ]
}