{
    "id": "_rSMw7NOEZE",
    "title": "Fixing a Viewer's BROKEN Gaming PC? - Fix or Flop S4:E2",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2023-05-09T20:39:25Z",
    "video_url": "https://www.youtube.com/watch?v=_rSMw7NOEZE",
    "category": "Science & Technology",
    "tags": [
        "fix or flop",
        "broken pc",
        "broken gaming pc",
        "how to fix a pc",
        "fix",
        "how to",
        "gaming pc",
        "pc doesn't post",
        "pc no post",
        "no post",
        "post",
        "graphics card",
        "no signal to monitor",
        "screen is black",
        "greg salazar",
        "pc doesn't work",
        "computer",
        "broken",
        "broken computer",
        "Viewer pc",
        "how to troubleshoot",
        "how to fix a broken pc",
        "fix or flop season 4",
        "how to fix a broken computer",
        "how to fix a broken gaming pc",
        "fixing a pc",
        "pc wont turn on",
        "dead pc",
        "pc wont post"
    ],
    "views": 212503,
    "likes": 9418,
    "comments_count": 523,
    "description": "SPONSORS: Shop VIP-SCDKey OEM Windows 10 Pro keys for $16 and use code 'SKGS' for a 25% discount:   Learn more about Corsair Xeneon Flex monitors:   Welcome to Fix or Flop! We're up to Season 4, Episode 2. This viewer's gaming PC doesn't POST! Is this something we can fix? By the way, if you live in the Orlando, FL area and have an issue with your PC, apply to have it (possibly) fixed for free today!   How to Update Your BIOS Without a CPU:   Check out other Fix or Flop episodes in this playlist:    Consider supporting us on Patreon!    My troubleshooting gear: FLIR C5 Thermal Camera:  Skybasic Digital Microscope:  YIHUA Soldering Station:  Helping Hand Soldering Board:  Xool 80 Precision Tool Set:  PassMark Inline PSU Tester:    My cleaning gear:  SYINE Respirator Mask:  Scott Shop Towels:  Electric Air Duster:  ONSON Cordless Vacuum:  Medical Grade 99.9% Isopropyl Alcohol:  Q-tips Cotton Swabs:  Xool 80 Precision Tool Set:  Hizek Black Disposable Gloves:    My studio gear: Sony a6600 (Primary):  Sony a6400 (Secondary):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.  #FixOrFlop",
    "description_links": [
        "https://bit.ly/Win10SKGS",
        "https://www.corsair.com/us/en/Categories/Products/Monitors/CORSAIR-XENEON-FLEX-45WQHD240-Gaming-Monitor/p/CM-9030001-NA",
        "https://gregsalazar.com/fix-or-flop",
        "https://www.youtube.com/watch?v=_aBiTr6tpcs",
        "https://youtube.com/playlist?list=PLyReHG5dDxXXSgTLdfvdzJpFei941MX6H",
        "https://www.patreon.com/gregsalazar",
        "https://geni.us/3ALEI",
        "https://geni.us/6zurf",
        "https://geni.us/DbjS",
        "https://geni.us/7DDrL",
        "https://geni.us/1IfxDSw",
        "https://bit.ly/3BoBHoQ",
        "https://geni.us/V4uA",
        "https://geni.us/rIy5O6Y",
        "https://geni.us/RALt4",
        "https://geni.us/aABrFWE",
        "https://geni.us/tBVQ",
        "https://geni.us/nQhVVQm",
        "https://geni.us/1IfxDSw",
        "https://geni.us/MBCJaf",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "Everything was working well until one day I got home with my PC already being on and a notification that my CPU was warming up while gaming. So I restarted my PC and still got the same warning and then my PC shut down. I noticed the AIO wasn't functioning so I unplugged it and I also removed it. I repasted the CPU and put it back together and now my PC won't turn on and I get no display. I just recently purchased a 4080 but I lost my job and I had to return it and now this has happened. Hopefully it's not a graphics card issue but I'm not sure if it's a simple fix or a difficult one. If you could please help me out, I'd truly appreciate it. This here is that viewer's broken gaming PC. And yeah, I'm hoping it's not the graphics card either my friend because that's a 3070 Ti. Pretty beefy, still pretty expensive. We also suspect this AIO might need replacing. Maybe the pump is dead, maybe the loop is clogged. I think that the cable being disconnected is just a byproduct of him testing things and reapplying that paste. Elsewhere, the power supply wattage seems okay. All of his DIMMs are seated correctly and all major wiring looks to be in check. Although we'll have to narrow this down a bit further later in the video. Hey there and welcome to Fix or Flop. Pertinent info is in the video description. Just know that everything you see us do in this playlist is done free of charge to the viewer. We don't charge anything for the diagnosis nor the replacement parts if any are needed. And that's thanks to not only your viewership but also our product sponsors. I'm ready to dive into this one. I think it's going to involve just a bit based on the symptoms we're seeing. Let's get into it. Stay with me. To get rid of that annoying Windows activation watermark, head on over to VIP SCD Key. Purchase a Windows 10 Pro OEM key for a fraction of the price of retail. Just use a secure payment method like PayPal, enter your product key into your PC settings window, and say bye-bye to the watermark. And be sure to use our offer code SKGS for a sweet discount. So first things first, let's attempt to power the system on. The viewer says that the system turns on but doesn't post, which means it doesn't send a signal to the monitor. That's what we'll be looking for. Where is the power button? Oh my gosh, there it is. Okay, so far looking okay. I'm going to try connecting this AIO again just to see if it is in fact dead or not. Well, she's churning fluid. Although it doesn't sound particularly good. Not sure if the mic is picking that up. Ouch. A lot of air bubbles in the system. Hopefully we can fix that for him. So, nothing. Nada. No picture on screen. I'm really hoping it's not a graphics card problem. We can roll it out, but first I want to tackle some simpler things. We've already checked that RAM is seated correctly. We can easily swap those DIMMs out for one of my known working DIMMs. We can also try clearing the CMOS, which takes a few seconds, especially with some of these modern boards. With the system powered fully off, we can jump these two pins right here for anywhere between 10 and 20 seconds. This will close the circuit utilizing the onboard battery, thus wiping the clock and any BIOS presets that would prevent the system from posting. But, alas, it was not the RAM and it was not the CMOS. I've tried the single known and working stick in multiple slots. We're not getting anything there. And just, yeah, wiping the CMOS, that didn't do anything. I think I know why. CPU might have been overheating though. The front fans mounted to the radiator are not spinning. And that's not good. We actually, I think we do have two more fans. Well, okay, yeah, we've got fans on the front side here spinning. So we're getting some airflow through the radiator, but these definitely should be as well to get that full push-pull effect. So we'll see what comes of that later. Maybe something at the rear is disconnected. Next thing I want to do is disconnect this graphics card. We'll replace it with one of our cheaper XFX cards. It doesn't require supplemental power. See if that gives us a picture. It's such a shame EVGA won't be making graphics cards for NVIDIA any longer. They did such a good job, even with this latest Ampere series here. So good looking. Now, based on what the viewer told me, this here should not fix the problem. At least I wouldn't think it would. Doing this one-handed was a mistake. There we go. Okay, so let's connect HDMI and see if we get a post this time. A few moments later. But yeah, no, nothing. Honestly, I think I'm happy with this because this was the most expensive component in his rig. Even if this, I think he has a 5900X in here. It's a pretty beefy Ryzen 9 chip. Even if that ends up being the thing that's bad, it's still not as expensive as the 3070Ti in today's market. So I think I know where this is headed. I think we're going to have to look at the CPU and the socket. Potentially the motherboard as well. It's possible that when he was removing his CPU cooler, maybe he tugged a bit too hard, maybe twisted too hard, and bent some pins on the chip. It's sometimes what happens with PGA, unfortunately. AM5 seemed to solve that, but then AM5 has its own issues. So we'll see how that fares in the long run. I'm going to take the cooler off, check the CPU and check the socket, see if anything's wrong. You can also tell that the block here looks to be slightly crooked. I think it's because he used the wrong holes on this bracket to tighten everything down. So if the I.O. is fine in the grand scheme of things, we'll make sure to straighten this up for him. So first things first, we definitely have more thermal paste than we need. Some running off the side there. That can get under the chip and into the socket as well and cause issues of its own. So we'll clean that up. So this is indeed a Ryzen 9 5900X. Let's check the socket and the pins now. Underside of the chip actually looks really clean. We did have a bit of thermal paste runoff underneath, but it wasn't impacting the totality of each pin in question. Clean that up a tad and yeah, looking spiffy. And likewise, the socket physically itself does not seem to be the issue here. So at this point, you just got to ask yourself which you would rather lose in a worst case scenario. The motherboard or the CPU? Because we can't really tell which one is to blame at this point. Even if we had a Dr. Debug LED that was saying code 00. I've gotten code 00 when the CPU was bad and when the motherboard was bad. We've ruled out the other major components and it's not a wiring issue. I checked that off camera. He's got all of his connections on his power supply. Sound, it's a modular unit. Also checked that the smaller connections are removed from the equation when trying to power the rig on. Now, one of the things we might have to pivot back to later is a potential BIOS issue. This being a B550 motherboard means that it might not have the latest BIOS revision needed for stability or even functionality with the 5000 series chips. Zen 3 essentially from AMD. I doubt that's the case because the owner never made it seem like he swapped the CPUs out. But we always have to check because sometimes there are gaps in the stories and things. It just happens. We're going to kick things off with this Ryzen 7 3700X that I know works from my own stash. Let's see how it goes. I've got the XFX card reconnected. Don't want to put anything beefy back in like his original card in case we have to rip this whole motherboard out. This is probably a 50-50 shot. I'm just curious. We get a post or not. That glare is pretty awful. There we go. The system sounds like it's doing a bit more than it was before. Fan curves are changing, ramping up and back down again. Does that mean we're going to get a post? Yes. Look at that. Look at that. Did this guy kill his CPU just by removing his AIO block and reinstalling it, repasting? That would be a serious shame. The last thing I want to do here is update this BIOS if it isn't already updated to the latest revision and try his CPU again. It's possible things just got very aggravated and a newer BIOS revision could make booting with the newer chip much easier. I doubt it, but I want to cover all my bases. It looks like we're on a BIOS build date from March-ish of 2021. That's almost two years old at this point. Again, I'm sure there's already baked-in Zen 3 support for this BIOS, but I want to update it anyway just to be on the safe side. Also, ew, those temps are not good. You shouldn't be seeing 80-anything C in the BIOS. This is just a stock 3700X here. You can see the voltage is scaling up and down, but at one volt more or less, vCore, this is not good. We're probably looking at a clogged AIO. We can check that later in this video. Let's get the BIOS updated first. We've downloaded the latest revision that is not a beta revision. This is a beta one. I don't want to give them that. Just in case, we've downloaded it. We've renamed it with the renaming tool built into the folder. Then, we put it on this thumb drive right here. The renaming tool is important because we're going to try using the BIOS flashback function with this board. We've got it connected. We're going to power on the system, at least at the rear, at the power supply level, but we're not going to turn the system on. Then, we're going to hold this button down until we see some flashes. It's flashing green. We're not going to touch anything for a good while while this happens. Another reason why I'm doing this is because the CPU, as it was, was overheating in that rig. Rather than get out a different cooler or risk the system overheating with the current cooler, just do it this way so it doesn't actually have to be powered on to update. By the way, while this is blinking fast, do not touch the rig. Do not do this during a thunderstorm. Just let it play out. Trust me, you'll thank me later. All right, and it stopped blinking. I've got the thumb drive out. By the way, we could have done this without a CPU installed at all, which is really cool. It's a really cool feature of BIOS Flashback. We have a dedicated video on how to actually do it step-by-step in the description. Let's go ahead and power it up now. We're just going to verify that that update stuck in the BIOS. Yep, and there we go. That be it. Let's also check the CPU temps. Yeah, they are climbing 69, 70 degrees, and they just keep going up, folks. That's not good at all. These fans are actually working now. I guess they were just waiting for some sort of load, but I just realized I didn't have the pump connected. That was totally my fault. Actually, the AIO seems to be okay, and temps have already dropped in a matter of seconds down to the low 50s, and they continue to fall. That was my bad. Now, I do want to try this chip one last time before we close this one out just to see if that BIOS update changed anything regarding stability, just overall functionality with Zen 3. So here we go. Lower that retention arm. Place this thermal pad back on. This is only a temporary setup just to see if the system posts or not. And let's give her a whirl. I'm not usually too optimistic about these tests, but wouldn't it be sweet if a BIOS update alone fixed our issues? Give me something. Come on. Would you look at that? I'm not going to lie, I totally didn't see this coming. It's not every day when a BIOS update fixes a problem like this, because again, everything apparently was running fine before. Just reseating the cooler made it not work, and then updating the BIOS fixed that again? It was just a last-ditch effort, and it managed to pay off. So now we don't even need to replace anything in this rig. Everything is hunky-dory. That is something else. Now I want to reconnect things we've removed piece by piece just to rule them out again for that peace of mind, since we have the system in sort of an industrial state here. Let's see. One more. We'll try this, make sure it works, and we'll also insert his graphics card. That'll be the last thing we do, and then we'll be good to go. Okay, I think I might have found what the problem was. I don't think it was the BIOS update at all. I think it was something else we kind of did in between that we didn't think much of at the time, or at least I didn't. Cooler mounting pressure. And here's how I found out. I had his graphics card back in, I had his DDR4 back in, I was ready just to call it. Say, yeah, we fixed it. BIOS update, whatever it was, it works now. But then I forgot that I had to tighten down the cooler a bit more, because I had just kind of slapped it together, and we were just temporarily making sure things were still working. But I only had two of the four screws locked down all the way. I went to tighten down the other two screws, and then power the system back on, and it wouldn't post. I also discovered there is actually a series of debug LEDs on this board that are just hiding above the 24 pin. I don't believe they were lit at any point throughout our testing, and I saw that exact same thing happen here. They weren't lighting up at all when I was attempting to power the system on, with all four of the screws tightened down for this block. With just two of them, it would work. In fact, just now, I tried turning the system on with no cooler attached, and everything lights up, the system boots. The chip gets really hot really fast, which is why you can't let that run too long. But I think this socket is probably a bit stubborn, and that there's maybe some improper contact within the socket from the pins and the chip when this thing is tightened down too far. And that's not something I can really fix without replacing, more than likely, the motherboard. So, I'm going to fiddle with this a tad, and I'm just going to try to get it just right on the mounting pressure side of things, to the point where we're getting enough cooling from the block, because we have enough mounting pressure to transfer that heat from the CPU, but also to where we actually get a post, and we're not just preventing the system from doing anything. So, I'm going to give it a shot. Let's see how it goes. So, with the block torqued down just a quarter of the way across all four screws, we just get the hanging CPU debug light. If I torque down any further than this, in most cases, no lights show up at all, and the rig just refuses to post. And look at there. See? We can get it. There's the boot light. It's not focusing, but yeah, there it is. There's the green one. And that is with no standoffs, or no screws over the CPU block standoffs. It obviously can't run like this long term, and I think what happened was, when he said he took this off, it was a bit tough to do so, and he was twisting a little bit, and he kept pulling, and then he pulled hard enough to where it just pried off really fast. The CPU was still in the socket, so it didn't get ripped out, which is pretty common with AM4, but he said it did take a lot of force and didn't sound too good. So, it's possible the socket was damaged when he did that, and that's why we're having these really finicky boot issues. I don't really think that this is going to change without replacing the motherboard. I'm going to give it one more shot. Whoops, almost chopped my finger off. I'm going to give it one more shot and see if we could just kind of tickle these things on just slightly, just enough. But, I think it's a lost cause. Okay, so we've gotten it to work so far. I've kind of just slowly torqued things back down, and I tried to distribute pressure as evenly as possible, torquing each screw on each corner like just a quarter of a full turn over and over again. Maybe that's all it took. So, what I'm going to do is more or less just kind of simulate what's going to happen when this rig is tossed around in cars. I'm going to pick the rig up and lay it upright while it's on, and we're going to see if the system stays on. And then we'll power off, reset, make sure that it posts again. And if that's all it takes, cool, we'll call it. But I will also let the viewer know that if he runs into this habitually in the future, that he can just reach out to me and I'll send him a replacement board. I'll just have Gigabyte or whoever mail one to him. Let's see how this goes. Just realized I haven't strapped the car down either. I'm not going to be super rough with it. How are we doing? Okay, it's still good. Not bad. And I guess we could just try resetting maybe. Twelve seconds later. Everything so far seems good. Last thing I want to do is swap his cable combs around. For some reason he's got the 24-pin cable comb across his two 8-pins for supplemental power to his graphics card. We're going to straighten that up for him. I'll show you what I do just to kind of mimic a bridged cable setup when you have two separate 8-pins running to your card to make things look pretty darn clean. All you need to do is set up two separate combs the way we've got them here, pretty standard. And then every other comb on the way down, you'll want to offset and include two from each separate 8-pin strand. Now you can group these however you want. You can slide this chunk down and then keep these together. Or you could keep them all in one big clump, although that's a bit difficult to do when you've got cable spacing and whatnot. But that can give the impression that your cables are bridged when obviously they aren't. It keeps them all close together so you don't have that weird kind of tangling. One cable will go off in one direction and one will go in the other. It just looks a bit cleaner this way, I think. And here we go. I think the system looks much cleaner all around. It's pretty incredible what just sorting cables from this side can do for the aesthetics of your rig. I won't lie, I'm still a bit hesitant about sending this rig home in its current state. I have reset it multiple times just to be sure that we've got repeatable posting, whereas before we weren't getting that. But I'm fairly confident now that it just came down to a mounting pressure issue. And I think the board is so much more sensitive now because of the way that the cooler was initially ripped off. From what he described, it sounded like it was pretty rough. So I'll let him know about that. If he does run into this again, he might be able to fix it himself. But as is, it seems very stable. I think the fact that we updated the BIOS was just a nice touch, but it probably wasn't needed in terms of system stability or just getting the system to post. But all around now, functional, and it didn't require any hardware on our part, which that's always a win in our book. Now, before we wrap this one up, consider learning more about Corsair's XenonFlex OLED gaming monitor, designed to be bendable by the user from flat to a curve 800R. At 45 inches with its 21 by 9 aspect, it's sure to impress, providing immersion when you need it, and inclusivity when others also want to watch. The Baked in LG OLED technology is best in class with its 240 Hertz refresh rate, incredible HDR and contrast, and extremely fast grade-to-grade response time of just 30 microseconds or 0.03 milliseconds. Coupled with NVIDIA G-Sync and AMD FreeSync Premium certs, you've got yourself one heck of a gaming monitor. Learn more about the Corsair XenonFlex 45WQHD 240 by clicking the link below. If you've ever considered supporting us on Patreon, I will have that linked below. We're kicking that off. It's not very large at all by this point. We're making like 30, 40 bucks a month. But all those funds either go toward our Minecraft server, which you can learn more about in our Discord, or toward parts like these, especially when we have to dip into our own pocket. Thankfully, again, in this case, we didn't have to, but I imagine we will several times throughout Season 4 here of Fix or Flop. Again, I've got the line open to the viewer in case the motherboard needs to be replaced later on. I'll let them know what I think it is. But yeah, ultimately good news at the end of this one. Let me know what you thought about it. If you, by the way, have a broken system and you live in or around Orlando, Florida, you'd like a chance to have it fixed for free. You can sign up via the link in the description. It's going to be near the top somewhere. There's a form you can fill out, and we'll do our best to get to you as soon as possible. Give this one a thumbs up. Consider subscribing if you haven't already. Leave a comment down below. Consider joining that public Discord server I mentioned earlier. It's totally free, and I will catch you in the next one. My name is Greg. Thanks for learning with me.",
    "transcript_keywords": [
        "BIOS",
        "CPU",
        "system",
        "BIOS update",
        "things",
        "power",
        "good",
        "graphics card",
        "bit",
        "card",
        "thing",
        "rig",
        "yeah",
        "socket",
        "AIO",
        "back",
        "update",
        "cooler",
        "Pretty",
        "post"
    ],
    "transcript_entity_values": [
        "first",
        "Zen 3",
        "March-ish of",
        "9",
        "between 10 and 20 seconds",
        "PGA",
        "Corsair",
        "XenonFlex",
        "all four",
        "240",
        "Orlando",
        "BIOS Flashback",
        "5900X",
        "50-50",
        "80",
        "Minecraft",
        "4080",
        "PayPal",
        "VIP SCD Key",
        "two",
        "One",
        "four",
        "Patreon",
        "a few seconds",
        "69",
        "0.03 milliseconds",
        "AMD",
        "BIOS",
        "one day",
        "Ryzen 9",
        "CPU",
        "30",
        "40 bucks",
        "Discord",
        "Hertz",
        "Florida",
        "3",
        "I.O.",
        "3700X",
        "3070Ti",
        "today",
        "70 degrees",
        "2021",
        "8",
        "LG",
        "the end of this one",
        "XenonFlex",
        "240",
        "21",
        "one",
        "A few moments later",
        "almost two years old",
        "just two",
        "5000",
        "XFX",
        "EVGA",
        "RAM",
        "NVIDIA G-Sync",
        "Season 4",
        "Gigabyte",
        "AIO",
        "Greg",
        "45 inches",
        "24",
        "3070",
        "CMOS",
        "B550",
        "AM5",
        "one volt",
        "50s",
        "Twelve seconds later",
        "10",
        "NVIDIA",
        "just 30 microseconds"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "DATE",
        "LAW",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "TIME"
    ]
}