{
    "id": "_RV8zyTSI3c",
    "title": "Samsung Galaxy S24 series: smarter phones for an AI era",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-01-17T18:00:17Z",
    "video_url": "https://www.youtube.com/watch?v=_RV8zyTSI3c",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "samsung galaxy s24 ultra",
        "samsung galaxy s24",
        "galaxy s24 ultra",
        "samsung s24 ultra",
        "s24 ultra",
        "galaxy s24",
        "s24 ultra samsung",
        "s24",
        "samsung galaxy s24 plus",
        "galaxy s24 ultra specs",
        "samsung galaxy s24 ultra unboxing",
        "galaxy s24 plus",
        "galaxy s24 ultra release date",
        "samsung galaxy s24 ultra price",
        "galaxy s24 ultra price",
        "samsung galaxy s24 ultra 5g",
        "samsung s24",
        "galaxy s24 ultra leaks",
        "samsung s24 plus"
    ],
    "views": 95824,
    "likes": 1796,
    "comments_count": 135,
    "description": "Ever wish you could have the most phone? For several years running, Samsungs S-series Ultra has been that device, and the company is going just as big with the Ultra for 2024. The Galaxy S24 Ultra is here with a new titanium finish, lots of AI tools, and a higher starting price: $1,299, up from an already high $1,199. The other big change up front is the display. The S24 Ultra comes with a 6.8-inch 1440p display, just like the S23 Ultra, but it finally ditches the curved edges inherited from the Note series in favor of a flat screen. #Samsung #S24 #Technology   Read more:   0:00 Intro 0:28 Live Transcription 0:43 Circle to Google 0:57 Galaxy Ai photo editing 01:21: Instant Slow-mo 02:05 S24 Ultra 02:59 S24 and S24+  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://www.theverge.com/e/23804756",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- [Narrator] Samsung is making no secret that this year's \"Unpacked\" is all about AI. You really can't miss it. But what does that mean when every gadget in 2024 has some kind of AI on it? Meet the S24, the S24+ and S24 Ultra. They look a lot like last year's devices with a few exceptions and one higher price tag. More on that in a bit, but the main changes are all under the hood. All three phones get the same AI features, and that includes a new live transcription in the Recorder app and the ability to translate your chats into a different language. You can even have AI help you tailor your message to a certain tone, like more professional or more chatty. Thanks, AI. There's also something called \"Circle to Google,\" and that's available everywhere in the phone. You just hold down the home button and you circle a thing you wanna search for. It'll pull up a page of Google results and tell you what you're looking at. It's really handy actually. But, of course, there's a ton of photo and video editing tools you can use, now powered by generative AI. And some of them look a lot like what the Pixel 8 Pro is capable of. You just circle your subject and you can take them out of the frame or resize them and move them around. Not always the most convincing. Sometimes it totally invents something that looks a little wonky, but it's a lot of fun to play with and could be really useful. And if you're someone like me who always takes crooked photos, there's a new way to adjust the horizon and have generative AI fill in the edges rather than punching in. That's really helpful. One of the coolest features we saw was the ability to turn any video you've taken from any camera into a slow motion video. It doesn't matter whether you shot it at 30 frames per second or 60 frames per second. It uses AI to fill in the gaps between the frames and give you a slow motion video. You just hold down on the subject and voila, it looks really good. You can see me here playfully whipping my hair back and forth, and I don't know, it looks really convincing. But let's talk about the big guy, the S24 Ultra, the flagship. This time, it's back with a totally flat screen, which I love. Sorry if you liked the curved screen, but it's gone now. There's also a titanium build, which unlike Apple, Samsung isn't really touting it as a lightweight solution. It's just a more durable and kind of nice looking build. And, of course, you've got a whole bunch of cameras, including a three time zoom, and this time, a five times optical zoom. That's down from the 10x zoom on S23 Ultra. Samsung assures us that the 10x quality is actually better than the previous generation. Of course, you still have 100 time base zoom. It looks weird, but it's a cool party trick. So this year, the price has jumped up from 1,199 to 1,299. That's a pretty hefty price tag for a phone. That brings us to the S24 and the S24+. And there's not a whole lot that's new here. The bezels on the screens are slightly smaller, so the screens themselves have gotten a little bit bigger. The batteries are a little bit bigger this time around, and they still cost the same. The S24 starts at 799, S24+ starts at 999. Do those bigger batteries add up to better battery life? I'm gonna find out as soon as I start testing them, very soon. That S24+ screen gets a jump in resolution from 1080P to 1440P. It's 2024, and that's a big screen. So we really need all that resolution. So that's the S24 series. There's not a lot that's changed, but kind of a lot that's changed. Are you into the new AI features? I'm excited to try them out, let us know in the comments.",
    "transcript_keywords": [
        "making no secret",
        "Unpacked",
        "lot",
        "time",
        "Ultra",
        "screen",
        "video",
        "zoom",
        "Circle",
        "year",
        "Samsung",
        "Samsung is making",
        "frames",
        "Google",
        "features",
        "bit",
        "kind",
        "price",
        "bigger",
        "making"
    ],
    "transcript_entity_values": [
        "the S24 Ultra",
        "one",
        "799",
        "30",
        "Apple",
        "three",
        "AI",
        "Google",
        "Circle to Google",
        "year",
        "60",
        "999",
        "Samsung",
        "2024",
        "1080P",
        "1,299",
        "S24 Ultra",
        "One",
        "S24",
        "this year",
        "second",
        "1,199",
        "five",
        "100",
        "last year's",
        "a ton"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY"
    ]
}