{
    "id": "_saDCwsB9Ww",
    "title": "LED Printers: The Common Printing Tech You Haven't Heard Of",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-09-19T16:01:32Z",
    "video_url": "https://www.youtube.com/watch?v=_saDCwsB9Ww",
    "category": "Science & Technology",
    "tags": [
        "printer",
        "printing technology",
        "toner",
        "drum",
        "toner cartridge",
        "ink cartridge",
        "how to printers work",
        "LED printer",
        "LED",
        "light emitting diode",
        "laser printer",
        "CMYK",
        "ppm",
        "dpi"
    ],
    "views": 1910413,
    "likes": 62883,
    "comments_count": 2901,
    "description": "You can support this channel on Patreon!  Link below     If youre among the 85%* of people who dont know what an LED printer is, then prepare to have your mind mildly blown as I tell you about the common printer tech that may in fact by lurking in your home or office, but which youve been mistakenly referring to as a laser printer.  *gasp*  * This percentage was gathered via Twitter poll.  If anything, Id say the general population is even less likely to know what an LED printer is, as my followers on Twitter would, I should think, be a little more interested in technology than the average individual.  Hey, did you know you can follow me on Twitter?  Heres a link!    Various links to stuff: I used a couple of animations from a website called printermalls.com.  It seems kind of like a time capsule these days, but apparently its run by a computer store in Myrtle Beach.  Maybe check them out?  Or dont, its up to you.     The Engineer Guy has a good video on photocopiers.  Worth a watch, and if youre somehow not subscribed to his channel, you should be!  Now, strangely, this version isnt on his channel, and I cant find the original.  I dont know if he removed it or what, but heres a link to his actual channel:    You can support this channel on Patreon!  Through the generous support of people like you, this channel has gone from my weird hobby to my full-time job.  Thanks to the support of Patrons, I can run this channel without any outside sponsorship, which is how Id like to keep it.  If youre interested in supporting the channel as well, please check out my Patreon page at the link below.  Thank you for your consideration!   And thank you to the following Patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Thomas Fuchs, Callum Brieske, Tomas, Chuck Floyd, Eitan Tal, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, TeaChest Media, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Kelly Rose, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, TM, Mark Nicholas Wales, T.J. Steckbeck, Pavlo Pravdiukov, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Staval, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Matt Sackett, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Luke Biddle, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, Magnus Tranum, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.printermalls.com/",
        "https://www.youtube.com/watch?v=rhDD0kgA8wA",
        "https://www.youtube.com/channel/UC2bkHVIDjXS7sgrgjFtzOXQ",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Todays video is about printers. I know, youre probably filled with excitement at the mere mention of printers, but please remain calm. If you were to go shopping for a printer, youll almost certainly find yourself choosing between an inkjet printer and a laser printer. Or perhaps a 3D printer, but were not talking about those today. Now, I wont get into the many reasons that I dont really like inkjet printers for anything but photo printing because thats not really the point of this video. Instead, were going to talk about a subset of the laser printer that seems to fly under the radar. The LED printer. Now, if youve never heard of this before I wouldnt blame you. Fundamentally LED printers are the same as a laser printer. They still use powdered toner rather than liquid ink. They use photosensitive drums to transfer toner to paper (along with corona wires and/or other charge inducing or destroying doodads). And a fuser melts this toner onto the paper, so a tall stack of freshly printed printouts is nice and warm, just asking you to give it a hug. But where they differ is in how the image is drawn on the drum. And to understand why thats important, lets have a quick lesson into how laser printing works and how it came about. Laser printers are essentially an offshoot of the photocopier. Using a process called xerography, which comes from the Greek for dry writing (and now you know where Xerox got its name), analog photocopiers use a cylindrical drum coated in a photoconductive material. This material becomes conductive when exposed to light. To duplicate the image, the drum is first charged by a corona wire, which produces a high voltage and gives the drum a static charge. The now negatively charged drum is rolled underneath a piece of paper to be copied, where a lens focuses the image of the paper onto the drum, and a bright light source provides illumination. Because the photoconductive material will conduct electricity when exposed to light, any bright areas become discharged, as a path to ground can now be completed. Dark areas, where printing or handwriting exist on the original, will remain negatively charged. This drum is then rolled against a supply of powdered toner, which is positively charged. This toner will thus want to stick to any areas of the drum that remained negatively charged from the original exposure. Now the drum has a coating of powdered toner in the same pattern as the writing or image or whatever in the original document. Next, another corona wire creates a stronger negative charge in the paper that is to receive the toner, and this stronger charge will attract the toner off of the of drum and onto the paper. And finally the paper, now covered in powder, goes through the fuser unit, which melts this powder to the paper, and thus a stable photocopy is made. Fast forward to the late 1960s, and Gary Starkweather, an engineer from Xeroxs product division, had the idea of using a laser beam to draw directly onto the imaging drum of a photocopier. With computer control, you could draw text and images directly on the drum with the laser, thus turning it into a printer. And thats exactly what happened. Using a laser diode, lenses, and a spinning mirror, laser printers draw onto the drum in lines, and the laser is pulsed on and off to create the image. The resolution of the printer is determined by the number of lines it can draw in a given unit, in addition to the maximum number of times the laser can be pulsed on or off within that line. Often the resolution is measured in dots per inch, so a printer with 600 dpi will scan the drum 600 times along the length of one inch, and the laser can pulse on and off 600 times within one inch of each line, meaning each square inch has 600 by 600 discrete points that can be either on or off--that is, black or white. Incidentally, this method of creating an image using lines of light is strikingly similar to how analog television works. I made a series on television if youd like to check it out, but the pattern is called a raster. Raster scanning in laser printers requires that the entire image, in its full resolution, be loaded into its memory before printing can commence, as it has to be done in one shot. It cant start and stop like an inkjet printer, particularly because the fuser unit is liable to burn some paper (or at least singe it a litte) if it were to suddenly stop mid-print. So, laser printing works. And it works really well! But the actual laser mechanism is kinda big, and relying on a spinning thing to make the image introduces more moving parts and complexity. And thats where the LED printer comes in. When did it come in? And who invented it? Im not sure. Its a weird footnote into the development of the laser printer, but Oki claims to have made the worlds first LED printer in 1981. Its surprising how little info there seems to be about LED printers, though as well see, perhaps thats to be expected. What makes LED printers different? Well, rather than use a scanning laser, LED printers use LEDs. Shocking. But in a unique way--this Brother HL-3040CN is a color LED printer. If I lift on the lid, youll see these four bars here that kinda flip out of the way when the lids all the way up. There are four because this is a color printer--one each for cyan, magenta, yellow, and black (more correctly referred to as key). These bars are the key. Each of these things is an array of tiny individual LEDs. Each LED handles one column of pixels--or dots--on the page. This printer has a resolution of 600 DPI, so along this entire bar there are roughly 5,000 LEDs. If you look closely youll see a pattern of dots--these are lenses that focus the light from multiple LEDs behind them onto the correct spot of the drum. The LEDs themselves are so small as to be nearly invisible to the naked eye. Below these assemblies lie individual drum and toner cartridges. You can see that when the lid is closed, the LED bar sits right on top of the drums. Youll also find evidence of toner mishaps, but, ehhh. So when this printer prints, rather than spinning a mirror and pulsing a laser on and off, each LED simply pulses on its own. As the print drum rotates, the LEDs will flash when they need to, and stay dark when they dont. There are many times as many light sources--in fact thousands of times--compared to a laser printer, but the lack of a mechanical component, plus the direct physical alignment of the LEDs with the drum, means that LED printers might be more reliable. And they certainly are more compact. Particularly with color printers. Notice how this printer has each color of toner simply in a row. Because theres no need for a complicated optical system, this printer is essentially just 4 printers lined up in one case. And if I pull one of these out, youll see how small the toner and drum cartridges are. Yes compared to an injket these are laughably big, but for a toner-based printer this is actually pretty small. This design also gives color LED printers a huge advantage compared to laser--speed. To convert from black and white to color, this printer essentially just takes the printer part, then Ctrl-C Ctrl-Vs it a few times. The paper travels in a straight path as it gets black, yellow, magenta, and finally cyan toners. Then its fused on its way out. Color LED printers used to boast that their printing speeds were nearly the same between color and black and white. Many color laser printers, such as this one from Samsung, print at a fraction of their black and white speeds, because when printing in color, the paper has to take a meandering path through four printing assemblies. With setups like this from Brother, its just boom boom boom boom, fuse the toner, and were done. Now, laser printers do still have their advantages over LED. Its easier to achieve a higher resolution when you have the benefit of motion, rather than relying on smaller and smaller LEDs. Plus, apparently LED printers can have less consistent images due to slight variations between each LED. I cant say whether Ive noticed that in person, but this paper from Xerox sure is trying to convince me. But heres the kinda humorous bit. Im willing to wager that many laser printers available on the market are in fact LED printers, but theyre just not so clearly labeled. Poking around on Amazon I found plenty of printers that dont have much of a difference between their color and black and white speeds, and some printers like this Canon have the toner arranged suspiciously similarly to this Brother printer. And Brother is definitely still using LED printing technology, as evidenced by this picture on this Amazon listing. To their credit, they simply call it a digital color printer and its Amazon thats labeling it as laser printer technology. Anyway, maybe this Canon is a real laser printer, and theyre just packaging the laser scanners more efficiently so that the paper can pass in a straight line. But there are still some color laser printers on the market that print fast in black and white and at a leisurely pace for color. The Samsung unit we looked at earlier prints at a respectable 19 pages per minute black and white, but only 4 ppm color. Not so Xpress, after all. In any case, I think that its a shame how little is known about the LED printer. Sure, on the surface, its just a laser printer. An LED printer will produce near identical results, and behave in a near-identical fashion. Its still a drum and toner system--how the image gets to the drum is arguably trivial. But I think its a clever way to handle it. Thanks for watching this (for this channel anyway) quick video. Ive interrupted the series on the compact disc to bring you this video and well be resuming where we left off soon. As always, thank you to those supporting Technology Connections on Patreon. Patrons of the channel are what keep these videos coming, and if youd like to make a pledge to the channel, please check out my Patreon page. Thank you for your consideration, and Ill see you next time!",
    "transcript_keywords": [
        "LED printers",
        "printer",
        "LED",
        "laser printer",
        "laser",
        "printers",
        "color LED printers",
        "drum",
        "color laser printers",
        "LEDs",
        "toner",
        "color LED",
        "color",
        "paper",
        "makes LED printers",
        "image",
        "black",
        "printing",
        "fact LED printers",
        "Fundamentally LED printers"
    ],
    "transcript_entity_values": [
        "Greek",
        "19",
        "Xerox",
        "Xpress",
        "the late 1960s",
        "Oki",
        "Ctrl-C Ctrl-Vs",
        "one inch",
        "600",
        "Xeroxs",
        "1981",
        "Samsung",
        "Patreon",
        "today",
        "4 ppm",
        "thousands",
        "first",
        "one",
        "four",
        "roughly 5,000",
        "4",
        "Technology Connections",
        "Amazon",
        "Gary Starkweather",
        "Canon"
    ],
    "transcript_entity_types": [
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT"
    ]
}