{
    "id": "_VAlGmtfDN0",
    "title": "Oppo Find N Impressions: The Best Folding Phone?!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-12-15T12:18:22Z",
    "video_url": "https://www.youtube.com/watch?v=_VAlGmtfDN0",
    "category": "Science & Technology",
    "tags": [],
    "views": 3395915,
    "likes": 100196,
    "comments_count": 5172,
    "description": "It's like if you took the Z Fold 3... and shrunk it into a passport size! Sponsored by Cash App: Download from App Store/Google Play store - Use code MARQUES for $15 and $10 goes to Girls Who Code!  MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Phone provided by Oppo for video.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(soft rock music) - Hey, what's up? I'm MKBHD here, and this Oppo Find N might actually be the best folding phone on planet earth right now, at least in terms of form factor. So, as far as foldables go, Samsung's Galaxy Z Fold 3 is the gold standard, right? Huge outside screen, goes right up to the edges, then the large unfolding inside screen with the hidden selfie camera, flagship specs, and cameras, and build quality. So the number one question is, if you could change anything about the Fold, what would you change, and as someone who's used the Fold, the most common answer that I've heard is if it was just not quite as tall, if we could just make it smaller. Like, if you've ever looked at the Fold while it's closed, it's got that super tall, unconventional aspect ratio, and if you wanted to make it more usable, you'd shrink it down, right? Enter Oppo Find N. Now I'm just gonna preface this video by saying most people watching this video here on YouTube will never see this phone because it's a China-only phone and YouTube is not available, officially, in China, so this impressions video is more of my evaluation of the hardware and the idea of a smaller folding phone, not whether you should buy one or not, although it does technically undercut the fold. So it turns out there are a lot of benefits that come from shrinking down the Fold's form factor and, low-key, this might make it a contender for best small phone of the year. So, the outside screen is only five and a half inches diagonally. Now, the rest of the phone is, of course, thicker, so we'll get to that in a second, but shrinking the whole thing down like this makes it much more usable, from corner to corner, as a normal phone, so it's got a normal two by one aspect ratio on the outside, and it happens to be a really nice, bright, nearly 1080p screen, so it's sitting at over 400 PPI pixel density, but the point is it's way more usable and way more pocketable. It's literally about the same size as an iPhone 13 Mini. Now, of course, it is thicker than the iPhone, but that's because you open it up the same way as a Fold with this nice, firm, smooth hinge to reveal a much larger inside screen. So Oppo calls this the Serene Display for some reason, I don't know why everything has to have a name, but it's a 7.1 inch diagonal 1920 by 1729 120 Hertz LTPO folding display. So, on paper, this is only slightly smaller than the Z Fold 3 7.4 inch diagonal, but it does feel meaningfully smaller, and with that 8.4 by nine aspect ratio, it's nearly squared up. It feels kind of like a little notebook size, so it's nice. It's a little less massive and intimidating. You might not be using it all the time as a productivity multitasking device, but it's still a convenient, huge screen for media, writing things down, single apps at a time, and it also feels way more likely to be switched back and forth between portrait and landscape super easily. Also., gotta love the 120 Hertz LTPO tech, which can ramp down the refresh rate when there's not as much happening to save that battery. This one has the ultra-thin glass over the crease that the Galaxy Fold has, and it also does have a protective layer over that. You can actually feel the cutout over the selfie camera. Probably shouldn't remove that protective layer, but the point is this phone has all the same fundamentals that the Z Fold 3 has. I keep referring to the Fold 3 because that's the high-end folding phone that we're mostly all here familiar with, but this really does feel like Oppo's version, Oppo's own modification of that idea. So the hinge is really high quality. It's firm and smooth, which inspires confidence holding it. It can stop at any number of positions, up to 120 degrees open, and sit on a table. Not as much software to take advantage of it, but Oppo has built in a couple of things. You can use the hinge as a tripod to prop up the selfie camera and take photos like that. You can try to watch some videos, but Oppo hasn't really optimized any of their apps or even worked with the Google apps to move it up to the top half of the display, so it doesn't look great, but the software does have really good continuity between open and closed states, so if you're reading something while it's closed and then you open it, of course, it just appears and fills that full screen. Now, if you're doing something with the screen open and then close it, you know, sometimes that just means you're done. You just close the phone, you're done using it, but sometimes, you actually wanna pick up where you left off on the smaller display, in which case, you close it, and then just swipe up and the screen turns on and lights back up exactly what you were using on the cover screen. They've also got the fingerprint reader on the power button. They've got a dual speaker set up for Dolby Atmos sound. They've also dropped in the high-end specs, Snapdragon 888, up to 512 gigs of storage, and eight or 12 gigs of RAM, and they've got the triple cameras on the back. The 50 megapixel main camera, a 14 millimeter ultra-wide, and a telephoto, and Oppo's had some pretty great cameras on their phone for the past couple of years. This one's rounded camera bump reminds me a bit of the Find X 3 Pro, which I really liked. You know what is wild, though? So, they did so much of the same stuff that Samsung did, the ultra-thin glass, the great hinge, the triple cameras, all that stuff, and it's a smaller phone, but they've somehow managed to fit a larger battery in this phone than the Fold. Now, it's still split between two batteries, actually, it's one in each side, so combining the one on the right with the one on the left for that balance, it's a 4500 milliamp hour battery total, which is larger than the Fold 3's 4400 milliamp hours Now, again, this isn't a full review, I haven't been using it long enough to know if that actually translates to really great battery life, but the math checks out. Smaller screens, bigger battery, seems pretty great. And that also ties sort of hand-in-hand with the one con, the one downside, that I really note about a phone like this, which is the outside screen is just 60 Hertz. That would have been nice. I mean, it would have cost more battery, but it would've been nice to match the inside and outside screens at 120 Hertz. Samsung did have the 60 on the outside and the 120 on the inside on the Fold 2 before they matched them on the Fold 3, but, either way, this is fascinating. It doesn't necessarily have to move things forward, technologically speaking, I still think the level of crease visibility, for example, and feelability is about the same as Samsung and Huawei, which is to say barely visible when you're actually looking at the content, but it's still pretty visible when you're really looking for it. But, you know, they don't even do the selfie camera underneath the display. They still have a selfie camera cut out in the corner, but don't forget about the ability to unfold the whole thing and use the primary cameras and the outside screen as the viewfinder, but this isn't a copy of the Fold either. I really feel like the design is the one thing they really embraced the most as their own. This two tone look with the matte finish on the back, the slight slope up to the camera bump, and they also put a bit of text on the indent in the really nice hinge. It says Designed for Find. Look at this. A piece of paper, no gap at all while closed. That's as good as it gets right now. You know what else is as good as it gets right now? Our new channel sponsor, Cash App. So, you may already know Cash App lets you invest, but we should also know is they also have a debit card that you can customize. So, cash app will laser print and mail it to you, and it also comes with a bunch of discounts on places you love called Boosts. So, use code Marques to sign up, and you'll get 15 bucks in your account just like that, it's free money, and also, they asked me what charity I wanted to work with, and so, for every one of you who uses that code to sign up for Cash App, $10 will go to Girls Who Code. That's the charity I chose, so that's a win-win. So, some other little tidbits that didn't fit into the rest of this. This phone is not IPX8 certified like Samsung's is, but Oppo told me and reassures me that they tested it rigorously, and so they're comfortable saying it'll probably survive a splash or going out in the rain or something like that with regular use, and then also, like I mentioned, this phone is China-only, ad they told me that the price will be under 10,000 yuan, China's currency. I had to sort of translate that to US dollars, and that comes out to about 1,500, 1,550, so it's competitive, maybe even undercutting some of the most premium flagship folding phones, but that's almost not the point. It's just trying something different, and a little adjusted from what we've gotten used to. So this whole folding phone category has gotten better. It's gotten more options, more variations, more things to choose, from more ideas out there. I'm curious, for those watching, are you on team big Fold, or a little Fold? Or maybe neither. Maybe you're more of a flip person, but I feel like I do like this sort of a notebook feel better than the bigger Fold, but I'm curious what you guys think. Let me know in the comments. That's been it. Thanks for watching. I'll catch you guys later. Peace.",
    "transcript_keywords": [
        "Fold",
        "phone",
        "Oppo",
        "screen",
        "folding phone",
        "Oppo Find",
        "selfie camera",
        "camera",
        "Cash App",
        "Galaxy Fold",
        "smaller",
        "cameras",
        "feel",
        "Fold form factor",
        "Samsung",
        "smaller folding phone",
        "Hertz LTPO",
        "folding",
        "Enter Oppo Find",
        "nice"
    ],
    "transcript_entity_values": [
        "only five and a half inches",
        "China",
        "1729",
        "512",
        "one",
        "Huawei",
        "120 degrees",
        "3 7.4 inch",
        "Hertz",
        "Galaxy Z Fold 3",
        "Fold",
        "the past couple of years",
        "nine",
        "the Z Fold 3",
        "7.1 inch",
        "4500 milliamp hour",
        "eight",
        "2",
        "15 bucks",
        "Oppo",
        "the year",
        "12",
        "Hertz",
        "8.4",
        "the Galaxy Fold",
        "10,000 yuan",
        "Marques",
        "between two",
        "14 millimeter",
        "half",
        "Fold",
        "over 400",
        "3",
        "about 1,500",
        "1,550",
        "iPhone",
        "Google",
        "50",
        "second",
        "10",
        "YouTube",
        "US",
        "RAM",
        "Dolby Atmos",
        "60",
        "two",
        "Snapdragon 888",
        "4400 milliamp hours Now",
        "Samsung",
        "120",
        "Oppo"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON"
    ]
}