{
    "id": "_YAbvOZk1rk",
    "title": "This is perfect for me! - Elgato Prompter",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-12-01T21:03:50Z",
    "video_url": "https://www.youtube.com/watch?v=_YAbvOZk1rk",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "prompter",
        "elgato",
        "teleprompter",
        "streamer",
        "streaming",
        "twitch",
        "youtube",
        "mixer",
        "kick",
        "cool",
        "camera",
        "setup"
    ],
    "views": 295233,
    "likes": 9687,
    "comments_count": 299,
    "description": "Edit PDFs with UPDF. Get the Big Discount Now:   Riley reads off of a teleprompter almost every day, so when Elgato announced their new Prompter, he was excited to see if this could be a potential replacement for our current bulky teleprompter system. Pitched as an all-in-one solution for streamers, will Riley be impressed, or is there a reason companies spend $$$ on professional setups?  Check out the Elgato Prompter:  Buy an Elgato Facecam Pro:  Buy a Sony Alpha a9 II:    Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Riley likes to read 0:38 Unboxing 1:46 Design impressions, specs, and ports 3:31 Connection the Facecam Pro 4:34 Sponsor - UPDF 5:05 Trying out the Prompter and software features 10:38 Connecting a mirrorless camera 13:20 Overall thoughts and pricing 14:07 Outro",
    "description_links": [
        "https://bit.ly/3sHAZ42",
        "https://lmg.gg/GOWeh",
        "https://geni.us/t9x1",
        "https://geni.us/qwMuxEj",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "I host a lot of videos, and if you watch Short Circuit and compare it to TechLinked or GameLinked, you might be able to tell I do better when I'm reading. I'm like a Ron Burgundy type of situation. So I was really excited when Elgato announced the Prompter. It's an all-in-one teleprompter setup with a single cable that you can plug in to your computer or phone, and immediately seem like you know what you're talking about. Now, if you don't know what a teleprompter is, it's just basically a screen that reflects a script up onto a piece of glass that sits in front of a camera so you can read the script as you're hosting. It's my whole life, basically. Let's move this to the other side and see what's in this box. Prompter, USB cable, USB-C. Ooh, a right angle. Okay, USB-A to USB-C right angle cable. I don't know how long it is. It seems pretty long, though. Braided, hmm, durable. Universal shroud and a DSLR mirrorless backplate. So this is gonna let you use this prompter with a bunch of different cameras, either a webcam, the Elgato webcams, or a dedicated camera that you bring yourself from home. I don't know how this works yet because I'll figure that out later. Step-up rings to step up your hosting video Twitch streaming game. So these are rings that would basically serve as adapters to allow you to fit them into the prompter properly, depending on what your camera and lens situation is. I like how the packaging is all cardboard, not a lot of plastic in here. Okay, let's get the prompter out itself. At least it's, okay, two pieces. Okay, this looks like the platform that the camera goes on. And sure enough, they can't slip it past me. Wow, okay. I gotta say, compared to the prompters that we work with here and the prompters that I've seen elsewhere, this looks slick. Like, this is a slick-looking prompter. Maybe I'm being silly here, but I appreciate that there's sort of this like matte, nice finish on it. Like, it doesn't look like cheap plastic or anything. And they have this cool, like, design on the bottom, signifying brains, because if you use one of these things, you're smart. Gotta say, that's a very, very small window. I don't see how you're gonna put in a DSLR lens in there, but it's because this is a plate you can take off. It says, for FaceCam Pro. There we go. That looks like the prompters I'm used to working with. However, we also have a mirrorless camera with a lens that we're gonna try and fit on there and see how that works. It looks like you can take the tablet off. And sure enough, there are screws on the back there. So I'm guessing you can remove the tablet if you want, but. Now, the tablet itself is a nine-inch screen. It's a 1024 by 600 resolution. And you might be saying, that's too low for gaming. Well, yeah, no, you're not gaming. All you're gonna do is like put text on here. So it doesn't need to be super, super high resolution. However, this mirrored display, hello. The glass portion of the display is obviously, you know, it's a bit bigger than the nine-inch display. It's a bit taller. And it's got optical grade 7030 beam splitter glass is what they call it, which just means, you know, it's mirrored. So you can see what's on the display on the mirrored glass. Now, as for ports on the tablet itself, as advertised, there's just this single USB-C port, which you can connect to your Windows PC or your Mac or your Android. First of all, let's connect the webcam. Elgato says that they have, you know, very wide compatibility for a lot of different camera setups. Hopefully the setup process isn't that confusing. Okay, so this is the camera platform and then you can slide it up and down depending on how big your camera is gonna be. Oh, it's supposed to actually fit into that little window. Okay, yeah, yeah. Okay, see, that's nice. Let me just say so far, this is real smooth. I mean, having a teleprompter made by a company that makes webcams is immediately nice because they have this like perfect cutout for their webcam that they sell. Okay, and now on the bottom, we have these tripod mounts. So you can, I guess you could either use this one or that one or both. Accessories. We also have these two cold shoe mounts on the top. So you have like a mini shotgun mic that you use for your setup. Then you can just stick it right in there. Thanks to UPDF for sponsoring this video. A PDF editor is something that you don't think you need, but when the time comes, you'd be happy to add one. Be it signing important documents or translating foreign recipes, UPDF's AI empowered tools make editing and analyzing PDFs a breeze. Their OCR or optical character recognition conveniently transforms images into editable text. And for their limited time Cyber Monday sale, UPDF is offering you guys a whopping 63% off. So click the link below and check it out. All right, we are here with the Elgato prompter set up. It's asking me if I'm ready to roll the camera and believe me, I am very exciting. So once you connect the tablet via the USB-C cable to your laptop, you can install the Elgato camera hub software. And if you don't have it installed already because it's the same software that you use with your webcam you go into the prompter section and here you go. You got your script. You got some options on the side here for brightness. Yes, I can make it darker, brighter. You have the content window where you can change it to be either text showing your script that you wrote or whatever, or you can have it as a secondary monitor or an even better option if it works, it's in beta right now is this chat integration where you can give it your Twitch channel and an optional title. And then it will like display the chat in their own style. We're gonna test this out by linking to just a random Twitch streamer that we thought of Kit Boga. Okay, there it is. That's pretty cool. And now we're recording on the Elgato Facecam Pro and indeed, I mean, you tell me, can you see the chat coming flipping by? No. Now pretend this is a live stream and I'm reading this comment from you in real time. So much sauce today. Well, how did that feel? Felt pretty good to have eye contact while that happened, didn't it? Now, depending on how fast the chat is going, I'm not sure how engaging this is going to be for the people making chat messages, especially when it's going this fast as like someone's looking at the camera. Like, is it better to have somebody looking at the camera and trying to like read, or is it better to have them looking down here and trying to read? Because in both scenarios, if they're actually reading your comment, talking to you through the camera, great. There's connection. There's parasocial dynamics going on here and that's exciting. But if you're just looking up at the chat and just being like, oh, it's going so fast, there's gotta be a way to like slow it down. Are there settings for the chat? Oh, font size. Okay. Yeah, you can change the font size down to 10 point, which is far too little to see. Unless, I mean, if this was right up here, I could, that's readable because that's one of the big selling points of this thing. Because it's so small yet so clear and so easy to use and so built for wide angle cameras, you can bring this thing right up over your monitor as opposed to like big giant teleprompter setups, which are like way more clunky and you have to have like heavy monitor arms and stuff and whatever. You could just like put this thing on a box. Don't put it on a box. You're better than that. Oh, you can bring it more into the center or over to the side. You can have the text to be, oh, you can have completely custom colors for the text and background. Red on white, if you want. Let's see if the background color affects the actual video output. Yes, and it does. So that's somewhat unsurprising. If you make the background color white, you can, but it will affect, you'll be able to see that your recording is a little bit more washed out. So just be aware. You can also change the font. Ooh, if you want impact, no Comic Sans. There's an opacity slider as well. If you want to have something behind the actual text. I can't think of a example off the top of my head that that would be useful for, but there definitely is something. And the last section here is called scrolling. You have an auto-scroll chapter button, which basically means, is it gonna stop after it finishes the chapter or is it gonna keep scrolling through each of these chapter sections you have in your script? Okay, let's see how this goes. Script.com, Bee Movie by Jerry Seinfeld. Narrator, black screen with text. The sound of buzzing bees can be heard. According to all known laws of aviation, what's the deal with bees? My main complaint so far seems to be that you can scroll in the software here very easily and kind of see, oh, okay. I see at a glance the whole script, but I can't see an easy way to scroll on the tablet. Unless I'm just, like, you can split it into chapters and then you can hit the skip back and skip forward button to like jump to certain chapters. But with our prompter software that we use, you can scroll up and down. Like it's a, this is not a touchscreen, right? No, it's not. So you can just scroll up and down either with the touchscreen because we use iPads for that, or we have remotes that you can scroll up and down on the script. As a video host, I really appreciate that. And I can't see an easy way to do that unless I'm tripping. Now you don't have to use the Elgato Camera Hub software. If you just plug it in and don't launch the app, or if you select display in the app, it just shows up as another monitor. So you can throw anything on there. You can even play a game on there, which I, now that I've said it, I want to do. This is not a good idea. So yeah, you can play a game on it. You can do anything you would do with an external display. Playing with a laptop track pad and a teleprompter as a display. I can see a whole new genre of video game streaming, where you still see the game is still the majority of the screen for the viewer, but then the Insep webcam is you looking. Wow. Do you feel like you're there? Yeah, when I'm watching the streamer, I really feel like I am his computer. Okay, the last thing that I wanted to see was how easy it is to connect a mirrorless camera with a big old lens on it, as opposed to just like plugging in Elgato's own webcam. They include a bunch of these adapter rings. So let's check it out. Okay, let's take this, the adapter plate for the webcam off and put on the adapter plate for mirrorless lenses. Okay, and now this, what is this camera here, Glenn? It's a Sony A9 with a 24 to 105 millimeter lens, but the mount on the front fits 77 millimeter adapters. And the Elgato prompter comes with nine sizes from 49 millimeters to 82 millimeters. And we have a 77 millimeter adapter right here. It's just got a little bit, it's like it barely looks like anything, but there's a little bit of a lip there that's going to allow you to slide it in to this adapter, so that it stays in place. So there it is, that's not going anywhere. A specific issue that we're running into here is that this is kind of a long lens, the 24 to 105. And most lenses that you're going to use with a teleprompter are going to be on the wider side, which means that they're going to be on the shorter side. Now, because this lens is long, the included mount doesn't let us, you know, it doesn't let you connect from the mount to this part of the prompter. You can connect it to the camera just fine, or you can connect it to the prompter just fine, but not both. So in this situation, if you really needed to use this lens, then you would have the camera mounted on a tripod and then have another tripod or a C-stand or something connected to the bottom thingies there. So then you'd have two things, you know, two supports for your setup. A better solution would be just to, you know, use a shorter lens that actually can work with this mount. It doesn't give you a ton of room, depending on your camera. Like, you need to have a pretty short lens for that to line up properly. You know what? Scratch that, I have this the wrong way. So it's supposed to go this way, and that leaves you more, you know, a little bit more room, but it's still, this lens still doesn't cut it for this setup. But just be aware, if you want to use a mirrorless camera or another camera with like a big lens on it, this may be an issue you could run into. But the mount not fitting isn't the end of the world, as Elgato does show that you can hang the prompter off the end of the lens if you're comfortable with that. I'd still prefer to set up an additional support for the prompter just to be extra safe, but it's not 100% necessary. Now, all that said, for an all-in-one solution with a tablet included and software that makes things pretty easy to use, this thing is $280, ships in March. You know, that's not bad for an all-in-one, easy-to-use setup. I think there's a lot of teleprompter setups that you have to like supply your own tablet or whatever. Overall, pretty happy. Nice job, Elgato. I don't want to switch to this for our videos because it's a little small and we have our cameras far away. But I think for independent video creators who are kind of making videos on their own and you're in your personal studio in your bedroom or whatever, I think that having something like this where you can have a wide angle setup with a easy-to-use teleprompter or for Twitch streamers or whatever, doesn't seem like too bad of an idea. Hey, that was a short circuit. Thanks for watching. Subscribe to the channel. And if you're looking for something else to watch, I got a hot tip for you here. This Peakdo wireless gaming thing that I took a look at, that was pretty crazy. Wow.",
    "transcript_keywords": [
        "camera",
        "Prompter",
        "Elgato",
        "Elgato camera hub",
        "lens",
        "Ron Burgundy type",
        "Elgato camera",
        "Elgato prompter",
        "Ron Burgundy",
        "tablet",
        "display",
        "teleprompter",
        "setup",
        "webcam",
        "mirrorless camera",
        "connect",
        "script",
        "chat",
        "text",
        "pretty"
    ],
    "transcript_entity_values": [
        "24",
        "49 millimeters",
        "Glenn",
        "100%",
        "a ton",
        "Elgato",
        "one",
        "USB",
        "March",
        "no Comic Sans",
        "Script.com",
        "Bee Movie",
        "Twitch",
        "webcam",
        "Mac",
        "Kit Boga",
        "105",
        "nine",
        "Ron Burgundy",
        "DSLR",
        "600",
        "FaceCam Pro",
        "today",
        "7030",
        "OCR",
        "Cyber",
        "63%",
        "77 millimeter",
        "10",
        "Elgato Camera Hub",
        "280",
        "Peakdo",
        "Sony",
        "Prompter",
        "UPDF",
        "105 millimeter",
        "two",
        "Jerry Seinfeld",
        "nine-inch",
        "Android",
        "Monday",
        "A9",
        "TechLinked",
        "iPads",
        "Short Circuit",
        "82 millimeters",
        "Twitch",
        "USB-C",
        "USB-C. Ooh",
        "First",
        "1024",
        "GameLinked",
        "PDF",
        "Insep"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "FAC",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON"
    ]
}