{
    "id": "_Yr6CaKstZw",
    "title": "Fake SSD Scams (Worse Than I Thought) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-06-23T15:59:47Z",
    "video_url": "https://www.youtube.com/watch?v=_Yr6CaKstZw",
    "category": "Science & Technology",
    "tags": [
        "Fake SSD Scams (Worse Than I Thought) - Krazy Ken's Tech Talk",
        "solid-state drive",
        "SSD",
        "Flash Drive",
        "Fake SSD",
        "SSD Scams",
        "Hard Drive",
        "M.2",
        "PCIe",
        "NVMe",
        "Apple",
        "Mac",
        "MacBook Pro",
        "Windows",
        "Microsoft",
        "PC",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Computer Clan",
        "False Advertising",
        "Scam",
        "Atomic Shrimp",
        "USB"
    ],
    "views": 1021919,
    "likes": 22878,
    "comments_count": 1359,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Fake SSD and flash drive scams are spewed all over the Internet, so I investigated one! And it's worse than I thought. Part 2 linked below  Watch part 2!   Watch more tech scam-busting episodes   Download our epic wallpapers   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/UjVvlaCGGhA",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Oh, wow. I can buy this SSD that's eight terabytes for only $99? Sold. This is a bad idea, isn't it? Sponsored by Linode. (air whooshing) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and fake flash drive in SSD scams have plagued the internet for years and it's finally time for me to tackle this problem. We'll take a look at an example of a fake SSD product and then I'll show you some ways you can spot these things in the wild so you don't get tricked. And then I'll show you some tests you can run so you can see if these things live up to the claims. So let's take a look at Londoncomfy. (air whooshing) I heard about this company from one of my viewers, Marianne, from a Twitter DM. Londoncomfy's website claims they're an English family business specializing in retail products. They have a lot of categories on their website, many with broken thumbnails. And overall, the giant unfocused list of products just has a really cheap feeling to me. And something that threw me off was this photo of their founder, Margot. When was the last time you saw a real CEO of a serious company posing with a logo of his own business on his shirt and on a mug. That just seems like a stock photo to me. A quick reverse search proved that. We can see many other sites using the same model for their shirt and mug renders. So we can reasonably conclude this founder is totally fake. And if a brand is lying about the founder's name and face, I can only imagine what other BS is going on under the hood. Oh, and that phone number in the footer, don't even try it. It doesn't go anywhere. We're off to a great start and we haven't even tested the product yet. The SSD product page gives you five storage capacities, ranging from 500 gigabytes to eight terabytes. And it claims this SSD is fast with 520 megabyte per second file transfer speeds. Is that possible in the real world? Absolutely. Solid-state drives typically are faster than mechanical hard disc drives and they can store terabytes of information in a really small space. Instead of using a platter with magnetic particles and an actuator arm, SSD store data in a chip using electrons, a series of gates, and more architecture that goes beyond the scope of this episode. This allows the drive to store a lot of data in a compact and quiet space and it lets the computer access it really fast, but are we truly gonna get fast speeds and high capacity with this product? Let's keep digging. The Londoncomfy website also gives us a fake countdown timer for the 25% sale. And this is just a scarcity marketing tactic to give you some urgency to make you want to buy immediately. Now, I do wanna make a disclaimer about this because I've talked about this a lot. Not all countdown timers are bad. A countdown timer on a website doesn't automatically mean a product is a scam. There are legitimate uses for them, but when a website uses them and they just repeat themselves over and over and don't actually lead to anything that truly expires, that's kind of fishy. Here's a way you can test that. (air whooshing) Take the webpage you're looking at, copy the link and paste it into an incognito or private browser window and load it up. If the timer changes, it's likely a fake countdown timer. So that's the gist of the Londoncomfy website. And that brings us to the first real problem with this product, the price. (air whooshing) The first big red flag for me was they were selling an eight terabyte 520 megabyte per second SSD for only $99. That sounds way too good to be true. Now, consumers that aren't versed in the tech space, may not realize that, but in reality that doesn't make any business sense. In 2022, if you were to buy a real eight terabyte M.2 form factor solid-state drive, you're gonna spend at least $1,000 on the cheaper end. If we look at a 2.5 inch form factor with the same capacity and similar speeds to what Londoncomfy is advertising, you're still looking at about seven times the price. So there is no way Londoncomfy is taking $1,000 part, cramming it into an enclosure and profiting off of a $99 sale. It's impossible. So always cross check prices. If you see a cheap gadget, look it up on another website to see what equivalent products are actually selling for. And if you need help, feel free to ask someone who you know that is more versed in the tech space because they will have a better sense of the market. So with this crazy website, BS countdown timer and ludicrous pricing, you would think I would run away from a product like this, but of course, I went ahead and bought one. (air whooshing) I purchased the eight terabyte model and boom, the purchase process was actually really easy and less spam-filled than many of my other investigations. So I'll give them a gold star there. And it arrived. It took a couple weeks I think, but it didn't arrive in that fancy shopping bag that the website shows. What a shame. Anyway, it's here now. So let's take a look at it. (air whooshing) The box has no brand names or any mention of Londoncomfy which is not surprising because this is likely just a generic product from China. Oh, made in China. Look at that. And the box advertises USB 3.1 speeds, which in theory would offer pretty fast data transfer rates, but we'll test that out soon. And inside the box, we get the drive, the USB cable and two adapters. USB-A to C and USB-A to Micro B. And these instructions. When using desktop computers, data wires need to be connected to the USB interface behind the main cabinet, like a filing cabinet. The power supply on the tront USB interface is generally unstable. Butter fingers, who am I, Linus Tech Tips? Don't shake the body when accessing data with a mobile hard disc, like the body of the SSD or just like your body in general. Don't do this when using a hard drive, it's very dangerous. Number four, don't fall. Like in general? I mean, yeah, that's generally good advice. So physically, the device looks okay. It's got a metal finish. It's small and compact, but now let's plug it in and test it for real. (duck quacking) Oh, they spelt flash wrong. It's gonna be a long day. (air whooshing) Anyway, I tried formatting this thing to HFS Plus. The process took about two minutes when it usually takes a few seconds. Ultimately, the formatting finished and I ran Blackmagic's Disk Speed Test on the drive. And the speeds were atrocious. One megabyte per second write and the read test wouldn't even execute. I reformatted the drive as ExFAT and tried again and funny enough, it got 11.3 write and about 18 read. Better but still total crap. Side note, if you're on Windows, you can use CrystalDiskMark to test your drive speeds. So the speed claims are false. And in the real world if you were trying to do serious work with this thing with large files, it would be practically impossible to do that, but I didn't stop there. I opened this device up in the macOS System Information application and the speed registered as 480 megabits per second, which is the theoretical speed of the older USB 2.0 standard, which is much slower than what's advertised, USB 3.1. If this was truly a USB 3.1 Gen 1 device, that speed would register as five gigabits per second, about 10 times faster theoretically. So we have doubled confirmed that the speed claims are false. Certainly this product can't get any worse, right? Let's test the capacity. (air whooshing) I'm using a Windows program called H2testw. This test writes thousands of one gigabyte files to the SSD and then it verifies them to calculate the true capacity of the device. For a control, I tested a USB flash drive that I trust and the test showed no errors. Great, moving on. For this eight terabyte drive, the test needs about 96 hours to run because the drive speed is so slow and it has a lot of bites to read and write. And of course, Windows Update rebooted the computer in the middle of the test so I had to restart from the halfway point. Thanks Windows, it's not like I have anything better to do with my life. Actually I don't, so whatever, but don't worry. I pressed that pause updates button so now we should be fine. The test ran for 39 more hours and then it got interrupted again. I think because I bumped the USB cable. It fits really loose compared to a normal cable, but that doesn't surprise me. This thing is a cheap piece of crap. Either way I had the data I needed and I couldn't justify restarting the test again because it takes days to run. The final results shows 58.2 gigabytes of data is okay and 3.1 terabytes of data was lost. And 164 gigabytes of data was overwritten out of a total 3.37 terabytes verified. So only 58.2 gigabytes of data can actually be stored on here which is actually way less than I thought it was gonna be. I was giving this product too much credit, but I wanted to go beyond just a test program. Now, I wanna try this out with a real world application, something I do all the time, video editing. (air whooshing) I reformatted the drive as HFS Plus for macOS and I'm copying an over 400 gigabyte final cut pro, video editing library onto the drive. The transfer was incredibly slow, but on the surface it looks like it finished with no errors, but of course the data was behaving erratically. The final cut library size was reported incorrectly in the Quick Look window compared to the Finder window. And the library would not open either. I dug into the library bundle to examine individual files. A movie file that was within the 58.2 gigabyte limit, actually opens successfully which checks out with the test results, but all other movie files were corrupted. So despite showing up in the OS as an eight terabyte volume, it can actually only handle 58.2 gigabytes which is less than 1% of the advertised capacity. So how is this thing tricking the OS? Here's how that works. (air whooshing) The flash storage chips on an SSD board need a brain to communicate with the rest of the computer. This brain is a controller which is generally a separate SOC or a system-on-a-chip on the board. The controller uses a firmware so it can function and communicate properly. And firmware is a type of software that is programmed directly into a piece of hardware. However, this firmware can be programmed in a misleading way so the controller tells the OS the incorrect capacity. And as I have shown, this SSD does not give you the advertised speed or capacity. It's not even close. So let's bust this thing open to see if we can find out what parts it's using and maybe that will give us some more clues as to why this thing sucks so much. And first, I have to give a special thanks to Noah-n Cares, Lane Wallen, and Toby The Greatish. You guys helped me research this episode and I appreciate that very much. All right, now let's bust this thing open. (upbeat music) Okay, so this thing is just filled with glue. It really looks like they don't want you getting inside or that was just their lazy way of securing the components. So the glue was a problem and I've seen some mixed results about using alcohol to dissolve the glue, but I have heard that heat works okay. Unfortunately, I didn't realize that until after I busted out my caveman skills and kind of just cut and smashed the thing to pieces. So unfortunately we just have some remains in this baggy here, but still it helps get my point across. This thing is literally just a micro SD board that adapts to USB-C. Here's the card smashed in the process, but you can see by the contacts, this is a micro SD card, not an M.2 SSD. And that surprised me because I thought it was just gonna be a cheap storage medium like you'd find in a USB 2.0 pen drive or something, but no, it's literally just a micro SD card. And I'm going to guess this chip is the controller that has the fakey firmware on it. And what's amusing is the scammers shaped the enclosure to make it look like an M.2 SSD would fit in there, but clearly this board doesn't fit that spec. I should also mention Atomic Shrimp recently dropped an episode about this topic. So feel free to check that out too. Coincidentally, he dropped that episode while I was working on my own. Almost as if he's spying on me. Relax Ken, no one is spying on you. I know that, I'm not paranoid. Anyway, yeah, it's a piece of crap, but if you use Linode, they will give you the speeds and capacity that you actually pay for. They do it right. If you have an application or a website that you need to scale or deploy, Linode has the infrastructure and the 24/7 support you need, but the cool thing is, Linode is much more than just data centers. (air whooshing) Linode offers out of box apps for game servers like TF2, CS:GO, and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the create free account button. And when you do that, I'll give you a 60-day $100 credit, just for watching this episode, pretty good deal. And you're also supporting the Computer Clan. So thank you very much. So be wary of those fake SSDs and flash drives. And the biggest red flag I would say is the price. Check those prices 'cause after all, if it looks too good to be true, it probably is. Well, that was a lot to go through. Now I have to store all of this footage for this episode. Well, I hope I used a reliable SSD Ha ha ha ha (upbeat music)",
    "transcript_keywords": [
        "SSD",
        "test",
        "drive",
        "USB",
        "data",
        "thing",
        "product",
        "SSD product",
        "website",
        "Londoncomfy",
        "Londoncomfy website",
        "Speed",
        "fake SSD product",
        "speeds",
        "Linode",
        "capacity",
        "SSD store data",
        "USB flash drive",
        "real",
        "fake"
    ],
    "transcript_entity_values": [
        "HFS Plus",
        "Londoncomfy",
        "58.2 gigabytes",
        "Blackmagic's Disk Speed Test",
        "two",
        "480 megabits",
        "SSD",
        "a few seconds",
        "Windows",
        "3.1",
        "less than 1%",
        "only $99",
        "Twitter",
        "1,000",
        "days",
        "about 10",
        "Number four",
        "One megabyte",
        "HFS Plus",
        "Linus Tech Tips",
        "520 megabyte",
        "years",
        "Linux",
        "terabytes",
        "100",
        "eight terabyte",
        "about two minutes",
        "60-day",
        "Joomla",
        "first",
        "Toby The Greatish",
        "25%",
        "11.3",
        "2.5 inch",
        "Finder",
        "Linux",
        "Linode",
        "a couple weeks",
        "the macOS System Information",
        "USB",
        "Ken",
        "24/7",
        "SOC",
        "39 more hours",
        "eight terabytes",
        "TF2",
        "about seven",
        "only 58.2 gigabytes",
        "an over 400 gigabyte",
        "Krazy Ken",
        "thousands",
        "Windows",
        "USB-C.",
        "Minecraft",
        "Marianne",
        "the Computer Clan",
        "Londoncomfy",
        "3.1 terabytes",
        "Margot",
        "99",
        "about 18",
        "as five gigabits",
        "2022",
        "China",
        "58.2 gigabyte",
        "Lane Wallen",
        "about 96 hours",
        "3.37 terabytes",
        "500 gigabytes to eight terabytes",
        "Atomic Shrimp",
        "English",
        "Noah-n Cares",
        "SD",
        "a real eight terabyte",
        "164 gigabytes",
        "five",
        "second",
        "Linode",
        "at least $1,000"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "PERCENT",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "GPE",
        "QUANTITY",
        "PERSON",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "LANGUAGE",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "MONEY"
    ]
}