{
    "id": "A-cj1mlnf7M",
    "title": "WWDC 2019 Predictions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-06-01T15:32:45Z",
    "video_url": "https://www.youtube.com/watch?v=A-cj1mlnf7M",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "wwdc 2019",
        "apple",
        "annoucements",
        "wwdc"
    ],
    "views": 131147,
    "likes": 5945,
    "comments_count": 524,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- One more day until WWDC. It is so, so close. I can almost just smell the new, I was gonna say Apple products but I guess, Apple software. Because again, it is the developers conference so a lot of the things that they're gonna be announcing has to do with software updates. So I've already made a video talking about some of the iOS 13 rumors. But some of the other things that we are predicting that will be announced at WWDC is an updated version of macOS, which would be 10.15. Updates to tvOS and of course, watchOS. The watchOS update is something I'm really excited about. Like, I love my Apple Watch so much, I've talked about it in the past. It has been just one of my most favorite devices, of course, other than my iPhone. But I use it so much. I don't think I've really taken it off since over three years. And to prove it, my body has conformed to my Apple Watch. I am my watch! Here on MacRumors, they're talking about some of the new health applications through the works. One of which is a Dose app. It's for pill reminders. A cycles app for tracking your menstrual cycles. This is something that I'm excited about. Ladies, I think that you would be excited about it as well. I'd like to have like a countdown, that it's like, five days of freedom. Four days of freedom. Three days until you're miserable. Today is gonna suck. Tomorrow is gonna be awful. Welcome to your week of misery. That'll be really great if they would send you like present or something in the mail, like a pack of tampons. I don't know. Apple plans to add a Calculator app, a Voice Memos app, an app for listening to audiobooks, plus Animoji, Memoji stickers all on your wrist. New watch faces, including Gradient that makes a gradient out of a color the user chooses two new extra large watch faces, showing jumbo numbers. I really like that because if you do have difficulty seeing or if you don't have your contacts in, or something like that, you may be able to see a little bit better. Another thing that's a big highlight for the watchOS is the Apple Watch will be getting its own App Store. So much like there's an iOS App Store, there's a macOS App Store, and Apple Watch App Store. You would be able to easily download, install apps and buy apps. So I think that's gonna be kind of interesting because it's also gonna open up a whole another world of app developers. That'll be another revenue stream. Obviously, you can still have Apple Watch apps now, but having its own dedicated App Store, I feel like will just have more visibility to the apps that are available. So the App Store will then be able right on your wrist. You can download and install apps right from here, so you won't need your phone. Again, I already talked about some of the iOS 13 updates, but if you haven't seen that video, I'll put a link in the description and an annotation where you can go watch that entire thing. But basically, the highlight for me on iOS 13 is going to be having a dedicated Dark Mode. The updates to the Files app which is desperately needed. Find My Friends app, the Messages, the Mail, there would be all kinds of other updates. Of course along with some speed updates. Hopefully improved battery life, that's always something that is very, very important. I'll never forget that update from 11 to 12 was so incredibly significant. There was so many issues with 11 that iOS 12 was like a brand new freaking phone. I don't think 13 will be that much of an upgrade because 12 already works pretty well. But I am definitely looking forward to everything that they do announce. macOS 10.15, something else that I'm look forward to, even though I'm one of those people that I wait a very long time to update my OSs on my Macs. I'll usually update it on a secondary device that I don't edit on. I'm always so concerned with the capability of Final Cut and the updates, so usually that something that takes precedent over an updated OS. It looks Apple is planning to introduce new Music, Podcasts, and Books apps in OS 10.15. They will be available alongside of new TV apps designed for Mac which is kind of also exciting, so you would be able to download the Apple TV app all in your Mac, so you would be able to watch all of that TV content directly on here. This is cool too. Some other new features include support for an iPad as an external display. This is, I, I'm into this, especially because I travel so much and I usually almost always have my iPad Pro with me. To be able to use that as a secondary display, whether I'm just using it for email or kind of like a second window of Final Cut. That's gonna be so cool! Mac Pro, ha! I hope this happens. I mean, I'm not gonna hold my breathe because if I do, I might pass out, I might die, and I don't wanna die before WWDC happens. But it says that rumor suggests Apple is considering previewing the redesigned Mac Pro. What is this, what is this, what is this? Show me something, show me something, show me something. Oh, look at that. That's interesting. Look how thin that is. What is that? What is, it's gonna tip over. Something gonna knock off your desk so fast, you wouldn't blink in the things that have fall over. Not realistic! But this is cool. I kinda like that. It's kind of like a slimmed down version over the old school towers. A trashcan Mac. Definitely should've saved my money. So those have been some of the things that I read online that people are something that will be at WWDC. I think for me, I'm really looking forward to seeing if we're gonna have any type of updates on the HomePod because I love my HomePod. I use my HomePod so much. I walk around my house talking to Siri all day like she's a friend. I mean, sometimes, she doesn't answer me or she does answer me and doesn't answer the right questions, and sometimes doesn't even listen to me at all. Speaking of Siri, can we just talk about how just frustratingly noncooperative she is sometimes. I ask her a question like, okay, what is Oprah's middle name? - [Siri] I found Orpah and Gail. - I found Orpah and Gail. Okay, what was I saying? Oh, I was trying to show you that sometimes Siri doesn't listen to me but that was not a good demo either. If you guys used Siri long enough, you know what I'm talking about. So I just think that the overall database and knowledge and just the AI of Siri needs to step it up significantly. So that is something that I think if they'd make any mention of that at WWDC, you will hear applauds. You will see me standing up, clapping my hands like a seal. (seal barking) (Justine clapping) The most are hoping for some new Animoji characters, maybe an updated Animoji accessories list, potentially something where you can go in and buy things for your Memoji. I would do it. I'm sure many of you would too. Microtransactions. I'm such a sucker. Of course I'm hoping for some iPhone updates but again, this is a software developers conference, so we probably won't get much on hardware, although I will cross my fingers and hope for the best which I also hope that they will announce something regarding the Mac Pro, maybe just get a little hint of something, I don't know, maybe a hint of a new HomePod, like a HomePod with a screen, or like a mini HomePod. I don't know, I don't care, I want all of it. Okay, I'm gonna calm down because I'm getting a little bit excited. I need to go pack and I will see you guys at WWDC. It's here, it's almost here. It's not here yet but it will be. Depending on how fast I edit this video. Okay. I'd love to know from you guys what are some things that you're looking forward to, what are some of the predictions that I mentioned that you think will be real, like most of them are actually will be real 'cause they're not that farfetched. But I will see you guys again at WWDC. Don't forget to subscribe, hit the bell, follow me on Twitter, follow me on Instagram, follow me on freaking TikTok. I doing TikTok recently? Not sponsored. Doing it on my own accord. Okay, I'm gonna go, edit this video. I don't know, I'm just getting so excited. I'm getting so excited. I gotta go. I gotta go! Bye! (upbeat music)",
    "transcript_keywords": [
        "App Store",
        "Apple Watch",
        "app",
        "Apple Watch App",
        "Apple",
        "Watch App Store",
        "Watch",
        "apps",
        "Mac Pro",
        "updates",
        "WWDC",
        "Store",
        "iOS App Store",
        "Mac",
        "macOS App Store",
        "Siri",
        "Watch App",
        "Watch apps",
        "dedicated App Store",
        "things"
    ],
    "transcript_entity_values": [
        "the App Store",
        "Podcasts",
        "WWDC",
        "Tomorrow",
        "12",
        "WWDC",
        "One",
        "iPad",
        "Dark Mode",
        "second",
        "Animoji",
        "Four days",
        "10.15",
        "Apple",
        "Justine",
        "Apple Watch App Store",
        "Memoji",
        "Siri",
        "iPad Pro",
        "Mac",
        "iPhone",
        "Today",
        "Mac Pro",
        "Instagram",
        "MacRumors",
        "iOS 13",
        "13",
        "HomePod",
        "Gail",
        "App Store",
        "Three days",
        "Music",
        "Siri",
        "Animoji",
        "Mac Pro",
        "the Mac Pro",
        "two",
        "Calculator",
        "five days",
        "Twitter",
        "11",
        "Final Cut",
        "Macs",
        "Apple Watch",
        "Mac",
        "Oprah",
        "Orpah",
        "three years",
        "macOS",
        "TikTok",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG"
    ]
}