{
    "id": "A0DEnMi09LY",
    "title": "GNS3 Install: VMware Workstation Pro",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-10-10T16:02:54Z",
    "video_url": "https://www.youtube.com/watch?v=A0DEnMi09LY",
    "category": "Science & Technology",
    "tags": [
        "gns3",
        "gns3vm",
        "gns3 tutorial",
        "gns3 david bombal",
        "gns3 installation",
        "gns3 2.2",
        "gns3 vmware",
        "gns3 vm setup",
        "gns3 vmware workstation",
        "gns3 lab",
        "gns3 web ui",
        "gns3 2.2.0",
        "gns3 2.2 web ui",
        "gns3 2.2 web gui",
        "gns3 version 2.2",
        "david bombal",
        "GNS3",
        "gns3 2.2.1",
        "gns3 new version",
        "gns3 virl",
        "gns3 qemu",
        "gns3 dynamips",
        "gns3 upgrade",
        "gns3 vm esxi",
        "gns3 update",
        "ccna",
        "gns3 ios",
        "gns3 windows 10",
        "cisco",
        "gns3 cisco",
        "virl gns3",
        "gns3 talks",
        "gns3 help",
        "gns3 windows",
        "gns3 install",
        "gns3 2",
        "ccnp"
    ],
    "views": 326962,
    "likes": 7731,
    "comments_count": 435,
    "description": "Want to know how to install, configure and setup GNS3 2.2? Well, these videos show you how. In this video, I show you how to integrate the GNS3 VM with the GNS3 GUI, setup Intel VTX in your computer's BIOS and make sure nested virtualization is enabled. Follow these steps to make sure you can get your GNS3 network working in preparation to run Cisco devices such as Cisco VIRL appliances on GNS3.  In subsequent videos I'll show you how to download Cisco IOS images and use them in GNS3.  Previous Video:   ================================= Menu: ================================= Overview: 0:00 Download GNS3 VM: 2:19 Download VMware Workstation: 4:10 Install VMware Workstation: 5:03 Import GNS3 VM into VMware: 7:50 GNS3 GUI and GNS3 VM integration: 8:32 KVM support available: True: 10:30 Configure VTx in Computer BIOS: 11:04 Enable GNS3 KVM Support: 13:45 GNS3 RAM and CPU: 14:12 New Project: 16:25 Save project and restore project: 18:45  ================================= Calculators: ================================= VIRL Resource Calculator:  GNS3 Calculator   ================================= GNS3 links:  ================================= GNS3 website:  GNS3 GitHub page:   ================================ Books: ================================= Cisco Press Book:  Good O'Reilly Book:   GNS3 EVE-NG VIRL Packet Tracer  10x Engineer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   #gns3 #eveng #virl",
    "description_links": [
        "https://youtu.be/Ibe3hgP8gCA",
        "http://bit.ly/sizevirl",
        "http://bit.ly/gns3requirements",
        "https://gns3.com/",
        "https://github.com/GNS3/gns3-gui/releases",
        "https://amzn.to/2LpaU1a",
        "https://amzn.to/2Lpbw6Z"
    ],
    "transcript": "- When you run GNS3 on a Windows computer, there are two main components you need to be aware of. We have the GNS3 GUI application. This is an executable application that you install directly on Windows, but we also have the GNS3 VM, which you run with in a hypervisor such as VMware Workstation Pro, VMware Workstation Player, Hyper-V, VirtualBox, ESXi, as an example. In this video, which I've linked here, as well as below, I showed you how to install the GNS3 GUI on this laptop. So I showed you how to download and install the GNS3 GUI on Windows 10. In this video, I'm gonna show you how to download and install the GNS3 VM within VMware Workstation Pro. This is the recommended way to run the GNS3 VM. I've spoken to Jeremy, the creator of GNS3 multiple times and he still recommends that you use VMware Workstation Pro, if possible, when running GNS3 on a Windows 10 computer. There are other options such as VMware Workstation Player, which is free, but it does have some restrictions. In a separate video, I'll show you how to get that working. You could also use VirtualBox, which is free, also there are some issues with regards to using VirtualBox, especially on Intel processors. You could also use Hyper-V. Again, issues using IOU and viral images together on Hyper-V so it's experimental in this version of GNS3. Or you could use GNS3 in the cloud or on an ESXi server. Again, if you want to run GNS3 locally on your computer, the recommended way to do that is to use VMware Workstation Pro. So download the GNS3 VM, run it within VMware Workstation Pro, and integrate that with your GNS3 GUI. Okay, so without further ado, I want to show you how to get that installed and setup. But before I do, let me ask you, please, if you don't mind, subscribe to my YouTube channel. Click on the like button and click on the bell to get notifications when I post a new video. (upbeat techno music) Now in this example, I'm controlling this Windows laptop from my Mac, using VNC. It just makes it easier to do the recordings. Okay, so the first thing you need to do is go to gns3.com, click free download. Either signup for an account or login. GNS3 is free software that you do need to have an account to download the software. Now I've previously shown you how to download the Windows executable, what we're gonna do here however, is click on download the GNS3 VM. And in this example, I'm gonna select VMware Workstation and VMware Fusion, because I want to run the GNS3 VM within VMware Workstation. Now this is really important. The GNS3 GUI and the GNS3 VM have to be running the version of software. So in this example, they are showing that the GNS3 VM is version 2.2.0 and that's the version I'm currently downloading. So I previously downloaded GNS3 version 2.2 executable and now I'm downloading the GNS3 VM version 2.2. They have to be the same version for things to work properly. So in the GNS3 GUI, if you go to file, about, notice the version, 2.2.0, and that has to match up to the GNS3 VM. Okay, so this is a .zip file, what I'll do is right click and click extract all and extract the GNS3 VM. As you can see, it's an .ova file. It's not recognized yet because I still need to download the VMware Workstation. So once again, there's the folder, there's the .ova. So in my web browser, I'm gonna go to VMware.com. Go to downloads, Workstation Pro. At the time of this recording, the latest release is version 15.5.0. There's a version for Windows and there's a version for Linux. I'm gonna go to the Windows version and click, go to downloads, and then I'm gonna click download now. You need an account to download the software. So if don't have an account, click sign up now to sign up for an account. I have an account already, so I'm gonna login with my credentials. I'm gonna agree to the End User License Agreement, click accept and VMware Workstation is now downloaded. It's about 540 Meg in size. Okay, so that's downloaded. So in my downloads directory, I'm gonna double click on the VMware Workstation executable and click install. The VMware Workstation Pro installation wizard is started. Okay, so in my example, it says the installer requires that I restart my system. So I'm gonna click yes to restart for the installation. Okay, so my computer has restarted. I'm gonna go back to the downloads directory and start the VMware Workstation installation again. Click yes to allow this app to make changes to my device. VMware installation runs again. Okay, so the setup wizard is displayed, I'm gonna click next. You need to agree to license agreement, so read through the license agreement, check this checkbox and click next. Now I'm gonna basically leave most settings at the defaults. So default installation directory, click next. I'm not gonna check for updates, I'm not gonna join the customer experience program, click next. I will create shortcuts, click next. Now before I click install, I'll show you something in Control Panel. So in Control Panel, Network and Internet, view network status and tasks, change adapter settings. I currently only have one network adapter. VMware will install additional network adapters, that's normal, so don't be surprised if you see additional network interfaces or adapters displayed here. Okay, so the VMware installation is going ahead. You can see a VMware shortcut has been created. It's now installing virtual network drivers. So there you go, there's Ethernet 3, VMware Virtual Ethernet Adapter, has been created. You can also see additional adapters. The VMware installation is now completed, I'm gonna click finish. I can close this down and what I'll be able to do is now start up VMware Workstation Pro. Now for this installation, I don't have a license key, this is something that you need to be aware of. I can only use the product for 30 days and then I'll have to buy a license. If you want a free version of this, use VMware Workstation Player, not VMware Workstation Pro. But in this example, I'm gonna click continue click yes, click finish. Okay, so VMware Workstation Pro has been successfully installed. What I'm gonna do now is go to file, open, go to my downloads directory, go to my VMware Workstation directory, and select the GNS3 VM and click open. Click import. This now imports the GNS3 VM into VMware Workstation Pro. As you can see here, the virtual machine has been successfully imported with the default settings. I don't change the default settings in VMware Workstation Pro, you change the settings within the GNS3 GUI. So I'm gonna shut VMware Workstation down and startup the GNS3 GUI. Just a warning, make sure that you've got the GNS3 GUI shutdown before you install VMware Workstation Pro and setup the GNS3 VM. Okay, so GNS3 has now successfully started. I'm gonna click cancel. At the moment, I only have a server running on this local laptop. So this is the local servers running on Windows. What you need to do is edit preferences and under server, notice we have local server. That is the server that we're seeing over here. What we need to do is select GNS3 VM and enable the GNS3 VM. So check this checkbox, enable the GNS3 VM. Notice Workstation/Player's recommended, that's what I'm using. The name of the VM is GNS3 VM. It's picked that automatically from the VMware Workstation. If you don't see it, click refresh and you should see that in the dropdown list. This is where you specify the amount of RAM and CPUs the GNS3 VM should use. The GNS3 GUI basically makes an API call to VMware and adjusts the size of the RAM and CPUs based on what you've set here. So make sure that you set it here and not in VMware Workstation. When you close the GNS3 GUI, what's gonna happen to the GNS3 VM, are you're gonna keep it running, suspend it, or stop it? I'll leave it at the default of stop and click okay. What you'll notice here is the GNS3 VM is starting. The GNS3 GUI makes an API call to VMware Workstation and basically starts the GNS3 VM automatically. And there you go, you can see the GNS3 VM is booting up. Version of operating system is Ubuntu 18.0.4 and there you go, GNS3 VM is configured. Version is 2.2.0. This is very important. Notice KVM support available is true. That should be set to true. If it's not, right click on the GNS3 VM and go to settings and under processes, we need to check this checkbox, Virtualized Intel VT-x, EPT or ANDV. Now this requires that VT-x is enabled in the BIOS of your computer. So I'm gonna show you how to do that now. Okay, so I need to enable Nested Virtualization of VT-x on my laptop. So what I'm gonna do is shut it down. I'm gonna power it on and in this example, for this laptop, I'm gonna hold the F2 key down. So you can see here, BIOS Information. What I'm gonna do is go to the next menu and the important piece is Intel Virtualization Technology. That's currently enabled. There are some other options like hyper-threading, Intel AES-NI, VT-d, but the one that I want is Intel Virtualization Technology. You need that to be enabled to do Nested Virtualization in VirtualBox or VMware Workstation. So I'm gonna save those settings and say yes to save. The laptop will reboot. Okay, so now I can login. And I've been able to login successfully. So if you have problems, make sure that Intel Virtualization Technology or VT-x, Intel VT-x is enabled on your laptop. But you also need to enable VT-x on the VM. You can't do that while the VM is running, so you'll have to shut it down. Now that looks good. Notice back in the GNS3 VM, everything is green. So in this case, everything looks good, but what I'm gonna do just to make sure that everything is working properly is shut the GNS3 application down, or GUI down, and notice the VM has also shut down. So if you have issues, again, shut the GUI down, reboot your computer, also make sure that VT-x is enabled in the BIOS of your computer. If everything is working properly, we should be able to start up the GNS3 application and under server summary, we should see two servers now, the Windows server, as well the GNS3 VM. So we can see Windows over there and that's actually just kicked the GNS3 VM into starting. So there's my Windows server, here's my VM, which is starting up. Back in VMware, we can see it busy booting up. It's a bit slow on this computer because I haven't allocated a lot of RAM and CPU to the VM. Once again, very important, you need to make sure that KVM support is available. So that all looks good. If KVM is not available, again, make sure that you enable it in the BIOS of your computer and also shutdown GNS3, go into VMware Workstation, right click on the VM, go to settings, make sure that this is enabled, so Intel VT-x. Now the amount of RAM and CPU available for your VM depends on your computer. The more you can allocate, the better, basically. But again, this depends on your computer. So in this example, I've got a Windows 10 computer, it's got eight gig of ram, 64 bit operating system, it's an i7 processor. So I could allocate more to my GNS3 VM. Again, you don't it through VMware Workstation, so I'm gonna close that down. You do that through the GNS3 GUI. So start up your GNS3 GUI, make sure that everything boots up properly and starts up properly. So again, my Windows server has started, GNS3 VM is booting. While I'm waiting for that, I'm gonna click cancel here, go to edit, preferences, GNS3 VM, and what you could do here is, for instance, allocate more RAM and more CPUs to the GNS3 VM. As soon as I do that, the GNS3 VM will reboot. So just to show you the settings at the moment, it's got two gig of RAM, it's got one CPU, but when I click apply here, those changes will be made, the GNS3 VM is shutdown and it's restarted with the new settings. So now it's rebooting. That was a bit quick. So back in settings, notice the RAM and processors have been adjusted. That, once again, depends on the processing power and memory in your laptop or in your computer. If you're using viral images, as an example, you need to allocate enough memory and enough RAM to run a large typology if you want to do that. I'll put a link below this video with a calculator that helps you determine how much RAM and CPU you need, depending on the appliances you want to run. Okay, but back in GNS3, I'm gonna create a new blank project. Let's say myfirstvmproject, click okay. Now, I don't have any Cisco writers at the moment, I don't have any Cisco switches at the moment. What I can do as an example is drag my VPCS device and tell GNS3 to run it on the GNS3 VM. So this is a good test to make sure that things are working properly between GNS3 and the GNS3 VM. I'll also drag the built in switch and run that on the GNS3 VM. It's recommended that you run typologies on the GNS3 VM. Now in the previous video, I showed you how to change symbols, I'll just do that quickly here. So I'll change these to clients. I'll change this to a switch. I won't worry too much about making this look pretty. I just want to show you that I can get a typology running on the GNS3 VM. So, add interface labels. I'll start that up and I'll open up a console to those devices. So these devices are running on the GNS3 VM, they're not running on Windows. Look, I'm having an issue with Solar PuTTY, it's only showing one computer, so I'll shut Solar PuTTY down and open up console connections again. Okay, so I've got PC1, PC2's not showing. I'll open up a console manually. And there it is. So on PC1, I'll give it an IP address of 10.1.1.1 slash 24 mask. PC2, give it an IP address of 10.1.1.2 slash 24 mask. Hopefully PC1 will be able to ping PC2, which it can, and PC2 will hopefully be able to ping PC1, which it can, and that actually should be PC1, which it can. So network is working, I'll save my device configurations. Close Solar PuTTY down, stop the GNS3 typology, and shut GNS3 down. Now as a last test, I'll start GNS3 back up again and make sure that I can restore the typology. It's a good idea to wait for the GNS3 VM to start before you try and open up your projects. So before I try to open this project, I'm gonna wait for the GNS3 VM to boot up properly. So wait until you see something like this and then select myfirstproject. Okay, so project is back. Start it up. Open up console connections. And PC1 should hopefully be able to ping PC2, which it can. In this example, Solar PuTTY's having an issue opening this device. So I'm gonna manually open up a console to that device. So there you go. I'll ping PC1 from PC2. Okay, so there you go. I've successfully downloaded the GNS3 VM. I've successfully integrated the GNS3 GUI with the GNS3 VM. I've created a basic typology that's running on the GNS3 VM. I've tested that it all works. I can save the typology, I can restore it. Okay, so if you don't mind, if you enjoyed this video, please would you like it. Please would you subscribe to my YouTube channel, and please would you click on the bell to get notifications when I post a new video. I'm David Bombal, I want to wish you all the very best. (upbeat techno music)",
    "transcript_keywords": [
        "VMware Workstation Pro",
        "VMware Workstation",
        "Workstation Pro",
        "Workstation",
        "VMware Workstation Player",
        "VMware",
        "Click",
        "GUI",
        "Windows",
        "Pro",
        "Workstation Player",
        "Workstation Pro installation",
        "RAM",
        "Intel Virtualization Technology",
        "version",
        "computer",
        "Intel",
        "install VMware Workstation",
        "make",
        "VMware Workstation installation"
    ],
    "transcript_entity_values": [
        "first",
        "about 540",
        "VNC",
        "the VMware Workstation",
        "PC1",
        "Mac",
        "VirtualBox",
        "ANDV",
        "VMware Workstation Pro",
        "BIOS Information",
        "F2",
        "Intel VT-x.",
        "Solar PuTTY",
        "Cisco",
        "Workstation Pro",
        "Nested Virtualization",
        "API",
        "GNS3",
        "Virtualized Intel",
        "EPT",
        "two",
        "64",
        "VPCS",
        "15.5.0",
        "2.2",
        "GNS3 VM",
        "the End User License Agreement",
        "Control Panel",
        "VT",
        "CPU",
        "KVM",
        "eight",
        "YouTube",
        "GNS3 GUI",
        "Notice Workstation/Player's",
        "IOU",
        "Solar PuTTY's",
        "PC2",
        "IP",
        "Windows",
        "Linux",
        "VMware Workstation Player",
        "2.2.0",
        "one",
        "30 days",
        "ping PC1",
        "VMware Fusion",
        "VMware",
        "GNS3",
        "RAM",
        "Intel Virtualization Technology",
        "GUI",
        "Intel",
        "Windows 10",
        "24",
        "Windows",
        "GNS3 VM",
        "Jeremy",
        "VM",
        "the VMware Workstation",
        "David Bombal",
        "Intel AES-NI",
        "VMware Workstation"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG"
    ]
}