{
    "id": "A18BST27Wpw",
    "title": "Desk Tour & Daily Tech Update 2023!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-03-16T19:45:29Z",
    "video_url": "https://www.youtube.com/watch?v=A18BST27Wpw",
    "category": "Science & Technology",
    "tags": [],
    "views": 2725549,
    "likes": 85390,
    "comments_count": 2112,
    "description": "My setup tour and everyday carry for 2023.  Thanks Verizon for sponsoring todays video! Check out the Razer Edge 5G on Verizon at  or the WiFi version on Razer at   On my desk: Xdesk Air Pro -  Yamaha HS8 Speakers -  Auralex Monitor Pads -  Promise Pegasus R8 (80TB) -  Herman Miller Embody -  Grovemade Desk Monitor Stand -  Grovemade Desk Tray -  Apple Pro Display XDR (Nano Texture) -  Apple Mac Studio (M1 Ultra) -  Opal C1 Webcam -  Belkin MagSafe 3-in-1 Wireless Charging Pad -  Keychron Q1 Mechanical Keyboard -  Apple Magic Trackpad -  Logitech MX Master 3S Mouse -  Apollo Twin MKII DAC -  Sennheiser HD650 Headphones -   Whats in my bag: PeakDesign Everyday Carry Zip (20L) -  MKBHD Alpine Water Bottle -  Apple AirPods Max -  Anker 747 GaNPrime 150W Charger -  Apple Magsafe Charging Cable -  USB-C PD Display Cable -  Apple MagSafe Duo -  Apple MacBook Pro 16 (M1 Max) -  dbrand Icon Skin -  Canon EOS R5 Camera (body only) -  Canon RF 15-35mm Lens -   MKBHD Merch:  Tech I'm using right now:  Playlist of MKBHD Intro music:",
    "description_links": [
        "https://geni.us/7Obl0J3",
        "https://geni.us/jiBS",
        "https://geni.us/2Bklc",
        "https://geni.us/c6vvq0K",
        "https://geni.us/4AxMBmG",
        "https://geni.us/gjrJXk4",
        "https://geni.us/nrAPp",
        "https://geni.us/4sFVKR",
        "https://geni.us/rPI4",
        "https://geni.us/pBUF",
        "https://geni.us/DoxH",
        "https://geni.us/TlVA",
        "https://geni.us/m5aDp",
        "https://geni.us/GWkJMi",
        "https://geni.us/xtrM3zC",
        "https://geni.us/qm6snmu",
        "https://geni.us/X1uL",
        "https://geni.us/eIiJ",
        "https://geni.us/N0GDBrU",
        "https://geni.us/e2eSByv",
        "https://geni.us/RL5yxXq",
        "https://geni.us/65hY",
        "https://geni.us/1kVbdBU",
        "https://geni.us/bjttAf",
        "https://geni.us/J0Sd",
        "https://geni.us/ZeZWP9",
        "https://geni.us/dbrandicons",
        "https://geni.us/7XB5jjb",
        "https://geni.us/1dSYEw9",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(bright music) - Hi, what's up guys, MKBHD here. I decide to do another desk tour. A lot of people kept asking about the new setup, \"It's 2023, you haven't done an update yet.\" And the more I thought about it, I kept thinking, okay, well I've used this setup for a long time, so it feels the same to me and most of the things have stayed the same. But then I realized some things are different, and I can walk you guys through that stuff. But then it says a lot about the things that have stayed, especially the stuff that's been here the longest. So I'm gonna walk through all of it, what's new and what's not. Let's do it, okay. I guess we'll do left to right, 'cause that's kind of how most things go. I have a pretty big sit/stand desk here, which means I have a lot of space for activities and storage, but I have this mouse pad over here as like a parking garage for things that I take outta my pocket, so wallet, keys. This is Adam Barbaro's ping pong paddle that he gave me. If you know, you know, you saw the studio video, but there is a bit of a system with smartphones here. The phones I'm using right now are face up and on, and the phones that I'm also signed into but not actively using are face down. But then, you get to the stuff that you've seen before. Yamaha's HS8s, old faithful. There's a thousand different studio monitors I coulda switched to, but these have been amazing, and I also still have the same 96 terabyte or something Promised Pegasus storage block. It's just a bunch of hard drives, it's great. The computer, the editing machine, this is something that was different from the last tour. Before, it was a Mac Pro that was under the desk, and this is a sit/stand desk, so because the computer was on the ground all the cables had to make their way up to the audio interface and the displays and everything here. And now the computer, the editing machine is a Mac Studio on the desk, which means, look at the cable management, look how nice that is, you guys can all comment. Nobody's gonna roast my cable management anymore, because it's so beautiful this time. Also, this is the chair of choice. It's still the Herman Miller Embody we've had for a long time. I also really like these. They're the most expensive chair I've ever seen, but they're also the best chair I've ever seen, so I just keep using them. This is a a Grovemade stand, and it's kind of cool for a couple reasons, one, it's double wide. You can put the monitors on top, but I've put them under, and it lets me just take some stuff off of the desk, so more surface area, and it happens to just perfectly, perfectly frame the Mac Studio. That was a total coincidence, but it's pretty much the exact height of the computer. That's how it worked out. The Opal C1 is still here. Pro Display XDRs, they have been awesome as well. Belkin wireless charger, this is one MagSafe, one regular cheat charger, Apple Watch charger. I'm still a three input kind of guy with the keyboard, which is a Keychron Q1, which is customized a little bit, shout out to Keychron, and it's wired and that's fine, but there's a track pad over here and a mouse. Now, come over here, look at this. This frame right here, I've been asked a lot about, you guys know the the HISTOGRAM T-shirt, right? It's got a several different waveforms on it. That is from an actual photo of this red mouse pad with a black mouse on it. Apollo Twin, all the way to the side, and this is probably the last cool thing, my headphones stand. It's just a clamp on the side of your desk. Anyone can do this. These are my HD650s, they're open back. I use 'em for editing and then just pop that over there. (bright music) So that's the desk set up, some new, some old, but I also do wanna talk about the bag, so let's go do that. All right, so this is the bag. Same theme, this is my everyday carry. Literally, I bring this with me every single day to the studio and around, but it's kind of the same idea. It's most of the same stuff, just one year more worn in. And then you can see the stuff that I've had for multiple years versus the new stuff. The bag is the same thing. I'll talk through it if you haven't seen the previous video. This is the Peak Design Everyday carry, 20 liter version. There's a bigger one. I swear by this bag. It's the best backpack I've ever used. We did manage to get a bit of a custom version of it, which has red stitching on the outside and on the inside. Water bottle on the outside pocket. Now, look at this. This is what I would call a patina. Well, I might not call it a patina. Basically, I've put this water bottle in this backpack, in and out of it so many times, that I have, I mean this is the most worn version of the water bottle, 'cause I've had it longer than anyone else, and it slowly develops this pattern, and I actually kind of think it looks sick. This is one of those backpacks that has three different sections inside and can open from any one of those sections. So if I open it from the side, kinda like a photographer's bag, you can get into each section. I don't necessarily use it like that when I'm not using a camera. So I'll go from the top, because that's where you'll find the same headphones I had last year, which are AirPods Max. My one year later review of AirPods Max, are they worth the $550 that they cost? I would still say they're overpriced, but they're really great. They're comfortable, and I use them a lot when traveling. So you've seen the little AirPod headphones. You can wear earbuds anywhere, but when I'm flying, I would hate to forget these. They charge by Lightning, which is a huge bummer, so I do have to carry a Lightning Cable everywhere, all the time, and that's it for the top section. This has a little latching system, so then you get into the bottom two sections. So, in the middle, this is the section where I had the Cannon R5 before. I'll get into that, but I actually ditched that. What I instead have is my charging cable mess, and there should be an easier way to carry these things, but what this is is an Anker 747, which is just a wall charger that does like 150 watts out of any of the USB-C ports, super useful to fast charge literally anything. And then I have two cables. I have the MagSafe charger for the MacBook Pro and that USB-C cable with the little display on the end that shows how many watts you're getting. That's my USB-C charger. And then in the bottom, because I use it less often is my Lightning to USB-C cable to charge basically just the headphones. If they could have made a USB-C version, that would've been nice, but that's that. On the outsides, I still have some other charging accessories. This is a MagSafe Duo, which charges my Apple Watch and iPhone via Lightning if I'm charging both of those I have some other random adapters and cables that I rarely need slash use, but it's a backpack, so I feel like this is embracing a little bit of my in-case-of-emergency mentality. And then in the back, 'cause this has a laptop slot, it is the same M1 Max 16 inch MacBook Pro. It's got the dbrand icon skin on it as well as you can see, nice and worn in. And that is genuinely what I carry with me every single day, everywhere I go. I use this laptop a ton. I didn't upgrade it to the M2, because I didn't really feel like I needed it, which says a lot about how good the M1 Max is. But that's basically what I carry. I would say there's also two little things that I'll add that I have in my sometimes-carry category, and so that is these two things. This is the R5, this is the Razor Edge. The R5 and the 15-35 are still my go-to at home and quick-capture camera. I capture so much stuff on smartphones nowadays that I don't need to carry this with me all the time. It's just extra weight, especially these RF lenses, they're huge, so this is sometimes-carry. But this is also something new, and it's actually the sponsor of this video, this is the Razor Edge. So this is kind of the perfect on-the-go, enhanced gaming experience for me. It puts together like a giant phone, but it is much better at gaming than a phone. This thing has a Snapdragon G3x Gen 1, which is optimized for sustained performance, and a 6.8 inch 144HZ amela display, which is, I mean I'd rather play AAA games on something like this than a phone. And then there's the Verizon 5G Ultra Wideband for the best possible high-speed, low-latency connection. So y'all already know me. I don't play games all the time, every day, but when I know I'm gonna be traveling, this is still the bag that I pack and take places, and this middle compartment is where I'm slotting the temporary-use stuff. So it's great to be able to pop this out in a hotel room or in an airport or on a plane or something like that. There is also a WiFi only version too, but you can play on any service you subscribe to including native Android games but also cloud gaming services, like Xbox Cloud Gaming, Nvidia GeForce NOW, so that's why having a 5G version of this is obviously so sick, because you might not always have the WiFi connection, so you can just game anywhere. It also breaks down into just the display and computer and the controller. You can just take it anywhere, like I do. So that's available now at Verizon. I'll link in the description down below along with everything else that I've talked about in this video. Like I said, the stuff that sticks around longest, because you don't always get to spend a lot of time with things, it's good to know that it's actually held up and lasted the test of time. So I can personally vouch for all the things that I'm linking and talking about. There's still also gonna be lots of alternatives. I am not, by any means, saying that these are the best items. I do have a lot of selection. There are lots of other headphones I'd be perfectly happy using, lots of other computers that I'd be perfectly happy using, but this is what I'm carrying with me pretty much every day, everywhere I go, and the tech that I use on the daily. (bright music) So for those who were asking, you're welcome. That's been my daily tech update, 2023. Thanks for watching, catch you guys in the next one, peace. (bright music continues)",
    "transcript_keywords": [
        "things",
        "stuff",
        "lot",
        "desk",
        "time",
        "kind",
        "cable",
        "carry",
        "USBC",
        "MKBHD",
        "Mac Studio",
        "USBC cable",
        "studio",
        "bag",
        "version",
        "charger",
        "computer",
        "guys",
        "Max",
        "Lightning"
    ],
    "transcript_entity_values": [
        "every single day",
        "M1 Max",
        "5",
        "three",
        "the MacBook Pro",
        "Anker",
        "M2",
        "The Opal C1",
        "one",
        "550",
        "one year later",
        "G Ultra Wideband",
        "20 liter",
        "96 terabyte",
        "MacBook Pro",
        "150 watts",
        "Keychron",
        "the Mac Studio",
        "a thousand",
        "747",
        "Android",
        "Belkin",
        "2023",
        "Apollo Twin",
        "AirPod",
        "AirPods Max",
        "Nvidia GeForce",
        "Apple Watch",
        "daily",
        "USB-C",
        "the Peak Design Everyday",
        "Yamaha",
        "Verizon",
        "Xbox Cloud Gaming",
        "iPhone",
        "Grovemade",
        "Adam Barbaro's",
        "MagSafe",
        "Keychron Q1",
        "Verizon 5",
        "the Razor Edge",
        "the Herman Miller",
        "6.8 inch",
        "watts",
        "144HZ",
        "16",
        "two",
        "a ton",
        "R5",
        "last year",
        "15-35"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "LAW",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL"
    ]
}