{
    "id": "a1rV2SXW1u0",
    "title": "AMD Potato PC (Jokes Aside)",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2016-06-18T03:37:37Z",
    "video_url": "https://www.youtube.com/watch?v=a1rV2SXW1u0",
    "category": "Education",
    "tags": [
        "AMD",
        "K7",
        "Slot",
        "CPU",
        "Athlon",
        "Processor",
        "Budget",
        "Potato",
        "PC",
        "Jokes",
        "Aside",
        "Science",
        "Studio",
        "K7600",
        "600",
        "L2",
        "Cache",
        "DDR",
        "SDRAM",
        "SDR",
        "RAM",
        "Voodoo",
        "Voodoo3",
        "3DFX",
        "1000",
        "Graphics",
        "Card",
        "Nvidia",
        "GeForce",
        "256",
        "Computer",
        "Process",
        "Architecture",
        "250nm",
        "14nm",
        "Skylake",
        "Intel",
        "Pentium",
        "II",
        "III",
        "2 3",
        "GPU",
        "Heat",
        "Fanboy",
        "Fan",
        "Build",
        "How",
        "To",
        "Games",
        "Gaming",
        "Game",
        "AVP",
        "Sims",
        "RCT2",
        "Roller",
        "Coaster",
        "Tycoon",
        "Sim",
        "SimGolf",
        "Golf",
        "Windows",
        "XP",
        "Operating",
        "System",
        "OS",
        "Power",
        "Supply",
        "Cheap",
        "eBay",
        "Parts",
        "Affordable",
        "Gamer",
        "ThermalTake",
        "V3",
        "Black",
        "Edition",
        "Slot A",
        "Slot 1",
        "MPU",
        "Compaq",
        "HP",
        "X4"
    ],
    "views": 90790,
    "likes": 4652,
    "comments_count": 475,
    "description": "- Here it is, folks: A computer I do NOT recommend building! However, there is rich history here. I hope this one's satisfied your curiosity just a tad. And if that didn't happen, maybe you learned a thing or two. I sure did.  FACEBOOK:  TWITTER:  INSTAGRAM:   Subscribe to our channel!  Thanks for learning with us!  DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our CJ account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://www.facebook.com/sciencestudioyt",
        "https://www.twitter.com/gregsalazaryt",
        "https://www.instagram.com/gregsalazaryt"
    ],
    "transcript": "250 nanometer transistor design. Yeah. I'm not joking. That's more than 15 times larger than the 14 nanometer process current Intel CPU's and AMD GPU's utilized today. By 12 kilobytes of L2 cache that was not integrated into the CPU dye itself. A motherboard fitted with a CPU slot, not a CPU socket. So what processor am I talking about? Check this thing out. The AMD K7. One of only 4 generations of CPU's to ever take advantage of a CPU slot. In this case you're looking at a slot A, AMD's first attempt at a slot 1 mimic created by Intel two years earlier. This was a great mimic actually, both the AMD and Intel slots were identical. You could place a compatible Pentium II in an AMD slot A and vice versa. Although nothing would happen, the wiring of the circuits beneath the sockets on the respective boards made cross compatibility an impossible task, but I mean that makes sense. If you're wondering this K7 wasn't free but it might as well have been. I actually received this processor from a family member who was scavenging old computer parts. I guess that does make it free. The K7 motherboard was a bit difficult to find but it wasn't expensive by any means. The only compatible ram was \"SDram\" Which had a unique 2 notch design and a theoratical operating frequency of 200 MHz, thanks to double data rate technology hence \"DDR SDRAM\". For graphics I found a 3DFX Voodoo3 1000 graphics card, a card you would've found in a computer of this caliber during it's day. It's nothing fancy, it features a single VGA port, no cooler, -- that tells you anything right there -- 16 bit color support, limited textures, and a great deal of competition. Nvidia's GeForce 256 soon stole the show. I discussed the 256 in greater detail in a video you can check out in the card above me. Now as for power, pretty much anything with Molex connectivity would've worked. I actually pulled one out of another computer, 320 watts solid with plenty of peripheral support. Since the motherboard only supported IDE, also known as parallel ATA unlike serial ATA or SATA that we use today, I was forced to use a hard drive with an IDE interface. Someone actually gave one to me for free, I doubt he could find a compatible computer. You'll also wanna sound card if you are interested in actually hearing anything. Sound blasters are always a nice touch. A CD drive was also a staple in the late 90's. So it's going in here as well. For the case I wanted it fancy and fanboyish but just for fun. Here's a Thermaltake V3 AMD Black Edition gaming case. Wouldn't be my first choice but it fits the AMD old school theme and the scorpion on the side looks frickin' awesome. So did it turn on? Yes, about after 5 or 6 attempts. The IDE cables were finicky. I couldn't connect my CD drive to the motherboard at all. And yes I know the difference between slave and master. It just wouldn't post. I was hoping to showcase some old CD-ROM games but that wasn't going to be possible with this configuration because I couldn't connect the CD-ROM drive to the computer at all. Alien vs Predator loaded up though without the CD. But it froze just as I was entering the campaign. This happened again and again and again. I had games like SimGolf, RollerCoaster Tycoon 2 and the Sims all lined up to show you but but given the circumstances I'm surpried it even booted up at all. It actually took 12 minutes to do even that. Nonetheless here's my point. The kinds of games you could play on this PC -- similar to the games that I just mentioned-- were not the kinds of games you wanted to just boost the framerates of. In fact most of these were locked relatively low framerates anyway and the VGA interface isn't capable of extreme rates on it's own right. I did however enjoy building this PC and I hope that you at least were able to take a bit of history home with you from this video. It's not everyday you get to tinker with a slot CPU let alone one that actually works. If you like this old school retro just for kicks AMD PC build give the video a thumbs up, give it a thumbs down if you feel the complete opposite or hate everything about life. Click the subscribe button if you haven't already. Stay tuned for R9 390 benchmarks. This is not an R9 390 here, this is a GTX 980 Ti If you followed me on Twitter , you would've already known that. Be sure to do at @ScStSalazar This is Science Studio, thanks for learning with us.",
    "transcript_keywords": [
        "CPU",
        "AMD",
        "CPU slot",
        "current Intel CPU",
        "Intel CPU",
        "AMD GPU utilized",
        "nanometer transistor design",
        "slot",
        "slot CPU",
        "AMD GPU",
        "nanometer transistor",
        "AMD Black Edition",
        "AMD slot",
        "computer",
        "games",
        "Intel",
        "CPU socket",
        "Intel slots",
        "AMD Black",
        "transistor design"
    ],
    "transcript_entity_values": [
        "first",
        "12 minutes",
        "250 nanometer",
        "L2",
        "6",
        "Nvidia",
        "mentioned--",
        "Sims",
        "200",
        "@ScStSalazar This",
        "GTX",
        "SDram\" Which",
        "Science Studio",
        "SATA",
        "One",
        "256",
        "Molex",
        "two years earlier",
        "AMD",
        "Twitter",
        "320",
        "CPU",
        "2",
        "GeForce",
        "390",
        "today",
        "VGA",
        "the late 90's",
        "SimGolf, RollerCoaster Tycoon 2",
        "IDE",
        "one",
        "1000",
        "more than 15",
        "Intel",
        "AMD GPU's",
        "K7",
        "12 kilobytes",
        "AMD",
        "1",
        "5",
        "16",
        "only 4",
        "14 nanometer"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ]
}