{
    "id": "A1uYhkMRLWg",
    "title": "The Rivian R1T is an Incredibly Fun Electric Pickup!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-10-22T15:41:48Z",
    "video_url": "https://www.youtube.com/watch?v=A1uYhkMRLWg",
    "category": "Science & Technology",
    "tags": [
        "Rivian",
        "Rivian truck",
        "Rivian R1T",
        "MKBHD",
        "Rivian pickup truck",
        "electric pickup truck",
        "electric truck",
        "Electric truck review",
        "Rivian R1T review",
        "Rivian R1T vs",
        "R1S",
        "vs Cybertruck",
        "Cybertruck vs"
    ],
    "views": 5850823,
    "likes": 132578,
    "comments_count": 9240,
    "description": "Rivian R1T is a quad motor adventurous electric compact pickup truck. I've run out of adjectives. But this truck is incredibly fun.  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - Hey, what's up, MKBHD here. This is a key fob, and the key fob unlocks this, which is the most impressive electric truck I have ever seen, this is the Rivian R1T. So it's literally brand new, it's just hitting the streets and for the next 24 hours, I'm going to drive it. I'm going to daily it, I'm going to live with it, spend some time with it, and then I'm going to try to answer all of the questions people have had about it that I possibly can. And there are a lot of questions, because this is a very hyped up vehicle, this is maybe the most promising of any of the EVs coming out of the start-ups. You know, we have all the old manufacturers, of course, making lots of promises to electrify their lineups, but there's also a lot of really interesting stuff from the Teslas and Lucids and Remax of the world. This I think is the most interesting of all of them right now, thanks in part by their background with Amazon and Ford. So this is Rivian's first consumer vehicle. It's a pickup truck, it's called the R1T. So I've got it here in this sort of Pacific blue color, and the basic specs are this: it's quad motors, one on each 21 inch all-terrain wheel, 314 miles of range, 0 to 60 in three seconds flat, which is hilariously quick for pickup truck. And then this is the launch edition with the adventure package, which includes a lot of the most premium interior finishes. It has the off-road upgrade and pretty much all the options. So it starts at just over $70,000 and it can quickly jump up into mid eighties or 90 plus from there. So definitely premium, but it's packing a lot of stuff that makes it feel worth the price. So, number one, what's good with this design, right? So Rivian is a new company, they don't really have a heritage or a design DNA where they have to keep certain shapes in mind when designing their vehicle. So really they could have made whatever they wanted. And at the end of the day, they chose this shape for a short bed electric pickup truck. Personally, I do actually like a lot of the design here. It's not completely crazy out of this world, like a Cyber Truck, but it's also not flying way under the radar like the F150 Lightning, it's kind of somewhere in between. It has a lot of modern shapes and modern touches. And really the biggest feature that of course stands out looking at it is the bar taillight across the back, which I love, and the face, the bar plus headlights across the front, which definitely takes some getting used to, but again, I think it's pretty nice. The headlights on each side are the most powerful and that's where the high beams are and everything, but the entire bar light is functional. And you definitely find that out pretty quick driving it at night like I did, so that's cool. And I also do like this blue color, which is one of a bunch of colors that they have that I think are really adventury. And I got to say, this truck turns more heads than anything else I've ever driven. I think a lot of it is the face, but like more than any other electric car, more than any McLaren, more than any Tesla, all day, people were coming up to it, asking it, pointing at it. It definitely makes a statement right now. And someone on Twitter told me it looks kind of like this truck is 50 years old and from the future at the same time. I feel like that actually hits the nail on the head. Okay, number two, how has the interior? So it's really good, and also doesn't really look like anything else, but if I had to describe it, it's kind of like if someone combined the layout from a Tesla with the wood and leather and metal type finishes from a Volvo or something, and then stuffed a bunch of extra features in it. So this is the black mountain interior color. So pretty much everything inside is matte black. And it just gives me the impression that there's a lot of thought that went into a lot of the little things. So like the back of the seats, each one of them has a coat hook and a USB type C port. There's a wireless charger between the front seats. There's also a bunch of hidden features in this interior too, which I'll get to in a second, don't worry. Space-wise though, it is still, it's a compact pickup truck for sure. Much smaller than say a full-size F-150. The panoramic glass roof definitely helps it feel more spacious when you're sitting inside, and there's plenty of leg room in the second row, which is awesome, but from left to right, I probably wouldn't put three people in this middle seat. I think there's a video somewhere with three people in the back of the Rivian, and you know, it's fine, they all fit, but probably wouldn't want to do that for a multi hour road trip. All right, so number three, if it's a small truck, how's the storage? So here's the thing, it's small for a truck, but since it's an electric truck, there's no engine under the hood, no transmission running through the middle and it absolutely maximizes the space inside in every way. So it's a small bed, four and a half feet with the tailgate up, plenty for me personally, but smaller than some other trucks out there. There's also supposed to be a bed cover, that wasn't working on this early model I'm driving, but that will give you about 29 cubic feet, which can be extended a bit to a seven foot length. When you open the tailgate, since it sort of slides this extra piece down between the bed and the gate for larger items. Then there's also storage underneath the bed for an optional full-sized spare, but that space also has a drain plug in case you wanted to use it as a cooler or something. Then in the front, there is a fully powered lift gate revealing a massive front trunk. And again, this is so nice for a pickup truck. There's more than enough room to fit several bags, you can go grocery shopping with just the front trunk, and the fact that it powers up and down like a regular trunk and even has this little button underneath the front headlights to open and close it to me, it's so convenient that I kind of feel like I would use this more than the back, like for covered locked storage, this is great, this is great for a pickup truck. Then inside the truck, there is a lot of storage too. There's actually no normal spot for a glove box, which is funny, it's just leather paneling here, but there's a huge amount of storage in this super deep center console where you can clip papers and stuff that would normally go in a glove box. There's storage in the doors. There's storage inside a little pocket in the front of the front seats, which is kind of random, but cool. And then there are in fact pop out cup holders in the middle between the front seats. There's even the back seat, of course, for casual storage, but also even more hidden storage underneath the back seats. And then maybe the most iconic extra space on this entire truck, the gear tunnel. So that is this column space with a cover on both sides that's right between the rear wheel and the back seats. It's actually super cool. I'm not sure what you'd specifically use this space for when it's empty, and it could fit technically a whole set of golf clubs in here, or a couple backpacks or something, you know, it can definitely fit some larger duffle bags. It can fit a human body. You know we have to try, a lot of you guys were asking on Twitter. But it's not just the space here that's useful. There are power outlets inside of this tunnel on either side. And the doors that open on either side are actually strong enough that they can support up to 300 pounds. So you can sit on it, you can even use it as a step to climb over and into the bed of the truck, and there's storage inside those doors for even more stuff. And in case whatever you're hauling here is precious, you can actually access the gear tunnel from inside the truck. From between the backseats, you pull that arm rest down and you can reach inside behind this cover into the middle of the gear tunnel to grab whatever stuff you have in here. I've never seen anything like this in any other truck. And yeah, I love it. So your grand total, just for the spec sheet, 68 cubic feet of storage in this compact pickup truck, that's massive. Okay, number four, how does it drive? Well, I know most people aren't buying pickup trucks just for the way they drive, but if you do care about that, this is an incredibly impressive truck to drive. Now, like you saw, this one's running on 21 inch all-terrain wheels, so it's not even set up to drive like a sports car clearly, but anytime you combine quad motors, totaling 800 plus horsepower, with a world-class air suspension, it kind of doesn't matter how much the thing weighs, this truck absolutely hauls. Zero to 60 in three seconds flat, which is amazing. It does taper off after that, but that is a crazy fast time for a truck and it feels fast. And there's a couple of different driving modes to talk about. Most of the time you can just leave it in all purpose mode and it can handle pretty much any daily driving. The air suspension has a massive range of adjustment for how much clearance, how much ride height you need. And there's a couple options, you can have a stiff or soft ride, and you can turn brake region to low or high, which I've kept it on high as much as possible while driving, cause it is actually calibrated for one pedal driving, which is awesome, and stability on or off. So yeah, on the road, it's crazy. I know I said the number, but just to say it again, 0 to 60 in three seconds flat, that'll be in sport mode where you can also have the firm ride. And the suspension really does turn extra firm and minimize roll. Obviously only having it for a day, I couldn't take it to a track or anything, but it's a pickup truck, I've just have never had more fun driving a truck, ever. So great for highway driving, has a pretty tight turning radius too, for a truck, which is partially due to the torque vector you get from having one motor at each wheel. Now there's also a conserve mode, which is good for saving battery and maximizing your range if you're doing some sort of road trip stuff. And it really does hunker down the suspension in the sport and conserve modes for the best aerodynamic efficiency and the firm ride. But I'm sure that most people are most interested in the off-road stuff, which actually has several versions, has automatic, rock crawl, rally, and drift mode, casual. Now I didn't really get to really off-road in the couple of hours that I'm out here near the studio in New Jersey, but I did take it off on a dirt path that I would never take my car, and it's a truck, it handled it with ease with these tires as you'd expect. And it was a pretty great demo actually of how the suspension can really go from very firm to very soft and adaptive and just absorb all of the rocks and the terrain. So this truck is capable of way more off-roading than I was able to throw at it. The bottom is plated in metal and there are even more aggressive off-roading tire packages. There's a great video from Zach on the JerryRigEverything channel where he gets to put it through some rock crawling and the thing absolutely eats whatever you throw at it. And it does it in silence too, that's the thing. I mean we all already knew EVs are quiet, but there's something about driving around through crazy mud or rocks in nature and not drowning out everything with the sound of the engine, but just hearing the tires basically. So off-roading was eerily quiet in a good way. All right, so number five, what makes the Rivian different from other EVs or other trucks? Well, the form factor is already pretty unique as a small pickup truck, but they're also really leaning into this like adventure thing. You're supposed to think of this more as an adventure vehicle than a normal truck. And that kind of sounds cheesy at first, but hey, they're throwing everything but the kitchen sink at it to live up to that, actually they're literally even throwing a kitchen sink at this thing. So look, all right, in the driver's side door, there's a flashlight that clicks away here, hidden away, and it's powered by one of the cars batteries. Matter of fact, it actually has one of those exact cells inside and it just sits here, wireless charging in case you ever need it, and it's a legit, super bright flashlight. Apparently the reason they did this is because there are 7,776 of these batteries in the bottom of the truck, and RJ, the founder just really wanted a nice number, so the flashlight had to happen, so the story goes. Either way, that's a nice little addition. Then not only are there full outlets in the trunk, but there's also an air compressor that can go up to 150 PSI and it comes with a 20 foot hose that can reach all four tires so you can literally inflate your tires with a built-in compressor on the truck or do whatever else you want with the air compressor. It's just there anytime you need it. And if you check underneath the center armrest, there's a whole Bluetooth speaker separate from the car sound system that just lives under there and wireless charges all the time too. It's got a huge battery, it's got lights, it's got a USB-C port to charge your phone. It can easily be the centerpiece of a camping trip or whatever sort of adventure is happening around this car. That's pretty sick, I love that. And then the gear tunnel of course is ripe for possibilities. So it already has a full-size outlet inside and tons of space, but then there's a $5,000 option on their site for a camp kitchen that expands to reveal a 1400 Watts stove top, a four gallon water tank, a countertop, and a 30 piece cutlery set, just sitting in the back of your truck. It's just, it's very impressive that the whole thing just slots back into the tunnel when you're done using it. And there's more that can fit back here, and I'm sure there will be more third-party stuff to slot into the gear tunnel in the future. It's super dope. The cherry on top, instead of a horn, this adventure vehicle makes a locking sound inspired by nature. (bird chirping noise) All right, so number six, what's the charging situation, right? It's electric, like I said, 314 miles of range, which is pretty decent. So it's public chargers and home chargers only for now, which it will happily route you to on the map, which is good. The spec sheet says it supports 200 kilowatts fast charging speeds. I stopped at an Electrify America station near the studio with around 35% battery left. And while the station says it supported 150 kilowatts, the car itself never got over a hundred and was quoting me about an hour to charge the remaining two thirds of the battery. So this is part of the big early question with a lot of these EVs. As of right now, they can't use the Tesla supercharging network. And this is supposed to be a vehicle you really want to adventure with. So you really don't want to be thinking about how much range you have left, you kind of just want to go drive off into the woods and not think about it. So ideally this Rivian adventure network that they're promising will start to get built up soon. Now, if you're a day one customer getting a truck today, that doesn't exist yet, but they're planning on building a bunch of fast chargers at the most convenient locations for adventures, and that'll kind of act like the Tesla supercharger network for Rivian. Charges fast, you can monitor it through the app, et cetera. We'll see though, it's getting built, I'll believe it when I see it. The best part though about charging the Rivian is when you plug it in and it starts charging, the led bar light at the front lights up green and starts pulsing. It kind of looks a little weird on camera, but it's great. I thought I saw somewhere that it was actually going to act like a progress bar and sort of light up from left to right as the charge is completed, but it doesn't do that. Maybe that would draw too much attention or maybe they'll add it with a software update, but it does light up green. But then, you know what, speaking of software, number seven, what is the software situation? So this whole car, it's got some screens inside, the whole car's UI is made in-house by Rivian. There is no Apple CarPlay, there is no Android Auto, it's just Rivian software through and through. I was optimistic that it would be really great, You know, it's a California company, I will say functionally, it's very good, and I think it's actually laid out pretty well. You have the dock at the bottom for organizing things, similar to Tesla, but it's not super responsive, And especially when manipulating the map at all, like the map is super slow and laggy, but thankfully this is something that can be improved with future iterations, and yes, Rivian is one of the car companies that will be pushing over the air software updates to all their cars, which they can download using the built-in cell connection or wifi, and that's nice to see. Plus it means they can add features later if they come up with more cool stuff. As of right now, it's pretty clear by how much is happening on this 16 inch touchscreen that they are pretty heavily inspired by Tesla. I mean, I'm sure many former Tesla employees who now work at Rivian would agree, but I mean, it's the dock at the bottom like I mentioned, they have a security camera mode, not Century mode, it's called Gear Guard, and it's a little more advanced because it can connect to a cable that comes with the car. So if you tie something down and someone comes by and tampers with that cable, it'll automatically record and set off the alarm, but it's got that going. The air conditioning, the way the vents move entirely by software, that's just like Tesla. Even the single scroll wheel and pair of buttons on either side of the steering wheel is just like Tesla. And even the way you adjust the mirrors and the steering wheel, Quinn pointed this out in his video, is exactly like we've been doing with Teslas for years. So plenty of inspiration here in the software department, which is not a bad thing at all, but I look forward to it getting better too. So number eight, speaking of Tesla software, there's a Rivian driver assist feature called Driver Plus. What is it? What does Driver Plus actually do? So from my experience, it's just a pretty simple set of driver assist features like I've seen in lots of other cars. It's not like any sort of advanced autopilot by any means, but it uses the 11 cameras and radar and ultrasonic sensors all around the car to do adaptive cruise control, lane keep assist, cross traffic warnings, emergency braking, all the typical safety type stuff. There is a full-on highway assist that will do all the steering and braking and acceleration for you on select highways. You literally engage at just like a Tesla. You pull down on the drive stock all the way twice, and that turns it on, and it should keep that lane and turn the wheel for you and everything. I was able to try it a few times and I noticed it was very picky about when it would engage. Like many roads with turns on them at all, it would just tell me driver assist was unavailable. Sometimes even on major highway straightaways, if I wasn't in the middle of the lane on the straightaway, it wouldn't turn on, but once it does turn on, it works and it just keeps you going with traffic. It can take light turns. Yeah, it's fine. It doesn't change lanes for you, just so you know, you'll have to disengage it, change lanes yourself, and then re-engage it, but again, maybe this can also be changed with a software update. All right, number nine, how does it compare to the other options? You know, the other electric pickup trucks? I think that's the natural question, like, all right, the Cyber Truck is going to happen, the F-150 Lightning is around the corner, maybe the Hummer 2, I guess. So if you look at the Cyber Truck, that's at least a year away, but when that comes out, if we give it the benefit of the doubt and they actually deliver what they say, then at the same price as the Rivian, it should outperform it, but it's also a much bigger truck with a very, very different style. It will be a triple motor cyber truck at that price, it'll do 14,000 pounds of towing while the Rivian will do 11,000 pounds. And of course, Cyber Truck has the Tesla supercharger advantage, a longer predicted range, and it has much, much better software, but also the yoke and a wildly minimal interior, but the F-150 Lightning might actually be a more likely comparison. So they tow about the same. The range is also pretty close, about the same, but again, that's going to be a much bigger truck too, physically speaking, and yeah, same with the Hummer, it's just ridiculously huge. I don't know if anyone's crush shopping with that, personally, from the amount of fun I've had with this thing, I would pick the Rivian every time. And I think it's the most promising for a bunch of reasons. It's the most dailyable because of the size and the range and the comfort. I love the powered front and the gear tunnel, and it's just so much fun to drive. I really have to cross my fingers for that Rivian adventure network. Fit and finish also was excellent pretty much everywhere inside the truck, except for this little plastic latch on the gear tunnel storage compartment, that probably could have been metal or something, but whatever. And it seems like they're starting deliveries really soon. I believe the first ones are out there in the wild already. So here's the big one, number 10, should you get it? Well, this isn't a full review, I've only had the thing for like 30 hours, but look, if you've got 70 grand burning a hole in your pocket and you're looking for a pickup truck to daily, I would keep this one on the short list. It's really fun. Now Rivian also has an SUV, the R1S coming later, it's got a slightly shorter wheel base, but essentially it's the same type of adventure vehicle without a truck bed. That should be cool to see. And it's overall super cool to see real genuine competition starting to fill out the space. I think someone asked on Twitter if this is a Tesla killer or something. No, not everything that comes out that's electric has to be a Tesla killer. The Tesla truck isn't even out yet, but electric trucks as a whole will benefit from really good ones coming out So they all boost each other up, and I love that. So the entire industry going electric just got a little bit faster thanks to this one. Thanks to Rivian for letting me borrow this thing for a day. I hope you guys enjoy this first look. Thanks for watching, and I'll catch you guys in the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "truck",
        "pickup truck",
        "Rivian",
        "Tesla",
        "Cyber Truck",
        "pretty",
        "lot",
        "inside",
        "pickup",
        "storage",
        "Tesla truck",
        "trucks",
        "number",
        "car",
        "thing",
        "front",
        "gear tunnel",
        "back",
        "kind",
        "compact pickup truck"
    ],
    "transcript_entity_values": [
        "McLaren",
        "Volvo",
        "0 to",
        "three seconds",
        "20 foot",
        "four",
        "the Cyber Truck",
        "5,000",
        "first",
        "Tesla",
        "0",
        "the F-150 Lightning",
        "70",
        "about 29 cubic feet",
        "Amazon",
        "314 miles",
        "Tesla",
        "Driver Plus",
        "1400",
        "800",
        "today",
        "mid eighties",
        "one",
        "third",
        "seven",
        "10",
        "Ford",
        "UI",
        "Pacific blue",
        "two thirds",
        "the next 24 hours",
        "Century",
        "Teslas",
        "four and a half feet",
        "number four",
        "a day",
        "Twitter",
        "four gallon",
        "60",
        "30 hours",
        "Remax",
        "no Apple CarPlay",
        "two",
        "150 kilowatts",
        "F-150",
        "at least a year",
        "50 years old",
        "three",
        "11",
        "California",
        "no Android Auto",
        "about an hour",
        "11,000 pounds",
        "16 inch",
        "Quinn",
        "Gear Guard",
        "Rivian",
        "68 cubic feet",
        "a hundred",
        "New Jersey",
        "200 kilowatts",
        "the second row",
        "daily",
        "a Cyber Truck",
        "seven foot",
        "7,776",
        "Teslas",
        "Cyber Truck",
        "second",
        "150 PSI",
        "21 inch",
        "Zero",
        "Rivian",
        "just over $70,000",
        "number eight",
        "Electrify America",
        "RJ",
        "up to 300 pounds",
        "number nine",
        "years",
        "90",
        "the couple of hours",
        "Hummer",
        "the F150 Lightning",
        "around 35%",
        "a multi hour",
        "all day",
        "six",
        "14,000 pounds",
        "the end of the day",
        "Lucids",
        "USB",
        "Zach",
        "30"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "TIME",
        "ORG",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "FAC",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "TIME",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}