{
    "id": "A2l7sXhT540",
    "title": "Moto Z2 FORCE Durability Test - Scratch and Bend Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-08-11T00:45:04Z",
    "video_url": "https://www.youtube.com/watch?v=A2l7sXhT540",
    "category": "Howto & Style",
    "tags": [
        "Moto Z2 Force",
        "Moto Z2",
        "Motorola",
        "Lenovo",
        "Smartphone",
        "Durability test",
        "technology",
        "how durable is the Moto Z2 Force",
        "Android",
        "Mobile phone",
        "Hardware",
        "Shatterproof",
        "Shatter resistant",
        "Phone"
    ],
    "views": 959499,
    "likes": 20182,
    "comments_count": 2628,
    "description": "The Motorola Z2 Force was released today, August 10 2017, and its time to see what it is made of.  As we know most 'shatter resistant' or 'shatterproof' screens are made from plastic.  And there is only one way to find out with the Moto Z2.  The JerryRigEverything Durability Tests.   This series of smartphone durability tests that I will perform on the Moto Z2 will help give an understanding of how long the phone will last during every day life. Ill put the phone through 2 years of abuse in about 5 minutes.   Let me know if you have any questions!   Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "In front of me today I have Motorola's flagship, the Moto Z2 Force. Keeping the same modular theme from last year, this self-proclaimed durable phone has solid specs built into a surprisingly thin body. Motorola is pushing that shatter proof screen again, so let's see what this phone can really handle. [Intro] My Mohs picks do a fantastic job of differentiating between different materials by their relative hardness. Plastic is soft so it scratches at a three. Glass is harder and scratches around a six. And real sapphire, like the HTC U11 sapphire edition is basically impervious to scratches, landing at an eight or a nine on Mohs scale of hardness. Shatter proof screens are normally made from plastic, like we've seen from previous Motorola phones and the Samsung Active series. This Z2 Force is no different plastic. This obviously has its benefits, your screen will never break and that's a huge plus. But the softness of the plastic leaves it more susceptible to superficial damage. As you can see, even my fingernails, which are level 2.5 on Mohs scale, can leave a mark. So it scratches pretty easily. Motorola has replaced this outer plastic covering on previous phones for a reasonable fee and hopefully they continue doing that with this model so customers like us can replace them if necessary. The home button is not scratch resistant either. My razor blade does do some damage, but luckily it does remain 100 percent functional even it's excessively scratched beyond normal use. Thumbs up for that. My fingerprint still unlocks the phone every single time without fail. The earpiece is recessed inside of the phone and it's made out of that thin vinyl covering. While it's not as durable as a metal earpiece, at least it's not going to fall out on it's own. Now, Motorola has paid special attention to the front camera of this phone adding it's own front facing, dual toned LED flash for you selfie lovers out there. The only problem is that the camera is still covered by that same plastic as the screen, so one fingernail scratch in the wrong spot and your pictures are ruined until you have Motorola swap out that top layer of your phone. Adding a simple screen protector over the plastic would solve this problem though. The dual 12 megapixel rear cameras are covered by glass, finally. So that is scratch resistant. These cameras aren't wide angle like the LG G6, or telephoto like the iPhone. The dual combo is just for depth effect, which is slightly less useful in my opinion, but still has a nice bonus over the average phone. Motorola says the body is made out of 7000 series aluminum, the same high quality stuff that Apple started using with the iPhone 6s. And it definitely sounds like metal. One awesome thing that I want to point out, if by chance the screen on your Moto Z4 Force ever breaks, Motorola has a waranty for 4 whole years. That's longer than Donald Trump's going to be president. Super cool of Motorola to stand behind their product with such a gigantic warranty. The gold pins down at the bottom of the phone are for all the modular components that magnetically attach to the back, like a speaker or a bigger camera. Personally, I'm most excited for that projector. The sides of the phone do have the same premium feel of metal that we expect on flagships. The top is metal as well. And even the buttons are made from metal. Down here at the bottom we have the USB-C port and an unfortunate lack of headphone jack. Having no headphone jack rules this phone out for me as a daily driver. I treat my phone like a tool and a phone with out usable basic features is not worth my time to carry. Headphone jacks are a dime a dozen, and wireless headphones are not always accessible...maybe some day in the future, but today is not that day. The screen of this phone is pretty darn awesome, 5.5 inch 1440p OLED. And most importantly, not ever having to worry about your screen breaking during a drop. That peace of mind is really truly amazing, even if you do have to compromise with the front plastic. The screen lasted 10 seconds before the plastic melted and the screen turned white, leaving a permanent bulge in the top layer and a permanent white spot on the display itself. If you ever do drop your phone, it will survive unless it's dropped in a fire so try to avoid that. To be modular ready, this phone is shockingly thin and I fully expected it to flex more than it did. There was a little screen separation from the main body, but since this phone has no water resistance rating, nothing's being compromised. Bending from the back yields no destruction either. The phone is extremely solid in its construction. While this phone might not be the phone for me, it's still gets my approval. I think it's awesome that Motorola is pushing the limits with design and functionality with their mods. Some of them are super appealing like that projector. I think I'm going to have to take an inside look at that in a future video. What do you think? Would you prefer a plastic shatter resistant screen or a glass screen? Let me know in the comments and come hang out with me on Twitter and Instagram. I have a lot of big videos planned for the future so hit that subscribe button, and thanks for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "Motorola",
        "screen",
        "Plastic",
        "previous Motorola phones",
        "Motorola phones",
        "Mohs",
        "Force",
        "Mohs scale",
        "metal",
        "scratches",
        "made",
        "front",
        "phones",
        "camera",
        "shatter",
        "previous Motorola",
        "Samsung Active",
        "headphone",
        "selfproclaimed durable phone"
    ],
    "transcript_entity_values": [
        "HTC",
        "Motorola",
        "iPhone",
        "the Moto Z2 Force",
        "7000",
        "Donald Trump's",
        "2.5",
        "Instagram",
        "six",
        "Glass",
        "three",
        "jack",
        "4 whole years",
        "Twitter",
        "5.5 inch",
        "This Z2 Force",
        "nine",
        "100 percent",
        "Moto Z4 Force",
        "Apple",
        "daily",
        "10 seconds",
        "last year",
        "today",
        "12",
        "G6",
        "One",
        "the Samsung Active",
        "one",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}