{
    "id": "a4PGBwWcHOA",
    "title": "Surface Pro 9 Review: Intel or SQ3?",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-11-16T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=a4PGBwWcHOA",
    "category": "Science & Technology",
    "tags": [
        "microsoft surface pro 9",
        "surface pro 9 5g",
        "surface pro 9 review",
        "surface pro 9 unboxing",
        "surface pro 9 arm",
        "surface pro 9 with 5g",
        "surface pro 9 2022",
        "microsoft surface",
        "surface pro 9 vs surface pro 8",
        "surface pro 9 gaming",
        "surface pro 9 release date",
        "surface pro 9 hands on",
        "surface pro",
        "surface pro 9 specs",
        "microsoft surface pro 9 5g",
        "surface laptop 5",
        "microsoft surface pro",
        "surface",
        "microsoft",
        "surface laptop",
        "verge",
        "tech"
    ],
    "views": 202822,
    "likes": 4368,
    "comments_count": 279,
    "description": "There are two identically looking Surface Pro 9 laptops to choose from  the one with Intel 12th gen chip and the other with Qualcomms ARM-based SQ3. The latter comes with 5G,  great battery life and some exciting new webcam tricks, but is it the right one for most people? We take a look at both of Microsofts latest laptops to help you pick. #microsoft #surfacepro9 #technology   0:00 Intro 1:23 Surface Pro 9 (SQ3) 2:44 Webcam test 4:11 Windows on ARM 5:27 Surface Pro 9 (Intel) 7:02 Benchmarks 7:54 Prices and configurations 8:28 Which one to pick?  Microsoft Surface Pro 9 (Intel) review:  Microsoft Surface Pro 9 (SQ3) review:   Shop The Verge's merch here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3GknnQv",
        "http://bit.ly/3TH3pCO",
        "https://shop.theverge.com/",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "(gentle music) - The Surface Pro 8 was a reinvention of the Surface line. It combined the Surface Pro X's groundbreaking design with Intel's powerful chips. It was new with an exciting screen, an exciting design, an exciting camera. All the big tech buzz words we know and love on this channel. The new Surface Pro 9 is not that. In fact, the most exciting thing about the Surface Pro 9 is that there are two of them. Now, for those of you who don't obsessively track Microsoft's internal component choices, and by the way, shame on all of you. This year's Surface Pro shoppers have a choice of two different models with two different processors. There's an Intel model, which has a boring old 12th gen Core i5 or Core i7, and then instead of a separate Pro X model this year, there's another Pro 9 with a brand new chip that Microsoft co-engineered with Qualcomm, called the SQ3. The SQ3 is an arm chip based on Snapdragon, and it's the sort of chip that's designed to power super thin, super light mobile devices. This blue one has Intel inside and the gray one has the SQ3. Now, you may be looking at these and thinking to yourself, self, these look identical. How will I ever determine which one to buy? Don't worry, I'm here for you and we are going to get through this together. (upbeat music) The case for the Surface Pro 9 with SQ3 is that it's perfect for the mobile Microsoft enthusiast. I know, I know that's a lot of words but if that label happens to describe you the Qualcomm Pro 9 offers a unique package that you won't find in any other laptop on the market. You just need to know exactly what you're getting. First off, the SQ3 model supports full 5G connectivity. Now, I wasn't actually able to get 5G speeds in various places around Manhattan and it's a bit of a challenge to figure out where exactly millimeter wave is enabled, but on paper this laptop does support 5G. Second, this model has chart topping battery life. I got over 12 hours of straight use out of this device which is longer than the vast majority of Windows laptops I've tested this year. And finally, the 5G Pro 9 has this little thing inside called the NPU. NPU stands for Neural Processing Unit and its job is to handle AI features so that the processor doesn't have to worry about them. This powers a whole bunch of, shall we say, kooky camera features that were very fun to test. (calming music) So my favorite feature is called voice focus and this does exactly what it sounds like it would do. So Becca is gonna play some really loud coffee shop noise behind me. (coffee shop noise) I'm gonna turn voice focus on. So this essentially cancels out all the noise around you except your voice so that if you're on a video call in a loud setting, people can still hear you. This is pretty loud coffee shop noise. So this is doing a pretty good job. Here, I'll turn it off again. Pretty cool, right? So there are a number of camera features which are theoretically supposed to work on the SQ3, but they only worked like some of the time. So you can see there's this portrait blur effect here which actually did work pretty well. You can see there's standard blur, there's portrait blur and that did work across a number of photo and video applications. But then you can also see they're supposed to be an eye contact and auto framing features here and these only work some of the time and we couldn't get them to work for this shoot. So you can see auto framing is supposed to be like keeping me in the frame as I move around and eye contact is supposed to make it look like I'm looking right at the camera when I look all over the place. And those, you can see those just aren't working. So I hope that Microsoft can fix that because these are legitimately very cool features when they do work. So portability, long battery life, 5G connectivity, funky camera. It's a cool and unique package. So what's the downside? Well, it's that Windows on arm kind of sucks. Windows itself, like the menus and stuff, those run fine but not every popular application is currently able to run natively on Qualcomm's processors. Some of 'em are still running through an emulation layer. And emulated apps in my experience, were slow. Chrome, for example, was not running natively on the SQ3. Neither was Slack. And when I typed didn't Chrome on this device I saw significant lag. YouTube videos froze. Slack took forever to switch between channels. Pen strokes were delayed. Stuff took a while to open. It was a bad time. Your best bet if you're using the SQ3 is to stick to apps that are running natively on arm which includes a lot of Microsoft's apps like Edge, OneNote, Paint Office, those kinds of things. Those weren't lightning fast on the Pro 9 but they were usable. Now, some of you already live your life in Microsoft's ecosystem and some of you won't mind switching over, but for many others it's not as easy of a task. Between the SQ3 and the Intel models a lot of things are the same. They have the same 13 inch display with 120 hertz refresh rate which was also on the Pro 8. They used the same attached kickstand and the same detachable keyboard which is sturdy and has a really nice click. And the same stylist, which has great haptic feedback and lives in a little pocket here. The only real difference on the outside is that the Core I7 model has new color options. So let's talk Intel. The Core I7 model of the Surface Pro 9 is a bit more fun looking. You can get it in Forest Green, you can get a dark one you can get this blue guy we have here and the SQ3 only comes in boring silver, boo! But mostly, the Intel model is the boring model. You know, all that wild and crazy webcam stuff we just showed you. Yeah, the Intel Pro doesn't have those. There's no 5G, there's no NPU. The battery life is closer to seven, eight hours with my workload at least. But in exchange for giving up all that flashy stuff you get a device that runs Chrome, you get a device that runs Slack and that's a really important difference between these two devices because the case for the Intel Surface Pro 9 is that it works. While I was testing this Intel device, I edited, I video called, I marked up, I spread sheeted nothing lagged, nothing froze, nothing crashed. It ran all the apps my heart desired. We did run some benchmarks and I mean you all know how numbers work. Here are the numbers. The Intel Pro 9 gets much higher numbers but you don't even need to see the numbers to see how much faster this Intel model is performing in emulated apps. Just look at how much longer it takes for Cinebench to even start on the SQ3 model. Across the board in various emulated apps, all kinds of things, from clicking to typing to booting and quitting are just faster on the Intel processor. There was no fan noise or heat either even when I was using more intense Adobe programs like Lightroom. And then there are a few other small differences. The Pro 9 is 0.01 pounds lighter, which you won't notice and it supports Thunderbolt four, which the SQ3 doesn't. And above all, there's the fact that the Intel model is cheaper. Okay, it's not cheaper spec for spec. Technically, the cheapest Core I7 model is the same price as the equivalent SQ3. They're both $1599. But the cheapest SQ3 model is $1299 while the cheapest Core I5 model is $999. Now the keyboard and pen add $279 to the price. So if you buy those, that gets you up to $1300 ish and $1600 ish. Anyway, the point is that the Pro 9 is already a pretty expensive device but you can spend a few hundred dollars less if you stick with Intel. Basically the Intel Pro 9 is a laptop. Okay, it's a laptop with an attached kickstand where the keyboard pops off and holds a stylist, but it's a reliable, fast laptop. And I don't have all that much to say about it. It's fine. The Surface Pro 9 with SQ3 has some really impressive AI features, and those make it feel like a laptop of the future. It's a device for enthusiasts who are really into the surface form factor and who are confident that they're only going to be using Microsoft's apps. If you are in that group and you want something to carry around and video conference with all the time, this may be the device you've been waiting for. But if you're anyone else you probably want the Intel model. The Intel Pro 9 is, and I know some of you hate this phrase, an incremental upgrade. They took the Service Pro 8 and they stuck a new chip in it. This isn't a machine anyone was excited about. It's not one that I'd show around at a party but it's the one that most of you should buy. It's light, it's portable, it's well built and it works. For most people, that's the best kind of computer to buy. All right, everyone, it's time for the real question. Which of these background effects is better? So, we've got standard, portrait, standard, portrait, standard, portrait. Hey, Becca. - Portrait. - Standard. - Hundred percent portrait. - I like portrait too.",
    "transcript_keywords": [
        "Surface Pro",
        "Intel Surface Pro",
        "Pro",
        "Intel Pro",
        "Intel",
        "Intel model",
        "Surface",
        "year Surface Pro",
        "model",
        "Surface Pro shoppers",
        "Intel Surface",
        "Microsoft",
        "Surface line",
        "Core",
        "Qualcomm Pro",
        "device",
        "portrait",
        "work",
        "apps",
        "Intel powerful chips"
    ],
    "transcript_entity_values": [
        "Slack",
        "Surface",
        "1299",
        "Second",
        "0.01 pounds",
        "four",
        "up to $1300 ish",
        "999",
        "Cinebench",
        "1600",
        "Snapdragon",
        "over 12 hours",
        "13 inch",
        "AI",
        "Slack",
        "Forest Green",
        "Windows",
        "the Intel Surface Pro 9",
        "Lightroom",
        "year",
        "5",
        "120",
        "Core I7",
        "Becca",
        "seven, eight hours",
        "hertz",
        "Qualcomm",
        "Edge",
        "OneNote",
        "Pro X",
        "NPU",
        "Adobe",
        "two",
        "the Surface Pro X's",
        "the Surface Pro 9",
        "279",
        "1599",
        "Chrome",
        "a few hundred dollars",
        "this year",
        "Core",
        "Surface Pro 9",
        "Manhattan",
        "Neural Processing Unit",
        "Core I5",
        "Surface Pro",
        "the Intel Pro",
        "The Surface Pro 9",
        "Microsoft",
        "Intel",
        "12th",
        "the Qualcomm Pro 9",
        "millimeter",
        "Paint Office",
        "First"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "FAC",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL"
    ]
}