{
    "id": "a6kcKW1fDDY",
    "title": "Testing the new Apple Watch ECG!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-12-08T23:59:03Z",
    "video_url": "https://www.youtube.com/watch?v=a6kcKW1fDDY",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "apple watch",
        "heart",
        "heart health"
    ],
    "views": 294282,
    "likes": 9609,
    "comments_count": 1087,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys it's Justine and today I am so excited because the new ECG feature on the Apple Watch was recently released and this I something that I've been waiting for for, I guess, since the Apple Watch officially came out. This is the Apple Watch Series 4 and this is only available on the Series 4. I'm sure you guys saw many of the videos that I did about the Apple Watch, but if you didn't I'll put a link in the description and an annotation if you wanna check that out. I posted that awhile ago but today I'm gonna go through and show you guys how to activate the ECG on your Apple Watch but the first thing that you have to do is make sure that your Apple Watch and your phone is updated to the latest OS. So once you've updated your Watch and your app go into the Heart and this'll take you into the Heart Health and this will have a little setup screen. I already did it so yours may look a little bit different. You wanna turn on the Irregular Rhythm so that will notify you if your Watch detects anything that's irregular. I also have on my High Heart Rate and my Low Heart Rate. You can go in here and you can view your recorded ECGs in Health. This will all be recorded inside of the Health application so here it is. I've only taken one ECG so far when I set this up this morning so I wanted to show it to you guys again and show you how it works. You'll install the ECG app onto your Watch face and there it is right there. It's definitely recommended that you do sit down and you kind of stay relaxed while you're doing this. So I'm gonna sit down under my table. But I'm gonna give you a demo of what it does look like over here but just know that I'm sitting down doing this. (techno music) And there is my reading right here and this automatically gets sent to my iPhone and you can add symptoms or just click Done and it will be here on my phone. You can see that the ECG recording is available so when we open that up I can get the reading of what my ECG was and I can export this as a PDF to my doctor. I don't have a doctor. I should probably get one so that I can send them my PDFs. It's also cool because it shows you what the device was that was reading it, Apple Watch, which Watch version. I just wanted to show you guys this and how to set it up in case you were curious because I did have a few people that questioned how to set this up on Twitter and I'm pretty excited because the Apple Watch for me has changed the way that I track my fitness, and it's one of those things that you definitely don't need to have it, but for me I feel like the Apple Watch has motivated me. It has kept me accountable for the fitness goals that I have set, even though I haven't set specific goals, just doing these competitions with my friends has made me realize that, okay everybody else is moving today, Justine you better get your butt up and go do things. And this past year fitness has been a huge part of my life because I really feel like I needed to get my life together. There was a point in time last year where I probably felt the absolute worst that I've ever felt in my entire life, and I knew that something had to change. And a lot of things changed and as crazy as that sounds the Apple Watch sort of did play a part in that. And you know it doesn't have to be the Apple Watch for you. It could be a Fitbit, it could be anything that sort of keeps you accountable but for me it was the Apple Watch and my friends and just a lot of different changes that I had to make and sometimes those changes are the most difficult thing that you have to do but, it's one of those things that you know that you need to do and you just gotta go and do it. Get your butt up off the couch, go outside, start doing some activities, and just keep moving. And I know it's crazy but to say that the Apple Watch changed my life, it was a catalyst for sure. I mean I was the one that had to put those actions into motion but the Apple Watch kept me accountable and it is really great to go back and see where I started from, like how difficult some of these hikes were for me in the beginning. So for me being able to quantify all of those things is really amazing so hopefully that this could inspire you, either get an Apple Watch or to get something, or even just to get moving. You don't have to have a device to do it but it does really feel great to be able to actually see the numbers in front of you and be like, yeah, I'm actually making progress. I'll see you guys in my next video. Let me know if there's anything else that you would like to see me make. I am starting some new stuff in 2019 which is actually crazy, it's coming up soon, so I'd love to hear from you what are your favorite videos of mine and hopefully I can make some more of those. And until then, I'll see you guys later. Don't forget to subscribe. If you like this video click like and leave me a comment below and let me know what your New Year's resolutions are and don't worry, if you didn't make those New Year's resolutions this year there's always next year and it doesn't have to happen in the New Year, it can happen any time. You just have to have the will and the motivation to make those changes. So that's it. I'm just talking at this point. And my sweater has holes in it. I paid extra for these holes. That's how you know there's a problem. (techno music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Series",
        "Apple Watch officially",
        "Watch",
        "Apple",
        "Apple Watch changed",
        "Apple Watch sort",
        "Watch Series",
        "ECG",
        "Watch officially",
        "Heart Rate",
        "High Heart Rate",
        "Low Heart Rate",
        "year",
        "guys",
        "Heart",
        "ECG feature",
        "recently released",
        "Heart Health",
        "Series"
    ],
    "transcript_entity_values": [
        "New Year's",
        "one",
        "the Apple Watch",
        "Watch",
        "Justine",
        "this morning",
        "this past year",
        "iPhone",
        "ECG",
        "Twitter",
        "last year",
        "the Series 4",
        "today",
        "ECG",
        "this year",
        "2019",
        "next year",
        "the Apple Watch Series 4",
        "the New Year",
        "Fitbit",
        "first",
        "Apple Watch",
        "PDF",
        "the Heart Health",
        "Health",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "EVENT",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}