{
    "id": "a6zvvlrd-jw",
    "title": "The Electric Car Pre-Order Problem",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-03-30T21:12:29Z",
    "video_url": "https://www.youtube.com/watch?v=a6zvvlrd-jw",
    "category": "Science & Technology",
    "tags": [
        "Rivian",
        "Rivian R1T",
        "Lordstown",
        "electric car scam",
        "MKBHD",
        "Cybertruck"
    ],
    "views": 2465319,
    "likes": 114462,
    "comments_count": 6780,
    "description": "I really want EVs to be the future, but this is getting ridiculous...  MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - So Tesla rolled the new Roadster 2.0 off the back of a truck and unveiled all of its ridiculous specs in November of 2017. World record acceleration, world record quarter mile time, world record electric range. This looked like the new king of performance sports cars. So if you liked it, you could order a Founders Edition on the spot that day to be in the first thousand. You just had to wire transfer the full price of the car to Tesla within 10 days. $250,000. But now it's 2022 and that car is still not out yet, and so you just gave Tesla a five-year interest-free loan of a quarter million dollars. Now, if you just put that exact same quarter of a million into an investment that actually earns you money like, let's say, I don't know, buying Tesla stock with that exact dollar amount on that same day, then that would be worth more than $4 million today. Electric cars have a problem right now. So, first, let me just say, I firmly believe electric cars are the future. I think a lot of people would agree with that. But they're just that; they're the future, not the present. So 99% of the cars on the road today are still gas cars. But the problem comes from how entirely unpredictable electric car launches have been for the past half a decade to the point where if you put your money down for one of these things, you really don't know exactly what you're gonna be getting or when you're gonna be getting it. Now, a big part of this is the fact that there are so many new companies trying this. The car industry is mostly huge old companies, but Tesla's success has convinced a lot of people they can spin up a new electric car company too with their own little twist. But the thing is making new electric cars is really difficult and really expensive, and starting a new electric car company is even more difficult and even more expensive. So I present to you the five-step guide for creating a new electric car company today and see if you can spot which one of these steps a lot of these new startups are getting stuck at. So step one, make a clever name with a great idea for an electric vehicle, preferably something Tesla hasn't already done yet and make a snazzy website to show off this cool idea you have. Step two, become a company. You're gonna need an enthusiastic CEO, a fun company culture, maybe even poach some people from other successful car companies and start making this idea look very promising. Step three, build one prototype. So this is the key. So you can build more for bonus points, but all you really gotta do is make one working version of this new vehicle. If not all of the high-tech features are working, that's fine. You just gotta demonstrate the ability to build an electric vehicle. Then step four, you gotta take this vehicle and use it to generate as much money as possible. Parade it around to generate attention, show it off, bring it to car shows, let the press try it, and you gotta put a pre-order button on your website so people who like the idea can give you a little interest-free loan, but more importantly, you can use the number of pre-orders to get big investors interested in getting on board. \"See, look how much promise and interest the idea has, you wouldn't wanna miss out on an opportunity to invest in the next big electric car company, right?\" Then step five, ship it. Use the money you raised, build a factory, build the technology. Become a car company and ship it. Now spoiler alert, pretty much all these companies get to step four, but the gap between step four and step five is massive. It's like that how to draw an owl tutorial, like step one, draw two circles. Step two, draw the rest of the owl. But it's really hard. You have all these new companies coming up and making all this interesting stuff but then not getting to the last step, and that gap has created so much distrust and confusion about what to expect when you put your money down for something. It kind of reminds me of like smartphone launches, I've talked about Sony before, when apple or Samsung announces a new phone, it's on stage and then two weeks later it's in the stores. You can buy it. And then Sony's problem would be, they'd announce a new phone and it would be kind of cool, but then it wouldn't come out for six months. And so by the time it actually did get released, all the hype is gone, the interest is gone. People who were thinking about spending that money on that would spend it on other things, and it would just fall apart. Now people are willing to wait a little bit longer in the car industry, but it's just getting kind of ridiculous. So I think my earliest experience with this was with Faraday Future. Some of you might have heard of them. Cool name, very interesting company; they nailed steps one and two. And they showed me a functional prototype five years ago in 2017. And it was super cool. They showed it to me on the CES show floor and they drove people like me around in it and even did a 0 to 60 in 2.39 seconds. (engine roaring) (driver chuckles) That is legit. - Not bad, right? - So they kind of nailed step three. So then they moved on to try to generate as much money as possible for the factory and the engineers and everything required to ship the thing. And they've been stuck in this step ever since. They did allow pre-orders, which are still open, by the way. You can still give Faraday Future $1,500 to pre-order the FF 91. And they even went public, which helped with capital. So they've raised enough money and they've put together enough to be worth about $2 billion now. And that's still not nearly enough money to have actually made the factory and shipped anything. Will they ever get to step five? Will they ever actually ship an FF 91? (Marques grunts) I remember another company called BYTON. They had a pretty cool prototype. I also saw them at CES, this was about four years ago. And this, again, made a pretty big splash. I remember all the headlines from the show, awesome presentation. Their site, too, is full of great ideas for a pair of vehicles that are presented as very realistic and very achievable. They managed to raise $1.2 billion from investors, but they've gone silent. They haven't tweeted in two years, their website hasn't changed since 2020, and they certainly haven't shipped any cars. And then Canoo is another one of these companies. They might ship something. So they were founded in 2017 by some ex-Faraday Future employees. They eventually got Hyundai and Kia to announce they'd work with them on a new vehicle platform. They got listed on the stock exchange and valued at $2.4 billion. Now Hyundai and Kia look like they've pulled out, but you can still go to canoo.com and pre-order one right now if you really want to. But they haven't shipped anything yet either. And like a week and a half ago, I got an Instagram ad for a company called Atlis Motors that I'd never heard of, and out of morbid curiosity, I clicked it. And it is kind of wild. Their homepage, the homepage immediately promises an electric vehicle platform that will help any company electrify their lineup. And then a quad-motor pickup truck with up to 500 miles of range that can charge up in 15 minutes. But the biggest, brightest button up at the top of their website is the Invest button. So if you like the idea that they've shown you enough, you can get in at the ground level of this crowdfunding for what might be the next big thing. Apparently they're already worth nearly $1 billion. So they say they're gonna be using the funds for equipment and machinery, and research and development, and administrative expenses, and basically making a company. but when will Atlis Motors actually ship anything? That, I don't know. That's a great question. And if you really wanna see what a failed blueprint of trying to get through these five steps looks like, look at everything Lordstown Motors has ever done. So Lordstown was founded in 2018 with this nice plan to make electric pickup trucks. So they'd have in-hub motors, in the wheels, and they'd started around $52,000. Seemed like a really cool truck. Nice idea. They'd made some nice pre-production models to parade around and gather interest from fans and potential investors. You could find a Lordstown Endurance truck at almost every conceivable auto show, which is great for people pointing cameras at it. So they got to step three, take people's money. And so they went over to GM and bought an old plant from them, which got them interested enough that GM decided to invest $75 million in this promising new company. They went on to open pre-orders and got over 100,000 pre-orders. And then with all this momentum, they went public as a company and their valuation soared to over $5 billion. But then, unfortunately, an investigation found that most of these pre-orders were fabricated, not real. Plus, they allegedly paid a company to place around 1,000 pre-orders. Sick. This company's pretty much been falling apart ever since. Lordstown today is somehow still worth hundreds of millions of dollars, but I don't think they're gonna be shipping anything anytime soon. But then the latest startup that you might have seen in the news was Rivian. Now Rivian looked like they had all the promise in the world because not only did they have a really good idea, the R1T and R1S vehicles, and not only did they have a great presentation and a hungry target demographic and a cool CEO, but they actually seemed to be getting real money together. So they had a contract from Amazon, they got investment from Ford, they were getting billions and billions of dollars together, and that seemed like they might be getting enough to scrape together to jump over to step five. They might finally leap to be able to ship these new vehicles. They got one of those pre-production trucks out to our studio here, and I lived with it for two days, and I was very impressed. I loved the thing enough to put in my own pre-order. It had all kinds of cool features, working software. And honestly, it's one of my favorite EVs I've driven to this point. But as you know, it's easy to make just one. It's easy to make just one. But Rivian's gotten enough money, so they could do the R&D, they could build the factory, and they could finally start actually shipping some of these rather slowly, but they're shipping some real units to real users as we speak. But even Rivian has had a bumpy road with all the capital needed to start things up, plus the wrench of the pandemic and the supply chain shortages being thrown into things. Even they a bit underestimated how much money they would need to make these trucks for people. So a few days ago, Rivian decided to raise the price of all of their vehicles by around 12 to $15,000. And that included all of the trucks that all those people had already reserved. So they wouldn't honor the price of those old pre-orders. Cue massive amounts of backlash, which, totally understandable. The truck just went from 70-something thousand to nearly 100 grand. But it must have been more blow back than they were actually expecting because Rivian walked that back 24 hours later. So there is still a higher price for new orders if you were to order today, but they let all the people who had those old pre-orders in stay in at the low price, and they offered that low price back to people who'd canceled if they could just get back in line, please. So even Rivian isn't immune to all this chaos, but they have gotten the furthest in the five-step process to the point where they're now delivering cars. And they've promised, I think, they've projected 25,000 cars to be delivered this year. For context, Tesla delivered about 1 million cars last year. Ford delivered about 4 million cars last year. So I think all this highlights how hard it is to get to step five on the master plan. But some of you might be thinking, \"Wait, okay, what if you're not a startup? Maybe you don't need to go through the same five-step process.\" But still, even a lot of these more established companies are treating their new electric cars like kickstarters. They might not just have to do the first two steps. So these days I do see some Volkswagen ID.4s, I see some Mustang Mach-Es, I see some Ioniqs out there on the road. Love to see it. But then there's the Ford F-150 Lightnings of the world, which they've definitely shown off. They've brought one to the studio here. You could pre-order one right now, and they should hopefully be starting to ship in a few months. And then, of course, Tesla, an existing car company, pretty much followed the exact same blueprint with the Cybertruck. I remember the one famous working prototype doing some fun laps around New York City. The pre-order's climbing into the millions, which, again, is a few hundred million dollars of interest-free loans straight to Tesla. Still not sure when this thing's gonna ship, though. And then, of course, they did the thing that I was talking about in the beginning of the video with the Roadster that was back in 2017. It's been five years since they showed that car off, and who knows when it's ever gonna ship? So the moral of the story: beware of these come companies parading around working prototypes of electric cars while also taking pre-orders with far away delivery dates or unknown ship dates. Just that the combination of these things, you should pay attention to it. I'm still gonna check out new electric cars when they get announced. I wanna see what kind of new stuff is out there. But anytime I see a new EV announcement, I'm automatically gonna add a couple years and several thousand dollars, no matter who it's from. Okay, that's it for my rant. Let me know what you guys think of all these new electric car announcements we've seen over the past couple years in the comment section below. We'll hang out there. Either way, that's been it. Thanks for watching. Catch you guys later. Peace! (upbeat music)",
    "transcript_keywords": [
        "electric car company",
        "Electric cars",
        "car",
        "step",
        "electric",
        "car company",
        "cars",
        "company",
        "specs in November",
        "Tesla",
        "people",
        "money",
        "ship",
        "Rivian",
        "preorders",
        "electric vehicle",
        "idea",
        "companies",
        "cool",
        "big electric car"
    ],
    "transcript_entity_values": [
        "hundreds of millions of dollars",
        "around 12 to $15,000",
        "several thousand dollars",
        "millions",
        "0 to",
        "four",
        "about 1 million",
        "a few months",
        "about $2 billion",
        "Marques",
        "that day",
        "first",
        "250,000",
        "five years",
        "five-year",
        "November of 2017",
        "Amazon",
        "Tesla",
        "billions and billions of dollars",
        "2017",
        "Samsung",
        "the past half a decade",
        "$1.2 billion",
        "GM",
        "today",
        "one",
        "100,000",
        "2022",
        "Ford",
        "Kia",
        "Atlis Motors",
        "Lordstown",
        "Ioniqs",
        "Mustang",
        "nearly $1 billion",
        "two days",
        "six months",
        "60",
        "two years",
        "Canoo",
        "about 4 million",
        "2020",
        "two",
        "last year",
        "Hyundai",
        "the past couple years",
        "10 days",
        "about four years ago",
        "three",
        "15 minutes",
        "up to 500 miles",
        "five years ago",
        "over $5 billion",
        "91",
        "a couple years",
        "99%",
        "CES",
        "this year",
        "a few days ago",
        "Rivian",
        "1,500",
        "Roadster",
        "F-150 Lightnings",
        "more than $4 million",
        "New York City",
        "25,000",
        "Lordstown Motors",
        "ex-Faraday Future",
        "quarter mile",
        "2018",
        "70-something thousand to nearly 100",
        "two weeks later",
        "Faraday Future",
        "2.39 seconds",
        "around $52,000",
        "$2.4 billion",
        "the first thousand",
        "a few hundred million dollars",
        "same quarter",
        "Roadster 2.0",
        "Sony",
        "EV",
        "Volkswagen",
        "Invest",
        "five",
        "$75 million",
        "Cybertruck",
        "a quarter million dollars",
        "Lordstown Endurance",
        "24 hours",
        "Instagram",
        "1,000"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "ORDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "MONEY",
        "MONEY",
        "DATE",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL"
    ]
}