{
    "id": "Aax7BSYqEO0",
    "title": "I tried Windows 11!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-06-17T00:32:56Z",
    "video_url": "https://www.youtube.com/watch?v=Aax7BSYqEO0",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Microsoft",
        "Windows 11",
        "Windows",
        "11",
        "Windows 10",
        "Windows 10X",
        "leak",
        "build",
        "preview",
        "features",
        "vs",
        "Windows 11 vs Windows 10",
        "leaked build",
        "hands-on",
        "UI",
        "design",
        "upgrade",
        "free upgrade"
    ],
    "views": 575712,
    "likes": 37389,
    "comments_count": 1817,
    "description": "Play World of Tanks for free:  New players will receive the Excelsior tank, 250,000 credits, and 7 days premium access by using code TANKMANIA. Thanks to Wargaming for sponsoring this video!   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 The Host (2021) 0:13 Windows 11 leaked build 1:38 Google updates lotsa stuff 2:38 end of E3 highlights 3:53 World of Tanks 4:42 QUICK BITS 4:46 RX 6600M, 6900 Liquid Cooled 5:15 OnePlus \"merging\" with Oppo 5:43 Oculus Quest 1 gets Air Link, ads 6:07 Starlink dishes overheat 6:27 Sir Tim Berners-Lee selling NFTs for charity  NEWS SOURCES  TURN IT UP TO AAAAH GAMING on Windows 11:        sound    THE WINDS OF GOOGLE Is it an upgrade if it goes away? Gmail, Chat, Docs integration rolls out for everyone     Google rolls out E2E encryption in Messages under certain conditions    Google retail store   EVERYBODY EXCITED EVERYWHERE  Zelda, sort of   Metroid Dread   Halo Infinite multiplayer   Homeworld Mobile   Steam Next Fest    QUICK BITS  REMEMBER GPUS? RX 6600M benchmarks   RX 6900 XT Liquid Cooled    BRANDS. GOTTA LOVE EM OnePlus merges with Oppo      THE BEST AND THE WORST Oculus Quest 1 will get wireless PC VR streaming too  also ads    STARFRIED Starlink dishes can overheat      WHAT, THIS OLD THING? Sir Tim Berners-Lee auctioning Web source code as NFT      ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://tanks.ly/3g11U1y",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://youtu.be/odZSCdNTFPw",
        "https://linustechtips.com/topic/1347667-windows-11-new-ui-leaked/",
        "https://www.xda-developers.com/hands-on-windows-11/",
        "https://twitter.com/tomwarren/status/1404843837726547971",
        "https://twitter.com/tomwarren/status/1404840956893990914",
        "https://arstechnica.com/gadgets/2021/06/gmails-big-merger-with-google-chat-meet-and-docs-launches-for-everyone/",
        "https://www.youtube.com/watch?v=SDBbFETGiA4",
        "https://www.androidpolice.com/2021/06/15/google-messages-end-to-end-encryption-for-rcs-chat-is-rolling-out-to-everyone/",
        "https://youtu.be/oB70suAIF6A",
        "https://www.cnet.com/news/googles-new-york-city-store-is-part-retail-site-part-exploratorium/",
        "https://www.youtube.com/watch?v=Pi-MRZBP91I",
        "https://www.youtube.com/watch?v=8NjCICl7dDo",
        "https://youtu.be/W18OP8BZc6I",
        "https://youtu.be/4Oe0JoarIu4",
        "https://store.steampowered.com/sale/nextfest",
        "https://hexus.net/tech/news/graphics/147968-first-amd-radeon-rx-6600m-gpu-benchmarks-emerge/",
        "https://videocardz.com/newz/amd-launches-radeon-rx-6900-xt-liquid-edition-with-330w-tbp-and-18gbps-memory",
        "https://www.engadget.com/oneplus-oppo-merging-bbk-electronics-pete-lau-141928142.html",
        "https://www.neowin.net/news/oneplus-further-integrates-with-oppo-promises-better-products-and-faster-updates/",
        "https://www.pcmag.com/news/original-oculus-quest-vr-headset-will-work-with-air-link-soon",
        "https://www.theverge.com/2021/6/16/22535511/facebook-ads-oculus-quest-vr-apps",
        "https://linustechtips.com/topic/1347834-starlink-dishes-go-into-%E2%80%9Cthermal-shutdown%E2%80%9D-once-they-hit-50%C2%B0c/",
        "https://www.tomsguide.com/news/starlink-dishes-shutting-down-in-extreme-heat\\",
        "https://www.reddit.com/r/Starlink/comments/nzudxr/this_could_be_a_problem_only_noon_in_az/",
        "https://linustechtips.com/topic/1347860-sir-tim-berners-lee-inventor-of-the-world-wide-web-is-to-auction-his-source-code-as-an-nft-for-good-causes/",
        "https://www.bbc.com/news/technology-57474504",
        "https://www.theguardian.com/artanddesign/2021/jun/15/nft-representing-tim-berners-lee-source-code-world-wide-web-sale-auction",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Riley told me, \"Linus, you're not allowed to host TechLinked today because I wrote the script for myself,\" and I said, \"Riley, a good host can host anything.\" And I might not be a good host, but I'm an adequate host. - [Riley] You're no Ryan Seacrest. - And I can host the tech news. It seems so surreal when rumors about Windows 11 started popping up, but then Microsoft teased it pretty blatantly with that 11-minute-long slo-fi startup sound video last week, and then yesterday a preview build of Windows 11 leaked, confirming that it's a thing and that conspiracy theorists worldwide could celebrate! They're finally vindicated, Riley! - [Riley] I'll see you at the conference! So that's it, guys, whatever pseudo-historic event that you've been chatting about on that dark web forum, it's real. A bunch of internet people have gotten the new OS running in a virtual machine and it most prominently features a new Start menu design with centered task bar icons straight out of the canceled Windows 10X, except that you can also move those things to the left side and go back to the old Start menu. Also, the windows themselves have rounded corners, there's new icons in File Explorer, and a new Widgets panel on the left side which looks like the new panel that they just added on Windows... Wait, wait a second. Is this just Windows 10? - [Riley] Yeah. - With a makeover? - [Riley] Sorry, Linus. But there's new sounds. - [Riley] Oh! - Hey! Like the new startup one, which is nice. - [Riley] Have you heard it? - I haven't actually heard it yet. - [Riley] Oh, it's such a banger. - Great. So we'll get all the official details at Microsoft's event on June 24th presumably, but so far I don't really get why this stuff means we have to go up a number. It's fun though, right? - [Riley] It's fun. - Ah, 11! What a fun number! Speaking of nebulous upgrades, Google is rolling out that fancy new Workspace UI for Gmail, Drive, and Chat to everyone, not just their enterprise customers. The changes make each of these products more like one integrated Google thing, allowing you to split screen Gmail and Docs in one tab, for example. Google... That's unnatural. Google's also adding end-to-end encryption to the Android Messages app and it'll work perfectly as long as both senders are using the Messages app, have enabled Rich Communication Service, or RCS, in the settings, and are in a one-to-one chat rather than a group conversation. - [Riley] That's everything. - It's no iMessage but it's something that may go away if Google decides not enough people have thanked them for adding it. Google is also launching their first physical retail store in New York City, which is cool for new Yorkers but also just making more work for themselves when they decide to add that to the graveyard. - [Riley] You have to get whole crane and everything. - And if you're a capital G gamer, you probably noticed that E3 has been going on over the past week and there's no way I'm gonna be able to cover every single thing that every gamer cares about. So here's some of the stuff that I thought was cool. I Riley. - [Riley] Oh God. - We've got a new trailer for the Breath of the Wild Zelda sequel, which looks cool, but also starts with Zelda falling into a hole. That poor girl - [Riley] She got medical powers. - She can't catch a break. - [Riley] Leave her health - Metroid Dread is a 2D Metroid game that is not Metroid prime four. Why is that in here? We saw some Halo Infinite multiplayer gameplay for the first time and it doesn't look like an Xbox 360 game. So that's good. - [Riley] That's a plus. - Throwing this in because of surprise mostly, Gearbox announced Homeworld Mobile, the first real-time strategy game for iPhone and Android with full 3D movement in space. - [Riley] Yeah, what? - Um. I don't know. I, he spent hours on the desktop version, just learning how to do things. So. - [Riley] It's so complicated. - good luck I guess. - [Riley] What. - And if you feel like you missed out on any of the E3 experience, hey, the Steam Next Fest has hundreds of playable game demos to cap off E3. So you can check that out using our link down below. Just kidding. We don't have a link for that, but this Riley does. - Now. It's time for quick bits brought to you by World of Tanks, the free to play online multiplayer game for PC and mobile, meaning only skill we'll secure victory on the battlefield. So build yours by piloting over 550 historically accurate war machines from the mid 20th century including legendary Shermans, Churchill's, Tigers and more. With over 40 battle arenas in historic locations and 100 million players worldwide you can master the art of armored combat on your own or join team clashes and climb the leaderboard as brothers in arms, or sisters, siblings in arms. If you use the invite code TANKMANIA, you'll get the Excelsior tank, 250,000 credits, and seven days of premium access. So rollout today with the link below. Tanks. - There's always some time for quack bots. Take yourself mentally back to the time when GPU leaks were exciting because there was some hope of actually getting your hands on one someday, because some benchmarks of the RADEON RX 6600M have leaked that have it performing pretty well against a GeForce RTX 3060 Mobile Today AMD celebrated the leak by launching the Radeon RX 6900 XT liquid cooled as they tend to do with their top end card. I'm sorry. I can't pretend to care. It's system integrators only. - [Riley] There's water in there. - OnePlus has announced that it is merging with fellow phone brand Oppo with OnePlus taking the role of a sub-brand. This news would be a lot more interesting if everyone hadn't known this forever. And if both brands weren't already owned by BBK electronics making this merge more a matter of filling out some forms and formalizing that relationship rather than some kind of true shakeup of the industry. - [Riley] They're both owned by Blackberry? - Ah, and this I care about though. The first gen Oculus Quest VR headset will be getting the Air Link Wireless PC VR streaming feature that first came to the Quest 2 earlier this year. It sucks, but.. - [Riley] Does it? - Yo, I mean, it's wireless. What do you want? - [Riley] I haven't tried it. - And Facebook also announced that they would start putting ads in Oculus app soon. - [Riley] Ow. That also sucks. - I mean whoa, I didn't see that one coming. Starlink's receiver dishes are apparently susceptible to overheating as a customer in Arizona found out when he lost internet service for several hours, thanks to a thermal shutdown error and it was only noon. Though, to be fair you can't really expect optimal conditions for basically anything in Arizona. - [Riley] Whoa. - Except heatstroke - [Riley] And why? That's rude. - And even the creator of the web Sir Tim Berners Lee is getting in on the NFT craze which is much less of a craze now, but hey, he's old. He didn't realize yet. - [Riley] You're slow. - At least he's doing it for a good cause though. Sir Tim is auctioning off a number of collectors items as NFTs including the original source code files for the web, with proceeds going to charity. So people in need get help. The internet gets hacked and we enter a digital apocalypse. Everyone wins. - [Riley] I get to use a sword. - And I won this episode. See, I told you I could host it. All I have to do is point at you when you said it was your personal experience and it's over now. Come back Friday for more tech news which I will give up willingly. I promise. That's a tie into the joke that used to be the intro of this video until we changed it. - [Riley] I think it still works.",
    "transcript_keywords": [
        "host TechLinked today",
        "host",
        "wrote the script",
        "host TechLinked",
        "Windows",
        "good host",
        "Google",
        "Riley",
        "Ryan Seacrest",
        "adequate host",
        "good",
        "game",
        "TechLinked today",
        "link",
        "Metroid",
        "Start menu",
        "time",
        "Start",
        "Messages app",
        "Mobile"
    ],
    "transcript_entity_values": [
        "the Breath of the Wild Zelda",
        "6900 XT",
        "Tim",
        "yesterday",
        "RADEON",
        "RCS",
        "GeForce",
        "File Explorer",
        "the past week",
        "seven days",
        "OnePlus",
        "Riley",
        "one",
        "Blackberry",
        "Yorkers",
        "over 550",
        "Oppo",
        "iPhone",
        "earlier this year",
        "NFT",
        "Google",
        "100 million",
        "a second",
        "2D",
        "Tigers",
        "last week",
        "Gmail, Drive",
        "hundreds",
        "Arizona",
        "11",
        "over 40",
        "the Air Link Wireless PC VR",
        "Tim Berners Lee",
        "Microsoft",
        "TANKMANIA",
        "Zelda",
        "Halo Infinite",
        "Friday",
        "Homeworld Mobile",
        "Rich Communication Service",
        "11-minute",
        "Metroid",
        "the mid 20th century",
        "iMessage",
        "first",
        "Gearbox",
        "250,000",
        "Facebook",
        "E3",
        "only noon",
        "Android",
        "Shermans",
        "Churchill",
        "Widgets",
        "TechLinked",
        "four",
        "hours",
        "GPU",
        "Radeon",
        "Excelsior",
        "BBK",
        "Oculus",
        "World of Tanks",
        "Docs",
        "Gmail",
        "Linus",
        "New York City",
        "Windows 11",
        "3060",
        "June 24th",
        "Xbox",
        "Ryan Seacrest",
        "Workspace UI",
        "today",
        "Starlink",
        "several hours"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "TIME"
    ]
}