{
    "id": "AB3Ku5hdfWI",
    "title": "They Fit a GPU in This?? - MSI @ Computex 2023",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-01T00:28:30Z",
    "video_url": "https://www.youtube.com/watch?v=AB3Ku5hdfWI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "msi",
        "laptop",
        "computex",
        "2023",
        "computer",
        "motherboard",
        "mobo",
        "hidden",
        "minimalist",
        "cool",
        "PSU",
        "fire"
    ],
    "views": 230244,
    "likes": 8270,
    "comments_count": 256,
    "description": "Get $5 off your Magic Spoon order with code shortcircuit5 at   Alex stopped by the MSI booth at Computex to see what new monitors, laptops, and pc components they have coming out soon. With some thin and light creator laptops and motherboards with hidden power cables, is the MSI's future looking bright or will Alex be unimpressed with what they have to offer?  Buy a MSI MEG 342C Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Laptops, monitors, motherboards, oh my! 0:08 Prestige 16 Studio 2:50 Commercial 14 H 4:29 Sponsor - Magic Spoon 5:12 Project 491C QD-OLED  6:29 Gungnir 300R Airflow 7:44 Project Zero 8:13 MAG A850GL PCIE5 PSU 8:40 Outro",
    "description_links": [
        "https://lmg.gg/magicspoon",
        "https://lmg.gg/Rc6PR",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- We're here at the MSI booth at Computex 2023 where they have got brand new laptops, displays, motherboards. Starting off we have the Prestige Studio 16, and this thing right here is sweet. This is the first laptop as far as I know that has the Intel EVO certification and a dedicated GPU. So in here we're looking at 13th Gen H Series processors from Intel. Not 100% sure what it is, they won't tell me, but it is gonna be pretty darn fast. On top of that, we have the RTX 4060, and what's really noticeable with this though is that it is hecking light. This thing right here is 1.5 kilograms, and it says on the little card that this magnesium alloy chassis is fingerprint resistant. Let's see. Wow, that's really, really good. I don't know if you can tell, but I am rather gross at the moment. Good job guys. For the screen, it's only 60 hertz. They said not to focus on that, but that's fair enough because everything else is very, very good. 2560x1600P, 100% DCIP3. It does look really good. Oliver, do you want to edit on this? Oliver said yes and he likes Macs, so that's pretty darn good. We can expect at least nine hours because you need that to get the Intel EVO certification. Maybe even more. In this, they do have the largest battery that you can put in a laptop, so 99 watt hours. Now one thing that MSI always does struggle with though is the keyboard. And it's not bad. It's not bad, it's like a B plus, something like that. It's too bad because the switches are like medium tier but this chassis is like A plus. Like I don't know if you can tell, but I am pushing on it and the magnesium alloy, it's not great when you don't have it actually on a table, but MSI has just been killing it with how much they have improved their chassis rigidity lately. I really like it. For IO, we have full size SD card reader. Again, video editors love that. Headphone microphone combo Jack, HDMI, USB type A, and two Thunderbolts which do do your power delivery up to 140 watts. This thing right here looks very sweet. They don't yet have finalized pricing but they say it'll be under $3,000, which maybe is good, maybe it isn't. Depends on how far they get under three grand. I do like it though, so light. One more thing, let's have a little look at just how this trackpad is. Actually I'm kind of sticking to it. This right here might need a, let's see, there we go. This is one of those trackpads where you need to get a little bit greasy before it starts working well. But now this thing feels great. Seems like we have an actual click. Yeah, there we go. And it is massive. Let's go to the next one. Up next we've got the commercial 14 H. So this right here is, as you might have guessed, aimed at commercial business stuff. So this right here is made out of mostly recycled materials and you have a bunch of options for IO. Right here we have a full-size SD card reader, headphone microphone combo jack, type A, Thunderbolt, power in, around back we've got HDMI 2.1, USB type A, another type A, and 2.5 gigabit LAN. Although do say that back here you can reconfigure the IO to sort of exactly what you want. Also up here we've got a smart card reader there and an NFC reader there so if you want to have that like extra business level security, it has got that. For the processor, we get Intel Core H with the EVO certification of course and also vPro is available if you want to give Intel just heaps of your money. As for the actual build quality, it's two years ago MSI, three years ago MSI maybe, I'm sorry. It's not that bad. It's pretty good overall but they are going not for like ultra premium business, it's more like budget-ish tier, sort of tier? Budget sort of tier. Business laptops are expensive, so I definitely cannot say budget. For the display it is 14 inches, 1200P, 16x10. Do enjoy seeing that. And it looks like we even have Windows Hello facial recognition. Excellent job, guys. Oliver, do you think that our business team would like this laptop? - [Oliver] I think so. - Probably, but not as much as they'd like this segue to our sponsor. - Thanks to our friends at Magic Spoon for sponsoring this video. Magic Spoon's healthy yet delicious cereals have zero grams of sugar, 13 to 14 grams of protein, and only four to five net grams of carbs per serving. Build your own variety box with their best selling flavors like Cocoa, Fruity, Frosted, and Peanut Butter. You can even add their cereal bars to your box too. They have one gram of sugar. four net grams of carbs. and only 130 calories per bar. Additionally, all of Magic Spoon's products come with a 100% satisfaction guarantee. Don't like what you got? Magic Spoon will fully refund your first case of products. Click the link below to check out some of Magic Spoon's tasty offerings, build your own variety box, and use code shortcircuit5 to get five bucks off. - Up next we've got the project 491C QD-OLED, and this thing right here, talk about immersive monitors. We've got 240 hertz, 5120x1440P resolution. Just have a look at this, Oliver, it's so nice. You can just peacefully glide along but in those like really bright areas, you're going to be getting 1,000 nits peak brightness, only 3% of the screen but still pretty good. And then in those dark areas, it is pitch black. Now we can't fully show it off on this monitor. It looks a little bit strange, but this one was hand-built, we'll give them a break. Let's go have a look at the one that's properly done. There we go. We've got the 34 inch version, and even though this one's already released, it gives us an idea of how good the final picture quality of that big boy is going to be. Normally in the past you would have to compromise either like picture quality, refresh rate, response times, or one of those, but here you're able to get all of that. It's a 0.0 millisecond graded gray. On something that's this large, it's crazy. The 34 inch comes in at about $1,300 and they don't have final pricing on the 49, but they said it should be under $1,700. Up next, we've got the Gungnir 300R Air Flow and this is so cool. In the past, if you wanted to have a vertical GPU, you know, you can, it looks great, but you're going to be compromising on performance. Here though they have two 60 millimeter fans in the back that draw a bunch of air across your SSD and the back of your GPU when it's vertical. A little 80 millimeter guy here to just aim it sort of where you want it. You also have three 120 millimeter fans in the front, also you can do 140s if you want. And there's enough space up top to do push-pull configs with a radiator. They've really thought through how to properly support your GPU so you can put this little bracket here at any point in that direction or in this direction, that direction like that. And this is eight millimeter thick tempered glass that's been etched, and it looks really quite good, especially with the RGB. Maybe you aren't interested in having a vertical GPU though. MSI has a very easy solution for that. Look, just pops right off. Second one comes in, something like here. Yeah, as easy as that, and now you can have a normal horizontal GPU. Up next we have the Project Zero, and where are the cables for power for your motherboard? Look, you can't see them, and that's because they're actually mounted on the back. We have seen this done before, but MSI is going be releasing the case and the motherboard together so you can have that just ultra-clean setup and not have to worry too much about real compatibility problems. Also, you can sleep a little bit easier the next time that you plug into your graphics card if you get one of their MAG A850GL PCIE gen five. They have these little yellow cables and that means that when you insert it, you just very simply have to make sure that you do not see any of the yellow. I'm sure that you guys heard about, you know, 4090s lighting on fire, bad time. That was mostly because of the user sort of not getting it in quite all the way. This way you just very simply make sure, no yellow, boop, it's all good, your house doesn't burn down. Fantastic, guys. So huge thanks for watching guys. Hit like, get subscribed, and just have a great old day. I'll see you at the next booth.",
    "transcript_keywords": [
        "Magic Spoon",
        "Intel EVO certification",
        "good",
        "MSI",
        "Prestige Studio",
        "Intel EVO",
        "Intel",
        "GPU",
        "thing",
        "Spoon",
        "Computex",
        "EVO certification",
        "Magic",
        "booth at Computex",
        "bad",
        "sort",
        "card",
        "business",
        "guys",
        "back"
    ],
    "transcript_entity_values": [
        "five bucks",
        "Magic Spoon's",
        "99 watt hours",
        "14 grams",
        "IO",
        "Magic Spoon",
        "Thunderbolt",
        "four net grams",
        "Intel",
        "100%",
        "three",
        "only 130",
        "One",
        "Peanut Butter",
        "49",
        "one",
        "USB",
        "1,000",
        "at least nine hours",
        "5120x1440P",
        "only 60",
        "240",
        "Computex 2023",
        "Gen H Series",
        "4060",
        "two 60 millimeter",
        "A little 80 millimeter",
        "4090s",
        "the Project Zero",
        "13th",
        "EVO",
        "13",
        "IO",
        "3,000",
        "1200P",
        "140 watts",
        "Windows",
        "LAN",
        "three years ago",
        "MAG",
        "Second",
        "Macs",
        "zero grams",
        "first",
        "one gram",
        "2560x1600P",
        "NFC",
        "0.0 millisecond",
        "2.5",
        "two years ago",
        "two",
        "1.5 kilograms",
        "MSI",
        "491C",
        "eight millimeter",
        "Cocoa",
        "PCIE",
        "1,700",
        "GPU",
        "34 inch",
        "14 inches",
        "only four to five",
        "only 3%",
        "RGB",
        "three 120 millimeter",
        "about $1,300",
        "SD",
        "Intel Core H",
        "2.1",
        "five",
        "140s",
        "16x10",
        "Jack, HDMI",
        "Oliver",
        "vPro"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "EVENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG"
    ]
}