{
    "id": "aCGAwnGYCEI",
    "title": "iPhone 7 Earpods - Are These Legit?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-08-17T15:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=aCGAwnGYCEI",
    "category": "Science & Technology",
    "tags": [
        "iphone 7",
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "iphone 7 lightning",
        "iphone",
        "lightning earpods",
        "iphone 7 earpods",
        "iphone 7 headphones",
        "headphones",
        "apple",
        "apple iphone",
        "iphone 7 plus",
        "plus",
        "7 plus",
        "smartphone",
        "2016",
        "iphone 6s",
        "iphone 7 review",
        "iphone 7 unboxing",
        "iphone 7 rumors",
        "iphone 7 leaks",
        "iphone 7 concept",
        "iphone 7 hands on",
        "iphone 7 pro",
        "iphone 7 features",
        "iphone 7 official video by apple",
        "apple iphone 7",
        "iphone 7 leaked"
    ],
    "views": 3164407,
    "likes": 50116,
    "comments_count": 7429,
    "description": "(   ) --- Today's Mystery Video -  iPhone 7 Lightning Earpods (USA Link) -  iPhone 7 Lightning Earpods (International) -   I received these \"iPhone 7 EarPods\" from China. After closer examination It's hard to imagine Apple including a set of these lightning EarPods with the iPhone 7 or iPhone 7 Plus. Instead I think Apple will include a lightning to 3.5mm adapter to compensate for the lack of audio minijack. What do you think? Will Apple include lightning EarPods with the iPhone 7, an adapter, wireless headphones, nothing at all? Let me know in the comments.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/Cx31IV0WNNo?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2bzx4gE",
        "http://geni.us/FBMXJs",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "iPhone 7 You heard about it You've seen videos here in fact on Unbox Therapy regarding it Now, the biggest and most controversial development in the world of iPhone 7 talk Is this idea of Apple eliminating the 3.5 mm headphone jack. That's the little audio jack on the bottom of your Iphone that allows you to interact with regular headphones What you would consider to be standard Granted, a lot of people started using wireless headphones for convenience But this next iPhone, the iPhone 7 apparently That jack is no longer gonna exist kinda like this Jack over here I was pretty good the way With the jack And what are we gonna have instead Is it gonna be wireless headphones? Headphones that are in the box to use the lighting port? Or... No headphones at all? Speculation is rampant These are headphones that showed up straight from China Let me show you inside... instead of terminating into a mini jack 3.5 mm connector we have this: a lightning connector. right on the end of what looks like standardized ear-pods now these have shown up on various leaks and rumor sites let's take a look, let's find out if I can just plug these in to a standard iPhone and even get an audio signal on the current software without any kind of third party app I have to admit though they have nailed the kind of earpod design what happens here if I. I'm into the lightning port right now, no third party app Oh, by default, works by default Works right away Im assuming I just stumbled into a banger When youre pluging your phone into a dock or a third party accessory That uses the lighting port to output audio I assume that were using that same pin situation in order to get that audio output to this cable here. Now the question is: Do we have an improvement in sound quality? I think the next obvious thing to do is to playback some tracks over the lightning earpods and then compare that to a standard set of 3.5 mm earpods which I need to go get right now Standard, authentic set of current generation earpods it is time for our test. Okay, standard earpods Wait a second, wait a second something seems off here Beerrrppp Haahaaahaaahaaa haaaahaaaahaa The standard earpods sound WAY better! Way better. (Music on iPhone 7 Earpods) (Music on the standard earpods. noticeably louder, bassier) Here's what I think. I don't think these are legit at all. And if I had to speculate right now, I would suggest the Apple is not going to include a set of lightning earpods in the next iPhone. The headphone jack will be dead. I think its gonna be up to you to pick up either a third party, or maybe an accessory that's official that Apple makes, are a couple of headphone options. A marketing ploy, a marketing strategy, if you will To cause consumers to look at the headphone section of the Apple Store or the website, And think about immediately grabbing an upgrade And spending more per transaction If you're on the street if you're on the subway, on a train, on an airplane you see these things everywhere. Now, if you owned Beats, as well as Apple, You would be saying, \"How can we sell a pair of headphones with every iPhone?\". Here's how, take this out of the box, change the port so that the old ones don't work, And force people to look at lightning options or wireless options. Which of course in the store are going to be dominated by Beats products I think there will be an adapter in the box. There will probably be a lightning to mini jack adapter so you could use old headphones if you wanted to. The real move here is to go with something wireless. There's a lot of great ones out there in fact I've done many videos so go watch those Just cause there is no headphones in the box dosen't mean you need to grab those Beats.",
    "transcript_keywords": [
        "Unbox Therapy",
        "jack",
        "iPhone",
        "headphones",
        "controversial development",
        "Apple",
        "earpods",
        "standard",
        "Unbox",
        "Therapy",
        "Apple eliminating",
        "lightning",
        "headphone jack",
        "standard Granted",
        "fact on Unbox",
        "standard earpods",
        "headphone",
        "party",
        "lightning earpods",
        "port"
    ],
    "transcript_entity_values": [
        "second",
        "I.",
        "a second",
        "Iphone",
        "iPhone 7",
        "iPhone 7",
        "Beerrrppp Haahaaahaaahaaa",
        "Standard",
        "iPhone",
        "China",
        "third",
        "3.5 mm",
        "jack",
        "Apple",
        "Jack",
        "jack adapter",
        "the Apple Store"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "ORDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}