{
    "id": "adD5oC2asXI",
    "title": "Klaxons; What makes them sound like that?",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-11-27T16:07:58Z",
    "video_url": "https://www.youtube.com/watch?v=adD5oC2asXI",
    "category": "Science & Technology",
    "tags": [
        "horns",
        "car horns",
        "automobile horn",
        "klaxon",
        "technology connections",
        "ahooooga",
        "ahooga",
        "awooga"
    ],
    "views": 3116528,
    "likes": 121190,
    "comments_count": 8569,
    "description": "You can support this channel on Patreon! Link below   ahOOOOOga! All aboard the HONK HONK express! We're gonna learn a few things about horns and then probably there will be bloopers or something.  Did you know that there's an assortment of links just below this sentence?  Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   You can support this channel on Patreon! Thanks to contributions from viewers like you, Technology Connections can continue being as weird and unpredictable as it is. If youd like to join the cool people who bring these totally rad videos to you (Im hip and with it!), you can find out how at the link below. Thank you for your consideration!  And thank you to the following patrons!  Mark Christian, Dylan Leblanc, Samuel, Brad Rustvold, Megan Turcotte, LGR, Jeffrey Frasure, kn0tsin, Michael Gooden, David Wulff, Dan Ryan, Max, Fredrik Lindroth, Michael Riegel, Paul Kavanagh, Zane Finley, Isaac Clarke, Sean Hearrell, Christopher Macdonald, Selectric, Adam De Witt, Keithius, Snke Schlter, Julian Haldenby, Seb Bacanu, Mauricio Lara, Hunter Thornsberry, Austin C Borger, Gabe Cook, Anapan, S0N0S, Michael Patron, Sonic Ether, mike quick, Adam, Lucas, microserf, Daniel Kraut, Patrick Williams, Andr Gil da Costa, Paul Han, jacob topkok, Luka Sanzin, Peter Hillier, PeterH, William Holt, Grant Campau, Else, Michael Dunn, Rin, Richard Hicks, Matthew Foulks, Mike Roach, Simon Janssen, Jorge Caballero, Kyle Messner, Mainstream, Matthew Schwartz, gs, ashka, Mr. Yan, Matthias Feist, RedR0ze, adan c, Thomas Fuchs, Alan Holland, Philipp Doppelhofer, Dan Boulden, Simon Hookham, Greg Ros, Phiroze Dalal, Benn Bocinski, Devin Rosenthal, Avalon Hamakei, Ray Hardman, G Cowell, Dan Coulson, Kat Aurelia, Mike Berman, Jack Manning, Chase Tarson, Christopher D'Arpa, Marshall Kurtz, Gabriel Cunha, Magus Dethen, Hurf Durr, shaun morris, David Bell, Miguel Gonzalez, Ed Giardina, Bryce Ontiveros, Kenneth A Cusson, Johnathan Reale, Charles Corbin, Simon Arrow, Brett Walton, Martin Schrder, lakewalk3r, Hayden McAfee, Dan Maku, Mark Injerd, Paul Demers, Stephen P Wilshaw, Daniel M. Hendricks, Vladi Ivanov, Michael Sandler, Jacob Harrington, Gustav Toth, Pete Iacono, Perl the Raven, Clay, Jason Letchworth, Benjamin Deming, Thorbjrn Meyer, Eben, M1GEO, Alan Shieh, Christopher Whyte, Chrno, Jason Bucata, Taylor Smith, Colin Macdonald, Shlomi Borovitz, Krispin Miller, Jan Borcherding, Matthew Castellana, Finn, Sean Anderson, David, Duncan Mulholland, Chaz Serir, Vegas, Jason Downs, Joe Snaza, Lincoln Cole, Deviant Ollam, Dillan Weems, Eldrin_22, Mitch SuperKnot, Andrew Bogard, Cameron McCormick, Craig Guy, Brandon Ryan, Keith Hemenway, Travis Geiselbrecht, Andrew Eslick, Ryan Milke, AARGH!, Marko, splateagle, Ada Cohen, MaikSan, Timothy Miller, Jim Renney, Steve Lafferty, Joseph Mayfield, Noah Dobson, William Astle, Zufalligeule, John Plasket, Don Eitner, Adam Belebczuk, Nick Huwe, Matt, Karol Koziol, Seaghan Sefton, Matt Lawrence, Matthew Krajnak, James Fuhrman, Erik Welander, Mark Majewicz, Logan Shelts, Ryan Dean, Arcanox, Matt Beard, Chad L, Sebastian Mellor, Will Palmer, Steets, Matt, Joel Jauregui, James Alexander, Joon Shin, Phil, Joseph Weiss, Ben Slater, Calvin Walton, Jesse Crawford, Justin Tokke, Ryan Morash, Matt Towers, digit777, Tee Jay, Delliardo, ChasingSol, Eidorian, MsWhit, Jeremy Price, Lydia Saunders, Henry Fitzgerald, Nishith Thakkar, Samuel Colburn, Raphael Wichary, Pykrete_O.Sages, Chris, Evan Langlais, Andyface, Hugo Melchers, ShirleyNeko, R Fisher, Brian Stilson, ColdRamen77, Cameron Lane",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Oh boy, were gonna have a honking good time with this video! INTENSE GRIN Ya know those old-timey car horns? The ones that go ah-oooooga? (that was an amazing impression, was it not?) Ive always wondered why exactly they sound like that. I mean, its a pretty weird noise, isnt it? Theres a strange sort of modulation in the sound that I could never really explain. So I bought one! And were gonna find out! But first, some background. And trivia. Because of course. Thats like this whole channels deal. Car horns. Why have them? Well, cars are dangerous things, and people are stupidly dangerous nearly all the time. And as a means to hopefully quell the stupidity, your car comes with a noisemaking device to serve as a warning signal to other drivers and pedestrians. You can use it to announce your presence in dangerous or ambiguous situations, or you can use it to scare loved ones as they approach your car. It also serves as a way to project anger. In fact thats almost the primary reason we use the horn these days, isnt it? Anyway, because horns need to be loud and cheap, the automotive world has pretty much settled on two basic designs for horns. Theres these guys, and theres these guys. This variety or horn, the disc horn, is essentially just a robust loudspeaker thats tuned to vibrate at a specific frequency. When 12 volts DC power is applied across its terminals, the disc moves in and out, just like the driver cone of a loudspeaker, and the result is a *honk* ing loud noise. Now, in the US anyway, your car only needs to have one of these. And you can tell if your car is in the bare minimum camp because the sound of the horn is a single tone. Like this. BEEP BEEEEP BEEP BEEEEEP If your cars manufacturer has decided to splurge on you and give you a second horn, it will usually be tuned a minor third up or down from the other. Like this. BEEP beep BEEP beep When sounded together, they produce a minor chord which is perhaps more noticeable across a wider variety of situations. Or at least, thats the theory. I think. In any case it sounds better. HONK HOOOONK (and it sounds better) The other style of horn is this style, which I will call Gary. A Gary horn, also known as a trumpet horn, is largely the same thing as our disc horn however the diaphragm sits inside this trumpet-shaped piece. The horn directs the sound out and projects it out the hole, and the most noticeable side-effect of this is that the sound of the horn becomes less harsh. Take a listen. Heres a single-tone disc horn. BEEP BEEEEP Now a Gary horn. toot tooooot (it's more polite-sounding) And now a dual-tone disc. HONK HOOOONK (sounded angry) And now Gary. TOOT TOOOOT (it's not mad, just disappointed) I think we can agree that the Gary horn sounds a little more pleasant. At least, I think it does. Interesting note, if you were simply to alternate between a high-tone horn and a low-tone horn, youd have a pretty good analog for an emergency vehicle siren in whatever countries use sirens that sound like that. Id pick some out but Im sure there would be some nuance or complication Im unaware of and that would annoy enough of you to write comments about it which would annoy me so I wont. So now, what... what is up with these things? Well, I suppose we should set it up so it makes a noise. I'm pretty sure they use a fair bit of current so I better use this car battery that I just have lying ar- AHOOOOOOOOOOGA Holy *honk* this think it loud! Good lord. That is well that is something, isnt it? Now, taking a look at this thing reveals that theres a red plastic horn coming down to some sort of diaphragm. We can shine a light down there and see that theres well a diaphragm of some sort. Huh. Now on the back, this looks an awful lot like a plain ol motor. And, I suppose that would make sense, as after all the way the horn sounds suggests something gets up to speed and then slows down a bit. Fun fact! This sound isnt just associated with old timey cars youd take down to the soda fountain and get yourself an ice cold sarsaparilla. Imagine youre on a boat. But its a special kind of boat. Suddenly, you hear the sound. [AHOOGA] Dive. Dive! [AHOOGA] Dive! Surprise! Youre on a submarine! [ahooging continues in background] All submarines are legally required to have one of these to signal that theyre about to dive. I know this because the movies never lie. OK, so what makes the diaphragm move? The diaphragm needs to move in and out to make a sound--after all that is how sound works. And it appears to be driven by a motor. But how is it moved? And why does it sound so distinctive? Well, through the magic of buying two of them, I have an already-taken-apart one right here. This joke is never gonna get old. [metallic crash and wibble wobble] And, its a lot simpler than at first you might imagine. This is, in effect, a mechanical loudspeaker. The diaphragm is a stamped piece of metal, and theres a little metal nub sticking out on the bottom. That nub engages with these bumpy teeth things on the shaft of the motor. When the motor spins, it forces the diaphragm to move in and out as the bumps on the shaft push out on the bump on the diaphragm. In a sense, the diaphragm just goes for a bumpy ride and [AH-OOOOO-GA] Thats it. Its that simple. Now, I still dont know why exactly the sound is as distinctive as it is. I suspect it has to do with the fact that the diaphragm is flexing, rather than simply moving in and out, and this gives it a unique tonality. Or something. Probably. Kinda like the clicking sound of a bottle cap. That click is still there even when the motor turns slowly, but once it reaches a fast enough speed, we start to hear the true tone of the horn. Then, as the motor slows after you stop honking, the pitch of the horns tone falls, but that clicking noise remains distinctive until it stops. At least thats my guess. Layered sounds can be difficult to decipher, and Im not a proctologist. This device is sometimes referred to as a Klaxon. This was originally a trade name and comes from the Greek Klazo meaning to shriek. I think there just wasnt a Greek work for to ahoog. The horns didnt have to be powered by motors, in fact there could be a hand-crank. Maybe youll have seen that in an old movie or something. But Ill tell you one thing. This is much, much louder than I thought it was going to be. This would certainly be an effective horn should you put one on your vehicle. But should you put one on your vehicle? I mean, Im not gonna say no, but also Im not gonna say yes. Its not quite so easy as just slapping this in where your horn was. Youd probably ... mmm, definitely damage the horn circuit. The best thing to do would be to add another horn button and run a new fused circuit through it to the horn. Trust me, you dont want this to be your cars primary horn. Not only is it tremendously silly, but if you should decide to replace your horns with a relay and run power through it to the horn so that you have indeed replaced your normal horn with one of these, which you should definitely consider not doing, youre gonna draw some major attention to yourself when you lock your car. [brief AHOOG] And, your car alarm will be entirely useless as in the event of a break-in, any would-be do-gooders will simply think your car is diving below the surface. But I have better news! These things are stupid cheap. This was a whole $10. Thats it. This was literally the cheapest horn of the three I featured in this video. Now, how well are these horns gonna work in a year? Probably not at all! In fact, this one doesnt even work all of the time out of the box! Granted, its taken apart right now but you know what I mean. Are you gonna regret buying it? Probably! Will you have a hard time figuring out where to cram this bulky thing into your car? No doubt! But will you enjoy it? Honestly, if you do, well then youre my kinda weirdo. Happy honking! shriekingly smooth jazz So, this concludes No Effort November. Ill be back for Do Things December, but it might be a little while. Ive been procrastinating on finishing the CED series so I still have to write basically all of that video. But! Ill be writing it soon. And who knows. Maybe December will start out with something just as silly as this video was. I mean, I dont *want* it to, but when in doubt, take the silly option. It almost always works. Interesting note! If you were to simply alternate between a high tone horn and a low torn hon ...better use this car battery that I have lying around yeah we need to... We need to set this up beforehand [straining] I think they use a fair bit of current. So I better use this car battery that I have lying ar dammit! So now. So. So now, what is up with this thing? OK, so what makes the diaphragm *overwhelming sound of klaxon* move? The diaphragm need yeah thats not gonna work, thats way too loud. [sound of metal diaphragm against table] I pondered calling this \"Untitled Klaxon Video\" But then I realized that would be a lame duck move. Oh crap it's a goose! Not a duck! I really fowled up that joke HONK",
    "transcript_keywords": [
        "horn",
        "BEEP beep BEEP",
        "car",
        "sound",
        "BEEP beep",
        "Gary horn",
        "diaphragm",
        "horns",
        "BEEP",
        "INTENSE GRIN",
        "Gary horn sounds",
        "BEEP BEEEEP BEEP",
        "car horns",
        "horn sounds",
        "Gary",
        "disc horn",
        "BEEP BEEEEP",
        "thing",
        "honk",
        "cars"
    ],
    "transcript_entity_values": [
        "Greek",
        "third",
        "HOOOONK",
        "two",
        "10",
        "CED",
        "November",
        "12",
        "the Greek Klazo",
        "US",
        "Untitled Klaxon Video",
        "first",
        "one",
        "these days",
        "toot tooooot",
        "DC",
        "December",
        "second",
        "Gary",
        "a year",
        "three"
    ],
    "transcript_entity_types": [
        "NORP",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}