{
    "id": "ADEh9F0Lidc",
    "title": "I Found the Perfect Keyboard",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-09-10T19:31:28Z",
    "video_url": "https://www.youtube.com/watch?v=ADEh9F0Lidc",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "massdrop",
        "ctrl",
        "keyboard",
        "alt",
        "best keyboard",
        "best gaming keyboard",
        "usb-C keyboard",
        "usb-C",
        "hot swappable",
        "switches",
        "Cherry MX",
        "kailh",
        "kaihua",
        "Halo"
    ],
    "views": 2409561,
    "likes": 44560,
    "comments_count": 2592,
    "description": "The CTRL keyboard from massdrop is my perfect mechanical keyboard. Drop here -   The CTRL has it all for me. TKL (87 Keys), Space grey aluminum, hot swappable switches, kaihua, cherry, halo switches, underglow lighting, QMK support  a USB-C connection. This is a killer keyboard for mech enthusiasts.  Background Music: Fili  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://dro.ps/dave2d-ctrl",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going, Dave 2D here. So if you follow my channel, you know that I like mechanical keyboards. Particularly ten keyless mechanical keyboards. So those are the keyboards that don't have the number pad on the side I like my keyboards small and compact and just to have a particular design aesthetic to it. And I've always been looking for that Perfect keyboard that keyboard that I just like everything across the board on it and I think I found it This is the mass drop control keyboard It's a keyboard that mass trap sent out to me to check out and the thing is I get a bunch of keyboards from companies 99% them don't get a video because most keyboards are pretty boring. But this one I Like this one a lot. Okay. There's a bunch of features that make this thing special I'm just kind of gonna go through them real quick It's got a USB C connection instead of your standard micro USB. And it also has USB C pass through it is use PC 2.0 So you can't connect a drive or anything that needs high bandwidth on it The casing is this space grey color, which I think looks awesome It's an aluminum case chamfered edges very well machined, excellent build quality and also has under glow lighting it's a Space Gray version of the K type case and It's a design aesthetic that I think looks good with any kind of setup Like if you have a window set up a really clean Mac setup or if you're a hardcore gamer I think this keyboard looks good in any kind of environment I will say though that some of the earlier depictions of this keyboard like the pre-production Photos had this darker gray color that looked almost matte the final production version is not quite the same as those pictures But I still think it looks really good on the bottom of the keyboard There's space for two feet and these are attached by magnets. I don't love the positioning of them I find that if you move the keyboard laterally like left and right while those feet are installed There's a chance for the magnet to get dislodged. You have to put it back I actually prefer using it without the feet, but for people that want feet that is something to keep in mind You can put them in an either an incline or decline position depending on how you use it but again I don't even use the feet at all for this particular keyboard the best part about this keyboard though is The PCB it has hot swappable switches and what I mean by that is that if you want to ever change the switches on this Keyboard, you just use the included tool pop them out and just put in a new one. See as someone who has spent many hours soldering desoldering resolder ensuite onto very keyboards seeing something like this is such a godsend see a lot of the times when you're working on a keyboard project and this this is something that only Keyboard nerds like myself would understand or appreciate it's like you spend hours just putting the switches onto a new keyboard and you do it because you're just like you want to try those new switches on this particular case and Being able to just remove them and play some a new one on in seconds it Changes the game it makes this whole process so much more enjoyable So if you're interested in mechanical keyboards, and you kind of want to do the whole custom experience This makes it 10 times better And when you order this particular keyboard, you can choose between some cherry switches chi-wai switches and halo switches I really like the chi-wah Silver's but regardless of which one you choose if you ever want to change it in the future It's a 30 second job. The key caps that they're using are some double shot PB T's they're okay They're not like amazing key caps I find them a little bit rougher than I'd like, but they're not bad the stabilizers that they're using They're pretty good. The spacebar has no play at all. Very solid backspace key has a little bit of rattle not much though I also like the lighting on this keyboard so often with gaming keyboards or keyboards that have like really extensive RGB lighting you need to install software from the Manufacturer to be able to play with it. This has it baked into the keyboard You can just switch it through some key combinations and you have very extensive control if you want through Qmk, if you're unfamiliar with qmk keyboard configurations, it gives you some very thorough keyboard configurability So the Massdrop CTRL is obviously not for everyone It's an expensive keyboard regardless of how you look at it If you're just looking for any kind of mechanical then don't get this, right- there's some stuff that's 50, 60 bucks or cheaper But if you're looking for something a little bit higher end and has some cool features, Definitely check this thing out. This is obviously more for the enthusiast crowd, but it just has so much stuff that they did right in a really nice-looking package That's something that just didn't exist on the market until they brought this thing out. I love the color I love the hot swappable switches. It's a good keyboard. Now, this is only available on mass drop and the way they work is it's these time limited Windows of when you can purchase it So if you want to get this if you're interested in this you got to pick up the drop Right now like if you miss it you miss it. You got to wait like months before they make another batch I've missed drops before so if you want it check it out now drop the link down below. Okay, hope you guys enjoyed this video, thumbs if you liked it subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "keyboard",
        "keyboards",
        "mechanical keyboards",
        "switches",
        "Dave",
        "kind",
        "feet",
        "good",
        "USB",
        "Perfect keyboard",
        "mechanical",
        "thing",
        "drop",
        "key",
        "keyless mechanical keyboards",
        "space",
        "good keyboard",
        "qmk keyboard",
        "drop control keyboard",
        "case"
    ],
    "transcript_entity_values": [
        "chi-wai",
        "Windows",
        "60 bucks",
        "Dave",
        "ten",
        "PCB",
        "USB C",
        "like months",
        "99%",
        "standard micro USB",
        "many hours",
        "seconds",
        "two feet",
        "Manufacturer",
        "RGB",
        "50",
        "Qmk",
        "30 second",
        "10",
        "hours",
        "PB"
    ],
    "transcript_entity_types": [
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "TIME",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "TIME",
        "ORG"
    ]
}