{
    "id": "adZcxqgw0Xo",
    "title": "Galaxy S8 Cracked Camera Lens Replacement",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-07-07T16:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=adZcxqgw0Xo",
    "category": "Howto & Style",
    "tags": [
        "Galaxy s8 camera lens",
        "Camera lens replacement",
        "Camera glass fix",
        "Fix",
        "how to",
        "Repair",
        "DIY",
        "Tutorial",
        "Camera",
        "camera repair",
        "replacement",
        "galaxy",
        "s8",
        "samsung",
        "galaxy s8",
        "galaxy s8 plus",
        "repair guide",
        "teardown",
        "android",
        "s8+",
        "disassembly",
        "lens cover"
    ],
    "views": 494475,
    "likes": 12136,
    "comments_count": 683,
    "description": "Galaxy S8 Camera Lens Replacement:  They are cheap enough to get one as a backup, OR to buy two if you are actually attempting this repair and dont want to risk being without a camera lens.   IF YOUR CAMERA STOPS FOCUSING:  Like I mentioned in the video turn the phone camera side down, (facing the floor) And open the camera app. Then sharply tap the screen of the phone with your finger to help dislodge any glass dust that has fallen into the camera unit.  If this still does not work, and your camera has not fixed itself in a few days. You'll need this part:  and this video:  (If removing the black glass overwhelming, you can always take it to a repair shop)  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2sxAwNp",
        "https://goo.gl/vmt83M",
        "https://youtu.be/GRmY-4HKVIk",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "If you have a cracked camera lens on your Galaxy S8, dont worry, it can be replaced on its own for cheap without opening up the phone. And the repair doesnt take very long. It is pretty tricky though, so make sure to watch this video all the way through. Lets get started. [Intro] The exterior protective camera glass for the Galaxy S8 and the Galaxy S8 Plus is the exact same size on both phones. The clear glass has no focusing abilities, its just a little square clear protection. The main thing holding the glass onto the phone is some really strong adhesive. This adhesive can be softened with some high heat. You can use a hair dryer for thisbut since I dont have a hairdryer, a heat gun works just as well. Once the glass is warmed up until its just barely too hot to touch, you can pick your starting point. Mines going to be the center point where the glass is broken. And then try to lift off the camera glass without dropping any glass shards or dust into the camera unit below. The reason you dont want any glass falling inside of the camera unit is because in order for the camera to focus and stabilize, the camera has to physically move, and if glass dust is caught down inside of the unit it will block that movement making the camera unable to function. So, keep the dust and any new glass breakage during this removal to a minimum. Feel free to warm up the glass if the adhesive starts to harden again. After the big chunks are gone make sure to clear that adhesive completely out from inside of that metal ring. If there are any little niblets of adhesive or bits of glass dust, when you press your new lens into place, the new lens will shatter because of that pressure point. Ill use the sticky side of a piece of tape to try to pick up any remaining shards of glass inside the metal frame. And here you can see what I was talking about earlier with how the camera needs to physically move around in order to stabilize itself and focus. A good replacement camera glass took me a long time to find. There are a lot of plastic imitation lenses on the market and nothing works quite as well as glass does, and these bonafide hardware camera lenses are real glass. Ill link these lenses down in the video description. Its not a bad idea to get one as a backup or maybe get two if youre actually attempting this repair on a Galaxy S8 because one might break during the installation. It is glass after all. Make sure there are no fingerprints or dust on the underside of that glass before you plop it down into the little square on that metal frame. Im using a clean cloth to just brush off any prints, and then I can remove the adhesive protection. Then Ill drop the lens into place. Gently situate the glass inside of that metal square. This is where most people will probably break the replacement lens by applying too much pressure. As a side note, even though there is adhesive surrounding that lens, I still wouldnt trust the replacement to be water-resistant. And while that might be slightly disappointing, a cracked camera lens isnt water-resistant either. The little yellow blip you see on the screen is from my Galaxy S8 durability test a while back its not from the camera. It looks like my focus is working and the camera is taking clear pictures. A tip if your camera stops focusing is to open up the camera app, turn the phone camera side down, and do a couple sharp taps on the screen to jiggle any dust out of the camera unit. If that doesnt work and the camera doesnt correct itself after a few days, the camera unit might have gotten damaged during the glass breakage. Replacing the camera unit is also pretty inexpensive, but it does require opening up the phones. Ill link the repair video in the video description if you want to see how that is done. If this video helped you or you thought it was interesting, hit that subscribe button and come hang out with me on Twitter and Instagram. Ive linked all the tools and replacement parts in the video description right below this video. And thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "camera",
        "glass",
        "camera glass",
        "camera unit",
        "Galaxy",
        "adhesive",
        "lens",
        "video",
        "dust",
        "unit",
        "replacement camera glass",
        "glass dust",
        "camera lens",
        "glass inside",
        "Ill",
        "cracked camera lens",
        "inside",
        "protective camera glass",
        "cracked camera",
        "glass breakage"
    ],
    "transcript_entity_values": [
        "a few days",
        "two",
        "the Galaxy S8",
        "a Galaxy S8",
        "Twitter",
        "Galaxy S8",
        "Instagram"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORG"
    ]
}