{
    "id": "AFthdsIcOxw",
    "title": "This Voice is Entirely AI...",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-04-03T23:28:54Z",
    "video_url": "https://www.youtube.com/watch?v=AFthdsIcOxw",
    "category": "Science & Technology",
    "tags": [
        "AI",
        "scary aI",
        "AI Jay Z",
        "MKBHD"
    ],
    "views": 1882208,
    "likes": 80859,
    "comments_count": 4580,
    "description": "I have a theory about this generative AI  The full song:   MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   ~",
    "description_links": [
        "https://youtu.be/y7r6PAkFRfU",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(boxes bouncing) - All right, so I have a theory and I don't know what to call this or if I should name it or anything, but here's my theory. So, the really impressive part about artificial intelligence is that as it gets better and better it feels more and more like human intelligence, right? Which is why we use that word, to the point where it can actually pass for human intelligence, in some cases. Like it passes tests, it solves problems, it finds patterns, it mimics things. And so, it can actually kind of fool you into thinking it's intelligent. And so now we have this generative AI that can be trained on massive data sets and spit out unique outputs that are increasingly impressive. Now to be clear, AI, like artificial intelligences that have been better at humans at some things, that's been around for a while, like that was kind of the point actually. They could comb through large amounts of data and find patterns that humans never would, like literally detect disease in its earliest stage of development better than an actual doctor. So, AI has already been useful, but where it's generative AI that we're talking about where we're asking AI to be creative and come up with new things, new text, new images, new sounds, that's what I'm talking about. That's the scary one. So, my theory, my theory is there are two levels of success of efficiently advanced AI. The first level is when AI-generated content fools you because you weren't paying attention to AI or like looking for AI. So maybe you, like me, saw the Pope photo on your timeline a couple days ago and like just kept scrolling. You just thought, oh, that's a weird picture of the pope. Kind of a cool jacket, I guess. But only when you get told that it's AI and not a real picture does it trigger your skeptical eye and suddenly you're like, oh, that's obviously, not a real picture. There's so many things wrong. The hands look weird, the details are garbled. Of course, it's a fake picture. But the second level of AI-generated content fooling you is when you know you're supposed to be looking at AI and it still fools you. That's when it gets scary. So, we've had a couple examples of the like level one instances like the Pope photo like I mentioned. There have been others floating around, like there was one of like Trump getting arrested even though he didn't. But what's level two? I got an email a couple weeks ago from an artist you may be familiar with Mr. Jay Medeiros, one half of AllttA and Vainsyl and they had a new track that they were working on, which was a collab where he raps alongside Jay-Z, except the Jay-Z voice is not real, it's AI-generated. And they were going back and forth on like how to release this, whether or not they should release it at all. Like I want you to listen to this, like not the whole thing. I'll play a little bit of it for you. You should still go to the source and absolutely watch the original video. I'll link it below. But I just needed to hear this and feel what I felt when I first heard this song. (upbeat music) It's your boy it's your boy Uh yeah Y'all be young They can never become what they aspire to Born in a cell with no one who can inspire you Your highs are was never as high as those that lie to you Pretending that they live in the sky Lying behind your roof Shooting holes up at your ceiling. - So, for those of you who know what Jay-Z sounds like, that was absurd. Like that sounded a lot like Jay-Z to the point where even knowing that I'm listening to AI-generated content, I can still hear it and sort of enjoy it like I'm actually listening to Jay-Z. It's a lot. Now to be clear, Jay Medeiros told me, they wrote those lyrics before the AI tools became available and the tools they used weren't even plug and play perfect. Like there were still lots of layers to it, tweaking things, experimenting with different methods. Apparently words like feeling, and ceiling, and appealing were like hard to get it to rhyme because they'd pronounce it slightly differently. So, they ran it through a bunch of times. But the fact that it's still so good in the final result that's what opens up the can of worms. It's kind of borderline scary knowing how good it actually is. Just knowing that I'm listening to AI and still enjoying it like it's bars by Jay-Z and the cherry on top is that this is the worst this technology will ever be. So, there's examples of level one everywhere like low stakes content where it passes because the audience isn't really looking for AI and it doesn't really matter. Like it's true of a lot of the chatbot stuff too, like chatGPT and Bard and all the others like Bing. They might write an email, you might read an email that seems pretty sincere, but turns out most of it was written by one of those chatbots. And it's kind of fine 'cause it's just an email. But just keep in mind that the goal of all of these technologies is to advance to get to level two. Like the goal of the chatbot, eventually when it gets better is to be able to pass as a human in conversation. What does that mean? And the goal of the the image generator is to be able to produce usable paintings or drawings or whatever like a human. What does that mean? The goal of self-driving cars is to drive alongside other humans on the road. And that's wild. But, that's what they're all working towards. So, is there a solution to this? I mean, the answer really is not yet. It's so new that there is no answer. Some people think regulation, some people think just outright banning it is an option. I don't really believe in that. But, I think what's gonna have to happen is there probably has to be some sort of a parallel development of tools that are specifically designed to detect AI content so that you need to learn to deploy those tools when there's a reason to detect AI. But for now, let's enjoy level one because we won't have just that for much longer. Thanks for watching. Catch you in the next one. Peace (light music) Savage",
    "transcript_keywords": [
        "human intelligence",
        "level",
        "JayZ",
        "things",
        "human",
        "kind",
        "intelligence",
        "content",
        "AIgenerated content",
        "theory",
        "Jay Medeiros",
        "humans",
        "picture",
        "Pope",
        "AIgenerated",
        "goal",
        "email",
        "Pope photo",
        "tools",
        "artificial intelligence"
    ],
    "transcript_entity_values": [
        "AI",
        "second",
        "first",
        "a couple days ago",
        "Trump",
        "a couple weeks ago",
        "Jay-Z.",
        "Jay Medeiros",
        "Bing",
        "one half",
        "Jay-Z",
        "Bard",
        "one",
        "two",
        "the Jay-Z",
        "Vainsyl"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERSON"
    ]
}