{
    "id": "AGbO5tWH_uY",
    "title": "The World's Smallest Drone!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-08-24T17:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=AGbO5tWH_uY",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "smallest drone",
        "worlds smallest drone",
        "worlds smallest",
        "drone",
        "quadcopter",
        "small drone",
        "small quadcopter",
        "rc",
        "cheerson",
        "tiny",
        "tiny drone",
        "best",
        "2016",
        "cool",
        "vs",
        "awesome",
        "awesome inventions",
        "amazing inventions",
        "new inventions",
        "new gadgets",
        "inventions",
        "futuristic",
        "cool gadgets",
        "invention",
        "products",
        "innovation",
        "things",
        "amazing",
        "new technology",
        "future",
        "cool inventions",
        "best drone"
    ],
    "views": 5625926,
    "likes": 85666,
    "comments_count": 8163,
    "description": "(   ) --- Today's Mystery Video -  Cheerson Smallest Drone (USA Link) -  Cheerson Smallest Drone (International) -   This little drone (quadcopter) claims to be the World's Smallest Drone. It has a rechargeable battery and fits into its tiny controller for transport or storage. If you've never tried one of these tiny quadcopters I highly recommend it!   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/qPlRZaSKbPY?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2buY4wW",
        "http://geni.us/D9quCO",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "A while ago I did a video on a little miniature drone; it was orange. It was a lot like this one. At the time, they were calling it \"the world's smallest drone\". Today I've got the new \"world's smallest drone\": CX-Stars. You can see it's 14 plus, you know there are moving parts, with propellers, don't slice your eyeball. It is available in a couple different colors. A big drone is pretty smart, you know with the sensors and what not, but these guys here, this is a good way to train. Because if you crash this little thing, well, what's the consequence really? You're not going to take out a power line, ruin a family's barbeque, if you know what I'm saying. Look you can see a reflection of Jack there. Whoo ho ho! That is tiny. This little thing fits inside, gives you a place to store it so that these two components aren't left apart, but when you want to charge this up you're looking at this little USB connector. HOLY that's tiny. Got a couple of analog thumbsticks here. Oh yeah, also drone people are freaking out in the comments right now going, \"IT'S NOT A DRONE, IT'S NOT A DRONE, LEW.\" Ok, fine, yeah cool it's a quadcopter, alright, fine. The world seems to refer to anything with four rotors as a drone, alright, so let's just chill out with our terminology here. Drone sounds a million times better alright? There's my rant on drones and droning. You don't want to run it into your TV. Can you see that, Jack? That's not what you want to do, unless you're one of these destruction people and that somehow gets you off. Okay so that has juice, look, blinking juice. This guy does not because this guy requires AAA's. Duracell! You're not sponsoring me yet, it's a gadget channel. Wouldn't it make sense? Listen, you guys need the market share. Everything is rechargeable these days. This is your big opportunity, Duracell. Whoa, did Duracell just get a bunny as well? That was an Energizer thing! Did they rip off the bunny? They got their own weird-looking bunny! The Energizer Bunny and Elmo had a child, you got the Duracell bunny! This surgeon is using a flashlight inside the flashlight of batteries from Duracell. [Ding Ding Ding] Got some juice here... [Loud beeping] Whoa! Eeeeyeah... Whoa! Easy boy! Whop... yes! Come on hover... WHOO! BAH! BAH! Inevitable. Yea ok. NO! WHOA, I HIT IT! I HIT THAT LENS! THAT WAS UNINTENTIONAL! Let me get a shot of the [inaudible] over there. Come on, you can do this. Find that hover zone. There you go. There you go! Gonna go on a trip and it's gonna come back home. I did a land... [gibberish] did it! What can I say? Look how cute that is. How can you not like that? If you have no experience at all with quadcopters, you get one of these little things I don't even know how much it costs. I'll put the link in the description, but it's like 30 bucks? Something in that neighborhood? And all of a sudden you're flying! Know what I mean? Take a look at it. I think you're not going to regret it. It's a lot of fun. These things are fun, that's the bottom line.",
    "transcript_keywords": [
        "drone",
        "world smallest drone",
        "Duracell",
        "miniature drone",
        "smallest drone",
        "bunny",
        "Whoa",
        "world smallest",
        "world",
        "thing",
        "alright",
        "Jack",
        "orange",
        "BAH",
        "juice",
        "Duracell bunny",
        "ago",
        "video",
        "miniature",
        "smallest"
    ],
    "transcript_entity_values": [
        "two",
        "14",
        "AAA",
        "these days",
        "Elmo",
        "USB",
        "Ding Ding Ding",
        "Whoo ho ho",
        "four",
        "30 bucks",
        "Eeeeyeah",
        "Duracell",
        "LEW",
        "million",
        "Jack",
        "one"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}