{
    "id": "aHKqhRjRkbE",
    "title": "ASUS Zephyrus - The Perfect Gaming Laptop?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-06-29T17:06:01Z",
    "video_url": "https://www.youtube.com/watch?v=aHKqhRjRkbE",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Asus",
        "Zephyrus",
        "Zenbook Pro",
        "Best Gaming Laptop",
        "Thin Gaming Laptop",
        "Most Powerful Gaming laptop",
        "thinnest laptop",
        "gaming notebook",
        "Acer",
        "Triton"
    ],
    "views": 5850091,
    "likes": 77863,
    "comments_count": 4552,
    "description": "Asus Zephyrus Review - The best gaming laptop experience using Nvidia Max-Q Design. Thin, Powerful and Quiet! Asus Zephyrus -   More info about Nvidia Max-Q -   This laptop was provided by Nvidia. Opinions are my own. This video was made in collaboration with Nvidia.  Music Credits: Background: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2u2ELlf",
        "https://www.nvidia.com/en-us/geforce/products/10series/laptops/max-q/",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2d here? so this is a laptop with Nvidia's new Max-Q design specifically the Asus GX501 and well here's thing for years ever since like gaming laptops existed people have been trying to find that perfect balance between power and portability and honestly It doesn't really exist because when you have a gaming laptop it's usually thick or Loud or thick and loud until now Nvidia's Max-Q approach is an approach to building a laptop That's thin and quiet and powerful Basically they're building the perfect laptop so everything from the GPU to the drivers to the thermal components the electrical components Everything is geared towards this Max-Q approach And it's essentially all about efficiency So first let's talk about the GPU it's a GTX 1080 chip it has all the cuda Cores all the memory But it's clocked slower They've reduced the clock speed a bit before this Max-Q approach But the trade-off is a very nice reduction in power consumption so in terms of total wattage a regular GTX 1080 laptop will pull maybe 250 260 Watts under full load this laptop pulls 171 Watts Under Full Load And that's like a 90 watt difference which means smaller AC adapters for portability and less heat output and when you have less heat to deal with you can make your laptops thinner your fans don't need to work as hard and on the Asus Zephyrus the bottom actually opens up when you lift the screen which allows for better air flow Now this machine is running some very early drivers But I'm just curious to see how we do for benchmarks the Max-Q design Zephyrus is about 13 to 15 percent slower than a regular laptop GTX 1080 which is around what I expected and it's about 10 Maybe 12 percent faster than a GTX 1070 laptop So it kind of sits between the two in terms of just broad performance But the thing is the fans on this laptop are super quiet in comparison to anything else on this chart It's so weird to see this kind of performance in something this quiet Now I wanted to focus on Nvidia's Max-Q design for this video But because I've been using this for a while I thought I'd give it kind of like a mini review The build quality is really good. It's a premium asus device I think it's the best-looking laptop that asus has ever made there's lots of brushed aluminum Great materials with just a hint of gamer DNA. It doesn't have any like red racing striped and stuff. It has a solid port selection for a 15-inch laptop, but there's no SD slot if you're looking for one. The nvme drive inside is really fast its upgradable But it's not easy to open it up. The thermals are comfortable when playing games But Max-Q does limit the thermal output automatically. The configuration of the top deck here is obviously a little bit different They've shifted the keyboard down for better component, airflow. It has customizable backlighting and the keys have pretty short travel It's very chickity I am comfortable gaming on it But I don't think it's ideal for typing a ton of stuff. Now because it's positioned so close to the bottom of the keyboard asus Includes a wrist rest. I didn't find it useful I mean, I found it comfortable enough to use without but everyone's Gonna be a little bit different the trackpad/keypad I find it super cool switches between the two it uses windows precision drivers with good tracking and when it's a number-Pad mode it's Very accurate it's obviously positioned a little weird being on the side, but I got used to it quickly I am right-handed though. The speakers are pretty nice and because of how quiet the system is even under load you can totally rely on them for games. It houses a 50 watt hour battery underneath the keyboard and battery life is short I'm getting three hours of battery life with my regular test, but that's just the nature of a thin and light high performance laptop There's no more room in there for a bigger battery So I played a lot of games on the Zephyrus and it just crushes them at 1080p With the G-Sync panel games look super smooth at 120 Hertz. It's just a very enjoyable gaming experience almost every single First-person shooter is going to play really well in this system Open-World games tend to be a bit more demanding, but even those play pretty well You won't be able to hit 120 frames per second on every Open-World game at Max graphics But if you reduce it to high the screen can show off that sweet refresh rate again. Video editing is also awesome on this laptop. A lot of laptops with high-end CPUs and high-end GPUs can be loud in premiere because that's just the way video editing is it's CPU intensive its GPU intensive, but with a Max- Q laptop It's quiet But you still get kick-ass performance. The other thing is that the zephyrs is low-key enough to use in a library or a coffee shop If you want to go out there and you want to play some games no one would bat an eye these laptops are so quiet and unassuming The Max-Q approach to laptop design obviously isn't for everyone Some people don't care about how thin their laptops are. Some people don't care about how loud the fans are. They just want pure performance and for those people the full fat GTX 1080 laptops a little bit thick but those will deliver great performance better performance than this But if you're looking for thin and light and powerful and quiet Nvidia Max Q delivers. This thing is seriously laptop dream material.",
    "transcript_keywords": [
        "laptop",
        "MaxQ",
        "MaxQ approach",
        "Asus",
        "laptops",
        "GTX",
        "regular laptop GTX",
        "Nvidia MaxQ",
        "quiet Nvidia Max",
        "Nvidia MaxQ approach",
        "quiet",
        "performance",
        "Nvidia MaxQ design",
        "MaxQ design",
        "Asus Zephyrus",
        "MaxQ design Zephyrus",
        "keyboard asus Includes",
        "Dave",
        "Nvidia",
        "games"
    ],
    "transcript_entity_values": [
        "Asus GX501",
        "Zephyrus",
        "90 watt",
        "Dave",
        "Hertz",
        "CPU",
        "GPU",
        "years",
        "asus",
        "GTX 1080",
        "AC",
        "three hours",
        "First",
        "Maybe 12 percent",
        "second",
        "15-inch",
        "GTX 1070",
        "GTX",
        "SD",
        "the Asus Zephyrus",
        "a ton",
        "120",
        "Watts",
        "about 10",
        "two",
        "50 watt hour",
        "first",
        "cuda Cores",
        "Zephyrus",
        "1080",
        "about 13",
        "Max",
        "250",
        "Nvidia Max",
        "Nvidia"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "PERCENT",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG"
    ]
}