{
    "id": "AHR80l7od2Q",
    "title": "Building a $100,000 PC for Minecraft",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-22T18:51:44Z",
    "video_url": "https://www.youtube.com/watch?v=AHR80l7od2Q",
    "category": "Science & Technology",
    "tags": [
        "Karl Jacobs",
        "Custom PC",
        "PC Desk",
        "Minecraft",
        "Gaming",
        "GPU",
        "RGB",
        "Karl",
        "Jacobs",
        "Gamer",
        "Intel",
        "FlexiSpot",
        "Desk",
        "Expensive",
        "Build",
        "Fortnite",
        "Watercooled"
    ],
    "views": 7550743,
    "likes": 238533,
    "comments_count": 9267,
    "description": "Thanks to FlexiSpot for sponsoring this video! FlexiSpots Brand Day Sale event is on now until May 25th! Use the code \"LINUS50\" to get the best price of the year. Don't miss out! US:  CA:  UK:  DE:   Karl Jacobs reached out to us with the wild idea to build a $100,000 gaming PC so he could beat Minecraft on it.... And I have to say... We hecking delivered.  Discuss on the forum:   Buy an Intel Core i9-1300KS CPU:  Buy an ASUS ROG Strix GeForce RTX 4090 OC GPU:  Buy G.Skill Trident Z5 RGB 2x32GB 6000MHz RAM:  Buy an EVGA Z790 Dark K|NGP|n Motherboard:  Buy a Genelec 8341A SAM Studio Monitor:  Buy a Genelec 7360A Subwoofer:  Buy a SeaSonic SPX-70 PSU:  Buy a Samsung 980 Pro NVMe M.2 SSD w/ Heatsink:  Check out EK's Cooling Solutions:  Buy an ASUS ROG Swift PG42UQ 41.5\" Gaming Monitor:  Buy an ASUS ROG Swift PG32UQR 32\" Gaming Monitor:  Buy a RME Fireface UCX II 40-Channel USB Interface:  Buy a pair of Sennheiser HD 800 S Headphones:  Buy an Electro-Voice RE20 Microphone:  Buy a Sony Alpha ZV-E10 Camera:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:56 $100,000 PC?? 2:03 The Components 2:48 The Chassis 4:37 The Checklist 5:08 The Sound System 6:38 The Desk Legs 7:41 Aesthetics Check 8:11 Power Supply 9:25 Specs 10:15 The Cooling 12:56 How good is it at playing Minecraft? 14:12 The Displays 15:12 Streaming Peripherals 16:33 Warranty & Support 17:12 Outro",
    "description_links": [
        "https://bit.ly/43vHOmf",
        "https://bit.ly/41tGejc",
        "https://bit.ly/3MJfuan",
        "https://bit.ly/3MdRtGI",
        "https://linustechtips.com/topic/1508582-building-a-100000-pc-for-minecraft/",
        "https://geni.us/sZVW",
        "https://geni.us/FmIU",
        "https://geni.us/6t6wT4",
        "https://geni.us/E5v3",
        "https://lmg.gg/doA4U",
        "https://lmg.gg/IqOrz",
        "https://geni.us/mKprnt1",
        "https://lmg.gg/D9T8i",
        "https://lmg.gg/QTVGe",
        "https://geni.us/rhdBb",
        "https://geni.us/OmsBXW",
        "https://lmg.gg/6qFGc",
        "https://geni.us/TIBOMxZ",
        "https://lmg.gg/npmMf",
        "https://geni.us/6nH8",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "Karl Jacobs, a Minecraft YouTuber with more money than brains reached out to us because he wanted to beat Minecraft on a $100,000 PC. I can't help him beat Minecraft, but I could sure as shoot build a $100,000 PC. It took six months and our bill actually ended up exceeding the $100,000 payment we received from Karl, but I'm extremely proud of the product our team delivered. This desk PC is an ode to opulence, a portrait of prosperity, a ballad to the bourgeoisie. You guys get the point. It looks fricking awesome, but beyond the looks, every single detail of this build was meticulously thought out and executed. Let's have a closer look at our sponsor. Huge shout out FlexiSpot for sponsoring this video. We decided on their E7 desk legs and if you stick around, you're gonna learn more about the build and see just how much weight these legs can support. Karl was very particular that the PC needed to cost $100,000. The only problem with that is that gaming computers, even fancy ones, don't cost $100,000. Now we could just cheat and build a server with a bunch of 30 terabyte Kioxia SSDs, or we could build an AI workstation with half a dozen GPUs in it and then just as many terabytes of RAM. But the thing is that none of those things would make it any better for playing Minecraft. In fact, it would probably be worse. Now Minecraft does technically support SLI, as does Nvidia's workstation line of GPUs. So if we could toss four of those into a computer, that would eat up a lot of our budget. But when I tested out Quad SLI on the Camino Grando RM, it was a mixed bag to say the least. We tripled our FPS in Rise of the Tomb Raider, but the frame times were so bad and inconsistent, the experience was actually worse. And when I tried to run Shadow of the Tomb Raider, the system blue screen so hard, I needed to completely reinstall Windows. So for components then, we just picked the fastest gaming stuff that exists. A Core i9-13900KS, RTX 4090, 64 gigs of DDR5 memory, and a premium Z790 motherboard from EVGA, all of which came to $5,000. That's it? $5,000? How are we gonna spend the rest of the money? By building something to put those parts in that is so damn expensive it will blow your mind. And what better way to show off a top of the line PC like this one than a desk PC? And it kind of makes sense, right? Like furniture's crazy expensive. Like look at this thing. You can't even put a computer in it. What a rip off. So with that solved, we had a new set of challenges to overcome. We were very concerned about our fancy desks surviving the 5,000 kilometer journey to Karl. We didn't want another PewDiePie situation. Linus, I need tech support. But what if we could kill two birds with one stone by creating a desk that is both absurdly expensive and also nearly impossible for FedEx to destroy? But don't try. By milling it out of a single solid block of aluminum. Now designing something like that is a lot of work. So I assigned it to Alex, who also decided that it was too much work, and assigned Gary to hire a new employee. Meet Tim. I spent the next two months of my life staring at SolidWorks and coordinating with our machinist Amish to design a computer desk that feels like you're sitting in a tie fighter. And more importantly, is possible to machine. We decided against doing it out of a single block of aluminum because if there are internal stresses in the stock, the whole thing could banana when we take it off of the mill. And also because if we break it into three pieces, Amish would be able to get extra fancy with the machining using his five axis mill. Many, many, many revisions later, we were ready to start machining. The desk was machined by SS CADCAM in Squamish, and over four weeks, Amish's machines removed a total of 1,075.2 pounds of aluminum. Don't worry, it's all getting recycled. Leaving us with possibly the most beautiful computer case ever made. Make sure to get subscribed, by the way, because we're gonna have a full build video for this bad boy coming out soon. It was just way too much for one video. What all are you even doing over here? No! Now, when you order from a boutique system builder, the computer comes with a checklist where they verified that everything was working as intended. For instance, this one came with the Origin we recently made a video on. And because we here at Linus Tech Tips strive for the utmost in professionalism, we have created our own checklist that will be filled out by myself, the CEO, and will be included in the package so that Karl can trust that we have tested everything that is interesting to show in a video. Starting with the sound system. In total, $12,000 was spent ensuring that the auditory experience of this PC could blow the doors off of Karl's streaming room with incredibly accurate sound. To achieve this, we've used two Genelec 8341A three-way point source studio monitors. Now, normal speakers look a little something like this. We've got our woofer, and we've got our tweeter here and here. But the distance between these two can actually cause minute phase problems. Well, not on the Genelecs. Here, the tweeter, the mid, and the woofer all come from exactly the same spot, which in theory improves imaging. But what these can't do is play really low notes, which is why we've also included the 7360A subwoofer. This should be able to faithfully recreate 20 hertz, which is widely considered to be the lowest note that humans can hear. Oh, we're getting some harmonics in there. Weird. Oh, that's Minecraft. And pass. Next up, Genelec claims that this system should be able to reach 110 decibels without distortion. So to verify. We're at 98. That's pretty good. Whoa, that's really loud. We settled on FlexiSpot's E7 as the base of our project for two reasons. One, obviously we wanna stick with the best of the best for this project. And two, we needed something that was capable of holding up all this weight, since these legs can support up to 355 pounds. As you can see here, within the actual weight limit, it has no issues, but in this case, we underestimated just how much our end product would weigh. Our PC desk ended up being about 380 pounds. So it needs a little bit of help adjusting the height since we're pushing it to its limits. But unless you have a 370 pound plus desk at home, it shouldn't be an issue. It's built with a thicker, solid carbon steel frame to make it extra durable and extra sturdy. Like check this out. You guys are right up there? Which is really important when your desk weighs as much as this one does, or actually just really important in general so your monitor doesn't wobble while you're typing. The E7 also features a convenient built-in USB charging port that allows you to charge your phone or tablet while you work. And what else can I say? You're welcome, Karl. Since we're here, we can verify that the KJ on the wings is still beautiful. Oh, and that the sides make that satisfying ping. It's like music to my ears. Glass top, still immaculate. And if you're wondering why it cost over $11,000, I need point you only at the etching on the back, the chamfered edges to make sure that Karl doesn't cut himself, and these fine cutouts for our monitor arms. This kind of thing ain't easy, but Hopewell Works did a great job, and I think Lloyd and Sarah did a fantastic job with the design too. Since we're back here, by the way, one thing that I'd recommend, Karl, is that you ensure you have at least two power circuits for this PC because it consumes a lot of power. To deliver all of it, there are a total of four power supplies. This Seasonic SPX750 handles power to the motherboard and the CPU. This second SPX750 delivers power to your RTX 4090 GPU and the pumps on this side of the desk. And then over on the right side of the table, we've got the power supply for the standing desk. And on the left, we have a dedicated power supply for the RGB lighting. This is because in addition to all the typical gamer RGB that we've included, we've thrown in five Astera Helios tubes at $800 a pop. These are filming grade lights that deliver both the brightness and color accuracy that you would expect from such a thing. No gaming grade RGB could ever hope to come close. And what's really cool is that they're controlled through Bluetooth so you can use your phone. Just make sure that you pair your phone to the three that are inside the desk before you put the glass panel on top. All four power supplies working. Finally, for our physical, let's just ensure that the power button works. Feels like nuclear launch, not Minecraft. We're mostly in here to talk about how our memory has an XMP profile of 6,000 megatransfers per second, but we ended up having to slightly slow it down to 5,600. Since then, it's been rock solid. You might lose one or two FPS, but given how many you already get, I don't think that's going to be an issue. Let's go ahead and fire up Windows. Okay, latest BIOS install. Now we're gonna have to verify some of the hardware here. Karl, the password is Roblox. Oh yeah, I can use the mousepad. Oh my God. Please tell me we're sending this to him. Now that we're in here, we just need to verify that the specs are as our customer ordered, which basically just means the absolute best. Yes, yes. Two terabytes of Samsung 980 Pro. Mm-hmm, mm-hmm. Another two terabytes. Seems pretty good. Ooh, Nvidia RTX 4090, courtesy of Asus, their Strix model. Looking very RGB in there. And what you're probably wondering at this point is, how on earth are we cooling all that stuff? Ah, fear not, for inside this computer is one of the best and most complicated loops ever created. To make sure that a frame is never dropped in Minecraft, we have a total of six radiators, six pumps, and three fluidically separate loops. On the right, we have three radiators and two pumps that are dedicated just to cooling the CPU. And the same goes for the GPU over here on the left. Did I mention that the pumps are gold plated? Now, it's pretty rare that you would have a task that would hit both the CPU and the GPU equally. Playing a game would mostly be on the GPU side, while rendering a video out might be all on the CPU. So, if the water in one side were to get more than five degrees hotter than the other, our third loop would activate in the middle. EK custom made this gold-plated heat exchanger that pumps water across the tubes for both the CPU and GPU loops to equilibrate the temperatures of the CPU and GPU cooling water. How effective is it? Well, to find out, we grabbed the MainGear MG1, thank you, from ShortCircuit, that despite having nearly the same components, automotive paint and a custom front panel costs $93,900 less than Karl's PC. To compare the cooling solutions of each machine, we fired up Prime95 and FurMark simultaneously. And if you just looked at the CPU temperatures, you might come to the wrong conclusion. Our MainGear MG1 topped out at 80 degrees on the CPU, while Karl's desk got all the way up to 89. This isn't a problem though, because the desk was able to sustain a power bill inflating 310 watts on the CPU continuously. Even after 30 minutes of FurMark, the, I wasn't gonna drop it. Oh, I dropped that. Well, even after 30 minutes of FurMark, the RTX 4090 in here only reached 57 degrees. That is a massive 28 degrees lower than the MainGear. And this one, the front panel won't even fall off like that. Solid, ow. Unfortunately though, performance doesn't scale in nearly with power draw. So even though our cooling allows Karl's CPU to draw 47% more power than the MainGear, it's Cinebench score is only 5.4% higher. And in 3DMark, the desk was only able to pull off a 3.9% higher score. So Karl's desk is faster than a high-end prebuilt, but we are certainly seeing diminishing returns at this point. The real test though, of course, is how good it is at playing Minecraft. Okay, are we doing Java edition? No one plays Bedrock, Linus. Maybe we wanted to test RTX. I don't know. Wow, that looks fricking awesome. God, that looks good. Like shadow doesn't just look like dark light. It looks like shade. You're using 13 gigabytes of RAM running Minecraft? Press escape. No, I won't. No, like we can make it more beautiful. I don't think anything could look better than what I already saw. Not even my own children. Do they have path traced lighting on them? I'm sorry, did my memory usage just hit 35 gigabytes? Oh my God. This is running on a 4090. It looks absolutely magnificent though. My kingdom Simba. Everything the light touches can be yours. Oh no, elephant graveyard. Minecraft, so beautiful. It brings a tear to your eye. Pass. And we would fire up something else, but one of the requirements was that no game other than Minecraft can ever have been played on it. I might play Forza on it later though. Alex, for Minecraft to look this incredible, the computer not only has to be good, but so does the monitor. Here for the main screen, we've got the Asus Strix PG42UQ, a 4K, 135 Hertz, 41 and a half inch monitor that basically spanks pretty much everything else in existence. Our display guru from the lab did a quick and dirty calibration on it. And here are the settings that he found were best. And with a measured Delta E of just 1.49, this thing is more than good enough for gaming, more than color accurate enough for professional work. Now, normally going with an OLED display means a drop in brightness, but thanks to a massive heat sink on the back, we actually verified that this thing can sustain 700 nits of brightness on 10% of the screen. Meaning that HDR content is gonna look properly HDR on here. Then, I mean, these are no pleb tier side monitors. Each of these is a PG32UQR capable of 144 Hertz at 4K resolution. Now they're not quite as magnificent as the main display, but they're color accurate and more than good enough for discord, stream monitoring and completing the ultimate battle station look. Now we didn't fully calibrate all of the monitors, but we did ensure that the white balance and gamma were matched between the three, because that's the most important thing for making sure that your multi monitor setup looks matched. Now we've already made sure that the speakers work well, but we need to check out the rest of the streaming peripherals. For an audio interface, we went with the Fireface UCX2, which delivers such a clean sound that it'll make nearly any set of half decent headphones sound incredible. But when you connect it to the Sennheiser HD 800 S, you get sound so good that the menu music in Minecraft is gonna make you emotional. Now we weren't 100% sure how quiet Karl's streaming space was. So hopefully it's not too loud because these headphones are open back. So any ambient sounds go straight through them. We also included an Electra Voice RE20 microphone and a Sony ZV-E10 camera to act as a webcam. How do they compare to one of the best webcam mic combos in a laptop? Well, not very close. What won't be included though is the mouse and keyboard. And I would like to explain why, because that was a call that I made. What, me? I didn't make that call. They were too personal. Ah, too personal, that makes sense. The last thing then is to have a little chat about warranty and support. This desk comes with literally none of that. I don't wanna say who, but there have been creators in the past that we've made PCs for, and then people in our office become their personal troubleshooters for a couple of months, something we will not be doing again. Many of the components in here were graciously sent free of charge, like the RTX 4090, power supplies, CPU, even that absolutely amazing work of art distribution plate from EK Water Blocks. But it also means there's absolutely zero warranty if something breaks. So you will just have to go out and buy a new one. We'd also recommend getting a good multimeter, sold separately. Since troubleshooting any of the wiring in here is going to be non-trivial if something goes wrong. A final bit of laying down the law. Dear Saudi princes, this desk is one of one and we will never build another. And in the future, any clients are going to have to pay for engineering time since having Tim work on this for two months, more than two months. He has other stuff to do. With all that said, we hope you love it, Karl. An extraordinary amount of effort was put into making this literally the best over the top gaming system to ever exist. And I think Tim, Amish, Alex. I did a thing. Hope well works. Everyone involved did an utterly phenomenal job. Have fun beating Minecraft on it. Overall, I'm super happy with the way this collaboration turned out. Our members have been using the E7 legs for a while now and have been thoroughly impressed with their remarkable stability. And I'm sure Karl will be as well. It really is astonishing how little shaking there is when you're, even when you're typing while standing. Their unique embedded junction and solid built carbon steel desk frame make it rock solid. And what's really cool is that even though our creation weighed too much for the E7, FlexiSpot later released the Odin E7 Q legs that can support up to 440 pounds. We weren't able to switch out the legs at the last second since the PC desk chassis was custom made for the E7s, but we're going to be keeping the Odin legs in mind for any future heavy builds. The E7 comes with a cable management board and cable ties to keep your workspace tidy. It's easy to assemble and can be set up in minutes. And with its sleek and modern design, the E7 is a perfect addition to any home, office setting, or wildly expensive PC desk. Don't miss FlexiSpot's brand day sale event from May 23rd to May 25th. You can get up to 60% off and use code Linus50 to get an additional $50 off your purchase of $500 or more. Plus you can try your luck at winning one of the free orders they're giving away during these days. Check them out at the link in the video description. If you guys enjoyed this video, maybe check out the last time we made an over the top PC for a rich person, the Pyramid PC for dbrand.",
    "transcript_keywords": [
        "Karl",
        "desk",
        "Karl Jacobs",
        "Minecraft",
        "CPU",
        "Karl desk",
        "power",
        "make",
        "beat Minecraft",
        "thing",
        "Karl CPU",
        "good",
        "build",
        "GPU",
        "RTX",
        "video",
        "Minecraft YouTuber",
        "work",
        "made",
        "computer"
    ],
    "transcript_entity_values": [
        "Quad SLI",
        "one",
        "hertz",
        "only 5.4%",
        "SolidWorks",
        "20",
        "SPX750",
        "MainGear",
        "41 and a half inch",
        "One",
        "RGB",
        "Java",
        "zero",
        "10%",
        "EVGA",
        "GPU",
        "30 terabyte",
        "Two terabytes",
        "Simba",
        "AI",
        "over $11,000",
        "Amish",
        "64",
        "Cinebench",
        "more than five degrees",
        "6,000",
        "two months",
        "three",
        "a couple of months",
        "100,000",
        "SLI",
        "93,900",
        "Linus",
        "Karl",
        "Minecraft YouTuber",
        "135",
        "half",
        "E7",
        "700",
        "13 gigabytes",
        "Strix",
        "MG1",
        "Hertz",
        "Lloyd and Sarah",
        "an additional $50",
        "28 degrees",
        "Glass",
        "355 pounds",
        "440 pounds",
        "Squamish",
        "Origin",
        "four weeks",
        "Sennheiser HD 800 S",
        "half a dozen",
        "XMP",
        "35 gigabytes",
        "Amish",
        "4",
        "Linus Tech Tips",
        "Genelec",
        "at least two",
        "7360A",
        "CPU",
        "Fireface",
        "Bedrock",
        "Minecraft",
        "six",
        "110 decibels",
        "Karl Jacobs",
        "third",
        "98",
        "FedEx",
        "E7",
        "Gary",
        "Minecraft",
        "Sony",
        "Hopewell Works",
        "the next two months",
        "1.49",
        "Astera Helios",
        "Windows",
        "four",
        "DDR5",
        "up to 60%",
        "minutes",
        "370 pound",
        "KJ",
        "Odin",
        "89",
        "5,000",
        "ShortCircuit",
        "FurMark",
        "Alex",
        "five",
        "310 watts",
        "FlexiSpot",
        "3.9%",
        "57 degrees",
        "100%",
        "Genelec",
        "30 minutes",
        "E7",
        "May 23rd to May 25th",
        "Shadow",
        "two",
        "these days",
        "1,075.2 pounds",
        "more than two months",
        "second",
        "Pyramid",
        "Asus",
        "the Asus Strix PG42UQ",
        "CADCAM",
        "EK Water Blocks",
        "Saudi",
        "Genelecs",
        "4090",
        "Samsung 980 Pro",
        "Electra Voice RE20",
        "Forza",
        "RAM",
        "Z790",
        "six months",
        "8341A",
        "just as many terabytes",
        "Tim",
        "PewDiePie",
        "80 degrees",
        "Minecraft",
        "500",
        "Nvidia",
        "E7s",
        "47%",
        "USB",
        "5,000 kilometer",
        "12,000",
        "5,600",
        "144",
        "about 380 pounds",
        "Odin E7 Q",
        "800"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORG",
        "MONEY",
        "NORP",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "FAC",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY"
    ]
}