{
    "id": "aHucI-oRxFA",
    "title": "The LG G8 Can See Your Blood, But Doesn't Stir The Heart",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-02-24T18:45:44Z",
    "video_url": "https://www.youtube.com/watch?v=aHucI-oRxFA",
    "category": "Science & Technology",
    "tags": [
        "lg g8 review",
        "lg g8 hands on",
        "lg g8 thinq",
        "lg g8",
        "hands free smartphone",
        "smartphones",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 270100,
    "likes": 8116,
    "comments_count": 1083,
    "description": "LG is the phone company that tries new things. It popularized the ultra-wide-angle camera; it offered replaceable batteries when others had phased them out; it even made a whole line of phones for YouTubers. So I shouldnt be surprised that LG built a phone that works on weird wizard magic. But I kind of am. And I kind of think it was a mistake.   [SPONSOR]  This video is sponsored by Qualcomm. To learn more about Snapdragon 855, visit:    [SUBSCRIBE TO MRMOBILE]     [LINKS]  LG G8 [Android Central]:    [ABOUT MRMOBILE'S LG G8 HANDS-ON]  MrMobile's LG G8 Hands-On was produced following two hours with an LG G8 review device at a press briefing prior to #MWC19. Preproduction device running pre-release software.   [MUSIC]  Stir Crazy by Tonemassif, available at Premium Beat:   \"You Know U Iz\" by GG Riggs, available at Premium Beat:     [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #lgg8 #g8 #smartphones #thinq #lgg8thinq",
    "description_links": [
        "https://www.qualcomm.com/products/snapdragon-855-mobile-platform",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/lg-g8-preview",
        "https://www.premiumbeat.com/royalty-free-tracks/stir-crazy",
        "https://www.premiumbeat.com/royalty-free-tracks/you-know-u-iz",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] This video is sponsored by Qualcomm. LG is the phone company that tries new things. It's the company addicted to the ultra wide angle camera. It offered replaceable batteries when others has phased them out. It even made a whole line of phones for, well basically, for YouTubers. So I shouldn't be surprised that LG built a phone that works on weird wizard magic, but I kinda am, and I kinda think it was a mistake. (upbeat music) Of the five or six new smartphones I've seen this month, the LG G8's design is the most forgettable. I had similar criticisms about the Galaxy S10 and the latest round of iPhones, but Samsung and Apple started from a better fit and finish to begin with. The G8 just continues a trend LG started with the G7. Big notch, chin, wide radius corners. It's a 2018 phone for 2019. That is until you fire up its new feature. Alongside the front-facing camera is a time of flight sensor array called the Z camera and it's very good at discerning how far away something is. Now, if you think that should make for better portrait selfies, you're right. But another way cooler thing it can do is scan your veins. See, the hemoglobin in your blood reflects infrared light. So when the Z camera shines its IR beacon at your palm, it can recognize the way your veins are laid out and use that to authenticate you. LG calls it Hand ID, and if you think it looks like a weird way to interact with your phone, well tell 'em, Bachman-Turner Overdrive. You ain't seen nothin' yet See, as you may have figured out, if the Z camera can see your blood, it can also see your hand very well. So LG came up with a way to use your phone without touching it called Air Motion. You can launch an app, skip a song, or change the volume entirely with hand gestures. Before I talk about the several ways this really doesn't work, I want to say that I was using a pre-production phone, so it probably will improve before release. And also, I do appreciate LG actually trying to solve a problem here. You've been there, shaving or washing dishes, you want to change the volume or skip a song without getting your phone wet, and Hand ID addresses one of the biggest criticisms of rear-mounted fingerprint sensors, like to one on the G8. They're useless when the phone is on a table. So kudos to LG for trying something new. But even the greatest idea loses its luster when the execution is this awkward. First of all, Hand ID needs your palm to be specifically placed. And the steering cues it gives you to line you up, well, they're usually blocked by your hand. The Air Motion interface is better because it's at the top of the screen. You hold your hand over the Z Camera, wait for the little bar to pop up and then you kind of scoop up a fistful of invisible spaghetti to call up the menu. The UI is pretty cool. You get this graphical representation of how your phone sees your hand and it is super fun to twist an invisible knob in mid-air to change the volume on a YouTube video. People say a lot of things remind them of Minority Report, but this is as close as I've ever gotten. But it's finicky. You get stuck in the volume mode when you want it to pause. Or it loses sight of your hand. Or you turn it one way and sometimes the volume goes the other. Sometimes it doesn't even activate until the third or fourth time you try the pasta pull. Yeah, practice makes perfect, but you shouldn't have to do this much work. I'm almost like 30% proficient. (cackling) Samsung's Galaxy S4 had a similar feature back in 2013. You could scroll websites, slide photos, accept calls with gestures. It was much faster, it was much simpler. And you know what? I still never used it because it's a gimmick. Folks, just touch the screen. If you get shaving cream on if, so what? It's waterproof. All right, let's use that as a segway to the good stuff before we wrap it up. Making the G8 more waterproof was LGs stated intention for removing the earphone. See, there's no grill up there. Instead, there's a piece of electric actuator that vibrates the whole OLED panel so the display serves as the speaker. Outside in city noise and wind, I could still hear callers clearly, even on speakerphone. Also, the boombox feature I liked from the G7 has been retained. So you put the phone on a hard surface and it will be louder than most. The display is beautiful and very bright under its Gorilla Glass 5 cover. While Gorilla Glass 6 on the back means you can charge wirelessly. The rest of the spec sheet from the silicon to the wireless charging to the battery size is in line with what you'd expect. And if you've been following LG phones, you will also expect the bonus for the headphone jack and hi-fi quad deck. Go ahead and celebrate, audio gang. For more optically focused folks, the standard LG duo of wide and ultra wide cameras is accounted for, too. In the past, that ultra wide camera alone would have me jazzed to spend a week with the latest LG. But now, Huawei, Asus and Samsung are doing it, too, and bringing more features to boot. When you see the competition also bringing the same or better specs and universally, if only slightly more interesting designs, all the G8 has to help it standout at first glance are two gimmicks that U can't see myself ever using. So I think the G8 will need a competitive price point to stand out in 2019, but exact pricing and availability remain TBD. Subscribe to The Mr. Mobile on YouTube so you don't miss my full review when it lands, folks. And if you want to hear about the 5G LG phone I wasn't even allowed to photograph, stay tuned after a word from my sponsor. This video is brought to you by Qualcomm and the Snapdragon elite gaming experience. Part of the Qualcomm Snapdragon 855 mobile platform, you'll be able to play even the most demanding games more smoothly, even in true HDR. You'll get cinematic color grading, filmic tone mapping, physically based rendering, and custom algorithms designed to reduce dropped frames by 90%. What's all that mean? Better, badder and faster gaming going forward. With new 5G and 60 gigahertz wifi support, making multiplayer a breeze. The Snapdragon elite gaming experience only on Qualcomm Snapdragon. So 5G fans, that 5G phone I teased is the LG V50 and it's basically a bigger G8 with a third camera, round pack and a larger display, larger battery, and big vapor chamber to cool that 5G radio. This would seem to be the phone teased last summer as an exclusive to Sprint, at least at first. Looks like we should expect it sometime in the first half of the year. Let me know in the comments what you think about LGs latest offerings. I'd love to hear from fans and skeptics alike. Until next time, thanks for watching and stay mobile, my friends. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "Hand",
        "camera",
        "Qualcomm Snapdragon",
        "Snapdragon",
        "Qualcomm",
        "volume",
        "wide",
        "Air Motion",
        "change the volume",
        "phone company",
        "ultra wide",
        "Gorilla Glass",
        "wide angle camera",
        "ultra wide cameras",
        "phones",
        "Snapdragon elite gaming",
        "Snapdragon elite",
        "Samsung",
        "wide cameras"
    ],
    "transcript_entity_values": [
        "Galaxy S4",
        "Huawei",
        "Minority Report",
        "First",
        "IR",
        "third",
        "iPhones",
        "this month",
        "LGs",
        "Qualcomm",
        "S10",
        "Samsung",
        "2013",
        "Apple",
        "a week",
        "2018",
        "YouTube",
        "OLED",
        "Air Motion",
        "the first half of the year",
        "Mobile",
        "Snapdragon",
        "first",
        "five",
        "jack",
        "Asus",
        "G8",
        "two",
        "UI",
        "Bachman-Turner Overdrive",
        "last summer",
        "G7",
        "six",
        "YouTubers",
        "LG G8's",
        "5",
        "2019",
        "fourth",
        "Snapdragon",
        "LG",
        "almost like 30%",
        "90%",
        "60 gigahertz",
        "one",
        "Sprint",
        "the Z Camera"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}