{
    "id": "aKxelKMR3SI",
    "title": "My god, it's full of CORES...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-11-09T03:36:18Z",
    "video_url": "https://www.youtube.com/watch?v=aKxelKMR3SI",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "AMD",
        "EPYC",
        "AMD EPYC",
        "Genoa",
        "Bergamo",
        "96 cores",
        "128 Cores",
        "CPU",
        "processor",
        "enthusiast",
        "best AMD CPU",
        "best Intel CPU",
        "Alder Lake",
        "Ryzen",
        "Ryzen 6000",
        "Ryzen 6950X"
    ],
    "views": 709527,
    "likes": 37931,
    "comments_count": 1294,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code techlinked at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 help 0:06 EPYC Bergamo 128-core CPU 1:03 Apple Silicon 3nm 2:04 Pixel 3 charging sucks 2:54 Vessi Footwear 3:28 QUICK BITS 3:35 Nintendo Switch 2 coming...eventually 4:18 Win7, 8.1 OneDrive support ending 4:46 Wind and solar energy r good? 5:18 Walmart driverless deliveries 5:43 McDonald's uses IBM AI  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  They're Just Movies podcast:",
    "description_links": [
        "https://www.vessi.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/HDtD5",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/TheyreJustMovies"
    ],
    "transcript": "- Tech news makes me feel fuzzy inside. It's not normal. I need a doctor. - [Man] Help. - Help me. As part of its status center event today, AMD announced plans to launch a new EPYC processor with code name Bergamo. Packed with a 128 cores in total. Which is just selfish. Some people don't have any cores at all. - [Man] Come on. - But these chips won't be powering your gaming rig. They're geared more towards data center, cloud computing with special power efficiency and scaling features. True to the leaks, AMD is also going to be launching a Genoa. Genoa, Genoa, Genoa. I'm pretty sure it's Genoa, isn't it? - [Man] Genoa. - Genoa, CPU with 96 cores. Which is obviously nothing to sneeze at. Man, I've been sneezing all day, but I can't sneeze at that one. - [Man] You can't sneeze on demand. - That should be out next year. With the beefy 128 core model appearing around late 2022 or early 2023. Meanwhile, gamers are stuck scrounging for extra cores in the dirt like an animal. Heartless. - [Man] Help them. - Although we just got a couple of new chips from Apple for the new lineup of MacBook Pros, a new report indicates that Apple will be launching its own 3 nanometer chips sometime in 2023. How fitting. This is a big deal. Considering Apple's current leading edge chips are built on a five nanometer process. And this year is M1 Max and M1 Pro have already shown relatively impressive performance. Despite the fact that the CPU cores aren't very much different from the M1 they replaced. Using a smaller process means that Apple may pack as many as four dyes and a total of 40 cores onto just one chip. The size of an M1 chips. Oh yeah, that's gonna be rough. The iPhone is also expected to move on to the 3 nanometer process by 2023, leaving 2 nanometers for those gamers scrounging in the dirt to try and find something. Anything. - [Man] Who are gamers? - The gamers. - [Man] Help them. - Think of the gamers. Thanks Apple. Good luck guys. Good luck. - [Man] Tim help. - Tim Apple doesn't care about you. He never cared. And did you notice your new Pixel 6 isn't charging as quickly as you expected. you aren't alone. As testing performed by Android authority has shown that the Pixel 6 isn't using the full potential at Google's own 30 watt charger, which isn't even included in the box. And sells separately for 25 bucks. They make you buy a charger and then make it suck? To be clear, even topping out at 22 watts. The phone does indeed get from zero to 50% charge in about half an hour, consistent with Google's advertising. But after that power delivery drops precipitously. And it takes nearly two hours to go from 0 to 100. Google hasn't yet commented. Presumably because the only thing they could actually say would be, \"Oh (beep) you found that?\" (man giggles) - [Man] We thought we hid it. - The three whole watts. - [Man] You want another phone? - Now it's time for Quick Bits, brought to you by Vessi Footwear. Known for being lightweight, comfortable, and most importantly waterproof. They just released their Everyday Move shoes featuring enhanced breathability and added support. Perfect for the adventurous or those looking for something sportier. (man laughs) - With a heel pull tab, vegan suede lace cages, extra mid-sole cushioning, and the same waterproof Diamond Tex Technology, you'll want to wear them everywhere. Keep your feet dry and save 25 bucks off with our offer code techlinked at Vessi.com/techlinked. You have made it to the Quick Bits. Congratulations, wanderer. - [Man] I'm so thirsty. - We might finally have some kind of answers as to why we didn't get that rumored SwitchPro this year and instead settled for a model with an OLED screen and not much else. It did have a kickstand. It's a better kickstand. - [Man] I love that kickstand. - Nintendo has said that the global chip shortage is slowing its hardware development. Like they need any global chip shortage to slow their hardware development. Nintendo. But has also confirmed it is working on new hardware. So don't worry. The company assures you the Switch 2 will come out sometime before the year 2100. - [Man] My kids will love that. - Yeah, maybe they'll... Yeah. Maybe they'll do the Hanafuda cards again, or maybe love hotels. That was the thing that Nintendo did. Did you know that? - [Man] We'll get into different businesses? - Yeah. If you're still running Windows 7, 8 or 8.1 and use Microsoft OneDrive cloud storage service, be advised that OneDrive for those operating systems will stop syncing with the cloud in March of next year. You can still do this through a web browser, but you can also pull carrots out of the ground with your teeth. It's just nicer to cook them in a stew or something, you know. - [Man] Boil 'em, mash 'em. - Stop punishing yourselves. - [Man] Put them in a stew. - Boil 'em, mash 'em, stick 'em in a stew. - [Man] Nasty taters. - A new study published in Nature Communications indicates that renewable energy sources might be more feasible for providing large scale power than previously thought. The paper indicates that 85% of the United States energy consumption could be handled by wind and solar only. Once the other 15% is made up of earth and water power legend says Captain Planet will appear. - [Man] And kill us all. - Well you forgot heart. - Is that actually- - Yeah, it's earth wind, water, fire, heart - [Man] I should have made an Avatar joke. Oops. - Walmart has officially begun using driverless trucks to deliver packages. The service is currently only available in Bentonville Arkansas, where a Walmart is headquartered. And runs between a fulfillment center in a Walmart branded grocery store. The move has sadly run all of the mom and pop driverless truck businesses out of town. - [Man] We've been doing this for 40 years. - That's just how Walmart rolls. - [Man] 100 years and now this. And from the in case you missed it file. McDonald's and IBM have announced a partnership to further McDonald's foray into AI powered order taking at drive-throughs. As if order taking at drive-throughs wasn't already arduous enough. The golden arches tested it earlier this year in a few locations in Chicago. And while it did make things faster, human employees did have to intervene a little too often. So McDonald's is hoping IBM can help cut down on the error rate as screaming into a drive-through speaker is already annoying enough without having to convince an AI, not to take your job too. - [Man] I can drive that better than you. - Hello, welcome to McDonald's. I see your job is driverless car driver. (man laughs) And now it's time for them to take my job as the video host, because the video is over. Come back on Wednesday for more tech news and seek medical attention for any abnormal feelings of fuzziness in your abdomen. - [Man] Out. - It's happening again.",
    "transcript_keywords": [
        "feel fuzzy inside",
        "Genoa",
        "fuzzy inside",
        "feel fuzzy",
        "Apple",
        "cores",
        "year",
        "chips",
        "yeah",
        "gamers",
        "Walmart",
        "Quick Bits",
        "chip",
        "power",
        "McDonald",
        "Google",
        "AMD",
        "center",
        "nanometer",
        "move"
    ],
    "transcript_entity_values": [
        "MacBook Pros",
        "the year 2100",
        "Tim Apple",
        "25 bucks",
        "the Switch 2",
        "8.1",
        "2023",
        "all day",
        "three",
        "Bentonville",
        "EPYC",
        "M1 Pro",
        "40",
        "as many as four",
        "one",
        "8",
        "IBM",
        "iPhone",
        "2023",
        "Genoa",
        "Google",
        "nearly two hours",
        "earlier this year",
        "Vessi Footwear",
        "this year",
        "100",
        "Avatar",
        "3 nanometer",
        "Everyday Move",
        "AI",
        "Nintendo",
        "M1 Max",
        "McDonald's",
        "next year",
        "Pixel 6",
        "30 watt",
        "Bergamo",
        "0 to",
        "Walmart",
        "Arkansas",
        "McDonald",
        "Quick Bits",
        "128",
        "96",
        "Chicago",
        "Windows 7",
        "85%",
        "United States",
        "AMD",
        "2 nanometers",
        "M1",
        "Captain Planet",
        "March of next year",
        "40 years",
        "Android",
        "Diamond Tex Technology",
        "Wednesday",
        "100 years",
        "around late 2022",
        "Hanafuda",
        "22 watts",
        "50%",
        "SwitchPro",
        "five nanometer",
        "CPU",
        "about half an hour",
        "the Quick Bits",
        "Nature Communications",
        "OneDrive",
        "15%",
        "early 2023",
        "Apple",
        "today",
        "zero"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "EVENT",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "PERCENT",
        "GPE",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}