{
    "id": "aMKgWMO3fu8",
    "title": "Google Pixel Buds (2020) review: mic test included",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-04-27T16:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=aMKgWMO3fu8",
    "category": "Science & Technology",
    "tags": [
        "pixel buds",
        "google pixel buds",
        "pixel buds 2",
        "pixel buds review",
        "google pixel buds review",
        "pixel buds 2020",
        "2020",
        "google pixel buds 2020",
        "earbuds",
        "headphones",
        "wireless headphones",
        "airpods",
        "jabra elite",
        "samsung galaxy buds",
        "galaxy buds",
        "new pixel buds",
        "pixel buds vs airpods",
        "pixel buds vs galaxy buds",
        "google buds",
        "buds",
        "earphones",
        "wireless earbuds",
        "pixel buds google",
        "google",
        "review",
        "hands on",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 766498,
    "likes": 19390,
    "comments_count": 1530,
    "description": "With Googles new Pixel Buds, there is one thing we didnt know all of our other earbuds were missing  a completely hands-free Google Assistant built in. While they have their flaws, they are available starting today, in clearly white, for $179 with Almost Black, Quite Mint and Oh so Orange coming later says Google.   Read the full review here:   Listen to Beccas playlist here:   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:   Buy the new Pixel Buds at Best Buy:   Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/2YbKGpY",
        "https://spoti.fi/35dPtbU",
        "http://bit.ly/2TQsqjB",
        "https://shop-links.co/1705106245247848472",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Alright buds, let's talk buds. (chuckles) I had to do it, I just had to do it, it was too easy. (futuristic music) Wireless earbuds are the piece of tech I use only second to my phone, the absolute most. And you know the feeling of when you forget your headphones at home. It's the worst, it's like the worst. From phone calls to music, they keep me entertained and connected while on the go. And the good ones, they do it without feeling like extra bulk. Now while the Google Buds two have there flaws, there is one thing that I didn't realize that all of my other wireless earbuds were missing. A hands free Google Assistant available to you at all times. Grab some popcorn, for you and me both, let's get into it. (futuristic music) Pixel Buds two are a speech bubble shaped, in ear bud, with a flexible in ear arc thing coming off the top, that are available starting today in clearly white for 179 dollars with almost black, white mint, and also orange coming later, says Google. I am not sure what later means but hopefully they're quicker than Microsoft has been with launching the surface earbuds. The buds pop into the oval matte case with a magnetic click. And that pop of opening and closing the case. (opening and closing clicks) Like I'm a sucker for a good click, but like this is some quality click. Ooh, wow. In terms of design, these buds feel solid, they look great, and they don't come out even when taking of a sweatshirt, or biking, or dancing, or even chewing. They are truly not moving. And they are IPX4 water resistant, so you can feel safe wearing them in light rain or while working out. Overall it's a huge improvement from the last Pixel Buds. Ya'll that cord thing. I don't have any words for that. Bad, bad, bad's the word. These buds fit really securely in your ear. But, that comes with a cost. See this like, pointy, arc thing? Well, it looks like a thorn and after about hour three of wearing these, it feels like a thorn. And I was wishing it was a little softer, and more of an arc, kind of like on the Galaxy buds. But let's get right into sound quality. Pixel Buds two have 12 ml drivers that provide really good audio quality. I've been jamming to everything from the pop funk of Still Woozy to the EDM of Flume and that acoustic goodness of Ben Howard. I even sprinkled in some Frank Sinatra in there and I found these buds can produce a sound much bigger than I expected, with good separation of the highs and the lows. I put together all the songs that I've been listening to while testing these in a playlist and I'll link that down below. But Amy Winehouse's Valerie, and more specifically the live lounge version. If you listen to the song on these buds you can really tune in to the shaker at the top or that baseline, or her vocals. The point being that it doesn't get like mushed together in this like garbled kinda mess. It keeps everything really separate. And then there's music from like Bleachers that is like really big and loud and these buds can handle that too. The only downfall tho, they don't have that real thick bass. And there's no EQ settings for that in there app either. So if you're looking for that real big bass, this ain't it. There's also no active noise cancellation to block outside noise. For this price point that isn't a feature I totally expected. And if you've worn in ear headphones before, these block out sound in the same way by physically blocking your ear canal. The vent works really well on these though so your ear doesn't feel like it's being suctioned. There is also a feature called adaptive sound. Google claims the Pixel Buds two can optimize volume levels based on the environment around you. I felt this working on my bike rides the most. I never once had to adjust the volume no matter if more traffic was coming or I entered a quiet street. Oh I can't wait to test them against a real loud subway screach. I kinda miss that, ew. I'm like missing the sound of a screaching subway? This is reaching new levels. There are those typical bluetooth connectivity issues. And I really hate how this is still a problem. Like a few times my buds dropped out and then would reconnect a few seconds later, but overall I was able to leave my phone in the back of the apartment and walk freely without losing connection. I didn't notice a lag when watching videos on my phone or Macbook either, but I did notice there's this sort of white noise that happens for a few seconds after you stop playing something. And I only heard it when it was really quiet. But, it's there. Alright, come on down, here we go. What you knew I would absolutely be doing today, and that's a mic test. Today's contenders, we have the Airpod Pro's, we have the Galaxy Buds Plus, we have the Jabra Elite 75Ts, and then of course the Google Pixel Buds two. We're starting with the gold standard of headphone microphones, and those are the Airpod Pro's. And next we have the Galaxy Buds Plus. The first generation of these was not so hot in the microphone department, but they definitely upped their game in the second gen. Alright, coming to you live, from the Pixel Buds two, here we are. This is this is the uh, this is uh, this is the uh, this is how they should sound. How do they sound? Alright, these are the Jabra 75Ts, they also came out this year and there known to have really great sound quality. But how does there mic sound? Can you hear me? Although you can here me really clearly on the Pixel Buds two, they definitely sound the most compressed out of all of these. And I think the Airpod Pros remain the gold standard. The Pixel Bud 2's charge via USB-C or wirelessly, and Google claims the buds can get around five hours of music listening time and two point five hours of talk time on a single charge. In my use with adaptive sound turned on and lots of music playback, and of course lots of hands free Google Assistant use, I was averaging closer to like three point five hours off a full charge, which is definitely on the lower end of battery life. Compared to the Jabra 75T's that get around seven point five hours, and especially compared to the Galaxy Buds Plus that boast a whopping 11 hours of battery life. The Pixel Buds Case gets you another 24 hours of listening time and around 12 hours of talk time. And a ten minute charge in the case will give you about two hours of additional listening time. Pixel Buds have there own app that is very minimal, and it includes a find your device feature, adaptive sound, in ear detection toggles, and touch control settings. Play pause with a single tap, double tap to skip a track, triple tap to go to the previous track, and then my favorite gesture is swiping forward to raise the volume and back to lower. I know that my co-worker Chris Welch found these controls to be a little finicky. I mean you really have to nail the placement of your finger. But it wasn't an issue for me and I just love being able to control the volume so easily without having to touch my phone. Which brings me to why these buds are really important. Cut the music, cut the music. Friends, we have to talk about two things. Number one, how well these work with Android, and number two, how friggin incredible it is to have Google Assistant always at your beckoning call. First things first, pairing. Setting these buds up on an Android device is so easy. As soon as you open the case a prop pops up that walks you through pairing, naming, and even downloading their app. The whole process took me under a minute, and it's a total breeze. And second, coming from a Google connected world I already live in, I'm so use to just shouting commands to the assistant without having to touch anything. So on the go I was setting alarms, answering text messages, changing the song, changing the playlist, even turning on my lights while I was on my bike rolling up to my house, all without touching a single thing. Now there are other headphones that allow you to hold down a button or click a button to access the Google Assistant, but with these you just say the magic command and the headphones respond. With the Pixel Buds two, Google is finally improving the hardware enough that you enjoy using the software. Yo again I gotta say it, R.I.P that cord. Thanks god, see you never. Now these do feel somewhat first gen to me. I mean this thorn, it's a killer. The battery life, it's a killer. But, those are all problems that a next generation can fix, and I think Google is finally on to something with these Pixel Buds. (clicking sounds) It's good while it lasted.",
    "transcript_keywords": [
        "Pixel Buds",
        "buds",
        "Google Pixel Buds",
        "Galaxy buds",
        "Pixel",
        "Google",
        "Pixel Buds Case",
        "Google Assistant",
        "sound",
        "Pixel Bud",
        "Google Buds",
        "free Google Assistant",
        "hours",
        "Google Pixel",
        "ear",
        "Assistant",
        "bud",
        "ear bud",
        "Galaxy",
        "music"
    ],
    "transcript_entity_values": [
        "two point five hours",
        "Today",
        "number two",
        "IPX4",
        "Android",
        "one",
        "the Google Pixel Buds",
        "three",
        "Jabra Elite 75Ts",
        "around five hours",
        "today",
        "Yo",
        "the Airpod Pro's",
        "the EDM of Flume",
        "Amy Winehouse's",
        "Google",
        "the Pixel Buds",
        "the Galaxy Buds Plus",
        "75Ts",
        "ten minute",
        "Frank Sinatra",
        "Ben Howard",
        "Valerie",
        "The Pixel Bud 2's",
        "about two",
        "two",
        "Galaxy",
        "Pixel Buds",
        "a few seconds later",
        "Jabra",
        "Chris Welch",
        "this year",
        "USB-C",
        "about hour",
        "179 dollars",
        "second",
        "Microsoft",
        "first",
        "11 hours",
        "seven point five hours",
        "about two hours",
        "three point five hours",
        "around 12 hours",
        "under a minute",
        "R.I.P",
        "Macbook",
        "another 24 hours",
        "First",
        "12 ml",
        "a few seconds"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "CARDINAL",
        "LAW",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "TIME",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "TIME",
        "TIME",
        "TIME",
        "TIME",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "TIME",
        "ORDINAL",
        "QUANTITY",
        "TIME"
    ]
}