{
    "id": "ANPtqTNLAY4",
    "title": "Hacking is not a crime. A real world story.",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-06-17T14:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=ANPtqTNLAY4",
    "category": "Science & Technology",
    "tags": [
        "hack",
        "hacks",
        "hacker",
        "darknet diaries",
        "cyber",
        "infosec",
        "hacker movie",
        "hacker vs scammer",
        "hacker video",
        "hacking",
        "cyber crime",
        "pentest",
        "pentesting",
        "darknet",
        "ethical hacker",
        "how to hack",
        "ethical hacking",
        "ethical hacking course",
        "cyber security",
        "ethical hacking career",
        "kali linux",
        "white hat hacker",
        "ethical hacker course",
        "hacker stories",
        "hacker story",
        "alberto hill uruguay",
        "uruguay",
        "bug bounty",
        "bug bounty hunting",
        "bug bounty hunter",
        "bitcoin",
        "hak5",
        "hak5 pineapple",
        "hak5 rubber ducky"
    ],
    "views": 47763,
    "likes": 1914,
    "comments_count": 168,
    "description": "A cautionary tale: An Ethical hacker jailed for reporting a serious vulnerability. It is very unfortunate how being ethical can still result in jail time. This is one of those stories. Be very cautious and careful with your skills.  Darknet Dairies:   // MENU // 00:00 - Hacking is Not a Crime 00:43 - Introduction//Alberto Hill 01:04 - 12 Years Old & Hacking Games 03:18 - University & Computer Forensics 05:05 - Bug Bounty Before Bug Bounties Were a Thing 06:31 - Uruguay//No Bug Bounty 07:50 - 2014//Where It All Began 12:22 - 2015//No Systems Hardening 15:07 - Was It Ethical?  18:41 - 2017//Raided & Arrested 21:07 - Bitcoin Ransom 22:41 - Why Did They Arrest Alberto? 25:12 - Did They Prosecute the Other Person?  26:40 - Confiscated//Hacking Equipment 27:44 - Why So Many Credit Cards? 29:58 - How Much Crypto Did Alberto Lose? 31:00 - Why Did They Release Alberto? 34:34 - Are the Charges Ongoing? 35:08 - The Real Cost 37:19 - Universities Don't Teach You How to Handle This 41:47 - Follow Your Dreams//Why Alberto Shares His Story 44:13 - Hacking is Part of Alberto 46:16 - Community Work As an Alternative 48:03 - Thank You & Final Thoughts  Card video mentioned:   // Alberto BOOKS // Login to Hell:  Operatin Bitcoins:   // Alberto SOCIAL // Twitter:  LinkedIn:  Linktree:  Hacking is not a crime:   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube Main Channel:   YouTube Tech Channel:  YouTube Clips Channel:  YouTube Shorts Channel:  Apple Podcast:  Spotify Podcast:    // MY STUFF //   // BUY HAK5 Goodness // Hak5:   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  hack hacks hacker darknet diaries cyber infosec hacker movie hacker vs scammer hacker video bug bounty hacking hak5 hak5 rubber ducky hak5 wifi pineapple cyber crime bitcoin cryptocurrency crypto ethereum pentest pentesting darknet ethical hacker how to hack ethical hacking ethical hacking course cyber security ethical hacking career kali linux white hat hacker ethical hacker course ethical hacking for beginners hacker stories hacker story alberto hill uruguay uruguay  Disclaimer: This video is for educational purposes only.   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    #hack #hak5 #kalilinux",
    "description_links": [
        "https://darknetdiaries.com/episode/25/",
        "https://youtu.be/eyd24FlJCFg",
        "https://amzn.to/3Qm4y2d",
        "https://amzn.to/39EwBcq",
        "https://twitter.com/adanielhill",
        "https://www.linkedin.com/in/nofear75/",
        "https://linktr.ee/adanielhill",
        "https://twitter.com/hacknotcrime",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://youtube.com/channel/UCZTIRrENWr_rjVoA7BcUE_A",
        "https://www.youtube.com/channel/UCbY5wGxQgIiAeMdNkW5wM6Q",
        "https://www.youtube.com/channel/UCEyCubIF0e8MYi1jkgVepKg",
        "https://davidbombal.wiki/applepodcast",
        "https://open.spotify.com/show/3f6k6gERfuriI96efWWLQQ",
        "https://www.amazon.com/shop/davidbombal",
        "https://davidbombal.wiki/gethak5"
    ],
    "transcript": "- Also in the photo, you had like a writer, so you could write credit cards yeah? - Yeah. - You lost millions of dollars by reporting this and you went to jail for, was it nine months? - Eight months and a fraction, yeah. Probably close to nine months. - Everyone should be like, thanking you, but that's not what happened, is that right? - The fact that I did what I consider was the right thing to do, for me, was more than enough. I learned nothing about security except how to hack the system from the University. Just kidding. (both laugh) - I think it's important that we raise the profile that hacking isn't a crime. (rock music) - Hey everyone, it's David Bombal back with a very special guest from South America. Alberto, welcome. - Hello, how are you, David? - Very good, how are you? Welcome. - I'm doing great, thank you. - [David] So you're based in Uruguay and you, if I understand correctly, were the first hacker to be imprisoned in Uruguay for so-called crimes, yeah? - That's right, that's correct. I was the one. - So let's go back, I heard on an interview that you started hacking when you were very young, is that right? - That's right. And actually, I will try to... Do you see up there? - [David] Yep. - It's a Sinclair Spectrum+, 48 kilobytes of RAM. And it has a device that was connected to the standard adaptor, and with a button, you produce an interruption on the processor. You created an int, and basically process the CPU, and you could see all the contents of the memory in assembler, and I started learning assembler, playing with that. - Sorry, how old, how old were you when you did this? - Yeah, I was 12 year old. - 12 year old and you were doing assembly then? Wow. - That's right, yeah. I learned, for example, since I was six years, okay. You can lower the registry with the common LD, the name of the register, A for example, comma and a number. So, if a game has six lives, I could try to find LDA comma 6, okay. Whenever I found something like that, I modified the 6 and I put 10, instead of the 6. While other children of my age were playing soccer in the street, I was basically hacking computer games. For me, the most amazing part was that when I first found this kind of things that I could do, I submitted them to a Spanish magazine that was called Micro Mania, that was covering video games in that time. That magazine was published in Spain, then was sent to Argentina and then came to Uruguay. And, we're talking about 35 years ago, after the magazine was published, I had to wait about a year, a year and a half to have that publication here in Uruguay. And one day, my mother went and buy a copy of magazine. And when I open it, I saw my name in the magazine, saw that, my submission. It was like, wow, I can't believe it. I mean, they published this in this magazine? It was for a child, like, I don't know. It's better than getting Santa Claus gift in Christmas. I mean, it was amazing. That was basically, my beginning in this hacking world. Yeah, and after that, well, many things happen in my life. I have a degree on computer sciences. I'm a computer engineer. I have to tell you, University, I learned nothing about security except how to hack the systems from the University. Just kidding. (laughing) I started university in 1994, and in those years, security was not at all considered as part of the career in any part. The closest thing to that was systems auditory, that was, in the last year of the career, you learned about how did systems. So, then my first job was as a computer forensics examiner for a criminal case in Uruguay regarding child pornography. And well, it was in 2004. Then I had to learn myself a lot of things regarding forensics. I mean, it was something that I took really seriously because the result of what you do will affect the life of a person. So you have to be competent in what you do. You have to do a responsible work. You have to know what you're doing. - Yeah. - It's not something that you can say, okay, I will just do it. No, you have to do it seriously. I keep working on that until one point that all the cases were related to child pornography. And at one point I say, okay, no, I cannot keep doing this. This is not healthy for me, it was too much. I mean, the material you have to go through. You imagine, you hear child pornography, and maybe you think of certain things, but what I saw in my case was really something that I didn't ever expect to see. So I, I decide to quit that, but the knowledge regarding computer forensics, I kept. - I don't if I read this correctly. On the side, you were also like discovering problems. So, like in 2016, you discovered a security problem in the stock exchange, is that right? - That was in Asuncin, Paraguay, not in Uruguay. It was the stock exchange of Asuncin, Paraguay, yeah. I couldn't contact the people from the stock exchange in Asuncin. So, I just contact the CERT of my country. So I said, okay, they have this problem, if you can contact them, here you have. It's not my problem. I just want to let you know that this is going on. And the people from the CERT, you know, they are all connected between each other exchanging information. So I thought, okay, for them, it won't be complicated to contact the people that are in charge of the stock exchange in Asuncin. And yeah, in matter of a few days, the problem was solved. - You've done this multiple times. And the one that we are gonna focus on is in 2014, you found an issue with a medical provider, but what you were doing is finding problems and then reporting it to the CERT of Uruguay, is that right? - Yeah, mostly to the CERT. Yeah, most of the time it was to the CERT. In some cases, the findings were not, important or were just probably minor things. I eventually might have contact directly the people in charge of the systems, but mostly, for me, it was the best to report directly to the CERT. - There's no bug bounty in Uruguay, or there wasn't at that time, is that right? - No, unfortunately there was not, not only a bug bounty program is needed here, but also have legal warranties that if you are doing things that are just for research, that you are not trying to cause any harm or damage, if you just enter into a system, and you can smell that something is bad, you should not be afraid of any consequences for reporting that or doing that. And those warranties don't exist in my country. So, many people after then, they realize what happened to me, they stop reporting things to a CERT of my country because they were afraid it was a lose-lose situation. Nobody was winning. For any kind of information security administration system. The most probably useful input is the report of incident. That's how they know they can measure how the security is in the system, what are the problems are happening? What are the issues that are going on? So if you don't get those reports, you are basically giving a lot of advantage to the bad guys, to do the things they're doing. - Let's talk about what exactly happened in 2014. If I understand correctly, your girlfriend of the time was trying to access some medical records, is that right? Could you just explain, like, what happened in 2014 and then happened in 2015, just to give like background for people who don't know your story. - In 2014, in October of that year, I was in the apartment of my ex-girlfriend and I was in bed with her notebook. And she told me that she had to access to the medical provider to check some information. I don't remember if she wanted to schedule a appointment with the doctor or what. So she told me, can you access? Yes. She gave me the address to go. And then she asked me, okay, do you want the password? And then after a few seconds of silence, said, \"no, I'm already in.\" \"What?\" \"Yeah, I'm already in, but not only that, I mean, but with the privilege of administrator. \"What? What did you do?\" \"Nothing, I just put admin in the username and admin in the password and I'm in as administrator. That's it.\" And I was like, is this real? No. I mean, this is a medical provider's system. This cannot be happening. Then I look at it, okay. What is going on, this is not correct. I took a look at some things, okay. Yes. I am as administrator logged into the system. This is something that must be solved immediately. What I did, okay. Start at start UI from about here. I described the problem in a paragraph. I said, okay, The IP from where I connected is this. After an hour, I got an email from Santiago Paz who was the director of The CERT saying that he confirmed that what I said was correct. That for me was, wow, this is interesting. I mean, it's a Saturday. The director of the CERT is answering directly to me. Well, I'm happy, that's great, that's it. Because when you report an incident, then once you transfer that to the CERT or to whoever is in charge of that, what they do after that is not on your business. I mean, that's it, it's not your problem anymore. I said, well, I can sleep without any problem tonight because I did what I had to do. - It was a responsible report, wasn't it? I mean, you responsibly reported it. I think you said it was like only a few minutes later after you discovered that, that you reported it. - I think it was within 15 minutes after finding that. I mean, for me, it was clear what I had to do. - Yeah. - What I did was to protect others. I was not part of that medical provider. So my information was not involved there, was not in danger, but the information of more than 200,000 people, the medical records of more than 200,000 people was involved We are talking about a lot of people. Uruguay has 3 million people. So, we're talking about 9% of the population of Uruguay included there. That's a lot of people in medical records, but anyway, it doesn't matter whether it was 9%, 10%, or 1%, or two medical records. It was just wrong; that information should be protected. - Let me see if I summarize this right? You are on the internet. You go to the medical provider's website. You can log in as admin-admin. You have full access to everything. You realize there's a major problem here, because anyone could do that. Then you, rather than hacking their website and taking their data, you reported this to CERT within 15 minutes, they replied back saying that they've got that. They gave you a reference number. So you weren't a black hat hacker, if you like. You were being a responsible white hat, hacker, I mean you discovered a security flaw and you reported it. Everyone should be like, thanking you, but that's not what happened, is that right? - Yeah, I mean, sometimes I realize I was so naive. When you do what you consider is the right thing to do, the outcome is not what you expect. - Yeah. - And that's sad. But yeah, in my case, nobody tell me, thank you about the fact that I did what I considered it was the right thing to do for me was more than enough. I mean, I wasn't expecting not even a thank you. I mean, just, I was expecting them to solve the problem to help those 200,000 people that were potentially affected with that. - But, nothing happened, cause you accessed it again in 2017, is that right? And it still had problems, is that right? - Well, it was 2015. In 2015 again, my girlfriend told me, \"Alberto, can you access the website of my medical provider because I want to. Okay, I never learned, I enter into the medical provider system's website. 15 years of being in the security field and you are in front of a system. You can smell when something doesn't look good, and you can see that somehow there is a way of doing something that can result that are not supposed to be provided at the system. So took me like 10 minutes and in 10 minutes I could, again, access to all the medical records of all the people of the medical provider. This time, it was not admin-admin. I didn't need any password. I didn't need any username. I didn't need to be authenticated. All I had to do was, modify a parameter in the URL. Instead of a one, put in a two. And I was jumping from record one to record two. Imagine, creating a text file with all those URLs and having Google indexing that. In a couple of days, you can search the name of anybody and you can see his medical record because it would be indexed by Google. As I said that, no username, no password. I said, \"oh my God, these guys never learned.\" I was taking for granted that, they would not only solve the admin-admin problem, that was nothing but hardening, but they would also say, okay, we have this problem. So basically, we have no idea about security, there might be some other big issues to consider. And I was thinking that, okay, they probably did any kind of security reviews and testing. What I found, tells me that they didn't and okay, 15 minutes after that, mail to the CERT saying, okay, I put the URL, the parameters, sent to CERT, and then an email from somebody from the CERT that was not in this case Santiago Paz the director, but another person saying, thank you, Alberto, thank you very much for your report. And that was it. So I said to myself, \"Alberto, stop entering to this site because every time you enter, you have, I mean, if I was paid for this, I would probably be getting a lot of money, but it was not about money, it was about, I don't want to see these things, I mean, I want to see the system are a strong protector. These people really need to be aware of security and the basic things in order to protect these kind of systems. For me, it was like, starting to see those things. - It's mad in today's world, with bug bounty programs, companies are paying lots of money for people to do what you did. I've gotta ask the question, people will say, \"but it wasn't ethical that you tested their systems.\" Is your response that you saw a problem and you reported it ethically? You went, you emailed it to CERT. You didn't try and hack the system. You found a problem and you reported it. And I think it's important that we raise the profile that hacking isn't a crime. And I know that's something that you are really a big, you know, advocate of. - Hacking is not a crime. I mean, the guy who founded the organization of Hacking is NOT a Crime once messaged me in LinkedIn. And he told me, Alberto, it will be an honor, if you could join our organization. Wow, yeah, of course. Yeah, I mean, so, those kind of things of recognitions, prices. Just to tell you, the fact that nobody of the people who know me ever, ever asked me, \"Alberto, did you do the thing?\" No, nobody ever asked me, because they knew me and they already knew the answers. Curiosity is something that all of us, I mean, we surely do not lack of curiosity. Curiosity is something that we have in excess. All of the people in cyber security, creativity, using things like admin-admin to try when you're in front of a username and password is something that you don't, you do it naturally. I mean, you're entering the system and you just type admin-admin, just that, it's like a game, it's like, you have incorporated with that. When you see a URL with the parameters that are not in code, or the parameters are in plain text and you see patterns and all that, okay, you cannot help but modifying a number and see how the system reacts. I mean, and that is not a crime, that is not illegal. You're not altering anything in the system in a way that, okay, I gain access because I modified this file and I, (indistinct), so on the server site, this was executed, so I, then I got access to this. No, I mean, the system was decided like that. And I just had to do certain things that were not... For me, it was not hacking for me, it was like, something very silly and stupid that unfortunately worked. It was not like using attack (indistinct) and sending a pirate in an email, to somebody in the medical institution and waiting for the person to click and creating a reverse shell to your computer. - People are paid to do this these days, I mean, that's what the whole bug bounty thing is. - And the thing is that, after being released from prison, I won't deny it, I mean, I kept doing it and I kept finding problems in systems after being released in two months, I found two very important security issues in two systems of the government. Unfortunately, what did I do? Okay, I won't deny, took a snapshot for my ego. I mean, okay. I was there in there. I was in, okay, encrypted PCP, save it, close the notebook and go to bed. That's sad. - We need to tell the story because I mean, you reported it. And actually the reporting is what the government used to lock you away if I understand correctly. So, talk us through it. And then I wanna come back to that because now, you are nervous about reporting it, and I think it's a concern for a lot of people who discover vulnerabilities or discover issues, do they actually report it? So what happened in 2017? - The INTERPOL came to my apartment, they came with a search warrant, they arrest me. They seized all the things that I had, they didn't tell me anything. They took me to a premises, they interrogate me. I was two days in INTERPOL, in a cell. And on September 11th, it was a Monday, the judge sentenced that I should go to prison as a prevented measure for a computer related crime. Apparently, I say apparently, because I have my doubt, the medical provider was hacked on February of that year, 2017. I was accused of that. Even if I'm guilty, prison time is not the way you pay for that. But in my case, the judge, she considered that it was pretty likely that I would want to escape from my country and that my knowledge rate to computer security was so high, that I could alter the rest of the process. In other words, she thought that with my mind, I could alter evidence, equipment, material that was stored on an INTERPOL facility. No, I can tell the judge that I cannot do those kind of things with my mind. I cannot alter any kind of things remotely, not yet. Maybe with the metaverse, but, right now I cannot do it. She couldn't understand a profile she never faced before. And that, fear of the unknown, okay, what do we do with this person that we have no idea what he can do. We just send him to prison and we lock him down and that's it. That's the easy way to handle something that is unknown and feared like me. My mother offer two houses, money, and a lot of assets as warranty for my bail. Imagine, her two properties as a warranty for my bail, and it was denied. - When I was reading some of the stuff, they found a bunch of like Hack5 stuff in your apartment. They found a bunch of hacking stuff. So obviously, from what you've told, like Jack on Darknet Diaries and what I've read elsewhere, they didn't quite understand what that was all about. So, she was scared that you could magically, like you said, do something to affect the case. So it was better to put you in jail, is that correct? - That's exactly what happened. Exactly, yeah. - So were you actually jailed for hacking the medical provider because that's what they accuse you of initially, they said someone wanted Bitcoins, I think it was 50 Bitcoins, is that right? Something like that. - After being released from prison, I got access to the file of my case, and when I went to the page where that supposed email with that requirement of Bitcoins was made and I read it, it says, \"send 15 Bitcoins to the following address,\" and then the address was blank. - Wow. - There was no address. I mean, even if they wanted to pay for the ransom, there was no way they could do it because there was no address to send the Bitcoin. So that was the most pathetic ransomware attack I ever saw. I mean, they were asking for Bitcoins and they were not giving an address to make the transfer. - Were any records stolen to your knowledge or were any records encrypted or leaked? - As far as I know, nothing was ever released or leaked, I could saw parts of the logs of the medical provider of the (indistinct). And, I can tell you, the days of the supposed attack that outcoming traffic of the server, 200 megabytes. It's like, nothing. I mean, like, not even a movie in MP4 format. A database with 200,000 medical records, probably we're talking about, I have no idea, but maybe we're talking about a terabyte, I don't know. Ten terabyte, I have no idea really, but it's surely not 200 megabyte. - How did they tie it to you? Did they say that your IP address accessed the firewall and pulled data out? Or is it, did they just blame it on the fact that you reported it to CERT? - On the media and the interrogation, they said that they could trace the IP address of that email to my house. That is false. They didn't trace that email to any API. That is not part of the mitigation. They never did that. There was a connection from an IP that belonged to me on certain date of January of that year. Whenever I connect to a site, I don't know, at that moment, I had many plugins for the browser and you know, I work to my bank and okay. When I'm in the log in page, I have my Shodan plugin. I am curious, and I try to see, okay, what other ports are open? I probably expect only the, the port ATM 443. If I see something more, I'm curious to try to find out. Yeah. that plugin probably send some kind of target to the server to try to test certain port. So, there was just one connection from that IP that was dropped by the firewall. So basically, nothing, I mean, it was just a connection that the firewall detected and dropped. So, I was actually in no connection directly with the server. Yeah, there was an IP that was apparent mine there, but I don't exactly remember what it was in the request, but it was something completely not harmful, but it was not associated to me, it was associated to another, to the IP of another person. So, the day of my arrest and the search warrant that they executed in my house, they also arrested and they did the same with another person in Uruguay. So we were two people arrested for this case. So the fact that they traced an IP in an email to me or to a house, is completely stupid, I mean, if they arrest two people, it's not because an IP was traced to the house of somebody. I mean, there's no email that has two IP addresses of two different people in different locations. That's impossible. So, what they mention about the email and tracing that to the criminal, it's completely false. It's just based on some logs that are not complete. And so far, my conclusion is that, no, nothing was stolen from there. There was no evidence. - Did they ever prosecute the other person? - He was sent to CARD, but he was released shortly after. I mean, he spent a night in prison I think, all his equipment remained in with the INTERPOL as mine. But, that's it, he was released very quickly. They just realized that that person absolutely had no kind of knowledge about work. I mean, okay, let's be honest. The way I access to the systems in both cases I reported, I think that a kid can do, I mean, anybody can go and put admin-admin. You don't have to be a genie, you don't have to be an Ethical Hacker Certified. No, something that anybody can do. The other thing of accessing the URL and modify it, anybody can do that. It doesn't require you to be a master, or the best hacker in the world to do that. No, it's something that is very easy. And if I did it, I don't know, was I the first? Was I the first person who did that? In a timeframe of four years, three years? Maybe some other people accessed to the system in that time frame and we don't know, but maybe those people did what I did and they could access to the system and they just didn't report it. That's something that I don't know, but it's something that might have happened. It's three years. It's a long time. - So they confiscated a lot of your equipment and, I suppose, if you don't understand this stuff, it looked like you were up to no good, because, what did they find? They found a lot of money. So could you just tell us, like, what kind of money did they find, what kind of equipment did they find? I think it's nice for people who are in the space to see the kind of equipment that you had, I mean, I was looking at that and I showed my wife the photo and she's like, David, do you have any of that equipment? And it's like, yes, I do. - For example, this is on the floor right now here. Why would a person have all these Ledger wallets without opening in his house? This is not normal. - Yeah. - Well, I was basically represented Ledger in Uruguay and Paraguay the time I was arrested. From France, they sent me a box full of Ledger wallets of all kind of models. Yeah, I have plenty of Ledger wallets because I was reselling the wallets in Uruguay and Paraguay. If you went to the website of Ledger, you could see my contact information there in the service of the world. They never asked me. They didn't know what this was. When they came here, they asked me, \"what's this?\" They thought they were pendrives. They had no clue. - You had a lot of credit cards, didn't you? I saw on the photo, you had, like, a writer, so you could write credit cards, yeah. - Yep, this is for example. - I've got one of those, yeah. - Yep. Oh, oh, oh, come on. You're a criminal oh, get away from me. Oh my God. I'm talking. Oh, no, oh my God. - I've got a YouTube video, which I'll put below, where I showed people how to use that. I mean, the problem the problem with it... - Oh my God, I would send that to the CERT of my country! - No, please don't. - They would go after you. - Please don't. - They would go after you. - (laughs) Please don't. - No, okay, you understand, I mean, you are security professional, the tools, the knowledge, the skills that we have, the endless curiosity between those who are Ethical Hackers and those who are criminals are the same. We all use the same tools, we all have the same skills, we all have the same knowledge, we all have the same curiosity, we all are human beings. The differences and the ethics aren't, okay. In my case, I will never use any kind of knowledge, tools, skills, to commit any kind of crime. That's on me, I will never do that. That's the difference. Why did I have so many credit cards? Why did I have those writers and readers of magnetic cards? Okay, I have an explanation for that. That year, I was a reseller from a UK company that was called Uquid, that was issuing debit card VISA that were charged it with like, 200 different cryptocurrencies. And, okay, I could charge them for example, with a thousand dollars in Bitcoins. And then, I could, go with that card to an ATM in Montevideo, and I could get from the ATM $998 for each thousand dollars that I deposited. So, there was only a $2 commission for getting a thousand dollars in Bitcoins with that ATM card. It was like, the commission was nothing. I mean, so I was just testing those credit cards, testing the security and chips, I was very curious and those kind of things for me are fascinating, okay? If I was going to work with that, I needed to understand all the things behind magnetic cards, credit cards. That's me. I wanted to know, I wanted to learn. - You could have taken that medical provider and asked them for Bitcoin, which supposedly that's what the hacker did, but you actually lost Bitcoins in this whole, or cryptocurrency in this whole affair. Is that right? - That's correct, yeah. - Do you mind sharing how much you lost? - We're talking about 26 Bitcoins, a thousand Ethereum, 10,000 Litcoins. We're talking about something that, at that moment, was important. Right now we're talking about millions of dollars probably. When you are doing something that you consider it the right thing to do, it's not always what you expect. It's not always thank you. It's not always a reward. I can live with the damages that this cost to me, but it's hard for me to live with the consequences that all this situation costs to other people, other people I love, other people I care. - But I mean, there was a huge toll on you because you lost millions of dollars by reporting this, and you went to jail for, was it nine months? - Eight months, and a fraction. Yeah, probably close to nine months. - They didn't charge you for a specific crime, if I understand it right. You were locked up for eight months, why did they release you? - My lawyer asked for freedom in three times after my arrest. The prosecutor and the judge denied that. He appealed that decision of sending me to prison as a preventing measure. And, the appeal came in my favor, and they say, okay, this person shouldn't be in prison. He should be released. But first, he has to pay a $10,000 bail. - Wow. - I was in a prison where, I think, nobody there, if they were granted a bail to get released with that amount of money would actually have access to that money to get the freedom. So imagine, okay, my mother, fortunately, she could get the funds immediately, and they posted them, so in a matter of hours, I was released. But, imagine the frustration of those people that actually eventually could have been granted that possibility and just because they don't have the money, just because they're poor, just because of that, they cannot get out. They have to stay because of lacking of that money. And then for me, that point was like, okay, this thing that I believe in, justice, is something is very wrong here. Justice is a beautiful word, if you look it up in the dictionary. It's a concept that is beautiful. This is not justice. It's justice that if you have money, you can get out of prison, but if you are poor, you cannot get out of prison. It shouldn't just be the same for everybody, no matter whether you're rich, poor. This is completely unfair. And for me was like, okay, all the things I thought that, I believe were working, all the things I really trust in the system were, like, falling like a domino effect. I realized that everything was full of problems, full of flaws. And for me, it was like, okay, I thought I had a lot of experience in the world, a lot of knowledge, but I realized in my prison time that I was really naive, I was really silly. And that experience really make me open my eyes and say, okay, Alberto, wake up. You know, nothing, you are stupid. This is the real world. This is where you will learn what the world is about. It's cruel, but this is where you will actually learn what the world is about. It's not that you have been able to travel fortunately. You have the luck to travel to a lot of places in the planet, to live in different places. That is not something that made you a better person. This will make you see the world from a different perspective. And after this, you will change the way you get information, you process information, and you see the world, and you perceive that the reality won't be the same after this experience, and it was not. After leaving prison, for me, after reading my file, after processing all the things that I lived, okay. The system really is something that is completely bad, must change. All these things are completely unfair, so, something must be done. This is not what I thought it was, justice, because I thought everything was working in a proper way, but no, nothing was working in a proper way. - One question I've got is, still thinking about is, are those charges still ongoing? So, is there the possibility that they come back and like charge you and try and put you in jail again? - I never told this to anybody, not even social media or in any interview, but right now, the case is closed. I have no criminal record. I have no restrictions. I'm a person that is completely free to live my life. Case closed. - That's fantastic news, I mean, I know it's been really tough, so I'm really glad that that's finally come to a close. - Well, there are things that will never get returned of the damage. I'm not talking about money, I'm talking about other things that you cannot solve with money because during all this process, I lost many things. - Yeah. - I think, all I have left is my mother and then, everything else is gone. Some people that I really love passed away while I was in prison. I wasn't able to be with them, when they needed me. And those things will forever, I mean, I will have those scars forever, with me. Okay, I have no criminal records, but is this end? Is this justice? I don't think so. I don't think there will ever be justice no matter what happened after this. What they did is something that is unforgettable, unforgivable, and I don't see a way of repairing that. What they did to a person, is something that cannot be ever repaired in any way. I mean, no money in the world, nothing can give me back things that I lost in this time. And again, just for trying to do the right thing. It's hard to process, and to believe that happened, but yeah, it happened. - I'm glad that you're sharing this with all of us. It's a cautionary tale. I can't speak in the situation that you've been through, but it's a warning for all of us that, you know, doing the right thing isn't always gonna give you the result that you think it's gonna give you. - When people approach me asking me for advice on how to begin into cyber security. Okay, guys, in college, in any course that you might take, they don't teach you certain things that are going to happen in your life. You are going to be in a field where you will be under a lot of pressure, where you will see things that you weren't ever told that you were going to see, and, you won't know how to handle those things. When I was working for my, when I started actually, in the government working assigning for sec professional, okay. One, it was more than probably 12 years ago. I detected certain unusual activity in the logs of a system. And okay, at one point after reviewing, reviewing this log, I came to the conclusion that the only thing that could explain that, was that somebody was accessing and altering the information of the system from inside. And okay, what do I do? I have to report that. I mean, in that position, it's not only ethical, it is a crime if you are aware of a criminal activity, if you work for the government, you are witness of that, and you don't report that, you are part of the crime. So, okay, you have to go to upper management, to the director of the organization and tell him, okay, \"somebody is committing a fraud here, is modifying information in a critical system for the country,\" okay. But the person probably doesn't want that to be known because he doesn't want to be on the front page of the newspaper saying that, the organization of the government, that he's the director of, that is happening. So, okay, what do you do? I mean, lot of pressure, lot of decisions, lot of things that, I mean, are complicated to deal with. And in university, they don't tell you, and that seems... Don't go and try to become a hacker because it's cool. Do it because you really feel the passion for it. And you are willing to go anywhere with that, because it's going to be a journey that is going to be beautiful, but the whole truth is not, it's going to be a rose garden. Every time, there will be storms a lot of times. And for those storms, they never told you to bring an umbrella. You just have to learn on the run, okay? I found this, what do I do now? I don't know. And you feel a lot of pressure, a lot of different things, and you don't know how to act but you should be prepared for that. I mean, universities' courses should tell you the bad part of it and how to handle those situations. Dealing with people that are committing crimes next to you, working next to you, it's not easy. You have to keep working next to those people, when you know what they're doing, that's not easy. And nobody tells you that. They just tell you, okay, these are, I don't know, the processes of open testing, blah, blah, blah. This is what the domains of the ISO year 27000 blah, blah, blah. But nobody tells you, okay, this might happen, will happen, and when this happens, okay, you should handle this in this way. - I always say technical stuff is so easy compared to, you know, ethical stuff or real life stuff. It's much easier to work with machines than with people, I find. What is your advice then? - My advice is, okay, guys, be aware. This is wonderful, I want everybody that loves cyber security to get into the field, come on, get in. But some things that are not nice are going to happen. Be aware of that. I mean, don't be surprised and say, \"I can't believe this,\" no, this will happen. And don't be surprised, just be prepared. Be prepared because when that happens, you won't have time to think. You will just have to act. It's like the story of, I don't know, of the pilot of an airplane that was about to crash and in a matter of two seconds, he made the maneuver that saved the aircraft. And when he land, somebody approaches him and he asks, \"oh, when did you decide to make that movement that saved the aircraft?\" And the pilot relaxed, he said, \"that movement, I made that decision 20 years ago when I was learning how to fly, when I was in the flight simulator. I didn't have to make that decision now, I mean, we would all have been dead if it was like that, I mean, I just have to do what I learned when I was in the fight simulator when I was learning to fly.\" Okay, the same applies here. Just be prepared and when it happens, just do what you were prepared to do. It is, as you said, to work with computers, but we are going to work with human beings and with, like, human beings, we are very complex. We are very complex here too. - What's your motivation to, like, get more and more people to hear your story. - What happened to me is something that I would like to tell everybody because, when I went to college, those guys, those people that want to enter into cyber security, they should know that. You know, you couldn't imagine how many people contacted me after I became not famous, but notorious because of the experience I had to live. And they approached me and asked me, \"Alberto, I saw your story in Darknet Dairies. It was inspiring, blah, blah, blah. Can you give me any kind of advice on how to begin a career in cyber security?\" - Yeah. - My answer is with a question is, okay, \"Why? Why are you considering that?\" Okay, the only answer I don't like to hear, I don't want to hear is, \"because of the money.\" If the answer is that, ah, that is not something. The answer that I would like to hear from a person that is approaching me like that. But sometimes that's the answer. I want people like me to feel passion for what they do. The money, only, okay. We might have a lot of professionals in the future, earning big salaries, but being completely frustrated in life, even miserable in life doing something that they don't like, just because of a good salary. Now that doesn't make any sense. I mean, go and follow your dreams no matter what your dreams are. Now, I am into the NFT world, interacting with the artists that are creating some wonderful pieces of art in the NFT communities, is amazing. Those people, I heard so many stories about, okay, nobody ever buy what you are doing. Their parents were always saying, \"oh, Sam, what you're doing is wasting your time. That thing is completely useless.\" But despite all that, they kept doing it, okay. And some of them, by now are succeeding. They're selling their pieces of art as NFTs. They're making money. They're making a living from that. My respects, you are following your dreams. You're doing what you love, and you're making a living from that. I think everybody should find their passion and make a living from that, if you can, Sometimes, I know, it's something that doesn't happen all the time, but that, I think, is the the way of living a life that makes you feel okay. I'm doing something that I love, this is not a meaningless life and okay, I can make a living from it. For me, cyber security is part of me. I cannot imagine my life without this. I am in contact with many people that serve peace and time in the USA for computer-related crimes. For example, one of them was the first person who hacked a scholar system in the USA. He was into prison because of that. And they wanted to make an example of him, so, his sentence was ten years I think. He had to serve two extra years for violating his probation. And that person after being released said, \"Alberto, I don't want to know anything more about computers. I mean, I don't want to touch a computer anymore.\" And I was thinking, okay, this person who has extremely amazing skills, knowledge is basically not wanting to keep doing that because, okay, the consequences of 12 years in prison in the USA are not something that is nice, I mean, it's something that is really traumatic to a point nobody can imagine, but, then keep talking to them after a while they say, \"okay, Alberto, you know, you were right. I will never actually recover my life unless I go back to do what I love, which is hacking.\" Meaning hacking, not as hacking as a crime, but hacking as finding problems in a system. Correcting problems, that's part of their life. And it's sad when the system makes a person lose that. It's a lose-lose situation. We're losing an excellent potential professional, and, the society just had to pay for that because prison time, in my case, the taxpayers had to pay $900 for each month I was in prison. Make the number. I was eight months in prison, that's ridiculous. I mean, I'm not violent, I mean, I will never escape from my country for this, or for anything. They didn't bother to make a profile of me. Now, they were just wasting the time where I could have been told, okay, you can do community work. You can teach anything, computer sciences, to children, to whatever, as a way of an alternative way of that. A preventative measure. There were so many things I could do for society instead of being sent to prison and put in a situation where I was winning nothing. Being sent to a place where, normally, most of the people get out being worse than they were before being there. It's a university of crime. You are surrounded by criminals. The temptation of becoming a criminal is very high. You have to be very strong to stay away from that and don't be temptated. I have no doubt that many people with my profile that are sent to prison end up, instead of getting released and get time to get their life back, no. Maybe they didn't commit any crime, or maybe they did something minor. Well after prison, they're not surprising that they're going to be out and be doing much more severe crimes related to hacking. They will be having a lot of contacts in the cyber crime, and they will be very, very interested on those skills for making money for themselves. It should be analyzed. The solution of sending a person like me to prison, just destroys the person with no benefit to the society and potentially can create a much worse and dangerous person than the danger the person supposedly had before going to prison. - Alberto, I really wanna thank you for sharing. I can see it's... I have no idea what you went through, but I really wanna thank you for sharing your story with us, and, you know, giving advice to the younger generation. Thank you. - No, thank you very much, David, and anyone who wants to ask me any question about my case and to listen to my story here and anywhere else, feel free to contact me. I mean, I'm open to talk to anybody. I love when somebody questions certain things about my case, I have just answered all those questions. And fortunately, I can answer those questions without any problem, but yeah. Thank you very much. - Thanks so much. - Tell everyone, and thank you, really, David. It's an honor for me to be here and I hope you can reach a million subscribers. - Thank you. - Soon. Amazing, wow. What numbers! I mean, not many people can reach that number, so your success says a lot about you. - Thank you. - Congratulations, and you surely deserve the success. And this is just the beginning, you will probably at one point say, \"okay, I am at 9 million subscribers. Only 1 million left until 10 million.\" So you will do it, man. Anything you want you can have in life. - I really appreciate it, thank you. And, you know, thank you for sharing your journey with us because you know, YouTube numbers are wonderful. And I mean, it's not the numbers that count, it's the people, so I want to thank everyone who's watching, but I also wanna thank people like you, you know. Thanks so much for sharing your advice and your story with all of us. It's important to know, you know, what happens in the real world and not just in a YouTube video. So thank you for sharing, you know, real world stuff with us. - Well, thank you for giving me the opportunity to share this with everybody. So, another accomplishment for me, okay. More people knowing my story, we can make a revolution. We can make a change, we can improve things. (rock music) I'm so sorry. Like probably the CERT of my country is monitoring. (David laughs) \"Shut up Alberto, shut up. Stop talking about that. Don't keep sharing that Alberto. You already caused a lot of headaches.\"",
    "transcript_keywords": [
        "people",
        "things",
        "yeah",
        "CERT",
        "system",
        "lot",
        "person",
        "prison",
        "thing",
        "Uruguay",
        "security",
        "medical",
        "time",
        "medical provider",
        "Alberto",
        "problem",
        "money",
        "kind",
        "hacking",
        "crime"
    ],
    "transcript_entity_values": [
        "Ledger",
        "NFT",
        "YouTube",
        "three",
        "Paraguay",
        "a year and a half",
        "a night",
        "Saturday",
        "Asuncin",
        "two",
        "PCP",
        "one day",
        "YouTube",
        "Google",
        "15 minutes",
        "2015",
        "tonight",
        "3 million",
        "Spain",
        "1%",
        "LDA",
        "2016",
        "each month",
        "9%",
        "Bitcoin",
        "27000",
        "million",
        "David Bombal",
        "an hour",
        "Sam",
        "200 megabyte",
        "200 megabytes",
        "more than 200,000",
        "1994",
        "two seconds",
        "10%",
        "VISA",
        "9 million",
        "February of that year",
        "API",
        "900",
        "about millions of dollars",
        "12 years ago",
        "That year",
        "200,000",
        "January of that year",
        "Christmas",
        "Montevideo",
        "2017",
        "today",
        "Ledger",
        "one",
        "two days",
        "48 kilobytes",
        "12 years",
        "RAM",
        "three years",
        "UI",
        "about a year",
        "10,000",
        "first",
        "UK",
        "those years",
        "2",
        "6",
        "INTERPOL",
        "15",
        "998",
        "October of that year",
        "the day",
        "the last year",
        "only a few minutes later",
        "Uruguay",
        "a couple of days",
        "ATM",
        "USA",
        "two extra years",
        "sec",
        "close to nine months",
        "France",
        "10 million",
        "David",
        "IP",
        "Spanish",
        "Ten terabyte",
        "University",
        "Santiago Paz",
        "2014",
        "six years",
        "thousand",
        "CERT",
        "LinkedIn",
        "10 minutes",
        "12 year old",
        "a thousand dollars",
        "a few days",
        "Alberto",
        "10",
        "ten years",
        "South America",
        "six",
        "millions of dollars",
        "2004",
        "200",
        "Micro Mania",
        "Darknet Dairies",
        "20 years ago",
        "One",
        "15 years",
        "10,000",
        "a few seconds",
        "Argentina",
        "Uquid",
        "CPU",
        "four years",
        "Justice",
        "about 9%",
        "Santa Claus",
        "nine months",
        "Jack",
        "two months",
        "Asuncin",
        "Eight months",
        "Monday",
        "Ethereum",
        "Only 1 million",
        "eight months",
        "50 Bitcoins",
        "September 11th",
        "35 years ago"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "GPE",
        "CARDINAL",
        "GPE",
        "DATE",
        "TIME",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "TIME",
        "CARDINAL",
        "GPE",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "PERCENT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "ORDINAL",
        "GPE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "GPE",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "NORP",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "LOC",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE"
    ]
}