{
    "id": "aOGFYrNS0wo",
    "title": "How to Add Power Steering to an Electric Hummer - (I know you're curious)",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-09-29T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=aOGFYrNS0wo",
    "category": "Howto & Style",
    "tags": [
        "Electric Hummer",
        "Hummer EV",
        "EV hummer",
        "Electric hummer conversion",
        "Electric Humvee",
        "Electric Hmmwv",
        "DIY Hummer",
        "Electric truck",
        "cyber truck",
        "tesla",
        "rivian",
        "ford lightning",
        "diy EV",
        "EV conversion",
        "power steering",
        "steering assist",
        "electric power steering",
        "electric hummer"
    ],
    "views": 1217380,
    "likes": 86225,
    "comments_count": 4867,
    "description": "Its time to install Power Steering on the Hummer! HUGE Thanks to  for helping me get my parts so fast. Power steering is important in any vehicle, but especially heavy duty vehicles. The heavier the truck the more assistance it needs for steering.  We had power steering working on our Electric Hummer conversion previously, but it was loud. This new electric power steering motor will be MUCH quieter and MUCH more energy efficient. Our Hummer's name is 'Whisper' and  now it will be quiet enough to live up to that name.   Watch all the EV Humvee build videos in order HERE:    Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.oshcut.com/",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "On the scale of importance when driving a vehicle, steering is up there with some of the most important. If you remember, we did have working power steering here on this electric humvee, but it was super loud.or rather, more annoying than anything. It had a hydraulic pump that was constantly running in the background, adding pressure to the power steering and braking systems. We ended up getting rid of that for the braking for something far more silent. And as well, for the power steering, we have a solution. The solution is this guy - an electric power assist motor that attaches directly onto the steering wheel shaft that goes down to the steering box. Ill explain more in a minute. Lets get started. [Intro] So how this electric motor assisted power steering works is that one end connects to the steering wheel, and as the steering wheel turns it amplifies the force heading out to the wheels, which are right here. With smaller vehicles like sports cars, you dont really need power steering. The car is light enough that you can do it with just your hands. But when a vehicle weighs 5 or 6,000 pounds, or youre towing a load behind the vehicle, you really cant do it with just brute force anymore. You need some help. Taking a look at the geometry underneath the dash. Ignore the wiring and well fix that later. So we can see as I move the steering wheel, all of that linkage starts moving as well, and the bottom of that shaft heading through the firewall comes out through this side and into the steering gear down here. So we have to put this motor somewhere along that shaft. This guy right here is the steering column that goes from the steering wheel all the way down to the steering gear. And technically without power steering we still would be able to steer just not very well. And like turning the wheels while the vehicle is not moving is near impossible. We have taken the power steering motor and am just kind of testing it out really quick. We jerry-rigged it up to a battery just to make sure everything was working. So have hooked a 45 pound weight up to this end of the power steering pump, and by pump I just mean motor. And this is the side thats going out to the tires where the force is being amplified. This is the steering wheel side and right now if theres no power connected to it, I can spin this side its like a one to one. But there is zero percent chance of me ever being able to lift up that weight. Its barely moving, but, like, the screwdriver will break before that weight moves. So now if we take this wire, very carefully connect it to the 12 volt system. This is the signal wire which basically tells the pump to turn on. Now we should be able to take this steering wheel and incredibly easily start lifting up this weight. Im using my pinky to lift 45 pounds with the steering assist coming off this motor. Now obviously, driving down the road or going up mountains is going to be slightly different than just lifting a weight off the ground, but you get the point. One little finger can now move a lot more weight. Now we just need to weld these adapters onto our steering column. [Motor sounds] In order to put our steering assist motor into the steering column, we have to cut the cone. We do want to keep the jointy bit though. [Welding sounds] Ill punch out the center of the jointy bit and then comes the complicated part. Apparently no one really makes bolt on parts for electric humvees. So we gotta make our own. The silver couplings do fit the assist motor, but not our steering wheel shafts. So we chopped off the bits that we dont need from those silver couplings, and then I tried to bore out the insides with my stand up drill press. That didnt work out too well. [Drill press sounds] Its twisted. Ugh. Luckily my buddy, Jacob, has access to a lathe and we were able to drill out the inner diameter of the silver coupling to match the out diameter of the steering shaft. That solves one side. The more exact we are now means the straighter the shaft is going to be. If the shaft isnt straight it puts stress in weird places as its turning the tires. And were trying to avoid that. Since, if you remember, steering is rather important. For the other side we cut a small adapter that fits between the jointy bit and the silver coupling. That was the motor can sit right there next to the jointy bit where the shaft used to be. Itll all make sense in a second when you see it put together. Jacob turned this piece of metal down on a lathe and its going to sit inside of this hole. Well have to press it into place and then this coupling gets pressed into that, which will keep it totally straight all the way up. Itll make more sense when you see it done. Now with that pressed in, we can position this over the top and press it in the rest of the way. Now we have the coupling pressed into the joint. And we can take the coupling, put it onto the steering module, and bolt it down to the steering gear. And figure out where this slips through the firewall. Steering gear...firewall. Eventually we will weld around the edges of this, but with the press that we have currently, its not going anywhere. So well position everything without welding it first. Theres a flat portion along the splines of the universal joint that can just slip onto the steering gear. Then the steering assist slips down into place and we can line up on the firewall where we need to start cutting things. Removing the rubber boot for the old steering shaft is easy enough, just four bolts and I can pull it out from the inside of the firewall where the driver sits. Well have to make our own boot for the custom shaft after were done. As were lining the motor up along the steering shaft, it needs to sit inside of the firewall, which means that we have to drill out a little bit of that firewall to make room for the motor. [Drilling sounds] Woo! [Drilling sounds] Alright. We found that using a hole saw tends to make the best looking cuts. Drilling in a few different spots, lining up the motor, seeing if it fits, and drilling out some more. Next time lets work on a smaller car. So remember how back in the day I said that with the original military humvees, they dont have a key, they just have a switch that they turn on. In order to lock them up they have something that was pretty unique. Underneath here on the steering wheel is this guy. See this tube that runs all the way down? This is a metal cable that just wraps around the steering wheel and locks, if you want to lock things up for a long period of time. The only problem is as we are cutting a hole for that power steering module, its kind of getting in our way. So we had to unscrew two bolts down there at the bottom which should let it slide enough that we can line the shaft of the steering wheel up with the motor and get our power steering back. As far as the wiring goes, there are three wires. One is a signal wire to turn the thing on. The other is the positive wire that can handle 30 amps, and a negative wire to complete the circuit. And like always, Im using my 12 volt control panel from the battery to the 30 amp fuse, and from that fuse to the relay. Using 10 gauge wire because 30 amps is quite a bit. So when we took the shaft out from behind the steering wheel and cut it, it comes in multiple parts. This is where we cut it down here. And this piece slides up into this piece, which heads up to the steering wheel. Now what we have to do is cut out the exact length of this part because this is going to sit in the shaft. So I think were sitting at like seven and three quarters, and we will chop this as well at seven and three quarters. [Sawing sounds] [Sanding sounds] [Welding sounds] We found the best way to stick the couplings to the shaft is just by welding them in place. During this whole process weve taken very special care to keep the shaft as straight as possible so theres no weird kinks or angles as were turning the steering wheel. Even though this system isnt particularly load bearing and not under a whole lot of stress, its still not something we want to mess up or mess around with. Quick overview, we have steering wheel, we have the steering shaft, this tucks up inside of there. These are the welds weve fabricated. This is the coupling. We cut out a portion of the shaft where the motors going to sit. And then we have this going down to the steering gear box. The only thing left to do is put it in place and see if it works. Okay so we have everything wired up, temporarily of course. We still need, like, a big mounting plate right here. But, we are connected to the steering wheel as well as the steering gear. Now Jacobs going to flip the switch. See if we have any steering assist. Its working?! -Easy. -Good. Okay. When we spin it back the other way the motor might flip up a little bit. Oh yeah. But we can go one direction, right? Sweet. We need to get a new hose because the power steering is just leaking. Basically what were going to do is just loop it from one side all the way to the other just so the power steering fluid stays inside. Trying it for myself. Everything is on. Im able to turn the tires with one finger. Thats a lot of steering assist. Im very pleased with that motor so far. But the more important thing is is we need a metal bracket that will hold that motor steady while were turning left and right. And were going to do that with lasers. Well be making this out of one eighth inch thick aluminum so itll aesthetically match all of the rest of the silver components we have underneath the hood. The laser cutting were doing this time around is slightly more complicated than previous designs. Yeah, OSHCut still has their 10 kilowatt lasers that can make short work of metal, cutting out our entire design in seconds. Anyone can use this laser. Just drag and drop your design onto OSHCuts website and the machine can cut it out in seconds. This videos not sponsored, they just let me come tour the shop and I think its pretty awesome. [Laser sounds] The finishing machine gets rid of any sharp burrs or edges on the piece, as well as puts in a nice texture or grain to the metal. The difference between this design and previous designs though is the center piece. The steering assist motor has three little bolts that help mount it and hold it in place, and in order to get that correct angle were going to use this machine here. This massive press brake can take our design and bend the little flap out into a 3D piece that can then support the motor exactly where we want it so it wont rotate any time we turn the steering wheel which is kind of important. Its pretty awesome that OSHCut has all these machines here in the same place so I dont have to wait weeks or months for parts, I can literally get them the next day. And theyve been super supportive on this project. Now weve successfully taken a 2D part and designed it to work in a 3D space. Lets see if it fits. The purpose of this piece of laser cut aluminum is to sit along the firewall and hold the motor in the correct position. The steering gear itself is also lubricated. We have a stainless steel braided hose attached to the input and output so itll keep its own liquid circulating inside. With the motor clipped in and bolted into place, we can bolt the aluminum plate to the firewall of the humvee. And now that everything is connected there is one more piece which is this guy right here. This is the brains of the operation, kind of like what controls the motor, and Im just going to tack it right up on the firewall so that the wires running out of this can just run through the loom we already have going. And there we have it. We have the brains of the motor connected up here, the metal plate laser cut, as well as the motor connected to the steering shaft coming from the steering wheel. And the hose thats going to keep all the liquid inside of the steering gear so that it doesnt end up on our floor again. Shall we try it out, Jacob? -Lets give it a shot. -Key first. Nice. Nothings getting hot yet and the tires are turning. Lets see how many fingers it takes. So right now Im using one finger on the steering wheel and we are turning the tires. Yeah nice. And the best part about all of this is its completely silent and its not running constantly in the background. As the other pump was constantly running in the background at 20 amps, it would have decreased our range. But when these motors arent being used, theyre not draining the battery. The good news is is that our power steering can work at a complete standstill with the full on truck. Super happy about that. And there you have it. The power steering, the power brakes, and pretty much everything else connected to the 12 volt system is now working. The only things we have left are the high voltage, like the batteries, along with the cooling, the BMS, and you know, everything thats connected to those. Weve posted every week for about 10 weeks now. This has been the largest project Ive ever done on my channel. And you might not have noticed, but Ive been filming these videos over the course of a year, but just publishing them in the last 10 weeks. Theres quite a lot of work that goes on behind the scenes. But as of right now, this video, we are 100% caught up and what you see behind me is where we are at in real life. And now that we are caught up its time to take a short little intermission. While Ive been working on this project, my wife has been working on a project as well. We are currently 9 months pregnant, which means that either this week or next week Jerry Rig Junior will be joining our family. So Im going to take some time off to spend with them before continuing on this project. The goal is still to have this thing moving before the end of the year. So make sure you hit that subscribe button with the notifications on so you dont miss any new developments. And thanks for joining me this far on the project. Its definitely one of the coolest things weve ever built. If you have any questions leave them down in the comments. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "steering",
        "steering wheel",
        "power steering",
        "steering gear",
        "steering shaft",
        "motor",
        "steering assist",
        "wheel",
        "power",
        "shaft",
        "steering assist motor",
        "power steering motor",
        "steering wheel shaft",
        "steering wheel side",
        "power steering works",
        "steering column",
        "firewall",
        "power steering pump",
        "steering wheel turns",
        "working power steering"
    ],
    "transcript_entity_values": [
        "45 pounds",
        "6,000 pounds",
        "the end of the year",
        "the last 10 weeks",
        "the next day",
        "Twitter",
        "Instagram",
        "this week",
        "100%",
        "two",
        "seven and three quarters",
        "20",
        "three",
        "Jacobs",
        "just four",
        "2D",
        "control panel",
        "next week",
        "every week",
        "45 pound",
        "10",
        "zero percent",
        "12 volt",
        "5",
        "10 kilowatt",
        "Jerry Rig Junior",
        "months",
        "seconds",
        "about 10 weeks",
        "first",
        "second",
        "a year",
        "9 months",
        "weeks",
        "Jacob",
        "30",
        "One",
        "BMS",
        "one",
        "one eighth inch",
        "the day",
        "Drill"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON"
    ]
}