{
    "id": "APb_DGj0PFI",
    "title": "Did Seasonic create perfection?? - Syncro Q7 Series",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-14T17:00:32Z",
    "video_url": "https://www.youtube.com/watch?v=APb_DGj0PFI",
    "category": "Science & Technology",
    "tags": [
        "Seasonic",
        "PC",
        "Case",
        "Computer",
        "Power Supply",
        "Unbox",
        "Cable Management",
        "Accessory",
        "Power",
        "850W",
        "Wires",
        "Linus",
        "Unboxing"
    ],
    "views": 936262,
    "likes": 42839,
    "comments_count": 2846,
    "description": "Thanks to Seasonic for sponsoring this video!! Learn more about the Syncro Q7 Series at   Power Supplies and pc cases selection are usually mismatched with two different companies, but what happens when it's made by the same company and designed to work together? Perfection    Buy Seasonic PSU's On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):  On BestBuy (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  *Note: Err Nicole Yuen was the camera operator and art director for today's video, not Nick Light  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/syncro",
        "https://geni.us/UxTif",
        "https://geni.us/RH1SJS",
        "https://geni.us/DuV1F7l",
        "https://geni.us/UBPbz5T",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Seasonic sponsored this video and we're looking at the followup to the Seasonic Connect, something that we already checked out over on the Linus Tech Tips channel. The idea for the Synchro Connect, so this is the DPC 850. It's an 850 watt power supply. The idea is basically the same. So you've got your conventional looking power supply here, a little something like that. Oh, okay. Why is this so tight? Instead of having all of the cables and connectors coming off of it like this, you've just got one. So to my knowledge, this only carries 12-volt power. Then, you've actually got a secondary unit. And in this case, it looks like the secondary unit has actually gotten considerably bigger. So the power supply connection comes in here, right there. And then off of it, you've got dual eight pins for your CPU. You've got, oh, interesting, fan connector. Is that an RGB header? Very interesting. A few SATA and Molex connectors, a sync connector and then more fans, more RGB. Whoa, a lot more fans and a lot more RGB. And then SATA and Molex. Wait, what about your graphics card? How're you supposed to connect your graphics card, Seasonic? They overlooked that? Oh, (laughs) Ah, there they are. GPU's here and the 24-pin cable is here. So the idea here is to address one of the main complaints that I brought up with the last generation product. And that was that like, okay, this is really cool but, what case does it go in? Along with the Synchro Connect, Seasonic is launching, Ah, oh! The Q7 series Synchro case. It's an aluminum steel tempered glass case that includes Nidec fans and apparently looks good, so they say, but I haven't actually seen any evidence of it yet because I have not yet opened this box. So let's go ahead and crack it open. Oh boy. Got the accessory box for starters. User manual, gloves, ooh! Hopefully they're Asian size. They are? My tiny hands won't be a disadvantage today, ladies and gentlemen. All the screws, in a helpfully segmented little box here but then they don't actually like divide them up. That would be a nice touch for a next time, Seasonic. Fan text does it. A little cleaning cloth. User manual. Yeah, we probably don't need that. I mean, how different could it be? It's pretty heavy, especially for an aluminum case. Oh shoot! Slowly. Very solid packaging. Really like to see that. This is a really firm thick foam, but not rigid. That is A plus foam right there. Love it. All right, now let's, now let's unveil it. Here we go. Oh, you guys got the butt end there, interesting. They've gone with an inverted ATX layout, brushed aluminum front panel. Ah, the rest of the case is steel. That explains why it felt heavy for an aluminum case. So what am I looking at here? Is that an integrated sink grill thing? Kinda looks like it. Like, it looks like that's right there. So, wait, these ventilation holes, along the outside here are presumably so that this thing can do the 12 volt to five volt and 3.3 volt conversion, in here instead of in the power supply itself. Actually I can check that really easily. Yes, that is correct. And then it actually needs some ventilation. So I guess that's why this is open. And then it's got these honeycombs on the back here too. What do you think of the front? - [Nicole] Very, black. - Very black. Nicole, everyone. This is our first time shooting a ShortCircuit with me. I think she didn't realize I was going to ask her opinion. Now a lot of the time with a solid front panel, you might be concerned that you're not gonna get any airflow in there, but, actually, if you look over here, this side is open and they've got a solid well, probably just about an inch of space. So like, two centimeters and change in here. I don't expect it to be a concern. Is that a removable filter? There it is. I didn't have to pull the front off at all. Is that magnetic? It is, look at that. Cool, all right, I guess I could put that back on now. Or no, we could just have a look here. So, three, three included 120 millimeter fans in the front. Looks like you could mount three, 140 mils if you really wanted to. And all the front I/O is done top I/O style. So you've got two type As, a type C, and your audio ports as well as your power and reset switches. It looks like this is another removable filter. Also magnetic, very nice. Seven PCI slots, bottom mounted power supply, and another 120/140 millimeter mount that's pre-populated with a 120 millimeter fan. Interestingly, Seasonic includes an RGB connection for every one of the fans, so all six of them. But it appears that the Synchro case doesn't ship with RGB fans. Transportation lock, remove first. Oh, interesting. So you unscrew this piece and then you can decide if you want it to just swing open all the time for easy access, or if you wanna put this on to lock it. I can put this front panel back on. (metal clanking) Don't actually recommend removing that. Okay, it just pops off like that. It's got a little rubber thing on the inside, so it doesn't scratch your glass. And now I would expect this to just swing open. Kinda hard to get in there. Oh, unless it, Ah, there we go. It's attached to this front piece. Okay, this like pops off the hinge, that's pretty normal You know, opening this up, it's kind of crazy how little the interior layout of a case actually matters anymore these days. Because it used to be that you had to really, you know, examine like, \"Oh, how thoughtfully are the drive cages laid out? And how's all the cable management gonna work?\" There's like almost no cables in a case anymore. You just have to wire up your fans, usually on a brand new machine, you're running an NVMe drive. So you just gotta run power to your motherboard and GPU. So let's pull whatever this placeholder is in here out. And let's throw in the, Syncho. Oh, looks like we've got a bottom filter as well. And I see that pulls out from the front instead of from the back. So you don't have to pull your computer away from the wall in order the clean it. Actually, all the filters, really easily accessible in this thing. Really like that. Only two three and a half inch hard drive mounts. But, there's another three, two and a half inch drive mounts on the back. So that should cover the vast majority of people. There's a bay for another two hard drives down here. Although, given that Seasonic has a very short history of making cases, I wouldn't say it's necessarily a guarantee that you're gonna see the kind of long-term support and spare parts availability that you would from a more established case maker. So I wouldn't count on that. I'd say it's got, two three and a half inch drive mounts. All right, I'm losing the gloves. I don't have enough grip on the shaft here. Always make sure you've got proper shaft grip, critical. Front panel connectors, okay. And how does this attach? Oh, I see. Screws in from the back. So I actually did not need to do that at all, what I just did. I gotta remove these screws at the back instead. I forget Nicole, are you a PC or a Mac? - [Nicole] I'm a PC. - You're a PC? - [Nicole] Yeah. - It's got magnets everywhere on this thing. This is like totally unnecessary, oh! That's kinda cool. If you don't have a Synchro power supply, this like, placeholder thing that takes the spot of it, you can actually, it's got magnets on it. So you can just, kinda chuck it on there and without screwing it in, and it'll just cover up your cables. So that's why it has these paths in the sides, so that you can run things through it. Okay, all right. That's pretty neat. So all the connectors that you need for your graphics cards and for your motherboard here, are just, right there, kind of built into the panel. That's kinda nice to make cable management a bit easier. Seasonic includes a triple PWM adapter for the front three fans. So you just plug all three of those into one spot, plug the rear fan into another spot and, bippity boppity, and you're off to the races. And then this is it. This is all the wiring that you do from the power supply to the Seasonic Connect. It's actually a similar concept to what Intel's doing with their ATX 12-volt only standard, except, instead of running the 12-volt up to the motherboard and then having everything branch off of the motherboard, Seasonic is taking what looks like a more realistic approach and having everything branch off of this distribution piece, and go to a more traditional connector on the motherboard and drives, et cetera, et cetera. That's tidy. (paper ruffling) Theoretically then, the included cables should be really short. Aha, look, it's a little baby 24-pin. Are these fans RGB and they just really don't look like why is there so much RGB thought put into this? And no included RGB? Yeah, these look like, fan extensions but to what? I'm checking the manual. Nope. No explanation provided for the fan and RGB extension jigs. Oh, wow! So they've even gotten as specific as this is a triple SATA connector. You plug it in here, and you run it to these three drives. Yep, one, two, three. And the whole thing just tucks right there. Most motherboards consistently have the pin connectors here. So, that's where these go. They've even got little cable management loops right there and there. So we'll just go in like that. Flipping around to the other side, there's no way to do it wrong. 'Cause it says, \"Connect module here and then motherboard here.\" Boop! That just goes in there like that. And then you got a couple of these little short baby six plus two pins. Got it, two of these are longer and two of them are shorter. So if you've got GPU's in different slots or, GPS that are different lengths or heights or whatever else, you're definitely gonna be able to plug in at least two of them, no matter where you're tryna stretch it to. Now, I'm not saying that a configuration like this could never run into issues. For example, if you were to use an Intel Cryo cooler, you would need a six-pin that goes over to your CPU socket. And, actually, no that would reach. Okay. It's looking pretty good, actually. One thing I would like to see Seasonic do actually is include like a reservoir mount or something like that. Some kinda, give some thought to reservoir and pump mounting. There's obvious spots for it. You've got a nice plain panel right here that you could just drill pump mounting holes into, and same for the Rez right here. But if they pre drilled some of those holes, well, then they'd give up some of the clean aesthetic. Okay, I don't know. You can lemme know in the comments if you'd like to Seasonic to give some thought to pre mounted water cooling components. But, other than that, this is like surprisingly thoughtful for a first attempt. Is this Seasonic's first case? Got another 120 millimeter mount down here, if you wanna get some more air flow going to the basement and the power supply area. I don't think it's really strictly speaking necessary, especially 'cause, our power supply is drawing fresh air in from the bottom but man, this is, kinda looking like the way to have completely clean cable management. Not bad, Seasonic, not bad. I'm shocked that you guys had the stones to go out and develop a case to go with this concept. But overall, I think it works way better now that you have it instead of just tryna create something that, like should fit in third-party cases. Lemme know what you guys think in the video. Thanks for watching, and thanks to Seasonic for sponsoring this video. We're probably gonna do a follow-up where we do a full build in the case over on Linus Tech Tips. So make sure you're subscribed to both channels.",
    "transcript_keywords": [
        "Seasonic",
        "power supply",
        "case",
        "RGB",
        "power",
        "Seasonic Connect",
        "front",
        "fans",
        "Kind",
        "Synchro Connect",
        "Connect",
        "supply",
        "Synchro",
        "thing",
        "Synchro case",
        "fan",
        "Seasonic sponsored",
        "back",
        "front panel",
        "Synchro power supply"
    ],
    "transcript_entity_values": [
        "850 watt",
        "Linus Tech Tips",
        "24",
        "secondary",
        "Intel",
        "three",
        "Molex",
        "at least two",
        "chuck",
        "One",
        "one",
        "five volt",
        "12-volt",
        "Seasonic",
        "PWM",
        "the Seasonic Connect",
        "Syncho",
        "120 millimeter",
        "two centimeters",
        "the Synchro Connect",
        "Intel Cryo",
        "the Linus Tech Tips",
        "Asian",
        "Synchro",
        "third",
        "Nicole",
        "Only two",
        "first",
        "these days",
        "two",
        "Boop",
        "Rez",
        "GPU",
        "Seven",
        "12 volt",
        "3.3 volt",
        "Mac",
        "Seasonic",
        "Nidec",
        "SATA",
        "RGB",
        "PCI",
        "12-volt",
        "CPU",
        "140 mils",
        "six",
        "eight",
        "today",
        "ATX",
        "Molex"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "LOC",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG"
    ]
}