{
    "id": "APhrv2uqWSU",
    "title": "My Week with a $330 Laptop",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-07-05T14:41:13Z",
    "video_url": "https://www.youtube.com/watch?v=APhrv2uqWSU",
    "category": "Science & Technology",
    "tags": [
        "laptop",
        "best laptop",
        "cheap laptop",
        "budget laptop",
        "best budget laptop",
        "best cheap laptop",
        "notebook",
        "acer",
        "acer spin 1",
        "spin 1",
        "best laptop 2017 under 500",
        "best budget laptop 2017",
        "austin evans"
    ],
    "views": 833132,
    "likes": 19597,
    "comments_count": 1938,
    "description": "A week with a budget laptop - the $330 Acer Spin 1. Acer Spin 1 on Amazon:  &  The Spin 1 also comes with the Acer Active Stylus which combined with the touchscreen, 360 hinge and Windows Ink will let you draw notes or do graphic work on the laptop.  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://amzn.to/2t2hyQk",
        "http://amzn.to/2ujLTJn",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. This is a $330 laptop and I'm going to be using it for the next week. So a big shoutout to Acer for not only sponsoring this video but also hooking us up with their brand new Spin 1. So this is a little bit more of a budget laptop. What's nice about it is it's actually reasonably portable. You know what, I actually kind of like the look of this. So it's all black and it's got this kind of textured material. It's still plastic but it actually doesn't feel bad. Open this guy up and you'll see it's running a full copy of Windows 10 Home. Considering that this is about the same price as a lot of tablets, it's nice to get the full Windows experience and of course you still do have that touchscreen. Like a lot of Acer laptops these days, you get some flexibility in how you use the Spin 1. So of course you can use it in the standard laptop mode but if you want, you can actually flip it upside down to get display mode, so if you wanna be able to watch videos like this or one of my favorites is tent mode where you flip it upside-down, it's nice if you wanna get a little bit more of a compact form factor or if you wanna use it as a tablet, you can just close it up and use it like that. And that display really is not bad. So it is a rocking a full 1920 by 1080 resolution and it's also an IPS panel. Now that's important as a lot of other budget laptops definitely skimp in the screen department. So we have good color, good contrast, and especially good viewing angles. Hey guys, this is Austin. Is this all the laptop that you need? So the Spin 1 is a solid laptop for video consumption, it's of course powerful enough to stream stuff like 1080p video and with that nice screen and some surprisingly solid speakers, it works well. However, spec-wise, it's not the most powerful laptop in the world. Inside, the Spin 1 has a dual core Intel Celeron processor, four gigabytes of memory, and 32 gigs of storage. So for what I'm going to be doing with it, mostly lighter stuff like web browsing, video watching, and things like email, it's fine, but don't expect it to handle demanding tasks very well. Now that 32 gigs of storage doesn't sound like a lot but thankfully the Spin 1 does have a micro SD card slot so for about $40, you can expand with 128-gig card, which should give you a lot more usability. What's cool is the Spin 1 also comes with a free year of Office 365, which is cool 'cause that like $100 on its own, so at first glance, the Spin 1's not bad but the real test is going to be how does it stack up when I take it on a very very long trip. So I am now on the other side of the world in Shanghai, China, and for the last week or so, the Spin 1 has held up. So I mostly use this as a travel laptop and one of the first things that really jumped out to me was how nice it is to use an 11-inch laptop again. So I've been using a 15-inch laptop for the last few years and while it's nice to have that extra power, having something that's this small and portable was a huge help. So while I do usually use this in laptop mode, being able to flip the screen around and set it on an airline table was helpful. This is a nice hinge, so I think something that I really have to kind of give them props for is that even though this is obviously a more budget-oriented laptop, it doesn't really feel like it. So the plastic is nice, I like the sort of texture, and that hinge that feels really good to flip back and forth so having that 1080p IPS display really does make a big difference, it really does put a lot of laptops that cost over double the price to shame. Having a free year of Office 365 included is also a nice bonus, so I wrote up all the notes for this video inside of Word and it's a nice experience. So the keyboard is surprisingly good on the Spin 1 so it has nice keyboard travel, the layout is solid with the exception of the page up and down keys, which kind of tripped me out a little bit but there's really not a lot to complain about and that same thing goes for the track pad. It wasn't that long ago that if you were buying a budget computer, you could pretty much guarantee that it was going to have a terrible track pad so at this point, I feel like pretty much any Windows 10 laptop I use should have a touchscreen. It does make it a nicer experience to use and I think that kinda goes double for the Spin 1. For something that's so small and so portable, having the option of not only being able to flip around the screen but obviously be able to touch it, use the keyboard, use the track pad, there are a lot of options on how you actually wanna use the laptop. So I watched a lot of video on the Spin 1 over the last few days and for the most part, it's been a solid experience. So apps like Netflix work really well, especially with the offline mode while you're flying. However, there were a few hiccups. So that Celeron processor is decent for more basic uses but for unoptimized apps such as iTunes, it does struggle just a little bit. Considering the price, the main competitor to something like the Spin 1 is going to be a Chromebook and don't get me wrong, I do like Chrome OS, however, personally for me, I do like having a full version of Windows 10 but you are going to have to deal with some compromises. One area where the lower specs are helpful is with battery life. So even when you're doing fairly demanding tasks, I never saw the battery life estimate drop below around seven hours and when you're doing lighter stuff like web browsing and email, you should expect over 10 hours. Long story short, the Spin 1 should easily be able to make it through a full day without needing to hit the charger. So is the Spin 1 my new daily driver? No. I have to do stuff like 4k video editing on a regular basis and put simply, this just is not up to it. However, if you're going to class all day, taking notes, web browsing and that kind of stuff, then this is pretty solid. Sure, it would be nice if it was a little bit more powerful but there's really not a lot to complain about besides that. Anyway, what do you guys think about the Spin 1? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Spin",
        "laptop",
        "nice",
        "lot",
        "video",
        "Windows",
        "kind",
        "full",
        "bit",
        "flip",
        "stuff",
        "mode",
        "solid",
        "good",
        "laptops",
        "laptop mode",
        "Acer laptops",
        "screen",
        "experience",
        "Acer"
    ],
    "transcript_entity_values": [
        "Shanghai",
        "daily",
        "a full day",
        "15-inch",
        "Chrome",
        "a free year",
        "Celeron",
        "the next week",
        "1080",
        "first",
        "four gigabytes",
        "China",
        "11-inch",
        "330",
        "the last few days",
        "Acer",
        "Austin",
        "IPS",
        "about $40",
        "Windows 10",
        "Windows",
        "like $100",
        "10 hours",
        "Celeron",
        "Austin",
        "these days",
        "one",
        "32",
        "iTunes",
        "Windows 10 Home",
        "128",
        "the last week",
        "the Spin 1",
        "Intel",
        "all day",
        "SD",
        "Chromebook",
        "1080p",
        "4k",
        "Spin 1",
        "the last few years",
        "1920",
        "One",
        "around seven hours",
        "Netflix"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "TIME",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG"
    ]
}