{
    "id": "Apq2VFUgOHk",
    "title": "Unboxing a freaking laser - Glowforge Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-09T20:33:16Z",
    "video_url": "https://www.youtube.com/watch?v=Apq2VFUgOHk",
    "category": "People & Blogs",
    "tags": [
        "laser",
        "engraver",
        "crafts",
        "cutting",
        "precision",
        "DIY",
        "custom",
        "Glowforge",
        "unboxing",
        "cloud",
        "easy to use"
    ],
    "views": 467632,
    "likes": 20934,
    "comments_count": 691,
    "description": "Alex has been asking us for months for a new laser for engraving and cutting... he finally got his wish, but he has to unbox it first.   Check out the Glowforge 3D Laser printer through our affiliate link and get up to $500 off their model lineup at   Buy Laser Engraving Material On Amazon (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "http://glowforge.com/shortcircuit",
        "https://geni.us/jNjNMSy",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Oh, man. I am excited 'cause right now we get to have the largest unboxing on short circuit. Well, not this one right here. We have (groaning) this whole thing right here to unbox here today. It's a laser cutter, you already know that from the title. I wanna start with the little one, 'cause I know that this one's a laser cutter, the other one's a filter, but I have legitimately no clue what's in this box right here. So this right here, you would put your work on top of this laser shoots down and then curves out your stuff. Everything's kind of in this direction. So the amount of area here that the laser is actually hitting is pretty small, which is great because if this was just like a flat piece of metal, it would heat up a whole bunch. Cool, we've also got... We've got a dryer vent here that's probably for ventilation. So there's two big problems with our current laser cutter. It's not very repeatable. So like if you want to cut a circle and then you go and cut that same circle again, it's not gonna line up quite perfectly. It's just not very good and also like not repeatable and not reliable. This right here is the optional filter. So you don't necessarily have to get this and our plan for the old laser cutter was to put it into a fume hood that strikes all the fumes, shoots them up out of the ceiling throwing some filters and crap. But this is way cheaper. It's like a thousand bucks and you can put it literally anywhere. So we don't have to worry about, where we put it and put the fume hood in is a permanent thing. We're definitely putting it to new for now. So the fun thing about this is that you don't need to bother venting it like out a window or anything. You just place it wherever and you are good to go. So we went for the Pro model because it's the biggest and it's the fastest and it's the most powerful. So this right here has 45 Watts of lasering power. That's only marginally more than what we have right now. Our current one is 40 Watts. And the difference you're going to feel between those two is basically nothing, but this should be because like I trust it. We should be able to push it way faster than our current one. It's very well packed. Just come in and look at this. This thing is not going anywhere. Another huge advantage of this laser over our last one is that this is a pre-built kit. You basically just unbox it and we should have relatively little setup before able to actually get cutting things. Whereas the last one, I think it took a week and a half. It's interesting that they have the laser just sitting out like this, like in ours, it's in a rear compartment, which I guess that is kind of how they allow for the pass through. So on this one right here, your cut size is 19 and a half inches kind of like this way by infinity, they say. So there's a pass through here and on the back, so you can just feed material through it and then as long as it's not too wide, you can just, (groaning) So this is what actually is going to focus the laser, I imagine. So the laser shoots out this way, providing 40 watts power into the mirror back there, it'll bounce and come around and then come out of this little lens right here. That goes in there and this just magnets on, is that how it works? So I just went to setup.glowforge.com, and the first thing that it's making me do is create a Glowforge account. So that kind of brings up one of the big problems with this, which is that, it's always connected to the internet and that's how you get files to and from it. This was something that was a really big problem at first because if the company goes under a year, basically left with a big old paper paperweight, it is a bit better now because they have... I think it's called Open Forge. It was like a GitHub thing, all the source codes there. You can take it and run it on other software, but not super easily. Like, I would really like it if we could have the web app for people that sort of know what they're doing, but don't entirely know. Then, like if we could just run like LightBurn on it or something for like me and Colin, where we actually know what this thing is capable of and like really get into the nitty gritty with it. Be really careful when you're moving steppers. Just because if you move them too fast, they will put current through everything, which is not great for your electronics. Oh, it just sits down in there. Kinda arrives in a spot where it feels good. It's the clamping on with this thing that you kinda use your hands to pull apart, which is just not as good as if they had used the ones where it's like a screw, 'cause then you can like get it in place and then tighten it much easier. If I was them, I definitely would've saved the money by using these ones. I think this one's like $4,500, so it's not a cheap option for sure. Hey, it's water cooled. Look at that. You can see the water pumping right through here. I'm guessing that it has some sort of anti-microbial stuff in there, so it doesn't get on nasty pants. So one of the things that you want in a laser cutter is for air to be blasted kind of right at your target just as like fire suppression. So instead of, like the wood that you're cutting out, catching on fire, it just blows it out basically. Connect to electrical power. Did it? Yeah. So that's being always connected to the internet is both good and bad like for one it's always connected to the internet. Do you really want that? But on the other hand, like you're able to print from. Damn it! It's not print. You're able to cut it, stuff from your phone or like from like a tablet or from the other side of the office. So you don't need to be like right there, which is nice, but at the same time, I don't know, I'm not running a laser cutter without being decided 'cause things can catch on fire. (mumbling) So I need a bit of material to cut here. I think this will do just fine, right around 0.4 of an inch. So we've got that in there. So if I close this, is it going to show me what that's at? Oh, there we go. It did it. Good job. It has a camera and now I can just take the thing that I want to cut. Toss it on there. Actually, that's really the (murmuring). We're not gonna cut, we're gonna engrave it. So we're gonna put it right there. Enter settings. Well, let's say the power is 21, sure. Speed, 500. Let's see how fast it goes. So I have heard this camera's quite accurate in the middle, but as you get over to the sides, it can be like a quarter of an inch out, which is not ideal, although apparently you can calibrate it and get it down to like within a sixteenth, across the whole bed. Either way, it's way better than what we were doing before, which was basically just eyeballing it and doing like the print area and just kind of hoping that it sort of landed where you wanted it. Quite a big pane for like K side panels where you got one shot and then just done. Precision power. Auto-focus height in inches, 0.4. Number of passes, we'll do one... 21, sounds fine, actually let's drop that a tiny bit. 16, let's say. Speed, 500. Can we go faster? What happens if I type in 1000? No, it won't let me do that. 500.4. Enter. Back. Use uncertified material. Good God. All right, 0.4, submit. So that should be right there, ready. Print. So it does sound like there is some air pushing down. This thing is not quiet. (cutter roaring) We want to up the laser power a tiny bit for the next go. That is not enough. I have to say it's not super duper fast compared to something like, I don't know a Trotec, those things are way faster, but I don't know, that's way faster than our old ones. That was clearly not fast enough. Oh, that was at a power of one. Let's say power of 32. So this also is a good way to check the repeatability. So we have these tiny little lines in there you probably can't even see on camera and if we hit print and it lands right on those lines again, then we're in pretty good shape. So one thing that is cool about this is that it can laser etch on things that aren't completely flat. It does seem like it's taking half a while, but on the other one, you'd have to manually go in and set up the focus distance. So this is saving us heaps of time. So I don't like how it's kind of pausing there. Like you see how it's doing the different segments and then stopping for a second. That can mean that like, you can get a bit of fire if it stops. I can't tell if it's modulating the laser while it's doing that. That was pretty good though and looking, yeah, I can't see the other lines at all. So I'm guessing that it hit them pretty much dead on. It's been just under an hour and we've done our first little laser engrave here. That's awesome. Compared to the last one, I took like a week and a half. Get subscribed, click the affiliate link I guess, if you want to buy one of these and I don't know, I'll see you later. I'm excited to use this thing.",
    "transcript_keywords": [
        "laser",
        "laser cutter",
        "thing",
        "good",
        "kind",
        "power",
        "put",
        "things",
        "cut",
        "cutter",
        "big",
        "basically",
        "laser shoots",
        "current laser cutter",
        "bit",
        "print",
        "current",
        "Watts",
        "half",
        "fire"
    ],
    "transcript_entity_values": [
        "a thousand bucks",
        "half",
        "32",
        "40",
        "Open Forge",
        "one",
        "500.4",
        "a week and a half",
        "second",
        "Watts",
        "0.4",
        "just under an hour",
        "under a year",
        "Trotec",
        "first",
        "16",
        "two",
        "500",
        "45",
        "around 0.4",
        "GitHub",
        "1000",
        "4,500",
        "21",
        "a sixteenth",
        "Colin",
        "today",
        "19 and a half inches"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "LOC",
        "CARDINAL",
        "TIME",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "QUANTITY"
    ]
}