{
    "id": "apr63p7K_3A",
    "title": "The OSI Model is a lie! | Free CCNA 200-301 Course | Video #8",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-08-02T14:09:30Z",
    "video_url": "https://www.youtube.com/watch?v=apr63p7K_3A",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "osi model",
        "osi layer",
        "tcp/ip",
        "tcp ip",
        "tcp ip model",
        "ccna 200-301",
        "200-301",
        "ccna exam",
        "free ccna",
        "ccna study",
        "ccna training",
        "cisco ccna",
        "ccna certification",
        "new ccna",
        "ccna full course",
        "ccna 2020",
        "ccna fundamentals",
        "best ccna",
        "ccna tutorial",
        "cisco",
        "cisco ccna certification",
        "ccna course",
        "ccna course for beginners",
        "ccna networking",
        "networking",
        "networking course",
        "network fundamentals",
        "network topology",
        "cisco certification",
        "networking basics",
        "ccna 200-301 full course"
    ],
    "views": 68050,
    "likes": 1913,
    "comments_count": 135,
    "description": "What are the OSI and TCP/IP models? Why do we care? And why do some people say the OSI model is a lie? Time to find out! DavidBombal.com: CCNA ($10):  support the mission, join thisisIT:   My advice: Don't get caught up in the debates. Learn what is important for the CCNA exam which is the TCP/IP model. Know your protocols, but don't get too concerned about where everything fits. Nothing in life is simple.  This is video #8 of my FREE CCNA Course 200-301 - a complete CCNA course for the new Cisco CCNA exam. I am going to be covering all the topics in the exam blueprint in this course.   I want to make this content practical and it will include a lots of labs and demonstrations to help you better understand topics on the exam.  The course will contain: - Videos - Labs using Cisco Packet Tracer - Quiz Questions - And more!  Menu: Overview: 0:00 What we want: 0:26 OSI Model: 1:50 OSI Rants: 2:15 Protocol stacks and models: 4:00 Various models: 5:08 Why do we use models? 6:01 What you need to know: 8:05 Packet Tracer Lab: 9:52 Thank you to my supporters: 10:21  Packet Tracer lab (covered in subsequent videos):   CCNA 200-301 Playlist:   Ivan:  Rob:   Support me via thisisIT: support the mission, join thisisIT:   Or, buy the CCNA course and support me: DavidBombal.com: CCNA ($10):  Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   ====================== Special Offers: ====================== Cisco Press: Up to 50% discount Save every day on Cisco Press learning products! Use discount code BOMBAL during checkout to save 35% on print books (plus free shipping in the U.S.), 45% on eBooks, and 50% on video courses and simulator software. Offer expires December 31, 2020. Shop now.  Link: bit.ly/ciscopress50  Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  CCNA Free CCNA 200-301 ccna 200-301 free ccna course network networking thisisit osi model tcp/ip model  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!    #ccna #tcpip #networking",
    "description_links": [
        "http://bit.ly/yt999ccna",
        "https://bit.ly/thisisitccna",
        "https://bit.ly/tcpipmodellab",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKPc2RecyiM_A9nf3fUU3e6g",
        "https://bit.ly/ivanosi",
        "https://bit.ly/robOSI",
        "https://bit.ly/thisisitccna",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- How many layers are there in networking? Do we have a four layer TCP/IP model or perhaps a five layer TCP/IP model? Or do we have a seven layer OSI model? How many layers are there? Why do we actually care? (upbeat music) We want standardization. The reason why I can take a copper Ethernet cable, such as this, which has a RJ45 connector. Now we won't get into the details. It's actually got a different name, but most of us refer to this as an RJ45 connector. I wanna be able to take this and plug it into an HP laptop, plug it into it to Toshiba laptop, plug it into an ASUS laptop. We won't worry about pronunciations for now, but the moral of the story is I can take this cable and plug it into different laptops because this interface has been standardized and different vendors have agreed to create the equipment to the specification or to the standard. That makes life a lot easier. In the old, old days, vendors just did what they wanted to. They developed their own protocols and their own specifications, which wasn't good for customers. It was great for the vendor because if you bought the equipment, you are locked into that vendor. We don't want that as a customer. As a customer, we wanna be able to buy equipment from different vendors and they should all be able to work together. So because of standardization and because of the industry agreeing on specific models, this cable can plug into different vendor devices without any problems. We take that for granted today, but it was not always the case. Now in the previous version of the CCNA, we were taught the OSI model, which consists of seven layers. Starting at the top, it's inverted. So from layer seven to layer one. All people sleeping through networking don't pass. Well, that's not actually what it is. It's actually application, presentation, session, transport, network, data link, and physical layer. Now that caused a lot of confusion. A lot of people have debated how relevant the OSI model is in today's networks. Have a look here on Twitter. Rob tweeted, I've got three hours to kill in an airport lounge, and I'm gonna discuss the OSI model. There's no such thing. What they taught you is a lie and they knew it, but they didn't care. And that's interesting. People in the real world are saying that the OSI model is rubbish. Other people are saying, well, that's not true. The OSI model is required. Now, Ivan is someone that I recommend that you follow on Twitter or go to his website and sign up for his free courses. Ivan is someone who doesn't mess around, as in he speaks what he thinks. He will tell you what is true and what is not true. I highly recommend that you follow Ivan and perhaps take some of his free courses. If nothing else, follow him on Twitter and read his blog posts. Now, if you're really new to networking, you may not understand everything that he talks about. Don't worry, most of us struggle with some of the concepts. Ivan is really intelligent, has years and years of experience. But if you wanna learn from someone who has got lots of experience and can help you in your networking career, follow him on Twitter. Now basically in his response, Ivan is saying that we do need the OSI model and if people had followed the OSI model, life would be a lot simpler today. Now I don't wanna muddy the waters just as you're starting with the OSI model and the TCP/IP model. Again, I'll tell you what you need to know for the exam, but just note that nothing in life is as simple as it seems sometimes. There are gray areas. In the OSI model and the TCP/IP model, they're taking what's called a protocol stack. In other words, different protocols that do different things and they try and put it into neat layers. Now that's not always clear cut, and it's not always possible to take protocols and put them neatly into individual layers because some developers have programmed the applications to do things that supposedly they shouldn't be doing. We are told in the CCNA course that specific layers should talk to specific layers, but that doesn't always happen that way. So moral of the story is for the real world, things get more complicated and people get into these rants or discussions, if you like, about the OSI model is rubbish, or we shouldn't be learning the OSI model. We shouldn't be learning the TCP/IP model. And then people quote stuff from various CCNA books showing an original TCP/IP model and an updated TCP/IP model. And just to further complicate it, here's a whole range of different models. Now the original model comes from RFC 1122. This is a four layer model. We have what's called an application layer, transport layer, internet layer, and link layer. The Cisco Academy talks about internet model being application, transport, internet work, and network interface. But then on Wikipedia here, they start quoting different books. And what you'll notice, we have a five layer TCP/IP model and then a four plus one layer. And then right at the end, we have a seven layer OSI model. Now the OSI model, once again, is what was taught in previous versions of the CCNA. In this version of the CCNA, they are teaching the so-called five layer TCP/IP model, which is a combination of the original RFC 1122 TCP/IP model and the OSI model. So basically it's a hybrid of multiple models. Now, the reason we have a model is we're taking a complex problem and we're breaking it up into smaller components or smaller pieces. This has been done for many, many years. The Romans had a divide and conquer policy. So we divide a problem into smaller parts. And then we conquer smaller parts rather than trying to do everything in one go. Models are used in many places. As an example, if you're building a house, you typically have a blueprint or a model of what the house is gonna look like. So before you even dig the foundations, a model is created or a blueprint is created of what the house is gonna look like. It makes a lot more sense to create a blueprint of a house and then have specific people work on specific parts of the building and do what they good at. So, as an example, a plumber will work on the plumbing. An electrician will concentrate on the electricity. A bricklayer will concentrate on laying the bricks. But they all work together to create the end result, which is the house that you want built. It's gonna be much easier to have a blueprint or a model that everyone works towards to build something rather than them just arriving on site and then saying, let's build this house, but they don't actually know what the house looks like. You have an electrician working on the plumbing. Or a plumber working on bricklaying. That's not gonna scale very well. So we have a model of a network and then we have specific layers or specific components or subunits, if you like, that people specialize in and concentrate on that layer. So manufacturer of fiber cables concentrates on building this to a specification. If you're a application developer, you don't worry so much about the physical layer or how data is transmitted from, let's say, the U.S. to Europe, across the Atlantic using light under this ocean. You concentrate on building your application. So we have different layers in the OSI model and different people concentrate on different layers. Now, the layers that we as networking people concentrate on are the lower four layers, which in the OSI model are called transport, network, data link and physical. In the new version of the CCNA, they are using this hybrid model where they've taken parts of the OSI model and added it to the TCP/IP model. So rather than the original model of just a link layer or network interface layer, we actually have what's called the data link layer, which is called layer two. And the physical layer, which is layer one. We are counting upwards through the layers from layer one being the physical layer. So ignoring all the debates and all the wars, if you like, on Twitter about which model is important and why we care about models, this is what you need to know. You need to know both the OSI model and TCP/IP model, but concentrate on the TCP/IP model. The OSI model, which consists of these seven layers, physical layer, data link layer, network layer, transport layer, session layer, presentation layer, and application layer, isn't as important as the TCP/IP hybrid model, if you like. So a five layer TCP/IP model, which is more real world, which has a physical layer, data link layer, network layer, transport layer, and a combined application layer. But notice, we talk about layer seven applications because of the history of the OSI model being used. So notice we have layer one, layer two, layer three, layer four. Those are the layers that we concentrate on as a networking person. And then we have a combined layer five to layer seven, called the application layer, but we still refer to it as application layer. Now I'm gonna show you this practically using Packet Tracer, but I want you to download this yourself and try it. So don't just follow me, do this yourself and see if you can answer some of these questions yourself and see if you can understand the various layers. In Packet Tracer, they still have the seven layers of the OSI model, but what you'll notice is layer five and layer six are basically ignored for the most part. We concentrate on the lower four layers and then layer seven, the application layer. (upbeat music)",
    "transcript_keywords": [
        "OSI model",
        "model",
        "layer",
        "OSI",
        "layer OSI model",
        "TCP",
        "layer TCP",
        "layers",
        "layer OSI",
        "application layer",
        "physical layer",
        "people",
        "application",
        "CCNA",
        "link layer",
        "models",
        "concentrate",
        "Twitter",
        "Ivan",
        "network"
    ],
    "transcript_entity_values": [
        "six",
        "three",
        "Ivan",
        "Toshiba",
        "RJ45",
        "seven",
        "five",
        "four",
        "two",
        "1122",
        "CCNA",
        "years",
        "Twitter",
        "Europe",
        "The Cisco Academy",
        "today",
        "Packet Tracer",
        "IP",
        "Packet Tracer",
        "HP",
        "Romans",
        "one",
        "Atlantic",
        "1122 TCP",
        "U.S.",
        "ASUS",
        "CCNA",
        "three hours",
        "TCP",
        "Twitter",
        "OSI",
        "Wikipedia",
        "Rob"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "DATE",
        "PERSON",
        "LOC",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "CARDINAL",
        "LOC",
        "MONEY",
        "GPE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}