{
    "id": "apt0ciQyyuY",
    "title": "The USB Lie Detector.",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-02-13T19:08:28Z",
    "video_url": "https://www.youtube.com/watch?v=apt0ciQyyuY",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "usb",
        "lie detector",
        "polygraph",
        "gadgets",
        "weird gadgets",
        "tech",
        "technology",
        "review",
        "quiz",
        "game"
    ],
    "views": 99000,
    "likes": 4654,
    "comments_count": 167,
    "description": "Finally we'll get the TRUTH out of Austin Evans.   Test your self!   I built a Laptop:  Why the PS5 is LOSING Money:  Fast Food Tier List:  I sold my body on Amazon.com:   Reddit is Killing GameStop    Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    By using our Amazon affiliate links we may receive compensation for purchases through those links.  Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://austin.tech/usbpolygraph",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/uOtEOcBAxys",
        "https://youtu.be/ayPHtwncuGU",
        "https://youtu.be/s5BfSwLa1T4",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- [Matt] Do you think This Is is good? - No. - Interesting. That was truthful. (giggles) No spike, no spike whatsoever. (dramatic music) Hello and welcome to This Is. Austin. - No. - Are you a big guilty liar? - No, no, I'm not doing this. They didn't even print the label on the box straight. Lie detector machine, home lie detector machine. Why are there multiple stickers here? What's underneath that? What are you hiding? What's underneath the other sticker, Matt? - Lies. In our search on Amazon.com, maybe you've heard of it, I came across what I think might be the most ridiculous product on Amazon. I think this is absurd. So this right here is a USB polygraph lie detector test. Now there are about five different versions of this in various price ranges. Your credit card can rest easy. I got the cheapest one. - Oh, thank you. Thank you for getting me the worst version. - This is the home grade, and it goes all the way up to like, police grade and then military grade, but mainly because they show the box and it's the same exact box. - [Austin] It's the same box. - So yeah, I am interested in, I'm like, I half want this to be military grade. - So here's the thing. Artificial intelligence, pulse, breathing, sweat, body language. So the thing is, a real lie detector actually does use these things, although let's be clear, polygraphs aren't really useful and you can't use them in like court or anything, unlike every TV show tries to make it seem. - Since pretty much the invention of the polygraph, there's been a lot of dispute whether the science actually works. It does measure things, and there's no magical way to tell like, yes, you're lying, no, you're not lying. What it does is it takes a list of controls and says, all right, I'm going to ask you, is your name Austin? Yes, no. It gets your, it gets your pulse, your heart rate, but that is your pulse, whatever. It takes all that information, and then it compares it to asking a question that's a lie. There's also the weird psychological aspect of it is what is it you believe it to be true or not? So I'm going to ask Austin a bunch of questions and we're going to see if he's telling the truth. - I will be lying 100% of the time. - You can't, you can't lie 100% of the time. - Yeah, you can. This Is makes good videos. - All right. - Matt, you're incredibly attractive and handsome. (video beeping) - I don't know if this is going to work at all. - It's not, no. Look, this is a USB lie detector from Amazon. It is not going to work, but it has the trappings of something that will work. - That's why I've taken precautions. This one. - Oh no, no, no. - This one is a lot more efficient. - Oh, no. I hate the zappy things. Oh God. - [Matt] So this one. - I knew you were hiding something. - This one is severe vibration and yelling. - I don't think it's vibration. I bet it's going to shock me. I hate the shocking. The shocking, look, we've done lots of videos where I've gotten shocked. - [Matt] All right, if you want to be lying 100% of the time, if you lied you must be punished. - See, there's vibration mode, Matt. Let's use that, let's not use current mode. I don't want any more current. USB polygraph 2.5.1. Click here to download. This, do you see this website? Can I just show this on the camera real quick? Look at what this website looks like right now. This is what we're working with. The first version of it came out in 2009 and they just update, 2011, 2015, '16, '17, '17, '19. This came out in May 22nd, 19, 2000 - Do you know how to read dates? Geez. - I'm nervous, Matt. - [Matt] Ooh, we are setting up a device, USB Polygraph Three. - [Austin] Great, I'm glad we're on the third iteration of this. - All right, so for complete accuracy and authenticity, I think you need to be shirtless because we don't know if this is going to be able to go through your shirt or whatnot. So take it off, boy. Take it off, boy. Take it off, boy. - All right. So I have now activated my skin galvanizer, my heart rate monitor, and my chesticular device. - Oh, okay, all right. We're actually, we have, we actually have something here. We have meters. It's metering something. I don't know what it is. So I am seeing something and I'm just going to try. - Ow! - [Matt] Oh! - [Austin] It hurt. - Oh, okay. So it at least does something. All right, we've confirmed it does something. I'm gonna hit start on this. (mechanical whooshing) - Ah, it just shocked me. - [Matt] It has red spiked you a little bit. What? All right. - [Austin] One at a time, one at a time. - All right, all right. I'm going to ask you the same questions. - Okay, I'm going to be very calm. I'm gonna stare directly into the camera. I'm gonna do my best to lie for every question. - No, you can't. - No, you have to answer, answer truthfully. I've given you, I've given you, I got some base questions for you. - Okay. - I will say that the pinch I gave you was significantly higher than the sh. - I didn't get shocked. I was ready for the shock. I didn't really get shocked. - Okay. - All right. - All right. You ever felt sad? - [Austin] Yes. - Have you ever used illegal drugs? - Yes. - [Matt] Now it did want me to ask you to elaborate on these to gain a confession. - I will pass on that particular observation. - You just admitted to it. If you, if you tell us what you've done, I can commune your sent, I can cut you a deal and get you a lower sentence. - I would like, I'd like to speak to my attorney please. - For the record, I'm going to point out here, big old spike, big old spike here. Ooh, hoo hoo. - I'm gonna return to baseline. I'm going to answer truthfully so the lie detector can prove that I am a truth teller. - [Matt] Do you think This Is is good? - No. - Interesting. That was truthful. (laughing) No spike whatsoever. Could not be any, oh. - [Austin] I'm laughing now. - We've got a spike now of him laughing at how bad he thinks this is. Please state your middle name. - Jeremiah. - Huh. That was a lie. - I don't know why that would be a lie. - That was a big lie according to this spike. - [Ken] Does it even start with a J? - Yes. - [Matt] No, nothing. - [Austin] Okay. - Nothing. Did you try to lie to me today? - No. - So that was a lie, and so was the J, but they're, they're much smaller spikes, so. - Less conclusive, probably means I'm telling the truth. - Have you told me the complete truth since we have been talking? - Yes. - Analyzing. That was a lie right there, right there. Do you know the rapper Logic? - Yes. - That's truth. Please tell me what, what Logic is like. - He's a very pleasant guy, a very charismatic guy. Very, very kind. - It's hard to, it's hard for me to keep myself down here. - Yeah, I think that was a big part of this if you're actually doing it legitimately is you've got to just be very calm and no laughing and just be very serious. - Right. Are you sponsored by Apple? - No. - Uh oh, little tiny spot. No, I think that's just you talking. - So I'm not sponsored by Apple. I'm telling the truth yet again? - We'll find out on the next one. - [Austin] Okay. - Are you sponsored by Microsoft? - I have been. - So there's fluctuation and hesitation, but you admit to it. - [Austin] Well, it's not a yes or no answer. - Please elaborate. - The last time I was sponsored by Microsoft was, we did a build for Karl-Anthony Towns with iJustine, and that was three or four months ago. - What about before that? - Before that, we actually did another PC build for them for the game Grounded. - Okay. Have you ever thought about firing Ken? - Yes. - It's about as baseline as it gets. Just flat. (laughing) Have you ever thought about firing me? - [Austin] Yes. - That one spiked a little bit. Right there. Do you actually just enjoy having your shirt off on camera all the time? - No. - It's truth. That's the truth. The machine has detected irregularities. Next, would you like to explain any of the answers? - Sure, I would be happy to. - What is your middle name? Would you like to explain that? That was a lie. - Jeremiah, it's my granddad's name. - You're trying to lie some more. That's not explaining your lie. That's just lying more. - Well, I, it's, it's not a lie. I'm explaining where that name came from and why it's my middle name. - [Matt] I'm looking at it and here, yeah, all the ones that you lied about, if we bring it back. - I didn't lie. - You did lie. - No, I didn't. - So knowing you, I know, like here's asking what your middle name was. - [Austin] Uh huh. - So from here to here is that lie. Now this green line pretty much did not change at all. You didn't, I'm assuming that's like, presp, perspiration. Nice and cool in here, whatever. These are not life and death questions, so the blue line only moved a couple of times but not enough to, for like me to actually see anything but the red line, which I'm assuming is his heartbeat. Did you try and lie to me today? No, well you did. Are you sponsored by Apple? This is the one that I actually said it was a microspike but not enough to, not enough to say like. - Basically what we're trying to say here is that the USB lie detector doesn't work at all and that I was 100% truthful and in no way would I ever lie to anyone ever. - When I pinched you, that's what happened. So is this an accurate reading? Yes and no. Yes, it's reading something semi-accurately, but there's also something here that I know he lied about, and I'm not going to tell you which one it is, even though you're all just gonna assume it's Microsoft. (laughing) - I will actually say I lied on two other occasions that I don't think you picked up. - Which ones? - I'm not gonna tell you. What did it say about firing you guys? - Completely, completely truthful. Like, like that is the least amount of movement. - When I said yes? - Yeah, so here's Ken. - [Austin] Wow. - [Matt] Here's Ken, nothing, like. - I was stonefaced. Okay, and then yours was the same. - [Matt] Up to here. - [Austin] Okay, so it didn't catch that. - So you lied about firing me and Ken. - Did lie about it. - You did not, you've never thought about firing Ken or I? - Not really, no. - Not really or not at all? - I mean, in a way of like, I wish I could shut the company down and live in Hawaii for the rest of my life, yes, but not beyond that, no. - I'm actually glad that you bring that point up. - Okay, go ahead. - Not, not the living in Hawaii part, whatever, (giggling) but this is why lie detectors don't actually, aren't, aren't truthful. Did he think about firing us is a very wide term that yes, he thought about firing us, but he didn't think about firing us for like, malicious purposes or anything like that. - I'll actually say that this pretty much was completely accurate then. Realistically, out of all the questions, it was much better than I thought. - Now again, like, should you be hooking up your girlfriend to this and asking her if? - If your (boop) is small? (laughing) - Guys, if you got to ask, it is. - Now, yeah, sure there's the military version, the ones that are more expensive. If you use this as for fun and games, right, I think you can actually have like, it's, it's, it's legit enough that I am honestly impressed with it, and I think that if you were maybe used to this and you actually to get some information on your little brother, on whether he stole cookies out of the cookie jar. I, this is great. - Well, I want to do this with ones where I don't know the answer. You know I know your middle name. - [Austin] Yeah. - Does that, does that make it easier for you to lie to me? - I could tell my heart rate went up when you asked me that question. I tried to be very stonefaced and cool with it but I could feel my heart rate like, elevate. - And it does, and it does show that your heart rate elevated. - I just think part of that is also the breath but I actually don't totally understand what the red line is. - Yeah, so like I don't think we're getting enough information here. - Red is pulse. - [Matt] Oh yeah. - Green is skin galvanization and blue is breath jitter. So pulse really is the main thing that was moving. - Again, this is so tiny on the screen. - It's very small, very small. - So Matt, I think we actually have to give this a pass. This worked better than we expected, and while you shouldn't use it for nefarious purposes, for a fun YouTube video, see if your old uncle Austin's lying to you, I think it does the trick. - Yeah. Let us know in the comments what you think, what I should have asked Austin, because let's face it. We can do more of these if you like it. I can ask him whatever you guys want as long as it's a yes or no question, and we'll see you in the next time, except when me and Ken are fired and he's in Hawaii. - I'm going to Hawaii, bye.",
    "transcript_keywords": [
        "Lie",
        "Lie detector",
        "USB lie detector",
        "yeah",
        "USB lie",
        "USB polygraph lie",
        "USB polygraph",
        "truth",
        "detector",
        "USB",
        "time",
        "Austin",
        "Matt",
        "spike",
        "Ken",
        "Lie detector machine",
        "polygraph lie detector",
        "lying",
        "firing",
        "questions"
    ],
    "transcript_entity_values": [
        "2015",
        "'16, '17, '17, '19",
        "one",
        "third",
        "Apple",
        "three or four months ago",
        "USB",
        "2.5.1",
        "today",
        "2000",
        "Jeremiah",
        "Karl-Anthony Towns",
        "iJustine",
        "Matt",
        "Three",
        "19",
        "100%",
        "Austin",
        "half",
        "zappy",
        "two",
        "2009",
        "Amazon",
        "about five",
        "Amazon.com",
        "2011",
        "Microsoft",
        "first",
        "Ken",
        "Hawaii",
        "May 22nd"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "GPE",
        "DATE"
    ]
}