{
    "id": "AREK4H8k7Ng",
    "title": "I Did a Terrible Job of This - Intel $5,000 Extreme Tech Upgrade",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-07-23T16:59:24Z",
    "video_url": "https://www.youtube.com/watch?v=AREK4H8k7Ng",
    "category": "Science & Technology",
    "tags": [],
    "views": 3377734,
    "likes": 101244,
    "comments_count": 4019,
    "description": "Thanks to Intel for continuing to sponsor this series! Buy an Intel CORE 12700K:   Buy an Intel i7-12700K CPU on Amazon:   Buy an EK360AIO on Amazon:   Buy a Noctua NH-D15 on Amazon:   Buy an MSI MPG Z690 Edge Motherboard on Amazon:   Buy G.SKILL TridentZ RGB on Amazon:   Buy an EVGA RTX 3090 XC3 ULTRA GAMING on Amazon:   Buy an HX1000 PSU on Amazon:   Buy a Samsung 980 Pro 1TB on Amazon:   Buy a Seagate Ironwolf Pro 4TB on Amazon:   Buy a Logitech G305 Lightspeed on Amazon:   Buy a GoXLR Mixer on Amazon:   Check out the Sony Alpha ZV-E10 at   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Intro 0:55 - Nick's special collections 2:23 - Nick's battle station 4:44 - The Parts! 6:17 - Drives and RAM 7:06 - Ergonomics take an L 7:36 - The first computer: A blanket of dust 9:50 - Enough thermal paste? 10:08 - LTT Screwdriver Update! 11:37 - Tearing down the second computer! 13:18 - Linus hates the second computer 15:06 - Moment of truth for the GPU 16:56 - Linus almost breaks the glass 20:15 - Camera Upgrade 22:20 - Ergonomic gaming postures 23:02 - Testing the setup 26:24 - Conclusion",
    "description_links": [
        "https://geni.us/BoeG",
        "https://geni.us/z4F25HY",
        "https://geni.us/sLs5eo",
        "https://geni.us/AyZp",
        "https://geni.us/Kle7EJ",
        "https://geni.us/tr424W",
        "https://geni.us/PHAoKD",
        "https://geni.us/ZjS9r",
        "https://geni.us/ER4UWl",
        "https://geni.us/pGXxI",
        "https://geni.us/aB1SW",
        "https://geni.us/2pNDyo",
        "https://geni.us/Qamp6I",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Oh, yeah! The question we'll be answering today is what kind of Intel Extreme $5,000 tech upgrade. Would you get the LTT writer who already has an amazing setup? Spoiler? It apparently includes an RTX 3090. - This is mine though. - You're the first to go RTX 3090! - I know. - This is gonna be an interesting one folks, because not only is Plouffe's place full of stolen LTT property. Like this prototype CPU pillow dog bed. - [Nicholas] Colin gave me that - But it is full of all kinds of weird stuff. - [Nicholas] Yeah. - [Linus] Your house has a lot of character, dude. - Thanks Linus. (intro music) - First of all, I gotta say respect, right? I use Trello for my personal shopping list and to assign chores to my kids and stuff. - Really? - Yeah. If it's good enough to organize at work, it's good enough to organize at home. - That's a good point, yeah. - Right? - Yeah. Yeah, I bought a whiteboard years ago and I just kind of always get one if I get rid of the old one when I move. - Mmhmm, see, I think that's a lie because I'm not convinced you ever get rid of anything. - No, no, no. - Here's a whole bunch of Gateron black switches. - When you work at game studios, there's always people selling memorabilia. And a lot of the time it's not selling, it's just, hey, I don't want this anymore. - That explains a lot. - Yeah. - God, this is a lot of Magic: the Gathering. - [Nicholas] Yeah. I have a couple other. - Ooh. To Midgard! Whoa! - [Nicholas] So those are each like a commander deck. Be careful. Some of those are like several hundred dollars each. - Really? - [Nicholas] Yeah. Each deck is like a few hundred bucks. If you look, I got a lot of shiny foil cards. Some of those are like 50 bucks a card, a hundred bucks a card. - You've got some frauds in here. - [Nicholas] Yeah, yeah, yeah. - You've got some fake cards. - [Nicholas] Yeah - This looks like I drew it. - [Nicholas] Yeah. So once you've spent like five or 10 grand on Magic cards, you kind of don't wanna pay for them anymore. - I love your pizza shovel, though. - [Nicholas] So- - Do you actually use this? Cause it looks suspiciously clean. - There's some dough left over right there. - [Linus] Well, that's gross. - I know I should cleaned it better. - Why didn't you clean it? - I should have cleaned it better. Yeah, we had pizza on Friday. It was like last, no Saturday, - Oh, so this is fresh then. - [Nicholas] Yeah, yeah, yeah, no please. - And here's the battle station we'll be upgrading. You got- - [Nicholas] It's just a Blue Yeti. - Is this Yeti? yeah okay. You have stickers everywhere. - Look, they're on my speaker. - I'm surprised you don't have them on your screen. - No, no, Come on. - [Linus] You're into records too then. - Yeah, that's a lot more money that I've- It's another $10,000 or something I've spent over the years. - I came down here for this bin of extremely expensive looking keyboard cables and sleeving. But what I ended up finding was how many computers does one man need? - [Nicholas] I just need two, okay. And I have two. - You have two? - I have two. - But you're building another one? - Yeah. Yeah. So we're gonna move all the stuff out of this one - Yeah. - And into my old - And then return the stuff that was stolen from work. - This is all mine - To the office. - [Nicholas] This is all mine. I bought these. I bought that. - Now for expensive impractical hobby number the third - Impractical? - It's extremely impractical. Every keyboard functions, basically the same. And most people don't collect key switches like candy. - They're for when I want to try 'em out and like change them. I took these- Whoa, whoa. Whoa, whoa. You're gonna break my switch jars! - Now some of this, I understand. You gotta have your Pliers. You gotta have your magnifying glasses. So you can look like a big, big, big nerd while you're working on your soldering or whatever the case may be. - Right up close. - What does this have to do with- - When I was doing a lot of D&D I was DMing. And so I'd make my own maps and stuff or I'd recreate the ones from the books that you can get. - You literally bootlegged your own maps with pencil crayon. You know that one man can only use one, maybe two keyboards at- wow, this is really heavy. - Hell yeah it is. Please be careful, that's a $500 keyboard. This is my endgame. Those are cheap key caps, but I have expensive ones coming. - You have more key caps? - Yeah. I mean you already have expensive key cap- Oh my God. Is this that thing you did the short circuit for? - [Nicholas] Yeah. I took that. - [Linus] How much is this? - [Nicholas] It's like a hundred bucks. - And you just took it. - This one? Yes. - [Linus] Like, how much is crap like this? - [Nicholas] That's like 10 bucks - This looks hand made. - That's that's like, yeah, you can get stuff like this on Etsy for like 10, 20 bucks. That's not expensive, but this guy. - What's this? - That's like $80. The space bar's like a hundred, but it looks sick though. Right? Look at that! - You have a problem. And this is just decoration then. - [Nicholas] Oh yeah. - You actually plugged it. Oh no. It's fine. - No, it's just wireless, yeah. The plan is to plug the other one in later too. cause this is gonna be like where I stream keyboard stuff. - Okay. I guess that's a perfect transition to finally talk about your upgrade a little bit. Now you blew most of your budget on an RTX 3090. - Yeah. - But I see you've got a lot of other stuff in here. That's kind of streaming focused. Yeah. Elgato ring light. You've got a Sony camera. - Yep. This is a ZVE10. - Yep. - You're the first to pick up a goXLR. - I've wanted this for ages. - I actually love it. - Yeah. - [Linus] The bleep button is the best thing ever. - I mostly- - It's (bleep) awesome. I couldn't (bleep) live without it at this point. Like, (bleep) like what's the alternative? I have to hire a (bleep) editor to bleep all this (bleep) out the video? - I mostly want it for the sliders so I can put individual things like Discord or like Windows sounds. (bleep) And so I can just slide them up and down. - Software's got a learning curve. - Sure. That's fine. I can figure it out. - [Linus] Yeah. I'm not too worried about that. Time for some division of labor. Who's doing what? I see you've already assigned yourself starting the red bull. - I want to swap all the stuff from my old server that never really got turned into a server into my old case. Cause I wanna keep that cause it's pretty sweet. And then obviously we've gotta take that down. Like take that apart and put that just in boxes or somewhere else before I do whatever I want with the parts and then build the new computer. - Conveniently today's Intel Extreme Tech Upgrade is for a writer. - Yay! - So you can do it. - That's fine. I know how to build a computer. You should unbox the case though. I spend a bunch of time doing something and it looks pretty cool. And I recorded it all for Floatplane exclusive stuff. Eh? Eh? - [Linus] Go subscribe. Floatplane.com. - [Nicholas] Hell yeah. - This is an insane freaking machine. You went 980 pro for your drive? - [Nicholas] Oh yeah. - You've got like so there's freaking what? 64 gigs of RAM? - No, no. There's two kits. G.Skill was afraid of sending me the 4400 stuff and it not working. So they sent a 4000 kit as well. If- as a backup. - You sticker bombed your case. - [Nicholas] Yeah, the top of it. - [Linus] I gotta say this is pretty classy. - I spent like a hundred plus dollars on stickers. I went with a torrent cause it's like the best case ever - Because You're a big pirate who pirates Magic: the Gathering cards? - No, that's the funny thing is that like this doesn't have a ton of hard drive space. So I'll build this. - [Linus] And then what do I do? - I need you to - Tidy this place up? - Well, no, that's fine. I need you to tear down the old computers and then swap the motherboards with everything on them, basically. - The ergonomics of your setup are atrocious. - [Nicholas] What? - You literally have a mousepad seam right in the middle of where you'd be gaming. - You don't know how you move. You don't know how I'm gaming though. I game like this. Look, this is great. I actually like the L desk. It's not a full L but it's enough to put my arm here. - You're right. It's not a full L but it is a bit of an L. Okay. Who's this? - [Nicholas] Alira - [Linus] Alira? - [Nicholas] It's from a video game. - [Linus] Would you like to go back out onto the porch? - [Nicholas] Yeah, she's just gonna go outside right aways. - [Linus] See you later. Okay. Oh God. There's a lot of cat hair here. ehhhhh Oh my God. - [Nicholas] Oh, the front panel. - [Linus] I didn't even see the front panel. - [Nicholas] I usually- - [Linus] You usually nothing. - No, I usually clean it, but I'm like, eh, we're doing this at some point. I'm building a new computer. I'm just not gonna bother. - This is an actual blanket. This is so gross. - [Nicholas] David's was pretty bad - [Linus] Not like this. - [Nicholas] Yeah, okay, fine. - Yeah. Urgh. Oh, there's a dead bug! - One thing that kind of sucks is the new 12th gen chips. A lot of them actually have this 512- AV-512 support. Like it's still on the chip and you can unlock it, but it's like a thing they kind of just, you know, shoved away. - Yeah. But if you boot it, even once I think, with a board that has updated micro code, - oh it'll already be like doll- - Then it'll fuse (snap) it'll just shut it off. - Oh, okay (beep) Well, anyway, if you see the square there, that means I don't have it anyway. So it doesn't even matter. - And the reason AVX-512 might matter to a gaming enthusiast is that it's really great for certain retro emulation. - [Nicholas] Yeah, emulation. - It's really great for particularly I think PS3. Maybe next time- probably not AVX-512's one of those data center only kind of technologies - Yeah. - [Linus] I'm surprised it was even in these in the first place. - [Nicholas] Yeah. I chose this board mostly because it has like three RGB headers. - [Linus] And lots of places to put stickers? - [Nicholas] Yeah. - Yeah? - Actually, no, I'm not gonna sticker the board. - No? Are you sure? You don't wanna put some stickers on there? - No, no, no. It's got the built-in- - [Linus] Nice little stickers. - IO shields so I don't have to put the shield on. No, this is RGB, I don't wanna sticker over that. I bought these Noctua things. The covers. Yeah. I bought covers for the cooler so I can a sticker bomb the top of the cooler. - You know what's funny. - Right over the Chromax black. - I gave them a hard time about- - What? - this product. Cause I was like, that is a really cludgy solution. - Oh, I agree. - To making your coolers look better. - I don't disagree. - Someone somewhere will buy them. - [Nicholas] Yeah, it's true. - I've already dismantled part of it, but for such a cluttered person, I gotta give credit for the cable management within the case. There's some odd things like this electrical taped together- - [Nicholas] Molex - Brick of Molex connectors. That is a lot of thermal content. - [Nicholas] That's a good amount. - It's gonna make a mess. You're gonna squish that down. It's gonna be everywhere. - It's not bad. I've been putting around this much at work and it's fine. - [Linus] I mean, yeah. - For the longer CPUs. - For performance, it'll matter - Okay, sure. There's a little bit- - How much you wanna bet. - There's a little too much on this one. I agree. There's a little bit too much. I probably could have stopped the line here and, and here. - A little off topic, but I've got an update on the LTT screwdriver. You might have noticed the one I'm using looks a little different. Previously, we had a black shaft. It was like a dark nickel plating. Unfortunately we noticed that it had a tendency to scratch off, particularly around here. Like when you're kind of digging into something and screwing things in, it would, it would scratch off. So I think we're probably gonna go with a silver shaft. Also. The ratchet is completely fixed now. The back force on this thing is so little. It's so smooth. - [Nicholas] I know! I spent money- Yeah, yeah! - Mine makes money. Theoretically. Have you ever streamed before? - Yeah, I streamed my God of War playthrough and then my Elden Ring playthrough, but I've been kind of waiting for this because I wanna do more keyboard centric stuff and just game in my off time instead. Can I have my power supply please? You're sitting on it. - I'm sorry. You mean my chair? - [Nicholas] I'll get you a chair. - Why would you use a chair to power your computer? - [Nicholas] Because it's an HX1000. It's got a thousand Watts in a chair. - You're not gonna put on the orange corners? - No it doesn't. - That's what makes it LTT edition. - I know, but it doesn't fit the rest of my theme. - But Nicholas? - No. - What about the stickers? - No, those are- okay. - [Linus] Look at the stickers! - I'll add the stickers. I'll add the stickers. - These are sick stickers. Yeah, I'll put the stickers on somewhere. Oh, and I get a Noctua badge. You see my Noctua badge collection? - [Linus] Yeah. I like it. - [Nicholas] Yeah, that one's good. - I'm sorry. I never gave you the power supply. - [Nicholas] Hey, my power supply! Wow. The box is busted. That's okay. - I finished my tear down, but what am I actually doing again? - Now you've torn down one of them. You gotta to tear down the other one too. And then you swap them. They do some swapsies. - I feel like the young child that is just being given busy work while dad does all the real stuff that's important. - At this point, I've got my board like basically ready to go. I've got my CPU and I've got my memory and my cooler attached and I threw the two, 2TB drives in that I'm gonna have for extra storage. - Now I have no chair. Ugh. I'm physically incapable of sitting cross-legged so I'll sit like this. - [Nicholas] Really? - Yeah. My thighs are too thick. - [Nicholas] That's why Yvonne married you. - Or it could just be bad flexibility. - I need the SSD that Linus just tore down and I'll strap that on here. And then I'm pretty much ready to put the board in. - I've hit a wall again. I have the X99 motherboard in here. - [Nicholas] Yeah. - And this is the server now? - [Nicholas] Yeah. That's gonna be a server now, - But it doesn't have any hard drive bays. - I know. I'm just gonna like VHB tape a 4TB mass drive in there and then I'll throw an SSD- - One drive? No redundancy? - [Nicholas] Just for now. - I don't like it. - [Nicholas] That's okay. That's not your computer. Did you- - That's what everyone says. Look at this guy. He blows all his money on Magic: the Gathering and key switches, and doesn't have redundancy for his storage. - I spent all my money on this computer instead, cause this is the one that matters more to me. - I totally forgot. Why am I putting a GPU in this thing? - Well, there's two reasons. One is because I'm just gonna keep mining on it. - How noble - And two is for, I mean, that's gonna be like the streaming computer when I'm streaming keyboard stuff. If my girlfriend comes over and we wanna play games together, I'll take the worse system and she can play on my nice new computer and we can play games together nearby. So there you go. That's that's the good reason. - Is this seriously what I'm doing? Because I hate it. I'm just gonna jam these in here. - Yeah. - [Mike] Ohhhh. - Plouffe. I'm so mad right now. - You just flip it- Oh! this was on my server, right? - Yeah. - This is the boot drive. Sorry that has to go in there too. - Yeah, no fine. I just- - Yeah you can totally fit them in there. What are you talking about? Look, you. - Just that's stop the point. - You just push 'em in like. - No, it's not the, I know they'll fit. - Just push them in. Look at that, it's great. That's pretty clean, right? And it fits right in there. Real good. No, what we can do is turn flip the whole case over. Oh, here, pull these out. - Did you just lift that out by the cable? - Yeah, I did it gently, It's okay. Instead you could cable manage through here and then like put them right here. That'd be fine too. I don't care if they sit inside the case. That's fine. - You have a case with hard drive bays. - I had one and- I know. That's what the R7's for. - You literally- - I know. - Have hard drive sleds- - I know. - Right. Here. - So put the hard drive sleds right here. No, it won't fit cause the GPU. The reality is I'm gonna build a NAS eventually and then that'll be like my actual storage. - Go. Just go. Just go. David. Did you think you were gonna get out-janked? - [David] No, I didn't think it was possible. - Hey look, I got a new G305 wireless. - You're not gonna distract from this. You know what? I'm gonna (bleep) with him. - [Nicholas] No. - [Mike] Yeah. - I'm gonna put it on crooked. - [Nicholas] Yeah! All right. - You don't even care. - [Nicholas] Not really. - You don't even care! - [Nicholas] No. - How do you- Urgh. Okay. Well that's on there, I guess. I'll give you this. It's a pretty cool looking machine. - [Nicholas] Yeah. - It's too bad that your hard drives are literally held on by double sided tape. - It's cool. They're just chilling there. It's all right. Yeah, I'll sticker bomb The HDDs - No! - Oh yeah. Didn't even click. Doesn't even need to click. She's in. Moment of truth. I've got everything wired up. It's just not cable managed yet. RGB. There's a whole bunch of RGB fans and stuff. You don't think so? Well that's not good. Hey, there it goes. I haven't tidied up the back much yet. - [Linus] I see that - [Nicholas] Yeah. - [Linus] Still some work to do on this side. - [Nicholas] Yeah. Still a little bit. Oh careful with the, yeah. That's that's not screwed down yet. - What is with the sticker placement? - [Nicholas] I just put 'em there. I was like, well, you know, I gotta put them somewhere. So I'll put them on the power supply. - What the hell? With the system done, We're in pretty good shape to finish this today. All we have to do is cable manage the desk, set up the streaming lights, get the headphones hooked up, set up the GO-XLR. Get the camera connected. I'm sorry. How are we gonna finish this today? - Look, this'll all get done in like five minutes. The headphones is two seconds. Look, watch. You, you push it down, you pull them out, and then they're connected. Ah, it's stuck. It's stuck on the stupid tab. It did this to me earlier. Argh! No! It's done! - What are we gonna do with this? - Those are- so that's a- whoa, careful. Me, Belle, and Jamie have our record podcast. That's why we have the Beringer and like a bunch of microphones all over the place. Oh yeah, Vinyl Verdict. It's great. We talk about records. - Where's your back panel? - Oh, they're all on the couch. They're both on the couch. - [Linus] Okay. - Yeah I'll cable manage later. Just shove it in for now. It's- - I no longer care about this. - Yeah. Shove it in for now, Linus. - I can only care as much about a job as the client does. - Totally. - Hey, I care about it a lot. I just, you know, I want a lot. - Usually he cares. - I want a lot of time for cable management where I can sit here and think about it and do it really prettily and like. - Yeah. Think about it. You do more than think about it. - Tie all the things down and sort it out. Especially because this has a glass panel on the back. Oh my God. If you break the panel, I will. I'll get mad. I don't know. You can push the cables in a little bit. So it's not bending the tempered glass. You're gonna break the- Linus. Linus. We can move the cables. - It won't secure. - I know because the cables are in the way, here. - Well maybe you should do a better job, then - I'm gonna! - Probably what you told your mom. When she asked you to clean your room. - There we go. I have one more sticker. At long last I can place it down. - Warning. Mako energy. - Yeah. It's from FF7. Look at that. - [Linus] It's so crooked. - [Nicholas] That's cool. - I will reluctantly put the new computer back where it's obviously just gonna get dusty furry. It's not even dusty at that point. It's furry. - [Nicholas] It's okay. I'll take much better care of this one. - Yeah. You won't. usually you will. Well, what do you want plugged into the speaker out here then. Oh, okay. The speakers. - Oh, the speaker out. Yeah. - And then you don't want your splitter anymore? - Nah, I don't need this. - Yeah. The girlfriend was imaginary after all? - No, no, no. She's not imaginary. - Still gonna come over and use the headphone splitter? - No, it's just, we did a discord call with my family and so we needed both headphones and I don't know when that's gonna happen again. I'll put this somewhere and if I need I'll use it, but. - Yeah, yeah, yeah. - Yeah, I've got Canadian girlfriend. - She's in Canada. She's definitely real. She thinks my keyboard obsession is super cool. - No, she really doesn't. She's like, why do you have all these keyboards and why do they cost this much money? And then I say, I like them. And she says, okay. - Why are you handing me this? - [Nicholas] I don't know. It's for the GO-XLR. - I'm just gonna usually cable manage it a little here. Here, usually he has this stuck somewhere, but I'm just gonna usually put it right there. We never finish clearing all the crap off your desk though. So, first of all, your old headphones can go. - Oh yeah, we don't need those. Just keep them there. They're pretty cable managed I think. - [Linus] Can we get rid of some of this junk? - [Nicholas] Those are pins and stuff. My key caps. - Key cap treason? And what does Elm Treason mean? - [Nicholas] It's a band! - Well here gimme like four, gimme four. - [Nicholas] Four pins? - The four best ones. (bleep) Do you ever wanna blow up a hoarder's mind? Ask them to pick their one favorite thing and they have to throw everything else away. Okay. There. - [Nicholas] Okay. I'll move all these ones. - Now it's organized. Gears Five dev team? Okay, that's pretty cool. - [Nicholas] Yeah. - [Linus] Okay. That can stay. - [Nicholas] Yeah. - This Logitech G sticker. - [Nicholas] It's great. It's Logitech. - I'll try to do basically what you would've done with it. - [David] Ah! - Where's your new chair? - Oh, right here. I'm sitting in it. - [Linus] Oh, you brought the new chair. - [Nicholas] It's the steel series series 2. - Oh, okay. - [Nicholas] Yeah. Steelcase series 2, whatever. Check out the armrest. They go forward-back - [Linus] Four dimensions - [Nicholas] Yeah they go up and down. - [Linus] I don't know how they, okay. Well they do that. - [Nicholas] They go like that. They go forward and back. - Ah, ow! Okay. - [Nicholas] And they can go in and out like this and then they can angle as well. - Wow. - [Nicholas] And then they go up and down too. - Your arms will never feel more rested. I still really don't like the ergonomics of your setup. Where are your feet supposed to go? - [Nicholas] Really? - Like how do you, how do you sit like this, man? - [Nicholas] Move! I actually sit like this quite a lot of the time. And then I'll just like go in and just kind of chill like this. - What do you need a foot rest for, then? - [Nicholas] So cause sometimes then if I put my feet down, look. - Your right arm's way over here. - Yeah. What's the problem? - I don't know. I mean, I guess I just might slay you in games and that's fine if you just wanna like. - Nah, you think that you won't. - All right. Let's get this camera on. - Okay. - Now you said your plan is to put it on the tripod. - Yeah. Look, I do have the thing already attached to it. - But why would you put it on a tripod if you have a ring light? Why don't you just screw it into the Nevada light. - So, the thing is, the ring light is for this PC, right? - Yes. - The ring- the camera is for that setup there. - This is more for keyboard stream so that I can put it on that tripod there and have it shoot down like that onto the keyboard stuff. - Got it. - Okay, hold on. Here it comes. Here it comes. - [Linus] I don't know if we're off the wall enough. - Oh yeah. We might have to pull out a little bit. - [Linus] Okay. Yeah, you're too deep. I think you're hitting something. - [Nicholas] Probably. - [Linus] You're hitting this. What's this - [Nicholas] Yeah, I'm hitting- That's my monitor. This is pretty good though, Linus. I mean, this is is pretty close to center. This is fine. - [Nicholas] I mean, yeah. It's usually you have it in the center I guess, right? You ready to spend the weekend completely undoing all my awful cable management? - Yes, I've already- - [Linus] You ready to discover all of the intentional tangling that I've done? - I've- oh my God. Are you serious? Did you tangle (bleep) on purpose? Oh (bleep) - [Linus] No. (both laughing) - It's a (bleep) your ass, that is. - The definition of pretty face rotten insides. - Yeah. I partly just wanted the camera for photography too. Like I used to do a lot of photography when I was in school and I could borrow their DSLR's and stuff. - Because you didn't have enough hobbies? - No. - [Linus] Normally he wipes everything down. - [Nicholas] Yeah. Usually. - Can I ask who applied the sticker though? - [Nicholas] I put that one there. - [Linus] Could you like- - [Nicholas] I put that one there. - [Linus] What are you doing? - [Nicholas] I don't know. I'm just putting stickers on stuff. - Okay. Should we power it up? - Yeah, sure. - What are the odds, this thing fricking works? - I mean it should. - Ahahaha! - [Nicholas] We booted it on my TV and got to windows. It worked great. - [Linus] Oh, okay. Sure. - [Nicholas] You saw it powered on. - [Linus] I'm sure I did. - [Nicholas] Oh, give it a sec. Oh no. There it goes. - [Linus] There we go. - [Nicholas] Yeah. - [Linus] Not bad! By the way, I like your hat. - Yeah. - lttstore.com. - Yeah, lttstore.com, baby! Yeah. Cool. I can plug in the other monitor later. This is great. - What other monitor? Oh no, I can do that. - Are you sure? - Yeah, You have a headrest down there and everything. That's the real purpose. When you're working on the cabling down here, you're gonna have somewhere nice to curse me from. Okay. I gotta try. I gotta try this gaming setup. This ergonomic setup here. Hold on a second. - [Nicholas] Don't cross your legs. You can't- - You know how I was saying earlier that I can't cross my legs? - [Nicholas] You can't cross your legs. Don't do it, Linus. You're gonna injure yourself. Then we can't make videos. - No, I got, this. - [Nicholas] You can't even fit under the desk! I can fit under the desk. You can't- No, don't do it, I didn't- - All right, I'll go with the foot rest - I did a lot of yoga for like years. Oh, check if all my drives are- at least- like I have to initialize all the hard drives. Probably. - New, simple volume. - [Nicholas] Yep. - Okay, volume label. Enjoy your cable management. Why did you buy a GO-XLR? - If you haven't noticed, I have- - Only to have a USB microphone? - I'm gonna move that one to the other computer later. And I have like a whole bunch of Shure, like 48s or something for the vinyl podcast. It'll just chill right here. - All right. Cool. Well, it can't just chill right there. - [Nicholas] I'm kidding. - It has to be - [Nicholas] I'm joking, yeah. - It's has to be like kind of at least close to your mouth a bit. Well, we can go with that. We'll give her a little, give her a little more juice here. Ooh. That might be a little much - [Nicholas] Too much. - Yes. I mean, you've gotta about the energy of Eeyore so. - [David] Oh! - I could probably leave the gain up. You don't have OBS? I know- Yeah. You're such a streamer. - I ins- - You're gonna stream. I got no OBS. I got a USB microphone plugged into my GO-XLR. What a clown. - I've got like four XLR mics here. - I've got 18 keyboards and I've got 22 foot rests. Playing Vampire Survivors. - There's the experimental light fix - I will be Krochi. - [Nicholas] He's probably the worst one, but that's okay. - What am I doing? I don't understand. - [Nicholas] So it's, it's like an idle game, but not an idle game. What's an idle game? - [Nicholas] So turn left and get that little green gem. So now you get a upgrade. Get the garlic, probably. Get the garlic. - Get the garlic. - [Nicholas] So now if you just walk into those dudes, you'll just kill them. And then you get XP - What? - [Nicholas] Cause you have that garlic on you. - And I get more Garlic? - [Nicholas] Yeah. So now you level up. Get the garlic again. Cause it ups your area. Look how big the AOE is on it now. - Okay. Now I have- - [Nicholas] Get the magic wand. Yeah. Why not? - I don't have to actually activate any of these abilities? - No, they're automatic. - Well that's stupid. - [Nicholas] No, no, no. You don't understand. It's so good. - It's like keyboards. Like no, hon I really need all these keyboards. They're really amazing. I get the candlestick. It's me with the candlestick in the giant (bleep) library. I like your keyboard. - Yeah. It's nice, eh? I love this keyboard. - Well, I'm not gonna buy this game, but I might buy this keyboard. - [Nicholas] Yeah. It's a sick keyboard. It's like 200 bucks. - Ooh. I'm not buying it. - [Nicholas] Okay. Sure. - Mind you, I have my keyboard and I think is actually more. - Yeah, that's my, so that's my problem is like, yes. A lot of my keyboards are like 150 200 bucks, but how much is a (bleep) Corsair or like a Razor keyboard? Those are like 150, $200. - [Linus] Yeah. I'm a 915TKL. - [Nicholas] Yeah. - [Linus] Are you even a fast typer, though? - Yeah, I'm pretty quick. - Are you? - Yeah. - Okay. You wanna have a type off? He's a pretty fast typer. Is it typer or typist? - [Nicholas] I think it's- argh! - No, don't worry, do your thing, do your thing. Don't let me distract you. - Argh! 114, 97% - I don't think I'm gonna beat this. If you can type that fast, you deserve to treat yourself to a nice keyboard. Okay. 97% accuracy that I will not be able to beat. - [Nicholas] And that's with you distracting me. - That- at one point distracting you. Oh, muh muh muh. - I might have- - Yeah, usually he has a hundred percent. Ahh! Oh, it moved - [Nicholas] That's not bad. That's pretty good though. - The last thing I wanna try is your ergonomics for a FPS game - [Nicholas] Okay, Sure. Halo's installed, launch Halo or something, or Half Life 2, you know, greatest first person shooter of all time. - Okay. Oh my God. I know who made the game. - [Nicholas] Thanks 343. Yeah. No, no, no. Look at that. - What are you doing to me? - I'm reaching the volume knob. Not your knob. There you go. - Show me where the keyboard should be. - [Nicholas] This is like here. I would use the armrest. - The armrest, but my arm goes way over here. - I don't know how to explain it, man. I find it comfortable. - Ratatatatatata! - [Nicholas] Nice grenade. - Oh (bleep) that was close. - [Nicholas] Yeah, that was close. - I don't think I can do over here. I may- I can make this work. I can make this- Oh God, you see that? I just walked off the bridge. Definitely unconventional. You're a man of many... Things. Definitely with a girlfriend from Canada. - [Nicholas] Yeah. But there's no doubt that this is an absolutely sick set up for gaming. - [Nicholas] Yeah. - [Linus] As long as you are willing to put in some ergonomic tweaks and a weekend of cable management to un-(bleep) the work that I've done. Massive thank you Plouffe for letting us into your house, and to Intel for sponsoring Intel Extreme Tech Upgrade. If you guys are looking for another one to watch, I'd say Brandon's is pretty fun. - Yeah, that was good. - Although if you wanna see jank, the likes of which only Plouffe can defeat, then David's is gonna be the one to go for. - [Nicholas] Yeah. - [David] So good.",
    "transcript_keywords": [
        "yeah",
        "put",
        "stuff",
        "lot",
        "keyboard",
        "pretty",
        "thing",
        "stickers",
        "good",
        "God",
        "cable",
        "sticker",
        "kind",
        "fine",
        "game",
        "computer",
        "Linus",
        "drive",
        "case",
        "time"
    ],
    "transcript_entity_values": [
        "the years",
        "Elgato",
        "one",
        "Nicholas] David's",
        "Nicholas] Cause",
        "22 foot",
        "Nicholas]",
        "Brandon",
        "SSD",
        "HX1000",
        "One",
        "Floatplane",
        "Discord",
        "RGB",
        "X99",
        "Belle",
        "Intel Extreme Tech Upgrade",
        "Mako",
        "Steelcase",
        "Corsair",
        "GPU",
        "150, $200",
        "the weekend",
        "G305",
        "343",
        "Logitech",
        "64",
        "Beringer",
        "FPS",
        "10 bucks",
        "LTT",
        "G.Skill",
        "three",
        "Canada",
        "Linus",
        "50 bucks",
        "Molex",
        "Canadian",
        "Linus",
        "Half Life 2",
        "ehhhhh",
        "Four",
        "200 bucks",
        "Elden Ring",
        "80",
        "a weekend",
        "4400",
        "first",
        "Friday",
        "Yeti",
        "Razor",
        "Nicholas] Colin",
        "First",
        "Vampire Survivors",
        "jank",
        "Garlic",
        "Nevada",
        "Saturday",
        "AVX-512",
        "Nicholas] Nice",
        "114",
        "DSLR",
        "4",
        "Halo",
        "OBS",
        "CPU",
        "150 200 bucks",
        "muh muh muh",
        "Vinyl Verdict",
        "48s",
        "Krochi",
        "sec",
        "NAS",
        "third",
        "years ago",
        "like five minutes",
        "20 bucks",
        "Intel",
        "Sony",
        "Windows",
        "four",
        "4000",
        "10,000",
        "12th",
        "VHB",
        "candlestick",
        "Magic",
        "Linus]",
        "5,000",
        "David",
        "Watts",
        "five",
        "a thousand",
        "two seconds",
        "Chromax",
        "10",
        "a ton",
        "Logitech G",
        "a hundred percent",
        "18",
        "Five",
        "Trello",
        "several hundred dollars",
        "Jamie",
        "Magic: the Gathering",
        "Nicholas",
        "two",
        "Shure",
        "second",
        "Eeyore",
        "AOE",
        "a few hundred bucks",
        "980",
        "97%",
        "Yvonne",
        "D&D",
        "TB",
        "today",
        "a hundred bucks",
        "Plouffe",
        "3090",
        "RAM",
        "500",
        "2",
        "Gateron",
        "USB",
        "Elm Treason",
        "a hundred plus dollars",
        "Gathering",
        "Noctua",
        "Nicholas] Alira - ["
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "MONEY",
        "NORP",
        "NORP",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "ORG",
        "FAC",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "PERSON",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON"
    ]
}