{
    "id": "aRH3v3kTrr4",
    "title": "3 Cool Tech Deals - #12",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-12-30T23:14:47Z",
    "video_url": "https://www.youtube.com/watch?v=aRH3v3kTrr4",
    "category": "Science & Technology",
    "tags": [
        "tech deals",
        "tech",
        "deals",
        "3 cool",
        "cool",
        "cool tech",
        "technology",
        "gadgets",
        "3 cool tech deals",
        "unboxtherapy",
        "unbox therapy",
        "iphone",
        "unboxing",
        "apple",
        "3 cool tech",
        "coolest tech",
        "best tech deals",
        "android",
        "sony",
        "sony bluetooth",
        "headphones",
        "bluetooth headphones",
        "gadget",
        "best tech",
        "technology (industry)",
        "smartphone (video game platform)",
        "android (operating system)",
        "usb flash drive (media format)",
        "bluetooth",
        "cool tech deals",
        "tech under",
        "best deals",
        "best",
        "iphone 6s"
    ],
    "views": 930078,
    "likes": 28328,
    "comments_count": 1778,
    "description": "Transcend storage -   Sony Bluetooth Headphones -  Charge Stations -  Crazy iPhone Lens -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/20QZKAV",
        "http://amzn.to/1OZNXdc",
        "http://amzn.to/1UqxBP2",
        "http://amzn.to/1OZOcoA",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Someone explain the mistletoe thing to me, like At what point did somebody say- see that, little thing over there now you're kissing Kiss- get to it and everyones like you know what he got a point lets go with that Anyways It Been A While And I Missed You Guys Seriously So I went on twitter, and I said hey how about Three Cool Tech Deals. The holidays are over Maybe you got some new gadgets Some new cool stuff and you need some more cool stuff, to go with that cool stuff For example, some storage. Everything from Transcend is on sale right now but only for this day. December 30th, so that means SD cards 64 gig SD cards, for 15 bucks? You got micro SDs as well starting at 14 bucks for 64 gigs or 128 gig micro SD for 42 bucks basically all the Transcend stuff is on sale, even the SSDs So you can get a 1TB SSD for 244.99 Everything is on sale, I told you, all of it. There is even a 1TB Thunderbolt solid state drive I didn't even know Transcend made that Thunderbolt SSD for 431. Very Nice Hmm.. This wha- This one is a little bit different, it's for a certain type of person The real gadget enthusiast The ability to charge all of your gadgets, I mean all them In one place. And there you can see four of them plugged in. So it could be a tablet could be a bunch of smart phones. I use something similar to this I posted pictures on Instagram and everyone went crazy. Crazy! Mine is from Griffon and it's far more expensive so when I saw this I was like hmm.. Kind of interesting This one is 99 bucks, used to be 200 Now there is another version as well Now what this one does is puts a giant lock and door on the front So if there are.. Paws.. in your presence that might like to get their hands on some tech! This thing here is a way to I guess stop that from happening Why is it $599 now? Ahh, this is the one that is on sale with the AC outlets as opposed to the USB ports This is kinda crazy, if you go with the USB ports, it's 600 bucks right now If you go with the AC outlets, which I actually like, because then you can charge other things like laptops and whatnot in here it's 150, original price 400 There is like a power strip built right into the thing Along with the different trays for putting your various gadgets in there. This seems like a weird thing to get excited about, but like I'm saying, if you're one of these people Then you're one of these people. Headphones, I'm always talking about Headphones. But there is a reason, it's because I love them. These are some of my favorites in the world right now I've talked about them before and they're cheap right now. They're 88 dollars, a 41% savings, 62 dollars off. These things are 150 bucks and they are relatively new so it's surprising to see them this cheap Bluetooth, NFC, Fantastic sound. They are lightweight. Portable. I travel with these all the time The MDRZX770BT. Man.. Sony's got some.. They got some wild Product names There is an extra bass version which are kind of popular They're 200 bucks For me? These ones at 88 That's the value point Last, this thing is kind of wacky. I'll be honest with you It's kind of an honorable mention I don't even know how to pronounce this product name Da- DaOats? DA-Ouse Douts? This is for the person that is- is dedicated to smartphone Photography in a way, that is possibly unhealthy. A person who refuses To get themselves a stand-alone camera But wants to be like all the cool kids And have some pretty serious interchangeable lenses What is this? It's uhh- 4-12x zoom lens It's on sale right now It's about 50 bucks Zoom and focus ring It'll work with the iPhone 6, 6s, 6+ or 6s+ Those cases are included and the case actually holds up the lens But look at that I mean that's just- I mean it looks funny Funny in all the right ways This will be good for an episode of \"Does it Suck\" You got it You didn't even ask for it But you got it. Coming up on \"Does it Suck?\" Insane-o lens adapter for the iPhone. Stay tuned, subscribe, there you have it. Three cool tech deals, plus a WTF moment. As you've come to expect here on this show Thank you very much for watching, guys. If you enjoyed this content be sure to leave a thumbs up Down below All the links to all these products will be down in the description. Thanks again, I'll catch you on the next episode Later guys. Kiss, get to it!",
    "transcript_keywords": [
        "explain the mistletoe",
        "cool stuff",
        "bucks",
        "Cool Tech Deals",
        "Cool",
        "thing",
        "Missed",
        "sale",
        "Transcend",
        "stuff",
        "Transcend stuff",
        "mistletoe thing",
        "Missed You Guys",
        "Cool Tech",
        "Kind",
        "Thunderbolt SSD",
        "kissing Kiss",
        "Tech Deals",
        "Tech",
        "gadgets"
    ],
    "transcript_entity_values": [
        "62 dollars",
        "Sony",
        "December 30th",
        "600 bucks",
        "99 bucks",
        "iPhone",
        "this day",
        "Does it Suck\" You got it You",
        "SD",
        "128",
        "USB",
        "42 bucks",
        "Paws",
        "244.99",
        "599",
        "NFC",
        "14 bucks",
        "1",
        "Transcend",
        "64",
        "200 Now",
        "TB Thunderbolt",
        "200 bucks",
        "four",
        "88",
        "DaOats",
        "Three",
        "micro SD",
        "4-12x",
        "Photography",
        "6s",
        "about 50 bucks Zoom",
        "Griffon",
        "431",
        "150 bucks",
        "6+ or 6s+",
        "15 bucks",
        "88 dollars",
        "AC",
        "400",
        "Instagram",
        "41%",
        "one",
        "150"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL"
    ]
}