{
    "id": "artpS2SPuAQ",
    "title": "Huawei Mate 9 Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-02-01T23:10:53Z",
    "video_url": "https://www.youtube.com/watch?v=artpS2SPuAQ",
    "category": "People & Blogs",
    "tags": [
        "huawei mate 9 review",
        "huawei mate 9 review 2017",
        "huawei mate 9 unboxing",
        "huawei mate 9 pro",
        "mrmobile",
        "michael fisher",
        "android central",
        "android authority",
        "huawei",
        "pocketnow",
        "mate 9",
        "note 7 replacement",
        "note 7 alternative",
        "phablet",
        "emui 5",
        "best big phone 2017",
        "best large phone 2017"
    ],
    "views": 397152,
    "likes": 8419,
    "comments_count": 977,
    "description": "Huawei set out to solve some common smartphone problems when it built the Mate 9: bad battery life, slow software, and underwhelming photos (among others). And aside from being a behemoth of a smartphone, the Huawei Mate 9 does a really good job of solving most of those issues. But now that the Mate 9 is officially on sale in the US, the biggest problem might be convincing Americans that its worth buying. This is the Huawei Mate 9 review from MrMobile.   [SUBSCRIBE]     [ABOUT THE HUAWEI MATE 9 REVIEW]  MrMobile's Huawei Mate 9 Review was produced following three weeks with a production retail Huawei Mate 9 and several months with a preproduction Huawei Mate 9 review device. The units were tested on T-Mobile US in Greater Boston and paired with a variety of wearables, including the Moto 360 v2.   [PRODUCTS IN THIS VIDEO]  Huawei Mate 9:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Dubday\" by Cymatix, available at Premium Beat:   \"New Media \" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  Additional information and context for MrMobile's Huawei Mate 9 review were provided by a visit to Huawei's corporate campus in Shenzhen and a Kirin 960 briefing in Shanghai, for which Huawei provided travel and lodging expenses.   This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/me",
        "https://www.premiumbeat.com/royalty_free_music/songs/dubday",
        "https://www.premiumbeat.com/royalty_free_music/songs/new-media",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] Huawei set out to solve some really common smartphone problems when it built the Mate 9: bad battery life, slow software, and underwhelming photos, among others. But now that the Mate 9 is official on sale in the US the biggest problem that needs solving is convincing Americans that it's worth buying. This is the Huawei Mate 9 review from Mr Mobile. (bright upbeat electronic music) Here's what tends to happen when new unlocked phones hit the US, the reviews come out and they're mostly positive because it's rare for a competent company to make a truly bad smartphone these days, but despite the good press the folks out in the mass market kind of shrug and keep on buying iPhones and Galaxies. To overcome this inertia takes either a boatload of advertising dollars or a product so great that it transcends the public apathy. The Mate 9 is in many ways fantastic. A light brush on the fingerprint sensor is all it takes to fire up that monster display and checking your notifications is as easy as swiping down on that same pad. The casing is dotted with conveniences. This is one of the only phones left to sport an infra red transmitter so you can use it as a remote control. And it's the only phone I've carried that let's you steer it's microphone array to make things like speakerphone calls clearer. That speakerphone is implemented in the HTC style with a big driver down low and a little tweeter up top, and the sound that escapes is rich and rewarding. It's getting dark too soon A threatening silence - [Michael] Under the skin the biggest thing taking up space is the battery. And Huawei didn't just cram in a bunch of capacity there's also a monitor baked into the software that keeps and eye out for energy wasting apps and either notifies you about it or closes them automatically to save power. Add in two different power saving modes and the battery improvements of Android N and you've got a phone that'll last you well into tomorrow even if you forget to charge it tonight, and even if you're a serial streamer and hot spotter like myself. And when it comes time to top up Huawei's fast charging capability means you won't be waiting long. To close out the fantastic bits look no further than the camera. Not the schmaltzy filters and not the cheesy wide aperture stuff but just shooting with the camera in automatic mode. It's quick and it's reliable and when you wanna roll out the fancy features there's no shortage of those with full manual controls and object tracking which keeps a subject in focus no matter what you do with the phone. Oh but one other thing, if you're wondering why I'm not showing you any video here it's because this phone uses the H265 codec. Very advanced, very nice, very fancy, but none of my machines know what to do with video encoded that way. So shoot in HD if you get this phone, I guess. I'm glad I waited a while to review the Mate 9. It gave me a chance to settle into it, to appreciate the little niceties hidden away in the crannies. But ultimately I'm in the same boat as always after using phone software made for the Chinese market. I'm very eager to get away from it. You can have you app draw now and you can theme away the iPhone-like icons but you can't get rid of all of Huawei's weird aesthetic choices whose nebulous nature inspirations are inexplicably blended with weird Tron-like touches. And this phone will make you realize how much you actually do from a lock screen, like triage notifications or control music or change system volume or kick out a quick reply to a text because you can't even start to do any of that on a Mate 9 until you unlock it. These frustrations survive even if you use the Google Now launcher. Fully overriding the interface takes a significant investment of time. To me that investment might be worth it for a phone like the Honor 8, also made by Huawei, which has a fit and finish unlike anything else out there. That's a phone I'd go to some lengths to accommodate because it feels special. The Mate 9's hardware is big and reasonably handsome but special it's not. We've seen this basic design countless times before. Now I know, some of you are already scurrying down to the comments to accuse me of being in Apple's pocket, but one, go watch my iPhone 7 review where I spend the first minute and a half calling Cupertino out for the same thing. And, two, let's be real, Apple is gonna sell iPhones no matter what. Huawei, despite its massive global scale, is still basically unknown in the US. And a conservative design like this made-it-to software like this, doesn't stand a big chance of changing that. Especially without a carrier deal that puts this phone in brick and mortar stores. After all that doom and gloom how about some good news? The Mate 9 is quite competitively priced. A similar form factor and spec sheet will run you over $700 if you go the Google Pixel route but 599 gets you the Mate 9. An unlocked smartphone ready to use on T-Mobile or AT&T with outstanding battery life, a great camera, and a screen big enough to get things done two apps at time. Huawei was looking to solve some problems and it sure succeeded for the most part. So this review is great news for phone nerds still seeking a worthy replacement for the Galaxy Note 7. But for Huawei I fear it's just another positive review that most folks will glaze over while they wait for the next Note or the next iPhone. If you're using a Huawei device in the US I wanna hear about it. Share your experience in the comments below that subscribe button and stay tuned for more mobile tech video coming every week. Until next time, thanks for watching, and stay mobile my friends.",
    "transcript_keywords": [
        "common smartphone problems",
        "Mate",
        "Huawei",
        "phone",
        "underwhelming photos",
        "built the Mate",
        "Huawei Mate",
        "Huawei set",
        "common smartphone",
        "review",
        "smartphone problems",
        "slow software",
        "convincing Americans",
        "battery",
        "time",
        "software",
        "problems",
        "smartphone",
        "big",
        "phones"
    ],
    "transcript_entity_values": [
        "Huawei",
        "599",
        "Cupertino",
        "H265",
        "Mr Mobile",
        "T-Mobile",
        "tomorrow",
        "Apple",
        "AT&T",
        "US",
        "iPhone",
        "first",
        "over $700",
        "9",
        "Huawei Mate",
        "these days",
        "Michael",
        "two",
        "tonight",
        "iPhones",
        "HTC",
        "the Galaxy Note 7",
        "Android N",
        "Americans",
        "Chinese",
        "one",
        "8",
        "iPhone 7",
        "Galaxies"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}