{
    "id": "aSxomAgD8s4",
    "title": "YOU Get a Supercomputer! - Supermicro AI Workstation @ CES",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-10T18:09:57Z",
    "video_url": "https://www.youtube.com/watch?v=aSxomAgD8s4",
    "category": "Science & Technology",
    "tags": [
        "supermicro ai supercomputer",
        "a supercomputer for your house",
        "this $80000 pc is for your house",
        "the $80000 pc"
    ],
    "views": 1572747,
    "likes": 52989,
    "comments_count": 2364,
    "description": "Find out more about Acer's SpatialLabs branch through the link below:   Check out the Predator Helios 300 SpatialLabs Edition with the link below:   Supermicro is coming out with a new workstation designed for the heaviest AI workloads... except... it's also designed to be quiet enough to run in your house. Holy shit.  Discuss on the forum:   Check out Supermicro Workstations:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro",
    "description_links": [
        "https://lmg.gg/PN3Vk",
        "https://lmg.gg/fYoBM",
        "https://linustechtips.com/topic/1480419-you-get-a-supercomputer/",
        "https://lmg.gg/7G1kF",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "We're at the Supermicro booth at CES 2023, and this bad girl right here is the SYS751GETNRT, an $80,000 AI supercomputer designed to go in your house. No, seriously, people are asking for this. And trust me, I have the same reaction. But hear me out, the world is changing. For perspective, every workstation that Supermicro now sells is actually purpose-built to support AI and machine learning, and bundle that with a global shift to working from home, and you end up with demand for top-tier AI hardware like this, the type of stuff that draws thousands of watts of power that's somehow quiet enough to be under your desk at home. Like, seriously, where's the power button? Oh, I missed it. It's on. That's how loud it is. And this is how a radiator, quite literally, almost the size of an Xbox Series X. Holy shit. But not as holy or as shit as this segue to our sponsor. Thanks to Acer for sponsoring this video. Acer's pushing the limits of 3D gaming with their new 3D Ultra Mode and Spatial Labs True Game. So stay to the end of the video to find out more. I can't get over how big this radiator is. But for now, let's make this back into a complete system. Of course, since this system is meant to go, you know, at someone's house or in a lab under the desk, the form factor is a tower. Now, it is still rack mountable. You can pull off the top here and the feet at the bottom and rack mount it. But the intended purpose is a tower. So up front, you're gonna see things that are like a workstation. We got headphone jack, microphone jack, kind of standard things. I don't know if you would, you know, have windows on this and do your Microsoft team calls on an AI supercomputer like this, but you could if you wanted to. There's also two USB ports and one of the stars of the show, the eight Gen 5 NVMe slots. All of them are full speed. I can see our boot drive right here. What is this? Nothing exciting. It's just a two terabyte boot drive. But you could put up to theoretically, if you put 30 terabyte drives, 240 terabytes of storage in this system. And that's before we even get to any of the other cool hardware. Now, of course, the best thing up front is the power button because you turn this thing on and it's like, it barely makes noise. This computer has 2000 watt power supplies in it. That's the type of heat we're dealing with. And it barely makes noise. Now, some of you are probably saying, well, you know, it's not doing anything yet, but they had it when we walked in here loaded with I think a 1500 watt load or so. Still the exact same noise level. There's peels in here. They haven't even peeled. Remove film before use. Nobody breads that. It never gets old peeling plastic off $10,000 graphics cards, let alone four of them. Now we'll talk about those later. I think the star of the show here is actually the CPUs. Now this isn't an AMD based system. This is Intel. Despite AMD having really, really awesome server stuff, it's still only about 30% of the market share. So 70% of the systems they're selling are still Intel based. This is Sapphire Rapids. It's actually just come out after, God, it's been like two years of delay. So this system fully specced out could be up to 256 core processors or 350 watts per socket, serious amount of power. For memory, there's eight sticks per socket. And while Sapphire Rapids can do up to 16 or two dims per channel, it's kind of hard to fit it in a configuration like this. What you'll see in a lot of dual socket servers is the CPUs kind of in the front or they'll be in a configuration where they're staggered slightly. Now this is important primarily for airflow. Now if you were to have both of the sockets like this in an air cooled system, the second CPU here is just gonna be getting a straight hot air, which you don't really want. Since this is water cool, it doesn't matter. Now it's also weird. I've never seen a system like this where the sockets are in between the graphics cards, especially in this configuration. Now there is an important reason for this. Because the system is PCIe Gen 5, the actual lane length, the physical traces on the motherboard, the length of those is very important. The longer you go, the harder it is to run that sort of frequency. As PCIe generations get faster and faster, it's just gonna keep getting harder and harder. A lot of boards from other manufacturers will use something called a retimer, which is basically just like a signal booster. But Supermicro doesn't use that. And because they position the sockets like this, they can make those physical traces on the board from the PCIe slot to the CPU super short, which makes it a lot easier to run speeds like that, and you don't have to use retimers. Now since the CPUs and the GPUs are water cooled, naturally the next thing you're wondering is what else are they gonna water cool? And apparently on the next version of the system, they're gonna water cool the dims. I mean, it's not doing anything right now, but they don't feel particularly hot. And there is a good amount of airflow, but I guess the more dense the dims get, you can use up to 256 gig dims, which in the full configuration is two terabytes per socket. It's probably a bit more heat than this. Do you think they'd get mad if I took one of the graphics cards out? Yes. They like us. I think I'm just gonna do it. What's the worst that could happen? Hm, you're going to jail. You took a graphics card out. Oh, there's actually locks on these. Whoa, weird. I guess because this is a workstation, there is PCI-E locks. If you look on servers, most of the time they don't have it. Oh. I think this might be about as far as I can get it to come out. Oh, wait. Look. Oh, it's more. More P... Oh, wow, there's more. Whoa, weird. I didn't even realize these actually use the new 12 pin connectors. I wonder if they've had any that have caught on fire. Regardless of taking it out or not, these GPUs are Nvidia's A100 80 gig cards, which aren't the latest generation. What you probably get with a system like this are H100s, the new architecture, but they don't really have stock yet. So this is just for show A100s. They look very similar. The idea is the same. Now they're PCI-E based, so they're not the crazy SXM cards, but they are water cooled, which is crazy. Look at the end. Each of them has quick disconnects. I wonder if I can get one of them off. I don't know how these quick disconnects disconnect. Oh, wow. Wow, it's so easy. Look at that. These quick disconnects are super nice and so easy to use. And they don't leak at all. Some of the ones I've seen, you pop it out and like a couple drops come out, nothing came out of this one at all. I guess, which matters in a server. Now the reason they'd be on quick disconnects is so you can take a GPU out to swap, or if you wanted to upgrade the system down the road, it would be a lot easier than trying to, you know, drain the whole loop, change the cards. Nobody wants to do that. Not all RAM sticks are made equally. These ones, so satisfying. Just listen. Oh, that is wonderful. The power distribution in this system is very weird. We'll see more of it on the other side, but each of the graphics cards, and I think the CPU, don't see how it connects to the CPU. Do you see the power connector anymore? Oh, it's down there. Oh, interesting. Okay, I get it now. There's a PCB inside of here with big power contacts. There's a big connector that's plugging into the motherboard in the bottom corner, and then each of the GPUs comes off of this part of that board up and over. So it's all directly connected to here, and then just little cables to each of the components, but only the graphics cards, I guess. It's a very like kind of elegant solution. I'm kind of surprised. Cool. There's also more PCIe slots. There's one extra one here and another two down here, and all seven of them total run at PCIe Gen 5 16X, which is an obnoxious amount of PCIe throughput. So you could run a 400 gig NIC, 200 gig NICs, whatever you want. A CXL module, it is a lot. Absolutely monumental amount of IO, especially considering you're gonna put this at your house. The only other really cool things on this side, of course, the radiator, which we talked about before, it's absolutely massive. And of course, to feed a radiator like that, they have some pretty thick fans as well. They're not crazy like you would expect. I mean, given that it's quiet, it makes sense, but they're only 12 volt, 0.96 amp fans. They're 12 watt fans. Usually systems like this, they're like, I got my 120 watt fan. Sounds like a jet taking off. This is not that. But the craziest thing is this looks so cool on this side. The other side of this system looks pretty much just as cool. I don't know if I can move it myself, but oh God. It's apparently 98 pounds or something like that. Oh my God. There's the lines from the rad up to the reservoir up here. And then it goes from reservoir to pumps, pumps to this big manifold and off to everything. Now the manifold is super cool. You got quick disconnects here as well. So you can pop tubes off just like that. Some of them are hard lined. Like this is like a soldered connection. I imagine that's probably for the CPU. They don't expect people to be taking CPU blocks off like you would a graphics card. But if you want to pull the graphics card down, it's a little like so easy. Look at that. It's all disconnected. I'm just gonna put it back on. Oh, you hear that click. The crazy thing is look at these pumps. They look like something you would buy on like Alibaba for $2. Like this is a wish water cooling episode, but apparently they're really strong, really durable pumps. And I guess if we turn it on, when I turned it on, they're not super loud either, which is nice. I don't even know if they're PWA. No, they are PWA. They got four pins each. They're just, they don't look like they belong in this system. There is two of them of course. So that's gonna give you redundant flow and also more flow. If one of the pumps were to die, you'd still have the one pump going. Of course the system's IPMI would let you know that the pumps aren't running. It's just, it's really nice. I love the manifold too. I think we saw a similar thing in like the EK fluid work system. It's nice that it's mounted behind and kind of out of the way it keeps it very clean and easily serviceable. The other cool thing down here, look at this. You never get to see this stuff. Usually the power supplies in a server are plugged directly into the motherboard and all of the power kind of comes off there. There's a bunch of cables in the way. So you don't really get to see it. This is just the like bare contacts. That's 4,000 Watts of 12 volt power right there. That's why it's so fricking thick. Like look at the bars on here. This is crazy. You can also see where the contacts are to pass through to that board on the other side we were talking about. There's probably sort of like a socketed connection and they go together. So it's easily serviceable. This system completely specced out dual 56 cores, four terabytes of RAM, quad GPUs is around $80,000. The DGX that it's going to compare to is $200,000. And they charge you like $10,000 a year just for service contracts. It's crazy. And that system only has a single power supply. It's not even redundant power. This one is redundant power. If you have 240 volt power, it'll do 2,200 Watts. If you only have 220 volt, it'll do 2,100 Watts. So pretty serious power supplies and they're so quiet. Usually power supplies like this are crazy. But since Super Micro manufactures them in house, they can control, you know, this is the chassis it's going to be in. We know exactly how much cooling it's going to need and they can make it quiet. I guess we should take a look at the back. I haven't really looked at it too much. They did tell me that the reservoir, despite these being like quick disconnect fittings, they're not for hooking up to like a central water supply. It's just for filling and draining. You can actually see the coolant in there. It's like red. It looks like rusty water. I'm sure it's just like some sort of, you know, anti-corrosion inhibitor sort of thing. There's two little sites you can see the coolant level and there is a cap there. I'm not going to open it because I don't want to make a huge mess. The IO, I believe this board is dual 10 gig at the back, one port for management. There's actually type C. That's kind of cool. Three USB type A ports, VGA and serial. And of course, since these graphics cards are like AI accelerators, there's no display output on them. That's pretty much it. I mean, if you wanted to add more IO, if this was actually a workstation, you're going to run windows on this thing, you could put a USB card or like a sound card back here if you really wanted. I don't know if anyone's making a gen five USB card, but it would be kind of silly if they did. We've got the system booted up now and Ubuntu and we're running a GPU load. It's like a Python AI script and all the GPUs are loaded, which is going to put it at about a thousand watt load. Right now, does it sound any louder than it did before? I feel the heat, but it sounds literally exactly the same as before. It's ridiculous how quiet this thing is. I mean, it's large, but still. Oh, the fans, it's on a little bit more now. Overall, this is seriously just kind of a mind boggling computer. I just, I can't wrap my head around the fact that people are actually asking them for this. They told me this is like one of the larger requests that companies have been asking them for. They want a DGX clone that's way cheaper and one that people could have at their house. I guess there's engineers that are important enough to have a hundred thousand dollar computer at their house. I mean, I guess there's equipment that's hundreds of thousands of dollars that people use all the time. So maybe it's not that crazy, but you know what's not crazy? This segue to our sponsor. Acer, they're bringing a much welcome update to 3D gaming with their stereoscopic 3D technology on their Spatial Labs True Game. This feature is best enjoyed with Acer's Predator Helios 300 Spatial Labs Edition gaming laptop. It features a new 3D Ultra mode, amplified stereo 3D rendering, and newly launched game profiles to be enjoyed. This allows you to immerse yourself deeper into the world of 3D gaming with the addition of 3D plus gaming mode. You can customize the stereo 3D effects based on visual and performance preferences with its 3D sense feature, enjoy impressive performance on the Predator Helios 300 with its built-in 12th gen Core i9 processor and GeForce RTX 3080 GPU. With features such as Wi-Fi 6, fan control, and overclocking, the Predator Helios will make sure you're set up for success in every gaming session. So check out the links in the description to find out more. Do it. CES. So thanks for watching. I hope you folks have been enjoying our CES 2023 coverage. I have been having a hell of a lot of fun. If you did like this video, maybe check out, how about the Epic Genoa? Holy, that was a pretty awesome video. Those CPUs are seriously fast. And they did tell me they can make an AMD version of this. If there's people that are asking for it, it only took them three months to design the system from the ground up. That's because Super Micro, you know, Super Modular.",
    "transcript_keywords": [
        "system",
        "power",
        "graphics cards",
        "cool",
        "cards",
        "thing",
        "kind",
        "CPU",
        "graphics",
        "PCIe",
        "crazy",
        "super",
        "card",
        "water",
        "guess",
        "CPUs",
        "power supplies",
        "watts",
        "watt",
        "make"
    ],
    "transcript_entity_values": [
        "Sapphire Rapids",
        "one",
        "two years",
        "Acer",
        "Alibaba",
        "SXM",
        "98 pounds",
        "eight",
        "200,000",
        "only 12 volt",
        "Supermicro",
        "240 terabytes",
        "Super Modular",
        "Python AI",
        "70%",
        "VGA",
        "GPU",
        "30 terabyte",
        "Three",
        "2",
        "AI",
        "AMD",
        "Wi-Fi 6",
        "around $80,000",
        "256",
        "the Epic Genoa",
        "Microsoft",
        "400",
        "0.96",
        "220 volt",
        "DGX",
        "PWA",
        "Spatial Labs Edition",
        "16 or",
        "2023",
        "12 volt",
        "240 volt",
        "Predator Helios 300",
        "three months",
        "two terabytes",
        "1500 watt",
        "2,100",
        "about a thousand watt",
        "2023",
        "CPU",
        "a hundred thousand dollar",
        "Intel",
        "PCIe Gen 5",
        "4,000",
        "GeForce",
        "four",
        "10,000",
        "12th",
        "four terabytes",
        "12 watt",
        "only about 30%",
        "PCIe Gen 5 16X",
        "five",
        "Spatial Labs True Game",
        "Watts",
        "10",
        "3D",
        "jack",
        "Super Micro",
        "120 watt",
        "12",
        "PCIe",
        "thousands of watts",
        "two",
        "EK",
        "56",
        "PCB",
        "the Predator Helios 300",
        "second",
        "NIC",
        "CXL",
        "80,000",
        "2,200",
        "the Predator Helios",
        "RAM",
        "H100s",
        "5",
        "200",
        "2000 watt",
        "Nvidia",
        "350 watts",
        "USB",
        "CES",
        "all seven",
        "hundreds of thousands of dollars",
        "IO"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "MONEY",
        "CARDINAL",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE"
    ]
}