{
    "id": "aTf7AMVOoDY",
    "title": "Pixel Tablet Review: Is Google Back?!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-06-20T11:47:24Z",
    "video_url": "https://www.youtube.com/watch?v=aTf7AMVOoDY",
    "category": "Science & Technology",
    "tags": [
        "Google Pixel",
        "Pixel Tablet",
        "Google Pixel tablet",
        "Pixel tablet review",
        "MKBHD",
        "Tableta Pixel",
        "tableta Pixel de Google",
        "reseña de la tableta Pixel"
    ],
    "views": 3015985,
    "likes": 84387,
    "comments_count": 4051,
    "description": "Google re-joins the tablet market with a clever trick.  MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   Tablet provided by Google for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://lnk.to/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(music) - Hey, what's up? MKBHD here. Okay, I'm gonna make myself sound really old here just for a second. But about 10 years ago, there was a vibrant ecosystem of a ton of different tablets. There was all kinds of tablets. There was, like, iPads versus Android tablets. All these fights going on. There were small-screen tablets, big-screen tablets, and all the Android tablets were sort of anchored by Google's family of Nexus tablets. So we had the smash hit Nexus 7 and the cult classic Nexus 10. But then Google kind of got a little bit lost with Android tablets and Chrome OS tablets a little bit in there for a bit and they made a few bad ones in a row and then they just gave up. Like, they literally just gave up, stopped making tablets. But something else that's picked up a whole bunch of steam since then is a new product category, smart home displays. So Google bought Nest and we've seen this Nest Hub and the Nest Hub Max came out, and this is a growing category every single month. So at some point during all of this, Google probably thought, \"Wait a second, we're making all these smart home displays. And what is a smart home display? It's basically just a cheap tablet. So what if we just made a cheap tablet that could turn into a smart home display?\" And so that's how we got this. This is the Pixel Tablet. So I've been using this tablet for a few weeks now and, look, it's not amazing or super premium or high-end or exciting, and neither are any of the other smart home displays, but I do wanna talk about it. It's also a little bit interesting and underrated in how important this tablet could be to other tablets. So let's talk about it. So as a tablet, this thing is pretty simple. I really like the soft touch finish on the back. This is the Porcelain color and it hides fingerprints really, really well. It feels solid in the hand. It's actually made of metal, but you honestly could never tell just holding it thanks to this coating. But it's very basic. Single camera on the back corner, volume buttons with the inset fingerprint reader that doubles as a power button up at the top. There's a set of speakers on the left and right that sounds okay but really doesn't have much bass at all. And the USB-C port is on the left-hand side. It's not too big, it's not too heavy. And on the front is an 11-inch, 2560-by-1600 60-hertz LCD display with bezels just thin enough to hold it and not be a problem. And the display does not get particularly bright and it's not the fastest thing in the world, but it is running the same Tensor G2 chip as the Pixel 7s. But I just, I cannot call this tablet fast. Not sure if it's underclocked or what's happening here but it behaves very much like a basic mid-range Android tablet. And that's because that's basically what it is. This is a $499 tablet and it comes with the dock in the box that you can buy separately if you want to if you want an additional one for $130. So I would say tame your expectations here. Like, it works and it does what it's supposed to, but I would just, I would say tame your expectations. So this speaker dock comes in the box, which I think is super cool, and it's actually the only way to charge the tablet that comes in the box. There is no USB-C cable in here. It's just the dock, which has a barrel connector that connects to the wall. And the dock is basically, it's just a speaker in a box really with some pins. Super simple. The pins kind of retract a little bit when you touch them, which is cool. But basically the premise is there's some magnets in the dock, as you can see here with this magnet paper, and there's some magnets in the tablet, which you can also see here with this magnet paper. And so when you line those up and connect the dock to the tablet, it just pops right onto those pins and the pins carry both power and data. So now it's charging and the audio quality should be improved because it's now using the speaker in the dock. It works pretty darn quickly too. Thankfully it's not Bluetooth pairing or anything. It's just literally a physical connection for the data. So it's just like connecting like an iPad to a keyboard. It just works right away. It holds it at a pretty good angle too. It's basically straight up and down. It looks just like a Nest Home Hub when you put it on the dock like that. Magnets are pretty strong. You can pop it off with one hand if you want to. I'm just glad that this comes in the box and isn't an additional $130. First of all, the charging speed is up to 15 watts, which is not that fast. It's a tablet battery, so it's pretty big. It takes a while to charge. And then the speaker in here is not that great. I would say it feels on par with, like, the Nest Hub Mini at best. So the speakers in the tablet are, like I said, they're fine but they really lack a lot of bass. And then when you add it to the speaker dock, you're getting like 20 to 30% more volume, but it's mostly just adding the bass back. But it's not super loud. Here, I'll give you a little sample. (upbeat music) Not a ton of bass, right? (upbeat music continues) All low end. And it's quick too. It's immediate. As soon as I pop it off, back to the speakers. But it's not the, it's not the loudest thing in the world. Honestly, I guess it's fine. This dock cannot be used as a Bluetooth speaker or anything else when the tablet isn't attached. But honestly, I don't think you'd want to. This basically just sits there and is waiting for the tablet to be attached to it. What's funny, though, is it does help with the battery. So the battery life on this tablet was decent for me but it did have a particularly weak standby life for some reason. It would drop like 10% overnight sometimes, which could be a bug. Either way, the idea is when you're done using it, you can pop it onto the dock and it is literally just a smart speaker now. Now, if you really wanted to, you could buy another one and put it in a different room and then when it's in the kitchen per se, it'll show you certain things. When it's in the bedroom, it'll show you other things. But it is $130 per dock and I'm now starting to think that that's the more overpriced thing among this bundle. So just know what you're getting into there. But I think really what I realized is this docking feature, it's cool, but it's not the most interesting part of this tablet for me. It's the headlining feature 'cause it's the cool thing that it does, but as I was talking about, there was this whole tablet ecosystem, like, 10 years ago and seeing what Google does with the software for this tablet could give us a window into how Google can anchor Android tablets again going forward. So I was really curious about the software. So here's what I found. Number one, I really like the new dock, the software dock. So the home button at the bottom, you can swipe up at any time and all the same gestures work like normal but there's a new gesture where you just grab the bottom bar and swipe up just a little bit and that brings up a dock, which is the exact same order of whatever apps you had in your home screen dock. It also shows up in multitasking. And then from there you can switch to a recent app or initiate multitasking by dragging something to half the screen to get two things going at once. It works great. It's simple. I use it all the time for going back and forth between two things quickly. So I really like that. Then number two, multi-user support is so sick and the iPad should seriously be taking notes on this. So any time you want, either from the notification tray or from the lock screen or anywhere that you see that profile picture for your account, you can switch users. When you set up a new user at first, you basically go through the whole setup process as if you're setting up a brand-new tablet and then that second person can sign into their apps and set up their home screen and their widgets and everything and you can switch back and forth by logging into each one literally just with your fingerprint. It's exactly as simple as it should be. It could also totally be like one person's personal profile and business profile so you never get the two confused. Or, I don't know, just a profile for your burner accounts, whatever you wanna make it. The point is, tablets are often used at home and by families that have more than one person. So the ability to just, like, log into your kids' account and not have them worry about accidentally buying $30,000 of, I don't know, Minecraft credits or something, it's a pretty obviously great feature. And then number three, of course, Hub Mode. This is the mode that sort of pops up when you get it onto the dock that they had to build, of course, because they turned this into a smart hub. I kind of end up just using it like a smart hub a lot of the time that it's on this dock. I don't touch it as much. I just use voice controls, which all work. And then I have a clock here. You can do like a photo gallery type thing or rotating pieces of art. And of course, the smart home display controls are available at the bottom corner. But it just kinda lives like that. I have it in the kitchen most of the time. Nice. Oh, this is also, fun fact, the first tablet that has Chromecast built in as a target so you can use it as a target to Chromecast things to it. I would never do that, but you can do that. So then number four, last but not least, is the app situation. This is something we talk a lot about with Android tablets and there was a lot of promise with this version and with this tablet that there would be a whole bunch of new tablet optimized apps and that that experience would be meaningfully different, and it's not. Well, I guess you could say it's a little bit true. So Google can say that their own apps are now all optimized and take full advantage of the larger display. So you know you can be confident any time you open a Google app on this Google tablet, it's gonna look great, and that's awesome. But for all of the rest of the apps that make the world go round, all the third-party apps, all the stuff that you probably are thinking about when getting a tablet that you're gonna use, there is no meaningful difference in that situation right now. So a lot of them are still big phone apps, I would say. Instagram is still a giant phone app. Twitter is still a giant phone app. Tesla is still a giant phone app. Expedia is still a giant phone app. CashApp is still not optimized. Neither is TikTok. It still kind of looks weird. SoundCloud is, like, half optimized I guess. Pocket Casts is also halfway there looking like a giant phone app. OverDrive weather is still a blown-up phone app, and the list goes on and on. They have this thing where you can double tap the space to the left or to the right to move it over to the side to make it more one-handable. But I mean, yeah, that's it. It's just a big phone app. The app ecosystem for Android tablets is still to this day, even now that this has arrived, it's still the biggest weakness of an Android tablet, and the incentive, it's gotta be on developers, of course, but most of their incentive is to be as simple and streamlined as possible and if you can just make one iPad app that covers all iPads, you'll do it. But if you can make one tablet app, it won't necessarily work on all Android tablets. So the incentive's still kind of tough. Well, actually, there is one app that Google can say that they got optimized before the iPad and that's the calculator. They did do a full scientific, not scientific, but a full-on calculator. There's a history over here to the side. There's the readout, which you can change the size of, light and dark theme, all this stuff. It's pretty good. Your move, Apple. Some other little random things I didn't quite fit into the full review. When it's docked on the charger, it default charges up to 90%, not a hundred. But I do think that's smart. It preserves the battery life overall. There's also no headphone jack on this tablet, just so you know. And then in case you're wondering, the camera quality is very much in line with the rest of this tablet's hardware, pretty mid. It's good enough for basic video calls and document scanning, but nobody's shooting any movies on this thing. At the end of the day, though, my conclusion is this. Two-in-one devices are typically, they're funny 'cause they're always like slightly worse at one of the things that they're trying to be. This is a two-in-one device. It's a tablet and it's a smart home hub. So I was wondering as I got it, like, what is it gonna be compromised at? Is it worse at one or worse at the other? Turns out it's a decent, cheap Android tablet and it's a slightly below average speaker dock/home hub. But that's fine. I think those two things are close enough together and are simple enough that it makes sense at least. I would personally love a super high-end version of this. I'd be so down for like a 120-hertz, super fast, nice premium tablet that also could dock whenever I want on a nice speaker and become like this high-end, like, boombox thing. But I also know that that would be super expensive and would have a much, much smaller target demographic and probably wouldn't sell enough to exist well. So this is the thing that makes sense and I think it may actually sell a decent amount and we'll see how it does. Until the next one, thanks for watching. Catch you in the next one. Peace. (mellow music)",
    "transcript_keywords": [
        "tablet",
        "Android tablets",
        "tablets",
        "dock",
        "Google",
        "Android",
        "app",
        "home",
        "smart home",
        "phone app",
        "Hub",
        "thing",
        "smart",
        "smart home displays",
        "Nest Hub",
        "speaker",
        "giant phone app",
        "things",
        "apps",
        "Home Hub"
    ],
    "transcript_entity_values": [
        "120",
        "Nexus",
        "7s",
        "three",
        "Apple",
        "10 years ago",
        "iPad",
        "about 10 years ago",
        "Nest Home Hub",
        "the Nest Hub Max",
        "LCD",
        "the Nest Hub Mini",
        "20 to 30%",
        "one",
        "Hub Mode",
        "130",
        "Nexus 7",
        "Two",
        "the end of the day",
        "third",
        "CashApp",
        "more than one",
        "Android",
        "Nexus 10",
        "Expedia",
        "a hundred",
        "Minecraft",
        "half",
        "first",
        "a few weeks",
        "2560",
        "this Nest Hub",
        "every single month",
        "Chromecast",
        "First",
        "the next one",
        "the Pixel Tablet",
        "Google",
        "Android",
        "up to 90%",
        "SoundCloud",
        "number four",
        "second",
        "Chrome",
        "overnight",
        "11-inch",
        "number two",
        "Twitter",
        "Tesla",
        "60",
        "$499 tablet",
        "30,000",
        "TikTok",
        "OverDrive",
        "10%",
        "Instagram",
        "this day",
        "an additional $130",
        "a ton",
        "Nest",
        "two",
        "Tensor G2",
        "jack",
        "up to",
        "iPads"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "FAC",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "PRODUCT"
    ]
}