{
    "id": "auf2ZJjQ7Go",
    "title": "YouTuber's First iPhone 11 Impressions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-09-22T16:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=auf2ZJjQ7Go",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone 11",
        "first impressions",
        "review",
        "camera camp"
    ],
    "views": 490559,
    "likes": 15097,
    "comments_count": 1143,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Right now, I am in Montana and we are at Camera Camp. Now this is an event that my sister and I are putting on with Sony and we've been planning this for over a year. And it just so happens that this event coincides with the launch of the new iPhone 11 and the new Apple Watch Series Five. So, let's do an unboxing. (beeps) And, yeah, another unboxing. (soulful music) Oh oh oh oh Oh oh oh oh Oh oh oh oh Oh oh oh oh I love you, I love you, I love you, I love you - I got to interrupt this montage because this thing looks freaking awesome. Look at this! Oh my goodness! Ceramic watch baby, we're back together! Okay, back to montage. I love you, I love you, I love you, I love you I love you, I love you, I love you, I love you (upbeat music) - We're back with Armando and you just unboxed your phone. - I love it. - I feel like this is like, a little gathering, like we're all opening up our new devices, and mine actually, is currently still backing up right now. - Mine's still trying to transfer from this one and this one. - We are out in the middle of nowhere. We're at a ranch. The wifi is it's fast, but not when you get a ton of YouTubers here. - One megabyte per second. - What is your favorite feature so far? What are you looking forward to testing? - It's gonna sound like the obvious, the cameras. It's great. - Yeah. - Because now you have these wide angles and you know, these telephoto lenses, and it just, it looks so good. I was able to play with it a little bit, and the pictures that you can get. I mean, there's a big difference between the older iPhone and this one. - A huge difference. - I mean, I think it's a massive difference. - Yeah. - A lot of times, it's like, is it really worth the upgrade? No, I think if you love cameras, you like taking pictures or video, it's definitely worth the upgrade. - For sure, I mean, it isn't like a massive upgrade as far as like specs go. Camera wise, it's a huge difference. - And one last thing, iOS 13 is so much more polished. Like, I was literally watching a YouTube video, and I didn't even realize this. Because I haven't even watched any other videos about iOS 13. - Yeah. - I hit the volume button and you have the little icon in the-- it's like whoa! - iOS 13 is so great. - Yes, yes. - Midnight green. Wait, you have space gray. - No, space gray, yeah! - Okay, the reflection off the trees. - Right, right? - This looks like midnight green. - Wait, where's your midnight green? - I don't know. Oh, it's in my pocket. - She has like, all the colors. Okay. - So this is midnight- - It's pretty similar. - Well especially because it's reflecting off the trees. - Right. - So it was making it look like it was green. - I played it safe. I mean, I don't know. - Yeah, but the midnight green is- - It does look good. - It was questionable because you couldn't really tell what it looked like in the key note. - Yeah, I like it. - Until you actually get it and see it. It's awesome. - It's good. (soulful music) - Look who else I found that has an iPhone 11. - Yes, it matches your outfit. - It does. - Did you know, I dropped this in the forest playing laser tag? I can literally send you the clip. - That's amazing. - It fell out, and I had to use find my iPhone and it was like, under grass. (grass rustles) - [Sara] iPhone, come here. I lost a forest green iPhone in a forest, guys. Op! - It's right there. - I must have lost it when I was running then. (Phone dinging) Ah! - [Man] Boom! Miracle of miracles. (kids yell yay) - And it's green, yeah. - I mean, it is, like, kind of camouflage, we were just talking about that. Because Armando had the space gray, and reflecting off the trees, his space gray kind of looked midnight green. - Interesting. They are very similar. - It is, midnight green was surprisingly, I actually really-- - Do you like it? - like this color a lot. - Yeah, me too. - For my personal phone though, I went for the silver. - Really? - Yes, I did. - I mean, that's you. - Remember when we were-- - Yes. - talking about the ceramic watches? - The white and silver? Yeah, I've converted. I'm much more, I like this. - Yeah, I like it a lot. - Favorite feature is when I'm selfie videoing mode, it's like a really wide angle. - Yeah. - Compared to, I always compare it with the Note10 because the Note always have high resolution and a really wide angle with the selfie camera. And I feel like I've been waiting. - The thing that drove me so crazy about the Note front facing is it would like wash out your complexion so much. - Yes! - And everything was like, super flat because we just did a comparison. - I had always compared it to those phones and I think we've arrived. Like, we have officially arrived, where I don't think people can complain about the cameras anymore. - I know, the front facing 4K, thank you. Thank you! - 4K, 60. Have you gotten some slo-fies in? - I was just gonna ask you, that was my next question. I was like, do you want to do a slo-fie? - Yes, yes! - Okay! It's hard to do it with the guys, cause they don't have long hair so it kinda just is not as cool. - Let's do it, let's do it. - Except, okay Tyler, we'll slo-fie next. (upbeat piano) - We're so cool. - [Sara] That might be the best slo-fie I've ever seen, to be honest. Oh my gosh, can I get one for my channel? - Of course. - This is how movies are made, if you're wondering. Alright, ready? Chasing! Oh god! (background chatter) Oh no! Did you, is it cracked? - I don't know, no, my old one! I made it, over a year. Oh my. - Okay, I'll just-- - Everything is so sad. - Oh my god, it's all my fault. Justine, - This is the best slo-fie you've- - Can I still be your friend or are you going to exile me? - No, it's my own fault. It's my own fault. I made a mistake. I have dropped two phones! - [Sara] I mean, thank goodness you had the case on, first of all. (laughs) - Well-- - It was a slo-fie incident. - [Woman] I heard someone screaming, like they got murdered. - I did. I mean, it's just like a small little scuff. And honestly, I think I could probably like, I mean, it survived the concrete. I haven't even had it for 15 minutes. - Now you can title this, \"Drop Test\". - It didn't shatter, I mean, it just dented. - I'm sorry. - It's okay. Alright, anyway, slo-fies are cool. - Slo-flies. Let's blame the slo-fie. (beep) - Now I have this phone for another year with its injury. It's okay, I enjoyed it. Thanks for being in my video. - I'm so sorry. (fake crying) - I can't believe it. (beep) (intense music) - Welcome to coffee chats with Justine and Kraig here. We are going to talk about the new iPhone. So you've had it for a couple of days. - I got it. - How do you like it so far? - I love it. I wasn't expecting the quality to be as good as it is. - Yeah. - And I cannot wait to get out and shoot a hiking video with the video. - That's what I'm so excited to do, just an entire shot on iPhone. Super cinematic, really awesome. And I'm shooting some stuff for like the (mumbles). This phone already has incredible stabilization, but adding that in, I mean, it looks like a drone is following. - I don't know what it is, but it kinda, I see some shake when I'm shooting it with my hand, but when I watch the video back, it's like always smoother than what I saw. - We were surprised by how great the wide angle looks when you're walking too. I'm looking forward to seeing your hiking iPhone video. Do you know where you're gonna wanna go? - Spain. - Spain? Oh shoot. - (speaks in foreign language) - Oh, that'll be so fun. Oh my gosh, well have fun, let us know when it's up. Okay cool. Let's find somebody else who's got an iPhone. (upbeat piano) Okay, you've had it for three hours now? - Give or take. - Same, and I already dropped it, which is unfortunate. - That's so sad. - It's okay, it happened during a slo-fie moment, so I feel like it's okay. - It's appropriate. - It is. So, in the three hours, what do you think so far, and what are you looking forward to testing the most? - Okay, so first off, the back of this feels so good. - It does. - I did not expect it to feel as good as it does. I'm also really liking my choice with the white, because this looks different. Doesn't it? - Yeah, it does. - Is yours? - No, well... - Do you have a different color besides the white? - I'm never taking this case off again. Thankfully, I have this case on. - So we'll never see what the back of this looks like again. So nevermind, the thing I said about the back. It's fine, it doesn't, the case would be fine. - No, I mean the back looks really cool. And what I like about it-- - It feels nice. - It does, and it's less slippery than a previous version, because this is so hard to hold on to. - Yeah yeah yeah. - So that made a huge difference. - I like that a lot. The camera is the thing I wanna test. Right, like I wanna do that thing, they did in the demo, with the filming pro, where there were like four different cameras at once. That's what I wanna do. - That's gonna be so awesome. Yeah, I don't think that is out yet, but it's gonna be really cool. Because, what I wanna do is kind of do, vlogging, Like I can vlog myself and vlog what's around, you're seeing in front of you, so it's gonna be super cool. - Yeah, I'm excited about it, for sure. (upbeat music) (knocks) - Ah, hi. - Hi! Okay, okay, iPhone 11, what do you think? What do you think, what do you think? - I'm kinda busy. - No, you're not! What are you doing, let's talk about the iPhone. - No I'm not doing anything. - Are you editing? - No. - What're you editing? - No, no, no, no. - Lemme see the movie. - No, it's totally fine. - He's editing, get a shot. - I'm not, I'm not editing. No, hey, hey! - I managed to pull him out of his cave of editing. You've been editing non-stop for the past several days. You haven't slept, so thank you for being here with us. - Thank you for having me. - So you've had the iPhone for a couple of days, and you actually got a bunch of shipments here today. - Yeah, I did. - [Justine] Look at this! Oh my goodness. Clearly, the iPhones have been delivered. - What's going on? I do not understand what's going on? Hello? - What do you think so far? - I love it, this key note really really delivered what this phone can do, and when you compare it to the other big guys, you see that they really did something amazing. The ultra zoom, they didn't even demo the ultra zoom, it is fantastic. - Whats crazy is his videos are so in depth. I mean, you basically test everything. I mean, you do speed test, battery test. I mean, your tests are so intensive, it is just exhausting to watch because I know what goes into doing that. So if you guys want some crazy sense of testing, go check out his channel. I'll put a link in the description. Because it's gonna be awesome. What do you think of the wide angle lens? It's pretty cool. - Wide angle lens is really good. There's no barrel distortion. It doesn't have the optical stabilization. It's a fixed focus, but still, it is really good. And the electronic stabilization that is applied to it is fantastic and it shoots in 60 frames per second, which is a big deal, because the other ones cannot do it. The audio is amazing. I found a way to demo it to you guys. So if you watch my video with a pair of headphones, you will hear the difference, and I'm sure people are gonna say, \"Oh, he's faking it.\" No, no, the difference is ridiculous. - You got a leather case on it. - Oh yeah, of course. - This is the first time I'm seeing the leather case. - I'm nothing without the leather case. - That looks good. And I'll tell you, good thing I had my case on when mine took a small fall. Even though, I think it would've been okay, cause stronger glass. - As is tradition, right? It has to fall. You do the drop test. - But I don't even ever do drop tests. They're all accidental. (soul music) - We gotta go tell Jenna. We gotta see what she thinks. (yelling) Jenna! - Yeah? - Let's go in and see this girl. This is our cabin. - Oh my gosh, no one should see what's happening right now. - It was at one time very nice and organized, but Jenna's got some stuff going on over here. - Okay, so I have three hours until this restores. Normally, I don't like to restore from backup, but it has all my stuff. - One of the reasons that I did restore from backup is because I wanted all my lightroom photos that was in there and also the instant 360 library I wanted. So this is one of the first times that I've ever actually done an entire backup. - It's not the first for me. - It's not? - Yeah, I usually do it all the time, but I always have problems. But I also have 20 thousand pictures that I would want. - (whispers) That's a lot. I think I also have like 60 thousand. - You probably have a million more. - Yeah I do, that's a lot. - So, I haven't used it yet, but I like the feel of it. It's not as slippery. It's kinda slippery, not as slippery. - Well, you've been taking a lot of photos, you've taken so many pictures of me on mine, so taking pictures of me, on my phone, what have you thought so far? - I like it, I'm really excited for the night mode. - (whispers) Oh, the night mode. - It's really good. Where am I gonna sleep tonight? - On the floor. Can you sleep on the floor? Look at all this room. - Go to sleep. (soul music) - You got yours, and how long have you been using it so far? - Probably like, four hours. - Okay, so in those four hours, what have you tested and what are you most looking forward to testing? - I've tested the cameras and I have to say that the biggest thing I've noticed is that the ultra-wide is consistent with the other cameras, and the quality is crazy. Crazy good. H.D.R. is great. And the display and stuff is nice and bright. And I tested it with the sun directly on it, and I was still able to see everything clearly. And I was searching the course runs very smoothly on the processor. So, the phone feels great and it looks great and it matches your little army green outfit there. - What do you think of the color so far? Do you think it's different from what you saw online? - It's about the same. - Yeah. - And I like it. I like that it's matte and I like that it's not really super glossy so it just shows up well on camera especially. And I like this camera array. It kinda grew on me. You know, it looked a little weird at first, but I actually do like it and it's a good way to distinguish that, you know, you have a new iPhone so. - And I really like that this is all one piece of glass too, which is kinda cool, because it just makes it all look super seamless. - Yeah and the fact that Apple made the iPhone bigger to compensate that big a battery, I like it. I mean, I like a phone that feels like it has some power inside of it, feels like it can actually, you know, last all day with the battery. - I mean, I kept holding both of them, in both of my hands, and I can't feel a difference. - Yeah, yeah. - I would like to do, I was gonna say a taste test. (laughing) Today, we're doing a taste test of the iPhone. But just like kind of a blind fold test to see if I can tell which is which. But I guess I'd be able to feel it, so I'd probably have to put a case on. - Probably have to like, hold it without. - But I do love this, it's way easier to hold too. Cause the old one, it just would fall right through the hands. - A little slippery, yeah, my first impressions that, this phone, I think from what I've seen from a lot of people, when you actually get in and start using it, some people may not see it as a super exciting update, but it's a lot of little changes, little things like that, so I think it's gonna be a winner for this year. - I am excited, obviously. - Yeah. - Okay, well have fun with your phone. (tech music playing) Last but not least, we have Tyler. He's been filming this entire video for me. So Tyler, you've got your phone. What do you think? - I really like that it's like, in pristine condition, and not (laughs) dented or scratched. (laughs) I'm sorry, I'm sorry. - It's okay. The drop that that phone had, it should have shattered. When I got the pixel before, I had unboxed it, and I dropped it from, maybe from like here. The thing shattered completely. Like this thing took a massive fall, so it survived. So other than your pristine condition, the space gray. - Well, everyone's been saying they like how it feels. I like that too. But something that I need to test more, but I don't think anyone is talking about. - Oh, secrets. - You might have to get a close up on this. In the iPhone 10 and in previous iPhone software, maybe, when I go to darken a photo, if I want to decrease the exposure, in previous versions, it would really wash out the whites, right? So it would make them, see how they're staying bright? - [Justine] You're right, yes. - [Tyler] So that has been. Do you have a 10s? I really don't like what the camera software, has been doing when I want to underexpose a photo, 'cause I like to underexpose photos, especially when there's like a bright sky. I like to do this, and I like to, you know, that's like a cool, silhouette look. - That is cool. - But on the 10s, it washes out the white, and doesn't keep them contrasty like that. (sings) Okay, so find this frame, and tap and then drag down. - [Justine] Yeah, holy molly. - [Tyler] It's way different. - [Justine] Let me turn my brightness up maybe? Let me just. - Let me try mine too. - [Justine] Okay, so my brightness is all the way up. How does that look Jen? Oh my god! - [Tyler] See how, see? How mine is staying contrasty. - [Justine] Whoa. - [Tyler] So, I don't know, it might not, it might be something I'm misinterpreting. - [Justine] No, we just tested it. - I just noticed that and I was like, this is different. Something is different here with the camera app. Something's changed. - I did notice that, but I didn't know what was happening. So this all makes sense. - Yeah. - So I think the general consensus is the camera's pretty freaking great. - The camera's are, I mean, until something else comes out, it's the best camera in a smart phone. - So Tyler has helped me shoot the Note video, the Pixel video. So you have been there and you have seen a lot of this footage up close. - I haven't been this excited about an iPhone camera for like four years. - And here we are. - So, it's exciting. - Look how excited he is. He's actually really excited. - Should we say, \"One two three, iPhone on three\"? - Yes, yes. - Yeah. - [Justine] The other ones backing up, so it's fine. - [Camerawoman] Pretend this is an iPhone. - [Justine] Okay. (in unison) One, two, three, iPhone! - [Camerawoman] Why is it so quiet? - I don't know, because it's so peaceful and beautiful out here at Camera Camp. - [Camerawoman] Guy's, we've got to go, I think there's a sunset happening. - Oh my god, there is. - Okay yeah, bye. - Do you wanna go? Okay bye, I'm gonna end my video now. Thank you guys so much for watching, this was really fun. And thank you to everyone who participated in this video. And thank you Sarah, for making me do a slo-fie with you, and possibly breaking my phone. But, thankfully I did not, it survived. Stronger glass is a thing. I will see you guys soon. And make sure you check out everyone else's channels, I will like them down below. Bye. - Okay. - Rosie! Rosie, come on the iPhone! - [Camerawoman] Rosie, rosie! Come see the phone, Rosie! - Oh, you are wet! - [Justine] Hey, get him! - [Tyler] She is so wet. - [Camerawoman] Are you wet little dogie? Look at that butt, go show Justine. Go show her how wet you are. - Go show me how wet you are. You're very wet. Would you like to go under my umbrella? - [Camerawoman] You're super wet. She's soaking wet. You can't go in there. - [Justine] Honey, I tried to get you to come in earlier. Not now, you're soaked. - [Camerawoman] Oh my gosh, she wants in there so bad. - [Tyler] Rosie, no! No, no, down. Nope, nope, nope. - [Justine] This is incredible. (laughs) - She got you. - She got me good. - Like she grabbed you. - Bye Rosie! - [Tyler] It's 'cause she loves me. (violin music) (beep) (knocks) - Jeez. - Hey! - Hi. - What do you think of the new iPhone? - The new iPhone? Why don't you guys come in and let me tell you something about it? - I thought you were gonna tell me to go away, Ned. - Oh, I'm sorry.",
    "transcript_keywords": [
        "yeah",
        "iPhone",
        "love",
        "Camera",
        "phone",
        "Yeah yeah yeah",
        "good",
        "video",
        "cool",
        "thing",
        "Yeah yeah",
        "Test",
        "green",
        "kind",
        "lot",
        "Midnight green",
        "case",
        "cameras",
        "slofie",
        "feel"
    ],
    "transcript_entity_values": [
        "iPhone 11",
        "Justine] No",
        "Armando",
        "20 thousand",
        "the past several days",
        "second",
        "slo-fie",
        "one",
        "Tyler] Rosie",
        "Camera Camp",
        "Justine] Honey",
        "Apple",
        "Justine",
        "tonight",
        "Montana",
        "a couple of days",
        "four years",
        "Rosie",
        "Sony",
        "four hours",
        "iPhone",
        "4",
        "three hours",
        "Today",
        "three",
        "a ton",
        "60 thousand",
        "midnight",
        "those four hours",
        "slo-fie",
        "One megabyte",
        "Note10",
        "YouTube",
        "13",
        "the slo-fie",
        "Justine]",
        "Camerawoman",
        "slo-fie you've- - Can",
        "four",
        "iPhones",
        "Sarah",
        "a million",
        "Drop Test",
        "Jen",
        "15 minutes",
        "rosie",
        "Kraig",
        "today",
        "this year",
        "10s",
        "two",
        "Ned",
        "60",
        "another year",
        "Tyler",
        "Spain",
        "H.D.R.",
        "first",
        "the three hours",
        "YouTubers",
        "Apple Watch",
        "One two",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "FAC",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "TIME",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORDINAL",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL"
    ]
}