{
    "id": "AxSJwfykIZg",
    "title": "I WASTED $240 on my cat - enabot EBO Catpal",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-08-04T21:06:13Z",
    "video_url": "https://www.youtube.com/watch?v=AxSJwfykIZg",
    "category": "Science & Technology",
    "tags": [
        "Cats",
        "Toys",
        "Camera",
        "Remote",
        "Wifi",
        "Response",
        "Entertaining",
        "Laser",
        "Unboxing",
        "Kitten",
        "Talk",
        "Interact",
        "Baby Sit",
        "Care",
        "Moving",
        "Robot",
        "Rolling",
        "Accessory",
        "Battery",
        "Linus",
        "Pet",
        "Toy"
    ],
    "views": 356753,
    "likes": 21599,
    "comments_count": 956,
    "description": "Would a cat notice us if we had a robot take care of it? Linus decides to find out!  Buy enabot EBO Catpal On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy Cat Toys On Amazon (PAID LINK):  On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/Ratbh",
        "https://geni.us/JM8gi",
        "https://geni.us/Dvqk",
        "https://geni.us/EJZq",
        "https://geni.us/rDceAPL",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Ebo, Catpal. - What's that, daddy? - Oh, on the box it says, \"Your cat's new best friend.\" (gasps) Are you not gonna be Dash's best friend anymore? - No, I'm not her friend, I'm her family. - Oh, okay. Fitness trainer and personal photographer. That is a lot of-- - But Dash is gonna break it. - You think Dash is gonna break it? - Dash is fierce. (laughs) A guy and a what? (gasps) This what is a charger. - Mm-hmm - Oh, a moose head. (laughs) A moose body and pieces in the moose body. This is a Santa Claus man. - There's this kind of, remember that phone backing that was really popular for a little bit, where people were using this phone case with these kind of micro suction sort of things, so you could stick your phone to a window? So it has that on the bottom of the charger which is actually pretty nice. So there's a camera on the front, what looks like some kind of, maybe ambient light sensor, or something like that. And then what looks like a speaker on the back. And then it actually moves around with these two treads so it looks like it can do everything, from forward to backwards to spinning on the spot. Initialize Ebo Catpal. Okay we gotta put the charging stand in an open space and plug it in to a power source. Okay, turns red. The eyes light up. You're supposed to scan the QR code so that Ebo can scan it and connect to the wifi. Okay, I think that's good. Let's play with your cat. Okay. Please update the firmware of your Ebo robot. See, this is what I'm talking about, modern toys, right? That's actually a pretty decent looking camera. Latency is not terrible. Ha, that's not bad. Okay you can change the speed of the Ebo. You can record your Ebo camera. You can take pictures. Hello? (robot repeats) Oi. You can talk to the cat through the Ebo app. This is gonna take a little bit. (daughter giggles) - [Daughter] Is Dash gonna take a swing at Ebo? - Yeah, it's a pretty basic robot with a camera on it, I guess. She is not sure of what to think of this. Well do you wanna do the feather or do you wanna do the moose hat? - Moose hat, please. - I'm tryna to steer right and it's just not having it. Oh my goodness. I think we should really try the feather. Oh, what, there's a laser pointer? Oh, no way. - [Daughter] What? - [Linus] Shh. (upbeat music) - [Daughter] What? - [Linus] Shh. (upbeat music) This thing is almost impossible to control, it's extremely frustrating. It's stuck again. (upbeat music) And it's stuck again. Well it didn't take long for it to incapacitate itself. One thing they did well, is making it so that the motors aren't super loud, it's pretty quiet. It doesn't seem to be scary to her, she just mostly doesn't really care about it right now. It's not very often that devices these days come completely dead. So it has alarms, so you can set it to automatically go off the cradle and play with your cat up to 20 times a day. As for whether your cat's into it or not, well that sort of depends on whether you can find something to put on it. Here we go, let's give this another try with fresh batteries. Maybe it'll be a better experience. Yeah, it definitely goes a little better. The low battery was hurting its ability to chuck around like this. (Ebo knocking) Wow, the cat really does not care about this thing very much. - [Daughter] Can I take a picture of Dash-y, please? - Yeah you can take a picture. So I think you click the camera button right there to take a picture. Your mileage may vary but I think my kids like it more than my cat does. I see the potential here, especially if you could find a reliable way to attach a toy your cat actually likes to the top of it. But with a couple sessions, and really not much in the way of success, I can't say that I'm that impressed. (adhesive tape snaps) New plan, we're grabbing permanent adhesive tape and we're taping a toy the cat actually likes to the top of Ebo here. (whimsical music) (daughter giggles) Yeah, I think our cat really doesn't care about it. You compare this toy, not attached to Ebo and you get a completely different reaction. This is a very, very playful cat. Like you would think watching her play with Ebo that she just doesn't like to play, but she does. And she loves this toy. So yeah, you still have to actually play with your pets, you can't just replace yourself with a robot yet. Unless your cat is dumber, I guess. Don't forget to subscribe to subscribe to ShortCircuit. Probably won't do too many videos like this one 'cause I mostly think these things are pretty stupid but at least my kids like it (laughs).",
    "transcript_keywords": [
        "Ebo",
        "cat",
        "Dash",
        "moose",
        "Ebo Catpal",
        "camera",
        "pretty",
        "play",
        "Yeah",
        "Initialize Ebo Catpal",
        "toy",
        "friend",
        "Ebo camera",
        "Catpal",
        "thing",
        "kind",
        "picture",
        "phone",
        "care",
        "Ebo robot"
    ],
    "transcript_entity_values": [
        "up to 20",
        "Ebo",
        "Dash",
        "ShortCircuit",
        "two",
        "Linus] Shh",
        "these days",
        "One",
        "Santa Claus",
        "Catpal",
        "Dash-y",
        "Ebo",
        "Ebo"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON"
    ]
}