{
    "id": "azNK_Tgkb30",
    "title": "Designing the brain of the Home of the Future with Grant Imahara",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-20T13:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=azNK_Tgkb30",
    "category": "Science & Technology",
    "tags": [
        "home",
        "grant imahara",
        "prefab house",
        "smart home",
        "smart house",
        "future",
        "future house",
        "future tech",
        "future home",
        "future gadgets",
        "gadget",
        "modular home",
        "construction",
        "electronics",
        "the future",
        "real estate",
        "building",
        "house",
        "smarthome",
        "future technology",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "now this",
        "latest updates",
        "how to",
        "how to make",
        "mythbusters",
        "google home",
        "google",
        "apple",
        "mkbhd",
        "verge",
        "the verge"
    ],
    "views": 1276561,
    "likes": 20409,
    "comments_count": 1347,
    "description": "You can buy a lot of futuristic technology to put in your home, but having them all function together as one truly smart home can be a nightmare.  Join Grant Imahara as he works with a home technology integrator to build the brain of the smart home.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - Getting smart home technology for a home of the future has never been easier. There are smart versions of just about every household item. Smart lights, smart speakers, even a smart refrigerator. But connecting them all together to make a truly smarter home can be a nightmare. So how do we connect the home of the future? Well, you need a serious brain, like this thing. And to integrate it, requires some serious brain power. Pete Sandford is the owner of Smarter Homes, a company that helps to customize and maintain home automation systems. He's what's known as an integrator, and his role is to bring all the smart devices of the home together, which is essential for the home of the future we're building here in Austin, Texas. 'Cause we've got a truckload of cutting edge technology to install. - This is probably 25% of what's gonna come and make the home of the future. - You're kidding me. The home of the future has a lot of stuff in it. - [Pete] Yeah, takes a lot of parts and pieces and everything's gotta speak the same language. - [Grant] Wow, that's a lotta languages. - [Pete] Oh yeah. - [Grant] Someday these devices might be fluent right out of the box. But for now, we need an integrator like Pete to give the different dialects universal language. And even a tech savvy guy like me who's more than capable of installing his own smart devices would have his hands full trying to unify everything. Over the next month or so, Pete and his team will work to wire the home to handle all the smart technology we're packing into it. Now maybe you're thinking, \"Wires? Shouldn't our future be more wireless?\" While there's some promising developments in wireless power, we're still years away from having anything reliable enough to even consider installing in our home. So instead, for Pete and his team, their goal is to make these wires invisible. So, Peter this is the moment of truth. I mean, last time I was here, this was just a hole in the wall with a bunch of wires coming out of it and now we have the super computer brain of our house. I mean, when I think of a super computer, I think of War Games and the whopper computer the (making whirring sound) But, this is gorgeous. What's inside here? - Everything. This is as good as it gets when we're talking smart home technology. So, here we've got our two Sonos players for feeding the indoor and outdoor audio, our Wattbox, which is acting as a cutoff for power to each individual piece of equipment. We've got our Luxul switch which is feeding network to all the individual pieces of components. We've also got our AT&T modem. That's feeding the internet from the street into our system here and then out throughout the house. Our Denon surround sound receiver which is handling all the surround sound in this room and the video and audio in the next room. We've got our Lutron communicator which is wirelessly communicating with all the light switches. Our two Roku players for both this room and the bedroom. Our amplifier here which is powering all the landscape speakers and subterraneal subwoofer. We've got our PlayStation 4 for gaming, and finally, probably the most important part in here is the brain which is the RTI XP-8 processor. And this really helps us bring all of these individual items together and integrate them onto one easy-to-use interface. - So you don't have a million remotes. - Yeah, or a million apps. (laughs) - That RTI system that Pete mentioned, you can think of it as the operating system for the entire house. And it's highly customizable based on the user's needs. So this is the whole interface for everything that's in that rack? - Yup. This is Remote Technologies, Inc., sitting with us is Matt, he is our wizard, or RTI programmer. And he's the one who makes the system easy to use and function organically with a family. - So through this interface you're controlling everything in the house of the future? - Pretty much everything. Some devices don't connect into automation systems, they might have a closed or a partially closed API. - [Grant] API or application programming interface is the key part of how you integrate products into the home. Devices with very open APIs allow us to integrate their controls in a deep way with the home system. Whereas devices with closed APIs block our ability to link their features with the rest of the home. For example, our Nest security camera on the front door has a closed API, so we couldn't get that camera feed into the RTI system. In contrast, the IP cameras around the home are completely able to be integrated with RTI, which allows us to pull up a feed of what's going on around the home directly from the RTI system. - So, this is the dashboard for the entire home. Got our controls and activities for the living room, our patio audio, our nest climate control for the whole house. Normally, in most systems, you'll just see it'll say Apple TV. Here we've dialed it in to specific apps. So I know I watch Netflix, I watch Hulu, everything that needs to happen to watch Netflix then happens at the push of that one button without navigating anything. - Okay, so let's say I got a new gaming system, I see you've got a PS4, what if I got an XBox. - [Pete] We could just grab in an XBox icon, and then program it to where it'll switch to that gaming input for the Xbox just at the single push of a button. - [Grant] RTI is also able to plug into Alexa, which opens up the entire system to voice control. However it introduces an extra step. Instead of saying, \"Alexa, turn on Netflix.\", I'll have to say, \"Alexa, tell Home Butler to turn on Netflix.\" So, a little more awkward and frustrating if you forget, but soon we're told that the system will be upgraded to avoid having to do this additional step. - But that's kinda the easy side of the programming. Matt gets us into more of the advanced side, where you'll have shortcuts, you know, for things that you do everyday. So like Good Morning or Good Night or Welcome Home or Away. - So show me what Welcome Home does. - So come in here, open up that function. You'll see right now we've got that programmed to set the living room to Netflix, playing some music in the landscape, we're altering the thermostat temperature to 70, and then we'll turn on some lights in the kitchen, the living room. But only if it's dark, so if you're coming home in the day, the rest of the functions will still happen, but the lights will stay off to conserve energy. - And that level of house wide control of our devices is really the strength in a system like RTI. The ability to string together so many devices to function as one home is the goal of the home of the future. The downside to this smart integration? Well, besides the up front fees, there's a $30 monthly service charge for tech support, and a twice a year visit from a programmer to make any changes. So Matt I'm looking at this, and I'm getting really excited 'cause I'm an engineer. Is this something that I could take this software and run with it myself? - No, the end user doesn't actually typically program the system, we do that just for the sake that we can make sure we get everything in the right order. - So you're saying no to prevent me from being a danger to myself. - Correct. - And while it would take a lot of work to attempt this kind of high-level integration ourselves, a low-cost workaround is to use only smart devices that already speak the same language. For example, if you got Google Home, Chromecast, and Hue lights, you could probably get most of the features that we have in our home for under 200 bucks. But for the home of the future, having a bunch of smart devices alone isn't good enough. All this technology needs to function together seamlessly. - My job as the integrator is to take all of these things and make them all communicate together on one system that's easy to use. - Might not be all the way there yet, but we're closer than ever. For now, our home of the future is as unified as it gets, making life more convenient and enjoyable with the push of a button. Thank you so much for watching. Now that you know what it takes to connect the devices inside of our home of the future, how do you integrate the devices inside of your home? Let us know in the comments below and we'll see you next week with a new episode.",
    "transcript_keywords": [
        "home",
        "smart home technology",
        "system",
        "smart",
        "future",
        "devices",
        "RTI",
        "RTI system",
        "smart home",
        "smart devices",
        "home technology",
        "Pete",
        "Netflix",
        "home system",
        "make",
        "home automation systems",
        "room",
        "house",
        "smarter home",
        "technology"
    ],
    "transcript_entity_values": [
        "Google Home",
        "War Games",
        "Wattbox",
        "one",
        "AT&T",
        "PS4",
        "Chromecast",
        "the day",
        "XBox",
        "the next month",
        "Alexa",
        "Lutron",
        "Nest",
        "Matt",
        "Good Night",
        "Smarter Homes",
        "Austin",
        "years",
        "API",
        "Hulu",
        "monthly",
        "Alexa",
        "RTI",
        "Apple TV",
        "Hue",
        "25%",
        "two",
        "PlayStation 4",
        "Peter",
        "Welcome Home or Away",
        "Welcome Home",
        "Home Butler",
        "next week",
        "Xbox",
        "a million",
        "Sonos",
        "Texas",
        "70",
        "Netflix",
        "200 bucks",
        "IP",
        "30",
        "Remote Technologies, Inc.",
        "Pete Sandford",
        "Pete",
        "RTI XP-8",
        "Roku"
    ],
    "transcript_entity_types": [
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG"
    ]
}