{
    "id": "Azv-fRjPTWU",
    "title": "Is the Best $100 Smartphone from 2013?",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-07-27T16:59:09Z",
    "video_url": "https://www.youtube.com/watch?v=Azv-fRjPTWU",
    "category": "Science & Technology",
    "tags": [
        "smartphone",
        "budget smartphone",
        "budget phone",
        "cheap smartphone",
        "cheap phone",
        "blu life max",
        "android",
        "budget",
        "phone",
        "tech",
        "best smartphone 2017",
        "galaxy",
        "best budget smartphone",
        "samsung",
        "galaxy s4",
        "blu",
        "austin evans"
    ],
    "views": 980677,
    "likes": 24181,
    "comments_count": 3682,
    "description": "Is the best budget smartphone from 2013? Or a new $100 cheap Android phone from 2017? Samsung Galaxy S4 on Amazon:  Blu Life Max on Amazon:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/galaxys4",
        "http://austin.tech/lifemax",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. I've done a lot of videos on budget smartphones. However, this, this is something a little bit different. Meet the Samsung Galaxy S4. The hottest flagship of 2013, that now costs about $100. This might sound like a weird idea to do a video on, but it's something that's really interesting to me. So on one hand, you have a new smartphone that's meant to hit a budget price. But on the other, if you get something like this, it is dramatically cheaper than it was when it first came out, and you're still getting all the advantages of a proper flagship. So I was able to find this Galaxy S4 brand new in the box, however there are still tons and tons and tons of these phones that are available on the used market for anywhere between $70 to $100. So this brings me back. I actually was at the launch event for the Galaxy S4. It's hard to believe that was a full four years ago. But what I'm really curious to see is how well this phone actually holds up today. Oh wow. This is so much smaller than I remember it being. Look at that hyper glaze finish on the back. Man, I remember how much of a fingerprint magnet this was. But if I remember right, there's actually a lot of interesting stuff in the box. So not only do we have the microUSB cable, we have a wall adapter, as well as it looks like some fairly generic looking headphones. But because this is an old school Samsung phone, we also have a removable battery. When is comes to the hottest phone of 2013, the Galaxy S4 actually doesn't look too bad today. So yes, it is definitely all plastic, and with this sort of hyper glaze finish, it does look a little bit cheap. However, this guy is actually rocking pretty decent specs for back in the day. Ha, it still has a charge. What is it with me and pulling super old smartphones out of the box that actually can turn on? That's crazy. And that Android 4.2 life. Yeah, this thing is, this is interesting. This was definitely like sort of peak TouchWiz, when they would throw every possible feature at it and almost none of them were useful. Of course taking a look at a Galaxy S4 in a vacuum is no good. So to compare, we have the Blu Life Max. Now for $100, there is actually a lot to like with this phone. There are a ton of accessories here. And also it looks like we have a case and screen protector. For $100, that's actually a lot. The look of this phone is very interesting for a budget device. So it has this soft touch rubber which is meant to look like leather, and it even has sort of fake stitching around the side. It actually reminds me of some older Samsung phones. I don't hate it though. Especially compared to the super generic black plastic. It's not that bad. One thing this does have going for it, is pretty giant 3700mAh battery. Which should definitely give it tons of longevity especially considering the specs. On top of that, we do have dual SIM cards as well as a microSD card slot. And if I pop the back on, you'll also be able to see that in addition to the camera, there is a fingerprint reader on the back. That is really cool for $100 Android phone. So if you try the fingerprint reader, huh, that's actually pretty quick. This may be be a little bit slower than newer flagships, but that's actually not bad at all. I mean pretty much leaving your finger on it, it almost immediately unlocks. Side by side with the Galaxy S4, one of the first things that you'll notice is just how much bigger this is. And this is fairly standard for a lot of phones these days. The Galaxy S4 just looks tiny in comparison. And what's interesting about this, is that while this does have the bigger screen at 5.5 inches, it's only 720p. Whereas the Galaxy S4 was one of the very first phones that moved up to 1080. It's an AMOLED display, and it does look a lot nicer. It is super interesting that both of these phones now cost about $100. Especially considering that while this phone was kind of made to kind of hit that price point, this one has come so far, and yet there's a lot of areas where they are actually very similar. Not only do both phones have LTE, but they also have quad core processors with 2 gigabytes of RAM. However the biggest difference here is going to be in software. Where the Life Max ships with Android 6.0, the Galaxy S4 actually has Android 4.2 Jelly Bean. Now to be fair you can upgrade this to Android 5 which should make a fairly big difference. But a lot of apps out of the box are just not going to work on this guy. Where the Galaxy S4 has TouchWiz pretty much everywhere you look, and most of it's not really going to be all that useful, luckily the Life Max actually is going to be a fairly stock build of Android. Now to be fair there are a lot of pre-installed apps which definitely kind of help to keep the price low, but the good thing is nothing's all that crazy, and of course all of it can be disabled. One of the interesting comparisons between these two phones are the cameras. So the Galaxy S4 is rocking a 13 megapixel camera whereas the Blu has eight megapixels. But of course it has four years of advancements. So see how they actually compare. So there's a lot of contrast here, but, ah, this is a really difficult shot. It's not bad, but the background is blown out, and Ken is super dark. And now if I take a shot with the Blu. Oh wow. That has a lot more in it. To be fair it's a little bit older school style of doing HDR. So you can actually see it taking multiple exposures, but this is a much more usable image. To get a little bit more of a normal shot though, and the Galaxy S4 looks a lot better. Colors are a lot more vibrant. You can see it's a bigger sensor, there's a little bit of depth of field in the background, whereas with the Blu it's very washed out and yeah, that is not sharp at all. I'm actually really impressed with how good this Galaxy S4 camera is. And yeah, if you push it really hard with a very contrasted image, it's just not quite so great looking, but you get a decent looking shot and it is really clean. One area where things definitely have improved over the last few years is in selfie technology. So, that's actually pretty close. I think I'm going to have to give a slight edge to the Galaxy S4 based on sharpness. The Blu just looks a little soft. The more I use these phones, the more I realize that they are very, very similar in most ways, but the biggest difference is software. Put simply Android 6 is totally modern. Pretty much all apps will run on it. And while yes, while this is not the most powerful phone in the world for $100 it will do basically everything you need it to. You've got two options here, a safe one, and a risky one. So with the Blu, not only are you getting a brand new phone, but it's running that newer version of Android which just simply means it's going to last longer. On the other hand, I like the Galaxy S4 as a phone more, but at some point in the not too distant future, app support just really isn't going to be a thing here. So for $100 which of these phones would you guys go for? Let me know in the comments below, and I will catch you in the next one.",
    "transcript_keywords": [
        "Galaxy",
        "lot",
        "Android",
        "phone",
        "phones",
        "Blu",
        "Life Max",
        "interesting",
        "Austin",
        "pretty",
        "Blu Life Max",
        "Samsung Galaxy",
        "bit",
        "life",
        "back",
        "Android phone",
        "Samsung",
        "tons",
        "thing",
        "Max"
    ],
    "transcript_entity_values": [
        "Android 6.0",
        "The Galaxy S4",
        "eight megapixels",
        "1080",
        "first",
        "about $100",
        "RAM",
        "four years",
        "the day",
        "Galaxy S4",
        "Samsung",
        "Ken",
        "a Galaxy S4",
        "Austin",
        "4.2",
        "two",
        "microUSB",
        "2 gigabytes",
        "13 megapixel",
        "these days",
        "one",
        "Life Max",
        "the Galaxy S4",
        "6",
        "the Life Max",
        "a ton",
        "2013",
        "the Blu Life Max",
        "microSD",
        "TouchWiz",
        "the Galaxy S4",
        "the last few years",
        "a full four years ago",
        "One",
        "100",
        "between $70 to $100",
        "today",
        "LTE",
        "Android 5",
        "Blu",
        "5.5 inches",
        "3700mAh",
        "Android"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ]
}