{
    "id": "AZwfIf-FXLw",
    "title": "Birthday Party for our dog!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-10-11T21:05:45Z",
    "video_url": "https://www.youtube.com/watch?v=AZwfIf-FXLw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "BISSELL",
        "Cordless vacuum",
        "stick vacuum",
        "Best vacuum cleaner",
        "Best vacuum for pet hair",
        "Best Cordless vacuum",
        "Dyson vacuum",
        "Shark vacuum",
        "BISSELL vacuum",
        "Bissell stick vacuum",
        "BISSELL cordless vacuum",
        "vacuum reviews",
        "Bissell vacuum review",
        "vacuum",
        "vacuum cleaner",
        "vacuums",
        "Dyson cordless vacuum",
        "Dyson cordless"
    ],
    "views": 220139,
    "likes": 7210,
    "comments_count": 681,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today is a very exciting day. I don't wanna talk too loud 'cause I don't want my dog to hear. But we are having his fourth adoption day birthday today. His adoption day was actually in August, but I've been traveling a lot, so I'm finally home, and we are gonna have a celebration today. Jenna's upstairs preparing some of our decorations, but first we have to wrap some of his gifts. The main gift is from Bissell. A huge thank you to Bissell for sponsoring this video. This was designed by Bissell's pet parent engineers, and it was designed to be Bissell's best pet hair cleanup system. What's also great about this is Bissell is donating $25 for every purchase of one of these to their Bissell pet foundation. This makes me so happy 'cause we got Matty at a shelter. The first year of his life was so crazy because he had so many allergies and so many problems, but now he's grown up to be a beautiful boy, and now we're celebrating with him. Jenna! - [Jenna] Oh my gosh, what? - We gotta wrap his presents! - [Jenna] Okay. - Before he sees what we're doing. - [Jenna] K, coming. Oh my gosh, this is so exciting. - I know, so we're gonna let him just make the biggest mess that he wants, and we can clean it all up. So the theme of Matt's party is camo. When I went to the party store, I could not believe all the camo things that they had. I saw that they also had ping pong balls. Maddie loves ping pong balls. - What's great about this hat is that it's for dogs, but it's also a dog toy. (squeak) Cool. - There are some flowers that Ed actually got for Matty, so we're gonna wrap those up for him 'cause I didn't have a chance to go to the pet store. I also got him this pinata which we're gonna fill up with food. - He's so gentle, he's actually gonna like the tag that says $19.99 right there. - Honestly, this was so expensive. - That was expensive. - I know. I also got some wrapping paper which, Linus, I know. - You bought new wrapping paper? - I can't find the wrapping paper. - Look under that couch. It's still under the couch. - We got tape, some birthday candles. We're also gonna order pizza 'cause Matty likes pizza crust. - Jenna likes pizza crust. - So I put all these things in my camo purse. - [Jenna] Oh my gosh, what have you done? - [Justine] We've got confetti, we've got all kinds of stuff; Party poppers, we've got army men, we've got whistles. - Oh, he loves taking drinks out of a cup. - He does. I need to Postmates a cake right now. Hold on. - [Jenna] All right, let's wrap this. - [Justine] Icon Pet high powered cordless vacuum is equipped with convenient pet-focused features designed specifically for homes with pets. One of my favorite things is the tangle-free brush roll. It has a removable dirt bin for easy emptying, a smart seal allergen system that helps trap dust and allergens inside the vacuum. There's specialized pet tools to powerfully clean pet hair from all sorts of nooks and crannies. There's three cleaning modes to work on any floor type, there's a swivel steering for easy maneuvering around furniture. It also charges quickly on a wall mount which allows for an organized storage solution. It allows for 50 minutes of cordless cleaning depending on mode and attachments. And it also has convenient options to use as a stick vacuum or a hand vacuum with a motorized turbo brush tool. - [Jenna] Oh my gosh, that's bad. - All right, one gift down. This is a big box. Where's the tissue paper? The gift that he really wants is just the tissue paper. - [Jenna] I know. Really entice him. - Should I put these little flowers in there, too? - Yeah, entice him. We should get started on this. - Yeah, we gotta get decorations. - [Jenna] As gifts. - I got a whistle for us to wear. I got three for all three of us. (whistling) This was 44 cents. Will it go the whole way? - [Jenna] Yes it will. Wait a minute. Here, let's place this nicely down. Don't look at the secrets. It's Gorilla tape. Thick. - Here, let me get some scissors for you. - Thick tape. - Oh my gosh, Matty's party is here. - [Jenna] Matty, don't look honey. - Matty, get outta here! This is a secret, you don't know what's happening. - Do you know how to read? He knows we're setting up for his birthday party. - Do you know it's your party? - [Jenna] Matty, I think there's a squirrel outside. (barking) - Okay, the child is gone. (upbeat music) For Matty. Smells good. Watch this. Here you go, take it. Oh, he's happy. Matty already has a lot of toys so I didn't wanna buy him any more toys so we're basically gonna re-gift some of his previously purchased toys. This is one of his favorites. - [Jenna] I'm going to wrap a ping pong ball. These are like two of his favorite things. I'm not very good at, do I know how to tie it? Not yet, but look, I'll give you a sneak peek. - So we need to have Matty un-box his first gift first so huge thank you again to Bissell for sponsoring this video, we need to give Matty his new Icon Pet Vacuum. Matty, Matty, come here! Matty, Matty, what do we have for you? - [Jenna] What do you have, Matty? - Look at this. It's your gift. It's your present. You wanna unwrap it? - What's this? - Get that, get that. What's in here? Look, Matty, look at this. I wanna get that, oop. He's like, I want the vacuum. This is for you. What's in here? - [Jenna] What's in here, Matty? Wow. There are so many accessories. This is a gift for mommies. - Dude, this is a nice color. You guys, Jenna loves to vacuum. - I'm gonna have fun with this. Oh yes, yes indeed. Look at this, Matty. - Matty, check this out. - [Jenna] Oh wait. Whoa, look at that. Yeah. I'm gonna need my pants to be vacuumed. (vacuum running) It's working very well actually. - What are you doing, Matty? Look it, there's a flashlight! There's LED lights! No way. Oh my gosh, it's gone. All right, well the pizza should be here soon, so should his cake and then we can start celebrating. Do you wanna vacuum a little more? - (mumbles) Okay, I mean it still has battery but I feel like we should charge it up, finish setting up for the party. Are you sitting like a good boy? - Oh, you're such a good boy. - What do you want, you want the vacuum? (upbeat music) - Let's finish setting up. The pizza should be here, and his cake should be here soon. Actually it's a cake for us, but it's okay. (upbeat music) - Hi, thank you. - [Delivery Person] You're welcome. - Thanks. Matty, it's a birthday cake. It's a birthday cake. Oh my God. Oh, surprise! - [Delivery Person] (chuckles) You got one more. - Thank you. Back up, Matty, back up. We've got pizza and we've got cake. This is exciting. It's for your party, Matty. Come see. Come look. (upbeat music) Justine, pizza's here! It's a little small. - This was supposed to be a big pizza. That looks good. - [Jenna] It does look really good. - [Justine] Matty, food's here! - It's a special day. - Hi Matty, look. There you go. Matty, pizza. - Pizza party. - Well hold on, wait a minute. This is not all for you. Go ahead, eat your pizza. - Let me break it up for you 'cause you don't have a lot of teeth. - Matty, want this piece of bread? Here, see what you can do with that. Oh wow. - Sit. Sit. Yum! - Yummy. Cake, cake. Happy adoption day, Matty! Oh my gosh, this is a cake for us, not him unfortunately. Oh yeah, Matty, you're gonna be livin' the good life. (singing) Happy Birthday to Matty. Here, Matty, look, here's your cake. Sit. - [Jenna] Matty, who's a good boy? - Oh no, his flame has flickered out. Okay, I had to stack another candle on top of the candle because we were taking pictures and it took too long, and it melted. Matty, I'm gonna blow your candle out for you. Ready? Yummy, Matty, yummy. Oh gosh, now we open presents. - Oh my gosh. - Matty, we have some presents for you. What's in here? What could ever be possibly be in here? Look at this. This is from Ed. From Ed. That's from Ed. Look what's in here, as if that wasn't enough. What's in there, Matty? Get in. But you gotta get in there. There's stuff in there. Look, Matty! It's all your toys! He's so confused right now. - I know what you want, Matty. This is gonna be a good toy, okay? Sit. Okay, ready, which hand? Good boy! So that's a ping pong ball wrapped in tissue paper, so I have to go supervise everything I just gave him. He's opening it! No, no, no, no! Don't eat it. Look how much fun! Matty, ready? - [Justine] He wants his paper. (ball bouncing) (upbeat music) - Okay first try, ready? Yay! That was fun. - [Justine] Should we let him run around outside now? - I think there's a squirrel out here. - [Justine] Matty! (upbeat music) Oh boy, I think that Matty had a good time. I had a good time. There is bread and pizza crust everywhere. (vacuum running) You need to vacuum underneath this couch. There's fuzzies everywhere. Oh yeah, get it. Oh, I'm gonna get these corners. (vacuum running) What are you guys doin' over here? - We're exhausted from the party. - [Justine] Oh my goodness. - And we're just resting. - Well thank you guys for coming to the party. - Thank you, I guess I could move up to the couch, huh? - And thank you guys so much for watching and coming to Matty's adoption day party. If you guys are looking for a pet, definitely choose adoption over shopping or breeders. Matty has been such a joy in mine and Jenna's life as you guys can tell from all of the things that we post on Instagram. If you wanna follow Matty, go check him out at DJ Mini Mat, you can follow Jenna at jenna E Zehrig, and huge thank you to Bissell for sponsoring this video. If you wanna get more information about the Icon Pet by Bissell, check out iconpetcordless.com and we'll see you guys later, bye. (upbeat music)",
    "transcript_keywords": [
        "Matty",
        "Bissell",
        "party",
        "pet",
        "Bissell pet",
        "good",
        "pizza",
        "cake",
        "vacuum",
        "gosh",
        "Jenna",
        "guys",
        "paper",
        "Icon Pet",
        "birthday",
        "gift",
        "boy",
        "day",
        "Bissell for sponsoring",
        "good boy"
    ],
    "transcript_entity_values": [
        "Matty un-box",
        "a minute",
        "DJ Mini Mat",
        "Matty",
        "Bissell",
        "one",
        "Party",
        "Matty, Matty",
        "25",
        "Justine",
        "The first year",
        "Instagram",
        "a very exciting day",
        "three",
        "Linus",
        "44 cents",
        "Icon Pet Vacuum",
        "Justine]",
        "Jenna] Matty",
        "August",
        "Maddie",
        "Justine] Matty",
        "50 minutes",
        "Bissell pet foundation",
        "Ed",
        "today",
        "two",
        "Postmates",
        "19.99",
        "all three",
        "first",
        "fourth",
        "Matt",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "TIME",
        "FAC",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "GPE",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}