{
    "id": "B-XZ6ustzoI",
    "title": "These Aren't Your Typical Smartwatches",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-07-21T01:28:43Z",
    "video_url": "https://www.youtube.com/watch?v=B-XZ6ustzoI",
    "category": "Science & Technology",
    "tags": [
        "ticwatch pro 4g lte review",
        "ticwatch pro 4g review",
        "garmin marq captain review",
        "garmin marq review",
        "casio protrek f30 review",
        "casio protrek review",
        "wsd-f30",
        "smartwatches",
        "best smartwatch 2019",
        "smartwatch review 2019",
        "mrmobile",
        "michael fisher"
    ],
    "views": 440322,
    "likes": 8580,
    "comments_count": 408,
    "description": "Apple and Samsung dont just dominate the smartphone market in the US; they also make most of the smartwatches I see on a daily basis. So for this video, I wanted to introduce you to three less-common smartwatches. Whether they'll be counted among the best smartwatches of 2019 remains to be seen; but each of these is interesting in its own way. Join me for a look at the Mobvoi TicWatch Pro 4G LTE; the Casio ProTrek WSD-F30; and the Garmin MARQ Captain  and be sure to vote in my Smartwatch 2019 Review Poll [in the Community tab on my Channel page] so you can have a say in which of these gets the full review treatment!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SUMMER SMARTWATCH 2019 ROUNDUP]  MrMobile's Summer Smartwatch 2019 Roundup was produced following several weeks with a TicWatch Pro 4G LTE, Casio ProTrek F30, and Garmin MARQ Captain. The TicWatch and ProTrek are review samples on loan from Mobvoi and Casio, while the Garmin MARQ Captain was purchased by Mobile Nations. In keeping with MrMobiles review policy, no compensation was requested or accepted, and no manufacturer was given editorial input or copy approval rights on this video.    [PRODUCTS IN THIS VIDEO]  TicWatch Pro 4G LTE [Amazon affiliate link]:   Casio ProTrek F30 [Amazon affiliate link]:   Garmin MARQ Captain [Amazon affiliate link]:    [LINKS]  Garmin MARQ Series Detailed Overview Hands-On [DCRainMaker]:   Casio ProTrek WSD-F30 Review [Wareable]:   TicWatch 4G LTE Review [Android Central]:    [SOCIALIZE]        [MUSIC]  Burning Man\" by Zac Nelson, available at Premium Beat:   Neons by Hartley, available at Premium Beat:   \"Fashionista\" by Olive Musique, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #ticwatchpro4glte #casioprotrek #garminmarq #ticwatchpro #protrek #marqcaptain #smartwatches #wearables",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1JF",
        "http://mrmobile.tech/1JG",
        "http://mrmobile.tech/1JH",
        "https://www.dcrainmaker.com/2019/03/garmin-marq-series-detailed-overview-hands-on.html#",
        "https://www.wareable.com/smartwatches/casio-protrek-wsd-f30-review-6462",
        "https://www.androidcentral.com/mobvoi-ticwatch-pro-4g-review",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.premiumbeat.com/royalty-free-tracks/burning-man",
        "https://www.premiumbeat.com/royalty-free-tracks/neons",
        "https://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://www.mobilenations.com/external..."
    ],
    "transcript": "- [Narrator] Apple and Samsung don't just dominate the smartphone market in the U.S. In my home city of Boston, these two companies also rent real estate on most of the wrists I see, which is fine. They're good products. But for this video I wanted to introduce you to three less common smartwatches you might not have seen before, all of which shine brightest in the summertime. (upbeat music) Okay, if I start with the most expensive one of these, you're gonna click right away and unsubscribe. That's the opposite of what I want. So, let's kick off with the cheapest instead, the latest from Beijing-based Mobvoi. I reviewed this company's TicWatch Pro last year, and the new watch bears the same name along with a suffix that tells you all you need to know about what's different. Yeah, Mobvoi is betting that an always-on 4G connection is what people are missing in their smartwatches. And to that end, it's got a speaker and mic for phone calls, and a built-in LTE radio to carry those calls and everything else. Unfortunately, Mobvoi's launch partner, Verizon, won't activate this thing until August. So we're essentially stuck with a warmed-over TicWatch Pro. While it has lost some weight, I still find it chunky and uninspired. The only hint of flair coming from the knurled texture on the steel bezel and pushers. That's still not a rotating side button by the way, which has a big effect on how easy it is or isn't to use Google's Wear OS. Still, doubling the RAM over last year's model was a good call because the software here glides along nicely, once you get past the initial setup. There's also additional durability alongside the IP68 dust and water resistance, and this display should be on every smartwatch, not just the circular AMOLED, though that is beautiful, but the FSTN fitted invisibly above that. Where most smartwatch displays have to ramp up the battery-killing brightness to overcome direct sunlight, this LCD gets more intense the more sun you shine on it, kinda like the bad guy from Superman IV. Better still, in the words of Android Central's Ara Wagoner, it sips battery like a fine cognac. I was able to get about two days per charge, but that's on pre-release software. I won't be able to confirm until the 4G issue gets sorted out. And for the same reason, I can't yet give this watch a proper review. If you already know you want one of these, Mobvoi is taking $20 off the eventual retail price of $299 until August 10th. And if you want to see a full review, stay tuned to the end. I'll tell you how to vote for this one. Number two on the countdown is a blast from the much more distant past. See when I was a kid I used to think my dad's Casio sailing wrist watch was the beefiest watch I would ever see. But it turns out, 1989 and 2019 have very different ideas of big when it comes to watches. This is the Casio PRO TREK F30, and if it's ringing a vague bell, that's because I've been covering this line since it launched in 2016. Casio was actually the first to bring that dual-layer display to wearables, so the F30 benefits from the same battery-saving and visibility boon that the TicWatch Pro does. With this generation, Casio also took the opportunity to sport up the primary watch face with a sharper OLED display. And, well it's still a bit of tea saucer on your wrist, but the F30 is actually smaller than either of its forerunners. It's also more stylish, if you ask me, and if you don't agree, well this is the first of the Pro Trek F-series that let you do something about that by changing the watch band. At its core, this is a watch made for adventurers, and it packs a lot of custom software from Casio and third parties to help with that. What's wrong with it? Well, it's just kind of an iterative sequel to the last two and for all the excellent features it brings over, like dust and water resistance and 810G durability, it also brings old frustrations like lack of NFC, lack of a rotating crown, lack of a heart rate sensor and a magnetic charging cable that's easier to accidentally jostle free than something like MobVoi's cradle. Fortunately, battery life is a solid three days, you just have to do what I did and disable raise to wake. Price, $549, higher than the TicWatch, yes, but way lower than this next one. Garmin is still known mainly for it's GPS devices, but over the past few years, it's become a bigger name in watches with it's fitness-focused fore-runner, Vivoactive and Fenix lines. And with this one, the company is moving into a category known as tool watches. Yeah, I had to look that one up. It just means a watch designed to serve a particular, specialized purpose. Accordingly, there are five variants of MARQ. One each for pilots, drivers, athletes, hikers, and one for sailors. Because I've spent almost as much time on the water as I have on land and because I occasionally like people to call me captain, it's the latter I decided to buy for this video. This is the MARQ Captain, and it kind of feels like an artifact from a parallel universe where the modern smartphone was never invented. There's no Wear OS, nor even a touch screen under that sapphire crystal. Instead, you control the Garmin software with the five pushers studding the titanium casing. For a tool watch, this makes sense. On a boat with wet fingers, the last thing you want is to be fiddling with a tiny touch screen. Instead, these clicky buttons and the old-styled digital beeps, leave no doubt when you've executed a function. In fact, it all reminds me of another nautically-focused watch I wore back in high school, the Citizen Navisail. Showing off all the features of the MARQ Captain would take a full video. In short, you've got everything you expect from a typical smartwatch. From notifications delivered over wifi or Bluetooth to mobile payments to locally stored music. But where a typical watch maxes out at four gigs, the Captain turns it up to 32. Extra space to store the things that matter to Garmin buyers on the whole. So, you know, GPS running maps and fitness apps. And sailors in particular, nautical charts and tide tables. It also has apps for interfacing with your boat's Garmin navigation equipment. The transflective memory and pixel display is visible in all lighting conditions and the battery life is the best in this video. On my first charge, I got week of use even though I used it to track my sleep every night. And the charger is clever too. It's a clamp, not likely to be shaken loose by anything short of a rogue wave. If it's not obvious, I like this thing. I like how weighty it is on my wrist, and I love the look of its jacquard weave strap. It's obvious that Garmin is going for a status symbol here. If I had the money for a boat that I could fill with Garmin gear, I'd probably celebrate its launch by dropping the $1850 that this watch costs. But even if I had yacht money, folks, I would have reservations about paying a bill that high for a screen resolution and saturation this low. A handy Captain becomes hilarious when you plunk it down next to a watch that costs over $1500 less, and its screen gets spanked. I do think a watch could be worth this much if it were a mechanical masterpiece suitable for uses in a heirloom or something, but in the digital world, where things become so obsolete so quickly, I'm just not convinced luxury watches over $1000 are justified. Judging from the comments from actual wrist watch enthusiasts on this video from the excellent \"A Blog to Watch,\" I'm not alone in that. My friends, I wanna review all of these, but my schedule is tight, so let's bring you into the decision process. Hit up the poll on my YouTube channel page to vote on which of these watches you'd most like to see me review, if you had to pick just one. Then, be sure you're subscribed to the MrMobile on YouTube, so you don't miss that review when it goes live. This video made possible by review samples from Casio and Mobvoi and a retail Garmin MARQ Captain purchased by Mobile Nations. No manufacturer was given copy approval and no compensation was requested or provided for being featured in this video. Until next time, thanks for watching, happy sailing, and stay mobile, my friends.",
    "transcript_keywords": [
        "Apple and Samsung",
        "watch",
        "Garmin MARQ Captain",
        "MARQ Captain",
        "Garmin",
        "Mobvoi",
        "Casio",
        "captain",
        "TicWatch Pro",
        "Casio PRO TREK",
        "video",
        "Pro",
        "wrist watch",
        "Samsung",
        "review",
        "MARQ",
        "PRO TREK",
        "Casio PRO",
        "retail Garmin MARQ",
        "watches"
    ],
    "transcript_entity_values": [
        "third",
        "Garmin",
        "Mobvoi",
        "LTE",
        "last year's",
        "Casio",
        "Superman IV",
        "1850",
        "20",
        "about two days",
        "Verizon",
        "810",
        "Garmin MARQ Captain",
        "Samsung",
        "Android Central's",
        "Casio",
        "Mobile Nations",
        "over $1500",
        "549",
        "299",
        "FSTN",
        "2016",
        "over $1000",
        "last year",
        "A Blog to Watch",
        "the TicWatch Pro",
        "YouTube",
        "four",
        "three",
        "MobVoi",
        "1989",
        "Boston",
        "RAM",
        "first",
        "the past few years",
        "One",
        "five",
        "Google",
        "U.S.",
        "two",
        "4",
        "August",
        "Beijing",
        "MARQ",
        "TicWatch Pro",
        "F30",
        "2019",
        "Ara Wagoner",
        "32",
        "Number two",
        "Vivoactive",
        "every night",
        "Wear OS",
        "MrMobile",
        "NFC",
        "three days",
        "LCD",
        "TicWatch",
        "August 10th"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "LAW",
        "DATE",
        "MONEY",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE"
    ]
}