{
    "id": "B0sIiGMNR_Q",
    "title": "NEW iPad Pro AND MacBook Air",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-03-19T18:29:52Z",
    "video_url": "https://www.youtube.com/watch?v=B0sIiGMNR_Q",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iPad pro"
    ],
    "views": 725630,
    "likes": 21963,
    "comments_count": 1480,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- I kept getting tweets from you guys on Twitter, \"Just seeing where's your video \"talking about the new iPad Pro \"and the new MacBook Air.\" I have just been so conflicted on what videos to make recently and I talked to a lot of you guys on Twitter and you said you want us to keep continuing to make content so here I am making a video talking about the new iPad and it's really hard to get excited about tech when people's lives are being completely just destroyed. And you guys keep telling us as creators, to keep creating for entertainment value. I've made some videos talking about my thoughts and my feelings so I don't wanna keep bringing it up. So let's just jump into talking about the new iPad Pro and the new MacBook Air and they even updated the Mac Mini. They've got some new Apple watchbands out. I'd say out of everything, I'm most excited about the new iPad Pro and the new keyboard that they came out with. So here it is. This is the new iPad Pro. And first of all, looking at this photo I love this because this is the new keyboard. Also has a Trackpad. So you can also see right here, this is a USBC pass through. So this will also charge your iPad while it's docked. Instead of having to plug it into your iPad and have a crazy cable hanging out, this also allows for the USBC port to be open on the iPad so you can transfer photos or basically whatever else you might need to plug into that. Whether you have an extra old camera. Maybe you have a thermal camera plugged in, if you guys saw my video that I made about thermal imaging on your iPhone, it's pretty awesome. You guys should definitely check it out. 'Cause it's great 'cause you can have the freedom of moving your iPad around to 130 degrees. So it has an 8-core GPU, 8-core CPU. It also has an enhanced thermal design. This is the highest performance on an iPad ever, obviously you would have to imagine so because they're not gonna make an iPad that's not as good as the last one. The graphics are actually 2.6 times faster than the previous gen. They've also updated the camera so now there's a wide angle camera on the iPad. And it also has LiDAR support. LiDAR stands for light detection and ranging. So this sensor is measuring the amount of time that it takes for light to reflect off of an object. Not only is this gonna be huge for playing augmented reality games but being able to capture a 3-D image of a space. I'm sure you guys have all seen the IKEA app where you can just drop in furniture. That's gonna be, basically the new normal of being able to shop furniture. You 3-D scan your environment, see if said thing looks good in said environment, click purchase and that's it. It arrives at your house. It's also gonna be really cool for gaming so I can't wait to see some more games take advantage of AR. It always kinda crazy trying to play AR games with the iPad because it is kind of a large device. So when you're just running around getting crazy, make sure you have a good grip on that thing. 'Cause you don't wanna be dropping it and you guys know me, I am, I can't be trusted. It's crazy that they're able to bring this technology into an iPad, something so small. This is stuff that they've been using at NASA. Apple even says on the website, it's being used for the next Mars landing. Now I've got LiDAR on my iPad, I'm ready to go to space. Honestly, I'm ready to go to space. So sign me up. I don't know, I mean what's it like up there? It can't be any worse than what's happening here. This is able to measure reflected light, both indoors and outdoors up to five meters away. I'm definitely excited to check this out. As soon as I get my hands on one of these and then I'm gonna work on booking the first flight on that Mars mission. (laughs) Who's gonna say no to my application? \"Oh, I just, oh you have LiDAR? \"Okay, cool, come on. \"Come on aboard, have a seat.\" As far as the processor, it has an A12Z Bionic chip and I've been editing a lot on my iPhone. I've been editing way more than I ever have before. I've been using LumaFusion, it's an iOS editing app. It works on your iPhone and on your iPad, I'm very excited to use this on the iPad. I've only used it very briefly since as many of you know I'm obsessed with TikTok. And I know a lot of you guys watched that video and you were really concerned about me. That video was honestly not too far from the truth. It obviously was a little bit dramatic. So I do plan on doing some more editing on this now that I've been using that app a lot more. I can't wait to try it on the iPad and if you guys are looking to start editing on mobile, check out LumaFusion. It is a paid app but I cannot say enough great things about it. It's got the new Magic keyboard. This thing looks really great. So I guess that it does have USBC port for pass through charging and since it does have Trackpad support, you can use a Magic mouse. You can also use one of the Magic track. Do they call them the Magic Trackpads? They call it the Magic, no, what is it? The regular Trackpad that comes with the iMac. Is it called a Magic Trackpad? Yeah, okay, it is called the Magic Trackpad. Well, what do you know. And so here's a little demonstration of what the cursor looks like when you use the Trackpad. James Rath actually brought this to my attention, this was something that was huge in the accessibility community. So it's really cool to sort of see where that started and now it's a mainstream feature on the iPad for the Trackpad. So it looks like it weighs over a pound, all day batter life, connectivity. They do obviously have a WiFi and an LTE version. (gasps) I can use AR to see the new iPad. Okay, why didn't you say so? There it is! Look how good that's gonna look. Can you, that looks big! Wow, okay, okay. For a few seconds, convinced myself that the iPad was actually here. So there it is. That's what it would look like sitting at my desk. Let's get a real good close up look at this. Look at that keyboard. Ooh, that looks nice, oh this is very close to me. Can we see, so there's the, so the charging port is over here. Let's get up there real close. See if we can see it. There it is. This is weird, this is so crazy. The iPad is right here, I'm making it smaller. (laughs) Oh, little, look at the little baby. Okay, I'm enjoying this way too much. So it comes in two models. There's the 11-inch which starts at 799 and the 12.9-inch which starts at 999. They also announced an upgrade to the MacBook Airs. I think one of the most exciting things, I think for a lot of people that didn't like the previous gen keyboards, is they do have the new keyboard that is the same keyboard as they put on the 16-inch MacBook Pros. Which I still can't believe there's a 16-inch MacBook Pro. I backed my old MacBook the other day just to get a bunch of files off of it. I was like (gasps), \"Wow!\" It's significantly smaller. I couldn't believe the difference after using this one for the past several months. So here's the new MacBook Air. Looks very much like the previous version. Has a starting price at 999. They also have an educational discount, obviously on almost all things Apple. So if you are a student, definitely look into that. It's got the retina display, a new Magic Keyboard, of course, touch ID. Twice the performance, faster graphics and also double the storage capacity. Up to a 4-core, Intel Core, i7 processor. You can expand the storage up to two terabytes. The graphics performance is up to 80% faster which is a pretty significant update especially if you're doing video. A lot of people complained so much about the arrow keys so they did change that back to the previous version. And the same arrow keys as the new 16-inch MacBook Pro. I really did get use to this keyboard. I did not at all mind the previous gen butterfly keyboard mechanic. I actually really liked it. So switching over to this again, it took a little getting use to but now that I'm use to it, I don't even remember what it was like back in the butterfly keyboard days. They also increased the size of the Trackpad, which is really nice because being so use to having the MacBook Pro, that larger Trackpad is so convenient. It's also got touch ID and it has the T2 security chip. I love having touch ID on my computer. I'm really looking forward to the day that they do finally integrate face ID into the front facing cameras, which I feel like is something that I'm surprised they actually haven't done yet. I wonder what the reason is. Price, security, I'm not sure. I mean they already have the technology, so I think it's just a matter of time before that is also integrated into the computer. But I love having touch ID on my laptop. I love it so much. They also announced some new Apple watch bands and some new phone cases. I love when they do the spring update of colors. I love this watch band so much. I've been rocking this one for a while. It's the Nike sports pink one. And I guess last but not least, they also did an update to the Mac Mini. Mac Mini is just, it's such a cute machine. And I think for a lot of people, if you already have a monitor and you want a very small little computer, this is, it's great. Now has up to 60% faster Intel and integrated graphics. Five times faster system performance. You can upgrade it to a 6-core i5 or i7 processor. And of course, storage is also always a struggle, I feel like, on machines, especially solid state. So this one you can expand up to two terabytes, with up to four times faster read speeds. I look forward to getting a chance to check out some of these things and doing some reviews for you guys. Let me know if there's any other thing that you would like to know about them and when I get it, hopefully I can test it out. Thank you guys so much for watching. I know this is a really crazy time to be talking about tech but I think one of the most important things, again, I will keep reiterating this, is be kind. Ask your friends how they're doing. Ask them if they need anything. Ask them if their friends or family needs anything. And most importantly, keep yourself healthy, wash your hands, stay inside as much as possible, practice social distancing. And I would also hear in the comments what you guys are doing to occupy your time. And if you're watching any new shows. Oh my God, did anybody watch HBO, the West World premier? (gasps) I think it might be my most favorite thing that I've ever seen ever, absolutely ever. The fact that they, well, I don't wanna spoil it. I'm not gonna say anything. I'm not gonna say anything at all. No, I'm done, I'm done. It was so good. If you haven't watched it, you guys better go watch two seasons, catch up. Because season three premier, oh my God. Aaron Paul was just, everything about it, I'm done. I'm done, bye. (r&b music)",
    "transcript_keywords": [
        "iPad",
        "iPad Pro",
        "guys",
        "Trackpad",
        "Magic",
        "Magic Trackpad",
        "Pro",
        "keyboard",
        "MacBook Pro",
        "MacBook",
        "Magic keyboard",
        "MacBook Air",
        "Twitter",
        "lot",
        "talking",
        "video",
        "guys on Twitter",
        "crazy",
        "good",
        "love"
    ],
    "transcript_entity_values": [
        "all day",
        "GPU",
        "Intel",
        "Nike",
        "MacBook",
        "2.6",
        "iPad",
        "one",
        "iMac",
        "five meters",
        "A12Z Bionic",
        "the Magic Trackpad",
        "James Rath",
        "Five",
        "11-inch",
        "Mac Mini",
        "West World",
        "Apple",
        "799",
        "the past several months",
        "CPU",
        "LumaFusion",
        "LTE",
        "up to two terabytes",
        "iPad Pro",
        "iPhone",
        "130 degrees",
        "USBC",
        "NASA",
        "4",
        "MacBook Pros",
        "Magic Keyboard",
        "three",
        "the day",
        "the butterfly keyboard days",
        "up to",
        "Twitter",
        "the Mac Mini",
        "Intel Core",
        "a few seconds",
        "8",
        "Mars",
        "the MacBook Pro",
        "Aaron Paul",
        "a Magic Trackpad",
        "999",
        "3",
        "6",
        "two seasons",
        "IKEA",
        "up to 60%",
        "two",
        "MacBook Air",
        "Trackpad",
        "first",
        "Magic",
        "T2",
        "up to 80%",
        "HBO",
        "MacBook Pro",
        "up to four",
        "the MacBook Airs",
        "16-inch",
        "TikTok",
        "12.9-inch"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "LOC",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "LOC",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY"
    ]
}