{
    "id": "B1THpjzy-gs",
    "title": "USB-C AirPods Pro 2 Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-09-18T13:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=B1THpjzy-gs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 444374,
    "likes": 13428,
    "comments_count": 692,
    "description": "New AirPods Pro 2 with USB-C case!  PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR"
    ],
    "transcript": "- Hey, it's Justine, and we are kicking off new Apple tech season with the brand new, sort of brand new, AirPods Pro 2 USB-C. (light music) Now there are some things that are new but essentially the biggest upgrade is the fact that we are able to charge these with USB-C, which would make sense because now all of the iPhones are USB-C compatible, so we gotta start making all of the accessories USB-C compatible. So here it is. Step one, let's unbox 'em and check 'em out. So if you just look at the case, it looks exactly like the previous version, but look at that port. Have you seen anything more beautiful? Also in the box, we have different sized ear tips, and these ear tips have pretty much changed my life because previous to this, I was not able to use any of the AirPods Pro because they always fell out. But now that they introduced this extra small ear tip, they work perfectly with my ear type. A USB-C cable. What a treat. I'm gonna put the new ear tips on right now, so we'll just pop these off of the tray, pop off the old ones. There they are, good as new. Ready for my small ear holes. So like I said, the AirPods Pro 2 are my favorite. Now that they work with my ears, I have been using them nonstop since I got them. One thing I will say is they are actually pretty durable. I have put them through some things. I use them almost every single day and they even went through a full wash cycle, and they ended up drying out and working perfectly fine, and I still use them all the time. So now when it comes to the brand new AirPods Pro 2 with USB-C charging case, there is only two new differences and the main one is quite obvious. There's a new USB-C charging port. But this port is kind of exciting because this will allow you to charge USB-C to USB-C on your new iPhone 15. And the other new thing is lossless audio. We're gonna have the ability to use this with Vision Pro, which will be coming out at some point and I cannot wait to try that. So obviously, if you are gonna be getting a Vision Pro, then making the upgrade to the USB-C case might be for you so you'll be able to fully experience that latency free lossless audio with your Vision Pro. This is kind of big news that Apple has unlocked lossless audio in their ecosystem because you may see this elsewhere with the H2 chip. Right now, it is only gonna be with the Vision Pro but who knows what the future holds. Now let's take a look at some of the features that are new in iOS 17 with the new AirPods Pro. So first of all, let's get these all synced up. I love the syncing process. It's so easy, seamless. There we go, time to connect. Here's the new Adaptive Audio mode. So we have Adaptive Audio, we can do Personalized Volume, and Conversational Awareness. We're gonna turn on Adaptive mode, turn on Personalized Volume. And the Conversation Awareness, this is really pretty impressive. This lowers the media when you start speaking. So if you're having a conversation and you're listening to music, the audio in your AirPods will automatically start lowering while you're having a conversation. And then when the conversation's over, the volume goes back up. Mute and unmute. So I'm kind of excited about this. You're able to mute and unmute yourself on a call. There are so many times that I have my phone in my pocket when I'm on calls. It's usually like a Zoom call, so I'm not able to like mute or unmute myself. So if I have my phone in my hand, it's a whole thing, and you know the struggle if you've done any conference calls in your lifetime. Press once on AirPods Pro to mute or unmute your microphone when on a call. To end a call, you can press twice. Now to change some of these settings, You can go directly into the AirPods in the Control Center. So you will have your noise control transparency. So you can have transparency, adaptive and noise cancellation. So I'm gonna set mine to adaptive. This is really cool because it will still block out sounds but it'll leave in important sounds like car horns or bike bells or somebody yelling at you to get your attention. You can also switch the different transparency modes by pressing and holding. So you can turn on active noise cancellation, but every time I start talking, it automatically turns it down. If you do wanna sing along to a song that's in your AirPods and you don't want the volume to lower you will have to manually go in and turn off the conversational awareness since it will think that you're having a conversation. So I'm gonna test out the conversation awareness. So I'm gonna start playing some music and then I'm gonna start talking and see what happens. Okay, it's pretty loud. Volume went down instantly right there, already dropped down. It's so cool. So like I can, so say something to me. Hi. - [Videographer] Hey, how's it going? - So I hear you. Okay, now stop talking. Yeah, I can. Okay, now. - [Videographer] Hey Justine, I'm over here. Can you hear me? I'm noticing you and I wanna get- - Are you saying something? So yeah, so I have to initiate. So I see, oh, excuse me sir, are you saying something to me? Now my volume is lower, so now I can hear you. - [Videographer] Whoa. - Right? Sick. Oh, I'm so excited about these new updates. This is really cool. Again, this isn't just on the USB-C ones, this is on the AirPods Pro lineup. Oh my gosh, my music just turned up. Like this is so great. Like I could wear these all day now. Like I don't have to take them out. 'Cause as soon as I say something the volume turns down. Normally you do this little thing, like, hold on one second. What? What did you say? No, now it's just I start talking and it, oh, this is great. I love this. I'm so excited. Anyway, lemme show you the differences between the USB-C and the Lightning case. This is USB-C. This is Lightning. They look pretty much identical except the fact that this one is brand new and super shiny and there's no scuffs or scratches. Something else that I didn't even think that I would be as obsessed with as I am is the little lanyard holes that they put in. This came in the last version in the AirPods Pro 2. And of course it's here in, I'm calling it 2.5, 'cause that's what it feels like. There's still an upgrade. It's still 2, but it's 2.5. So check that out. We can put a little lanyard in and there you go. You do have to be careful though. If you swing these around and get really rowdy, the top of this will come out and your AirPods will go flying. Not speaking from any type of experience or anything. So hyped about these. I also got this for my iPhone which I'm kinda excited about. Anker has this whole line of new accessories for USB-C charging. Look at that. I can charge my AirPods in it now too because it's USB-C. What do you guys think of the new USB-C AirPods? Are you excited about this? Are you hyped about USB-C? I would love to hear it. Leave me some comments below. Listen, if you're not already subscribed I definitely recommend you doing so because there will be new Apple videos to come. I promise. And if you wanna watch more videos, I'll have some here on the end screen for you to check out and I look forward to seeing you in the next one. Bye.",
    "transcript_keywords": [
        "AirPods Pro",
        "USBC",
        "Pro",
        "Vision Pro",
        "AirPods",
        "Apple tech season",
        "USBC compatible",
        "USBC charging",
        "Volume",
        "audio",
        "ear",
        "start",
        "Conversation",
        "Adaptive",
        "Vision",
        "tech season",
        "USBC AirPods",
        "ear tips",
        "Adaptive Audio",
        "accessories USBC compatible"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "AirPods",
        "USB-C",
        "AirPods Pro",
        "2",
        "iPhone 15",
        "Anker",
        "Apple",
        "Justine",
        "Adaptive",
        "only two",
        "H2",
        "the Control Center",
        "iPhone",
        "the AirPods Pro 2",
        "one second",
        "Mute",
        "iOS 17",
        "Vision Pro",
        "AirPods Pro 2",
        "iPhones",
        "2.5",
        "almost every single day",
        "Adaptive Audio",
        "Lightning",
        "Personalized Volume",
        "Conversational Awareness",
        "Personalized Volume",
        "the Conversation Awareness",
        "first",
        "the AirPods Pro",
        "the AirPods Pro 2",
        "USB",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "EVENT",
        "TIME",
        "PERSON",
        "EVENT",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ]
}