{
    "id": "b4al8m0_sdM",
    "title": "Pink Camo Xbox!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-09-23T21:05:12Z",
    "video_url": "https://www.youtube.com/watch?v=b4al8m0_sdM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "xbox",
        "custom xbox",
        "pink camo xbox"
    ],
    "views": 256958,
    "likes": 11362,
    "comments_count": 1164,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? It's Justine. And today I am so excited! Before we get started, this video is for charity. What is inside this Xbox is something that I created with my own two hands. I'm so hyped to see what it looks like. Xbox came to me and asked if I wanted to design an Xbox for charity. And they said hey we can design it for you whatever. Of course I was like, no I wanna do this! I wanna do this myself. I have a background in graphic design so if you guys don't know that, I do. I use to, basically that was my job. I was a graphic designer, in addition to doing video production, and making websites and all of the things that come along with that. But, one of the most satisfying things as a designer or a creator is being able to design something and then see it put into production. So inside here is the Xbox that I made with my own two designing fingers. I went in to Illustrator, I found myself some sort of generic camo background, traced it, and then placed each piece of camo on this Xbox where you'll see it. So I guess if it looks good, then it's my fault. If it looks bad, it's also my fault. But I think it's gonna look good. I'll put a link in the description if you guys want more information on the charity. There's a bunch of other Xboxes too, so if this isn't quite your style. Which I don't know why it wouldn't be because I know it's gonna be fantastic. I think The Rock has one. Pulse Malone has one. So go check those out. Donate if you can. I know that probably the donations may end up getting a little but higher than something that you would ever want to pay for an Xbox. If that's the case and you're a company, get your company to sponsor and get this Xbox 'cause I would love to raise as much money as possible. And a side note, if it is a company that ends up winning this, and just to cover myself here, if it is a company that I like, something that I promote, and it's nothing vulgar or inappropriate, I will make a separate video talking about this whole charity and maybe doing some game play and giving them a shout out. With that being said, I'm excited to get started and unbox this. This is stressful. It's seeing what you've done and made. Oh! I just spotted it! I spotted it! Here it is. Oh man! Let's get everything out. I also designed the controller too to match. So, let's look at the controller first. Oh my goodness! Ah! Can you even believe how freakin' cool this is? I put my little ij there. I basically designed an Xbox that I have always wanted. Like this is exactly what I pictured if I were to ever make an Xbox for myself. Like this is what I would want. So I'm hoping that somebody else out there wants this as well. Let's see what this looks like. My eye's twitching because I'm so excited. Do you see what I see. Guys, this is it. This is my Xbox that I made with my very own two hands and a computer and a mouse and Illustrator. It's so perfect! The one on the auction sight has a signature on it. This one does not. They made two of them. So there's basically only two of these in existence right now, this one in my hands and the one that is on the charity site. You guys wanna check it out, feel free to do so. Check out my console. Check out everyone else's. I just wanted to make this video super quick because this is something that I love. I love being able to help and give back and this opportunity was just really, really awesome. A huge thank you to Xbox for giving me this opportunity and also partnering with Console For Kids for making this whole entire thing possible. I think it's really great to see companies and brands and people just get together and try to raise money for good causes. So, this is it! This is the camo Xbox that I've always wanted. Again, the link in the description if you wanna check it out. And that's it. What do you guys think? Do you like it? 'Cause I love it. (bright music)",
    "transcript_keywords": [
        "Xbox",
        "guys",
        "charity",
        "check",
        "design",
        "video",
        "company",
        "made",
        "wanted",
        "love",
        "camo Xbox",
        "good",
        "put",
        "excited",
        "Justine",
        "hands",
        "camo",
        "make",
        "basically",
        "Illustrator"
    ],
    "transcript_entity_values": [
        "only two",
        "one",
        "first",
        "Xbox",
        "Pulse Malone",
        "today",
        "Justine",
        "two",
        "Xboxes"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "FAC"
    ]
}