{
    "id": "b4S5ruT_xX4",
    "title": "This doesn't look right.... but it's AWESOME! - LG DualUp Ergo Monitor",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-03-18T17:59:46Z",
    "video_url": "https://www.youtube.com/watch?v=b4S5ruT_xX4",
    "category": "Science & Technology",
    "tags": [
        "LG",
        "Monitor",
        "DualUp",
        "16:18",
        "Vertical",
        "Vertical Video",
        "Vertical monitor",
        "I have a love and hate relationship with this monitor",
        "Vertical monitors are here",
        "Who else is ready to get a vertical monitor",
        "Productivity monitor",
        "Gaming",
        "Performance",
        "1440p",
        "two 1440p monitors",
        "Apple",
        "Mac",
        "28MQ780"
    ],
    "views": 1090385,
    "likes": 30432,
    "comments_count": 2280,
    "description": "Purchase a Seasonic FOCUS Power Supply at   LG's latest monitor, the DualUp, is exciting. It has an aspect ratio of 16:18 or 8:9, which is 2560 x 2880, effectively two 1440p monitors stacked on top of each other. So it's basically a vertical monitor, which might make you cringe at first, but after using it, we love it!  The LG DualUp 28MQ780 Monitor is expected to release in mid May. Link coming soon!  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - It doesn't feel or look right, but... 0:48 - Unboxing and assembly 1:58 - I/O ports 2:11 - Ergo stand 2:51 - Cable management and extension 4:06 - Sponsor - Seasonic! 4:33 - Panel issue? 5:03 - Monitor display setup and specs 5:33 - Productivity use perspective (Apple and PC) 7:24 - Display impressions 8:09 - Gaming vertically impressions 9:00 - Final thoughts",
    "description_links": [
        "https://geni.us/F7w6w4g",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- It doesn't look right. It doesn't feel right. I feel like I've got all this screen space missing. There's been a lot of new monitor trends. The LG Ergo Dual was kind of fun. We've got the QD-OLED stuff coming out. We've got mini LED finally hitting its stride. But I'm a sucker for weird resolutions. I don't want your 32x9 ultra wide. I want this thing, which is, I don't even know. It's 16x18. So it's the LG Dual Up Monitor Ergo. It's using a similar stand as the LG Ergo Dual except this time there's only one display, but it's two 1440P monitors basically stacked together. But it's a single panel. So it's an editor's dream. So this is a huge box, where we got cables. This is an Allen key or also a Philips on one end, power brick stuff. - [Jono] That's a big power brick. - This is, yeah, this is actually pretty beefy. Here it is. Okay. Yeah this thing is heavy. Oh my God here it is. What is this thing? - [Jono] It's the Twitter monitor. - The Twitter monitor. Yeah no for real though this is great for like any kind of doom scrolling. Like if you just sit in your bed or not even in your bed but if you sit in your chair like I do near the end of the night where you're kinda like this and you're just scrolling ever like forever I'm right handed, but I'm kind of busy. We're not going wide anymore. We're going tall. This guy is on like a, you can move this up and down and then you can fine tune here on the rubber with this. So it's probably somewhere around there. So this thing can actually, it can actually fit quite a few desks. Anyway, the real star of the show is this amazing panel. I still can't get over this thing. I love it. Yeah, honestly, maybe I'll add a third monitor to my desk and it'll be this guy. It just clips in the same way, most, not all, but a lot of monitors do with the two clips on the top and we've got a USB upstream. We've got USB-A, we've got DP in, USB-B, two HDMI ports, DC and headphones. So pretty standard for most monitors these days. So this thing's pretty great, on the stand you've got a lot of movement, ton of rotation. It can go like all the way over here if you want and then you can kind of center it back into your desk. And then on top of that there's just a ton of play like we can tilt and we can pan and we can swivel or the opposite sorry. Oh. Can you just - [Andy] wow, rotate it? Oh my God. - [Andy] wow, wow. - So if you really, (laughs) if you really don't wanna go tall but you still want a weird aspect ratio, you can do it. You can go wide. - [Jono] 18 by 16, - 18 by 16, (laughs) We're gonna go with the way LG intended. So I'm gonna use these new LTT cable ties. We made new packaging look super eco-friendly. These are really nice. I love the color. And the foam feels better. Like it feels softer, but like still sturdy. I'm gonna plug this in. I'm gonna cable manage ever so slightly with our LTT cable tie. So this is a really nice feature. So for example, Andy, get this. If you look down, so look my power brick is just hanging here, right? And that's not good. So what they've got is they've got these barrel plug extensions. So you can actually go out of here, into here. - [Andy] Wow. Into here and then once this is fed through properly, look at that. It's flat now with all this extra slack I've had way too many power bars. Not necessarily resting the way they're supposed to simply because I don't have enough length. And then this goes on top. It's a little finicky sometimes, but it's not too bad. Yeah. - [Jono] That looks so good. - It does, hey, yeah, I know. Oh my God. It has speakers and it makes a cool chime when you plug it in. I didn't even turn it on it, I just plugged it in. This thing's great. Okay. Before we do actually power it on and take a look at it though. We're gonna give you a quick word from our sponsor Seasonic, Seasonic's focus plus seven 50 WA gold power supply is a good choice for mid range systems at a great price. It features an 80 plus gold ratings. So you get 90% power efficiency at 50% system load. It's fully modular layer and features hybrid fan management to control overall fan noise and fluid dynamic fan bearings. It comes with a 10 year warranty. That's how confident Seasonic is. Learn more about them@seasonic.com or through links will have below. Okay. So we've noticed something kind of weird and it's definitely not our cable and it's definitely not our computer, our monitors, an engineering sample and stuff can happen in shipping. And even non-engineering samples, you always get some rate of RMAs. There's a weird like pixel flickering or something going along the entire panel. We don't know what's causing it. It's gotta be the panel because it's not any of our hardware, but it's pretty minor. And it's hard to see on camera. So we're gonna keep going. The rest of the panel works just fine. Got our LG SDQHD. It's running at 2560 by 2880, 60 Hertz. But I think it can do more than that. Oh, maybe it is only 60, it's a work panel. It's not for gaming. Do you like it Jonathan? Is it great? - I didn't bring my Mac, there's USB C port. Let me go grab my MacBook. - Yeah - So in terms of creating stuff. It's not a bad panel. It's got HDR 10 which is mediocre. Hits about 300 nits of brightness. It can cover like 98 or 99% of the DCIP three color gamut. Nothing else is super-- - Oh there's so much more super stuff we need to look into. - Okay so I know we literally just said there's some weird flickering or something going on. Maybe the panel just had to warm up. I don't know, it stopped doing it. Jono hit the monitor a few times, - because it's not a high DPI screen. This is for Mac users now. You can't run it on high DPI. So you can only run it if you want native scaling to look decent. Oh, it's HDR. Look at the space between that. - Yeah. Look at all that. - [Andy] It looks look an iPad. - Yeah, it's cool. This is actually, I wouldn't want this for music because I want to go wider than this. Like don't get me wrong. It is nice being able to have that many tracks up but I do want a bit more distance sometimes so I can see the rest of the song and whatnot. So with game development if you take an engine like unity or something or unreal engine four or five, you can move all of this stuff so you can change everything constantly. If you need a big like asset window here and then your scene window here and then like, I don't know, your game objects and stuff there. And then your inspector window over here, this is great. See this guy might like it. because you can turn the, hey you can turn sideways. - This monitor might be better sideways. Okay. I have to now, - You think so? - That's better think, I think that's better. - With an aspect ratio of this square having this hunker bezel on one end, I think is not - Distracting? - Yeah, because this screen really works well in either orientation and this just kind of implies like you're doing it wrong. So you can really make it thick and you can have like really thick audio now. Well, and I could bring this down. - What if you were editing a vertically shot video though? - oh like a YouTube short or something. - That's a good point. You could have your preview monitor on a 16 by 19 here. - Totally, yes, yeah. - And then do all of your-- - bottom half - and then the bottom half is your, is timeline top half media. - Yeah. Nice. - There's no mention of like a factory calibration in terms of color accuracy. But if it does that much of the color space you can tune it yourself and probably get it pretty close. It looks fine. I actually really like this. I mean, obviously this is a terrible situation. Because we've got these giant black bars. It looks like we can't do two videos of the same size like top and bottom, to do two 1440 P videos basically. But I mean, that is partly just because of YouTube. If we had like VLC or something going up with two full videos, you could probably stretch it so that it basically does two full 1440 P images. Yeah. This thing looks awesome. This is like the ultimate Instagram reels or like YouTube shorts, content consumption monitor. All right, let's try game on this thing. Oh, check it out, native 2560 by 2880 by nine. (background laughter) I like how it centers doom guy so well, it's like a portrait. Like I don't know, it's just silly. Okay, let's try it, it doesn't look right. It doesn't feel right. I feel like I've got all this screen space missing. It's great. If you like, work in an office and you have to do photoshop stuff or whatever but like for gaming, no, this is bad, (chuckles) I think this will feel a lot better because like it's not portrait anymore. Who needs four by three when you've got eight by nine. Okay. I still don't like it, but, - [Jono] it's better. - It's better. It's better. It doesn't feel as good as CRT's, but it reminds me of how they look. For viewing content, yes, for playing games, God no, this is terrible. I think that it has a lot of purposes and use cases. Gaming isn't necessarily a strong suite but you're not stuck, not gaming. I mean you saw a doom handle a 16 by 18 aspect ratio, no problem actually. Yeah this would actually be great for something like civilization or another four X game, RTS maybe actually could be good for RTSs, anything where you need like a lot of screen space and you don't necessarily care about going wide at all. So this is the LG dual up. Pretty much everyone who's walked by while we were filming wants this thing. They all, you know, not everyone's like, oh this is the best monitor I've ever seen. But it's interesting to basically everyone and everyone had a different kind of use case that they wanted it for, which was pretty interesting as well. If you enjoyed this video check out some of our other short circuits. Oh, we did a tablet PC. So hey, if you like this aspect ratio, check that thing out. because it's basically a tablet (laughs) I love it. Put it on my desk.",
    "transcript_keywords": [
        "yeah",
        "monitor",
        "thing",
        "Ergo Dual",
        "kind",
        "great",
        "panel",
        "stuff",
        "power",
        "pretty",
        "feel",
        "Dual",
        "Twitter monitor",
        "monitors",
        "lot",
        "good",
        "God",
        "Ergo",
        "top",
        "weird"
    ],
    "transcript_entity_values": [
        "half",
        "RTS",
        "Jonathan",
        "iPad",
        "VLC",
        "Hertz",
        "three",
        "60",
        "one",
        "2560",
        "USB",
        "USB C",
        "Seasonic",
        "32x9",
        "CRT",
        "only 60",
        "Mac",
        "about 300",
        "Andy",
        "DC",
        "nine",
        "your--",
        "1440",
        "LTT",
        "18",
        "Twitter",
        "80",
        "Instagram",
        "98 or 99%",
        "WA",
        "Jono",
        "LG",
        "third",
        "1440",
        "Philips",
        "2880",
        "the end of",
        "these days",
        "seven 50",
        "16",
        "90%",
        "two",
        "four",
        "10 year",
        "Seasonic",
        "50%",
        "only one",
        "16x18",
        "16",
        "19",
        "five",
        "MacBook",
        "YouTube",
        "eight",
        "the LG Dual Up Monitor Ergo"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "GPE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}