{
    "id": "b5aHShFyZqs",
    "title": "The Tiny Snack Gadget You Need To Know About",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-08-11T14:59:04Z",
    "video_url": "https://www.youtube.com/watch?v=b5aHShFyZqs",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "heat sealer",
        "snack",
        "snacking",
        "chips",
        "eco sealer",
        "cool gadgets",
        "sun chips",
        "best",
        "2016",
        "innovation",
        "invention",
        "things",
        "inventions",
        "products",
        "awesome",
        "new technology",
        "new gadgets",
        "amazing inventions",
        "awesome inventions",
        "futuristic",
        "new inventions",
        "cool",
        "test",
        "future",
        "weird",
        "smart",
        "video",
        "crazy",
        "google",
        "cool inventions",
        "new technology 2016",
        "mighty",
        "electronics",
        "cool technology",
        "cool gadget"
    ],
    "views": 2033632,
    "likes": 49479,
    "comments_count": 3077,
    "description": "(   ) --- Today's Mystery Video -  Innovative Heat Sealer (USA Link) -  Innovative Heat Sealer (International Link) -   Every so often I bump into a gadget that's an absolute \"no brainer\". This is one of those moments. This simple gadget solves a common problem, it quickly and easily reseals any bag!  From the manufacturer -  Do you want the world's best bag re-sealer that will impress you because of its excellent functionality? In case you want to enjoy world-class services, then purchase the Eco sealer because it guarantees more than expected. It is very ergonomic and will always seal in both flavor and freshness. The device only charges in 45 minutes as compared to other devices that charge in about 3-4 hours. This is the world's best bag sealer that you can always rely on for the best service ever.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/r_cP5B8apKo?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2bidFke",
        "http://geni.us/drRq",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Lalalalalalalaaaaa Snacking: you love to do it. You might, like me, be interested in a bag of chips here and there on the rare occasion when you're not eating kale. Do I look like the kind of guy that eats... But! There's a problem with snacks; specifically, snacks that come in bags. You might not finish the whole bag. Although you might attempt it, your conscience might kick in. It can say, \"Hey, dude, chill out on the chips! You're going to be 500 pounds!\" And then you become one of those TLC TV shows. That's how it goes, right? Well, here's the problem: how do you keep them fresh? How do you keep them fresh? How about this: the Eco-Sealer. This baby will reseal any bag. Now maybe it's not chips; maybe you're more of a popcorn guy. God knows what you like to snack on. This thing will seal that bag back up, so when you're done, you're done, and when you crack it back open, it stays fresh. How does it work? The magnetic strip on its base will let you attach it to a fridge, freezer, or microwave. Unbelievable. So it's always nearby. Let's crack this open, eat some chips, and find out if it's the real deal. User guide. Press down and preheat for 3 seconds, then align across to seal it. What is this? Whoa! A nice little flat micro USB charge cable. Goes right in there like that. There's a magnet here. Is that even metal? That's interesting. Okay, now I'm really feeling like I might need to read this manual. Is there a power switch on here or does it just start going? I'm gonna burn myself-- I'm gonna get burned here, aren't I? Well, hey, listen, this is what Unbox Therapy is for. I burn myself so you don't have to. The only thing is, does this-- Hmm... Wow, this goes up to 150 degrees Celsius in 3 seconds. Okay, so yes, I will likely burn myself today. Alright, so I've fully charged this guy up, I've got some chips here. Miss Vickie's. Need I say more? Alright, let me-- Quick taste test. MMM! Very addictive. So how do you shut it down? Time to get back to fitness mode, time to get back to kale shakes. Or, if you're like Jack, you do the body pump. The hot yoga, the hip-hop dance class. So you've got a bag here, it's open, you can see. What you want to do is keep it nice and flat like this. Get your guy here, lift it up, go from the locked position to the sealed position Hold it down. 1... 2... 3... And start to move it across... Like so. And this thing is so hot that it moves right through the surface of the bag. Look at that. Is that... Look at it! You see that, Jack? That's airtight! It's melted together as if-- as if it was the first time. And now look! My Miss Vickie's are ready for round 2. Miss Vickie's: you're not a sponsor... yet. Give me a call. That is... Look at this. That's a game-changer! Can I open it up just like a regular chip bag? Yes I can! If you have candy, Swedish Berries, Sour Patch Kids, any of these things that come in a bag, Everything comes in a bag! So, forget about buying extra Ziplocs, save the planet while you're at it. Jack can keep his grimy paws out of there! Jack-- Is it sealed, Jack? Leave it alone.",
    "transcript_keywords": [
        "Lalalalalalalaaaaa Snacking",
        "bag",
        "Snacking",
        "Jack",
        "Miss Vickie",
        "chips",
        "Vickie",
        "back",
        "guy",
        "open",
        "fresh",
        "Miss",
        "thing",
        "Lalalalalalalaaaaa",
        "burn",
        "Time",
        "love",
        "Hey",
        "chip bag",
        "snacks"
    ],
    "transcript_entity_values": [
        "1... 2...",
        "TLC",
        "the Eco-Sealer",
        "USB",
        "today",
        "first",
        "Swedish",
        "Unbox Therapy",
        "3 seconds",
        "150 degrees Celsius",
        "Vickie",
        "500 pounds",
        "Jack",
        "2",
        "Ziplocs"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "NORP",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG"
    ]
}