{
    "id": "b7zBJNmdImo",
    "title": "This Smartphone Hardware is Getting Crazy!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2023-03-21T10:17:15Z",
    "video_url": "https://www.youtube.com/watch?v=b7zBJNmdImo",
    "category": "Science & Technology",
    "tags": [
        "MKBHD",
        "Oppo",
        "Find X6 Pro",
        "Find X6",
        "smartphone hardware",
        "smatphone",
        "camera",
        "hasselblad"
    ],
    "views": 2872555,
    "likes": 92250,
    "comments_count": 3655,
    "description": "This phone isn't even getting released outside of China, but damn, this hardware is good.  That hoodie!   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Phone provided by Oppo for video  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, look at this thing. This is the Oppo Find X6 Pro. Now I've talked about Oppo's Find X Series smartphones before. They've made some pretty wild stuff in the past. This X6 Pro is not even coming to the US, it's apparently going to be China only, but I've gotten to actually use it for about a week, and it's got me thinking... Smartphone hardware has gotten so ridiculously capable, and this being at the top of the heap is so capable that I think we might actually be taking it for granted a little bit. So, okay, let's back up. Aesthetically, slab smartphones have all kind of started to look the same. We are all on the same page about that. This one actually kind of manages to spice it up a little bit with this half vegan leather on the bottom, which kinda has a little texture to it, which is nice. And then the top half and the the rails are like this satin metal, so it is a bit different, and I actually like it a lot. But you know, that's the Oppo Find series for you. They've been really good at spicing it up from the standard slab formula for a number of years, and they try all sorts of interesting stuff. There are some solid colored versions of this phone as well, but this is the one that really makes a statement. But none of that is even really what I'm talking about in this video. What I am talking about is what's under the hood. Get it? Under the hood? 'Cause of the hoodie? Anyway, yeah. Under the hood here. So, Chinese software aside, I can just tell that because this is a Snapdragon 8 Gen 2 with 16 gigs of RAM, with fast storage and great other supporting specs, I feel pretty comfortable saying that it's going to go well. But there are three main areas that I just wanna appreciate with smartphone hard work capability right now. So the first one is the battery. Now, okay, here's the way we normally think of smartphone battery, right? Like, what was a good smartphone battery life like eight, nine, ten years ago? It's like, oh, all day. If it could last all for an entire day of battery life, that'd be pretty good. Now, fast forward all the way to 2023, and what what is a good smartphone battery life? It's one day, all of the day. Maybe two days if you're lucky. So it doesn't feel like it's advanced that much. But of course, you need to consider the amount of stuff our smartphones are doing has gotten way more dramatic, much more powerful processing, bigger screens, way more radios. These things are way more power hungry. So for those older smartphones, an all day battery life meant having like a 2000 to 3000 milliamp power battery. And then even as recently as like, three years ago, you could either get like a 5000 milliamp power battery with slower charging, or you could get like a 3000 milliamp power battery and have blazing fast charging. But now it's 2023, we can have both. Now this one's got a 5000 milliamp power battery, that also charges at a hundred watts wired, or even 50 watts wireless charging. So, with a cable, that 100 watts will do zero to 100% in 30 minutes. But even through what they're calling \"AirVOOC Qi Wireless Charging\", 'cause they gotta name everything, with the right accessory, you can get 50% charge in 22 minutes on the wireless charger. So it's kinda sick. Plus, there's all the battery extras and modes to ideally help keep the battery healthy and optimized so that you can fast charge as much as you want without damaging a thing. It learns your schedule, does that whole dance. This phone even has an ultra low temperature charging mode. I think any phone can probably have this mode if they programmed it, but basically what this phone is doing is, if it detects you're in extreme cold, like zero to negative 25 degrees Celsius. So, you're freezing. It's Canada in the middle of the winter, something crazy. And so it's really cold. The batteries are really cold. But batteries need to be in a certain temperature range to charge quickly, like somewhere around room temperature. So if you plug it in in that extreme cold and it needs to rapidly charge, it will actually run an artificial load through the computer, through the processor, like basically benchmark itself over and over again to start to generate heat in the computer to warm up the phone to get the battery to a better temperature to charge quickly. So even at the end of the day, if it was 10 years ago, \"all day battery life\", and now today it's still \"all day battery life\", I still think it's way more impressive now than it was back then. So that's number one, the battery. Then number two is this display. So, you know, watching this through a compression through a website, on a YouTube video, and then on the screen of your phone, you won't be able to tell how awesome this screen is. Like, you'll just see another phone with thin bezels and some slightly curved edges and a hole punch cutout for the selfie camera lookin' pretty normal. I remember not that long ago when we were first getting retina displays in smartphones, we were getting basically right over the 300 pixels per inch, 300 PPI limit, where you can't really discern individual pixels anymore. That was back in the iPhone 4S days where it was like a 60 hertz flat LCD, but it was like, oh, it's a retina display. But this screen, this display here in a smartphone, this is a 6.82 inch diagonal with a 3168 by 1440 resolution. That's 510 pixels per inch for anybody counting. Razor sharp, but you can turn it down to 1080p anytime. It's also an AMOLED display with LTPO, so it goes all the way up to 120 hertz, and all the way down to 1 hertz when it doesn't need to be moving at all to be efficient. And it has a 240 hertz touch sample rate. It's extremely responsive to the touch, whether it's scrolling or swiping around or gaming. It also has adjustable color settings to get it looking exactly dialed the way you want. And by the way, that has a max peak brightness of 2,500 nits. So there's pretty much no situation, whether it's in the dash of your car or outdoors in direct sunlight, there's no situation where it's not bright enough to be readable, which is dope. All while housing a pretty standard, really quick optical fingerprint sensor, and the hole punch camera you saw with the cutout for the selfie camera at the top. Do I wish it was more flat? Yeah, if I was gonna daily this phone, I'd want a more flat display than this. But, I mean, this is the Oppo Find X thing, that's what they always do, they try to go a little fancy, a little spicy with the hardware. So I almost give it a pass 'cause I expected that. But this display is world class. It's hard to appreciate on the camera, but if you showed this display or those numbers to people 8-9 years ago, it'd be nuts. So that's two. Then three is the camera. I mean, you look at a phone like this, and it's pretty clear what the focus is. That's a pun. But the camera system on the backs of these phones has swelled up more and more over the years, especially on the flagships. At this point, it's damn near half the back of the phone. This one is a triple camera setup. So, one standard, one ultra wide, and one periscope zoom. Now, those first two categories, display and battery, are less software dependent. Like you can basically brute force your way into having a good one, if you just buy a good enough part. Like, you don't need good software to have a great display, just buy a good display. And optimization helps, but like, if you'd buy a huge battery, you'll have a pretty good battery life. But cameras are a little different. Cameras, as we've talked about, are mostly, I mean it's a lot of software work that goes into determining the character of the photos and videos you get out of a smartphone camera. It's basically a computer. And so in order to separate yourself at the very top of smartphone cameras, something like this, like a flagship, actually needs to combine the two. If you want to give your software the best chance of succeeding, you need to give it the best information possible. And so this is trying to do both. So let's not even worry about the megapixel count, but just the sheer size of the sensors in here and their light gathering abilities, and then the quality of the lenses they're able to fit in front of them. This is a primary camera that is a 50 megapixel, one inch type sensor, with optical stabilization and a 1.8 aperture. And so while it still has to be Oppo's software that does all the processing, that is most of the work in creating a photo nowadays, it absolutely makes a big difference to give that computer as much light and as much information as possible, so that's what's going on. The biggest things that these huge sensors tend to struggle with is actually minimum focus distance and close up subjects. So thankfully, this system also has a massive 1 over 1.56 inch ultra wide sensor, with an f/2.2 aperture, and it also happens to have a four centimeter minimum focus distance, so you can take close up shots, and it's got this built-in macro mode to handle most of the weaknesses of the primary camera. And there's a matching, identical actually, large sensor behind the 3x periscope camera. And that one also has an f/2.6 aperture. So they are all 50 megapixel cameras, they can also all do a 2x crop and still be very detailed. So that kind of makes it feel like the 1x camera is now a 1x and a 2x, and then the 3x camera is both a 3x and a 6x. But then, you know, Samsung phones will go the extra mile and also include a 10x camera, which can also crop if you want to. So they'll go like, as much zoom versatility as possible. But the point is, yeah, we're throwing hardware at it now, and it works. It's important still. Camera systems like this were just kind of not on the radar a few years ago, especially because designs wouldn't really allow it. Like, we just kind of got used to gigantic bumps on the back of phones. So the downside, or maybe upside, depending on how you see it, is phones today just have bigger and bigger camera bumps on the back to house all these massive sensors and big optics. But this one I actually don't really mind. Maybe you feel the same way. They've embraced the Hasselblad branding, obviously. They also put this whole thing in a huge circle. And then it has this nice neuraled ring around the camera circle that reminds me of those like nice, especially Hasselblad cameras. It's got the dot in the middle, which is typically where you'd line up a lens to put it on. So it kind of plays it well, it looks fine. Also, there's a couple of phones with like huge camera bumps where I like that the bottom of it is right in the spot that matches where my finger rests on the back of the phone. So I actually use the camera bump to hold up the back of the phone comfortably. And this is one of 'em. This phone also happens to have the fastest storage we've seen in Android phones. It's UFS 4.0 storage. Has the fastest RAM, has the fastest Wi-Fi, is Wi-Fi 7 capable. It also has fantastic haptics. All of that is enabled by hardware. And this isn't even really the most powerful smartphone out. Like, let's be honest, it's gonna be the gaming phones again that level up this chipset, give it crazy cooling, like overclock it. They'll do nuts things, they'll prioritize different things. They'll have a higher refresh rate screen, they'll have big front facing speakers and things like that. Others might prioritize design in a way that's like extra thin. Different phones do different things. And that's not even touching the whole battle being fought over how folding phone form factors should work, because there are a lot of options out there, and that is all hardware, and that is all still very interesting. But just as far as the standard slab smartphone, these pieces of hardware would be like unthinkable 8, 7, 6 years ago. So that's pretty cool. Thanks for watching. Catch you guys the next one. Peace. (upbeat music)",
    "transcript_keywords": [
        "battery",
        "camera",
        "Oppo Find",
        "battery life",
        "phone",
        "day battery life",
        "good smartphone battery",
        "smartphone battery life",
        "Smartphone",
        "Oppo Find series",
        "smartphone battery",
        "phones",
        "day battery",
        "milliamp power battery",
        "display",
        "power battery",
        "good",
        "day",
        "Oppo",
        "years ago"
    ],
    "transcript_entity_values": [
        "about a week",
        "7",
        "AMOLED",
        "50 megapixel",
        "four centimeter",
        "5000",
        "240 hertz",
        "the day",
        "2x",
        "1.8",
        "a number of years",
        "the years",
        "1440",
        "half",
        "first",
        "510",
        "iPhone",
        "2023",
        "50",
        "100 watts",
        "120 hertz",
        "2,500",
        "US",
        "1 over 1.56 inch",
        "25 degrees Celsius",
        "LTPO",
        "Samsung",
        "Razor",
        "today",
        "Wi-Fi",
        "China",
        "one",
        "LCD",
        "2000",
        "This X6 Pro",
        "the middle of the winter",
        "4S days",
        "30 minutes",
        "Oppo",
        "300",
        "Wi-Fi 7",
        "Canada",
        "two days",
        "two",
        "100%",
        "3x",
        "60 hertz",
        "1x",
        "an entire day",
        "ten years ago",
        "three",
        "three years ago",
        "number one",
        "eight",
        "a few years ago",
        "Android",
        "22 minutes",
        "Chinese",
        "6 years ago",
        "YouTube",
        "RAM",
        "Oppo",
        "3168",
        "1 hertz",
        "10 years ago",
        "8-9 years ago",
        "UFS",
        "one day",
        "8",
        "zero",
        "all day",
        "50%",
        "number two",
        "Hasselblad",
        "16",
        "the end of the day",
        "3000",
        "6.82 inch"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "FAC",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY"
    ]
}