{
    "id": "B88RPqRkOKs",
    "title": "Porsche Taycan first look",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-05T02:50:12Z",
    "video_url": "https://www.youtube.com/watch?v=B88RPqRkOKs",
    "category": "Science & Technology",
    "tags": [
        "porsche taycan",
        "porsche",
        "taycan",
        "taycan turbo",
        "taycan turbo s",
        "turbo s",
        "ev",
        "evs",
        "electric vehicle",
        "porsche electric",
        "new car",
        "electric car",
        "2020",
        "new porsche",
        "tesla",
        "tesla model x",
        "model y",
        "model s",
        "test drive",
        "test ride",
        "first ride",
        "first look",
        "hands on",
        "tesla model s",
        "driving",
        "electric",
        "porsche vs tesla",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 137005,
    "likes": 2592,
    "comments_count": 204,
    "description": "Porsche unveiled its first electric car, the Taycan. The Verge got a chance to see the $185,000 version of the car up close at the automakers Niagara Falls event. Its an electric vehicle that marks the beginning of a new era in the companys long history.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2lDdUfQ",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody it's Sean, and I'm in beautiful Niagara Falls, because Porsche is about to unveil its first electric car. Let's go check it out. Four years after first teasing that it was going to get into electric cars, Porsche has finally unveiled its first production E.V. And I'm standing in front of it right now. It's the Porsche Taycan. Taycan will be Porsche's first all electric car when it hits the road later this year. And Porsche actually announced two versions of the car today, the Taycan Turbo and the Taycan Turbo S. Now, make no mistake, these are not going to be electric cars for the masses. They start at $150,000 and the Taycan Turbo S, will cost $185,000. What that means in terms of the actual product itself is, you have a very high-end Porsche that just happens to be electric. One that has all the performance that you come to expect from a Porsche product. And something that has all the nice luxury touches that the automaker is really known for. On the performance side the Porsche Taycan is going to be able to compete with most cars on the road, and it will even hang with some supercars. And it's just about as fast as some of Tesla's most expensive models. Taycan Turbo will go from 0-60 in 3 seconds flat, and the Taycan Turbo S will go from 0-60 in 2.6 seconds flat. Both versions of the car will have about 616 horsepower on offer it, pretty much anytime, but in launch control mode the Taycan Turbo will have 670 horsepower available. While the Taycan Turbo S will have 750 horsepower available. They are drawing all of this energy from a 93 kilowatt hour battery that weighs about 1300 pounds. The car itself, weighs about 5100 pounds overall. So it is a very heavy car. Almost as heavy as Tesla's Model X. Now that battery pack will give both cars a range of about 450 kilometers, or about 280 miles. This is based off the European WLTP standard though, and Porsche didn't release an EPA estimated range for the car yet. On the interior, the car is full of touch screens. There is a curved, boomerang-style screen behind the steering wheel that has touch sensitive panels on both little edges of the boomerang shape. There is a touch screen panel in the middle of the car where you would normally expect to see one, that helps to control all the media settings, some of the battery settings. There is another optional touch screen panel in the passenger seat that you can get if you want to pay a little bit more money. Ah making that 3 screens across the dashboard. And then there is a touch sensitive panel in the center console. Which is pretty similar to what you would find in something like the Porsche Panamera. Uh, its a little bit more modernized, there aren't as many physical buttons. There is also another optional touch sensitive panel in the back seat, if you want to allow rear seat passengers to control their climate settings. So, all told, we are talking 5 different touch sensitive panels or screens in this car. It's a pretty futuristic look for something like Porsche. We knew a lot about the Taycan coming in to this event. But what's exciting to me about the Taycan is it's kind of a sign that we're exiting that initial era of electric cars where, automakers are trying really hard to make you know that its electric and throwing, blue accents on everything and making the cars look like something out of the Jetsons. This just looks like any other Porsche, like kinda like a Panamera, kinda like Carrera. This is just the start of what Porsche trying to do with electric cars. It's definitely going to get better from here. Hopefully get more affordable. And, hopefully for the rest of us, what Porsche learns on the Taycan becomes information and learnings that wind up showing up on other Volkswagen cars, that are more affordable. Volkswagen is going to be putting out dozens and dozens of cars. They've invested billions of dollars into electric vehicles in the coming years. And so, it may take awhile, but one day you may be able to buy something that doesn't cost $150,000. That has a taste of what the Taycan Turbo and the Taycan Turbo S are going to start offering consumers pretty soon.",
    "transcript_keywords": [
        "beautiful Niagara Falls",
        "Taycan Turbo",
        "Niagara Falls",
        "Taycan",
        "Porsche",
        "Porsche Taycan",
        "beautiful Niagara",
        "Turbo",
        "car",
        "electric cars",
        "electric",
        "cars",
        "touch",
        "Sean",
        "Falls",
        "Niagara",
        "Porsche Panamera",
        "touch sensitive",
        "touch screen panel",
        "panel"
    ],
    "transcript_entity_values": [
        "Four years",
        "Carrera",
        "Taycan",
        "the Taycan Turbo S",
        "2.6 seconds",
        "a 93 kilowatt hour",
        "Volkswagen",
        "EPA",
        "today",
        "Tesla",
        "Porsche",
        "3 seconds",
        "750",
        "670",
        "Porsche Taycan",
        "about 280 miles",
        "5",
        "about 450 kilometers",
        "0-60",
        "Jetsons",
        "Taycan Turbo",
        "3",
        "the Taycan Turbo",
        "about 616",
        "two",
        "the Taycan Turbo S. Now",
        "Niagara Falls",
        "one day",
        "the coming years",
        "about 5100 pounds",
        "WLTP",
        "150,000",
        "Sean",
        "billions of dollars",
        "later this year",
        "dozens and dozens",
        "Model X. Now",
        "185,000",
        "Panamera",
        "first",
        "about 1300 pounds",
        "European",
        "Taycan"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "NORP",
        "NORP"
    ]
}