{
    "id": "b9IquEf3bIQ",
    "title": "LG G6 Hands On: This Is More Like It",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-02-26T11:59:59Z",
    "video_url": "https://www.youtube.com/watch?v=b9IquEf3bIQ",
    "category": "People & Blogs",
    "tags": [
        "lg g6 hands on",
        "lg g6 review",
        "lg g6 first look",
        "lg g6 impressions",
        "lg g6 phone",
        "mwc 2017",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 456856,
    "likes": 13511,
    "comments_count": 1508,
    "description": "LG is fixing to make a comeback with its newest flagship, the LG G6  but does the G6 bring enough heat to counter the cold reception the G5 got? In brief: yeah! Join Michael Fisher for the LG G6 hands-on from MWC 2017, and see what dual cameras on a glass-and-metal body can do!   [SUBSCRIBE]     [SPONSOR]  MrMobile's MWC coverage is brought to you by Thrifter: a new way to save money from the people behind Mobile Nations. Use Thrifter to shop for everything from gadgets to home goods based on value  not hype. Sign up for the daily mailer at  to get thoughtfully selected tech deals daily from your favorite retailers like Amazon and Best Buy ... without the fluff.    [FURTHER READING]  See the full Android Central LG G6 review here:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Fashionista\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://thrifter.com",
        "http://androidcentral.com/lg-g6",
        "https://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] LG is fixing to make a comeback with its newest flagship, but does the G6 bring enough heat to counter the cold reception the G5 got? In brief, yeah. This is the Mr. Mobile hands-on of the LG G6. (energetic electronic music) There's plenty of good news on the hardware frontier. All the design complaints I made in my G5 re-review have been addressed. The half-baked modular approach is gone, replaced with a super solid build available in three colors that seems to revel in its brick-like nature. There's been no attempt to pinch down the sides to fool your hand into thinking this thing is terribly thin. Every bit of its nearly 8 millimeter depth is on display, and it feels great because it's metal and glass. Granted, not the most original materials, and yup, it's happy to take on as much skin oil as you can give it. But the G6 looks and feels as expensive as it needs to to take on the Samsungs and Apples of 2017. Crucially, it also looks different. Not just around back with those prominent cameras we'll talk about in a second, but up front too, with a taller than normal display that sports these rounded corners that remind me of the old Palm days, and which I therefore adore. LG has given us its usual truckload of Android software customizations, and it's still far from being my favorite interface, but it's less offensive than it's ever been. And the 2:1 aspect ratio means that some system apps can split themselves into two uniform squares, which is kinda neat. The screen itself is a quad HD IPS LCD that can kick out over 600 nits to overcome bright daylight, and it's HDR-ready to boot. That's four acronyms in five seconds. So let's just get the spec sheet over with now, shall we? Snapdragon 821, 4 gigs of RAM, a 3300 milliamp hour battery, Quick Charge 3.0, in a nutshell, it's got everything a 2017 flagship needs to succeed, including Android Nougat and Google Assistant, and it's all inside an IP68 dustproof and water-resistant case. There are compromises here too. The Snapdragon 821 isn't the truly bleeding edge 835, which is expected to power Samsung's Galaxy S8. Do I care about that? Not really. I'm too busy celebrating the fact that dual-mode wireless charging is built into my US model. It's not included in other units. If you care more about a hi-fi digital to audio converter, you better hope you don't have a US version, because that DAC is only on the overseas models. And long time LG diehards will lament the loss of a removable battery here too. Finally, let's come back to that funky dual lens camera. It's much the same setup from the LG G5, and here that's actually good news. I love the ability to choose between a standard and wide angle lens, depending on how much I need to capture in a photo. But there's a crucial difference here. The LG G5 used an inferior sensor on its wide angle lens, which often resulted in washed out or low detail photos. The G6 uses the same exact sensor behind each lens, which should mean no loss in quality when you switch to wide angle. I say should because I've had less than a day to test this camera, and LG has asked me to emphasize that the software is not final. Also, there's no optical stabilization on the wide angle lens, so if you're seeing more foot bounce in the wide walking shots, that's why. My colleague Alex Dobie has spent much more time with the G6, and therefore has a wider selection of samples in his review available at Android Central right now. Meanwhile, I'll quiet down for a second, let you take in these samples while I take a sip of delicious phone water. With all the certainty that 24 hours use gives me, I can say that the G6 looks like a solid contender to take on LG's rivals in 2017. It's a sturdy, well-specced smartphone with a cohesive design and a ton of features. Features I'll cover in my full review soon. Hit me with questions on the socials, subscribe to Mr. Mobile on YouTube, and pay a visit to my MWC sponsor. Thrifter is a new way to save money on everything from gadgets to home goods by shopping based on value and not hype. Sign up at thrifter.com and get thoughtfully selected tech deals from places like Amazon and Best Buy daily without all the fluff. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "fixing to make",
        "make a comeback",
        "bring enough heat",
        "heat to counter",
        "counter the cold",
        "cold reception",
        "wide angle lens",
        "wide angle",
        "angle lens",
        "wide",
        "newest flagship",
        "lens",
        "angle",
        "Android",
        "Mobile",
        "Android Nougat",
        "fixing",
        "make",
        "comeback",
        "newest"
    ],
    "transcript_entity_values": [
        "a ton",
        "2017",
        "600",
        "nearly 8 millimeter",
        "Android Nougat",
        "less than a day",
        "half",
        "Samsung",
        "Android Central",
        "G6",
        "HD IPS LCD",
        "YouTube",
        "four",
        "Apples",
        "Mobile",
        "Amazon",
        "Quick Charge",
        "DAC",
        "US",
        "Best Buy",
        "daily",
        "RAM",
        "Google",
        "two",
        "4",
        "Thrifter",
        "Samsungs",
        "Alex Dobie",
        "Galaxy S8",
        "second",
        "3300 milliamp hour",
        "2:1",
        "LG",
        "G5",
        "835",
        "three",
        "3.0",
        "Android",
        "five seconds",
        "24 hours",
        "MWC"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "FAC",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "ORG"
    ]
}