{
    "id": "bAbTd4k374M",
    "title": "Samsung Galaxy Watch hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-09T18:20:18Z",
    "video_url": "https://www.youtube.com/watch?v=bAbTd4k374M",
    "category": "Science & Technology",
    "tags": [
        "galaxy watch",
        "samsung galaxy watch",
        "samsung",
        "samsung smartwatch",
        "samsung smartwatch 2018",
        "samsung galaxy",
        "samsung gear",
        "smartwatch",
        "wearable",
        "review",
        "hands-on",
        "samsung mobile",
        "samsung news",
        "smartphone",
        "first look",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "microsoft",
        "verge",
        "the verge",
        "tech news"
    ],
    "views": 634626,
    "likes": 6477,
    "comments_count": 709,
    "description": "The Galaxy Watch is Samsungs latest take on wearables. It features a bezel used to navigate through menus, lasts up to four days on a charge, and can track 40 different physical activities. It comes in 42 and 46mm sizes, with the option of LTE support.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Stefan from The Verge, here, and we're at the Barclays Center in Brooklyn, looking at the brand new Galaxy Watches. They're pretty good alternatives to anyone who might want an Apple Watch, but has a Samsung or Android device. But they also come with their own unique, interesting features. So, from an aesthetic standpoint, I have to say that the Galaxy has definitely matured since I last saw it. So, looking at the larger version of the watch, we have two physical buttons, one which takes you to home, and another button which you basically can use to program and do just about anything. The crown of the watch, which is this rotating circle right here, is your main navigational tool besides the screen itself. So from here, you can get to the different home screens, the different scenarios that you would set up, like music, notifications regarding news, a barometer, and you can also add different widgets. So we could add an alarm, add a shortcut, a calendar, contacts, Samsung Health notifications. Pretty much just everything that the Galaxy Watch can do, you can add as a separate screen. I appreciate that once you reach the limits of a given menu, that it vibrates and it gives you a sort of tactile response. So you're not just aiming around different menus with the navigational crown, and you're not swiping around everywhere and forgetting where you are. So Samsung is touting three primary features for the new Galaxy Watches. First and foremost, the My Day feature, which is sort of a daily summary watch face, which shows you how much time you have allotted through the day, and what appointments you have, and how to balance both. Second is the all-day battery life, specifically four days worth of purported battery life. And last but not least, activity tracking for up to 40 different activities, which are seamless and simultaneous. Meaning that if you switch from, say for example running to cycling, the watch will pick up on that and calculate results in a different manner. Galaxy Watch comes in two different sizes and three different variations: a 42 millimeter smaller version, which you see in this pink rose gold version, and a 46 millimeter larger version. So basically, this particular color only comes in the smaller version, presumably because this would be the women's size, 'cause it's a smaller watch. Thickness compared to a real watch is about the same, and it's pretty surprising. It's not that much thicker than the real thing, and I appreciate that. It's also relatively light-weight. The casing is metal, which I appreciate from a quality standpoint. And this uses, or comes, rather, with default rubber sports bands, but you can turn it over and see that you can actually remove these with a little latch right here and pretty much use any wristband that will fit into the casing of the watch. So the Galaxy Watches do come with LTE, you can get a carrier in the United States that supports them. Right now we don't have carrier availability, but Samsung has claimed that they've partnered with more than a dozen carriers worldwide to provide LTE capability for the Galaxy Watch. With LTE capability, you can receive calls, send them, talk to people, listen to Spotify, pretty much do everything you would with the Galaxy Watch normally that's paired to your phone, but just independently without needing a phone around. I really do like the watch. It has a quality feel to it. I wouldn't use this default band, however, but the metal casing, the use of a crown as a navigational device, I think those are really novel things that Samsung has done well here. Battery life, I haven't been able to test. We'll have to figure that out in the long run. But overall, this seems like a pretty promising Android wearable. *It connects to Android phones, but runs Tizen* If the Galaxy Watches are using Qualcomm's new Snapdragon chip for smart watches, then this might be very promising. Samsung purportedly says that the battery will last up to four days, and considering how slim the watches are, that's pretty impressive, especially since you can charge 'em all wirelessly. Regarding pricing and availability, those are still TBD. We don't know those yet, but keep it locked to The Verge, and keep it locked to youtube.com/TheVerge.",
    "transcript_keywords": [
        "Center in Brooklyn",
        "Barclays Center",
        "Galaxy Watch",
        "Galaxy Watches",
        "Watch",
        "Galaxy",
        "Samsung",
        "Watches",
        "Apple Watch",
        "pretty",
        "Brooklyn",
        "Barclays",
        "Center",
        "version",
        "Samsung Health notifications",
        "add",
        "LTE",
        "Android",
        "Samsung Health",
        "battery"
    ],
    "transcript_entity_values": [
        "four days",
        "Android",
        "up to 40",
        "Second",
        "all-day",
        "three",
        "Snapdragon",
        "the day",
        "LTE",
        "more than a dozen",
        "Verge",
        "Spotify",
        "daily",
        "an Apple Watch",
        "Qualcomm",
        "the Galaxy Watch",
        "Samsung",
        "the Galaxy Watches",
        "the United States",
        "42 millimeter",
        "up to four days",
        "two",
        "Galaxy",
        "Galaxy Watch",
        "the Barclays Center",
        "Brooklyn",
        "Samsung Health",
        "46 millimeter",
        "First",
        "Galaxy Watches"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT"
    ]
}