{
    "id": "bAlGzsVsbLE",
    "title": "Will a BULLET PROOF Tesla actually stop bullets?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-04-13T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=bAlGzsVsbLE",
    "category": "Howto & Style",
    "tags": [
        "armormax",
        "international armoring",
        "tesla",
        "model s",
        "model x",
        "model y",
        "model 3",
        "Elon musk",
        "bulletproof glass",
        "balistic glass",
        "hand gun",
        "rifle",
        "9mm",
        "glock",
        "bullet proof car",
        "bulletproof tesla",
        "bullet proof"
    ],
    "views": 8311148,
    "likes": 167276,
    "comments_count": 12022,
    "description": "Its time to shoot a bulletproof Tesla... Get 1000 miles of free supercharging when you get a Tesla using my code:  And thanks to ArmorMax for letting us 'borrow' their Model S.    See what happens when the tires go flat HERE:   How Bulletproof is a bulletproof Tesla? What makes a car bullet proof? How much does a bullet proof car weigh? Can you make any car bulletproof? All of these questions and more will be answered in todays video where we find out if a Bullet Proof Tesla is really bullet proof. Ill be using a pretty common 9mm hand gun to fire projectiles at the fully bulletproof Model S Tesla. The cool Green laser sight I used in this video:     Adding bullet proof glass and paneling to a Tesla does add some weight to the body. BUT since Teslas are already pretty heavy its not a big deal. Loosing a few miles of range due to the extra weight might be worth it for the added protection.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ts.la/zack10701",
        "https://www.armormax.com/",
        "https://youtu.be/VvlNMTR4r8o",
        "https://amzn.to/2G9nyxz",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Behind me I have a bullet proof Tesla. No one has ever shot a bullet proof Tesla before. We're going to be the first. Let's get started. [Intro] [Music playing] So Tesla does not sell bullet proof Teslas - it's something that has to happen after the fact. It's an after market upgrade you could say. So with a bullet proof Tesla, they have to add bullet proof glass for the windshield, the driver's side, the passenger side, the rear trunk, and they also add bullet proof paneling inside the metal doors. So no matter where a projectile might enter into the vehicle, whether through the window or through the door panel, it's going to stop the bullet in the car instead of letting it inside of, you know, the cabin area. The goal is to kind of protect the passenger area like a cocoon Bullet proof windshield, we have a bullet proof A post, B post right here behind Star Man, and then C post back there. All of those have the bullet proof paneling inside of them. So since this particular Model S Tesla has been bullet proofed to withstand, you know, hand guns, it did add about 430 pounds worth of weight, you know, between the thickness of the glass and the body panels and the door. If this Tesla was bullet proofed to withstand rifles, you know, it's a bigger bullet, you know, more power, it would add about 700 or 800 pounds. But Tesla's are already pretty heavy vehicles, you know, that's why they are so safe. They don't roll over. So adding 400 pounds isn't that big of a deal. It still has an insane amount of get-up-and-go and it still looks almost the exact same as it did when it first came from Tesla. So one thing that is different with this amoured Tesla is the bracket right here around the window...there's a little bit of structural integrity added to the glass because on Tesla's it's a free floating panel. So the armoured portion is this thick part of the glass right here, and then this is a rebated edge. If there were a projectile to come in through this window, this glass would stop it. If the projectile were to come in through the thin portion, it would be stopped right here up in the A frame. You might be thinking to yourself, but what happens if someone shoots out the tires? There is a solution to that. Dan from the YouTube channel What's Inside made a video about how the tires can still keep rolling even if they're flat. I'll post a link for that video at the end of this one. Make sure you check it out. So for this video I'm going to be using a Glock 19 which is a 9mm hand gun. So this is a regular 9mm bullet. It has the solid tip on the end. But we're also going to be shooting with this. This is a hollow point 9mm bullet, and so when it hits something, these little phalanges on the end spread out and it has a little bit different of an impact area. We're going to see what happens with the bullet proof glass when hit with both of these bullets. [Music playing] Three, two, one! [Shooting sounds] That was sweet! That is insane. I can still hear the glass....listen to the glass...[cracking sounds]...that's crazy. It hit right here in the center and you can see that this top layer of glass shattered out. And there's no hole yet, so pretty sure that the bullet didn't go through. We'll hit it a couple more times in just a second. So on the Tesla right here we have the point of impact and we have a little bit of pulverized glass right here along the edge. So when the bullet hits bullet proof glass, it just kind of disintegrates. It just dissolves into nothing, and all the energy, the forward momentum, gets distributed into the glass itself and kind of like fractures outward because the glass is made up of multiple layers. If we open it up from the inside, you can see the underside of the glass is completely flat and smooth right here. My fingers are not getting caught with any of the glass shards because this layer underneath is a poly-carbonate It's kind of a plastic of sorts that absorbs the energy from the bullet. So now we can kind of see the different layers from the bullet's hit right here. The glass on the outside has a little ridge on the end. As soon as it hit that poly-carbonate, that's when the bullet stops going into the glass. So a lot of people think that bullet proof means that the...it's like Superman the bullet's going to hit it and just bounce off and leave no damage, but there's a lot of energy in a bullet, so that has to be absorbed into the glass. And it's going to leave some damage, but the bullet didn't penetrate, and that's what we're after. There's a safe cocoon inside of the car that allows the person inside just to be safe. So that first shot was done with a 9mm bullet. This is the little guy right here. It's just a solid tipped, you know, normal...this is what you'd buy to do target shooting or something like that. Now we're going to shoot it with a hollow point. This bullet is a little bit different. This one actually has a hollow tip with little phalanges along the side that will open up and hit the glass, and we'll see if it has a different impact radius or if it affects the glass any differently than the original bullet. [Music playing] Three, two, one! [Shooting sounds] It has a smaller impact radius. That's interesting. I would have thought for sure that the way the bullet expands after it hits something, it would have been bigger. And, because we compromised the glass the first time around, I thought for sure the next one would be bigger, but it's actually a smaller impact zone. That's interesting. That looks sweet. [Dan] Better shoot it again. Yeah, one more time! Three, two, one! [Shooting sounds] Right there. So that was another non-hollow point and it looks about the same. So I think the hollow points are more for soft objects. And you can still hear the glass like cracking. Right here there's a piece of glass. That's awesome. A lot more glass...pulverized glass down here at the bottom...just disintegrated. So no matter where a bullet hits on this Tesla, it's protected. Where the bullet hits the glass obviously, but also in the A pillar, the B pillar, the C pillar, and inside of the door panels. The whole thing is just kind of like a cocoon of safety inside and not just for bullets, you know, the whole car is more sturdy as it is right now because of the added support and internal structure. Whether it's random acts of violence or a roll over, you know, Tesla's are pretty safe as they are, but you know, a little added protection never hurts. It's kind of like having a case on your cell phone. You don't want to damage the important stuff inside. So just like with regular glass, here on the outside my razor blade won't be able to do any damage. It's not leaving any scratches. Obviously, we did it with a bullet a couple times - that will do the trick. But on the inside, right here, we can see it's still, it's completely flat on the inside. Nothing's getting caught on my fingers. I can rub my hands totally safe on the inside of the car, but there is plastic on the inside. You can tell that my razor is leaving a mark and that's because of the poly-carbonate inside of the Tesla. So glass is glass, and glass breaks...but poly-carbonate can stop bullets. So is it possible to put bullet proof glass on a cell phone? Not really. With how thick it is...you know, a cell phone needs to sense where your finger's at and bullet proof glass with the thickness and the different layers...it just wouldn't work. It's not financially feasible either. Bullet proof glass is kind of expensive. So when companies are advertising bullet proof screen protectors or explosion proof screen protectors, that's not the case. On Dan's channel, we're seeing how bullet proof the tires are. I'll leave a link for that up here in the corner. And yeah, huge thanks to ArmorMax for letting us shoot their Tesla. I hope we'll be back again someday with a future project. It's a different way of testing stuff, but I enjoyed it. Thanks a ton for watching, and I'll see you around. [Music playing]",
    "transcript_keywords": [
        "bullet proof glass",
        "bullet proof Tesla",
        "bullet proof",
        "bullet",
        "glass",
        "Tesla",
        "proof glass",
        "proof",
        "proof Tesla",
        "inside",
        "bullet hits bullet",
        "add bullet proof",
        "bullet hits",
        "bullet proof paneling",
        "hits bullet proof",
        "kind",
        "hit",
        "bullets",
        "hits",
        "add bullet"
    ],
    "transcript_entity_values": [
        "the end of this one",
        "two",
        "a Glock 19",
        "Bullet",
        "about 430 pounds",
        "Three",
        "9mm",
        "Tesla",
        "about 700",
        "Model S Tesla",
        "Superman",
        "ArmorMax",
        "Star Man",
        "Tesla",
        "first",
        "second",
        "400 pounds",
        "800 pounds",
        "Dan",
        "YouTube",
        "one"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}