{
    "id": "Bat05NtQ4y8",
    "title": "iPhone XR Unboxing & Impressions!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-10-23T10:40:51Z",
    "video_url": "https://www.youtube.com/watch?v=Bat05NtQ4y8",
    "category": "Science & Technology",
    "tags": [
        "iPhone XR",
        "iPhone XR unboxing",
        "Apple",
        "Apple iPhone XR",
        "iPhone XR blue",
        "iPhone XR review",
        "iPhone XR camera",
        "iPhone XR Blue",
        "iPhone XR Red",
        "iPhone Xr vs Xs",
        "iPhone Xr colors",
        "iPhone Xr hands on",
        "iPhone Xr camera",
        "iPhone Xr case",
        "iPhone Xr vs iPhone X",
        "iPhone Xr display",
        "tld",
        "jonathan morrison",
        "iPhone Xr vs Pixel 3",
        "iPhone XR official",
        "iPhone XR unboxing and review",
        "iPhone Xr camera review",
        "iPhone XR Pictures"
    ],
    "views": 595969,
    "likes": 21704,
    "comments_count": 2820,
    "description": "Blue iPhone XR Unboxing! Subscribe for the full review!  dbrand iPhone XR skins:  My initial 24 hour iPhone XR impressions including the 6.1\" Liquid Retina LCD Display, stereo speakers, Camera and more. Enjoy!   Beats X Wireless:  Anker PowerCore 26800 USB-C Battery:  USB-C to Lightning Cables:   Google Pixel 3 XL Review!   TLD Behind the Scenes!  Mobile users:   Full iPhone XS Max Review:   The Razer Phone 2 Sounds better than the Pixel 3:   Everyone's reaction to the Google Pixel 3:  Trolling Apple Haters with the iPhone XS:   Music via Musicbed:   SECRET OFFICE TOUR:  The Perfect 2018 MacBook Pro Setup:   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:",
    "description_links": [
        "https://dbrand.com/shop/iphone-xr-skins",
        "https://amzn.to/2CYkghB",
        "https://amzn.to/2D2ezzh",
        "https://amzn.to/2SdehJT",
        "https://youtu.be/pXp39qfFfvU",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "https://youtu.be/eVLlavc-qUk",
        "https://youtu.be/nvO637G2IhA",
        "https://youtu.be/RSkIuTuNLlk",
        "https://youtu.be/ijkHWqDxLMI",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/y5v-nO8Cfiw",
        "https://youtu.be/ft8TkAeIopI",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0u...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- [Jonathan] Yo guys, Jonathan here. I am excited. The iPhone Xr is here, and I'm kicking things off with an unboxing. I try my best to shake it You must be contagious Your love's like that Oh, there's no masquerading It's not complicated Your love's like that Wrestling as I go Slippin' down this slope I try my best to shake it You must be contagious (moves into techno music) - [Jonathan] So initial impressions, I gotta say that blue looks really good. Or (electric buzzing) is it coral? Now, one of the things I was most excited for with the iPhone Xr, naturally, was those iPhone Xr wallpapers, so here's a look at all of them. (techno music) I will say one thing that really stood out is the aluminum sides and how they are color-matched to the phone is a really nice touch. Like, it is super pretty. So, yeah, the iPhone Xr is cheaper than both the iPhone Xs and Xs Max, but you'd be surprised at how many features they share. They both feature the exact same A12 bionic chip, true tone displays, face ID, wireless charging, dual SIM, stereo speakers, stereo recording, portrait mode on both the rear and front-facing cameras, smart HDR, 4K video up to 60 frames per second, Memoji, Animoji, and those are just to name a few. Now initial impressions on the display, spoiler alert, aren't nearly as bad as everyone made it out to be, and, in fact, it is actually surprisingly good. Now, I want to quickly state that PPI and screen resolution are two completely different things. So no, it does not have the same resolution as the iPhone 4. In fact, it is much higher at 1792 by 828. One thing that immediately stood out to me is how bright this display is. Like, it is crazy bright. It's accurate; it's vivid, and yeah, you can definitely tell it's an LCD if you're used to an OLED, but by no means is this bad. So with the iPhone Xr, you do get Tap to Wake, but one of the things you're giving up in addition to OLED and screen resolution is 3D touch. But thanks to iOS 12, you do get some sort of that functionality back. So you can see in Control Center, if I long-press, I'm actually getting some of that 3D touch-like functionality. It, unfortunately, does not work with apps. You can see here, if I long-press, I'm just getting the classic delete or move an app around option. Still though, the fact that you do get some sort of that functionality in Control Center, and more importantly, on the lock screen, to me, is awesome. Next from there, like I mentioned, the iPhone Xr features stereo speakers. And just like the iPhone Xs and Xs Max, they are really good. So between the speakers and the A12 bionic chip, you're starting to see if you're okay with an LCD display. The iPhone Xr is shaping up to be a really solid phone. Now, as far as the cameras go, on the back, you have a single lens system as opposed to the dual-end system on the iPhone Xs. But the good news is is that lens is the exact same wide angle lens on the iPhone Xs. And, like I mentioned, you still get portrait mode. I will definitely cover the camera in way more detail in my full review, which is coming very, very soon, so stay tuned for that. But based off initial impressions with that single lens, it was pretty impressive. Here's a portrait shot right before sunset, and just like the iPhone Xs and Xs Max, we have that adjustable aperture. So I can really crank down that f-stop and really take out all that blur or really open up that lens and get that nice, shallow depth of field. Now, from there, hopping over to a portrait selfie, lighting in this case wasn't ideal. It's pretty low light, so you can see it's definitely doing some of that noise reduction. But what I want to point out here is how those beautiful bokeh balls react to when you open up that aperture, just really, really nice. Now, from there, you might be thinking this is an unboxing, but you really didn't talk about the accessories. And honestly, Apple didn't really give us too much to talk about. If you count my iPhone Xs Max review, you know how I feel. The fact that it's 2018 and Apple doesn't include a fast charge option in the box is crazy, and there's no difference here. So with that, I kinda wanted to turn this into some of the best accessories you can buy when you pick up your iPhone Xr, and also, make this awesome little package to give away. One of my absolute favorite accessories is this giant, monster Anker USBC battery bank paired with a USBC to lightning cable. It will change your life. Now, yeah, EarPods, they're whatever, but if you're looking for a step up, if you're looking for a wireless option and don't want to pay as much as AirPods, the BeatsX Wireless are actually a surprisingly good alternative. Before you yell at your keyboard, \"Beats suck,\" they're actually not terrible. More importantly, they carry the same W1 chip as AirPods, so you're gonna connect super fast. They have a lighting port to charge up, so it's gonna work perfectly with the iPhone. And, more importantly, they actually sound much better than EarPods. They're gonna be way better in terms of sound isolation. So, yeah, let's go ahead and close this video out with a brand new iPhone Xr giveaway. That includes the battery bank, the cable, the BeatsX Wireless, and more importantly, this beautiful dbrand skin, which looks amazing paired with the blue iPhone Xr. Details on how to win are down below. Hopefully, you guys enjoyed this unboxing. If you did and you guys are feeling like being awesome, make sure you guys smash that like button. Again, stay tuned for the full review, which is coming very soon. This is Jonathan, and I will catch you guys later. (tech music)",
    "transcript_keywords": [
        "iPhone",
        "Max",
        "Control Center",
        "things",
        "good",
        "lens",
        "guys",
        "wireless",
        "fact",
        "importantly",
        "yeah",
        "initial impressions",
        "portrait",
        "display",
        "initial",
        "impressions",
        "resolution",
        "screen",
        "stereo",
        "functionality"
    ],
    "transcript_entity_values": [
        "Animoji",
        "two",
        "HDR",
        "iPhone",
        "One",
        "the iPhone Xs",
        "4",
        "Control Center",
        "Xr",
        "2018",
        "the BeatsX Wireless",
        "Jonathan] Yo",
        "W1",
        "Apple",
        "USBC",
        "1792",
        "AirPods",
        "Memoji",
        "as much as AirPods",
        "A12",
        "second",
        "Anker USBC",
        "one",
        "Wrestling",
        "iPhone Xr",
        "Tap to Wake",
        "iPhone Xs Max",
        "828",
        "LCD",
        "the iPhone Xs",
        "60",
        "iOS 12",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "PERSON"
    ]
}