{
    "id": "Bavh96FXjTs",
    "title": "Totally CLEAR LG G6 - Clear Galaxy S8 update!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-04-29T14:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=Bavh96FXjTs",
    "category": "Howto & Style",
    "tags": [
        "Clear LGG6",
        "LGG6 Teardown",
        "LG G6",
        "LGG6",
        "Clear black glass",
        "android",
        "smartphone",
        "teardown",
        "repair",
        "how to clear phone",
        "Phone mod",
        "modification",
        "s8",
        "samsung galaxy s8",
        "clear",
        "galaxy",
        "4K",
        "LG G6 review",
        "LG G6 unboxing",
        "LG G6 mod"
    ],
    "views": 2241767,
    "likes": 38237,
    "comments_count": 5061,
    "description": "How to make your LG G6 smartphone TOTALLY clear! This video will show how I remove the glass back from the LG G6 and take off all the color from the glass. Allowing you to see all of the internal components inside your new Android Smartphone.  Remember this project is very dangerous and I do not recommend attempting it unless you have experience opening and repairing cell phones.   Wich phone do you like best? The clear LG G6, or the Clear Samsung Galaxy S8?   Watch the Totally Clear Galaxy S8 video here:   Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/Is8xVvXEnag",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Intro] So I now have a clear Galaxy S8 and a clear LG G6. I'll show you how I made these in just a second if I want to talk to you about the Galaxy S8. I ran into an issue while I tried to charge it the day after I made my video. Turns out everything was working just fine - the phone calls, the service, the Wi-Fi, everything except for that it wouldn't charge. I would get a battery temperature too low warning sign even though the battery obviously wasn't cold. This is not ideal for people who want to use their phone longer than a day. Turns out there is a small temperature sensing niblet on the side of the wireless charging pad that has its own little metal contact points with the motherboard. I used some scissors to cut through the hard plastic around those contact pads and I also cut through the wireless charging loops Leaving just two plastic screw holes, the golden contact pads, and the niblet itself. Once I screwed this small segment back into the motherboard, I was able to charge and function like normal again. So if you do mess this part up, you can sometimes get replacement wireless charging coils on eBay for about ten or twenty dollars, or just harvest one from a broken Galaxy S8 to test on first. Or maybe you can just leave your whole wireless charging connected under the glass. But either way that niblet does need to be there for your phone to charge, not the ideal design choice. I feel like normally that battery temperature sensor is inside the battery itself. But on the S8 it is outside the battery and inside the wireless charging coil Luckily with the LG G6 we don't have that issue the phone will charge just fine even without the wireless coils inside. Now let me show you what the LG G6 looks like when you strip off that outer color. Just like with every glued shut glass back phone we have to use some heat to soften the adhesive under the glass. I don't personally have a hairdryer so I just use my heat gun then I slit my thin metal pry tool between the glass and the frame. I talked more about this in my LG G6 teardown, but long story short just go slow and be gentle as you slice through that glue. Once the back glass is off, I'll pull off the excess adhesive, and then I'll get that camera lens out of the frame. ] thought about making the lens clear since you can see it still has that silver coloring on it, but I don't have any spare lenses yet, and I don't want to risk cracking this one, so I just pulled the whole frame out. The fingerprint scanner came out a little easier. Just make sure not to damage that little ribbon cable along the side. Now as far as the back panel goes the color is on the underside of the glass just like it was with the S8. It took a second to find the starting point. Digging through the color until I could get a grip on it and pull it off in one massive chunk slightly easier to remove than the Galaxy S8, it feels a lot like aluminum foil. And luckily it didn't leave any residue behind on the glass. The back of the phone still is Gorilla Glass 5 so it should be pretty scratch resistant. Now I could just put the glass back on the phone and call it good. It still looks pretty high-tech at this point, but I think we should take it all the way. There are 11 screws holding down that wireless charging and back plastics. I'll pop off the wireless charging. It doesn't look like this one has any temperature sensing niblets attached to it. So we should be just fine without it. I'll check in a second the loudspeaker plastics can be popped off as well And just like with the S8 we don't need all of it. Just the speaker section with its golden contact pads. I did leave two screw holes intact, so it will still be tight against the phone body. And now for the moment of truth it still charges without the wireless charging in place. So it looks like the temperature sensor for the LG G6 since it does have one somewhere is either built into the battery or Into the motherboard which I think is definitely a better design choice than having it in the wireless charging pad. I'll add some of my clear double-sided tape to the camera lens and then press it back into the glass. The fingerprint scanner and power buttons are all one unit on the G6 you have to be super careful with this If that ribbon rips the power button will stop working and well You know there's always the chance that your phone will never work again if you attempt this So keep that in mind I'll lay that clear double-sided tape all around the outside of the phone This will help keep dust and lint from your pocket from entering under the glass and getting inside those components So make sure it's fully sealed around that edge I'll clean off the inside of that back glass because once it gets set down into place It's pretty permanent the double-sided tape is pretty strong stuff gently setting the glass panel down into place and pressing it securely All along the edges and there you have it That is one pretty good-looking phone. I'll turn it on the phone is still fully functional - the wireless charging Wi-Fi and cell phone signals still function it would be way cool to add one of those old-school rotating mass vibrators inside So we could see it spin, but this phone doesn't have one of those unfortunately it's still pretty fun to see all the components Though if you notice I did screw all of my screws back into the holes that came from even without that back plastic Just be careful not to go too far because they do push through into the back of the LCD and can create pressure points I Think both phones look pretty awesome so if you had to pick between the Galaxy S8 and the LG G6 which one do you think looks cooler on the inside My Instagram followers got a sneak preview of this project before the video actually went live on YouTube So come follow me over there if you're into that kind of stuff and let me know if there's any other phones you want to See clearer versions of down in the comments Thanks a ton for watching I'll see you around.",
    "transcript_keywords": [
        "wireless charging",
        "phone",
        "glass",
        "back",
        "wireless",
        "charging",
        "glass back phone",
        "wireless charging pad",
        "Galaxy",
        "glass back",
        "back glass",
        "inside",
        "pretty",
        "battery",
        "charge",
        "temperature",
        "wireless charging coils",
        "contact pads",
        "charging pad",
        "clear"
    ],
    "transcript_entity_values": [
        "the Galaxy S8",
        "Instagram",
        "eBay",
        "two",
        "Wi-Fi",
        "S8",
        "about ten or twenty dollars",
        "Galaxy S8",
        "the Wi-Fi",
        "11",
        "YouTube",
        "first",
        "second",
        "LCD",
        "G6",
        "niblet",
        "one",
        "the day",
        "LG"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}