{
    "id": "BAYtzDRyTFg",
    "title": "Pro Earbuds for only $130?? - Soundcore Liberty Air 2 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-01-12T20:34:57Z",
    "video_url": "https://www.youtube.com/watch?v=BAYtzDRyTFg",
    "category": "Science & Technology",
    "tags": [
        "Soundcore",
        "Apple",
        "Airpods Pro",
        "Wireless",
        "Liberty",
        "Lum",
        "Audio",
        "Audiophile",
        "Earbuds",
        "Music",
        "Playing",
        "touch control",
        "ANC",
        "Active Noise Cancellation",
        "Charging"
    ],
    "views": 442123,
    "likes": 17811,
    "comments_count": 880,
    "description": "Thanks to Soundcore for sponsoring today's video! Check out the Soundcore Liberty Air 2 Pro on Amazon US at    Buy on Amazon UK:  Buy on Amazon DE:  Buy on Amazon CA:   Soundcore releases their new ANC true wireless earbuds that trying to take some market share away from the larger brands at almost half the cost.   Buy Anker PowerWave+ Pad with Watch Holder On Amazon (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://soundcore.club/35oCmG6",
        "https://soundcore.club/39rKjvt",
        "https://soundcore.club/3hTF1fL",
        "https://soundcore.club/39a0fCh",
        "https://geni.us/Sr6k",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- 130 bucks, hey, that's not bad for active noise canceling in an earphone. These are the Liberty Air 2 pros from Soundcore by Anker, and we've got them in all different. - [Man] Colors - Today in this video, that is sponsored by Soundcore. Now I, my understanding is there's actually an LTT edition one, and there's gonna be like a giveaway coming up, is that right? - [Jonathan] Yup. - Is the LTT one, one of the black ones? Yes, okay, well then we're gonna have to go with the pink one. See, they thought, they thought I was gonna go for the LTT one, but I didn't, did I? See that? Which one is it? Let's crack this puppy open. It's $130 features active noise cancellation, seven hours of battery from the earphones themselves with another, I think it's 26 hours, with the charging case. Supports USB type C charging as well. Look at that, they include a cable and no power adaptor, thank you, thank you Apple for that industry trend. They got a whole whack ton of, oh wow, there's actually like, wait, are there extras? Are there actually just, there are nine different sizes including the mediums that come right on the earbuds. So that's pretty sick. It also features wireless charging, and you see how that mousepad protected my desk from getting scratched there lttstore.com. Yeah, no there's no, there's no stock. We tried, I thought we were ordering too many. Okay, does this not include a wall adapter either, this video is sponsored by Anker, but I think a wireless charging pad should probably have a wall war. Case is a bit on the bigger side, this is an AirPods' pro case. So you can see it is both thicker and taller but about the same width. Type C, really nice to see charging indicators here, and then you pop these puppies in, a little something like that. Okay, magnetic. Pretty much industry standard at this point. Okay, throw it on the wireless charger. Any luck, hey, look at that, nice, success. Watch holder, but not charger? - [Andy] Yeah, I think you put your charger in there. - Ooh, so you wrap your wire around like here. What the heck, oh wow, yeah, you're right Andy. Let's put that away for now. So they've got a very similar shape to like your first gen AirPods with the stem down here. Little bit bigger, so they've got like a, a similar sized head but then like a larger stem compared to air AirPods. All right, in terms of the fit, the hang kind of more forward like the pros instead of hanging straight down. How do I look, Andy? - [Andy] You look great. - 15 minutes of type C charging will give you up to three hours of use and they've got six microphones for, wow, where the heck are all the microphones? Oh, there's one. Oh, it must be three per, that must be what they mean. Six microphones for good call performance apparently, they want us to try a call right now. You ready Jono? Hold on a second, I gotta, I gotta actually pair them first. There they are, Liberty Air 2 Pro. Cool, so this is a beta version of the app. Oh, I see. By default it's in transport mode. So that's going after like, like lower noises. That's really interesting. I can hear a distinct difference as I'm switching between these modes while you're just like jibber-jabbering and making noise over there. Okay, let's try out the transparency mode. Yeah, okay, I can hear you pretty clearly, I will say that it's not as natural as the AirPods Pros in terms of like what the sounds around me sound like. And particularly my own voice doesn't sound as natural, it sounds more like (hums), like more in my head, but, like I can hear what's going on around me. There's some other interesting things in here. So you can actually change the sound signature of the earphones according to your hearing. So there's like a tuning thing called HearID. So it tests all different frequencies. This one's really painful. Personalized earphones, neat. You can also adjust the controls, so they have touch sensitive controls, you just touch the top. So double tap for next. Oh, I had said that I was gonna call you, didn't I? - [Jonathan] Yeah no, I was waiting over here. - Oh, that's funny, sorry Jono. Okay, okay, let's do the phone call now. Hey, sup Jono, how you doing? Obviously I'm in a pretty quiet, quiet environment right now. - [Andy] Aah, not quiet anymore. (mumbles) - Yeah, if Andy's making noise behind me then I guess we can get some idea if it picks me up all right. How are you doing? You could hear Andy, no problem. Got it, all right, thanks Jono. Quick pocket test. This is my, my earphones pocket, does fit, but it's a little snug. So getting it out, it's a little bit, I don't know, it's not too bad. It'll go in there, it'll go in there. Now I don't have it on here, but Soundcore apparently partnered with a streaming service called Lum. Not 100% sure how to pronounce it. So their jam is that they put more money into the pockets of artists and you guys can check them out. We're gonna have them linked in the video description. They're apparently adding the ability to stream from loom directly within the Soundcore app but it looks like that is not here yet. So let's just give these a little quick listen here. Man, I love it when manufacturers just include a proper freaking EQ. With this you can make pretty much anything sound to your liking. Okay, that is way more reasonable but still lots of capability in the lows. I think a lot of people are gonna like this sound signature, even if not quite my jam, I could probably even bring it down and touch more. In terms of active noise cancellation, I think it's fair to say that objectively, you're not getting something that's as strong as Apple's AirPods Pros, but they're double the price. And in terms of raw kick for the dollar, they do have ANC. It does work a lot better than not having ANC and they sound really good. And you can either buy them or try to win some at the link down below. Well, once we add it, once the giveaway is live for the LTT edition ones. Thanks for watching guys, make sure you're subscribed. I'm probably shouting so loud right now, sorry about that. Thanks again to Soundcore for sponsoring this first look at their Liberty Air 2 Pros.",
    "transcript_keywords": [
        "Liberty Air",
        "LTT",
        "pros",
        "Soundcore",
        "Yeah",
        "charging",
        "sound",
        "Jono",
        "LTT edition",
        "active noise canceling",
        "Air",
        "Andy",
        "noise",
        "pretty",
        "active noise",
        "AirPods Pros",
        "noise canceling",
        "Liberty",
        "earphones",
        "terms"
    ],
    "transcript_entity_values": [
        "AirPods",
        "Liberty Air 2 Pro",
        "Six",
        "seven hours",
        "Anker",
        "100%",
        "three",
        "the AirPods Pros",
        "up to three hours",
        "130",
        "Andy",
        "ANC",
        "nine",
        "air AirPods",
        "second",
        "LTT",
        "Liberty Air 2 Pros",
        "Jono",
        "first",
        "Soundcore",
        "26 hours",
        "Andy] Aah",
        "15 minutes",
        "EQ",
        "six",
        "2",
        "Lum",
        "Apple"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "ORDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}