{
    "id": "Bb6eCS7GEsw",
    "title": "Sony's New Earbuds Are Bite-Sized Noise Killers (With A Catch)",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-06-30T18:56:56Z",
    "video_url": "https://www.youtube.com/watch?v=Bb6eCS7GEsw",
    "category": "Science & Technology",
    "tags": [
        "sony wf-sp700n review",
        "wf-sp700n true wireless earbuds",
        "wf-sp700n vs airpods",
        "best wireless earbuds 2018",
        "bluetooth earbuds 2018",
        "bluetooth earbuds anc",
        "acoustic noise canceling",
        "mrmobile",
        "michael fisher"
    ],
    "views": 202276,
    "likes": 4743,
    "comments_count": 578,
    "description": "Summertime is no time for over-ear headphones  so when Sony asked me to review its new truly wireless WF-SP700N buds, the timing was perfect. Theyre pretty good sport earbuds, with acoustic noise canceling and some very smart sound features  but they make some pretty big compromises too. Join me for the MrMobile WF-SP700N review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S WF-SP700N REVIEW]  MrMobile's WF-SP700N Review was produced following six days with a WF-SP700N review device provided by Sony. It was tested with a BlackBerry KEY2 review device using the Sony Headphones app.   [PRODUCTS IN THIS VIDEO]  Sony WF-SP700N Earbuds:    [MUSIC IN THIS VIDEO]  Rule the World by Gyom, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4qf",
        "https://www.premiumbeat.com/royalty_free_music/songs/rule-the-world",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "(lively electronic music) - [Reviewer] Summertime is no time for over ear headphones. So when Sony asked me to review its new wireless buds the timing was perfect. This company's not much for catchy names, so these are called the WF-SP700N. Despite that moniker, they're pretty good sport earbuds, but they make some pretty big compromises, too. Let's start off with promises kept. Sony says these are for workin' out with and they're rated IPX4 for water resistance, so neither sweat nor rain should bother 'em. The in-ear gels are color-coded, which makes sizing easier and they keep the buds firmly anchored in your head once you figure out how they twist lock into place. But they did start to ache after a few hours, but that's the case with all earbuds in my experience. And you'll definietely be taking 'em out at least every three hours. More on that shortly. The biggest deal here is acoustic noise canceling, which you don't see in a lot of earbuds. This eliminates loud background noise. Sony is awesome at this tech on its over ear headphones and while it's not quite as effective on earbuds, the fact that the gels totally seal off your ear canal helps make up the difference. With noise canceling activated you can really take in the EXTRA BASS all caps trademark. But seriously, the sound is solid. And you can use Sony's Headphones app to customize that sound with an EQ. As much as I love the noise canceling though, my favorite feature might be the option to turn it off because you're gonna wear these outside. You don't wanna be totally disconnected from the world around you, so you can use one of two ambient sound modes that pipe in a little bit of outside noise under your music. This is super smart and everyone should be doing it. One thing every other company is doing with their truly wireless earbuds is bundling a carry case with a battery and Sony is no different. Here's where we start to ease in to disappointment territory folks. The case feels a bit cheap, and it's a little bulky for a pocket. The gel arms on the buds make docking them awkward at times and the case charges using a Micro-USB connection which Sony says is still much more common. Well maybe, but if you have a modern phone that uses USB-C, you need to carry an older cable around, too. And even BlackBerrys have USB-C these days. Back to the buds, their buttons are a little awkward to press and neither one has a volume control and finally, if you make or take calls on these things you'll only get sound out of one channel. The biggest complaint I have though is battery life. The buds are rated for up to three hours between charges and I averaged about two and a half before I had to throw 'em back in the case for a 90 minute recharge. That's just not convenient. And it's not just that I'm spoiled by the 20-hour battery life on over ear headphones. My colleague Russell Holly who helped me film portions of this review was getting at least double the endurance from his Jabra Elite 65ts. Of course those don't have active noise canceling. That's the question you've gotta answer if you're cross shopping these buds. Will you be able to charge them often enough, or keep your workouts brief enough to make the presence of noise canceling worth the sacrifice in battery life? For me that's gonna be a no, but if you feel differently, these are on sale now for $179. Check the description for a link. Folks, if you use Bluetooth earbuds I wanna hear which ones are your faves. Drop a line in the comments and let me know which ones you'd recommend for someone trying to free himself of slick and sweaty summer over ears. Please subscribe so you don't miss the next video. Until next time thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "noise canceling",
        "Sony",
        "noise",
        "earbuds",
        "ear headphones",
        "buds",
        "canceling",
        "case",
        "make",
        "headphones",
        "ear",
        "sound",
        "battery",
        "Sony Headphones",
        "battery life",
        "start",
        "Sony asked",
        "Sony Headphones app",
        "hours",
        "life"
    ],
    "transcript_entity_values": [
        "the WF-SP700N.",
        "BlackBerrys",
        "USB-C",
        "summer",
        "20-hour",
        "a few hours",
        "179",
        "about two and a half",
        "One",
        "these days",
        "two",
        "90 minute",
        "EQ",
        "Jabra Elite",
        "Micro-USB",
        "up to three hours",
        "Russell Holly",
        "Sony",
        "one"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}