{
    "id": "bb7_nMivMjM",
    "title": "Huawei Mate 20 Pro Hands-On: The Phone I Crossed An Ocean For",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-10-16T13:30:24Z",
    "video_url": "https://www.youtube.com/watch?v=bb7_nMivMjM",
    "category": "Science & Technology",
    "tags": [
        "huawei mate 20 pro review",
        "huawei mate 20 pro hands on",
        "huawei mate 20 review",
        "huawei p20 pro review",
        "huawei",
        "mrmobile",
        "michael fisher"
    ],
    "views": 1073996,
    "likes": 17233,
    "comments_count": 2238,
    "description": "Sponsored by Audible. Go to  or text MRMOBILE to 500500 to get a free book and 30 day free trial!   [HUAWEI MATE 20 PRO HANDS-ON]  True story: Huawei offered twice to fly me to London to spend a week with the Mate 20 Pro ... and each time I told them thanks, but October is much too busy. Then I actually got to see the Mate 20 Pro at an early briefing in New York City and halfway through the meeting I told them I'd changed my mind. Because when a company builds this much camera capability and this many features into a phone that won't be sold in the United States ... a week spent with it in a market where it *will* be sold is the best way to understand it. (That's my official answer, anyway. My unofficial one: I think the Mate 20 Pro may have the smartphone camera I've been waiting for all my life. I needed to put it to the test.)  Those camera tests will be included in the full Mate 20 Pro review; be sure to subscribe using the link below so you don't miss it. In the meantime enjoy the early look after a few hours with the phone in this Hands-On, and don't forget to get Android Central's take too!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S HUAWEI MATE 20 PRO HANDS-ON]  MrMobile's Huawei Mate 20 Pro Hands-On was produced following several hours with several Mate 20 Pro review devices at media briefings in New York City and London. Preproduction devices running prerelease software. All conclusions preliminary pending full Huawei Mate 20 Pro review.  Huawei provided travel and lodging for certain media attending the launch of the Mate 20 Pro, including MrMobile. No other compensation was sought or provided.   Additional footage courtesy Android Central. See the Android Central Mate 20 Pro Hands-On at    [MUSIC]  Neons by Hartley, available at Premium Beat:   E-Business by Olive Musique, available at Premium Beat:   Ultra Boost by Cymatix, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #huaweimate20pro #huaweimate20 #mate20pro #smartphones #android #tech",
    "description_links": [
        "http://www.audible.com/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.androidcentral.com/huawei-mate-20",
        "https://www.premiumbeat.com/royalty-free-tracks/neons",
        "https://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "https://www.premiumbeat.com/royalty-free-tracks/ultra-boost",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- This video is brought to you by Audible. Almost a year ago in Las Vegas, Huawei launched the Mate 10 Pro smartphone. And during the announcement, Executive Director Richard Yu went off script to lament the fact that it wouldn't be sold by U.S. carriers. He said Huawei being banned from U.S. shelves was a tragedy for American consumers who were thus forced to miss out on a great smartphone. Frankly, I thought that was a bit of a stretch. The Mate 10 Pro had good features but also many drawbacks at a price that I felt was pushing it at the time. Well, what a difference a year makes. The Mate 20 Pro costs even more than the Mate 10 Pro but it's also such a compelling product that it really is a shame it won't be coming to America. From the launch event in London, I'm MrMobile and this, this is probably my next phone. (upbeat music) First, I wanna lay something out. Getting early access to the Mate 20 Pro has meant a week-long trip to London for a bunch of us media folks. Nice, nice! So, it's totally natural for you to ask how much of my enthusiasm is related to that free trip. But the reality is, this is one of the busiest smartphone seasons I've ever seen, and I said no to this trip twice because of that. It was only once Huawei briefed me on this phone in New York that I saw just how impressive the device is. And I asked for more time with it so I could film it properly. Coming to London was the best way to do that, even though it meant pushing back some of my other videos on the schedule and reducing a lot of content in suboptimal conditions. This ain't no vacation, folks. So why is the Mate 20 Pro worth all the hassle? Well, let's start with the battery. It's 5% larger than last year's already huge pack in the Mate 10 Pro. Still one of the longest lasting phones I've ever used. It comes with a 40 watt supercharger in the box that shoots it from zero to 70% in half an hour. Where last year's glass back was just an opportunity to scratch your phone up, this year, it's justified. Huawei has finally given us wireless charging. And if that's not enough to stoke your chi, you can flip a switch in the settings to reverse that wireless charging. Yes, that means your phone becomes a charging pad for another phone. Inefficient? Yes. Huge gimmick? You bet. But you've gotta admit. It's also pretty awesome. Also awesome, the potential of the three cameras on the back. This is similar arrangement to Huawei's P20 Pro. The primary camera is a 40 megapixel sensor, which uses pixel bending to enable night shots that just you can't get from any other phone. Next to that, a 3x telephoto zoom with optical stabilization for long distance captures. And next to that is something new for Huawei. The company's usual monochrome center has been swapped out for a camera with an ultrawide lens. This is the thing I've been begging manufacturers to adopt ever since LG hooked me on it years ago. It opens up so many options for photography, and I'm very eager to try it in concert with Huawei's night mode. I'll be taking a lot of sample photos with this phone this week and make sure you're following me on Instagram so you can get an early taste of what it's capable of. In less awesome news for some of you, the 2K OLED screen is topped off by a notch and bottomed out by a small chin. The notch isn't just there for the selfie camera as on so many phones but also for Huawei's new face-scanning hardware, which should make face unlock more secure than non-Android phones that only use the camera. If you're like me and you prefer a fingerprint sensor, you've got that too. No, not on the back. No, not below the display but beneath it. This is the first phone I'll be using with an optical fingerprint sensor built into the screen. And while I can already tell you it's not as fast or accurate as a traditional one, I love that it's made it possible to have the same-sized bezels above and below the screen. And while we're talking about looks, all these stuff is packed into a much slicker chassis than last year's. It's available in five colors including Huawei's trademark, Morpho Aurora. (laughs) It's a ridiculous name, but just look at this thing. That said, I do hate how glass picks up fingerprint. And Huawei has a solution there too. The hyper optical blue and green trims have a very light texture applied to their glass backs, which makes them more resistant to fingerprints and easier to grip. I do wish that finish could've come to the gradient version, but apparently, that's easier said than done. I'll wrap up with concerns, but even many of these have mitigating positives hiding underneath. For example, I'm never happy to see Huawei's heavy user interface. But at least it's built on the latest version of Android, which is more than I can say for the last three phones I've covered. Of course, keeping that phone updated over the next two or three years, well, that's another story. Also, this phone takes the unusual step of adding a new storage card format, Nano Memory. Basically a Micro SD card but in the shape of a nano sim. It's probably gonna be tough to find these cards for a while but it's better than not having any expandable storage at all, which has been the case up til now. I guess that just leaves the lack of a headphone jack which itself is softened somewhat by the adaptor included in the box. The biggest worry I have is of course the price. Huawei wouldn't spill that detail before this video was completed but let's have a little fun with it. If you stick with me through this quick break, I'll tell you what I would pay for the Mate 20 Pro. And speaking of great Mates for those who stay mobile, this video is brought to you by Audible. And with all the traveling I do, sometimes it's more convenient to take in books through my ears instead of my eyes. Lately, I've been laughing my way through Riding Rockets, an astronaut's autobiography that's hilarious as it is harrowing. You can just try a free sample if you don't believe me. And if you like it, you can get it for free. Just visit audible.com/mrmobile or text MrMobile to 500-500. Audible members get a credit for a free book every month. And if you don't like a particular book, you just exchange it. No questions asked. Now, members also get two Audible originals monthly too. Wouldn't it be great if we all just listened more? Try Audible free for a month and claim your free book. Go to audible.com/mrmobile or text the word MrMobile to 500-500. And thanks to Audible for sponsoring this video. I'll get right to it. If Huawei came out and said the Mate 20 Pro costs a thousand bucks, I'd say there's a good chance it'll be worth it. Now, look, as a rule, I don't think four-figure smartphones are justified. In fact, I've only said that about one other phone. The Samsung Galaxy Note 9. But if the Mate 20 Pro delivers on its promises, it will bring almost everything the Note 9 does, except the S pen, and it'll probably beat the Samsung in battery life and low-light shooting. That said, competition is stiff with the feature-packed Razer Phone and Google's excellent Pixel 3 both at $799 and the OnePlus 6T expected soon for potentially much less. I'll take all of those into account when I give the Mate 20 Pro the full review treatment soon. And I won't be pulling any punches because I mean it when I say this could be the next phone to live in my second pocket. Please subscribe to the MrMoble on YouTube so you don't miss that review and be sure and take a look at Android Central's coverage as well. Until next time. Thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Pro",
        "Mate",
        "Huawei",
        "Executive Director Richard",
        "phone",
        "Las Vegas",
        "Audible",
        "year",
        "Pro costs",
        "Executive Director",
        "Director Richard",
        "phones",
        "free",
        "Pro smartphone",
        "launched the Mate",
        "London",
        "MrMobile",
        "great Mates",
        "back",
        "camera"
    ],
    "transcript_entity_values": [
        "Huawei",
        "First",
        "5%",
        "Android Central's",
        "500-500",
        "last year's",
        "a thousand bucks",
        "Instagram",
        "Almost a year ago",
        "Nano Memory",
        "799",
        "week-long",
        "Samsung",
        "the next two or three years",
        "a month",
        "American",
        "non-Android",
        "MrMoble",
        "Pixel 3",
        "half an hour",
        "us",
        "four",
        "America",
        "three",
        "10",
        "the Mate 20 Pro",
        "40 watt",
        "Razer Phone",
        "this year",
        "about one",
        "Richard Yu",
        "20",
        "2",
        "first",
        "monthly",
        "five",
        "jack",
        "Morpho Aurora",
        "U.S.",
        "40 megapixel",
        "Micro SD",
        "3x",
        "two",
        "MrMobile",
        "Google",
        "zero to 70%",
        "The Samsung Galaxy Note 9",
        "Riding Rockets",
        "Las Vegas",
        "the S pen",
        "second",
        "OnePlus 6",
        "P20 Pro",
        "LG",
        "New York",
        "MrMobile",
        "this week",
        "London",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "PERCENT",
        "FAC",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "NORP",
        "ORG",
        "PERSON",
        "PRODUCT",
        "TIME",
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "GPE",
        "EVENT",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG"
    ]
}