{
    "id": "bbTKxC4eveI",
    "title": "Opus No. 1 - This Song Has Been Played More Than Despacito",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-01-07T16:38:17Z",
    "video_url": "https://www.youtube.com/watch?v=bbTKxC4eveI",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "cisco",
        "Opus #1",
        "opus number 1",
        "opus number one",
        "opus no 1",
        "opus",
        "cisco hold music",
        "opus no. 1",
        "hold music",
        "phone music",
        "voip",
        "cisco default hold music",
        "music on hold",
        "darrick deel",
        "tim carleton",
        "despacito",
        "cisco systems inc.",
        "on hold",
        "call waiting",
        "phone",
        "music",
        "technology",
        "Despacito"
    ],
    "views": 141583,
    "likes": 4816,
    "comments_count": 333,
    "description": "You've definitely heard this song, even if you might not realize it.   How the Bat Bomb Almost Won World War 2:  How Scooters Are Taking Over the World:  The $2 Billion Solar Death Ray:  How Sears Invented Amazon:  This Is How Not to Win the Lottery:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/UG5Sd0mWmfk",
        "https://www.youtube.com/watch?v=sQkPqPsik9o",
        "https://www.youtube.com/watch?v=ZR_oGbx8O8E",
        "https://www.youtube.com/watch?v=FqECAt7OKz4",
        "https://www.youtube.com/watch?v=j_db5Um1ELM",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys! This is the most popular song that you've never heard of. Now, almost everyone has had the experience of sitting on hold. You watch as the minutes, and later hours, tick by, as someone finally will tell you that your washing machine is in fact broken and that they're not going to take a return. However, have you ever wondered why the hold music you listen to always seems so familiar? (\"Opus No. 1\" by Tim Carleton) Cast yourself all the way back to the 1950s and it was a very different experience to be on hold. Not only were you dealing with a switchboard operator who would basically just jump on the phone every few minutes to make sure that, yes, you are still on hold, but other than that, it was pure silence. That is, until 1962, when a factory had improper wiring, with their phone line touching a steel girder, which then functioned as a radio antenna. All of this led up to the fact that when you called and were put on hold, instead of hearing silence, you heard the radio. It sounds crazy, but this was actually the very first time that hold music was used. The 60s were a very a very different time. The owner of the factory, Albert Levy, initially thought that it was a problem. However, amazingly enough, people preferred to listen to actual music as opposed to pure silence, and he quickly capitalized on that. By 1966, he had it patented, and by then, the era of hold music was on us. Now, most people would agree that hearing something is better than nothing, but there's actually a lot of psychology that goes into making just the right hold music. And a lot of that has to do with why a specific track has been played many, many times. Companies will spend a lot of time and money picking just the right hold music, which actually has been shown to make some serious differences to things like higher customer satisfaction, higher sales, and, well, less insanity and anger when someone finally actually gets through to the person they're trying to talk to. If you can't tell, I don't like being put on hold, but I don't think anyone does, so. Now, you might think the simple approach is just to play popular music. But there's a lot of issues with that. First of all, it's easy to tell how long you've been on hold when you've heard the sixth different song. There's also going to be copyright and licensing issues, and most importantly of all, a lot of music just doesn't sound very good when it's compressed over the phone. Generally speaking, companies pick something that's poppy and upbeat, but a little bit on the neutral side. You gotta think that there are tons and tons of companies out there. Sure, something that's gonna be exciting and fun might work for, say, a dance company, but it definitely wouldn't work for a funeral home. Which brings us to Opus No. 1, the song that has been played billions and billions of times. I mean, come on, you've heard this track before on the phone, right? In the early 90s, a relatively new company called Cisco was getting on the scene. Now, naturally, they wanted to have some default hold music to ship with their phones. Do you see where I'm going here? Over 65 million Cisco units have been shipped worldwide, all of them loaded up with Opus No. 1 as default hold music, and you better believe that a lot of companies have never changed that. Cisco claims that over a million people are put on hold with their systems every day. Now, if you average that out over 30 years, it is easy to assume that Opus No. 1 has been played back about 9 billion times. To put that in context, the most popular video on YouTube right now, Desposito, has 5.4 billion views. Now, I guess it's not a completely fair comparison, as supposedly those people actually chose to listen to Desposito, but I know I definitely didn't choose to listen to Opus No. 1 when I was on hold for an hour last week, so. So where did this unbelievably popular song come from? Well, Opus No. 1 was actually written and recorded by a 16-year-old named Tim Carleton back in 1989. Carleton recorded the piece on a 4-track tape recorder in his parents' garage. You know, where all of the most popular pieces of music in human history are made. For over a decade, only two people had a copy of Opus No. 1. Carleton, and his friend, Darrick Deel, who just so happened to be a head engineer of the phone system over at Cisco. When Deel started looking for hold music, Opus No. 1 actually ended up being a really perfect fit. The song is upbeat but mellow, it's easily loopable, which is important when people are listening to this for long periods of time. It's also kind of catchy. I mean, Matt's been listening to it for the last three hours straight. Despite having just as much exposure, if not more, than huge bands like The Beatles, surprise, surprise, the hold music did not make Tim Carleton a household name. In fact, Carleton licensed the song to Cisco for free. So the guy who made one of the most popular songs of all time has never seen a single cent for it. So the next time you're sitting on hold and you hear the sweet, sweet sounds of Opus No. 1, feel assured that you're actually listening to one of the most popular pieces of music ever created by humans.",
    "transcript_keywords": [
        "hold music",
        "hold",
        "music",
        "Opus",
        "popular",
        "Carleton",
        "Cisco",
        "default hold music",
        "lot",
        "time",
        "song",
        "people",
        "phone",
        "Tim Carleton",
        "listen",
        "heard",
        "default hold",
        "put",
        "Companies",
        "put on hold"
    ],
    "transcript_entity_values": [
        "a single cent",
        "1989",
        "Darrick Deel",
        "one",
        "5.4 billion",
        "1966",
        "billions and billions",
        "1962",
        "Desposito",
        "Albert Levy",
        "the last three hours",
        "the 1950s",
        "only two",
        "Cisco",
        "30 years",
        "Matt",
        "Beatles",
        "YouTube",
        "every few minutes",
        "Opus No.",
        "Carleton",
        "over a million",
        "sixth",
        "later hours",
        "Over 65 million",
        "16-year-old",
        "an hour",
        "4",
        "last week",
        "over a decade",
        "Opus No.",
        "first",
        "Deel",
        "the early 90s",
        "every day",
        "1",
        "Tim Carleton",
        "First",
        "Cisco"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "GPE"
    ]
}