{
    "id": "BdC_0xIqmMg",
    "title": "Totally Clear Razer Phone 2!! - Some are better than others...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-10-31T13:51:43Z",
    "video_url": "https://www.youtube.com/watch?v=BdC_0xIqmMg",
    "category": "Howto & Style",
    "tags": [
        "Razer Phone 2",
        "Clear razer phone 2",
        "razor phone 2",
        "razer phone",
        "razer phone 2 review",
        "Transparent razer phone",
        "Razer phone 2 teardown",
        "transparent razer phone 2",
        "clear razer phone",
        "gaming phone",
        "best gaming phone",
        "smartphone",
        "iPhone",
        "android",
        "mobile phone",
        "tech",
        "clear tech"
    ],
    "views": 1147639,
    "likes": 29306,
    "comments_count": 1498,
    "description": "The Powerful Razer Phone 2 looks good from the outside. The only color available right now is black. But what if the Razer Phone 2 was clear? A totally transparent Razer Phone 2 would be perfect, since gaming computers are clear... Why not make gaming phones clear? The only problem is... once the back coloring comes off, there is really nothing to look at inside of the phone. Yeah, you can see the wireless charging coil. But it looks rather bland... That might just be because the last phone I made clear was the colorful Pixel 3, and its just hard to follow that up.   Watch the Razer Phone 2 Durability test HERE:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your own Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:  Music is from HERE:     *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/ZCc3ZsUM2dg",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://share.epidemicsound.com/pcGGf",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything"
    ],
    "transcript": "Not all clear phones are created equal some turn out way better than others. And this is a story of one clear Razer Phone that didn't turn out so well. Let's get started. [Intro] So usually when I get brand new phones, like this Razer Phone 2, I'm one of the first people to try and take them apart. Since manufacturers generally frown upon dissecting phones, or fixing your phone yourself, there is zero instruction on how it's done. Initially I thought that this year's Razer Phone would be similar to last year's Razer Phone, and we would initiate the teardown from the large earpiece. Turns out, that earpiece doesn't have any screws behind it this year, and it's completely unnecessary to remove. So let's just plop that grille back into place and pretend it didn't happen. Perfect. Let's start over. To open up the Razer Phone 2 we start from the back using a heat gun. On this phone, the glass is a totally flat slab. Glass is still fragile, of course, so I'm being extra cautious around the corners, using my razor blade to slice into the Razer Phone slightly ironic. The razor cuts the thin band of watertight adhesive around the inner edges. Once it's all sliced, the full slab of glass can pull away from the device, revealing the large black wireless charging coil in the center, and the wide LED pad for the Razer snake logo right below those dual cameras. At first glance, it's not as interesting inside as some of the other clear phones I've made, but maybe this minimalist Razer vibe will still turn out good. I'll remove the dual cameras lens bracket that has these same black adhesive holding it to the rear glass panel. Then the black material applied to the underside of this glass appears to be the same scratchable coating we saw on the Pixel 3. Meaning that instead of pulling it off in one satisfying layer, the whole thing needs to be scratched off, slice by slice, bit by bit. I'm going to try to leave the Razer logo intact this time around, since the glow effect of the LEDs on the back panel is kind of what makes this phone stand out. It looks like the snakes are stuck on with the same fragile coating as the rest of the glass, so cutting around them is going to be rather tedious. But it does give me plenty of time to think of more super funny phone jokes like this one: Why did the cell phone start wearing glasses? Because it lost all of it's contacts. The hardest part of this whole project is the logo in the center, trying to keep that clean and neat while scratching off all the black paint around it. The good news is that the surface of the glass panel is harder than my razor blade, so there are no razor scratch marks on the surface of the glass. My fingers, on the other hand, are softer than the razor blade, but who needs all 10, right? In the end though, I was relatively successful in clarifying the back glass panel. It looks pretty slick...and no slices on my fingers. Thumbs up for that. I just wish the stuff underneath the glass, inside the phone was more interesting to look at. A little bit of glass cleaner to get rid of any smudges. Then I'll set the camera lens into place directly over the cameras, and then rest the glass panel back into the Razer. It's definitely unique looking. I think this is one of those cases where a pure transparent glass back might not be the best option. It might just need a more semi-transparent gradient blend of black and neon green on the glass. And, of course, a more interesting looking wireless charging coil. The Razer Phone might just be one of the few phones that doesn't look good naked. What do you think? It's pretty hard to follow up with the fantastic looking Pixel 3. Maybe I'll just put one of my extra skins on the back to make it look normal and pretend it never happened...again. Nailed it. I'll still be tearing down the Razer Phone 2 to check out the inner liquid cooling vapor chamber and to see if they upgraded their tiny vibrator this year. Hit that subscribe button if you haven't already. Come hang out with me on Twitter and Instagram. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Razer Phone",
        "year Razer Phone",
        "clear Razer Phone",
        "Razer",
        "Phone",
        "glass",
        "clear phones",
        "Razer Phone slightly",
        "year Razer",
        "phones",
        "glass panel",
        "clear Razer",
        "back",
        "created equal",
        "razor",
        "black",
        "panel",
        "clear",
        "back glass panel",
        "glass panel back"
    ],
    "transcript_entity_values": [
        "zero",
        "Glass",
        "10",
        "Pixel 3",
        "year",
        "Razer Phone",
        "last year's",
        "this year",
        "Razer",
        "Twitter",
        "Razer Phone",
        "Razer",
        "one",
        "first",
        "Instagram",
        "the Razer Phone 2",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}