{
    "id": "bDgolMkLREA",
    "title": "I hate giving Apple my money... - Apple AirPods Pro 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-10-04T19:01:04Z",
    "video_url": "https://www.youtube.com/watch?v=bDgolMkLREA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 2089129,
    "likes": 59284,
    "comments_count": 3341,
    "description": "Get a dbrand skin or grip for your new Airpods Pro 2 today at   AirPods Pros were some of the most popular wireless earbuds available on the market for their ease of use, strong ANC, and decent sound quality, but now Apple has released their next generation that's apparently better in almost every way. Does Linus agree with these claims, or is Apple falling behind the competition?  Buy Apple Airpods Pro 2:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 The only option? 0:07 Why AirPods Pros are so popular 1:25 Unboxing and design impressions 2:49 Sponsor - dbrand 3:37 The difference between Gen 1 and Gen 2 5:44 Trying out the touch controls 6:55 Comparing new vs old Transparency/ANC modes 9:38 Features to make getting good audio easier 11:10 Listening to music ft. more ranting 12:13 AirPods have competition 13:00 Outro",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/vXkCpV",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- I don't know. It doesn't matter because, me, I'm gonna buy them anyway. I mean that's the Apple way innit? It's time for Linusl sequester tips. I have intentionally learned absolutely nothing about the AirPods Pro Gen Twos because, if you guys been following for a long time, you probably already know I'm a daily driver of the original AirPods pros in spite of the fact that Apple insists on treating me like a second class citizen because I have the audacity to daily drive an Android phone with them. That's right. I can't adjust product settings, can't monitor my battery life without clunky third party apps, and cannot even update my firmware because, and this is why, I didn't buy enough Apple products. But, dammit, nobody does it quite as well as Apple does. And the original AirPods Pros have this magical combination of an extremely sleek and easily pocketable case, decent battery life, outstanding active noise cancellation, good enough sound quality, and the best comfort that I have personally ever experienced in an in ear headphone. This is a big deal for me because I have a bit of a unique use case. I actually sleep with my earphones in and it's a habit that I picked up back when we had a young child and it was my wife's job to take care of the baby and my job to go to work the next morning. I needed to be able to sleep and now it's a crutch that I just rely on quite frankly. I'm gonna open things up in a totally uncharacteristic manner by criticizing Apple. Apple, why the are these things still white? We're not talking like something that goes in your pocket or that goes in a case and that is never gonna see the dirt and grime of the real world. Look at my AirPods. Look at that. Even ignoring the like ear goo that's actually inside it. It's just yellow now. It's gross. You can really tell when you hold it up to the new ones. This speaker on the case, that is an awesome feature. Whether I'll actually be able to use it or not, because I don't daily drive an iPhone, well that's a completely separate conversation, isn't it? But at least for people who do use iPhones, you can use the find my app and beep the case which would be pretty great for me because this is actually my fourth set of first generation AirPods. I had one break, it developed kind of a rattle in one of the earphones, then I lost that set, then I lost another set. Now I'm on my fourth. Yeah, everything stains it. Look at the color of my case compared to this case. Why? Because I wear blue jeans. How dare you wear blue jeans. I want black AirPods. - [Andy] Dbrand. - They're probably the sponsor today, aren't they? Now seems like as good a time as any to talk about Dbrand's grip case. It's super grippy. What? No way. Grip case is grippy? Wow. It's wild. Also it stays on with the adhesive for the top part and then a nice snug fit for the bottom. You can still access your pairing button right back here. You still got holes for your speaker and all that down here on the bottom, you can see your indicator light here on the front and it basically just makes them more impact resistant which who could say no to that, right? They may be chaotic, but you can't say they have bad taste. I really like this. This is their new, what is this called? Pallets collection. Always coming up with new ways to get us to buy the same sticker aren't you? Smart. You can check them out at dbrand dot whatever bull they put at the end of it. Probably something rude. It's in the video description. First, let's crack open the dock and talk about the differences between second generation AirPods Pros and the originals. It feels like they're a little bit heavier. If they are, it's not much. They come in at the same price. 250 US dollars. So these are not flippin cheap. They offer six hours of listening, five and a half with spatial audio and head tracking, compared to the previous gen, which got four and a half hours with ANC on and five with ANC off. The case actually includes more recharge than the original case. They get you 30 hours versus just 24. They have the same IPX4 sweat and water resistance and blast from the past. Is that a spot to hang your little, your little jewels and little characters off of like, like classic cell phones? That's what those little loops are for, right? While we're at it, can we bring back the little tiny backpacks that are like this big and have the little skinny straps, right? - [Bell] Those never left. - They never left. You know what else never left? Buying the LTT backpack, which is a little bigger, but also holds a lot more stuff. Guys, check it out, lttstore.com. As you guys can probably imagine, I drop my AirPods fairly frequently. I wonder if the magnetic strength of the top latch is a little stronger maybe. Magnet so it shouldn't affect much. Nope, that seems basically exactly the same. How often does Apple do this? Same price, bigger battery? It's not noticeable, but either way I mean I consider that a W. I did hear that, holy crap, I heard they're not backwards compatible. Holy schnikes, was that ever harder to get off? Like that's how hard it is to get my old ones off. Is that a larger driver? Very hard to tell. The mesh looks like the same size, but either way, let's go ahead and try and put my old one on here. I'm just curious. Looks like if you really wanted to use old ear tips you could. Oh crap, which one's which now? Okay, here's the yellowed one. To be clear, it's never been a problem for me. I thought that their, you know, proprietary ear tips were gonna be like a big issue like and it's all is pretty anti-consumer one way or another but I have never lost an ear tip on these and I've lost a lot of ear tips over the years. They've got one inward facing microphone, a skin detection sensor, a motion sensing accelerometer, a speech detecting accelerometer and touch controls. Oh god, are they touch controls or is it still squeeze? Please tell me It's still squeeze controls. - [Bell] Both. - Both. When I lay on a on a pillow sometimes touch controls can start controlling things. So in addition to the squeeze controls, which you can use for Siri or to change your noise cancellation profile, you can adjust volume by sliding on the stem. Oh, okay it's in steps. So you kind of, you kind of pet them. Hello little ear. Would you like to listen to it a little bit softer? I would not describe that as the best. They use apple's new H2 headphone chip, so theoretically that'll give us like better audio performance, better spacial audio, that sort of thing. Not super into the whole spatial audio thing. I don't really care. And then in the charging case you've got their U1 chip, like ultra wideband or whatever it's called. Basically it helps you find it. Oh it's also MagSafe now and my understanding is you can charge this thing on the Apple Watch charger now which always was like shockingly stupid to me that you couldn't do. Is that right? Has anyone confirmed that? Confirmed. Sick. It's time to listen to both of them. Aw man I am super excite for the active noise cancellation because Apples was already at or among the best and they say it is two times better. Ooh, temporarily share audio. Now sharing. Ah, sick. Man, the first gen ones ANC is so good that it's just like goodbye world. Can it really be that much better? Hmm, okay I've got them in transparency mode right now. They definitely sound different. I don't know that I would say that they sound more natural. There's always gonna be a little bit of unnaturalness when you're trying to pick up your own voice in a microphone and then play it back into your own ears. Like tell me about the weekend - [Bell] Ah, I slept for 12 hours over the weekend. - No, no the musician. God, I don't care about your life. No, I'm kidding. It's just because you were listening to The Weekend on here that I was inspired to make a mean joke. Yes, I would like to hear about your weekend. He's crying. - [Bell] My, my weekend was good. Been playing Red Dead Redemption 2, it's a pretty good game. You get to be a cowboy. Love to be a cowboy. - My own voice sounds a little unnatural. I gotta say talking to someone else, wow, that is very close. That's pretty cool. Okay, ANC time. Goodbye world. - [Andy] Hi Jake, how was your day? - [Bell] Yeah, I'm talking to my normal volume that I was talking at before. - Now that's funky. Here's the thing, active noise cancellation is not designed for sudden noises. It's not really designed to block out speech from an individual. Drone of speech in the background in a cafe, yeah, sure, no problem. But an individual talking, it's not really made for that. It's more for like bus engine things like that. Like I'm underwater and you're above the surface like you're far away and like kind of Charlie Brown, you know? Womp womp womp womp womp womp womp womp. Okay. - [Andy] Hi Jake, how was your day? - [Bell] Yeah, I'm talking again at the same volume I was talking at before to see if I still sound like a Peanuts character. I'm an adult now. - Oh yeah, you an adult for sure. Huh, these are looking like a fairly mighty tool in my arsenal right now. Better in ear detection. I never had issues with the first gen optical sensors, but apparently the skin detection sensors are more reliable and help with battery life, so that's cool. - [Bell] Something can't be cool that has loss less... - Holy crap, I can barely hear you. Just a gosh darn second here. Can I adjust that? So noise control or Siri and you can toggle between noise cancellation, transparency and off. I don't know if you were always able to toggle between all three, but that's super cool. Apple now has a much more robust suite of tools at your disposal to make sure that you're going to get a good listening experience because it's as important to pick headphones that are good for you as it is to pick good headphones. So they've got their personal spatial audio thing where you can use the true depth front facing camera to take like a picture of your ear and it'll create a custom EQ for you. Personally, I'm not that into that kind of stuff. But this is a great tool that helps you select exactly the right ear tips for your ears that is enhanced by the inclusion of a new size of extra small ear tips now. So they still ship with the medium, but they come with small, large and extra small which are gonna be an absolute game changer for you if you are a small eared individual. Cause it affects everything. Noise cancellation performance and acoustic quality. There does not appear to be a noise cancellation intensity setting. Apple, I know you're not a fan, but please, just because I'm the one saying it doesn't make it a bad idea. Could you please have an intensity slider on the noise cancellation? Why is this hard? No, it should, you should be able to find the case even if you have the AirPods in your ear. That's the whole point of having the speaker separately, I would think. Shut up train. How many billions of dollars a year do you guys spend on RND again? What order is this in? It's not by device type, it's not alphabetical. You know what? I wonder if it's because I was not signed into my Apple ID when I paired them. That seems like a possibility. Also, didn't I just click Bluetooth settings? What happened to it? Black or white? Michael Jackson's vision. You know, I was worried when they talked about the enhanced bass that we would end up with a super V-shaped curve and they were just gonna be like outta control bass heavy. But that's not the case at all. They just rumble deeper. One of the most unappreciated benefits of active noise cancellation is that I am listening to this perfectly comfortable with great clarity at like 20% volume. That's awesome because I'm not gonna be distracted by everything around me that I'm trying to drown out by turning up my headphones causing irreparable ear damage, right? These sound great. Auto pause and play super responsive. There is no question in my mind whatsoever, but might as well listen to them back to back. I always thought my AirPods Pro ANC was so good, but now now that I've heard the difference, I'm like, oh yeah I can totally hear the HVAC. Way less defined bass. These were like I said, good enough. These might actually sound good. To be clear, there are some other products that have gotten really close. Sony's latest offering, what are they? The XM4s or whatever they are great, but the earphones are pretty bulky. The case is pretty bulky. They sound amazing and their ANC is excellent. LGs FP8s, they absolutely nailed the comfort. They nailed how lightweight they are. My two main issues with these is that the case is higher profile, which makes it a little tougher to slip in and out of the pocket, and they have a bit of a an idle battery drain problem that makes it so they're less likely if I don't use them for a few days to have a charge compared to Apple's excellent idle battery management. Yeah, I guess these are my new daily drivers until someone comes along and completely dethrones them, which I'd appreciate by the way, just hasn't happened quite yet. If you guys enjoyed this, you can check out our video on the Sony XM4s. They're a viable alternative even if ultimately I'm gonna keep giving Apple my money and subscribe to Short Circuit.",
    "transcript_keywords": [
        "Apple",
        "case",
        "Womp womp womp",
        "noise cancellation",
        "ear",
        "Womp womp",
        "AirPods",
        "good",
        "noise",
        "ear tips",
        "AirPods pros",
        "cancellation",
        "original AirPods pros",
        "Womp",
        "AirPods Pro ANC",
        "ANC",
        "active noise cancellation",
        "sound",
        "talking",
        "Yeah"
    ],
    "transcript_entity_values": [
        "AirPods",
        "four and a half hours",
        "250 US dollars",
        "24",
        "Apple Watch",
        "RND",
        "IPX4",
        "three",
        "a few days",
        "Charlie Brown",
        "the weekend",
        "One",
        "one",
        "20%",
        "Grip",
        "iPhone",
        "30 hours",
        "six hours",
        "Siri",
        "ANC",
        "weekend",
        "second",
        "LTT",
        "billions of dollars",
        "MagSafe",
        "Michael Jackson",
        "iPhones",
        "Dbrand",
        "The Weekend",
        "U1",
        "daily",
        "third",
        "Linusl",
        "first",
        "generation AirPods Pros",
        "Sony",
        "two",
        "AirPods Pro ANC",
        "five and a half",
        "Apples",
        "Android",
        "AirPods Pros",
        "12 hours",
        "the years",
        "Short Circuit",
        "H2",
        "Red Dead Redemption 2",
        "the AirPods Pro Gen Twos",
        "First",
        "five",
        "HVAC",
        "the next morning",
        "Apple",
        "today",
        "fourth"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "NORP",
        "EVENT",
        "PRODUCT",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "ORDINAL"
    ]
}