{
    "id": "bDHuvwwTnYc",
    "title": "Some things are more important than Technology...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-06-12T13:15:38Z",
    "video_url": "https://www.youtube.com/watch?v=bDHuvwwTnYc",
    "category": "Howto & Style",
    "tags": [
        "2020",
        "election year",
        "how to vote",
        "why to vote",
        "who should vote",
        "voting",
        "vote.org",
        "politics",
        "trump",
        "hillary",
        "fake news",
        "happy news",
        "democracy",
        "real change",
        "obama",
        "biden",
        "technology"
    ],
    "views": 601243,
    "likes": 52668,
    "comments_count": 8566,
    "description": "2020 has been pretty nuts. One way to take some control of the craziness is to vote:  it takes less than 2 minutes to register. Tell your friends and family. The only way we all get whats best for everyone, is if we all vote. In 2016 less than half of young people (ages 18-29) voted. And only 58% of our voting eligible population voted. When the people stay home... the people dont get what they want.   Vote.  HUGE thanks to everyone in the video! Jonathan Morrison:  Jon Rettinger:  Jacques Slade:  Marques Brownlee:  Neil deGrasse Tyson:  Judner Aura:  Joe Barksdale: (National Football League - Los Angeles Chargers)   Soldier Knows Best:  Justine Ezarik:  Austin Evans:  Safwan Ahmedmia:  Linus Sebastian:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   About the prints that flank Neil deGrasse Tyson: \"Black Swan & \"White Swan\" Artist Credit: Jane Kwatleematt Marston.  JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.vote.org/",
        "https://www.youtube.com/user/tldtoday",
        "https://www.youtube.com/user/jon4lakers",
        "https://www.youtube.com/user/kustoo/",
        "https://www.youtube.com/user/marquesbrownlee",
        "https://www.youtube.com/user/startalkradio",
        "https://www.youtube.com/user/UrAvgConsumer",
        "https://www.instagram.com/jbdale72/",
        "https://www.youtube.com/user/SoldierKnowsBest",
        "https://www.youtube.com/user/ijustine",
        "https://www.youtube.com/user/duncan33303",
        "https://www.youtube.com/user/SuperSafTV",
        "https://www.youtube.com/user/LinusTechTips",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So 2020 has been pretty insane. This is probably the craziest year that anyone alive has ever experienced. But, if you take a step back from the crazy for just a second, some pretty cool things have been happening. For example, we launched astronauts from US soil for the first time in 9 years. -[Johnathan] In 2020, Tesla released stats showing that even after driving over 200,000 miles, electric car batteries are still retaining 85-90% of their overall capacity which is pretty incredible. -[Jon] For the first time ever renewable energy is poised to take over coal in the US. -[Jacques] The Lakers finished number 1 in the Power Rankings before the NBA season was shut down. Zack...that's the kind of positive things we're talking about right? -I also remember the before times when sports used to exist. 2020 has brought around some really bad things like this global pandemic, which is unavoidable, but poor leadership makes bad problems much worse than they should be. And there is a way to be better prepared in the future. -[Marques] Look, voting might not be the sexiest thing in the world...to register and actually do, but it's the best we've got. Right? There are systems in place. There are people in place. There are representatives in place. And the only way to actually change, to actually bring about change, in those systems and of those people, and of those representatives, is to vote. -[Neil] We the people...what does that mean? It means our government has empowered it's citizenry to make the rules that we abide by. That only happens if you vote. If you don't vote, then it's They the other people who set your agenda. And is that what you really want? I don't think so. -[Judner] Although there will never be a perfect candidate, I'm going to be voting for someone who is working towards uniting Americans, not actively dividing them. I'm voting for someone who's confident enough to seek the counsel of those more knowledgeable than he is when making consequential decisions that affect American lives and lives across the world. In 2016 there were a lot of people who felt like their vote didn't matter and look where we are today. Each vote counts. -[Joe] When it comes to voting, the one thing that stands out to me is that someone had to die, or a group of people, a lot of people had to die in order for me to have that right. And I don't take that lightly. It's not that I feel that I owe those people something. The reality is people aren't just dying for anything, so it must be pretty important. -[Jon] As an independent, I've often found myself as a person without a party. When I vote this year, it'll be with my eyes and heart open. I'll vote for science, racial equality, and fiscal responsibility. Whoever you choose to vote for, just vote. -In 2016, only 46% of you guys, people watching this video ages 18-29, went out and voted. That's way lower than it should be. I'm not going to tell you who to vote for, but personally, I'm going to pick the guy who has a history of believing in science. -[Mark] And so look, I've been paying attention to everything going on these last few weeks, just taking everything in, breathing, and really looking at the situation that our country is in. And I know that in November is going to be my biggest vote that I've ever placed, and I hope that you feel the same way. And do know that you can help change just by voting in November. So let's make it happen. -[Joe] Martin Luther King Jr. said that our lives begin to end when we stay silent about the things that matter. Voting really matters. -[iJustine] There's so much change happening right now in this world and we need to continue that change and keep pushing forward. And to continue to make those changes one of the most important things that we can do is vote. That's how we can continue to make our voices be heard. -[Jon] If we want to have a future that benefits us, young people need to take control by voting. -[Austin] It's so easy to think that you don't matter, but from the presidential side all the way down to local elections, you really can make a difference. Go register to vote. Don't sit around and wait for someone else to fix the world's problems. -[SuperSaf] We need to vote to bring about real change. Every vote counts. And your vote can make a difference. Not just to yourself and your community, but to everybody including me many, many miles away. -[Linus] Does a ballot sheet scratch at level 6 with deeper grooves at level 7 when you mark it? Well, there's only one why to find out isn't there. Guys, the importance of voting cannot be overstated. So make sure that you're making your voices heard, because the impact of your choices can be felt not just at home, but all over the world. -[Jonathan] As much chaos as there's been this year, if there were one bright spot in 2020, I think it's the year that we can change things. And it might be the most important year of our lives. We absolutely have to do this together so every single vote counts including yours. So keep talking, keep pushing, vote, and let's make a difference. -[Jacques] I know what you're thinking, look at this old person telling me to vote. Well, that's going to change with the upcoming election. Younger people, they're starting to realize how much power they have and how they can make these politicians accountable for their actions, and that is a beautiful thing. So when you hit the polls and you vote for the person that you think will do the best job for our country, know that you used your power for good on someone that will not only make our nation, but the world a better place. -The average age for most politicians in US government right now is 60 years old. And for presidents, it's much older than that. The only way to get changes that will benefit you directly is by voting for people who are still in touch with reality your reality. In most states it takes less than 2 minutes to register to vote. I'll leave a link for a free website called VOTE.org, where you can check your registration, or register to vote for the very first time. We're all in this together and we can fix all of this together. It's quick, easy, and you really can make a difference. I'll leave a link down in the video description. Thanks a ton for watching, and I'll see you around. -[iJustine] Um...hello? Did you register to vote yet?",
    "transcript_keywords": [
        "vote",
        "people",
        "make",
        "voting",
        "change",
        "things",
        "world",
        "year",
        "pretty",
        "vote counts",
        "register",
        "pretty insane",
        "place",
        "difference",
        "register to vote",
        "thing",
        "lives",
        "time",
        "make a difference",
        "Power"
    ],
    "transcript_entity_values": [
        "US",
        "2020",
        "6",
        "the year",
        "85-90%",
        "Martin Luther King Jr.",
        "over 200,000 miles",
        "9 years",
        "American",
        "the craziest year",
        "1",
        "60 years old",
        "the Power Rankings",
        "only one",
        "only 46%",
        "Americans",
        "Lakers",
        "this year",
        "VOTE.org",
        "Tesla",
        "first",
        "second",
        "these last few weeks",
        "today",
        "less than 2 minutes",
        "2016",
        "November",
        "Zack",
        "one",
        "NBA"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "DATE",
        "NORP",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG"
    ]
}