{
    "id": "bga930EaMMk",
    "title": "How much 'Titanium' is Samsung *actually* using? - NO SECRETS HERE!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-02-04T15:07:00Z",
    "video_url": "https://www.youtube.com/watch?v=bga930EaMMk",
    "category": "Howto & Style",
    "tags": [
        "Samsung S24",
        "S24 Ultra",
        "Galaxy S24 Ultra",
        "Samsung Titanium",
        "Android",
        "iPhone",
        "Apple",
        "Titanium Phone",
        "iPhone 15 pro",
        "Samsung",
        "smartphone",
        "technology",
        "gold",
        "metallurgy"
    ],
    "views": 3282136,
    "likes": 93701,
    "comments_count": 3784,
    "description": "Lets take apart the new Samsung S24 Ultra! Grab one of my teardown skins for your own phone HERE:   HUGE thanks to Moxtec for letting me borrow their XRF Scanner. If you ever want to build a rover to analyze other planets - check them out:  and massive thanks to @NFTI for letting me borrow his forge so we can separate the plastic, aluminum, and Titanium of the Galaxy S24 Ultra.  I'm a big fan of Titanium smartphones, its a super cool metal. And I'm glad to see that both Samsung, and Apple are using the real stuff. Even if it is different grades of the Titanium material.  Samsung is using Grade 2 Titanium, and Apple is using Grade 5 Titanium.",
    "description_links": [
        "https://www.dbrand.com/teardown",
        "https://www.moxtek.com/"
    ],
    "transcript": "The Samsung Galaxy S24 Ultra appears to be made from titanium on the outside, but today we are going to strip this Android flagship down to its core and reveal every little secret Samsung is hiding on the inside. And we'll see who, Apple or Samsung, is using more titanium in their smartphones. With entirely flat glass panels on the front and the back, getting inside the S24 Ultra this year is one of the easiest ingresses we've had yet. I'm so glad the curved glass fat is out of here. With one single slice around the exterior from my razor sharp jerry-rig knife, the back panel is gone, revealing a single interior metal camera lens attached to the inner glass, which locks the five exterior circles together. We also see 17 Phillips head screws. Thumbs up for making things easy, Samsung. I appreciate it. With the screws removed, we get our first look at the internal 15 watt wireless charger with copper coils. Interesting that each winding increases in diameter on its way around the circle. Not sure I've ever noticed that before, nor do I know why they did it that way. Probably science. Pulling away the lower stereo loudspeaker, it's got a window for some blue balls on the side, and rumor on the street is that Samsung has placed their haptic vibrating motor inside the speaker. If we take a peek inside, indeed nestled down between all the white foam balls is a linear haptic feedback motor and the lower loudspeaker itself. Not sure why Samsung put their vibrator and balls in with the speaker, but it probably has something to do with science. Another super cool tidbit that no other smartphone can lay claim to is that when we go to uncover the S Pen slot, we can see another ultra small wireless charging coil which transfers energy to the coils in the tip of the pen, which wirelessly charges up the capacitor at the other end. The S pin housing itself is watertight. so even if water gets into that slot, it won't seep inside the phone. In my haste to search for titanium, I kind of forgot to unplug the battery. But I assure you, a late battery unplugging is probably the least terrible thing that's going to happen to this phone today. You were the chosen one. At first glance, it appears as if Samsung has a plastic buffer between the thin titanium walls on the exterior of the phone and an interior milled aluminum structure, which makes sense. A block of solid titanium the size of an S24 Ultra would cost about $200 all by itself, and milling away about 90% of that just for the internal electronics would be a complete waste. So just like Apple, Samsung has laid out a very thin cosmetic border of titanium around the exterior. But instead of using solid state diffusion, it appears as if Samsung has joined the inner and exteriors with plastic. We'll of course scientifically test my theory with an XRF scanner and a furnace here in a few minutes. I'm melting. I'm starting to understand why Samsung doesn't send me review units. Or was I? Oh yeah, haunting the nightmares of Samsung's marketing team. With the three extension ribbons removed, we see it. A battery pull tab. Again, Samsung has graciously provided us with a removable battery pull tab, and it is amazing. Amazingly easy to remove. The S23 Ultra is rocking a 5,000 milliamp hour capacity battery. We also find a very large copperish vapor chamber under the cell. Happy to see that. Now one question I've been getting a lot for the past decade is what happens if I stick my SIM card removal tool in the wrong hole? Smartphone manufacturers like to put the microphone hole, which is about the same size as the SIM card removal hole, right next to each other. Lucky for you though, smartphone manufacturers also understand the IQ level of the people they're making phones for and have put in some fail -safe to prevent the microphone damage. One, the hole is two-tiered, meaning it tapers off at the backside and the tool can't even reach the end. And two, the golden rectangular microphone on the circuit board and its waterproofing membrane are both mounted to the side of the hole and not the end, which make them impossible to puncture. This same design translates over to every smartphone ever made. I've never seen a microphone that could be easily damaged by a SIM card tool. So it's most likely totally safe to stab the microphone hole as much as you'd like. No problem at all. The 45 watt USB-C charger does have a red rubber ring around the opening, which also helps with water resistance. And the loudspeaker slash vibrator unit is also protected with its own waterproofing mesh and light colored blue gasket on the phone frame. The upper stereo speaker does not have balls or vibrators inside, but after unplugging the screen ribbon and front facing camera ribbon, just like little Legos, the motherboard is freed from the phone. On the backside, we can unplug the telephoto, 3X, 200 megapixel camera, and 12 megapixel wide angle, all of which take up about the same amount of real estate as the dual stacked motherboard. With a phone as big as the S24 Ultra, it's crazy awesome how tiny this motherboard is. You could almost plop all this power into a wristwatch. The 12 megapixel wide angle camera does not have OIS. The 200 megapixel main camera most definitely does. The 50 megapixel 5x telephoto has internal stabilization, and the 3X zoom camera also appears to have optical image stabilization. Nice. Now, this is where things get messy. If we want to see exactly how much titanium samsung is using and what grade titanium. We have to XRF scan and melt down the frame just like we did with the iPhone 15 Pro, may it rest in peace. With a lot of heat, the Gorilla Armor screen glass separates from the display pretty easily. Tad surprised at that, honestly. Normally I have to fight these things. With the pixels peeled up, we can see the ultrasonic fingerprint scanner on the back, and we can remove the rather large vapor chamber. At first glance, you might think this is gigantuan, but then we remember the OnePlus 12's dual stack vapor chamber, which is the largest overall that we've ever seen on a smartphone. With all the components removed, it's easier to tell that the purple anodized aluminum frame really does fill up the vast majority of real estate inside the phone. The metal is covered with mill markings. Then we have the gray plastic intermediary layer with the titanium plates on the outside running along the edge. And the plastic is what looks like is holding everything together. We'll see what's really going on here in a second. Before we melt down the phone, let's see what grade of titanium Samsung is using. It turns out that right next door to my wheelchair factory here in Utah is a company called Moxtec, which built the literal x-ray sources inside the Mars Perseverance rover. They conveniently also make the guts of the portable XRF scanners that we're using to identify the S24 Ultra metals. That's the grade 5 right there. Yep. These scanners are used a lot in mining or scrap metal recycling, and huge thanks to Moxtec for letting me borrow their scanner. When that scanner is placed right up against the materials to get a reading, we see that the inner structure of the S24 Ultra is indeed 6061 aluminum, and the exterior frame of the S24 Ultra is a grade 2 titanium. There is a margin for error, of course, but the XRF scanner did say that the scraps for my titanium iPhone 15 Pro are grade 5. So I think we can be pretty confident in the results. And hopefully next time, we ask nicely, Moxtec will let me borrow the Mars rover for a second. Now that we know that Samsung is using grade 2 titanium, let's find out how much is there by burning off the plastic and melting out the aluminum. The easiest way to separate the titanium from the aluminum is with a whole lot of fire. - Aluminum melts at about 1200 degrees Fahrenheit. - The plastic should burn away at a couple hundred degrees. - And titanium, we can't melt that with our furnace. It only gets up to about 2000 degrees Fahrenheit. - So it should...the shards of titanium should still be there when this is all over. It's interesting to see that as soon as the skeleton of the S24 Ultra meets the 2000 degree furnace, the plastic instantly combusts into flame. The bright orange fire is swirling around in a smartphone killing vortex. And within seconds, the plastic holding the titanium pieces to the rest of the phone melt away, flinging my lower titanium strip into my garage somewhere, and the rest of the phone falling like Gandalf and the Balrog in Demoria. That's all the plastic right there. Yikes. I would not have guessed it would stay on fire under the furnace this long. That's titanium that fell away from it. I'm not going to grab it with my bare hands. That's the titanium already. The plastic still continues to burn even when removed from the flame. Probably not a good idea to breathe the smoke. But even while on fire, titanium is still mostly secure to the sides. Back into the furnace it goes to liquefy the aluminum. In a very short amount of time, the inner aluminum is dripping into the crucible while the plastic finishes burning away. The titanium rails won't melt or deform until about 3000 degrees Fahrenheit. So even though the aluminum and plastic are toast, we can still salvage what's left of the titanium for further analyzing once of course it cools down. Oh that's wild. Look at that. Here's your own private little puddle of aluminum. The coin of aluminum is pretty awesome if I do say so myself. And each titanium rail and corner piece appears to be very much still intact. Just like science said it should be. We have the titanium and the aluminum. We've officially extracted the titanium from the S24 Ultra. I do not need the aluminum however, so Nate from the internet, that is your payment for letting me borrow your forge. - Thank you and I am going to be giving this away on my next video, so if you're interested, come check it out. - Let's complete the final analysis of the titanium and see who has more, Samsung or Apple. As I put the phone back together, well the ghost of it anyway, it's interesting to note the different assembly processes between Apple and Samsung. Apple developed a custom solid state diffusion process which fuses aluminum directly with the titanium. Samsung however just molded little nub anchors onto their titanium cast so that as the plastic gets injected in between the aluminum and titanium, it can lock both pieces in like a puzzle. The plastic adds structure to the individual titanium plates while doubling as antenna lines. The process is called overmolding where different materials can form parts around one another. Both phones have about the same thickness of titanium around the outside, but due to the alloy, Apple's grade 5 titanium is about 4 times more expensive. So if I had to guess, Apple's probably using about $10 to $15 worth of titanium and Samsung is using about $3 to $5 worth of the raw material. Obviously it costs far more than that to cast, shape, and work with titanium. But even then, with the way both phones are designed, both titanium exteriors are more cosmetic than anything else. Apple might be getting some minor strength improvements with solid state diffusion, but with a plastic intermediary, Samsung is most definitely not getting any additional strength. But according to my previous durability test, maybe that's a good thing. I'm still here for it though. Titanium is pretty awesome and both Samsung and Apple are indeed using the real stuff. Nice work to the both of them. If you want a far less invasive way to see the insides of your phone from the outsides, I'll leave a link for my teardown skin in the description. It's far less expensive too. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "titanium",
        "Samsung",
        "Samsung Galaxy",
        "titanium samsung",
        "Ultra",
        "Android flagship",
        "plastic",
        "aluminum",
        "phone",
        "Apple",
        "secret Samsung",
        "inside",
        "grade",
        "Galaxy",
        "Android",
        "smartphone",
        "hole",
        "camera",
        "exterior",
        "core and reveal"
    ],
    "transcript_entity_values": [
        "about 90%",
        "Moxtec",
        "5,000 milliamp hour",
        "a couple hundred degrees",
        "15",
        "17",
        "jerry-rig knife",
        "two",
        "samsung",
        "about $3 to $5",
        "within seconds",
        "three",
        "Moxtec",
        "the Balrog",
        "Legos",
        "12 megapixel",
        "S24 Ultra",
        "about 3000 degrees Fahrenheit",
        "Phillips",
        "SIM",
        "Nate",
        "Gandalf",
        "the S24 Ultra",
        "this year",
        "5",
        "Apple",
        "five",
        "XRF",
        "45 watt",
        "about 1200 degrees Fahrenheit",
        "first",
        "second",
        "a few minutes",
        "15 watt",
        "2000",
        "the past decade",
        "Samsung",
        "today",
        "Android",
        "6061 aluminum",
        "Mars",
        "Mars Perseverance",
        "about 2000 degrees Fahrenheit",
        "One",
        "200",
        "about 4",
        "about $10 to $15",
        "about $200",
        "50 megapixel 5x",
        "200 megapixel",
        "one",
        "Utah",
        "Demoria",
        "3X",
        "2"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "NORP",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "LOC",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "GPE",
        "CARDINAL",
        "CARDINAL"
    ]
}