{
    "id": "bGfGE3tJnqs",
    "title": "The Almost PERFECT Laptop... - HP Dragonfly Elite",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-06-19T18:53:45Z",
    "video_url": "https://www.youtube.com/watch?v=bGfGE3tJnqs",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Elitebook",
        "Ultrabook",
        "Intel",
        "11th Gen Processor",
        "Lightweight",
        "Perfect",
        "Business",
        "Performance",
        "Work",
        "Privacy",
        "3M",
        "Sureview"
    ],
    "views": 379283,
    "likes": 15093,
    "comments_count": 990,
    "description": "Buy the CORSAIR Virtuoso RGB Wireless XT at  On Amazon (PAID LINK):  On Best Buy (PAID LINK):   The HP Dragonfly Elite laptop is almost perfect, except for the price, but if you really need something top-tier WITH a great webcam, you should check out this laptop.  Buy the HP Dragonfly Elite laptop on Amazon (PAID LINK):   Buy iFixit Pro Tech Tool Kit On Amazon (PAID LINK):  On Walmart (PAID LINK):   Buy Dell XPS 15 9500 On Amazon (PAID LINK):      On Newegg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:19 - Unboxing 1:50 - Exterior Impressions 2:17 - Overall impressions 2:34 - Internal Specs 3:42 - Weight 4:02 - Flex test 4:22 - Sureview feature explanation 7:19 - Keyboard and keyboard impressions 8:12 - Speaker test 9:21 - Webcam impressions 10:33 - Internals 11:21 - Closing thoughts",
    "description_links": [
        "https://geni.us/FWcQW",
        "https://geni.us/Tz9fbvJ",
        "https://geni.us/047rt",
        "https://howl.me/chrOhMAXiqW",
        "https://geni.us/EQnRi",
        "https://geni.us/AojPBz",
        "https://geni.us/3hOlt8j​",
        "https://geni.us/Anb8Xa​",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- What we have right here is the best ultra book on the market, or at least I'd (beep) hope so because it's $2,265. Oh my God. (chuckles) Well, let's just get into it. It's the HP Dragonfly Elite Max. And it is, I have to say, a beautiful machine, but again, I'd hope so. (chuckles) - [David] What's the going rate on a kidney these days? - Dave why would you think that I know how much kidneys costs? - [David] You seem like that kind of person, Alex! - Here we go. This box looks wonderful, and I'm pretty sure it's made of recycled material, but don't quote me on that. Here it is, and this is a fine looking machine. Can I... This was way easier to do when I had the plastic wrapping on it, but I've been using this for a couple of days. So now, the plastic is gone and this is difficult. (chuckles) But it looks so good. This thing is made out of 90% recycled magnesium. It has this like shimmer on it. Yeah, it is also very fingerprint proof. Like, look at this - Oh yeah. - [David] Oh yeah. They're super hard to get out, too. Let's see what else is in the box. Tells you what the buttons do. Fair enough. Power adopter, it's type C and has a very nice braided cable. I do like these ones that HP has. Then I think that's it. Let's see here. It's mildly hard to get out of the package. It's 65 watts, so, yeah, this is not a super powerful machine. It's a 13 inch thin and light. It has a quad core Intel processor. So, you know, HP says, that this is for the mobile trailblazer. So someone that, you know, that needs to look good when they go out, and has lots of connectivity options. And also, I don't know. - [David] Lots of money. - Yeah, lots of money. Lots and lots of money. (chuckles) Now, let's see here. The I/O on this thing is awesome. Two Thunderbolt fours right there. Headphone-microphone combo, full-size HDMI. And on the other side we have full-size USB type A. There's a power button. And right here, there's a little SIM slot. So, that is awesome. Can we get into it? - [David] Yeah. - Yeah. (chuckles) - It's very light. It's almost difficult to open because it is so light. Look. Oh, mouse pad, lttstore.com. - [Jono] If it's in stock. - Yeah, if it's in stock. They are very nice though. Here have an i7-1185G7. So that's four cores, eight threads. It's pretty speedy, if you don't need to do a whole lot. Because it have 16GB of RAM at... Wow, 4267 megahertz. That's actually quite fast. Along with a 500 gigabyte SSD, Intel Wi-Fi 6. And of course, Xe Graphics, which are quite good for, you know, integrated graphics, but they are still integrated graphics. What also is quite good, is a segue to our sponsor, Corsair. The Corsair Virtuoso RGB Wireless XT headset, gives you simultaneous dual wireless connections, get high fidelity game audio with hyper fast ultra long range slipstream Corsair wireless technology plus Bluetooth and Qualcomm, aptX HD. A matched pair of precisely tuned 50 millimeter high density neodymium speaker drivers deliver impeccable sound at a frequency range of 20 to 40,000 Hertz. It also comes with the detachable 9.5 millimeter omni-directional high bandwidth microphone. Has up to 15 hours of battery life. Check it out today at the link below. Now, one of the first things that you will notice with this laptop is that it's just, it's shockingly light. Let's bring it up here. Let's see 1.63 kilograms, which is two and a half pounds for those of you that hate good systems of measurement. It's so stiff, the whole thing. This thing feels like an LG gram when you hold it. It's that light, but it doesn't feel like an LG grip when you feel it. It feels so solid. My only mild complaint is that the screen does have a bit of a tendency to get a bit wobbly, but it's not a huge deal. Actually, you know, let's just get to it right now. The screen on this is absolute trash. It's tragic, honestly. So, on this, the specs are awesome. So it's 10 ADP, which is fine. It's a 13 inch display, it's more than enough. And it goes up to a thousand nits. So 700 or so of that is usable. But it looks like ass. (chuckles) They have what's called a 3M privacy filter, film chummy. As far as I can tell, it works similar to how a funnel lens works, so it's a whole bunch of little ridges, and you have, you know, a whole bunch of light that's coming out in every direction from your backlight. And this film is going to direct them, so that all of them just go, boop, straight out, doop. You get excellent privacy. So can you see the screen right now, David? - [David] Yeap. - Let me turn a little bit. - [David] Oh wow. - You can't at all. It works really good for the privacy. - [David] Wow. - I do have to say it is exceptional, how it does this. The problem is that when you turn it off, what they do is they turn on a second backlight, which supposedly, you know, overcomes this, and allows the light to go out in all directions, but in practice, it doesn't. And instead, it just kind of looks like a TN panel and it's terrible. This is unfortunate because for one, I found just constantly when I was like using it, I didn't even notice how often I kind of have like, maybe you want to move it like here and type, but you can't because now it looks bad. Or maybe I want it down here, it looks bad again. And this is compounded with the fact that it handles reflections really, really bad. But instead of just having a reflection in the background, it creates this like rainbow halo thing around everything. And it's just so bad, it's terrible. And I hate it because I would daily drive this laptop, if it wasn't for that. Can we turn on something kind of bright back here? Normally you would just get the reflection that's here, but instead you have these really colorful sort of halo craps all around it. Maybe I can show it even worse with like a... There we go. That's it. That's perfect. And so like when you have office lights behind you, every single one of those tubes is just doing this the whole time, and it's impossible to look at. Like, I'll just show you what it looks on the XPS 15 here. Yeah, it's just, it's just a light. And normally on this you only get a reflection because it's not something that's this bright. It's infuriating, because aside from that, I love this laptop. HP, give us an option of this with just a normal display. (soft music) This keyboard is fantastic. It's one of the best that I've ever used on a laptop. It's nice and clicky, has a nice what'd you call it, like supple bottom of the travel. (David laughing) It's just a joy to use. (chuckles) - [David] Supple. And below it, we have a track pad that's... It's a tiny bit on the smallest side, but for a laptop of this size, it's great. So one thing that HP has been doing for a while that always annoyed me is they take the speakers, and they put them on the top, which moves the whole keyboard down, which makes the track pad really small. But this one speakers are on the side, track pad big. Awesome. Love it. As for the tracking itself, the feel of this touch pad is a bit more old school, like it has more of a... I don't know if you can see this there, but it's like a proper click. It really goes in. I got used to it in a couple of minutes, and yeah, it's fantastic. Also, the speakers, let's boot up Crab Rave. Yeah, for a 13 inch these are really loud. (\"Crab Rave\") And the clarity is spot on. HP always nails that in their laptops. (\"Crab Rave\") Wow, that is good. That is really good. One second, see the stupid thing right here? Okay, it's done. But this had to wake up from hibernate because it's a stupid computer that always gets really hot in my bag. And you know, kills its own battery. This right here, has in bag detach. So you chuck it in your bag, it uses AI to be like, oh, hey, I'm in a bag. I'm gonna hibernate now. Instead of just destroying your battery. Thank you, HP. Dell get that, I hate it that this doesn't have it. (\"Crab Rave\") Okay. So we've got the Dragonfly, XPS. So, I would say that the XPS 15 still has a slight edge, but this is a 15 inch laptop, and this is a 13 inch laptop. And they are incredibly comparable. This might be the best sounding 13 inch laptop that I've ever used. One thing that HP really talked about for this is the webcam. So in this right here, instead of your normal crap tier 720p webcam, we got, well, it's not amazing, but for a laptop, an absolutely amazing webcam. So this thing is five mega pixels, you get 1440p, 30fps recording. As you can see right here, it looks fantastic. Opening at the pixel right here. So, HP right here. Pixel 5 right here. The fact that I'm comparing these two really says a lot about how good the HP is. Now let's bring it out the XPS 15 As you can see, this is just hot garbage. Everything about it is bad. Grainier than, I don't know, an oatmeal factory. Whereas this one right here, you know, you're a mobile trailblazer. You need to look good when you're on the go. So as you can see, this thing's pretty big for a webcam, at least. Which means that you can't really get 16 by 10 on this display. I actually think we're going to do an LTT pretty soon on why laptop webcam suck, and use this thing right here as an example of that they don't need to suck. And now let's take it apart. All right, let's get into her. This right here looks like it's all magnesium. Wow, that is a massive battery. 56.2 watt hours. So it's actually not the biggest of capacity batteries ever. I guess it was probably just rather thin. This thing HP says should be able to get you 17 or so hours of battery life. As per upgradability, you might be able to replace the SSD. Okay, okay. We've got our SSD right here. It is replaceable, which is kind of all that you expect on a laptop like this. However, is this our SIM... Nah, Snapdragon X55 5G modem, nice. And of course, just a little fan. Oh, I feel like that they said something of, that this has a fancy fan in it that has small blades or something, whatever. I guess that's about it. This right here is a fantastic laptop. Probably one of the best on the market with a screen that kind of ruins it. It's a bit sad. Especially since HP, I think, makes some of the best displays available on laptops right now. Like the NB 14, amazing display. Actually, basically, every single display, except for this one, amazing display. I love this thing. HP, give it a proper display. I will daily drive it. Anyway, I hope you guys liked this video. Maybe we'll do a cheaper laptop next time. Actually that's a lie. We'll probably, we probably won't. I'll try and get something in, but we probably already have something that's like, a $5,000 gaming laptop on the way. So, sorry about that. But get subscribed, hit like. Have a great day. Bye.",
    "transcript_keywords": [
        "laptop",
        "thing",
        "Yeah",
        "good",
        "light",
        "Dragonfly Elite Max",
        "inch laptop",
        "display",
        "inch",
        "kind",
        "bit",
        "lots",
        "XPS",
        "Wow",
        "nice",
        "bad",
        "Elite Max",
        "battery",
        "pad",
        "webcam"
    ],
    "transcript_entity_values": [
        "a couple of minutes",
        "Crab Rave",
        "700",
        "Corsair Virtuoso RGB Wireless XT",
        "15",
        "Intel",
        "Qualcomm",
        "Hertz",
        "4267 megahertz",
        "One",
        "RAM",
        "HP",
        "chuck",
        "56.2 watt hours",
        "one",
        "16GB",
        "USB",
        "15 inch",
        "NB",
        "5,000",
        "Xe Graphics",
        "Corsair",
        "Crab Rave",
        "Fair",
        "30fps",
        "3M",
        "Alex",
        "65 watts",
        "two and a",
        "1.63 kilograms",
        "a couple of days",
        "second",
        "AI",
        "LTT",
        "TN",
        "Intel Wi-Fi 6",
        "13 inch",
        "David",
        "Dragonfly",
        "David] Supple",
        "5",
        "500 gigabyte",
        "LG",
        "daily",
        "10",
        "50 millimeter",
        "first",
        "17 or so hours",
        "90%",
        "ADP",
        "16",
        "two",
        "four",
        "Dave",
        "Bluetooth and",
        "Two",
        "20 to 40,000",
        "XPS",
        "9.5",
        "five",
        "up to 15 hours",
        "eight",
        "Dell",
        "2,265",
        "today",
        "SSD"
    ],
    "transcript_entity_types": [
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "ORG"
    ]
}