{
    "id": "BGfSr74P6D8",
    "title": "Farewell, LG Mobile: 20 Years Of Doing Phones Differently",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-04-06T22:11:02Z",
    "video_url": "https://www.youtube.com/watch?v=BGfSr74P6D8",
    "category": "Science & Technology",
    "tags": [
        "lg wing review",
        "lg velvet review",
        "lg retrospective",
        "lg mobile",
        "lg phones",
        "lg chocolate",
        "lg prada",
        "lg rumor",
        "lg voyager",
        "lg crystal",
        "mrmobile"
    ],
    "views": 969754,
    "likes": 39410,
    "comments_count": 4015,
    "description": "From Lucky Goldstar to Lifes Good to  Last Gasp. Thats the rough trajectory of LG Mobile: a technology brand that over the past twenty years went from a strong second choice for American dumbphone buyers, to the only game in town if you wanted the hottest messaging phones available, to a case study on how to do Android smartphones differently  for better, and for worse.   Join Michael Fisher for a MrMobile retrospective on LG Mobile. From the LG Chocolate to the LG Wing (and the Pradas, Rumors, Flexes and Optimii in between) well re-live LGs highs and lows, and try to extract a useful lesson from its 2021 withdrawal from the mobile tech space.   [SUBSCRIBE TO MRMOBILE]     [ABOUT THIS VIDEO]  This video was produced with the aid of a number of LG Mobile phones, a mixture of review samples from LG Electronics and vintage units purchased by MrMobile/Future plc. Neither LG nor any other company furnished compensation, provided editorial input, or received an early preview of this content.  This video features extensive coverage from Michael Fishers days reporting at Pocketnow, used with permission. Visit and subscribe at the link below.   [LINKS]  Why Did LG Phones Really Die? [MKBHD]:   LG Wing Real World Test [TheUnlockr]:   Pocketnow [YouTube]:   Samsung Rising by Geoffrey Cain [Amazon]:   G posts $224 million loss as weak selling G5 smartphone drags it down once again [TechCrunch]:   LG finally acknowledges LG G4 boot loop problem [TechRadar]:   LG smartphone bootloop issues [Wikipedia]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase.   Additional information concerning MrMobiles ethics policy can be found here:   #lg #lgmobile #smartphones #tech #lgwing #lgvelvet #lgchocolate",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://youtu.be/CAmZXCZ-e94",
        "https://www.youtube.com/watch?v=5o9rVXA8v6E",
        "https://youtube.com/pocketnow",
        "https://www.amazon.com/Samsung-Rising-Inside-Korean-Conquer-ebook/dp/B07T9WTTZC",
        "https://techcrunch.com/2017/01/24/lg-q4-2016/",
        "https://www.techradar.com/news/phone-and-communications/mobile-phones/lg-finally-acknowledges-g4-boot-loop-problem-and-it-s-offering-a-fix-1313769",
        "https://en.wikipedia.org/wiki/LG_smartphone_bootloop_issues",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- From \"Lucky GoldStar,\" to \"Life is Good,\" to \"Last gasp.\" That's the rough trajectory of a brand that over the past 20 years went from a strong second choice for American dumb phone buyers, to the only game in town, if you wanted the hottest messaging phones available, to a case study on how to do Android smartphones differently, for better and for worse. (upbeat music) This week, LG electronics officially confirmed that after years of struggling to turn a profit in the quote: \"Incredibly competitive mobile phone sector,\" unquote, and reportedly failing to find a buyer for its mobile division, it's hitting the end key one last time. And shutting the doors on that business unit forever. So I dug out every LG phone in my archive of oldies to see what sense I could make of the companies two decades in mobile. You see, if you're not careful, you can develop a kind of short-term memory when you chase gadget release cycles for a living. The past few years of LG Mobile's floundering makes it easy to forget how much of a heavy hitter the company once was. This is the same company that Samsung perceived as such a threat back in 2000, that the CEO of Samsung's mobile division effectively blew up a relationship with Verizon Wireless, just because the carrier had bought phones from LG. And frankly, Samsung had reason to be nervous. In the years to follow, LG would churn out some of the most compelling feature phones sold in the US. As a former LG Rumor owner, I can attest that it made messaging accessible even to those of us who didn't want to carry a smartphone all the time back in 2007, and it's higher end sibling, the Voyager combined that key-clack and capability with a large outer display to do battle with the then new iPhone. And during the same period, the company was also developing cell phones whose primary mission was to look pretty. The LG Chocolate, seen here in its Platinum Edition trim for Korea on a device loaned from David Cogan at TheUnlockr was so named because of its resemblance to yeah, a candy bar. And what it's touch sensitive controls lacked in responsiveness, they made up for in sheer geeky sex appeal. I know it doesn't look like much today, but in 2007, this was so far beyond the aesthetics of the competition, that it became LG's best selling phone up to that point. And LG would later port the design language to a clamshell form factor for flip fans. This is the same period LG was pushing out other pretty players like the Prada, toying with taller aspect ratios with the BL40, indulging in the occasional bit of crystal clear craziness. I did a whole, \"When Phones Were Fun\" episode on this one. And all the while, keeping up its feature forward offerings with phones like the Fusic, a music-focused flip for Sprint. At the turn of the decade, LG mobile was well positioned to ride the smartphone wave into the twenty-teens. Now as dumb phone sales began to dry up in favor of their smarter competition, LG kinda had to roll with the punches. After releasing many devices for Microsoft's Windows Mobile platform, the company stayed on the front lines, for the highly publicized transition to Windows Phone. The LG Quantum, not only had the coolest name of all the first-generation Windows phones, it also packed the most utility with a slide-out keyboard similar to that of the Rumor. Sadly, it would not turn out to be a Quantum of Solace, Windows Phone's failure as a platform is a story for another time, but its eventual implosion would ultimately result in LG having to focus all the efforts on Android. And you know for a while, that streamlined strategy seemed to do LG some favors. I still remember how pleasantly surprised I was by the Optimus G of 2012, a polished piece of hardware and software in an era when Android phones weren't known for their polish. The sequel, G2 would become a fan favorite, starting a years long trend of placing the volume keys in a spot I still think makes ergonomic sense. And the double tap gestures for screen wake and lock that arose from that button placement ended up being such a good idea that most phones today still use them. Meanwhile, LG was also making phones for Google's Nexus brand. It made the two most popular phones of that line. And all the while, LG was also evolving it's G family, with the G3 and G4 pioneering a higher resolution display and a much more performant camera. respectively. Even if they were pockmarked with more problems than prior models. Those problems were never more pronounced than on what otherwise would have been my favorite LG phone. In December of 2013, I flew to San Francisco to report on the LG G Flex for Pocketnow. A phone with a curved body reminiscent of Samsung's Nexus S, but with a curved display to go with it. Its chassis was designed to bend so it could survive accidental pressure, and its casing was coated in a compound that could heal minor scratches all by itself, to a limited extent, but still. When the smaller more fetching sequel, the G Flex 2 was announced for Sprint in 2015, I very nearly switched carriers just to own it. Trouble was that the G Flex 2 came powered by Qualcomm's Snapdragon 810, an SOC that became infamous for bad thermal characteristics and poor performance. That, combined with LG's poor software to produce a phone that was heavy on lag and light on battery life. Shortly thereafter, more severe issues began cropping up on the company's other phones, some of which began exhibiting an issue called \"Boot Looping,\" that effectively rendered them useless. With enough cases reported over enough device types that a class action lawsuit was filed against LG. At the same time the company came under fire for failing to support its software, as well as other manufacturers, often delaying Android updates or failing to deliver them at all. All that set the stage for what I considered to be the final and most inconsistent period in LG mobile's history. From the G5 to a \"Wing and a Prayer.\" (upbeat music) At mobile world Congress 2016, Samsung's Galaxy S7 was a beautiful compelling achievement. But it was LG's G5 that really fired my imagination with its novel approach to accessories. It's modular sled slid out from the bottom of the phone like a hand gun clip, letting you swap in: batteries, speakers, camera grips, even a VR headset, while preserving the uni-body frame of a modern smartphone. Sadly for LG, the accessories were poorly received, unevenly distributed and Motorola also released a modular phone the same year whose approach to modularity was, well, better in basically every way. LG would go on to blame a $224 million loss in the fourth quarter of 2016, partly on this strong but wrong bet on the G5. As you might expect, LG's next few mobile plays were more conservative, but the innovation did continue. The G6 took some inspiration from the old BL40 by stretching the chassis, producing a 2:1 one aspect ratio that most smartphones still emulate today. It was also one of the first to bring military standard durability to a phone that didn't look like it belonged in a toolbox and it carried over the one great feature from the G5, the ultra-wide camera, that opened up a whole new dimension for mobile photographers. Today, it's basically impossible to buy a high-end phone without that feature, but it's important to remember that for years, the only way you could get it on a flagship was by buying LG. You know, the more I talk about this stuff the more I admire LG, because it didn't just take a contrarian approach to the camera. It also drew a big deep line in the sand when it came to audio. (smooth groovy music) Even as the iPhone 7 was making headlines by removing the headphone port, LG was not just keeping the jack, but backing it up with a high quality digital-to-analog converter, starting on the company's V20 of 2016. Still, I began to experience the first pangs of genuine concern for LG when that V line transitioned from a focused, specialized phone for vloggers into just a bigger version of the G series. Which itself was starting to look like just another Android phone. And while LGS innovation impulse never wavered, it did take odd turns. Most famously with the half-baked air gesture controls on the G8. The most promising experiment was the dual screen accessory line it developed for those phones. By the time the LG Velvet came around the dual screen case was maybe just a generation away from something I might've added to my everyday carry. If it had ended there, I might be a little less melancholy about LG Mobile's early retirement. But the sad fact is, that the last LG phone I ever reviewed was also the most exciting. The LG Wing of 2020 was catnip for novelty-starved, slab phone burnouts like myself. Part reboot of a decade old Verizon phone, part revival of the T-Mobile Sidekick and part gimbal camera stand-in, the Wing was just packed with potential. Being able to text or Tweet while watching whatever's on Netflix was exactly the kind of first world solution it sounds like, but combined with the well-thought-out camera features and the fact that you could use it as a conventional phone when you didn't want to \"wing\" it, it made for a very exciting handset. Even before you took into account it's unauthorized ping-pong paddle mode. (upbeat music) The Wing was the first phone in a long time to give me hope that LG could someday return to its former glory. It was seductive to imagine a world in which phones like the Wing and its sequels would rejuvenate this contrarian innovator. Sadly, that particular future is off the table now leaving the next phase of mobile evolution to the entrenched Goliaths and hopefully serving as both inspiration and warning to the smaller companies that now must fill the gap. Inspiration, because there's a lot of innovation left to be had in the mobile space and warning because, well, here's the thing. You could make the case that LG Mobile failed because it bucked the trend and refused to pander to the mainstream. But that's frankly, too depressing a reality for me to accept. I choose to believe that LG Mobile's concepts were valid and sometimes even extraordinary. And that it failed because, all too often, it's execution of those concepts was lacking and it was unwilling to spend the money necessary to market the things it genuinely did do better. And you know, I think that's the biggest lesson I'm coming away with from all this. As with so many things in this world, it's simply not enough to have the most exciting story or the most specialized product or the most vocal fan base. You've got to consistently ship a product better or cheaper or more exciting than the competition's. And you've got to make sure people know about it. So long, LG Mobile. Thanks for the memories. (upbeat music) If you're not quite ready to give up on seeing LG phones in your YouTube subscription box every now and then, go ahead and subscribe to the MrMobile on YouTube. So you don't miss when I cover the LG Chocolate and other LG throwbacks on my series, \"When Phones Were Fun.\" Also be sure to check out MKBHD. I think you've heard of him. I happen to know he's doing a very similar LG retrospective video today, and it has some more insights, particularly on the sales and marketing front that I think you'll be particularly interested in. I'll link it below. As for this video, LG had no editorial input or early preview nor did it provide compensation in exchange for its production. Until next time. Thanks for watching and remember to stay safe and mask up when you're around fellow humans as you \"Stay Mobile,\" my friends. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "phones",
        "mobile",
        "Lucky GoldStar",
        "Windows Phone",
        "mobile phone sector",
        "American dumb phone",
        "competitive mobile phone",
        "mobile phone",
        "Microsoft Windows Mobile",
        "Samsung mobile division",
        "Incredibly competitive mobile",
        "Android phones",
        "Wing",
        "company",
        "Samsung",
        "years",
        "Android",
        "dumb phone",
        "Samsung mobile"
    ],
    "transcript_entity_values": [
        "Quantum of Solace",
        "Microsoft",
        "Nexus S",
        "MKBHD",
        "Verizon Wireless",
        "G4",
        "2000",
        "Prada",
        "iPhone",
        "Goliaths",
        "two",
        "Windows Phone's",
        "Verizon",
        "MrMobile",
        "one",
        "Android",
        "Platinum Edition",
        "half",
        "Qualcomm",
        "Samsung",
        "San Francisco",
        "the fourth quarter of 2016",
        "LG Mobile",
        "Motorola",
        "Google",
        "TheUnlockr",
        "LGS",
        "years",
        "2:1",
        "Wing and a Prayer",
        "The LG Quantum",
        "Sprint",
        "Boot Looping",
        "two decades",
        "Congress",
        "$224 million",
        "twenty",
        "G6",
        "LG Rumor",
        "YouTube",
        "Fusic",
        "LG Mobile's",
        "Stay Mobile",
        "the same year",
        "BL40",
        "2012",
        "Galaxy S7",
        "the T-Mobile",
        "The past few years",
        "SOC",
        "The LG Chocolate",
        "second",
        "G5",
        "Netflix",
        "V20",
        "2007",
        "David Cogan",
        "YouTube",
        "This week",
        "Today",
        "December of 2013",
        "2020",
        "Windows Phone",
        "Voyager",
        "Korea",
        "When Phones Were Fun",
        "Wing",
        "G3",
        "Pocketnow",
        "2016",
        "American",
        "the years",
        "the LG Chocolate",
        "Nexus",
        "GoldStar",
        "US",
        "today",
        "first",
        "The LG Wing",
        "a decade old",
        "G2",
        "LG",
        "Windows Mobile",
        "the turn of the decade",
        "\"Life is Good",
        "2015",
        "the past 20 years"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "FAC",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "DATE"
    ]
}