{
    "id": "BgL8G1XjrMk",
    "title": "Did Nvidia Just Do Us A Favor? - DLDSR Explained",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-02-04T18:08:54Z",
    "video_url": "https://www.youtube.com/watch?v=BgL8G1XjrMk",
    "category": "Science & Technology",
    "tags": [],
    "views": 466188,
    "likes": 24804,
    "comments_count": 960,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   How can Nvidia's Deep Learning Dynamic Super Resolution, or DLDSR, improve the look of your games without much of a performance hit?  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- Making your games look better without having to drop a bunch of money on a new graphics card is something that GPU manufacturers are keenly aware that gamers want, especially now that a new GeForce or a Radeon card is gonna cost you a spare kidney on the secondary market. Now, Nvidia and AMD have both tried to use their own secret sauces to make this happen. Both Nvidia's DLSS and AMD's FSR have made plenty of headlines recently. But team green is adding another feature to its arsenal that it hopes will give it the leg up on AMD and maybe give you a leg up in your games. They call it DLDSR, or deep learning dynamic super resolution. And if that sounds familiar, it's because Nvidia's regular dynamic super resolution, without the deep learning part, has been with us since the days of the GTX 970 and 980. So let's talk about what exactly that is and how deep learning improves upon it. Regular DSR is a supersampling technique. Basically, it uses your graphics card to render your game at a higher resolution than what monitor natively supports. Then, it scales that down to match your screen. This produces better looking images than just rendering at your display's native resolution. But why? Well, DSR more specifically works by taking samples of groups of neighboring pixels from the higher resolution-rendered image and blending them into a single pixel that you see on your lower resolution display to make the resulting image more accurate. This is essentially the same way that supersample anti-aliasing, or SSAA, works. SSAA has been around for longer than DSR, but games had to implement it individually. DSR has the advantage of not requiring work from game developers and also puts the image through Nvidia's own filter that takes into account additional surrounding pixels to further improve image quality. DSR has a habit of making images a little softer than traditional SSAA though, meaning that some gamers like it and others don't. Regardless, it's a popular way to improve image quality, especially as it allows more granularity with exactly how hard you want your GPU to work. Instead of rendering the image at two times or four times your monitor's resolution, you could specify something like 2.25 times, depending on how powerful your GPU is. But both DSR and SSAA are very computationally expensive since you're basically asking your GPU to do way more work and then throw away most of it. That is where DLDSR comes in. It leverages the tensor cores in RTX series GPUs that are designed with machine learning and AI in mind. We'll tell you about how DLDSR works right after we thank FreshBooks for bringing you this episode. FreshBooks is built for freelancers and small business owners who don't have time to waste on invoicing, accounting, or payment processing. You can save up to 11 hours a week by automating pesky admin tasks, like time tracking, following up on invoices and expense tracking, with features like the new digital bills and receipt scanner. Over 24 million people have used FreshBooks, and it's easy to see at a glance exactly where your business stands, then turn everything over to your accounting come tax season. It comes with award-winning support, so why wait? Try out fresh books for free for 30 days, no credit card required, by going to freshbooks.com/techquickie. The idea behind DLDSR is that the neural network and the tensor cores can figure out what the image should look like by sampling a smaller number of pixels than regular DSR or SSAA. One example Nvidia gave was from the game Prey, which was rendered at 1620p rather than 4K, then downscaled to 1080p. This was accomplished with nearly no frame rate drop compared to native 1080p rendering, and the image actually looked a little better than the traditional DSR image that downscaled all the way from 4K. Similar to regular DSR, DLDSR doesn't need per game support, so it can actually make your older games look refreshed. But if you're using a title that supports DLSS, you can combine the two features for an extra quality boost without sacrificing too much performance. Don't expect to it to work miracles though, early reviews have said that the quality improvement over regular DSR is pretty marginal, and of course, turning up the scaling factor is still going to slow your frame rate down, just that the impact won't be as huge as it would be with traditional supersampling. You'll need an RTX card to take advantage of DLDSR, but don't feel completely left out if you have a card from team red, as AMD is set to launch its own AI-based Radeon super resolution technology in early 2022, which should work on any RDNA 2 GPU. AMD cards, at least for now, don't have dedicated machine learning cores like Nvidia's do, so it'll be interesting to see how the two supersampling methods ultimately stack up against each other. I just hope they'll both be super, get it? 'Cause it's super resolution. Super subscribe, leave a like, or dislike depending how you felt, and leave a comment if you have a suggestion for a future Fast as Possible.",
    "transcript_keywords": [
        "DSR",
        "Regular DSR",
        "AMD",
        "Nvidia",
        "image",
        "DLDSR",
        "resolution",
        "AMD FSR",
        "secondary market",
        "SSAA",
        "bunch of money",
        "manufacturers are keenly",
        "keenly aware",
        "spare kidney",
        "GPU",
        "super resolution",
        "GPU manufacturers",
        "card",
        "super",
        "learning"
    ],
    "transcript_entity_values": [
        "Prey",
        "GeForce",
        "GTX",
        "30 days",
        "One",
        "4",
        "up to 11 hours",
        "the days",
        "Over 24 million",
        "AI",
        "DLDSR",
        "980",
        "FreshBooks",
        "SSAA",
        "DLSS",
        "early 2022",
        "FSR",
        "AMD",
        "Nvidia",
        "two",
        "1080p",
        "four",
        "Radeon",
        "GPU",
        "DSR",
        "2.25",
        "DLDSR",
        "2",
        "1620p",
        "SSAA"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}