{
    "id": "BGyxIUFNQUs",
    "title": "A Cool Desk Gadget Under $30",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-06T11:00:30Z",
    "video_url": "https://www.youtube.com/watch?v=BGyxIUFNQUs",
    "category": "Science & Technology",
    "tags": [
        "gadget",
        "gadgets",
        "tech",
        "technology",
        "sharkk",
        "sharkk hangover",
        "headphone stand",
        "headphone holder",
        "headphones",
        "headphones stand",
        "unboxtherapy",
        "unboxing",
        "unbox therapy",
        "review",
        "USB",
        "hub",
        "iphone",
        "iphone 7",
        "iphone 6",
        "iphone 6s",
        "pc",
        "mac",
        "computer",
        "android",
        "google",
        "today",
        "2016",
        "hangover",
        "amazon",
        "cool tech",
        "usb hub",
        "cool",
        "new",
        "best headphones",
        "best",
        "wireless",
        "galaxy",
        "s7",
        "galaxy s7",
        "samsung",
        "ipad",
        "top",
        "edge",
        "galaxy edge",
        "smartphone",
        "audiophile",
        "iphone 7 headphones",
        "desk",
        "desk setup",
        "computer setup",
        "desk tour"
    ],
    "views": 912467,
    "likes": 21310,
    "comments_count": 1343,
    "description": "ICYMI -  Sharkk Hangover -   Here's another cool, cheap gadget to help you better organize your desk setup.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/6NwucK-iLXA?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/25HKqxq",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up, guys? Lew here, back here with another video Today I'm bringing you a knick-nack... ...patty wag give a dog a bone? What a *weird* intro I am calling it a knickknack because its like Sometimes people in the comments are like Lew, why are you showing me these things that are thousands and thousands and thousands of dollars? I want something more approachable that also happens to be cool, so. I'm hoping that this is one of those things. It's called the SHARKK Hangover Something you can put on your desk, a place to keep your headphones, So that you can you know have them organized especially if they have a cable or something and you can display them you know nicely but it's got a few USB ports which is gonna allow you to charge up some devices it's got audio pass through so if you have a desktop computer or your audio source is somewhat hidden behind the desk somewhere and you know changing out headphones and whatnot requires you to reach down behind and so on this is an alternative it's going to allow for you to connect and disconnect right at the base Alright! So let's.. let's crack this baby open gonna need a knife for that... OK some weight to it which is probably good! I'm going to put that there for a moment here's the base... Cool..! Is it a hub or is it just power? let's see here.. It is a hub! Not just charge things but allow you to.. to have more peripherals connected to your system essentially one goes to your system the other three sit out front here the audio port i mentioned before and what looks like a power button and then a USB cable slide it..Yes!.. that was easy the back for your cable I've got some headphones here let's see what this thing looks like if you caught the last video which of course you have you still have time it hasn't self-destructed yet then you probably saw these slick new headphones from Odyssey! Look at the... This is what they look like it's a bit of a look right there wait I want to do it the other way there we go I like that look better on your desktop you always know where they are look at that so now it's plugged in quickly try to charge the device will be in charge how about this i pad right here ipad so I try to plug the Sharrk into a power brick and for some reason it was behaving like you wouldn't it wasn't passing through charge to the other devices but the minute that i plug it into my laptop all of a sudden everything was charging up correctly so the intention here as the manual states Lew why don't you try reading the manual first as the manual states this should be hooked up to your system and then it can actually act as a USB sound card as well so these audio ports they don't require direct connection you're the microphone and headphone the sound card is like in the base so the USB is transferring the audio and now i can plug directly into those locations there so again now you have access to your ports through the USB hub as well as your audio through the built-in interface so all you gotta do is connect this end here to an available USB port on a on a computer could be Mac could be PC doesn't really matter so you got this like cool this cool little gadget on your desk multifunctional I don't mind it sorry guys I'm just.. I'm enjoying myself",
    "transcript_keywords": [
        "USB",
        "audio",
        "Lew",
        "charge",
        "headphones",
        "video Today",
        "thousands",
        "USB ports",
        "USB port",
        "ports",
        "things",
        "base",
        "USB hub",
        "desk",
        "SHARKK Hangover",
        "cool",
        "power",
        "system",
        "USB cable",
        "hub"
    ],
    "transcript_entity_values": [
        "thousands and thousands and",
        "Lew",
        "USB",
        "SHARKK",
        "three",
        "first",
        "Mac",
        "Today",
        "patty"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON"
    ]
}