{
    "id": "bh3s-iBDjKA",
    "title": "Nintendo Switch Review: Game Boy Grows Up",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-03-08T22:02:34Z",
    "video_url": "https://www.youtube.com/watch?v=bh3s-iBDjKA",
    "category": "People & Blogs",
    "tags": [
        "nintendo switch review",
        "nintendo switch games",
        "nintendo switch",
        "zelda breath of the wild",
        "zelda",
        "mrmobile",
        "michael fisher",
        "imore",
        "game boy 2017",
        "nintendo 2017",
        "new nintendo",
        "best games of 2017",
        "best portable gaming device",
        "joycons"
    ],
    "views": 224651,
    "likes": 7800,
    "comments_count": 535,
    "description": "The Game Boy for a new generation. The home console you take with you. The new Nintendo for your pocket. Whatever droll headline you can dream up for the Nintendo Switch, it's guaranteed to fall short  because this truly is a gadget like no other. I bought the Nintendo Switch thinking it would be a fun excuse to review something other than a smartphone or laptop ... but half a week in, Zelda has completely taken over my nights, and my days are spent bleary-eyed, pining for the feel of Joycons under my thumbs. This honeymoon phase can't completely compensate for the Switch's missteps, and I'm worried about what happens when I finally finish Breath Of The Wild ... but I'm hopeful that this new category of device inspires enough developers to write enough games to keep the Switch afloat. If you're weighing the cost/benefit of buying a Nintendo Switch of your own, click on through to the MrMobile Nintendo Switch review ... and hold on to your wallet; it gets bumpy from here.   [SPONSOR]  MrMobile's Nintendo Switch review is brought to you by MintSIM, the new way to get high-speed LTE in the US.   Head to  and use discount code MRMOBILE20 for 20% off. You'll receive unlimited talk and text, with insanely low prices on ultra-fast, reliable 4G LTE data. Here's how it breaks down after the coupon is applied:  -2GB of high-speed data just $13.60 per month -5GB of high-speed data just $20.27 per month -10GB of high-speed data for just $26.93 per month  (Savings based on 12-month plan. Includes regulatory recovery fee. Plan requires compatible phone. Please see mintsim.com for details.)  MintSIM: premium-quality service on a premium-quality network, for a fraction of the price.   [SUBSCRIBE]     [ABOUT THIS REVIEW]  MrMobile's Nintendo Switch review was produced following 4.5 days usage with a retail Nintendo Switch device purchased by Mobile Nations.   Portions of this review were filmed in the historic Schrafft's building in Charlestown Massachusetts. More information available here:    [PRODUCTS IN THIS VIDEO]  Nintendo Switch with Gray Joycons:   Nintendo Switch with Neon Joycons:   Nintendo Switch Elite Player Backpack:   Meze Classic 99 Headphones (10% off):    [LINKS]  Nintendo Switch Review at iMore:   Nintendo Switch teardown at iFixit:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Lifetime Travels\" by Cymatix, available at Premium Beat:   \"Groove Science\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://mintsim.com",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://www.flatleyco.com/properties/schraffts-city-center/",
        "http://mrmobile.tech/15u",
        "http://mrmobile.tech/15v",
        "http://mrmobile.tech/163",
        "http://mrmobile.tech/os",
        "http://www.imore.com/nintendo-switch",
        "https://www.ifixit.com/Teardown/Nintendo+Switch+Teardown/78263",
        "https://www.premiumbeat.com/royalty_free_music/songs/lifetime-travels?auto",
        "https://www.premiumbeat.com/royalty_free_music/songs/groove-science",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] For nostalgia junkies, the spring of 2017 is a heaven of retro riches. But the Nintendo Switch isn't just a new box you plug into your TV, nor is it just another tablet to take on trips. It's both: a blend of on-the-go and on-the-couch game console. And while I am not at all a gamer, pulling myself away from Zelda long enough to make this video, it was tough. I'm Mr. Mobile and this is the Nintendo Switch review, brought to you by Mint SIM. (electronic music) For a guy whose last hand-held console was the original Game Boy, the Nintendo Switch is a lot to unbox. The core tablet is bigger than I expected at 6.2 inches and it gets wider still when you slap on the twin controllers that Nintendo calls Joy-Cons. It still weighs in at under a pound though. Unlike most modern phones or tablets, the Switch doesn't have a heavy metal casing. And it also doesn't go out of its way to be especially sleek. From the front firing speakers to the fan vents, to the game card and headphone ports, the USB socket, this thing is pocked with penetrations. And it's plastic on plastic on plastic. It feels pretty well made though with the exception of the flimsy kickstand. Why have a kickstand? Because the Joy-Cons don't need to be connected to the Switch to work. They're two little independent controllers for each of your hands, or one in each person's hand for multi-player, complete with accelerometers so you can swing 'em around like Wiimotes. And they're durable so you don't have to worry, throw 'em around, frustrated because your opponent cheats. (exclaiming) - There can only be one. (both laughing) - [Michael] If it's just you playing, you can step 'em both into the Joy-Con grip, included in the box for a more comfortable click and clack. However you use the Joy-Cons, their tactile push and pull is much more satisfying than the slick plastic display. Though games can take advantage of that touch screen as well. And if that 720p canvas starts to feel a little confining, you just hook up the dock to your TV with the included HDMI cable, and drop the Switch in. There's no rebooting, no configuring, your game just goes from the small screen up to the big one and you pick up where you left off, this time in full HD. Now when your sibling or roommate or cheating coworker comes along and whines that you're hogging the TV during Full House or whatever, you just reverse the process. Unplug the tablet, slap on those Joy-Cons and keep on slaying wherever you want. This is the Switch that gives the console its name and it's just as effortless as the commercials make it look. In my four days with the device, I only ran into the Joy-Con connection problem I've read about elsewhere, once. But I should mention that I've mainly kept the Joy-Cons either connected to the console or mated with the grip. I've also been very tender with the tablet to avoid scratching, what I hear is a fragile display cover. Fortunately, Nintendo offers no shortage of accessories to protect your purchase and a nice looking bag to tote around all the stuff you'll need for a gaming weekend away from home. On the topic of buying stuff, start saving your money now. I don't mean for the Switch itself. I think 300 bucks is actually a fair price, considering all the product potentially you're getting. It's the games that'll drain your wallet. Whether you buy the cartridges or download them over wifi. If you scoffed at the $10 price for Mario Run on your phone, you'll probably balk at the new Zelda's $60 sticker price. With those prices, it's obvious that Nintendo is pushing this as a home console. And while it's cool, it's not that. Not yet anyway. Now I got over that sticker shock after just a few minutes of Breath of the Wild. My first exposure to any Zelda title. It offers an enormous world that's every bit as engrossing as you've heard. My concern is what happens after I finish it. The Switch launched with fewer than 10 available games. While I've enjoyed driving like a jerkwad in Fast RMX, I don't see it holding my interest nearly as long. And 1-2-Switch is a cute multi-player diversion that deserves credit for being playable by feel, you really don't have to look at the screen if you listen to the sound cues and pay attention to the rumble of the Joy-Con in your hand. But I was kind of over it really quickly, and not just because I kept losing for some reason. The platform's first Mario title, Mario Kart 8 Deluxe, is over a month away. And Mario Odyssey won't shelves until the holidays. Given Nintendo's track record, I'm concerned that the Switch's game ecosystem will be slow to show up. The company does promise 100 titles by the end of year, for what that's worth. That ecosystem worry eclipses my other smaller annoyances with the Switch, but they're worth mentioning. There's only 32 Gigs of storage here, so you'll have to buy a micro SD card if you wanna download more than a few games. Even though Bluetooth is built in, Bluetooth headsets aren't supported. You have to rely on wired headphones here. While the onboard battery is big, it'll still only last about three hours when playing a heavy title like Breath of the Wild. And some people think it's dumb that the Switch doesn't offer a web browser or apps, even though it easily could. But personally, I'd much rather use the browser on my phone or tablet. In fact, I rather like that when I'm using the Switch, I'm not sharing the screen with notifications or being pestered by pings from a Slack app. I pick up a Nintendo device in 2017 for the same reason I did in 1991: to have fun, not to multitask. And the Switch, has Nintendo's flair for fun, laced all throughout it. It's a delight to use on big screens and small. And if you don't mind risking a few bucks on a nascent ecosystem, I think you're really gonna love it. I sure do. Mr. Mobile's Nintendo Switch review is brought to you by Mint SIM, the new way to get high-speed LTE in the U.S. Head over to mintsim.com and use the discount codes in the description for premium-quality service on a premium-quality network for a fraction of the price. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "Nintendo Switch",
        "Switch",
        "Nintendo Switch review",
        "Mobile Nintendo Switch",
        "Nintendo",
        "Switch game ecosystem",
        "nostalgia junkies",
        "retro riches",
        "heaven of retro",
        "Switch game",
        "Switch review",
        "game",
        "JoyCons",
        "Nintendo calls JoyCons",
        "tablet",
        "games",
        "Mario",
        "console",
        "Mobile Nintendo",
        "Mint SIM"
    ],
    "transcript_entity_values": [
        "300 bucks",
        "10",
        "2017",
        "1991",
        "Mario",
        "about three hours",
        "House",
        "LTE",
        "the Joy-Con",
        "Nintendo",
        "Switch",
        "Wiimotes",
        "Breath of the Wild",
        "100",
        "Mario Run",
        "Slack",
        "the Nintendo Switch",
        "clack",
        "USB",
        "Game Boy",
        "Mobile",
        "a few bucks",
        "four days",
        "just a few minutes of Breath of the Wild",
        "first",
        "1-2-Switch",
        "Zelda",
        "Michael",
        "U.S.",
        "two",
        "Gigs",
        "Mario Odyssey",
        "the holidays",
        "the spring of 2017",
        "Mario Kart",
        "the Joy-Cons",
        "Mint SIM",
        "a gaming weekend",
        "the end of year",
        "Mint",
        "6.2 inches",
        "Joy-Cons",
        "fewer than 10",
        "Nintendo Switch",
        "SD",
        "one",
        "60"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "DATE",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY"
    ]
}