{
    "id": "bHC5txnD520",
    "title": "This Is NOT Another iPad...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-11T20:43:20Z",
    "video_url": "https://www.youtube.com/watch?v=bHC5txnD520",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "wacom",
        "wacom mobile studio pro",
        "mobile",
        "studio",
        "pro",
        "wacom tablet",
        "cintiq",
        "mobile studio pro review",
        "mobile studio pro unboxing",
        "test",
        "drawing tablet",
        "drawing",
        "ipad",
        "ipad pro",
        "apple",
        "apple ipad pro",
        "wacom cintiq",
        "intel",
        "intel core i7",
        "core i7",
        "i7",
        "core",
        "tablet pc",
        "convertible",
        "laptop",
        "notebook",
        "best drawing",
        "best drawing tablet",
        "ipad vs",
        "ipad pro vs",
        "apple pencil",
        "pencil"
    ],
    "views": 2760096,
    "likes": 54053,
    "comments_count": 3490,
    "description": "Wacom Mobile Studio Pro (USA Link) -  Wacom Mobile Studio Pro (International) -   Thanks to Casper for sponsoring today's episode. Click here to get a special deal ($50 off) on a new mattress -  (THEN USE CODE UNBOXTHERAPY TO APPLY DISCOUNT).  The Wacom Mobile Studio Pro provides the most precise touch recognition I've ever experienced. The Mobile Studio Pro certainly isn't an iPad.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2ki6MiZ",
        "http://geni.us/OwOgRR",
        "http://casper.com/unboxtherapy",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So today I got something really quite fancy here I'm very exited to check it out This is the new incarnation of the professional drawing tablet If you know anything about drawing tablets then you have probably heard of Wacom before Inside this box is not just a drawing tablet but it's also a complete PC It operates like a laptop with the pen input from the masters at pen input That's what the mobile studio pro is and i'm pumped to check it out Inside the box I've got the 16 inch with the core I7 chip 512 gigabyte SSD That's the one I've got in this box Which I do need a knife for Jack attack This is no ipad. Alright? This is not an Apple Pencil This is sort of more what digital artists are in tune with using 3840 by 2160 pixels inside of this 16 inch display that's pretty incredible Getting in there nice and tight pixel for pixel with a tip *Box Shaking Noises* WOOOOOOOHOHOHO! OHHOHOHO! That is slick That is slick! Jack you gotta appreciate that Maybe we can finally start that animated segment on the show Shhh Shhh So in here is a pretty slim power adapter A type c connector on this end Oh I guess there's a level of personalization there So you can swap out this silver ring down here for a different color Black, Blue, Green or Red A little personalization Now here's a thing these guys know how to do a pen. Look at that right there! Nice and substantial A couple of buttons on there The eraser, which is also a button, I mean you could use that for something else if you want but makes sense as in a eraser And then this here, it keeps the various tips if you have to change out this nub right here you've got a couple of extras right in there Hopefully Jack can get uptight He's usually uptight anyway YES! Look at that! That's where you're pen lives! How nice is that? You just slide it down You might mistake it for a cigar A cuba cigar or something like that, Jack? The power extension for the power brick You can put this little adaptor here inside the kensington lock of the mobile studio pro and then keep the pen attached to the unit itself You see me working on thumbnails and stuff? I'm gonna be chilling on the couch now Be like Leonardo da Vinci over there Brem Brend Pablo Picasso You know what the best way to remember artists is is the Ninja Turtles. The're all named after famous artists, right? I'd pay a guy named Donatello to paint this entire place right now. Oh Man! If that doesn't get you motivated to create something I don't think anything will OHHOHOHOHO! The display does not have a glossy finish Very low reflections A number of cameras and censors here I believe this is for the Intel 3D the real scene Map out environments you can do all kind of crazy stuff with that SD card slot, Headphone jack You have 3 USB type C connectors and then the kensington lock I told you about earlier Alright so I got this thing booted up right now and I gotta tell you it is a lot of fun I go ahead and launch into sketchpad real quick Just maybe I wanna get my inner Bob Ross going Bob Ross is always all about like crimson Let's See, I'll draw the horizon over here Maybe I'll draw a little tree up on there You know what Bob Ross always says, Jack? He says there are no mistakes only happy accidents Wonderful Greenery Look how, Look at this abstract beauty in here Some shrubs coming up over here Some flowers Look at that, you didn't think I was gonna, you didn't think I could do all this! Yeah, there we go My abstract sunlight going on Maybe there's some water Now listen, I'm not gonna win any awards for this but I'm just trying to show you the level of flexibility that the speed Like, it's so responsive it's beyond touch Standard Jack in the house now Today, he's gonna be wearing a hat And as usual though the man is miserable You can see there Absolutely miserable And you can see the thumb is going down It's a thumbs down from Jack As usual So the cursor begins to hover in the spot your about to draw. Just so you know that it's gonna be accurate But then you can trigger a line while not actually touching the display, See that? Now lets get into something more practical Lets say I'm playing around with a thumbnail for a video and I wanna make some modifications to it In most photo editing apps there are tools where you can kinda automatically select the different color variants But things always get a little sketchy in and around the edges with a level of precision that would be impossible to achieve with a mouse You can see that I can come in here and trace around the outside edge Now the other cool thing is this little guy over here actually acts as a scroll It's just a different level of precision then what your able to achieve with a mouse and definitely not poking away the touchscreen with your finger I'm gonna head to that couch right now I'm saying bye bye to my desk for a while I'm just gonna be working, I'm just lounging back, I'm just working, I'm just lounging Pixel for pixel, that's some bang right there Bang for the buck Buck for the bang And you know what you don't have to take it from me the real artists know I mean, there's tons of videos out there I even briefed myself by watching a few of them People do incredible things on these tablets Its not just Jack, alright, it's not just stick figures like this Check it out, I'm serious If you have any creative inclination this could be for you You listen here and you listen good This episode of Unbox Therapy has been brought to you by the fine folks at Casper Look at this! That's a mattress! They ship you a high quality mattress to your door. You throw out the junky one Take a look at your mattress right now! It's terrible! Your waking up in the morning at the sore neck, you got the lower back! So here's cool thing though you're thinking, Lew it's a mattress in a box! How do I? What if i wanna test it out? Get a little snooze before I purchase it? That's not really a problem here because they'll let you try this thing for 100 days If you don't like it at that point, It's free shipping to you and then free shipping back OOOO! WOW! OOOO! It's coming to life! You slice the plastic and it's like fwoo! I'm gonna kick the shoes off real quick! I'm gonna enjoy this right now! Ooh Ooh Ah You know what they weren't joking man Apparently you can get a deal on this right now You gotta head to casper.com/unboxtherapy or head to the link in the description You can be like me Family foam It's absorbing my body right now Casper",
    "transcript_keywords": [
        "professional drawing tablet",
        "heard of Wacom",
        "gigabyte SSD",
        "Box Shaking Noises",
        "professional drawing",
        "drawing tablet",
        "pen input",
        "Jack",
        "drawing",
        "Bob Ross",
        "box",
        "Jack attack",
        "Inside",
        "Wacom before Inside",
        "Box Shaking",
        "input",
        "show Shhh Shhh",
        "Wacom",
        "SSD",
        "pixels inside"
    ],
    "transcript_entity_values": [
        "Map",
        "OHHOHOHOHO",
        "this 16 inch",
        "Lew",
        "16 inch",
        "Unbox Therapy",
        "Pablo Picasso",
        "Leonardo da Vinci",
        "Brem Brend",
        "SD",
        "Bob Ross",
        "USB",
        "SSD",
        "Standard Jack",
        "Today",
        "Jack",
        "Nice",
        "cuba",
        "512",
        "kensington",
        "I7",
        "3",
        "Donatello",
        "Buck",
        "Black, Blue",
        "2160",
        "100 days",
        "Intel",
        "Apple Pencil",
        "Casper",
        "Bang",
        "Casper Look"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "GPE"
    ]
}