{
    "id": "BJRccu6aXHM",
    "title": "Nvidia RTX for Laptops",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-08-23T17:13:42Z",
    "video_url": "https://www.youtube.com/watch?v=BJRccu6aXHM",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "nvidia",
        "geforce",
        "RTX",
        "laptop",
        "mobile",
        "turing",
        "pascal",
        "benchmarks",
        "ray tracing",
        "ray trace",
        "Ray traced",
        "DLSS",
        "4k",
        "HDR",
        "best gaming laptop",
        "best laptop",
        "best price",
        "GTX 1080",
        "GTX 1070",
        "GTX 1060",
        "RTX 2080",
        "RTX 2070",
        "RTX 2060",
        "RTX 2050",
        "performance",
        "best performance"
    ],
    "views": 414227,
    "likes": 14787,
    "comments_count": 1128,
    "description": "Nvidia Geforce RTX laptops are coming! Before I review them, here are some early thought on the mobile Turing architecture Acer Laptop on Sale -  ASUS Laptop on Sale -  MSI Laptop on Sale -   Ray tracing looks to be the future of graphics acceleration but we're still a ways out from mainstream adoption of that technology. Look for Geforce RTX 2060 and RTX 2050 in upcoming laptops.  Background Music: Fili - Sunday Vibes  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2wjTGcR",
        "https://amzn.to/2MOdteL",
        "https://amzn.to/2MJMSiY",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2d here So NVIDIA recently announced their geforce RTX line up some hardware for desktop gaming that looks honestly quite interesting but I wanted to talk about how that whole GeForce RTX lineup translates into hardware for laptops and Where do we begin? Okay, let's kind of talk about performance first Normally at any kind of like announcement of hardware especially with Nvidia they will kind of showcase the new hardware and then compared to the old hardware and give you some really hard facts like You know, it's eight percent better ten percent better 20 percent better. Whatever it is It's usually a snoozefest but by the end of the presentation the audience kind of says hey I have a general understanding of how much better The new product is compared to the old product But they didn't do that this year because GeForce RTX is kind of a it's a different beast. It's kind of like a conceptualization of what Gaming hardware is instead of kind of using teraflops and measuring it through that kind of like traditional measurement They're using a new type of metric that focuses on ray tracing Capabilities and it's something that the older generation Of cards like the 10 series or earlier or just terrible at so it's no surprise that the RTXseries is so much better at this particular metric, but if you look at the actual utility of RTX like if you look at the actual Usability of ray tracing and all of the kind of cool stuff that comes with it. It's It's not for now. It's for the future and if you look at games like right now I don't think it'll be as substantial as we might hope because yeah, you're getting more CUDA cores You're getting more efficient Hardware you're getting faster ramp But the marketing math just doesn't check out that performance bump that they're claiming is really catered towards ray tracing operations Which is great and everything, but in 2018 and even 2019 That's not the real metric that I think we should be looking at when it comes to \"gaming\" performance So when it comes to laptops, yeah RTX is gonna be nice But I don't think would be like it's not gonna be a massive jump. That's that's what I'm saying The other thing I want to talk about is wattage So if you look at the numbers RTX GPUs draw a lot of wattage that 20 80 is pulling 215 watts Which is quite a bit more than last year's 1080 and when you shrink it down until like a laptop version or even a max-q Version you're gonna have a tough time cooling something like that even in a thick boy like this So realistically speaking we're looking at the 20 60 s or the 2050s people to fit into like a more traditional Gaming laptop chassis those probably won't come out until the very end of this year or maybe early 2019 Now the last I want to talk about is just kind of the direction of this whole RTX hardware so in the laptop industry I said this last year the whole shift of Mobile gaming has been towards like faster and smoother screens and like we saw this year more laptop companies are pointing 120 Hertz screens 144 hurt screens into their devices even entry level gaming laptops have faster screens than they did a couple years ago, which is great But this whole RTX stuff is focused on image quality They're so focused on like that hyper realistic look, which is awesome. Like I Appreciate what they're going for but in this current generation of mobile hardware It doesn't fit that flow of hardware Like we're looking at demos with incredible visuals, but you take a huge hit on frame rate So we tilt to hit that real time rate race. Look we're talking 60 frames per second 1080p which is still really impressive But it just isn't how I play my games right now right now if you have good hardware I like to go for high frame rate really smooth visuals and Not worry so much about image quality because when you're playing you're just like focused on the at least for the games that I play So I don't know RTX is cool And I think in the future it's gonna be like really really cool the whole ray tracing stuff and that developers pick up on it But right now if you're looking at a gaming laptop RTX is neat, but it's not that neat Okay, overall thoughts if you're interested in buying a laptop right now in fall of 2018 or kind of late 2018. I I say go for it you don't do wait for RTX I don't think that enough games will take advantage of the whole rate racing stuff and also don't think that the performance bump from the 10 series to the kind of RTX 20 series will be that big especially in laptops. But yeah, especially especially because there's so many sales right now and videos trying to kind of push their 10 series Hardware off the shelves and you're getting better pricing and stuff I'll link some below but because of back-to-school sales and some newly announced hardware You get some really good pricing on some powerful laptops, okay? Hope you guys enjoyed this video thumbs If you liked it subs who you loved it. See you guys next time",
    "transcript_keywords": [
        "RTX lineup translates",
        "geforce RTX line",
        "GeForce RTX lineup",
        "RTX",
        "geforce RTX",
        "gaming laptop RTX",
        "hardware",
        "kind",
        "NVIDIA recently announced",
        "RTX line",
        "RTX lineup",
        "NVIDIA recently",
        "gaming",
        "RTX hardware",
        "honestly quite interesting",
        "lineup translates",
        "ray tracing",
        "Gaming laptop",
        "talk",
        "laptop RTX"
    ],
    "transcript_entity_values": [
        "60",
        "Dave",
        "this last year",
        "Mobile",
        "Hertz",
        "20 percent",
        "GeForce",
        "geforce",
        "this year",
        "CUDA",
        "a couple years ago",
        "20",
        "2018",
        "early 2019",
        "eight percent",
        "120",
        "215 watts",
        "NVIDIA",
        "2019",
        "first",
        "2050s",
        "10",
        "20 60 s or",
        "RTXseries",
        "1080",
        "last year's",
        "ten percent",
        "late 2018",
        "Nvidia",
        "20 80",
        "144"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}