{
    "id": "bjZE1fwAyJ4",
    "title": "A Keyboard Made Of Wood?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-01-23T20:19:39Z",
    "video_url": "https://www.youtube.com/watch?v=bjZE1fwAyJ4",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "computer",
        "pc",
        "oree",
        "wood keyboard",
        "mac",
        "apple",
        "mac keyboard",
        "tech",
        "technology",
        "unbox therapy",
        "unboxtherapy",
        "review",
        "unboxing",
        "iphone",
        "iphone 6s",
        "android",
        "gadgets",
        "best",
        "gaming",
        "apple iphone",
        "new",
        "wireless",
        "wireless keyboard",
        "samsung",
        "iphone 6",
        "smartphone",
        "iphone 6s plus",
        "6s",
        "s6",
        "smartphone (video game platform)",
        "iphone (video game platform)",
        "android (operating system)",
        "apple inc. (publisher)",
        "tablet",
        "6s plus",
        "macbook",
        "imac",
        "apple iphone 6s",
        "iphone 7"
    ],
    "views": 5167824,
    "likes": 97677,
    "comments_count": 6649,
    "description": "So how good is wood?  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- All together now, three, two, one, (inhales and exhales) Yes! What's up guys? Lew here, back with another video. Before I get into it, I wanna, I wanna give a big shout out to all you crazy Unbox Therapy maniac style fans. Take that as a compliment. I mean it in the best way possible, that came out on Twitter and helped to vote for NBA All-Star Weekend. Helped vote my good guy Kyle Lowry into the game. We got like a crazy number of retweets. I just, I dunno, I felt like I needed to say something, give you guys some appreciation for that. If you didn't see it happen, you can catch up with the news on my Twitter, but I think we did enough to alter history. You did. Jack, not so much. Can we get a retweet Jack, is it that hard? Maybe next time, Jack says. Maybe next time. Rollin'! Today I've got something in front of me. Actually, I just realized I don't even know how to pronounce that. It wouldn't be the first time. It's French. The accent, God how do I interpret the accent? Oree? Or Or-ee? This is a keyboard made of wood. They got in touch with me. They were like, \"we got this keyboard, it's wood. \"We make all kinds of gadgets out of wood. \"You wanna check that out?\" I'm like, \"wood is good. \"Let's do it.\" Wood is good? What am I... Anyways, they make different gadgets out of wood. The stuff looks really amazing and I was like \"all right, send one out.\" I haven't opened this yet. I don't know what it looks like. A fairly standard box here. Wow, a journey for the senses. At first, the halo of its natural materials adorned by a timeless, minimalist design meets the eye. Intuitive gestures unearth the technology mystery and the sophistication behind the tool. Only the patina of time and usage will fully reveal the soul of this unique piece. Is that, was that poetic? I don't know. Ooh... Okay, so it's Bluetooth, wireless. Work with, obviously computer, tablet, phone. Oh my... That is wood! I know that's what I should've expected but oh, stop it, this is cool. Even the on/off switch is wood as well and the connect button. Some LED lights up on the top. These two screws probably reveal the battery compartment, I assume. So that's all we need. It's wireless, of course. Look at that. Now this isn't like a wood-looking finish. This is... wood. Real wood. It's not just the structure, but the...each keycap. Over time, this will change like a natural wooden product because that's what it is like a fine wine? I don't know. Let us pair. This is actually an opportunity for a scale comparison. Here, my friends, is a Macbook Pro keyboard. This guy is about the same size, actually. Switch it on, press connect. Ooh, we are connected. What's up, guys? Lew here, back with another video. You know what? For a compact keyboard, not too shabby. You guys probably wanna know how loud it is. I'm gonna just be quiet for a moment. (shushes) Not very loud, actually. Your multimedia controls, just like on your Apple keyboard, are mapped over there. Play, pause, volume, brightness. They chopped down the shift key a little bit here and put an extra delete key, that's interesting. I didn't notice that at first. Is that a European thing? Cmd button as well, rather than a Windows button, so taking some inspiration once again from the Apple ecosystem. But anyway, there you have it. Essentially, what this is about, is having something that is unique and unusual. Something that you can put on your desk and (inhales) smell. That's wood. Yeah, I mean it's a nice little piece. You wanna have a special desk, kind of, environment. Or-ee, Oree? It doesn't really matter. My French is terrible. The craftsmanship here surely is not. Thanks very much for watching. Hope you enjoyed this content. Hope that, as usual, I've introduced you to something that you find interesting and didn't know existed. That's the mission over here. Also, thanks again for all those crazy votes on Twitter. If you don't follow me on Twitter, go check it all out. That link will be in the description as well. Leave a thumbs up if you enjoyed this content and I will catch you very shortly on the next episode. Later guys.",
    "transcript_keywords": [
        "wood",
        "crazy Unbox Therapy",
        "Twitter",
        "Unbox Therapy maniac",
        "Oree",
        "time",
        "guys",
        "Unbox Therapy",
        "keyboard",
        "guy Kyle Lowry",
        "Jack",
        "NBA AllStar Weekend",
        "crazy",
        "Kyle Lowry",
        "crazy Unbox",
        "good guy Kyle",
        "good",
        "button",
        "guy Kyle",
        "French"
    ],
    "transcript_entity_values": [
        "two",
        "Twitter",
        "Macbook Pro",
        "Apple",
        "Lew",
        "one",
        "Kyle Lowry",
        "three",
        "first",
        "French",
        "European",
        "Windows",
        "NBA",
        "Jack",
        "Rollin"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "NORP",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON"
    ]
}