{
    "id": "bKe6Mrz5gis",
    "title": "What the HECK is Quibi? (The $1.75 Billion Fail) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-12-10T18:59:31Z",
    "video_url": "https://www.youtube.com/watch?v=bKe6Mrz5gis",
    "category": "Science & Technology",
    "tags": [
        "What the HECK is Quibi? (The $1.75 Billion Fail) - Krazy Ken's Tech Talk",
        "Quibi",
        "iPhone",
        "iOS",
        "iPadOS",
        "Jeff Katzenberg",
        "Meg Whitman",
        "Android",
        "Apple TV",
        "Chromecast",
        "Turnstyle",
        "Eko",
        "Lawsuit",
        "Disney",
        "WarnerMedia",
        "TikTok",
        "DreamWorks",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Movies",
        "TV Shows",
        "Computer Clan"
    ],
    "views": 318710,
    "likes": 11127,
    "comments_count": 787,
    "description": "What the heck is Quibi? Why did it shut down in only 8 months? Did it really gain almost 2 billion dollars?! Hey no one said revolutionizing mobile video would be easy. Let's take a look at what happened.  Download our epic wallpapers   Support our channel and get cool stuff   Subscribe for more tech videos!    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - What the HECK is Quibi? (The $1.75 Billion Fail)  Special thanks to Sage for helping write this episode.    Patrons got to see this episode early (and in much higher playback quality). They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "https://www.youtube.com/channel/UC1YdCbwdttqgFo4mo9kj3Ug",
        "http://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "(electronic music) - Hey guys, how are you all doing? If you're new here, well, sorry about that. Anyway, if you're new here, welcome. My name is Krazy Ken. And today we're going to be talking about Quibi. You've probably heard of it before, but you have no idea what it is. That's okay. I don't either. So I wanted to look into it more, and thanks to my buddy Sage, who helped me research this, I actually learned a lot. And I'd like to share that with you today. In the end, this venture ended up getting over $1.75 billion invested into it. The actual number probably is higher than that but it collapsed in only eight months. With all this power and money behind it. How did it die in less than a year? And also back to the basics, what is Quibi? Those are all valid questions. So I want to help answer all of those and more, right now. Quibi was a mobile-only streaming service. The name is a portmanteau for quick bites. The service was operated by Quibi Holdings. A privately held company founded in August, 2018, under the name New TV by Meg Whitman and Jeffrey Katzenberg. Meg Whitman was a CEO at eBay overseeing massive expansions, including the PayPal acquisition in 2002, and Skype in 2005. Yeah, you may owned Skype for awhile. I had no idea either. In 2008, she became CEO of Hewlett Packard, and she resigned in 2017. Katzenberg on the other hand, is a story for a whole different day. But in short he's a big wig in the film and media worlds. He had leadership roles at Paramount Pictures the Walt Disney Company, and he co-founded Dreamworks along with Stephen Spielberg, and David Geffen. So he's a big deal. Anyway, back to New TV it was time to raise the moolah. Disney, NBC Universal, Sony Pictures, Viacom CBS, WarnerMedia, and tons of other big names invested in New TV. And at this time, New TV raised about a billion dollars in funding. How did they raise so much? Because Katzenberg. The dude had one hell of a rsum. Could you imagine that guy applying somewhere? I think you're a little overqualified to work at Pizza Hut. So the money was coming in. And in October, 2018, the venture was renamed to Quibi. And in June, 2019, the official launch date was revealed: April 6th, 2020. At CES 2020, Quibi was demoed to a bunch of people. I mean, that's a really big trade show. So good place to get more funding. At the end of their second wave, I think they got around, give or take, 750 million more dollars. So add that on top of the billion, we're looking at about $1.75 billion invested into Quibi. So that's the brief history. Now the jarring question, well, one of the drawing questions: what the hell is Quibi? I remember seeing tons of ads for this on Twitter. I guess the awareness was good. But I still didn't understand it. Here's the thing, you know, I'm not a marketing guru by any stretch of the imagination. But I do know that if you confuse, you lose. And maybe that was the big reason why Quibi ended up losing. But anyway, that aside let's dive in to what this thing actually is. Quibi is a short form, mobile-only streaming service with two pricing tiers: $4.99 a month with ads, and $7.99 a month without ads. So everybody and their hamster has a streaming service. How the heck was this different? It was different, because it focused on short-form content, in a Vine, or a TikTok-esque presentation, but with way higher production value. And generally no video would be longer than 10 minutes. In some cases, a feature length film would be chopped up into multiple chapters, for example. For video playback, Quibi used their own little technology called Turnstyle. And this was kind of the big thing that differentiated it from other platforms. So you could watch the video vertically, but you can also rotate horizontally into landscape, and the video would adapt. Sometimes different camera angles would show up, the text would reformat. Sometimes certain things would have a completely different experience. There was one show where you watch it normally in landscape, but when you turn it into portrait, you actually see what's on the main characters phone screen. So there's some interesting things you could do with this concept. Now on a technical level, being a video guy, I think it's kind of cool, the Turnstyle technology. But in the end, is it something we really need? Do we really need a multi-aspect ratio, high production value, mobile-only streaming service? So that's a perfect segue to what I want to discuss next. How did something with so many big names and studios behind it, and with so much money, fail and shut down in only eight months? First off, shows. Loads of money were dumped into the shows, with big stars in them. Now to avoid any copyright issues, I'm gonna keep this part short, and just simplify it. The shows didn't give users enough of a reason to open the app. And that's tough. Even if the shows were good, they're still new. And it takes time to get that momentum built. To make things worse, there was no backlog of already really proven and loved content. But one big reason you couldn't make that work well anyway is if you had a backlog of content, none of it would work with the Turnstyle technology. Next, the lawsuit. Interactive multimedia company, Echo, sued Quibi over the Turnstyle technology, claiming infringement on intellectual property. To Quibi's luck, the preliminary injunction motion was actually denied. But the suit continues. According to an October, 29th article on variety.com, Echo is seeking a $96.5 million payout for damages. This isn't over yet, but I'll keep an eye on it. The next issue was the lack of sharing. So many things I end up discovering, are actually through friend recommendations, or through social media posts. And I'm just going to say it, memes. If stuff is buzzing on Twitter, and there's memes and jokes, that's organic advertising. And I have discovered many cool shows and other products through people just sharing it organically on social media. But with Quibi, you couldn't screenshot anything. So you couldn't share things easily, with pictures and visuals or video recording. Now later, they actually built in a screenshot function. But I don't know how much of an issue truly was. Yeah, it probably hurt a bit. But like every big app that streams video, block screenshots, at least on iOS, iPad, iOS and Mac iOS. You can't take screenshots of Netflix or Hulu on any of those operating systems. So I'm not sure how big of a deal this was. I feel like it was blown out of proportion a bit. But yeah, it was maybe some missed opportunity. Oh, well. Another issue was limited platforms. It was mobile only, but why? If it's mobile only, you miss out on all the people that just want to kick back and relax and watch on their TV or watch on their laptop. Like you miss out on all of that. Now later, they did integrate Apple's AirPlay technology, and Google's Chromecast technology, so you could stream the videos to your TV. But then you would miss out on the Turnstyle technology which was the key unique feature that Quibi offered. So overall it's just bad by design. This next issue is debatable, but I'm going to mention it anyway. The bad launch timing. Quibi launched on April 6th, 2020. But at that time, Pandemic Incorporated was gearing up to launch version 19 of their infamous COVID product. Okay. Jokes aside. Yes, it did launch during a pandemic. So there's gonna be less people standing in line. There's going to be less people on buses and trains and in public transport. That maybe hurt Quibi a bit. It maybe would have lasted a few more months, but it still would have perished. The biggest issue was, they just didn't know what people needed. The people running this didn't know the habits of people on their phones. They didn't know what people wanted. It's hard to do, I'm not gonna lie. I've worked with marketing people a bunch. Marketing is hard. But it is what will make or break a product. Good marketing will carry a crummy product. But at the same time, bad marketing will kill a good product. And on top of that, they were entering already a very competitive streaming market that's very saturated. So Quibi was in a tough spot. What happened next? In September, reports showed Quibi was looking for a buyer. They even approached Apple's SVP of Internet Services, Eddie Cue, but he wasn't interested. And a few weeks later, Quibi announced apps for Apple TV, Fire TV, and Google TV, which solves one of the problems we mentioned earlier. But then literally one day later, can we be published in open letter announcing the shutdown. The service would remain open until December 1st. Everyone was about to be laid off from the company. And it was reported that Katzenberg asked everyone to listen to Get up Again from Trolls to help lift their spirits. I don't know what their severance pay was, but I I just hope they got something a little more than a little music clip. I hope. Then the fateful day came, December 1st. Quibi's Twitter pages locked down, the Facebook post vanished. The Instagram posts are gone. The app ceased to work. However, their main website, and YouTube channel, are still up. As for the shows. I don't know where they're gonna go. I'm sure we'll see them pop up somewhere. In fact, Public Figures already got picked up by HBO Max. So that's one. In the end, Quibi died with about 500,000 subscribers, probably a little more than that. And they actually had a lot of five-star ratings in the app stores. So maybe the app itself wasn't that bad. 500,000 subscribers is more than I have on my YouTube channel right now anyway, so hey, that sounds great. But in the grand scheme of things, that number is dwarfed by how much money was invested into this company. Even if every subscriber paid $8 a month that's only $48 million gross annually, which is nothing, compared to the near $1.75 billion of investment. So even though this idea didn't work out, I won't be surprised if we see something like it in five to 10 years and people are gonna go like, oh my gosh, Quibi did that. They were trying to do that. Like it's gonna happen. Give it some time. I always think about the Zune, and the Zune Pass. The concept for part of it was pretty cool. You pay a monthly charge to subscribe to music. It didn't work out back then. But nowadays tens of millions of people subscribe monthly to music services. So not everything works out. Any entrepreneur will tell you, that in order to succeed, you have to fail a bunch. Even if you have the money, and the reputation of someone like Katzenberg, you're still bound to make a mistake, or just be too ambitious, and it doesn't work out. I applaud the team for trying something at least. So thanks again to my buddy Sage for helping me research this episode. If you'd like to check out his tech and gaming channel, you can do so here. And if you've used Quibi before even if you haven't used Quibi before I just want to know your thoughts. Feel free to write them in the comments below. And if you want to help fund the future of the Computer Clan, plus get some awesome perks along the way. Feel free to pledge on my Patreon. Thanks in advance for your support. I asked Katzenberg for some funding, but he said no. it was only $1.75 billion. I mean, pocket change. And Hey, if you liked this episode, you know what to do. Thanks for sticking with me. Catch the crazy and pass it on. (electronic music)",
    "transcript_keywords": [
        "Quibi",
        "people",
        "big",
        "Turnstyle technology",
        "Katzenberg",
        "Turnstyle",
        "video",
        "work",
        "streaming service",
        "service",
        "technology",
        "shows",
        "things",
        "billion",
        "money",
        "time",
        "Quibi Twitter",
        "mobileonly streaming service",
        "Quibi Holdings",
        "company"
    ],
    "transcript_entity_values": [
        "2017",
        "750 million more dollars",
        "Chromecast",
        "COVID",
        "two",
        "CBS",
        "$1.75 billion",
        "Fire TV",
        "WarnerMedia",
        "$96.5 million",
        "Walt Disney Company",
        "Dreamworks",
        "Eddie Cue",
        "less than a year",
        "NBC Universal",
        "April 6th, 2020",
        "one",
        "a few weeks later",
        "Turnstyle",
        "Zune",
        "Quibi",
        "Twitter",
        "Google TV",
        "tens of millions",
        "HBO Max",
        "about a billion dollars",
        "7.99",
        "2020",
        "Skype",
        "Facebook",
        "Katzenberg",
        "Apple",
        "Instagram",
        "AirPlay",
        "about 500,000",
        "Google",
        "longer than 10 minutes",
        "only eight months",
        "Apple TV",
        "December 1st",
        "Quibi Holdings",
        "monthly",
        "Hulu",
        "about $1.75 billion",
        "4.99",
        "David Geffen",
        "New TV",
        "Sage",
        "the Zune Pass",
        "Jeffrey Katzenberg",
        "Meg Whitman",
        "iPad",
        "Patreon",
        "today",
        "YouTube",
        "Krazy Ken",
        "October, 2018",
        "500,000",
        "August, 2018",
        "Hewlett Packard",
        "Stephen Spielberg",
        "five to 10 years",
        "the Computer Clan",
        "iOS",
        "19",
        "Disney",
        "one day later",
        "TikTok",
        "June, 2019",
        "Viacom",
        "Echo",
        "only $1.75 billion",
        "2005",
        "PayPal",
        "eBay",
        "only $48 million",
        "Netflix",
        "September",
        "2008",
        "October, 29th",
        "2002",
        "Paramount Pictures",
        "Sony Pictures",
        "Pizza Hut",
        "8",
        "five",
        "First",
        "a few more months",
        "second",
        "annually"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "EVENT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "DATE"
    ]
}