{
    "id": "bkfugZD41tc",
    "title": "Why I haven't reviewed the Apple iPhone 12.... yet - Mini + Pro Max First Impressions",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-11-21T19:58:48Z",
    "video_url": "https://www.youtube.com/watch?v=bkfugZD41tc",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iPhone 12",
        "iPhone 12 Pro",
        "iPhone 12 Pro Max",
        "iPhone 12 Mini",
        "Linus",
        "Unboxing",
        "Smartphone",
        "Mobile Device",
        "Camera",
        "iOS",
        "Face ID"
    ],
    "views": 768541,
    "likes": 33017,
    "comments_count": 2155,
    "description": "Win a prize from Soundcore at   We finally received the iPhone 12 Mini and Pro Max, but why didn't we make a review video on LTT yet? Well, I'll tell you why and give you my first impressions of these two at the same time!   Buy iPhone 12 Mini On Amazon (PAID LINK):  On BestBuy (PAID LINK):   Buy iPhone 12 Pro Max On Amazon (PAID LINK):   On NewEgg (PAID LINK):   On BestBuy (PAID LINK):   Buy iPhone 12 Pro On Amazon (PAID LINK):  On NewEgg (PAID LINK):  On BestBuy (PAID LINK):   Buy Samsung Galaxy Z Fold 2 On Amazon (PAID LINK):      On NewEgg (PAID LINK):  On BestBuy (PAID LINK):   Thanks to dbrand for sending us the iPhones! Check them out at   ShortCircuit long sleeve shirts are back in stock, get them today before the bots buy them all! -    Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://soundcore.club/ThanksLTT",
        "https://geni.us/gIBNjp",
        "https://geni.us/fgfj",
        "https://geni.us/EGfeydI",
        "https://geni.us/OR84QNw",
        "https://geni.us/slGI",
        "https://geni.us/var6",
        "https://geni.us/mVBp1",
        "https://geni.us/Fs2Xi",
        "https://geni.us/xZpg",
        "https://geni.us/FbmoWf",
        "https://geni.us/ze7Q",
        "https://dbrand.com/shortlinus",
        "https://lmg.gg/T3UJp﻿",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I am now two weeks in to daily driving the iPhone 12 Pro. And that might lead you to ask the question, Linus, where is your review of the iPhone 12 lineup? And the answer is I didn't really feel like I can talk about the iPhone 12 lineup. And typically we only do one Linus Tech Tips video per new iPhone launch, until I had met the whole family. And that is just what I'll be doing today. One of these two devices is going to replace the 12 Pro in my pocket. And the reason for that, is I found the 12 Pro to be kind of like a, a tweener, you know? It's not really small enough for me to totally comfortably use it one-handed, but it's not really big enough to satisfy my content consumption, you know, urges, so to speak because remember guys, the device I came from was actually the Galaxy Fold, well the second one, actually, the Galaxy Z Fold 2. So going from that kind of a screen to this was like, eh, yeah, I guess it's okay, It's all right, I guess. So in front of me then is the iPhone 12 Mini and the iPhone 12 Pro Max. Which one you want to see first, Andy? - [Andy] The bigger one. - The big one? You want the big one? You got it, I thought we were going to say the chunk is for the end. All right, let's go straight to the chunkgest. This is the chungessy, chungessiest iPhone that we've ever had. Look at the freaking wait, is that camera bump actually bigger? No, no okay it just feels gigantic because of probably this marble skin from D brand. Of course the phones were sent by D brand because Apple does not send me devices, so there you have it. Well, it's big all right. I really don't know about the squareness at this size, dude. This is a gigantic feeling device, face ID, man. I'm going to talk about it more in the full review, but face ID is like not great for a COVID world where I'm wearing a mask anywhere from six to 10 hours a day, it's not a great experience. Some apps don't handle notifications very gracefully if you don't look at it and have face ID work and you have to like swipe away like Twitter mentions, for example, if you use your passcode to unlock, they're just gone. You can't just pull down the shade or I don't know what Apple calls it, but what I would call a notification shade. You can't just pull it down and be like, oh yo, all those notifications, they're gone. So not being able to use face ID all the time. The fact that there's no fingerprint sensor in these power buttons is driving me freaking crazy. Anyway, let's go ahead and use Apple's super cool painless setup system here. I also hate the security or rather the insecurity of using my pin, my passcode all the time, because you never know if someone's watching, like that's one of the best things about face ID is that your second authentication factor is one that you don't have to have on display all the time. Like I always feel like I'm at a public pin pad. I should be like going like this. Ah, hold your new iPhone up to the camera. Apple's probably sitting there going like, what? Who upgrades from an iPhone 12 Pro to a Pro Max? As with the 12 pro you get a cable and you get a little look at this, got a little SIM removal tool, get that little applet. Hey, they only give one Apple sticker now? It's well-balanced. That's something Apple has always done extremely well. It is, it makes such a big difference in the handling. Like, especially as devices got bigger, it became more and more important for them to be well-balanced because you'd get like a top heavy one and you put it in your hand, oh no, what happened to my phone? Don't worry it's not going to be damaged because we got this three and a half millimeter thick LTT Northern Lights, mousepad lttstore.com, actually it's not available yet. Coming soon though. This video is brought to you by Soundcore The Soundcore thankful giveaway is basically just some appreciation to our viewers. They're giving away over 300 items, including to Soundcore Liberty 2 Pros, 30 Flare 2 Bluetooth speakers, those things are flipping awesome and more. A great feature if you do happen to win a Flare 2, or if you buy one is of course party cast, which allows you to pair up to a hundred, actually, I don't think there's a limit, but we did a hundred of them at the same time off of a single Bluetooth device, it works absolutely flawlessly. My kids use it all the time. So check out the link in the video description to enter the giveaway right away. Transferring data, time remaining estimating. I don't think I have a ton of data on here. I haven't taken like a ton of pictures and video in spite of how outstanding the camera is. All right now let's have a look while this does its thing. Let's have a look at the little bitty Linus sized one. Where is my iPhone 4? Hey Jono, where's that bin of iPhones? This is tiny. Like this reminds me of the first SE or like the five, five and 5S or something. It's even kind of light too. Especially coming from holding one of these more, more chunkesy ones. There's your Type C lightening. Ah, yes, good. Here's my iPhone box. Okay. In terms of size, especially with the case on it's actually not that far off. It is bigger though. God, that notch looks unholy big on a phone this small though. That's like more notch than Minecraft, you know? Know what I'm saying? I won't to try my passcode, but like, wow, this is one handable. Like if you don't do a ton of content consumption on the go with your phone, boy, is that ever handleable. I like it. And what's great is unlike what we've seen happen with Android over the years, Apple hasn't crippled this thing. They didn't go and put like a crappier processor in or anything, this is a full fat iPhone 12, like it doesn't get obviously the same triple camera setup as the iPhone 12 Pro. So there, there is, there are definitely some compromises here, but they're small ones, they're small ones. And I would expect because they're all running the same processor that you would see support last for a similar amount of time compared to the other iPhone 12 family members. - [Jono] How much is the Pro Max? - Pro Max? I don't know, if you have to ask you can't afford it. You know how it is. Should I try and daily drive this thing? - [Andy] Yeah, you should try the Mini. - You're going to miss the screen size. Do you watch any TV or movies on your phone? - [Andy] No. - Nothing? - Nothing. - Oh, see, I'm a big mobile mobile media consumer. Like it. - I would do that while I am popping. - It'd be really tough to have. (laughs) (beep) - Wow. - You know what really has been bothering me too in the last couple of weeks? The fact that you can't just put anything you want in command center. And also why the (beep) is there not a settings command center doodad? And what is with the arbitrary sorting in here? Like why is camera in like where's camera again? I was looking for camera, it took me like ages. Yeah there. Why is camera in with like photos and Apple TV and like game center? And they don't have headers. So there's no like clear rhyme or reason behind how these things are grouped here. Why is App Store and wallet and, (high pitch buzzing) Okay, sorry, sorry. This is not, this is not my review of the phone. I just want to watch a movie on a big iPhone screen because boy is the screen ever gorgeous with chunk. It's not even thicker. It's just it's squared off. You know, I thought I wanted this, which is what's really funny about it. Like that was one of the first things that I said I was excited about yet actually using it daily, really just not as comfortable. So here's the 11 Pro Max for comparison. Very similar width, actually a touch, no, it feels really big, 'cause it just is really big. Okay. They really haven't done much about how thick those bezels are either, have they? Touch thinner total. And I guess the squared offness helps with that. So it does mean that the screen is larger. I am so disappointed that the notch, A continues to be there at all and B continues to be so darn good. Wait, Andy, I initially said they didn't look different. Wait, is that camera bump actually bigger? No, no okay. But I was totally wrong. No, they're totally different. Look how much bigger the one on the 12 Pro Max is. So that's, that makes sense. 'Cause it does have a longer telephoto lens. Well, that's one compelling reason to carry a bigger chunkgus phone in your pocket. Having up to two and a half X optical zoom is pretty nice too. Let's fire up YouTube for some content consumption. Man, that is really small. And look at this. Oh my God, look what they did. When you're watching full screen 16 by nine content, you're not just dealing with the rounded corners, you get a little bit of notch. Oh, why did you do this? Your Apple, you can create a display in any aspect ratio and form factor you want, all you had to do was make the phone one millimeter taller. - Oh to be fair, our aspect ration is 2:1. - Oh, oh, that's true it is, it's 2:1, you're right. It's on us, it's on us. Why couldn't we just make our video one millimeter narrower? You know what? The more I play with the Pro Max and the Mini, the more I'm like yeah, the 12 and the 12 Pro are probably the right size. And given that the features of the 12 Pro, so you get the LIDAR scanner as well as the third camera are like not going to make a huge deal to the vast majority of people, the 12 looks like the winner, doesn't it? Unless you absolutely must have a tiny iPhone because you're still rocking the like 5S or something and you, you can't let it go. If that's you, if you're one of these, this is going to be wild, woopsie daisies, this is going to be real comfortable. (deep voice mumbles) The screen is broken or not the screen, the, the protector that was on it. All right then. So what's stronger? What's stronger traditional tempered glass or the ceramic glass? We, we, we mashed iPhones together until we knew for sure. All right, Andy, I'm gonna do it. I'll try the 12 Mini. I'll put my SIM in this and what you guys should try is getting subscribed to Short Circuit for more first impressions and quick looks and all that kind of stuff.",
    "transcript_keywords": [
        "Pro Max",
        "Pro",
        "iPhone",
        "Linus Tech Tips",
        "Apple",
        "big",
        "Max",
        "camera",
        "screen",
        "time",
        "phone",
        "bigger",
        "Linus",
        "Linus Tech",
        "big iPhone screen",
        "Tech Tips video",
        "Mini",
        "face",
        "video",
        "small"
    ],
    "transcript_entity_values": [
        "Soundcore The Soundcore",
        "Linus Tech Tips",
        "one millimeter",
        "Pro Max",
        "Linus",
        "5S",
        "a ton",
        "One",
        "one",
        "a hundred",
        "iPhone",
        "Minecraft",
        "Soundcore Liberty 2 Pros",
        "Andy",
        "nine",
        "second",
        "six to 10 hours",
        "11",
        "the Galaxy Z Fold 2",
        "Apple TV",
        "over 300",
        "Mini",
        "Twitter",
        "Jono",
        "daily",
        "three and a half millimeter",
        "third",
        "first",
        "2:1",
        "LTT Northern Lights",
        "16",
        "two",
        "iPhone 4",
        "iPhones",
        "Android",
        "LIDAR",
        "the years",
        "30",
        "iPhone 12",
        "SE",
        "Short Circuit",
        "two weeks",
        "12",
        "Linus",
        "the last couple of weeks",
        "the Galaxy Fold",
        "five",
        "2",
        "YouTube",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE"
    ]
}