{
    "id": "bkXggT1Nmkg",
    "title": "Super Famicom on the SNES? Nakitek Game Saver+ Review",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2016-06-07T15:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=bkXggT1Nmkg",
    "category": "Gaming",
    "tags": [
        "Super Nintendo",
        "SNES",
        "Super Famicom",
        "SFC",
        "Nintendo",
        "game",
        "save",
        "Japanese games",
        "Nakitek",
        "Game Saver Plus",
        "Game Saver +",
        "Sailor Moon",
        "savestate",
        "review",
        "This Does Not Compute"
    ],
    "views": 36052,
    "likes": 1393,
    "comments_count": 200,
    "description": "I ended up with a few Super Famicom games, but only have a US-release SNES to play them on. Let's take a look at a product that lets you get around Nintendo's region lockout!  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by C. Scott ( and Anitek ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://freemusicarchive.org/music/C_Scott)",
        "http://freemusicarchive.org/music/Anitek).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? So here's the story: my wife and I were at a local retro games store, and she spotted a stack of Japanese Super Famicom games. They were all from the Sailor Moon series, and she's a *huge* Sailor Moon nerd, so, of course, they ended up coming home with us. But then I was tasked, as you might imagine, with figuring out a way for her to actually play 'em. The catch being that I only have a US-release Super NES. Stick around and we'll take a look at a product that lets you do just this without modifying your console. [ Music - Intro ] Like a lot of its other consoles, Nintendo implemented region lockouts on the platform. The original NES did this electrically with a special lock-out chip. The problem is that this chip proved a bit unreliable. It's often the cause of the infamous blinking red light of death. To keep this from being a problem with the Super NES, Nintendo did the lockout a completely different way. They did it mechanically, through the shape of the console itself. Super Famicom carts have a flat back and a gentle curve on the front, but Super NES games have notches on the back, and the sides of the cartridge are slimmer than in the middle. The cartridge bay in the Super NES itself has tabs that correspond to this shape and prevent Super Famicom games from seating all the way. The thing is, that's the only form of region lockout on the system. If you can get the cartridge to fit, it'll play just fine. The traditional way around this is to disassemble the console and cut out those tabs. But if your Super NES is in really good shape like mine, you may not want to mod it. Another option is to disassemble the cartridge and insert just the bare circuit board. But this can get tedious and you can risk damaging the board through handling. This is the solution that I ended up with: the Nakitek Game Saver+. It's actually been around since when the Super NES was new, but it's seen a bit of a resurgence with the rise of retro gaming. It's meant to work as a save device for games that don't have that feature. You can take a snapshot of your progress and return to it at any time, even after having turned the console off. The Game Saver taps power from your Super NES's AC adapter, or you can jam in six double A batteries. You can save your game by pressing Select and Right at the same time, and return to it by pressing Select and Left. It works a lot like save states in an emulator, putting you back at the exact point in the level you made the save. There are a few downsides, however. First is that not all games are compatible. Some games can work if you press Select while the console powers on and enter a code. But others may not work at all. Second, if you reset the console, you need to wait through all the loading screens and menus, and actually start the first level of the game before you can return to your save. And finally, the device just doesn't work right all the time, either taking the save or returning to it just fails for no apparent reason. Now all this is interesting, but what the hell does it have to do with playing Super Famicom games? Well, this: The Game Saver was designed to work with both the Super Famicom and Super NES; it'll plug into either console. And the slot on the device where you connect your cartridge works with either platform as well. It's an unadvertised feature, but it works perfectly as a cartridge converter. Those games we found at the store start and play without any problems. The best part is that at the time I'm filming this, they can be found on eBay brand-new for about $20 US. There is something a bit curious about these: while you can find Game Savers that are used and obviously, were from the '90s, these new ones all lack their original packaging, manual, and even the label on the front of the device. It was one of these units that I bought for this video, and while it does seem to work fine, or at least as well as the original ones did, it does make me wonder what the story is here. They could be leftover stock from a warehouse that simply never got packaged, or they could be modern knockoffs. But in any event, even if you don't use the Game Save feature, a Nakitek Game Saver+ could be a worthy addition to your collection. If it lets you play some fun Super Famicom games, and keeps you from having to hack up your console, then I think it's money well spent. If you like this video, I'd appreciate a thumbs-up and be sure to subscribe. That helps me out quite a bit. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Super Famicom games",
        "Super NES",
        "Super Famicom",
        "Super NES games",
        "Super",
        "Japanese Super Famicom",
        "Famicom games",
        "Game Saver",
        "NES",
        "Nakitek Game Saver",
        "games",
        "Game",
        "USrelease Super NES",
        "Sailor Moon",
        "Famicom",
        "Japanese Super",
        "console",
        "Super Famicom carts",
        "prevent Super Famicom",
        "NES games"
    ],
    "transcript_entity_values": [
        "Sailor Moon",
        "NES",
        "Super NES's",
        "Second",
        "Nintendo",
        "Super Famicom",
        "the Super NES",
        "about $20 US",
        "Select and Left",
        "eBay",
        "the Nakitek Game Saver+",
        "Instagram",
        "the Super Famicom",
        "Stick",
        "Japanese Super Famicom",
        "Nakitek Game Saver+",
        "six",
        "Super NES",
        "AC",
        "US",
        "first",
        "the Super NES",
        "The Game Saver",
        "Colin",
        "Twitter",
        "the '90s",
        "First"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORDINAL",
        "FAC",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL"
    ]
}