{
    "id": "bLk1cjZ4ll0",
    "title": "How to design an actually good toaster with lessons from the 1940's",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-05-30T15:20:56Z",
    "video_url": "https://www.youtube.com/watch?v=bLk1cjZ4ll0",
    "category": "Science & Technology",
    "tags": [],
    "views": 776032,
    "likes": 44723,
    "comments_count": 4161,
    "description": "I love this toaster so dang much.  Here are those as-promised links in the description; Link ONE: The original Sunbeam video;  Link TWO (why am I yelling?): The Electromagnet in your Toaster   And some other links, too! Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contribution on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   And thank you to the following patrons! Derek Ledbetter, Samus , Tom Powell, geekiskhan , Adrien Sauvestre, nikolaevarius , Nebelwerfer Granitara, Arhiman, Benjamin Rippel, Andrew Johnson, andrew king, Cole Kurkowski, Kenneth M Thomas, Zachary Nash, Chris Gerlinsky, Sykes St., Jonathan Lima, Tony Perkins, John Comtois, JAN R GERSTON, Kyle Halgerson, Stevie T Transmission, Lucas Beveridge, Seth Junot, Laird Burkett, David Gauthier, Jonathan Paz, Ruben Schade, Tyler James, Jason Stielow, Julia Rose, SJ , Cory Durham, Christopher Rebert, Glen Parker, Edward Drozd, Sam Barber, Austin Whaley, Rohan Patil, Nicholas Hubbard, Ryan Bateman, Larry Wheeler, Rob Coleman, Aaron Murray, Jeff Gunn, Liam , Jason Heckenlively, Andira Muttakim, Jesus Villafranca, huitz, Jace Fuse, Denis Phillips, Jon Adams, Eric Noriega, lastsecondsave , Marcus Congdon, Loni Nix, Bernardo , Damnable Nook, Elijah Gould, Tyler Warren, Kevin Ingersoll, Jason Jenkins, C. A. Patrick Voigt, Andrew Hangsleben, Alex , Mike Jacob, Trent Lloyd, Prashant Sinha, reavisrk ., coudy , Matthew Stoldal, Charles Gillanders, Gavin , Danielle Duarte, sheepish.alpaca , Juhani Saarinen, Ashley Hakker, M10360 , Adam Rose, Salvatore Nuzzo, Jake Austin, Thibault Martin-Lagardette, Eric Hoppe, Rob Lion, Nikolaus , Ohad Lutzky, Marek Standio, John Julian, Edward Harris, Jean-Baptiste Dubois, Michael Young, Mirror, Rebecca Valentine, Consonant Analysis, Justin Howell, wingee , Cyle Lapread, Chris Miller, David Cawthon, Brian Taylor, Arnas , Jacob Kubacki, Steven West, Bob Meyers, BEAVIS, Rabbits Watching, Chris Gibbons, Michael, Kael, Merton Hale, Nodar Rocko Davituri, Dawn Swain, JCRail , Bill Holland, James , Micah Catlin, AZbytes , Sebastian Schagerer, cody thompson, Francis O'Brien, Bryan Culver, John Goldhamer, Bob Holt, John-Paul Holt, Alex Nelson, Ruleryak, Andrei Blinov, Andrew Rogers, wholegroanoats , Michael Pecorini, Torte Hanrahan, Jamie Mastro, Shivan , Sound Board, Mike Weaver, Ethan Pierce, Danila Alpatov, XPEric , NQR , Stuart Macdonald, Kelvin Hall, Shut up and take my money, Jeff Powell, Anthon Hintzen, Devin Luxner, CJ Mariani, Stefan Kaczmarek, Timm B, Stefano, Harrison Wright, Des Wormwood Courtney, Ytak , Wolf Tolbert, Vincent van Aalten, DeepestBlue , John Fitzgerald, Sebastien De Groof, Robert T Kirton, Juha Kuikka, Maggie Danger, Jay 'Essential Worker' Logan, Conduit of Queerness, Mage of Life, Matthew Lowe, An Ho, Steven Byrum-Bratsen, Sean Callinan, Scott Schreiber, Mitch Buchan, Anicra , Nathan Goddard, Sarah Collie, Apoorva Joshi, Maxime Andr, Konstantin Podleski, Chaos215bar2 , Michael Grados, Daniel Nefzger, Matias Mariani, Horatio Low, JoeAverage, Christopher Barback, Alexander Godl, Adam P, Synoiz , Chip , Ulises Vargas, Jennifer Rae Fuchek, Adrian Bridgett, John Gjonola, Chad Gertz, Zhongchao Qian, Sean Murphy, Erica Eagles, Robey Pointer, Hayden Taylor, Hastin Zylstra, Aimee Kidrick, Alexander folk, Matt Gibbons, Omnizen, Zach Bean, Myles Hecht, Jack Knight, Maximilian Bork, Kevin Mckendree, Peter Amling, Ryan Duryea, Kenneth D, David Ziemlak, GGreathouse , Stephen A. Wilson, Sam Becraft, Chris Benejam, Veronica Cary, Vincent Sandstoe, Craig P Steffen, Robert Mikhayelyan, Corey Ogburn, Harlan , Mike Stunes, William Leonard, Cory King, Matt Braun, Eugene Arutchev, Steven Fazzio, Dennis Roberts, Harrison Co, Michael Cafarelli, Justin Patriquin, THISGuy, TheResistorNetwork , Vincent Venezia, Doug Wallace, Brad Quinn, Austin F, Stuart Seal, Zachary W Collins, Alex, Ross James, Jonfidential, Lillian Fleming, Jason Durbin, Kevin McClaning, Keith Ditchman, Andrew Minior, ventusignis, Jeremy Iamurri, Michael, Skoddie , Onzo Anderson, Alix Odendhal, bd_, Benjamin Gouveia, Ryan Doucet, Billy H, Sean Crocker, Phillip M, Robert Cole, iain , Ross Carter, SneksAsAService , Ted Flores, Jakub Strzyewski (jeikobu__), Robert Fares, Neptunium Fluoride, Fangzahn Aviation Studios, insidelexis, Aaron Binns, Matthew Yu, Johannes Wller, Adam Golden, Rustmane Skytrekker, John J Yang, Matthew Hilder, Pete , Joe Pannullo, Solus, Christopher Ottman",
    "description_links": [
        "https://youtu.be/1OfxlSG6q5Y",
        "https://youtu.be/zLFG068HtgM",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Greetings and salutations! Today I have a short update for you regarding the best toaster ever produced. For those that are new around here, a little over a year ago I made a video about the Sunbeam Radiant Control toaster, a toaster so good that it is literally Automatic Beyond Belief! That video touched briefly on what Im going to talk about today, but its focus was mainly on the mechanism that allows the bread to effortlessly fall into the toaster and slowly come back up with non-startling, near-silent action, and without any input from the user. Literally all you do is put the bread in the slot, and it does the rest. If you havent seen that video and are interested in knowing what makes the bread go down and up Id suggest you watch it first through that card Ive provided. Fun Fact! If someone puts a card in a video, and you - Shoot! Missed it! Fear not! That little information icon up there will hold all of the cards that a creator has put in a video! Just hover over with your mouse on desktop, or touch in the middle of the video somewhere on your phone and itll be there in the top right. Just thought Id let yall know that! For those of you watching on a smart TV or whatever, well I'm sorry, but I do put links in the description, too. That also covers the inevitability that YouTube ditches cards in favor of some other thing some day. hope they don't get rid of the description... Anyway, todays focus is on the thermostat. That is in fact the central feature of this toaster (well, actually the central feature is the heating element core... ) but I mean most important feature, or at least seems to be given its name, as it puts the radiant and control into Radiant Control. These toasters, unlike modern ones, have two columns of heating elements on the sides, and that allows for the thermostats bimetallic strip to sit between them and be warmed by the breads surface through radiation. It is shielded from the central heating element by the bread itself and these little metal fins shield it from the side elements. That makes it such that it becomes warmed mostly by the bread being toasted. You might ask, why do it that way? Well, according to Sunbeam, this allows the toaster to toast the toast to toasted perfection every toast. And theyre right! Gloriously right. Having the thermostat react to the surface temperature of the bread allows it to eliminate variables such as the temperature of the toaster itself, the particular properties of the bread, or the other variable which moved me to make this video - the temperature of the bread. This toaster is such a good and nice and wholesome and perfect and pleasant toaster that it has changed my breakfast routine. I was never much of a toast person, in fact it had been years since I had toast with any regularity, so to me this seemed like yet another addition to my Too Many Small Kitchen Appliances catalog. But through the sheer delight of having my toast be prepared for me in such an automatic fashion that its practically supernatural, toast has become my jam! And jams what I put on toast! And the thing that pushed me to make this update for you was how this handles frozen bread. You see, current circumstances require less frequent shopping for groceries with larger amounts purchased with each outing. As bread has now become a thing I have regularly, this is somewhat problematic as bread sadly sports somewhat short shelf life. If it doesnt dry out first, youll need some shooting stars to deal with the mold. But of course one has the option of freezing bread! Put something in the freezer and it lasts a long time, including bread. However, if youve ever dealt with a loaf of frozen bread, youll know that it kinda stinks. Its hard to let it thaw without getting soggy. And if your goal is to toast it, well with a conventional toaster youre gonna have to adjust your toasting setting upwards quite a bit to deal with the fact that its frozen. Maybe after a ton of experimentation youll dial it in just right, but forget to set it back and your next fresh slice will end up in the burn ward. But not with the Sunbeam Radiant Control toaster! Watch what happens. This is a slice of fresh honey-wheat bread. Ill put it in the toaster and well see how long it takes to toast. enjoy this awkward stare which I totally should not have done yet I did [click from toaster] [awkward pause] Its this long! And now lets take a look at what the bread looks like. This here is our fresh slice of bread. This was not frozen; this is the darkness. I will put it on a plate so we can compare later. Now Ill grab a slice of the same bread thats been frozen. See, this is quite cold [sound of bread being flicked by finger] and pretty hard. I have not touched the darkness control on the toaster at all - its exactly the same as it was for the fresh bread. So now Ill put the frozen bread in the slot, and wait. [unintelligible fast squeaky speech which definitely doesn't contain a directive about a certain fruit] [click] Its done! So now lets take a look at the bread. Would you look at that! Its pretty much the same exact darkness - [through laughter] in fact I can hardly tell the difference at all - as the fresh slice. Frozen Fresh! Pretty neat! And its not just the color. Going quickly from frozen to toasted produces toast that youd be hard-pressed to know was ever frozen. This has given me yet another reason to love this toaster. Its indirect measurement of the breads surface temperature means that it produces perfect results every time, even if the bread was frozen. I say again to toaster manufacturers of the world; why are you making such terrible toasters? Occasionally yall like to tweet at me with certain toaster models out there like a Kitchen Aid model with a similar lever-less design or some sort of elaborately over-engineered Japanese toaster which cost hundreds of dollars, and yet this *ancient* design endures. It just works. And its not even the automatic bread lifting that I really care about (OK thats a lie; its fascinating and probably why Im eating toast again) its the thermostat design that really sets it apart. As we discovered in the first toaster video (the one about the electromagnet in your toaster) manufacturers have been using time-based trips for a while, and theyve even been so clever as to design temperature-compensation into the control circuitry to account for a just-used hot toaster. Im sure that has been Cost-Optimized Beyond Belief but this toaster shows us that a simple bimetallic strip manages to do an objectively better job (if implemented correctly). It not only compensates for a hot toaster, but for cold bread. Still, we have some pesky limitations. As I said in the earlier video, this toaster has fixed bread guides and wouldnt be very happy with a bagel. Now of course, you could easily modernize the toaster to include the modern squeezy-type bread guide thingies, but bagels in particular might still present a problem. If the hole lines up with where the bimetallic strip is, the toaster will trip very prematurely like it does when theres no bread in it at all. But actually well thats the only limitation I can think of. This toaster shows us that actually using the bread as a means to determine doneness is wildly better than just setting a timer. I mean, going beyond just frozen bread, using temperature also helps account for things like denser breads, thinner or thicker slices, and a whole slew of other variables. Why have we made time the be-all end-all determinant for toast doneness? We have the technology! Make better toasters! Those little hand-held laser thermometer things seem like a good candidate for a modern sensor. Just make a window through the sides where the heating elements are and measure the surface of the bread! I mean it would be even more precise than the Sunbeam! It could literally be as precise as toast until the bread reaches 237.8 degrees or whatever. Really. Come on. Doing that could help solve the problem of using those wierd curly-Q heating elements on the sides. Surely there are small enough sensors to just take a peek through a hole in whatever material this is. Oh! And it could solve the hole-in-the bagel problem, too! Just have a few sensors and ignore any that go super hot right away. Honestly if nobody makes a reasonably-priced toaster in the next five years that can best this literal antique in terms of basic toast-making ability, well Ill be so perturbed as to draft a letter! Wait a minute. I smell the potential to use the word \"algorithmically.\" These exist already, dont they? Probably in wildly over-engineered form. And theyre Smart, too I bet. *sigh*, of course they already exist, and with various degrees of overthinking. Hey there, how are you supposed to toast some pumpernickel if youre just looking at color? Sunbeam figured this out ages ago! They even wrote in the patent about how temperature correlates to darkness. Oh well. I guess some knowledge just gets lost to time. Thats it for this video. Literally just an update. And some snark! To be honest this finding wasnt super surprising. I just hadnt had a reason to freeze any bread until recently. My first thought was you know, I bet the Sunbeam will just toast this perfectly and I was not disappointed! Seriously. All of you making toasters. [gestures exasperatedly] Just study this one. I wont even mind if you stick to the electromagnet scares-your-socks-off spring-loaded design, just make it toast well without going overboard on the smartness. Sunbeam proved back in the 40s how great a temperature-sensing toaster is. I think we can make one again in the 21st century. Add a reasonable bagel mode, modernize the bread guides, widen the slots a bit for fancy loafs of bread, and youre good. Youll just need to market it properly, and youll have a hit on your hands. This is free advice, people. I even promise to test any-such toaster that may make it to market for less than $50 and make a video about it. You dont even need to send me one. Ill just buy it. Really, you all should be absolutely embarrassed by this toaster. Now chop chop! innovatively smooth jazz You might ask start the teleprompter! Oh ssshoot. UGGHH. Stupid remember in the teleprompter video when I said dont use the software I use? This is whyyyyy. [Clears throat in a really weird and almost melodic way. It was amazing.] Id suggest you watch it first through that car(d) Ive provided. Card. I did not provide you with a car! That video touched briefly on what Im a going abadehbuh Just thought Id let yaknall knoeughblblb I just wrote these lines! How could I forget them? Im having too much fun with this video If it doesnt dry out ahh, missed a word! If the whole lines up to up? With. What? If the hole lines up to fff why did I say up to again? Up with. Alright. Know anyone who makes toasters? It is your duty to get them to watch this video so they can be ashamed of their ineptitude. It sounds harsh but really. There are just no excuses for this. None at all.",
    "transcript_keywords": [
        "bread",
        "toaster",
        "toast",
        "video",
        "Radiant Control toaster",
        "frozen bread",
        "Sunbeam Radiant Control",
        "frozen",
        "Sunbeam",
        "put",
        "Radiant Control",
        "make",
        "toasters",
        "Control toaster",
        "Control",
        "Sunbeam Radiant",
        "fresh",
        "Ill",
        "breads",
        "Radiant"
    ],
    "transcript_entity_values": [
        "Frozen Fresh",
        "Sunbeam Radiant Control",
        "a minute",
        "years",
        "two",
        "UGGHH",
        "Radiant Control",
        "the 21st century",
        "Sunbeam",
        "Japanese",
        "less than $50",
        "YouTube",
        "today",
        "the next five years",
        "first",
        "one",
        "hundreds of dollars",
        "Automatic",
        "a ton",
        "40s",
        "a year ago",
        "237.8 degrees"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "NORP",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "QUANTITY"
    ]
}