{
    "id": "BLrV3fPfePU",
    "title": "Ford is chasing Tesla with an electric Mustang SUV",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-11-18T12:36:12Z",
    "video_url": "https://www.youtube.com/watch?v=BLrV3fPfePU",
    "category": "Science & Technology",
    "tags": [
        "electric mustang",
        "ford mustang",
        "mach e",
        "ford mach e",
        "ford",
        "mustang",
        "new electric mustang",
        "new mustang",
        "electric car",
        "electric suv",
        "electric mustang suv",
        "mustang suv",
        "electric ford",
        "ford electric",
        "electric",
        "mustang mach e",
        "tesla",
        "tesla suv",
        "electric vehicle",
        "ev",
        "ford vs tesla",
        "elon musk",
        "tesla model y",
        "model s",
        "transportation",
        "new car",
        "new ford",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "review",
        "verge",
        "the verge"
    ],
    "views": 981264,
    "likes": 11480,
    "comments_count": 1596,
    "description": "Ford unveiled an electric Mustang SUV called the Mach-E. With up to 300 miles of range, and a price tag that starts at $43,895 before incentives, the companys first mass-market EV looks like it will be a popular premium electric option when it goes on sale in late 2020. The Verges senior transportation reporter Sean OKane was in Los Angeles to experience the new EV up close.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2OmMaa3",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat music) - Hey everybody, this is Sean from The Verge and I'm standing in front of Ford's first mass market all-electric vehicle, the electric Mustang Mach-E SUV. Now we've known about this vehicle for a little while. Ford first teased at the Detroit Auto Show in 2018. And since then there's been almost two full years of speculation about what exactly this first mass market electric vehicle was going to be. And it wasn't until recently that Ford started talking about how the vehicle was gonna be Mustang-inspired, and then turned due about a week or so ago, and Ford said, hey it's not just gonna be Mustang inspired, this is going to be a Mustang. This is going to be the second Mustang ever, and it's going to be electric, which is a pretty radical move for Ford. Now, Ford announced tonight five different versions of the Mustang Mach-E, and all of them go across an entire array of price, range, performance, all starting with the Select Mustang Mach-E, which starts at $43,895. That goes all the way up to the Mach-E GT which is $60,000 and that can go about 250 miles but it's all wheel drive, zero to 60 in a little over four seconds. And there's even a performance trimmer that can do zero to 60 in a little more than three seconds. Ford is teaming up with electrify America, which is the charging network that Volkswagen is building out. So there will be a big network of electric vehicle chargers that you can plug right into. This car is gonna be able to charge up to 150 kilowatts, the base version, the Select version will only get up to 115 kilowatts. It's not built out as much as Tesla's supercharger network right now. But honestly, right now electrify America looks like the next best thing over the next couple years. When it comes to electric vehicle charging in the US. Inside it's a pretty simple experience. We're talking a 15.5 inch touchscreen in the center dash with not too many buttons around it just one big volume knob at the bottom. And then one 10.2 inch digital instrument cluster behind the steering wheel, which I actually really like. I've seen a lot of digital instrument clusters in newer cars, especially in electric vehicles and this one's just very simple, it's horizontal, really slender and it just presents only the amount of information that you really need. Just some speed, what mode you're driving in, things like that. Another thing that I really am happy to see in here and I think is gonna be really important is there's a driver monitoring system just above the steering wheel. Ford says that this is gonna be equipped the second version of its Co-Pilot 360 advanced driver assistance system, and that it eventually wants to allow for hands-free highway driving. And if they're gonna be offering that feature, it's good that they're gonna have something in the car that's gonna make sure that drivers are paying attention on the road. One of the biggest problems right now with these advanced driver assistance systems is that people get overconfident with them, they think that they're gonna be able to do more than what they can actually do. And when they take their attention away from the road, and the car needs them to take back over. There's a disconnect there and it can lead to really bad things. This is something that Tesla doesn't even have on its cars. Elon Musk has said that he doesn't think we need it. A lot of other people disagree and I'm happy that Ford included it here. Now Ford called this thing a Mustang, so it's promising Mustang performance, and with the GT version which goes zero to 60, in either three or a little bit more than four seconds, that sounds pretty comparable. But the rest of them are gonna be a little bit slower. I got a ride in a prototype version of the Mustang Mach-E the other day. It was one of the premium trim, so it wasn't the fastest, but it felt pretty fast. It was fast enough to push you back in your seat a little bit. It had that exciting feeling of the instant torque you get from an electric motor. But honestly, I was just more impressed with the sort of cohesive feeling of the inside of the car. There's a lot of headroom, a lot of legroom, even in the back. And especially when you have the panoramic glass roof above you it feels even more open. This is not a cramped car, like some other sort of crossover or small SUVs can feel. This has got a lot of room inside. And Ford's really promising that this is going to be a five seater with a lot of room for a full family. The whole deal here is to give Mustang-style performance with the ability to throw your entire family in the car. Now one thing that's probably gonna be pretty divisive about this car is that there's no traditional door handles. There are buttons on the B-pillars and C-pillars that you push that pop the doors open. They also unlock as you sort of walk up to the car as long as you have your smartphone with you. There are little sort of like winglet handles on the front doors that you can grab to open the door once you've unlocked it. But it's just definitely a different approach. We've seen some other cars do stuff like this, where door handles present themselves or things like that. But this is definitely a bit of a different take that we haven't really seen here in the US and especially from a company like Ford. One of the most remarkable things about the Mustang Mach-E is that it basically didn't exist in pretty much any form two and a half years ago. Ford was actually working on what they call basically another compliance car, something based on the Ford Focus, but the company's new CEO came in and he took a look at the landscape, looked at all the other automakers moving into the electric vehicle space, trying to chase Tesla and said, no, we need to come up with something more exciting. They put a team together and that team came back to the company and said, let's make a Mustang. They actually convinced them to do it and two and a half years later, we're here with the Mustang Mach-E, it's pretty remarkable to see that quick of a turnaround from a traditional automaker. They have a lot of work to do on the software still and I'm sure there's a lot more work to do on the tuning to make sure that the car really does feel like a Mustang. But it seems like Ford's on the right path of this. And honestly, they better be because they're calling this thing a Mustang and people aren't going to take that lightly. Hey, everybody, thanks for watching. Make sure you like and subscribe and let me know in the comments what you think of this car. Do you hate the front end? Do you hate that there is no door handles? Do you really love that there's an electric Mustang coming? I wanna hear about it, let me know. Thanks for watching.",
    "transcript_keywords": [
        "Mustang",
        "Ford",
        "Mustang MachE",
        "Detroit Auto Show",
        "car",
        "electric vehicle",
        "electric Mustang",
        "Select Mustang MachE",
        "electric",
        "electric Mustang MachE",
        "vehicle",
        "lot",
        "market allelectric vehicle",
        "MachE",
        "Mustang MachE SUV",
        "pretty",
        "Sean",
        "Verge",
        "Select Mustang",
        "mass market allelectric"
    ],
    "transcript_entity_values": [
        "zero",
        "GT",
        "Ford",
        "Mustang",
        "Mustang",
        "one",
        "Co-Pilot 360",
        "a little more than three seconds",
        "Mach",
        "three",
        "Volkswagen",
        "15.5 inch",
        "one 10.2 inch",
        "43,895",
        "Tesla",
        "two and a half years ago",
        "Mustang Mach-E",
        "US",
        "60",
        "tonight",
        "the other day",
        "Select",
        "America",
        "the Detroit Auto Show",
        "about 250 miles",
        "two and a half years later",
        "Elon Musk",
        "60,000",
        "One",
        "a little over four seconds",
        "Sean",
        "the next couple years",
        "2018",
        "second",
        "five",
        "almost two full years",
        "115 kilowatts",
        "Ford",
        "up to 150 kilowatts",
        "first",
        "Mustang",
        "about a week or so ago",
        "The Verge"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "GPE",
        "EVENT",
        "QUANTITY",
        "DATE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG"
    ]
}