{
    "id": "blT3knwVMUw",
    "title": "MYSTERIOUS BOX FROM JAPAN",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-07-14T15:58:07Z",
    "video_url": "https://www.youtube.com/watch?v=blT3knwVMUw",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "japanese snacks",
        "japanese",
        "japan",
        "japan snacks",
        "japan food",
        "japanese food",
        "food",
        "snacks",
        "taste test",
        "japan taste test",
        "taste",
        "test",
        "matcha",
        "testing",
        "cuisine",
        "yummy",
        "chocolate",
        "snack food (food)",
        "sweets",
        "japanese cuisine (cuisine)",
        "candy",
        "weird",
        "eating",
        "gross",
        "funny",
        "japan (country)",
        "food hacks",
        "food challenge",
        "tasting",
        "japanese snack",
        "japan crate",
        "asian",
        "japancrate",
        "cookie",
        "candies",
        "gummy"
    ],
    "views": 4169067,
    "likes": 75312,
    "comments_count": 8055,
    "description": "(   ) --- Today's Mystery Video -   This random box from Japan showed up at the studio decided to open it up on camera. Turned out to be the tastiest unboxing video yet. It's about time I had the chance to test out some legendary Japanese snacks!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/a9hx5T9q9ZI",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, Lew here, back with another video and today I truly have no idea what is inside of this box. Yes, it's yellow. It says ESIAN. ASIAN.. box I don't know If I had to guess I would say it's some sort of selection of foreign goods is there anything more descript ... no Esian mall Esian box. Asian with an E Get with the times. Let's, let's figure it out together Could be exciting, could be a disaster, that's the beauty of it. Ooo, wrapped up all beautifully. This butterfly is everywhere. \"Make hearts flutter.\" Is that what we are doing here? Oh my goodness! These are foreign snacks, it's what I always wanted we- Ooooooooohh some random, looks kinda like a cookie Oh, mmm yeah yup mhm mmmhm Product of Japan, japanese fans If you're in Japan, do it up How about this little guy, a pretty little panda guy there. Oh cool, if you look at the back it's like a sad panda, it's like a Jack panda right there. oh Okay. Coconut vibes, chocolate And coconut vibes. This looks like I got to make soup or something And then I turn in to some kind of power ranger. Where is this one from? Also Japan! How about this, look 24, dark Okay, so this is probably the scariest thing so far, oh it's just chocolate Green tea cream, filled cookies That little guy right there That's a beauty That's a little weird. Jack, have you ever met a potato snack that you didn't agree with? Jack is so jealous right now. I've never seen him like this before, He's a puddle of drool on the floor. The guy can't ever keep it together right now. That's a potato snack right there. Oh yeah Nong shim. Get yourself some nong shim while you're at it. This cat guy is a big deal in Japan, did you know that? Kinda smells like cereal a little bit. It's like chocolate covered, corn pops. Do kids eat this for breakfast in Japan? I mean that's unbelievable. Oh you get the sticker of the dude as well! Whole cut potato crisps. Kicked up by the soy sauce. That is a dried out McDonald's french fry. Look at that I mean like if it fell between the seats of your car, That's what it would taste like. I have had this before. Got your dried out seaweed. Piko crunch milk candy. It's like a hard candy. Oh, crunchy and it's soft inside. *various eating noises* Caramel Macchiato, in a- What I do with that? This is Japanese Starbucks right here. Oh... It's caramel macchiato. It's pretty good. Mmm. It's like a sweetened rice cracker. That's the name of it i'm sure some people out there know this. That might be my favorite thing here. The watering... Kiss mint Is it gum? It's gotta be gum, I don't swallow this. That's like a fruit gum that amplified! I've had Hi-chew but not banana. Banana? It's like a starburst but the texture is just a little bit chewier. Alright, last thing I haven't tried. We've got the spicy noodle soup. How spicy? Lets find out. Spicy, Japanese... What more do I need to know? *more eating noises* Oh, yeah that is spicy! That's... *whoo!* Unbelievable! Jack is too jealous right now. Dude tries to make everything spicy. He tries to make a peanut butter sandwich spicy. This is a step up on Mr Noodles. What can I say, thank you Japan... Korea... One love.",
    "transcript_keywords": [
        "video and today",
        "Japan",
        "Lew",
        "Esian mall Esian",
        "spicy",
        "guy",
        "ESIAN",
        "Jack",
        "Make",
        "mall Esian box",
        "Esian box",
        "box",
        "japanese",
        "panda",
        "Caramel Macchiato",
        "kind",
        "chocolate",
        "potato",
        "yeah",
        "video"
    ],
    "transcript_entity_values": [
        "One",
        "Ooooooooohh",
        "Lew",
        "24",
        "Nong",
        "french",
        "Japanese",
        "Japanese Starbucks",
        "Asian",
        "ASIAN",
        "Noodles",
        "Korea",
        "McDonald",
        "Japan",
        "Jack",
        "Green",
        "japanese"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "NORP",
        "NORP",
        "ORG",
        "NORP",
        "NORP",
        "PERSON",
        "GPE",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "NORP"
    ]
}