{
    "id": "Bm2OaUKKpGk",
    "title": "A chair from the FUTURE! OSIM uLove 3 Well-Being Chair",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-01-05T18:47:47Z",
    "video_url": "https://www.youtube.com/watch?v=Bm2OaUKKpGk",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 66101,
    "likes": 2167,
    "comments_count": 154,
    "description": "Ive partnered with @osimnorthamerica115 to show you their new OSIM uLove3 massage chair! Go to  to check it out for yourself! AD   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://us.osim.com",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- This could quite possibly be the coolest piece of tech I've ever had the chance to review. Let's go to the moon. (upbeat music) Thank you to OSIM for partnering with me on this video. This is the OSIM uLove 3 Well-being chair with 4-Hand massage technology and designed in collaboration with Paninfarina, the Italian design house that design Ferrari, and more. I have never owned a massage chair before but you better believe that anytime I see one of these at someone else's house, at the mall or the airport, I will definitely be taking full advantage of it. But for some reason, I never really thought about ever getting one from my home. But today, my friends, we are living the dream. (upbeat music) So this chair is made by the company OSIM, who, well, I'm not gonna lie, I've actually never heard of them before. And that's mostly because they are heavily featured in Asia. Actually, they're the leading brand of printing massage chairs in Asia, and they're a pioneer in the wellness tech industry. They've been around since 1980 and have been at the forefront of research, development, and innovation. The chair that we're checking out today is the new OSIM uLove 3, and this comes in three different colors, a red, a black, and brown. They also have a huge line of other well-being chairs, smart sofas, gaming chairs, and more. What was really interesting is this company strives to create an ecosystem of products to provide a holistic, digitized, well-being experience. I know sometimes digital and health, and well-being doesn't necessarily all go together, but all of this is backed by approved clinical research, medical certifications, and scientific studies. And of course, what I love so much about this chair is how super techy it is. It has an AI stress analysis that will measure your body tension score. It creates a personalized body tension program based on that score and you can create specialized massage programs for yourself and everyone in your family. It's pretty cool how this has the ability to monitor your stress and figure out a program that will let you achieve total relaxation. So to get started, there's an NFC touchpoint right here on the arm of this phone holder, and this will let you download the app or open it for quick control. You can stream music, get access to all of their curated massage programs, make customizations and adjust your chair's position. What's really cool is the more you use the chair, you'll get to see your trends change in your body tension score, your heart rate, and your respiratory rate over time. I am such a huge fan of tracking my data about my body whether it's my heart rate, my respiratory rate, my blood oxygen level, basically any piece of data that I can collect, I am so here for it. So I'm pretty excited that this kind of now integrates into my health ecosystem. So inside of the app, this is where you can check out the full suite of massage programs that can cater to whatever your needs are. It has auto programs designed with different lifestyles and targeted body relief. There's new programs that are added regularly so you'll be able to down them whenever you want. Now, what makes this different than most regular massage chairs is this has signature and patented massage technologies. V-Hand Plus mimics the hands of a professional masseuse that gives you an ultra realistic massage with kneading and gripping motions. It has an enhanced 720 degree roller design that follows the contours of your body in a fluid motion with four sets of massage rollers. Trying this out for the first time was pretty shocking because I've never really felt this type of massage experience before, so it was really cool to just, kind of, chill, relax, and just be. As an avid runner, my legs are often feeling so tight so this has been really awesome for leg massages. It's designed for wide and narrow calves so it'll give you a full massage all the way to your ankles and feet. Now, here's an example of what a massage program might look like, depending on your body tension score. You'll see if it's low, it'll play uplifting, cheerful music and give you a balanced massage. Now, if you're super stressed and in the high range, it'll give you some mellow and calming music and a massage design for maximum stress relief. So this is controlled by an app so I'm gonna get this all connected. And the cool thing about this is everything that you would need to do is right here in your phone. And the fact that they even have this nice little phone holder for you, I mean, it's incredible. Like everything is so perfectly thought out. There's also a little USB port right here so you can charge your phone, your iPad. This will also extend large enough to be able to hold an iPad. This has some biometric sensors here on the hand rests which will take your heart rate and it'll even track your breathing. So it's able to give you an assessment based on your current stress levels. Let's start our AI stress analysis for you to place our hands on the biometric sensor here. And we're gonna wait five seconds and breathe normally. (upbeat music) Okay, here's our stress analysis. We've got a 34 heart rate 58, and now we're gonna start a recommended massage program. Now this is cool because it's gonna take my stress levels and get me a recommended massage. So now we're gonna press and hold to adjust the chair, and here we go, it's happening. Another thing that I like that this has is it actually has a warming mechanism. So I'm gonna press that as well, I'm gonna turn that on. I don't know if that's recommended for this massage but it feels so nice. It makes the chair all warm, it's so great. Drag to adjust the shoulder position. So this has auto shoulder detection. Can you believe that? It's so great, like, how do you know about my shoulders? Oh yeah, the the calve massage, so nice. Another thing that this does is it has speakers and because this is connected to Bluetooth I'm able to play that music which I have turned down for copyrighting reasons but it'll come over these loud speakers. And this morning I was scrolling through TikTok. So basically anything that is playing in my phone will also come over these speakers. And it sounds so good. Like this is, I just don't ever wanna leave. My feet are vibrating. (laughing) It's so great. As a safety precaution, they do alternate between the left and the right when they're massaging your hands. So if you do have an emergency and you need to get out, like, your hands are available. I don't really want to keep filming this video, I just wanna sit here. (laughing) It feels so great. I'm pretty excited because they did send me this red one to review, but I have a black one that I'm gonna be keeping in my home. And I'm actually really surprised how awesome this red looks, like, it is just so vibrant that it really does feel like I'm in some, sort of, Ferrari spaceship. Like this feels like I'm about ready to take off to the moon, no joke. It's so nice. It's so great. I've honestly never felt a massage chair that was this good. And I've sat in a lot of them all around the world, in malls, in airports, in other people's homes, in convention centers, hotels. So inside of the app you do have access to all sorts of other things. So there's a manual massage program. So you're able to select the parts of your body that you want to get massaged. These are downloadable programs that you're able to download. There's a detox, immune booster, healthy mum. There's a gentle massage for seniors. So it's really nice to know that they have all of these downloads that are updated pretty frequently, so you'll be able to just add different massage programs into the chair at any time when they update them. And in here, this will give you the position of your chair. So if you wanna go into zero gravity, which please hold, I'm gonna do right now. I'm just so freaking comfortable. Like, I don't wanna get out of this chair, ever. Do you hear that music playing right now? That is coming through the speakers? I just, kind of, wanted to give you an example of what that sounds like. To me, it sounds absolutely crystal clear because it's right here by my ears. So it's nice because you don't actually have to wear any headphones. The music just is there. There are controls here on the armrests that will let you control various things; the footrest, the backrest. But the app is so easy and intuitive that it makes it so easy to just go in, connect it to Bluetooth, and then you have full control over the entire device. I will be putting a link in the description if you wanna check out OSIM's uLove 3 chair and all of the other incredible products that they have. This is by far the most relaxing and fun review that I have ever done and I am so, so hyped about this. So thank you guys for watching. If you haven't already subscribed, please do so and hit the bell to be notified when I post new videos. And let me know what your stress relief routine looks like. Have you added in massage into that? Because this for sure is definitely now a part of... this is a part of my life. This is who I am. Oh, I'll see you later, bye. (upbeat music)",
    "transcript_keywords": [
        "massage",
        "chair",
        "massage programs",
        "OSIM",
        "OSIM uLove",
        "body",
        "programs",
        "massage chair",
        "stress",
        "body tension",
        "program",
        "chairs",
        "rate",
        "body tension score",
        "music",
        "nice",
        "heart rate",
        "pretty",
        "cool",
        "app"
    ],
    "transcript_entity_values": [
        "zero",
        "OSIM",
        "34",
        "Italian",
        "iPad",
        "58",
        "this morning",
        "4",
        "three",
        "720",
        "Bluetooth",
        "NFC",
        "four",
        "Paninfarina",
        "1980",
        "3",
        "five seconds",
        "today",
        "OSIM",
        "Ferrari",
        "uLove 3",
        "first",
        "Asia",
        "USB",
        "TikTok"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "LOC",
        "ORG",
        "ORG"
    ]
}