{
    "id": "BnPFaT1ZaNI",
    "title": "Can the Google Pixel 8 Pro even Survive 7 YEARS?! - Durability Test!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-10-12T16:24:57Z",
    "video_url": "https://www.youtube.com/watch?v=BnPFaT1ZaNI",
    "category": "Howto & Style",
    "tags": [
        "Pixel 8 pro durability test",
        "pixel 8 pro scratch test",
        "google pixel 8 pro",
        "actua display",
        "super actua",
        "pixel phone",
        "iphone",
        "android",
        "ios",
        "mobile phone",
        "technology",
        "tech",
        "JerryRig",
        "pixel 8 pro drop test"
    ],
    "views": 1986433,
    "likes": 68990,
    "comments_count": 2611,
    "description": "the Google Pixel 8 Pro is hear to be Durability TESTED. Grab a Clear Ghost Case for your phone HERE:  Google has never been known for their exceptionably durable hardware. But the Durability and Longevity of the Google Pixel 8 Pro is super important - especially if the phone is getting 7 years worth of updates!   Get my Teardown Skin here:  Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.dbrand.com/ghost/8-pro",
        "https://www.dbrand.com/Teardown",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "The Google Pixel phones have frequently finessed the thin line between solid structure and flexible frame. However their phones have never fully failed. Besides the recent pixel fold of course and the Nexus 6p, if you were even born back. Today we test the rather glorious looking pixel 8 Pro in the color of baay or dare I say, Bay. [Music] This is the best looking blue phone I've ever seen in my entire existence. Inside the box we have our white USB-C cable and USB adapter. With Google promising 7 years of software updates, I hope their hardware can handle 7 years worth of use. And in order to find that out, today we'll inflict 7 years worth of abuse. Let's get started. [Introduction] The first thing I notice is the satin back. So soft it has the feeling of polished plastic, even though I know it's glass. The previous Pixel 7 struggled with cracks along the antenna lines during my durability test right here next to the camera shelf. And those very same antenna lines that we saw last year, which fractured, are here again this year. So fingers crossed that Google did something with the internal structure and is more solid this time. I'm also very happy that the curved glass screen is gone because flat is the way to go for sure. Google says they have a brand new screen called the Super Actua display. Actua doesn't appear to actually be a word, but this is the brightest screen Google has ever made and is protected with Gorilla Glass Victus 2, which has very immediately and very present scratches at a level 6 with deeper grooves at a level 7. Not quite as resistant as Apple's ceramic shield, but still on par with every other piece of tempered glass on the planet. Making our way up to the front 10.5 megapixel hole punch camera, which doubles as face unlock. It's protected by the same slab of glass. We also have a super long razor thin earpiece slit above the screen, and another antenna line dead center above the camera. There appears to be quite a lot of those on the Pixel 8 Pro. The Pixel 8 Pro is made from 100% recycled aluminum, and strangely enough, the side volume rocker and power button are very much removable...and very easily so. There also appears to be some kind of serial number etched into the frame below the button, so please don't hack me. Speaking of which, Google includes a free VPN service with the Pixel 8, and I thought that was pretty nifty. Ain't nobody else allowed to track your cookies but Google themselves. The 5G antenna oval is plastic, and the whole left side is some more of that recycled aluminum. The metal SIM card tray does have a rubber ring around the opening for the IP68 water resistance rating, but no expandable memory. At the bottom of the phone we have our lower stereo loudspeaker and the 30 watt USB-C port. Before we get too deep into the durability test though, I want to make sure the side buttons get clicked back into place so we don't lose them. The beautiful blue back panel is not damaged by my razor blade, showing that it is indeed scratch resistant glass. I thought it might be fun to pull up the iPhone 15 to get a side by side comparison. You know, just two blue phones hanging out telling jokes. What's blue and not too heavy? Light blue. What color's the wind? Blue. And for the third joke, the color of Apple's iPhone. To be fair though, one place where Apple is miles ahead of the competition and trust me, that hurt to say is with the magnetically aligning rear copper coil for the wireless charging. You can see the series of magnets that surround the charging coil to keep the phone absolutely locked in place and perfectly positioned to make the charging as efficient as possible. And as we can clearly see, the Pixel does not have such superior alignment characteristics, which is why I'm super glad that my channel sponsor dbrand, you know, appropriated Apple's magnetic charging concept and incorporated magnets into their never yellowing transparent ghost case. Dbrand's bringing Apple's best feature to Google's best phone. As you can clearly see with my teardown skin, shows us that indeed the internal charging coil is now very accurately surrounded by dbrand's magnets for optimal charging on magnetic wireless chargers. 10 out of 10. I'll leave a link for the ghost case and my teardown skin down in the description because protection is basically mandatory on a thousand dollar investment. Plus, how else will we ever see if Google actually keeps the phone updated for 7 years unless people's phones actually survive that long. As far as cameras go this time around. we have the center mounted 50 megap main camera then a 48 megapix wide angle on the left and another 48 megap five times telephoto camera on the right. All mounted in a very polished camera shelf. Google's always been focused on the software experience, So it's interesting to see that right next to the dual LED single tone flash, They added a hardware feature that not a single person on the entire planet asked for...a thermometer. And this isn't even a laser thermometer that can tell temperature from a distance. It's an infrared thermometer that can only tell temperature within 2 inches and doesn't even work on humans. If I need to check if the stove is hot or not. My hand holding the phone 2 inches away from a hot pan will tell me if it's warm before the app even opens. It's very much quite possibly the silliest gimmick invented since the dice and air purifying headphones. I'd rather have an SD card slot. Speaking of heat, Google's Super Actua display is 1440p with a whopping 2,400 nits worth of brightness and a 120 hertz variable refresh rate. As we can see from the permanent burn mark after 17 seconds, Actua is using OLED technology. I know burn in has been pretty well fixed on OLEDs as of now, but at the same time we've never seen an OLED screen this bright before. So it'll be interesting to see how it holds up over time. I'll set my fingerprint on the under screen optical scanner. And add some level 7 deeper grooves over the top just for funsies. And it looks like the optical scanner is still able to work and function every single time even with the damage. Not too shabby. Now Apple's titanium flagship smartphone did not pass my durability test. And historically speaking, Google themselves haven't been gleaming examples of structural rigidity. But in this particular case with the Pixel 8 Pro, Besides sounding like a creaky wooden chip, there are no structural imperfections when bent from the front or bent from the back. No cracks at the antenna lines. No fractures in the frame. And most importantly, no catastrophic damage whatsoever. The Pixel 8 Pro passes my durability test. Thumbs up for that. Let me know if you want to see the regular Pixel 8 tested down in the comments. And grab a ghost case for your own phone with the link in the description. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Google Pixel phones",
        "Google",
        "Pixel",
        "Google Super Actua",
        "Google Pixel",
        "Apple",
        "phone",
        "frequently finessed",
        "Pro",
        "glass",
        "Pixel phones",
        "screen",
        "camera",
        "antenna lines",
        "blue",
        "charging",
        "durability test",
        "Super Actua",
        "Super Actua display",
        "phones"
    ],
    "transcript_entity_values": [
        "Google",
        "iPhone",
        "Pixel 8 Pro",
        "a thousand dollar",
        "6",
        "8",
        "15",
        "17 seconds",
        "SD",
        "Dbrand",
        "Pixel 7",
        "2 inches",
        "100%",
        "two",
        "120",
        "Bay",
        "2,400",
        "10",
        "30 watt",
        "this year",
        "5",
        "USB-C",
        "Apple",
        "five",
        "last year",
        "first",
        "48",
        "today",
        "Pixel 8",
        "third",
        "Today",
        "10.5 megapixel",
        "USB",
        "50",
        "Super Actua",
        "Actua",
        "one",
        "7",
        "7 years"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "LAW",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "LAW",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ]
}