{
    "id": "BOFZGCwoRmo",
    "title": "Razer Core Review - The Best External GPU?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2016-06-03T04:13:58Z",
    "video_url": "https://www.youtube.com/watch?v=BOFZGCwoRmo",
    "category": "Science & Technology",
    "tags": [
        "Razer Core",
        "External GPU",
        "GTX 1080",
        "GTX 980Ti",
        "TB3",
        "Thunderbolt 3",
        "Thunderbolt External",
        "External Graphics",
        "Razer",
        "Razer Blade",
        "Razer Blade Stealth",
        "Core",
        "Razer Blade Graphics",
        "Razercore"
    ],
    "views": 706665,
    "likes": 12181,
    "comments_count": 1601,
    "description": "Dave2D review of the Razer Core -  Thunderbolt 3 External GPU. Covering gaming performance and thermals using a GTX 1080 Laptop Skins:  Blade Purchase Link -  Stealth Purchase Link-  Core Purchase link -   Some related Razer videos: Razer Core Preview:  Razer Blade Stealth:  Razer Blade:     Music Credits: Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: FILI - Pressing Forward  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://www.dbrand.com/razer",
        "http://amzn.to/1TQAWtW",
        "http://amzn.to/1TMwyH",
        "http://razerzone.com",
        "https://youtu.be/RsxhcTs0zJ8",
        "https://youtu.be/I4SgcraOAOU",
        "https://youtu.be/TN-Rub-lmc4",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going guys? This is Dave 2d, and this is my review of the razor core. So when this thing first came in I was super excited to play with it and so I did, But a couple weeks later. I've decided that I should do the responsible thing I ran some benchmarks. Did some tests finally made a review here it is. so the core itself is extremely Well made I was hoping would have good build quality for the four or five hundred dollars that it costs, And it really does full metal construction and very heavy, the build quality is super solid there's some rubber feet for some grip, Side top and bottom ventilation, but there's no air flow through the front. It's super easy to open, a handle that flips out to unlatch the mechanism and the tray slides out There's a thumb screw for mounting the card and they've oriented the PCB. So that when the card is installed The release latches on the bottom so it's easy to remove again, the power supply is from enhanced It's 500 watts, but as you can see from its shape. It's not a regular atx supply. There's several intake fans on the bottom one of them feeds the power supply One bigger one feeds the main area and then the last one blows into the PCB area And there's one exhaust fan underneath the shroud for the power supply the rest of the airflow has to come from your video card The software setup on the stealth is pretty easy You install some drivers, reboot, And you're good to go the blade needs one more step you need to install some software to turn off the 970m inside. When it's connected to the core the stealth doesn't need its charger, the Thunderbolt 3 Connection will charge the laptop while you're connected But the 14 inch blade will still need the charger They both connect using the Thunderbolt 3 port and the cable is very short. It's around 20 inches It's an active Thunderbolt 3 cable, and they keep it short because longer lengths can have signal degradation But I've tried a lot of third party cables, none of them worked. Now the stealth has the connection on the left side of the laptop. The 14 inch blade has it on the right so in terms of setting it up You're gonna have to fiddle around with positioning and stuff but if you plan on having the core on one side of the monitor and your laptop on the other side. It's not going to work the cables too short The core also lights up with razer chroma you can adjust colors and timing with or again. Overall I think they nailed the design and the build quality Now both of these laptops are skinned with D-Brane skins the stealth has the black titanium, the blade has the black Carbon fiber I highly recommend putting a skin on these devices to protect the anodized finish. There's a link for them in the description below, now in terms of performance I actually tested out quite a few video cards. But I'm only going to go into detail about the 980ti and the 1080. Now in general I don't love using benchmarks for videos but sometimes you just got to do them, so just one other thing to keep in mind. The cards that I use in this video are reference cards, they weren't overclocked at all there's going to be other third-party cards that you can get better frame rates and stuff with but these are the reference cards just for the video. So right off the bat these are the base scores of the razor blade stealth and the 2016 razor Blade 14. We also have a current generation desktop running 980ti. Next up these are the scores when the 980ti is put into the razor core, and I'm only using the external display for output the laptop display is turned off, and you'll also notice an alienware score That's the same 980ti running in the external alien or graphics amp for an alienware 15 with the same specs as a razor blade 14 So the 980ti gives a nice boost to both of the razor laptops Particularly with the stealth it's not as fast as a desktop, and it's actually a little bit slower than the alienware graphics amp. But it's a very nice boost overall, and then I also ran the same test but this time I did it with the built-in display of the laptop so as I mentioned in my previous Razer core video, You're using a bandwidth to send the rendered Data back to the laptop so the Thunderbolt 3 Pipeline gets a little packed and you get a bit of a performance drop. It's not too much, but it is measurable. Now the alienware graphics amp also has a drop in performance when you're sending it back to the display Now I did the same test, but this time with the new Gt X 1080 and everything runs a little bit faster, but yeah. It's the same idea so here's the deal the video card that you put into the core will perform at around, 85 or 90 percent of the efficiency of a desktop setup. The exact card you want to put in obviously depends on your budget. But if you're looking to buy new the GTX 1070 looks pretty awesome right now and with a 980ti or better card in there, You'll be able to run essentially any game you want at 1080P ultra graphics settings at 60 frames per second. Now If there's a specific game you want to run at a specific resolution or graphics setting or frame rate, you'll have to look up your video card. But the bottom line is that you'll get around 85 to 90 percent of the efficiency of a desktop system. Now many games are GPU dependent and those will run nicely on the stealth if you have a good video card in there. But some games are more CPU dependent for example: Which are three and the new doom. frame rates on the quad-core blade are noticeably better than the dual-Core stealth to determine which games are more CPU dependent. There's really no sure fast way to tell, but something that can help if you look at the required specs. If the minimum requirement of a game is a four core CPU even if it's a super old CPU there's a good chance it's a CPU hungry game. But it's not going to work like this every time, to maximize performance notice two things. First Connect an external monitor up to your video card. Don't use the internal display if you can avoid it, secondly leave all the USB and Ethernet ports on the core empty. So when I tried recording Gameplay footage to a drive that was connected to the core it would occasionally hiccup. I also tried video editing in premiere with multiple drives attached to the core. It works But the performance gains aren't really worth the cost in my opinion. I want to talk a little bit about thermals and noise. So when the running of the core both laptops run quieter particularly the 14 inch blade the 970m isn't being used anymore. So the whole system, Just runs cooler and the fans don't have to spin as fast. The core itself has a bit of fan noise it's very quiet and tolerable Especially at idle. When it's under load the fan noise really depends on the card that you have inside the core the 1080 was quieter than the 980ti But in general unless you have a really loud video card the noise isn't too bad. I Actually spent quite a lot of time trying to connect the razer core to other laptops with Thunderbolt 3 ports, now at launch the core only officially supports the two razer laptops as well as the intel skull canyon nook But I was able to get some of these connected. So the XPs 13 and 15 they can connect I was able to play some games, but it would lose connection and hang really frequently. The new HP spectre couldn't connect at all, the alienware 15 actually had the best connection. Maybe because it's already capable of some external graphic stuff, but it would freeze and then lose connection pretty often, the Macbook obviously won't work that's not Thunderbolt 3. The acer Predator also had a connection but it was super Flaky. So basically none of them work properly right now, but my gut feeling is that at least some of them will work sometime soon. It's just a matter of drivers and Bios is being updated. I think companies will get on that relatively soon, and once they do i'll probably be doing an update to this series, Hopefully when the new amd cards are out. A Couple other things, if you want to close the lid of the laptop you can. Just turn off the sleep setting and it works, there weren't any thermal [issues] that I noticed when I had either of them running with the lid closed if You unplug it in the middle of a game, t'll blue screen. But if you unplug it when it's idling, it'll automatically switch over to the internal video card. Both laptops pass the steam vr test, even with the 980ti, but the software needs to mature. I'm going to save that for a future video. The last thing, don't feel pressured into getting a razor setup just have an external GPU there are other Thunderbolt 3 external GPUs coming out shortly and the alienware graphics amp is always an option. That actually has slightly better performance right now, and you can always build yourself an iTx system if you want. But I have to say the razor core is awesome, it's priced a little high, and I wish the software was a little bit more mature, which it will be over time, but razor seriously delivered on a really big promise that they made with the core, and at this point It actually does what they said it would do. Now whether or not it's worth of four or five hundred dollars, here's the thing. Razor was the first company to drop the External Thunderbolt 3 Graphics unit. So they can charge whatever they want I think it's priced a little bit higher than it should be or could be, but if this is something that you've always wanted I think it's worth it at least at the $400 price point That's the end of this video! Hope you guys liked it thumbs if you liked, it subs if you loved it. It's been nice. See you guys next time.",
    "transcript_keywords": [
        "video card",
        "core",
        "video",
        "card",
        "Thunderbolt",
        "blade",
        "razor core",
        "razor",
        "cards",
        "laptop",
        "stealth",
        "razor blade",
        "Razer core video",
        "laptops",
        "graphics",
        "good video card",
        "CPU",
        "external",
        "alienware graphics amp",
        "bit"
    ],
    "transcript_entity_values": [
        "970",
        "Razer",
        "three",
        "Macbook",
        "third",
        "60",
        "Dave",
        "Gt X 1080",
        "HP",
        "CPU",
        "GPU",
        "around 20 inches",
        "External Thunderbolt 3 Graphics",
        "PCB",
        "one",
        "14 inch",
        "around 85 to 90 percent",
        "USB",
        "five hundred dollars",
        "First",
        "second",
        "a couple weeks later",
        "four or",
        "GTX",
        "Razor",
        "atx",
        "secondly",
        "the Thunderbolt 3 Connection",
        "intel",
        "85",
        "3",
        "two",
        "1080P",
        "first",
        "90 percent",
        "four",
        "2016",
        "13",
        "980ti",
        "400",
        "1080",
        "500",
        "15",
        "One",
        "14",
        "Thunderbolt 3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT"
    ]
}