{
    "id": "boJtuOcLZIo",
    "title": "I wasted $400 on Etsy Gaming Accessories",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-03-27T21:04:20Z",
    "video_url": "https://www.youtube.com/watch?v=boJtuOcLZIo",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "etsy",
        "keyboard",
        "key caps",
        "custom",
        "custom keycaps",
        "pokemon",
        "ps5",
        "playstation",
        "playstation 5",
        "skins",
        "dbrand",
        "ps5 skin",
        "pokemon skin",
        "dual sense",
        "dual sense skin",
        "hydro dip",
        "hydrodip",
        "controller",
        "custom controller",
        "mysterytech",
        "mystery tech"
    ],
    "views": 309106,
    "likes": 7952,
    "comments_count": 181,
    "description": "Did we FINALLY get a win off of Etsy?!   Buy a MacBook, Stupid:  This Is NOT a Gaming PC   It's Time To Switch to Edge:  Why the PS5 is LOSING Money:  The USB Lie Detector:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/t2gDnUFT43M",
        "https://youtu.be/29RFioXelK4",
        "https://youtu.be/E_Hx6yaBowM",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/apt0ciQyyuY",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello and welcome to This Is. Austin, today we are going to look at all of the best and most wonderful custom gaming accessories that Etsy has to offer. - Do we have to do Etsy? Can we do Wish? - They're equally bad for different reasons. - Do you know how much money I've wasted on Etsy and Wish over the years? And, the amount of good things that I've gotten, at least I've gotten a couple of okay things from Wish. Everything I've ever gotten from Etsy has been bad! - To be fair, we've only really done two things from Etsy? So, we had the Etsy PC which. - [Austin] The less spoken about that the better. - [Matt] There was a lot of effort involved. - Like I said, less effort, less cost. We're just going to move on. - And then in the mystery tech we had those 3D printed joysticks that required gizmos and gazmos. - [Austin] That was okay. But it didn't come with all the pieces that I needed, including all the various rubber bands for assembly. - [Matt] Or instructions. - That also would have been nice. - I ordered all of this in like late November, early December. - Great this does not boat well. - It is today the end of March, so I just got some of these items in yesterday. There's some things here that were much more topical when I ordered them in November or December. - Are you trying to tell me it only takes five to six months for an item to show up, you don't want it anymore? - Yeah. - Cool. - And this is also the best that I thought that they had that wasn't like 3D printed garbage like before. But it just might be different types of garbage. - [Austin] Different types of garbage, okay I understand. - So first things first. - [Austin] Okay, that is a Razor keyboard. That is not from Etsy. - It's custom though. - Yeah, but that was from Razor. - Oh yeah, cause these were from Etsy. - These look like the kind of boxes you get when you purchase some bridal shower gifts. - I just want to point out that this is, in fact, actually sealed. It's just that far opened, but sealed. - Well, they're Saucy keycaps. I bet these are actually going to be very cool. I will see that if you are purchasing tech items on Etsy, keycaps seem like a pretty logical move. - There are a lot of different types of keycaps. I got these one specifically for you. These specifically I got with Austin Evens in mind. - I'm not sure how to take that. - I feel like once you see them, you'll be like, \"Aww...you know me very well.\" - I feel like I'm going to have to consult with my friend Myke Hurley to determine the quality of these particular keycaps. Okay, so a lot of confetti. Now, if you know anything about keycaps, you'll know that sometimes these things can be months and months back ordered. Okay then. This is a lot of a single keycap. Oh, here we go. It's all for one keycap. Wait, that's it? (laughing) - Wait? It's just orange? - Is it really just orange? - Am I missing something? There's nothing else in the thing. It's just an orange. - I thought it was Charmander's face. Hold on, I actually need to look this up now. - Let's see what the other ones are. We have Bulbasaur here, it's a very nice little tin. (laughing) - [Austin] Maybe that one just is not right. Look, look, look, this one's different. This one's different, right? It's got the little Bulbasaur bean sprout on it's back. - Okay that's what I was more expecting. - Is there a tail missing? There's a tail, there's a tail. - He didn't open it all the way. - There we go. - I was about to lose my if that was the only thing. - Okay, we've got ourselves a little Charmander tail and a Bulbasaur bulb. That's actually pretty cool although I would very much not leave that on the key cause the second I touch that, it's going to fall off. I'm just going to say right off the bat these all look very expensive. - It's been so long I have no idea what I paid for these. - The detail on this little Charmander tail is incredible. Especially when you look at the Bulbasaur with the custom painting and stuff. I mean, this is incredibly high quality and well worth the very very pricey price that I'm sure it cost. I'm guessing this is, yup, we've got ourselves some Squirtle action. Okay, I like this one a lot. I like it a lot. - I don't think these were actually that expensive for what I'm seeing now. Like this looks really nice. I don't think these were that expensive, there were $42 a piece. - $42 each? - For handcrafted. - I mean that is expensive for keycaps. - I'm satisfied with this purchase. Here's the irony of what you said earlier, \"Oh, these keycaps might be back ordered for months.\" I didn't get Pikachu cause Pikachu was back ordered for like 2 months. - [Austin] We'll drop these on the keyboard. These are incredibly cool. I've never gotten into the world of full custom keycaps. Myke's already getting back to me. Let's see if I can get some insight from the expert. He has seen these before. - These were from SaucyCaps. - I think these have got to be 1, 2, 3. We'll just do Esc, 1, 2, just to get that full aesthetic. - Okay so the fact that you didn't do Bulbasaur on number one is actually really annoying me. - What? No. What do you mean? This is escape. This is one. This is two. - [Matt] Okay, but Bulbasaur is the first Pokemon. - Yes, well there you go. - Keycaps aside, I actually really like these little tins. The artwork on them is really nice. If you're going to store these, obviously that's great. - They're actually etched too. Someone actually etched the little Charmander and Bulbasaur on here. Look this is super cool. Obviously spending $40 on a custom Pokemon keycap is not what most people are going to do. But I mean, it's hard to argue especially considering the handcraftedness of these, that is incredibly cool. - So, that's one of the things I was specifically trying to get when I said, \"We're going to do an Etsy gaming theme.\" I specifically looked for things that were actually Etsy handcrafted crafts. Stuff like that. - Yeah, I mean this is cool. I mean if you're into the world of mechanical keyboards you're certainly in debt. And I apologize for that. But you're also certainly well into this world of custom keycaps. Of the various different custom builds that you can do with boards. I mean this world goes deep and it gets very, very expensive. So if you want to have some real specialty keycaps, you want to have a special board and obviously you can easily take them off, put them in your little tins when you're not shooting your Instagram photos of your keyboard. I mean it's totally doable. I will say that those are incredibly nice. The Squirtle is definitely my favorite though. The Bulbasaur is definitely the one that is most like, to me, feels the one that's most custom. The Charmander is fine. It's mostly the tail. But that Squirtle really does look like you've got a little Squirtle hiding in your keycap. - Again, I'm really happy with these. I didn't know what to expect. Remember how we saw some PlayStations on Etsy. - Custom PlayStation stuff you mean? - Well people were selling PlayStations on Etsy. - Oh you mean like custom builds like Chastity and stuff. - No like people were selling PlayStations on Etsy. - Like straight up, just selling a PS5? - Yeah, for like a thousand bucks. - We tried to buy one on Wish. This is straight up in front of me. How is this a good camera angle now? Its just a PS5 angle? - Look, I was worried that you'd be upset that we didn't have Pikachu for the keycaps. And, again when I ordered this, dbrand didn't really have a thing. So I got you. - Oh my god, okay. Skin sticker for PS5 digital. I have a lot of things I could say right now. But, I'm just curious, does it actually fit on the PS5? - That's where I'm curious because again there was no skins out when I ordered this. So to see this was crazy. - So we've got, okay, there's a lot here. So now we have Pikachu and Ash. We also have the skins for the controllers. Which is really nice because they've got the whole from WEIBO@G195 burned on everything. So its not subtle. This is all actually for digital so we actually cannot use it for this PS5. We're going to have to swap it out. This does feel pretty high quality. I very much hope it can come off cleanly. Do we need to swap this? - I think we just need to do one of them. - Put it on one side? - Yeah, in think we just put it on the side. - Okay, let's ruin Ken's PS5 like he's ruined my dreams for many years. - Okay so this at least looks properly cut out. - It feels high quality. - [Matt] This does not come off once its on there. - [Austin] Wait, wait, wait. No, no, no. Time out, this is bad. - It feels good. Like the material feels good and the print is really good. But you look at how crinkled. - [Austin] We didn't even put part of it on yet and it already looks like it's almost permanently creased. - [Matt] I'm not going to be able to do this for camera. I just kind of need to see this. - This is not a good idea. I'm just going to preemptively say that. The skin just looks so low quality. - It's not ruining the, it's not pulling anything off the case. - Displate doesn't actually sell skins for PS5s though, right? - No, they specifically said \"We don't want to sell skins because you dum dums wouldn't be able to figure it out properly\" after the amount of complaints they get from other things. - [Austin] All right let's do it. - [Matt] It would help if we had a squeegee but we don't. We are past the point of no return on that one dude. - Who thinks this is a good idea? (laughing) - Pika! It's definitely not square. The cut is not perfect. - Look at Pikachu's face, doesn't it look stretched? The PS5 is not a flat shape so it actually distorts it a little bit anyway. Yeah, if you look up close you can see that the print, it looks like the art their using is 600 by 600 pixels and they just kind of scaled it up in PhotoShop. - You want to skin a controller? - Absolutely not. So the problem is, is that all of them have from WEIBO@G195 burned on the skin. Who wants that on the artwork on your PS5? Right, it's got it on the controller. It's got it on the actually sides. It's got it on the back. Like this is the only unbranded part of this. - And it's not like this guy drew Pikachu. This guy clearly sent a thing off to a factory and said, \"Here's a PhotoShop file.\" - Don't buy this! So, we're one and one, right? - We're one and one. - The keycaps were great, the Pikachu not so great. What else does Etsy have in store for us Matt? - All right, so you notice here, we have one controller? - One controller. - But there's two of us. - Yes. - I want to play against you in Gran Turismo. - Okay, go ahead. - I'll beat you. - Okay, sure. - So I got us. - A white box? I don't want to open that. I don't trust you. - You open these things. I know what's in them. - Again, I don't like what's in this box. I don't like the pitch you just gave. I don't like anything about this. I can see some orange poking through. Three, two, one. Oh, hydro dipped. (gasping) - Okay, I'm okay with this. - That looks pretty decent. - It does. It's a little bit not smooth right. It's just a little bumpy on the back. Honestly, it feels fine for the most part. That's actually pretty cool. - Here's the problem with, again I ordered this thing in December and it showed up like maybe a month ago. And, it was before there were a bunch of these mod-kits that were out for. Like, who did we get the mod-kit for that had like the red? - Oh I don't remember. - You can get all sorts of customization kits now. But when I ordered this, as far as I could tell, this was one of the only ways to get a custom DualSense. So, I went with \"This is Orange.\" - Oh, you actually got to choose these colors? - I actually got to choose the colors. I mean there was like orange whatever. I didn't know it was going to be blue. I thought that was going to be black, but that's fine. - I will say, it is a little bit of a weird color way to have the orange, the blue, the white and the black just a little bit of clashing. But like the actual aesthetic here is pretty nice. Like I said, there are some very minor little blemishes on the back of the controller which I can kind of feel because the entire thing is nice and smooth now. Like it doesn't feel like a regular DualSense. And, you certainly lose any of the texture that the DualSense has on the back. Like that feels super, I don't want to say sticky. Cause it's not something that would bother me while I'm playing. That finish, whatever they've done to it. It doesn't feel like it's going to rub off when you're actually playing. - Sorry, I had to squint. I had to do my old man squint. One of the things I was just wondering did they get different shells? This is actually the same shell. - I can believe it. - I can still see, like if you look closely, you can still see the symbols on there. - [Austin] Oh, you're right, yeah. - [Matt] So it is still the same shell. - How much was this? Because I'm very impressed. - So when it was the only one that was available for custom things, I think this price was more reasonable. It's still a lot. - [Austin] Oh no, here we go. - It was $172. - Oh, that's a lot of money. That's a lot of money. - Yeah, I definitely don't think anyone should pay $172. - [Austin] Cause the DualSense is what? 60/70 bucks? - [Matt] $70? - Okay, at this point there are certainly kits that you can buy that will allow you to replace the black parts of the controller. You can swap out buttons. But that's a cool look. Is it worth $100 premium over a standard DualSense? Up to you. I would say may the color scheme looks a little bit odd with the four tones. - Which again, to be fair, I picked. But they're obviously not doing anything with the black and the white. It's just the sides. I don't know. All right so lastly, I watched Mystery Tech. No, I don't watch Mystery Tech. - You don't make mystery tech? You're literally there for every single episode of Mystery Tech. - All the lights are on, but no ones home. But I watch you do it and I'm like, \"I want to experience some fun.\" So, I got us. - Wait you think Mystery Tech is fun? - Lastly I got a Mystery Box. I have no idea what's in here. So I get to experience some of the unboxing with you. - Okay, what kind of mystery box is this? Is it a Pokemon mystery box? Do I get Pokemon cards inside? Cause if so, I'll be happy. - Literally just says, \"Gaming Mystery Box.\" This is actually the cheapest thing I bought. - Oh cheap mystery box is a bad combination. - $67. - Let's do it like this, to preserve the mystery for us all I'm going to bring this down and we're going to pull it one at a time without looking. Okay? So, I feel something. Okay, so its a Zelda mousepad. - Breath of the Wild mousepad, all right. I mean it is 2021 and to have a mousepad that is this small is almost offensive. - I actually totally like using small mouse pads. Okay, okay. That's worth $5. Are you keeping track of our value here? - $5. - [Austin] A little tote bag? - [Matt] A little tote bag. - [Austin] Oh, more Zelda stuff. Okay, so this is a Zelda tote bag I think. I wish it was like one of those wine bags. You know what I'm talking about? - Is it sad that with all my cooking streams I thought that was an apron for a second? - Okay, that's worth a dollar. I'll say charitably. Wait, wait, wait. Is that Zelda or is that firefly? That's from Last of Us. - That's Last of Us. - [Austin] So, we've got thank you for your order and is this a tattoo? Or is this a sticker? - [Matt] That's a tattoo. That is a tattoo. Is this Kingdom Hearts? - There's also what feels to be like some item of clothing in here which definitely took up the rest of the box so I think that's everything. Let me just say that none of these things are like the authentic licensed items. This definitely is just someone screen printed a Skyrim logo on a hoodie. - I like how your given that salt when you wear your unbranded Gengar hoodie all the time. - That looks nice. That looks nice. - Oh wait, wait, wait, wait. So this is a horde logo tattoo from World of Warcraft. But, for the alliance. - And we've got two pins and a Tootsie Roll. I would say the grand total of the value of this box is $17 and it was how much again? - $67. - Thanks Etsy. I appreciate the literal garbage that you have sent us for three times the actual price. Is the Tootsie Roll good at least? - No. - Even better. Just like the experience of subscribing and ring-a-ling the ding-a-ling bell here on This Is, you never know what you might get. It might be good, but most of the time it's disappointing and sad. I'm now going to conclude this episode with an ode to Etsy. \"Oh Etsy.\" (music fading)",
    "transcript_keywords": [
        "Etsy",
        "things",
        "mystery tech",
        "mystery",
        "keycaps",
        "Mystery Box",
        "Bulbasaur",
        "Wait",
        "custom",
        "lot",
        "Pikachu",
        "nice",
        "box",
        "thing",
        "ordered",
        "back",
        "Yeah",
        "Cool",
        "good",
        "tech"
    ],
    "transcript_entity_values": [
        "Warcraft",
        "172",
        "Zelda",
        "November",
        "Bulbasaur",
        "Etsy",
        "PS5",
        "one",
        "Razor",
        "four",
        "Austin Evens",
        "5",
        "three",
        "yesterday",
        "17",
        "2",
        "a month ago",
        "Gengar",
        "today",
        "Gaming Mystery Box",
        "Pikachu",
        "many years",
        "Myke",
        "Gran Turismo",
        "Myke Hurley",
        "Pikachu",
        "Matt",
        "months",
        "the years",
        "Three",
        "a Tootsie Roll",
        "Mystery Box",
        "Pokemon",
        "3",
        "DualSense",
        "Austin",
        "the end of March",
        "70",
        "a thousand bucks",
        "Mystery Tech",
        "two",
        "December",
        "100",
        "Skyrim",
        "early December",
        "One",
        "60/70 bucks",
        "67",
        "40",
        "42",
        "Pokemon",
        "second",
        "the Tootsie Roll",
        "Esc",
        "five to six months",
        "first",
        "Ken",
        "600",
        "Instagram",
        "PlayStation",
        "1",
        "2021",
        "PlayStations",
        "like 2 months",
        "late November"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE"
    ]
}