{
    "id": "BonHexL4AYU",
    "title": "Buy This Instead - Razer Blade 14 (2022)",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-06-21T18:05:08Z",
    "video_url": "https://www.youtube.com/watch?v=BonHexL4AYU",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 90048,
    "likes": 2638,
    "comments_count": 191,
    "description": "The Razer Blade 14 (2022) is the best laptop out there, except... I got SCAMMED on Instagram:  Don't Make a Mistake - Surface Laptop Go 2:  The Smallest Xbox Yet:  I Bought the WORST Shark Tank Products:  PS5 Pro:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Monster is Green Right? 0:10 WE WERE EXACTLY RIGHT.. 1:04 Is the 14 as Hot as the 15? 2:01 Sound and Thermals 3:23 Whats New From Last Year? 3:53 The Biggest Problem 4:38 This Model is the Sweet Spot.. 5:48 We GASPED 6:40 The Price.Problems 7:22 It Is Better.But 8:18 The Best Gaming Laptop You Can Buy 9:08 14 is the Perfect Size 10:18 I WANT to Tell you to Buy itbut 11:12 What do you think?",
    "description_links": [
        "https://youtu.be/5dd1GmKPsIw",
        "https://youtu.be/MAOpw8qRjHo",
        "https://youtu.be/iw4gjl2aako",
        "https://youtu.be/QxsClxIo6fI",
        "https://youtu.be/f9KdYp0upfE",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Monster's green, right? - Monster comes in multiple colors. The one I would normally get is fruit punched. - You're about to get fruit punched. (laughing) - Hello, and welcome to This Is. We were exactly right about this 14 inch Blade from Razer. - The Razer Blade 14. I will just freely admit at the beginning of the video is a terrific laptop that I love. I spent a lot of time using the previous generation the 2020 or 2021 whatever the last generation was. Absolutely loved it. My favorite gaming laptop. And I would say if you throw price out the window if you just say, look at this laptop for the size and performance, and screen everything like that. I still think this is probably my favorite gaming laptop you can buy right now. - So, to catch you up on our previous video we took a look at the 15 inch Razer Blade with a 3080 Ti there. It was an Intel I7 12th gen. The TLDR of that is it was too hot for us to really recommend. - It was too hot to handle. - So one, it cost a whole lot of money. The model we had was specked at around $4,000 - To be fair, that one was basically max out. - It was the, yeah - But the 15 of course is the bigger brother of the 14. And while they have the same Nvidia GPUs, the 14 does go to AMD on the CPU side. And I think it's hard to argue. That's not a good move because while yes you might lose a little bit of maximum performance the efficiency and still the raw performance of the GPU and everything of the 14. I consider that to be a better overall choice. I just like the design and the feel of this laptop. Now, if you're used to a razer laptop, generally speaking the hardware on all of these is very similar. It's all the anodized aluminum, because they do this particular design it's expensive, right? razer laptops have a little bit of a price premium just purely based on the bill. - And I appreciate that. - I love that! This feels terrific. - I love the way this feels. We were using the 15 before. - Yep. - And we had a lot of theories that all of our issues would kind of be solved by the 14. And it turns out we were right when we were just sitting here, literally doing nothing just sitting on the table, the fan was running. I don't know if you remember that. - Yeah. - Here, silent. - Dead silent. We've had this on for a couple hours now It is a little bit warm to the touch. - I've been working with it. - But it's not like uncomfortable, It's not loud. Like this is completely usable. - And the same thing goes for in gaming right? - The 15 was like uncomfortable to like use as a laptop. - Everyone's like, well, what, who who uses the keyboard on the like me! Because it's a laptop. - Yeah. - Don't tell me I'm not allowed to use the laptop as a laptop. - But Matt, didn't you know that laptops were just portable desktops? - Um, a real gamer It would've brought a mouse and keyboard around with them. Shut up! - (laughter) - If I'm spending this kind of money I'm gonna use the damn thing as a laptop. Like, I'll give you, I'm a key, I'm a track pad warrior. I played world of Warcraft for 10 years. Almost exclusively on a track pad. If you wanna use the wrist rest - Yeah. - Of your laptop, that's built into the device. You couldn't do it using- and that was just for normal tasks, that wasn't even for gaming. I wanna give razer credit, because I don't think all the heat issues that we had is razer's fault. - Especially with a 3080 Ti inside. Like it's a lot of hardware. And while the 14, I think is a terrific size, the 15 it is significantly bigger and heavier but even so still thin and light for a gaming laptop. - It's the same body. It's a smaller package. So theoretically there's even less room for thermals. AMD's what's solving the problem for me here. I wanna just be clear on that that I don't blame razer for the heat of the 15. - Well, so, talking about the 14, specifically some of the things that are new on this compared to the last generation model that I love so much. So it's got the newer Ryzen 6,000 series processors specifically, it's a Ryzen nine. - Yep. - Which means that you still have eight cores. You have the new improved graphics and everything. Here's the thing, right? Yes. That Intel chip is technically better in benchmarks. But when you consider the performance the battery life and just the lack of overwhelming heat I think the 14 inch and the AMD G GPU was a good call. - Yeah. - You also now have faster memory. So it's been upgraded to DDR five although in one of my big knocks against the 14 just like last generation is that the memory is not upgradeable. 16 gigs of Ram is the only option on the razer blade 14 as is a one terabyte SSD. I believe you can swap the SSD, but you're stuck with 16 gigs of Ram permanently. And that to me is a little bit of a problem because yes I can get away with 16 today, but I mind spending $2,000 plus on a gaming laptop. I like to be able to feel confident that that's gonna last more than a few years. And sixteen's like, okay, but you get a bunch of tabs up you get discord, you get a game going like that. That does go a little bit quickly. On top of that, you also do have the upgraded GPUs. You have 3060, 3070 ti and 3080 ti as options. - So razer sent this over to us. This is not sponsored but they did send it over us to, for us to - Borrow for a video. - Yeah. Yeah. And I specifically requested this model because I think that this is of all of their laptops, the sweet spot for what 99% of their market should be buying. One thing that razer does really well, but it makes it very difficult to shop around for them as well is they refresh their laptops constantly. Sometimes it feels like multiple times a year. There's four types of razer laptops currently available on the market. So the razer book is their productivity line. Probably if you're a gamer, you're not going for that one at all, which leads us with the blade 14 the blade 15 and the blade 17. - Which are exactly what they say on the 10. You know, they get larger they get a little more performance. If you're buying a razer blade 14 as of right now, as recording this video there are only three models to choose from. So there's the base model. That's just $2,000. Now, they all have the same Ryzen, nine processor they all have the same 16 gigs of Ram all the same one terabyte SSD. The real difference is the base model has a 14 inch 144 Hertz, 1080P display and a RTX 3060. Jump up to the $2,600 model, which is what we have here. - Yep. - And then you get the terrific 14 inch QHD panel which is 165 Hertz. Absolutely love it. 1440 is a great size, everything like that. And this has a 3070 ti and then you can go all the way up to the 3080 ti model. - This is where it gets dicey. - Okay. All right. - We- - No, no, no. - We audibly gasped when we read this. - So base model $2,000 for a 3060, a little expensive but not like egregious, not absolutely crazy. Step up to the mid spec with the which has the better QHD display and the 3070 ti $2,600. If you wanna literally just change out the 3070 ti with a 3080 ti, it is a $900 upgrade. We literally, before shoot this video had to double check that this was not a typo. Here's where things start to get a little bit more complicated. Say you take this one, right? $2,600. You've got the 3070 ti you've got the Ryzen nine and everything. I love this laptop. I think it is better than the 15, in my opinion the hardware is the right size the screen is terrific. It really does feel like it is like as we always say with razer, the MacBook of gaming laptops. Right? - But then the price. So ignore that 3080 ti model, which is I think ludicrously expensive. Let's take a look at this model specifically the $2,600 one that we both agree is probably the sweet spot. If you were to cross shop this with the ROG Zephyr, the 14 inch model, which I really do think is the main competition here that laptop, as of right now has a similar display, basically the same Ryzen nine, six generation processor 16 gigs of Ram, one terabyte SSD is a thousand dollars less. - One thing that I always talk about when we were talking about laptops, you're not buying the specs. - Yeah. - You're buying the experience. - Yeah. - So like with the, the razer blade 15, I don't care that those had all the specs in the world because I didn't like using it. So like, I am personally not a fan of the G 14. I don't like the keyboard. I don't like the track pad. I don't like that it is a plastic build. And I say that coming from a spot where I get to try out every laptop that comes through here. I have the privilege of cherry picking what I like and what I don't like. I don't want you to think that I'm about to tell to say that all those things on the G 14 justify a thousand dollars price - $950 difference. - I am not about to say that that justifies that price. - Yeah. It's slightly better. - If it was like a $300 difference. I'm going with this one every time. I always say that I, that I try and buy for the experience more than anything else. But when you get to these large numbers, like, like this I can't tell you to get this one over the, over something like the G 14, as much as I love this thing. This is like my favorite gaming laptop. - Absolutely, absolutely. If you take price outta the equation. - Yeah. - If you're Mr. Beast and you're dropping three grand on a laptop or something I think that you razer blade 14 is legitimately my favorite gaming laptop you can buy. I have no complaints about this laptop. Screen is terrific. Build is absolutely topnotch, good performance great AMD CPU GPU. The only thing I can really knock it for is that you can't get it with 32 gigs of Ram. And I can live with that. That's not the end of the world. But would you consider that this spec which I think is the spec that you should consider is $2,600 and you can get it in equivalent G 14 in almost every single aspect for $950 less. I get that there's a razer premium. Again, like we both said, I think that this is a better laptop and it's worth spending a little bit more on it is not $950 better. Like I just cannot wrap my head around that. - And it comes back to something around like something for me, with razer as well. I have a hard time recommending the 15 at all. Ever since we've got, we've moved into this new era where we are fitting much bigger screens into smaller chassis. This right here at 14 inch is not that much smaller than a 15.6 inch screen. It used to be that you you were sacrificing like the high refresh rate screen. - Yes. - Which is no longer the case. - The QHD 165 - QHD 165 is enough to do pretty much anything on here. - Oh absolutely. - The 15 doesn't make any sense to me because if it's that hot, why not just then at that point go from 14 to 17, you get way more screen real estate. You do get the better, better performance out of that with the, the higher spec stuff, you are more likely to be carrying around a keyboard and mouse because portability is clearly not a, a priority for you. Chances are, if you're bringing around a 17 in this laptop you're not carrying around like a small bag. - Yeah. - But when it comes down to price, specs everything like that, what you \"sacrifice\" by going to the 14 versus a 15 is so minimal to me that's just my opinion on this. - No, no, I, I, I completely hear you. I love razer laptops. Generally speaking, they are terrific laptops. Some I love more than others, but generally speaking they're built well, blah, blah, blah, blah, blah. But the pricing, I think, has just gotten out of touch with what you can get from, you know, Legion or ROG or whatever the case is. I want to be able to tell you, you should go buy a 14. When I see something like this, which is such a good device in so many incredibly great areas. And yet the price is so much more like, it's tough, man. It's like, I'm sure they're selling. I'm sure people are buying them. And if you bought a blade 14, and if you don't look at your bank balance, you're gonna have a great time. Like, no, one's gonna be disappointed with this laptop. It's not a $950 better than an already terrific ROG, G 14. Like that's as someone who's trying to review this it's like, what do you say to that? - Yeah - It's amazing, but too expensive. - This is a weird problem that we've had in the past. - Yeah. - Because again, we try everything. We like, we know what is good and what's not. Everyone just focuses on specs. But you know what's not on paper? Is again, how does the keyboard feel? How does the speakers sound? - Yeah. - The screen. What does the, what is the, the viewing angles of the screen? - The real world battery life, not the I can play video for 74 hours in airplane mode. - And I want people to just kind of keep that in mind when they're talking about like a $2,600 laptop because you have amazing speakers on here. You have an amazing team on here. - The problem though, is that you're not comparing this to something which is terrible, right? Like if this was a thousand dollars better but we're talking about something which I think is 98% as good in a lot of aspects as that G 14. - Yes, yes. It's just one of those things we always talk about like something like oh yeah, this is like an expensive laptop. And everyone's like, well, my $300 laptop does all the same stuff. Yeah, but this just does it better. - Yeah. - The experience is not a thousand dollars better, so like. - I paid $200 more. - I'm trying, I'm trying to play both sides here. I'm trying to do devil's advocate for both sides. This does not seem overpriced to me at $2,600 for the experience that I'm getting for this. - Until you look at the competition at which it does feel overpriced. - Right. - I'm so hung up right now, cause it's such a good device but you cannot live in a vacuum where price is not a factor. - Right. - Unless you're Mr. Beast. - Let us know in the comments, what you think do you think that this is the best laptop that's ever been a laptop? - It kind of is in some ways. - It is, I like- that's, that's the takeaway. I love this thing so much. I just wish I had more money.",
    "transcript_keywords": [
        "laptop",
        "Razer",
        "Razer Blade",
        "yeah",
        "gaming laptop",
        "razer laptops",
        "laptops",
        "Blade",
        "favorite gaming laptop",
        "model",
        "love",
        "love razer laptops",
        "gaming",
        "thing",
        "gigs of Ram",
        "price",
        "screen",
        "inch",
        "terrific",
        "Ram"
    ],
    "transcript_entity_values": [
        "Warcraft",
        "a thousand dollars",
        "16 today",
        "one",
        "Hertz",
        "AMD",
        "four",
        "15.6 inch",
        "a couple hours",
        "just $2,000",
        "GPU",
        "around $4,000",
        "99%",
        "three",
        "14",
        "1440",
        "AMD",
        "15 inch",
        "nine",
        "Ram",
        "Razer Blade",
        "AMD G GPU",
        "eight",
        "3070",
        "AMD CPU GPU",
        "six",
        "sixteen",
        "Matt",
        "2020",
        "CPU",
        "Ryzen 6,000",
        "165",
        "TLDR",
        "17",
        "3070 ti $2,600",
        "the ROG Zephyr",
        "MacBook",
        "950",
        "DDR",
        "3060",
        "15",
        "Hertz",
        "Legion",
        "Ryzen",
        "ROG",
        "Beast",
        "2,000",
        "1080P",
        "14 inch",
        "98%",
        "One",
        "3070 ti",
        "Ryzen",
        "3080",
        "Ram",
        "32",
        "144",
        "200",
        "Razer",
        "five",
        "74 hours",
        "10 years",
        "only three",
        "SSD",
        "300",
        "2,600",
        "Nvidia",
        "Intel",
        "16",
        "QHD",
        "max",
        "2021",
        "3080 ti model",
        "10"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "TIME",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "MONEY",
        "ORG",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "GPE",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "CARDINAL"
    ]
}