{
    "id": "bpne-RZDOqQ",
    "title": "Making a Wedding Ring from a Wheelchair?! - Titanium & Gold!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-09-10T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=bpne-RZDOqQ",
    "category": "Howto & Style",
    "tags": [
        "wedding ring",
        "wheelchair ring",
        "titanium",
        "cambry",
        "jerryrigeverything",
        "cambry nelson",
        "DIY",
        "Gold ring",
        "titanium inlay",
        "Rose Anvil",
        "Weston",
        "zack and cambry",
        "cambry kaylor married",
        "wheelchair",
        "accessible",
        "wedding",
        "reception",
        "events",
        "married",
        "enganged",
        "engagement ring"
    ],
    "views": 6888236,
    "likes": 181164,
    "comments_count": 8219,
    "description": "YOU GUYS ARE AWESOME! Over $24,000 donated to the school in Kenya! Every penny counts! You can donate through YouTube on this video:  or if you live outside the US and want to donate, here is the website:  say 'Zack and Cambry' in the form when donating.  HUGE thanks to my buddy Weston. Tell him hi for me over on his YouTube channel:  or on his Instagram here:    Cambry and I have done a LOT of projects together. From the off road wheelchair:  Updating that off road wheelchair:  to building legos:  to adding an elevator to our house:  Cambry has been a great teammate. And we are excited for our future adventures together. If you want to learn more about what happened to Cambry you can watch this video:  which explains more about her accident, and how she moved forward.  *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/LTXTuRrsLSA",
        "https://koinsforkenya.org",
        "https://www.youtube.com/channel/UCId9g4zlQ9BOn6fLKIt1Y0A",
        "https://www.instagram.com/rose_anvil/",
        "https://youtu.be/H3_mVryqXpU",
        "https://youtu.be/vuMg0QwKAGI",
        "https://youtu.be/Yt9sPsdml7g",
        "https://youtu.be/aqMZfQODJZo",
        "https://youtu.be/ILCDfIBn1fw",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Cambry] I love it. I think it's super unique. And I thought when I first started dating that my wheelchair would deter people from dating me. I never thought it would be something someone would want to put in their wedding ring. [Music] [Zack] Today we're going to do something a little bit different. I get married in a couple days and instead of going out and buying a generic wedding ring, I'm going to make something that's a little bit more personal. Cambry, my fiance, got hurt in a horse riding accident about 15 years ago and this is her very first wheelchair made out of titanium. I'm going to take a strip of that titanium, inlay it in this 14 karat gold, and make a ring that has more of a story...more of a connection for me and her. Let's get started. [Intro] So obviously a solid strip of gold is nowhere near ring ready. I can't just plop this on my fingers and be ready to go. It takes a lot of steps and special skills to be able to get it to that point. Luckily one of my good friends for the last 5 years knows quite a bit about making rings. [Weston] And the first thing we need to do is anneal this metal, which is basically softening it so that we can start working with it. So when you get flat stock like this gold, it comes from the factory pretty hard because of the way they extrude it and the way that they process it. So heating it up with a torch disperses those molecules and makes it soft again and makes it more workable. [Hammering sounds] [Zack] Heating it up also makes the gold black, which takes away the shininess for now, but we'll fix that later. [Twanging sounds] Next we'll take a jeweler's saw with a very fine metal cutting blade and cut through each end of the ring so that the tips will line up and we can bring it to size. [Weston] Okay, so we've got it all pretty much lined up. We've got a little bit of a lip on the top side that's sticking out, but we need to take a file and file that down anyway. Solder won't bond with dirty metal so we need to remove this top layer of black oxidation so we can get a really strong bond with the gold. The reason that we have to line the ends up is because solder isn't like welding where welding fills gaps. In welding, if you've got a little bit of a gap...this is the ends of the metal...you can fill that gap with weld. But with solder, you have to have all the metal touching because if it's like this and only a single point is touching, only that single point is going to bond. The solder's basically just like a glue. [Zack] Solder is an alloy of gold and other metals that has a lower melting point than the actual gold ring itself. [Weston] So when we solder this together we need to use flux and flux is an anti-oxidation agent. And so it keeps the metal clean so you can get a really clean bond with the solder. [Torch sounds] Okay...ooo went anyway! [Sizzling sounds] More than anything, I'm just trying to see if the solder really made a good connection with the gold. So that looks pretty good. Pretty happy with that. [Hammering sounds] [Zack] So we want the ring to be divided up evenly into thirds with an equal amount of gold on either side of the titanium center piece. So we're using the calipers set to two and two-thirds to create a dividing line between each of the segments, so we can use the lathe to cut out the center. [Weston] So I'm just going to start moving this forward. [Lathe cutting sounds] [Zack] So we have been saving the scraps of gold from the lathe because this can be melted down and reused later. So this is Cambry's very first wheelchair that she got 15 years ago. It's made of titanium. And the reason it's made from titanium and not something like steel is because titanium is 40% lighter than steel while still being as strong as steel. The reason wheelchairs need to be so light is that the people in them are usually constantly moving around and transporting themselves and the chair at the same time. And the more the chair weighs, the harder it is to move. So we're going to take a piece of this chair and inlay it into a gold ring. Another cool thing with titanium is that it's biocompatible, meaning that titanium can be used inside of your body, whether it's for like screws or rods. And it's also non-magnetic which means if you get an MRI it's not going to mess with the titanium inside of your body. Because of all the cool properties and the high strength to weight ratio, titanium is quite a bit more expensive than, say, steel. But because of how lightweight it is, it's totally worth it. Cambry's upgraded her wheelchair several times since this first one so she won't mind if we take a little sliver. [Sawing sounds] [Weston] We're going to put this into the lathe, get this squared away really nice, and then we're going to take this and cut off the 2 millimeter slice that we need to inlay it into the ring. [Zack] So right now we're measuring the distance inside of the groove of the 14 karat gold ring so we can take that measurement over to the titanium insert and mark it along the edge of the ring so we can cut it off in the right size. [Lathe cutting sounds] [Weston] There it goes! [Zack] Nice. So now we have the gold that we've been working on before and the titanium insert which is extremely lightweight. And even though it's made of metal, it's about the weight of a toothpick which is crazy. Lucky for us, the diameter of the wheelchair is almost the same diameter of the ring. With a little fancy metal manipulation, Weston should be able to get it to fit around the outside. Alright, show us how it's done. [Weston] To avoid cutting the titanium we're going to shrink one side of this ring and slide the titanium over top and expand it back out. The way we're going to do that is with this ring re-sizer. And these little holes are cone shaped so that as you push the ring down, it forces the ring to fold in on itself. Once it's shrunk enough, we're going to slide the titanium over the top into the groove and expand it back out on the ring stretcher. [Zack] So we've been compressing one side of the ring and now it's just small enough to allow the titanium insert to cross over. So now that the titanium insert is on the ring, you can see one side is much more compressed than the other side. That's because of the ring smasher. So now we're going to put it back in the ring stretcher and bring it back so it looks like it was before. So after each couple passes with the ring stretcher, we go back to annealing it to soften the gold to make sure it doesn't crack on us. Then it goes back on the ring stretcher, and then back to annealing. And repeat the process probably 20 times. The black oxidation over the gold and the titanium should come off after we're done polishing it when it's all formed again. These titanium shavings are so light...like basically holding air... or like Styrofoam. It's kind of like metallic cotton candy. Now both sides have been equally stretched. It's uniform. Titanium's in the center. Now we just need to size it. I'm a size 10 and right now this is about a size 9. [Buzzing sounds] [Zack] So after a lot of sanding with the flex shaft rotary tool we finally have the ring to size. Now it is time to clean it up and level out the top. [Lathe machine sounds] So we've lathed down the titanium center piece and now we just have the gold. We're going to sand off the oxidation and leave it with a brushed finish. [Sanding sounds] There you have it. The ring is done. 14 karat brushed gold with a titanium inlay. Weston, on a scale of one to ten, how hard of a project was that? [Weston] I'd give it a solid 9, maybe 10. It was a lot harder than, you know, some of the other inlays I've done where it's like antler or turquoise, some of these other softer things. You know, it was pretty difficult. [Zack] That's true cuz titanium is like...it's up there in the hardness scale and it's like...it's super compact and brittle I guess. So we had to be careful when we were like bringing it down. But I think it turned out pretty sweet. It pays to have friends with skills. If you want to see some more projects that Weston's done, his Instagram is @rose_anvil. You know mine: @ZacksJerryrig. It's crazy to think that this ring was once a part of Cambry's first chair. So Cambry what do you think? Was it worth cutting off a sliver of your old chair? [Cambry] Yep. I love it. I think it's super unique. And I thought when I first started dating that my wheelchair would deter people from dating me. I never thought it would be something someone would want to put in their wedding ring. And I love it. [Zack] It makes for a good story and it's something that was like a big part of your life a long time ago. [Cambry] Well...it's a big part of my life right now. [Zack] Well that particular chair! [Cambry] We're already going to be married by the time you guys see this. But one of our favorite wedding gifts was from the What's Inside channel. [Zack] They gave us something super special. [Cambry] They gave 2 classrooms full of desks with our name on it to a school in Kenya. And as a result of that, we fundraised over $20,000 to build an entire school in Africa. [Zack] An entire school. So I'm going to take Cambry to go see the desks that What's Inside donated to the schools in Africa and see the school that you guys paid for. And the donations are not over yet. We still have time to maybe, I mean this is a stretch, fund a second school in Africa. And even if we don't fund the school, the money will be used for like water storage or water filtration. [Cambry] Or books for the library. [Zack] Every single penny is going to be used for the schools in Africa. So if you haven't seen it yet, I'll leave a link for the What's Inside Family channel where they revealed our wedding present. I'll put a link for that right here and down in the video description. [Cambry] Make sure you see it. It made me cry, so it's super special. [Zack] Thanks a ton for watching. We'll see you around.",
    "transcript_keywords": [
        "ring",
        "titanium",
        "gold",
        "gold ring",
        "ring stretcher",
        "metal",
        "Solder",
        "titanium insert",
        "Cambry",
        "wedding ring",
        "inside",
        "back",
        "bit",
        "school",
        "wheelchair",
        "side",
        "made",
        "pretty",
        "chair",
        "size"
    ],
    "transcript_entity_values": [
        "Kenya",
        "two-thirds",
        "Weston",
        "9",
        "Zack] Solder",
        "Cambry",
        "Instagram",
        "Zack] Nice",
        "two",
        "20",
        "ten",
        "the last 5 years",
        "over $20,000",
        "Africa",
        "a couple days",
        "2 millimeter",
        "Zack] Heating",
        "40%",
        "Styrofoam",
        "10",
        "first",
        "14 karat",
        "second",
        "Weston",
        "15 years ago",
        "Zack",
        "about 15 years ago",
        "14",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "LOC",
        "DATE",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}