{
    "id": "bQZFmiqi2D0",
    "title": "Animal Crossing Build-A-Bears!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-06-10T15:39:18Z",
    "video_url": "https://www.youtube.com/watch?v=bQZFmiqi2D0",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 60336,
    "likes": 3277,
    "comments_count": 306,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- So you guys might know that I am such a huge Animal Crossing fan, but this is a really fun collaboration between Build-A-Bear and Animal Crossing: New Horizons. So we have Isabelle and Tom Nook. This is their winter outfits, these ones just came out. Thank you to Nintendo and Build-A-Bear for sending me these to check out. I'm so excited to unbox them! I do have the original versions that came out a few months ago also. I meant to edit that down to make a YouTube video, and clearly I never did it, so now it's a part of this video. - [Narrator] Flashback. - Right now, I'm doing a live stream. Here's all my friends. Hold on a second and let me pop open the chat box. These are my friends. We're doing a live stream on Twitch, and I'm going to be opening up the Animal Crossing Build-A-Bear collaboration. Look at everybody saying hello! Ugh, okay, so first of all, I love Animal Crossing, if that's new information for any of you. Hi, I have over 1,100 hours of Animal Crossing that I've racked up over the course of the past year. This game in particular, basically, I don't want to say it like saved my life, but it definitely really saved my 2020. I mean, it was something that I had so much fun playing. I enjoyed playing it with the audience here. All of my friends over here in the chat, they really just helped kind of like make this year really incredible. So thank you everybody over here, all of you! (relaxing music) Tom Nook, I can see his little eyeball. You can tell he's looking for money. Tom Nook is in the house. He is in my house. Oh my goodness, look at this! Look inside here, look at this, look at this. Oh my goodness, oh my gosh. (gasping) Ah! Here he is, oh my God, I'm freaking out, dude. This is so, oh my God, it's so cool. Ah, Maddie, okay, wait, Maddie is... Maddie, look, Tom Nook! Tom Nook, Maddie, Tom Nook! (upbeat music) (gasping) Ah! (upbeat music) I'm so happy right now. Okay, so we have Tom Nook. Go, we've got the next, look at Maddie, is like what's in there? Lookie, lookie! (relaxing music) This, is that Isabelle? Oh my gosh, this is so cool. (upbeat music) Oh, it's so great! Da da da da da da da! So perfect! I love this shirt too, this is a nice pick. This is a very nice choice. Animal Crossing Build-A-Bear collab, perfect. Ah, it's such a great collab and I just have loved all of the Animal Crossing collabs that they've done, like with makeup. There's so many incredible, just like merch opportunities and really cool things out there, so I'm excited. (relaxing music) - [Narrator] End of flashback. - They're so cute! You guys, okay, I'm just gonna put you here and you guys can watch me unbox. So this is their winter outfits. I mean, for me, I'm in the Southern hemisphere, so is it winter? We'll be nearing winter again shortly here. (upbeat music) Oh my gosh, look at your winter outfit! Your cute little skirt and your beautiful little flowered patterned sweater. (upbeat music) (sighing) I can't believe that this game has been out for over a year. When this came out, it was the first day of lockdown and it was also my birthday. So it was kind of the worst, best day ever. Okay, your outfit is beautiful. I'm gonna use this water bottle to keep your body propped up. Ya look great, Isabelle! All right, Tom Nook. Sure as soon as I take you out of this box, you're gonna be asking for my bells, you're going to try to take all of my money. Ya crook! But you're a pretty cool crook, and you're also very cute, so. Oh my gosh, his winter outfit is cute. I tried to wear a little winter outfit number to match my friends. This is so, look at this! I actually want this sweater for myself. Do we have adult versions of this or even a child's version and I'll just get a very large version of the child's version to try to put it on my body? Question mark? This is really cute, I love it, I absolutely freaking love it. Let's let's hear your sound. (upbeat music) Sounds the same. Let's do a little comparison here between Tom Nook summer and Tom Nook winter. Do you even, do you even weather? Do you even, do you even have season changes? Not in Los Angeles, really. Ya look great, Tom! Let's see summer Isabelle verse winter Isabelle. I really want to go to the store and actually like make a Build-A-Bear. It was honestly such a fun experience and I never really did it as a child. I've always made them as adults 'cause I don't think that this was around when I was a child 'cause if it was, I would have been begging my mom, \"Please take me to the mall, \"I want to go to Build-A-Bear, \"I want to build a bear.\" It's cool because they've so many different characters now. Like the fact that they're doing fun collaborations like this, super cool. That's really the video. I just wanted to show these to you guys because I just love Animal Crossing and I just thought this was such a fun, cute collaboration. Give me your arm, give me your arm. Let's just, let's gather around. Family, a group family hug. Is this working out for you? (upbeat music) Family, a group family hug. Is this working out for you? It's working out for me great. (chuckling) (birds chirping) Let me know in the comments below, let me know in the comments below what your favorite video game is and what got you through the last year. Let me know in the comments below what your favorite video game is and what got you through the quarantine. What is that? Is that doing something, what is happening? Okay, that's weird. (rustling) Let me know in the comments below what got, let me know the comments below what your favorite video game is and what got you through quarantine. For me, it was definitely Animal Crossing and running. Thankfully, I did have a treadmill, and I never really had run prior to lockdown. And you know, I guess being locked in with a treadmill and Animal Crossing, you never know what you're gonna do. Oh yeah, you do. You're gonna play Nintendo and you're gonna run. That's what got me through. (birds chirping) Okay. (rustling) Oh my goodness, Animal Crossing Build-A-Bear collab is here! So these are the Animal Crossing Build-A-Bear collab, so Build-A-Bear.",
    "transcript_keywords": [
        "Animal Crossing",
        "Tom Nook",
        "Animal Crossing BuildABear",
        "Animal Crossing fan",
        "Crossing",
        "huge Animal Crossing",
        "Animal",
        "love Animal Crossing",
        "Tom",
        "Nook",
        "Crossing BuildABear",
        "Crossing BuildABear collab",
        "Animal Crossing collabs",
        "Tom Nook winter",
        "winter",
        "BuildABear",
        "Crossing fan",
        "Horizons",
        "Isabelle",
        "huge Animal"
    ],
    "transcript_entity_values": [
        "the Animal Crossing Build-A-Bear",
        "second",
        "Animal Crossing",
        "the Animal Crossing Build-A-Bear",
        "Nintendo",
        "Build-A-Bear",
        "Animal Crossing",
        "winter Isabelle",
        "Isabelle",
        "the last year",
        "2020",
        "a few months ago",
        "YouTube",
        "Los Angeles",
        "Ya crook",
        "winter",
        "Maddie",
        "Twitch",
        "Animal Crossing Build-A-Bear",
        "summer",
        "this year",
        "the past year",
        "Tom Nook",
        "Da da da da da da da!",
        "over a year",
        "Tom",
        "first",
        "1,100 hours",
        "the first day",
        "Southern"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "ORG",
        "FAC",
        "ORG",
        "FAC",
        "FAC",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "FAC",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "ORDINAL",
        "TIME",
        "DATE",
        "NORP"
    ]
}