{
    "id": "bsg2UGTAC6w",
    "title": "Fuchsia OS - The DEATH of Android!?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2018-07-21T01:12:08Z",
    "video_url": "https://www.youtube.com/watch?v=bsg2UGTAC6w",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Android",
        "Fuchsia OS",
        "Fuchsia",
        "OS",
        "Chrome OS",
        "Data Transfer Project",
        "Facebook",
        "Google",
        "Twitter",
        "Microsoft",
        "transfer",
        "Drive",
        "OneDrive",
        "Western Digital",
        "WD",
        "hard drive",
        "SSD",
        "storage",
        "NAND"
    ],
    "views": 504475,
    "likes": 43339,
    "comments_count": 4977,
    "description": "Canadians! Hit up Memory Express for THE BEST electronics:   Twitter:  Instagram:  Facebook:   NEWS SOURCES:  THE FUTURE IS FUSCHIA MAYBE     SHARING IS CARING     WESTERN DIGITAL BETTING BIG ON SSDs     QUICK BITS THE FUTURE IS FOLDING PHONESMAYBE   GOOOOO SPORTS!   FACEBOOK IS FOR ADULTS, JEREMY    ON THE 16TH DROP IT EXPLODES   THE EVOLUTION OF LANGUAGE",
    "description_links": [
        "https://www.memoryexpress.com/Policies/PriceProtection.cm.aspx",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://www.theverge.com/2018/7/19/17590752/google-project-fuchsia-os-smart-home-devices-three-years-replace-android-chrome",
        "https://www.bloomberg.com/news/articles/2018-07-19/google-team-is-said-to-plot-android-successor-draw-skepticism",
        "https://thenextweb.com/google/2018/07/20/google-is-reportedly-building-fuchsia-os-to-replace-android-on-all-its-devices/",
        "https://datatransferproject.dev/",
        "https://venturebeat.com/2018/07/20/facebook-google-microsoft-and-twitter-launch-the-data-transfer-project/",
        "https://gizmodo.com/four-of-the-biggest-tech-giants-team-up-to-make-moving-1827747259",
        "https://www.theregister.co.uk/2018/07/17/western_digital_petaling_jaya_malaysia/",
        "https://www.guru3d.com/news-story/western-digital-starts-shipments-of-96-layer-3d-qlc-nand-capacity-of-1-33-tb.html",
        "https://business.toshiba-memory.com/en-us/company/tma/news/2018/07/memory-20180719-1.html",
        "https://www.businesswire.com/news/home/20180719005968/en/",
        "http://hexus.net/ce/news/mobile-phones/120353-foldable-samsung-galaxy-smartphone-rumours-persist/",
        "https://www.engadget.com/2018/07/19/esports-summer-overwatch-fortnite-league-legends-pro-gaming-schedule/",
        "https://www.techspot.com/news/75590-facebook-enforce-age-policies-after-caught-training-ignore.html",
        "https://www.neowin.net/news/facebook-launches-its-messenger-kids-app-in-mexico",
        "https://www.anandtech.com/show/13101/corning-announces-gorilla-glass-6-for-smartphones-doubles-durability",
        "https://bgr.com/2018/07/20/trump-slams-eus-google-fine-just-as-his-critics-make-him-an-idiot-on-google/"
    ],
    "transcript": "Brandon: Say what it is, Dennis Dennis: Umm... Riley: It's TechLinked... Dennis: TechLinked something Ever since I was a small child, I have wanted to be a Jedi. (Laughs) I don't know what Jedi is, Riley put it in there Riley: You don't know what a Jedi is? Dennis: I told you I don't watch Star Wars! Riley: Just... just read the script. Dennis: Now I can use the Force to send you tech news! So here it is! We first heard about Fuchsia OS a few years ago, when internal sources at Google mentioned it as a possible replacement for Android. Well, a new report from Bloomberg says Fuchsia OS is alive and well and being developed as a single unifying operating system to run on not only phones, but also PCs and smart home devices within five years. Google has thrown a bit of cold water on the report, however telling news outlets the Fuchsia is still very experimental and doesn't have a timetable for its release. But do we really need a replacement for Android? I don't. I have.. I have an iPhone... I have [an] Android phone! Yes, I do. Riley? Riley: I thought you had an iPhone? Dennis: No, I have this phone for a long time. Riley: Looks like an iPhone.. Dennis: This is an iPhone! Sharing is caring! And that's why you care about me! *Smooch* And that's why Google, Microsoft, Twitter, and Facebook have teamed up to start the Data Transfer Project. The project aims to make it super easy to transfer data between all the different cloud storage services. That's why it's called the Data Transfer Project. Because it transfers data! If the tech company.... If the tech companies super team manages to get it right, you will be able to simply import or export photos or documents, songs or anything else directly from services like Google Drive to anywhere else. But then if I want to move all my stuff from OneDrive to Google Drive, Microsoft is going to be helping me leave them It's like helping your eggs move into their new partner's house. And I can say, from my experience. I don't have experience. (Background laughs) Western Digital has primarily been known for producing hard drives, but it looks like it's majorly shifting focus to solid state drives, SSD. I think everyone knows that. The storage company has shut down one of its major hard drive factories in Malaysia that has been operating for more than 20 years. They also announced the production of new 3D NAND storage in partnership with Toshiba that can fit 1.33 terabit of data onto a 96 layer chips, not 69. It's QLC flash, which isn't as durable as SLC or MLC. But it could mean more high capacity, lower cost SSDs. Face it hard drives, the.. Riley: The era Dennis: The era of spinning disks is over! Accept your defeat Riley: [It's] over Dennis: You're done Riley: Yeah! Dennis: Sorry, it's time for Quickbits! Sponsored by MemoryExpress If you are looking to buy electronics in Canada, let me tell you, these guys are good and cool and friendly. MemoryExpress has great customer care with 15-day return and exchanges. So Canadians can feel good about their electronics and themselves. Plus, with their ber Price Beat Gurantee, they will be able to beat any authorized Canadian retailer's price by 10% of the difference both in-store and online! Click the link below right here! Riley: Yeah! Dennis: Yeah... Here. Yeah. Riley: Alright, settle down. (Dennis laughs) So, it's back to some real news again. Samsung's folding phone is looking realer than ever, with multiple news outlets reporting on separate sources that point to a 2019 release of a device with a flexible screen and the smaller display on the outside for notifications. Too bad. I won't be able to buy this because I have an iPhone. No. RILEY, I HAVE.... (struggles to get phone out of pocket) I have Riley: Are you sure it is? Dennis: I have an nVidia phone Riley: Oooh! Dennis: It's a good time to be an eSport fan as multiple sports are in the lead-up to championship right now including Overwatch, League of Legends, and Call of Duty. Engadget has a great guide for anyone interesting at yelling at a computer screen about virtual games that don't matter instead of yelling at a TV about real-life games that don't matter (crickets chirping) I'm confused (Background laughing) Facebook has decided to start enforcing their age limits restricting children under 13 from using the service. They are also releasing a new messenger app in Mexico specifically targeted at kids Which is it? WHICH ONE DO YOU WANT? WHAT DO YOU WANT FACEBOOK? (Riley laughs) Make up your mind. Also, the kids are all on Instagram and Snapchat and everywhere... in the parks, everywhere. So... you are kind of too late. Riley: Yeah.. Corning has released Gorilla Glass 6 which will allow device to survive up to 15 drops without damage. Linus needs this. BUT ONLY 15. It's impossible to protect against damage after 16 drops. It's a universal law of physics. Believe me. I'm good at physics unless you are Jedi. I don't know who Jedi is But I think. Just don't drop your things like Linus. And right now, if you search 'idiot' in Google Images, you get pictures of Donald Trump. I don't know why this is news though. Sounds like Google is working correctly. I didn't mean to say that, it's in the script when Riley... Dennis: When Riley... Riley: I mean you said it Dennis: I didn't say it. Beep, beep. Riley: You're the one who said it man. Dennis: And that's it for TechLinked, subscribe for more tech news, three times a week. Like if you liked the video and please.. just don't dislike it because... Just don't dislike my videos, please. I think I'm out and I'm doing a cool outro Riley: Okay. Dennis: Let's see. Riley: What are you going to do? Dennis: This is cool on the internet, apparently. Dennis: Let's do... Riley: Are you a magician? Dennis: Can you see me? Brandon: YES! (Everyone laughs) Dennis: Oh my god.",
    "transcript_keywords": [
        "Riley",
        "Dennis",
        "Google",
        "Jedi",
        "Umm",
        "Data Transfer Project",
        "Data",
        "Google Drive",
        "Yeah",
        "Fuchsia",
        "Android",
        "Data Transfer",
        "Transfer Project",
        "iPhone",
        "TechLinked",
        "phone",
        "Star Wars",
        "Transfer",
        "Project",
        "tech"
    ],
    "transcript_entity_values": [
        "Toshiba",
        "Quickbits",
        "Sharing",
        "ONE",
        "Overwatch, League of Legends",
        "three",
        "Canadians",
        "Riley",
        "16",
        "Bloomberg",
        "iPhone",
        "the Data Transfer Project",
        "Western Digital",
        "Google",
        "a Jedi",
        "2019",
        "Call of Duty",
        "Donald Trump",
        "Corning",
        "up to 15",
        "iPhone",
        "Snapchat",
        "a few years ago",
        "Dennis Dennis",
        "Dennis",
        "Twitter",
        "Malaysia",
        "more than 20 years",
        "Microsoft",
        "MLC",
        "Samsung",
        "96",
        "nVidia",
        "Instagram",
        "Force",
        "Brandon",
        "first",
        "under 13",
        "Facebook",
        "SLC",
        "Canadian",
        "10%",
        "Gorilla Glass 6",
        "Android",
        "NAND",
        "five years",
        "TechLinked",
        "Canada",
        "ONLY 15",
        "69",
        "Engadget",
        "Jedi",
        "FACEBOOK",
        "Fuchsia OS",
        "1.33 terabit",
        "eSport",
        "Linus",
        "Mexico",
        "MemoryExpress",
        "Google Images",
        "OneDrive",
        "Google Drive",
        "15-day",
        "Fuchsia",
        "SSD"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "PERCENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "ORG"
    ]
}