{
    "id": "BSugciSUIek",
    "title": "Python Brute Force Password hacking (Kali Linux SSH)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-12-09T15:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=BSugciSUIek",
    "category": "People & Blogs",
    "tags": [
        "linux",
        "python",
        "ssh",
        "kali linux",
        "python linux",
        "ssh script",
        "python ssh script",
        "python ssh",
        "kali linux passwords",
        "password database",
        "python passwords",
        "python brute",
        "python ssh brute force",
        "hack",
        "hacking",
        "hacker",
        "hacks",
        "hackers",
        "how to hack",
        "howto",
        "how to",
        "tutorial",
        "guide",
        "cyber",
        "brute force",
        "password hacking",
        "secure shell ssh",
        "secure shell tutorial",
        "ethical hacking",
        "ssh keys",
        "python brute force",
        "python brute force passwords",
        "python ssh passwords"
    ],
    "views": 125253,
    "likes": 4737,
    "comments_count": 179,
    "description": "Create your own virtual machine on Linode with a 60-day $100 credit:   If that link doesn't work for you, try this link:   Please note: Credits expire in 60 days. Big thanks to Linode for sponsoring this video!  // MENU // 00:00 - Intro 00:16 - SSH Brute Force demo using Linode 01:37 - Your password is vulnerable 01:58 - Leaked passwords // rockyou database 03:25 - SSH Brute Force demo (continued) 05:59 - Disclaimer 06:20 - SSH Brute Force demo (continued) 10:24 - Conclusion  // Script // Download from github here:   // Sites mentioned // Haveibeenpwned:  Kali Linux seclists:  Daniel's GitHub page:   // David's Social // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube Main Channel:   YouTube Tech Channel:  YouTube Clips Channel:  YouTube Shorts Channel:  Apple Podcast:  Spotify Podcast:   linux python ssh kali linux python linux ssh script python ssh script python ssh python  Disclaimer: This video is for educational purposes only. I own all equipment used for this demonstration. No actual attack took place on any websites.  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #python #passwords #linux",
    "description_links": [
        "https://davidbombal.wiki/linode",
        "https://www.linode.com/lp/youtube-viewers/?ifso=davidbombal",
        "https://github.com/davidbombal/ssh_bruteforcing",
        "https://haveibeenpwned.com/",
        "https://gitlab.com/kalilinux/packages/seclists/-/tree/kali/master/Passwords/Leaked-Databases",
        "https://github.com/danielmiessler/SecLists/tree/master/Passwords/Leaked-Databases",
        "https://discord.gg/davidbombal",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://youtube.com/channel/UCZTIRrENWr_rjVoA7BcUE_A",
        "https://www.youtube.com/channel/UCbY5wGxQgIiAeMdNkW5wM6Q",
        "https://www.youtube.com/channel/UCEyCubIF0e8MYi1jkgVepKg",
        "https://davidbombal.wiki/applepodcast",
        "https://open.spotify.com/show/3f6k6gERfuriI96efWWLQQ"
    ],
    "transcript": "- In this video, I'm gonna show you a simple Python script that runs an SSH or Secure Shell brute force attack against a web server. (bright music) In this example, I'm using a Linode Ubuntu server. I wanna thank Linode for sponsoring this video. You can use the link below to get $100 60 day credit. You don't have to use a Linode server. That's just what I'm using in this demonstration. As an example, if I use the command ssh, name of user, which in this case is root, IP address of the server, I'm prompted to accept the public key of the server, which I can do, and then I can paste in my password and I have access to the Ubuntu server. So uname -a as an example shows me that I'm using Debian Linux in the cloud. So I've successfully SSHed or used a Secure Shell to access a server on the internet. Now, that's great. SSH is used in many, many places, on routers, on switches, on servers, used all over the place to provide a Secure Shell or terminal to a device. So I can now configure this device and as an example, use IP address to see the IP address of the server that I'm connecting to. Now that's okay, but what we are gonna do is we are gonna use a Python script. Now I've put a link below to GitHub where you can get hold of the script. My team and I have created the script and put a lot of comments in the script. So I'm not gonna bore you going through every single line of the code because there are a whole bunch of comments showing you what the script does. This script leverages a password database. This is a big warning for both you and your family. Passwords that you are currently using on websites such as Facebook and others has most likely been leaked in the past or is most likely gonna be leaked in future. This website, Have I Been Pwned, allows you to see whether your usernames, passwords, and the like have been dumped in data breaches and are available online. Kali Linux, which is what I'm gonna be using in this demonstration, has a whole bunch of databases built into it. Here are some of the examples of the leaked database passwords that you can simply download online. So here's an example, is NordVPN. There are a list of leaked passwords from NordVPN, and I'll actually use some of these passwords in my database. There are many others. Here's Ashley Madison as an example. We have got Adobe, we have got Bible, so passwords from the Bible that people may be using. One of the most famous ones is the RockYou database, millions of passwords stored in this database, but the point is, is that there are password leaks taking place all the time. Here's Adobe. Notice the fantastic passwords that people are using. - The password is passwords. - He has passwords from the Bible that people may be using. So the point is passwords are being leaked all the time. On Have I Been Pwned, you can see that 509 million Facebook account details were leaked. This kind of thing is happening all the time. Passwords are available online. Make sure that you and your family are using random passwords and use a password manager as an example. And also if you're a high value target, in other words, you wanna make sure that you're more secure, then look at a YubiKey or a Google Titan key to improve your security. Just relying on passwords is no longer good enough in a lot of cases. - I can't even remember my own password. - Okay, so enough talking. Let's demonstrate what the script can do. Here I've manually SSHed into the server. Once again, there's the IP address of the server. I'll exit out of there. Let's go into Kali. And what I'll do is open up a terminal. ls me that in this SSH directory, it's just a directory that I've created. There are no files. What I'll do is use nano to create a file called main.py. nano is a text editor. On my Mac, I'm gonna copy the script that I've created. I'll talk through the script details in a moment. And all I'm gonna do is paste that into Kali, exit out, and save the file. I'm using Kali within VMware Fusion on my Mac in this example. You could use Kali natively, so install it directly on bare metal or on a Raspberry Pi. You don't have to use Kali. It's just makes it a lot easier. One of the requirements for the script to work is Paramiko, and that is installed on Kali, so I can use that. And then I'm gonna create a file called passwords.csv. In my example, I'm gonna use a simple database that looks just like this, but you could use a larger database for your tests. I'll save that file. And notice, I've got those two files. I'll clear the screen. And once again, I've got those two files there, main and passwords. And then what I'll do is run python3 main.py. Okay, we asked to enter the IP address of the server that we are going to attack. In this example, the IP address is this, which is a server on Linode once again. I'm gonna paste that IP address in. And what this does is make multiple connections to the server. So we're using threading in this Python script, and it's connecting to the server multiple times and testing the various passwords. Now, lots of servers will implement rate limiting, and that's what's happened here. Even though the server rate limited the connection, we continued to make connections to the server. You can see some passwords were incorrect, but we found a password for david over there. And if I look at my files, you can see we've got a credentials file. So if I cat that, you can see two usernames and passwords were discovered. We've got root using this password, and we've got this username, david and this password, and those worked on this host. Now, this script can be made a lot better. I've tried to keep the script simple because this is about learning. Again, do not go and use the script to attack devices that you don't own or have permission to attack. In this example, I'm using a Linode server. I'm working in collaboration with Linode to demonstrate, number one, the vulnerabilities of software out there, issues with passwords, and to make you aware of things that you need to do in the real world. This is for educational purposes only, once again. What the script does is it runs the main function. So this is where the script starts. We are removing some of the logging 'cause otherwise you get a lot of messages to the screen. I just want you to see a brief error message. So as an example, in the script, we saw that rate limiting was being used on the server. It looks for this file called passwords.csv. So you could go to the Kali GitLab page and download various passwords. You could also get that from GitHub. So Daniel has got a whole bunch of the SecLists, so various leaked databases on GitHub that you could download. So you'll see it's the same kind of thing. We've got Hotmail and various other databases that you could use. So basically you're gonna put your password in that file, firstly, Username, comma, and then the Password. It asks you for the IP address of the host that you're gonna connect to. And then it opens the file and works through the passwords. But notice we are using threading here. So multiple connections are made to speed things up. This SSH function connects to the host using the username and password that you've created. One of the things you need to be aware of with SSH is you need to accept the public key of the device that you're connecting to. So when I did that connection manually to the server, notice we were told that the connection could not be established because we had to accept the public key, which I then did, and now I can connect to that host. So now when I connect back, notice I'm prompted for a password. I don't need to accept the public key, but our script needs to do that. So it's gonna automatically accept the public key of the device that we are connecting to, and then it's gonna connect to the device using port 22, the username that we've specified, and the password that we specified. It opens up the credentials file and then sends the username and password to the server to try and connect to it. If there's an issue, so like there's a problem with the authentication, so in exception basically, we told that the username and password is incorrect. As you can see over here, this username and password is incorrect. Otherwise, if there's an SSH exception, it tells us that rate limiting is enabled on the server. Now again, you could make the script a lot more complicated. You can extend it. I just wanted to give you a basic example of a working SSH brute force attack. This function get IP address asks you for the IP address of the server. Make sure that it's a valid IPv4 address. And if you enter the IP address incorrectly, it'll tell you that it's an invalid IP address. Okay, so that's basically the script once again. Let's change the database. So as an example, if I wanted to add more usernames to the database, and let me just grab a few more passwords from the NordVPN hack, I'd take those passwords and what I'll do is just put them in a text editor and I'll paste them in there and then I could specify the username to try. Now, some password breaches have both username and password in the list, so you would know which usernames and passwords to use. But in this example, I'm just gonna assume that it's root. So I'll copy that, paste that in, and just remove all those spaces, copy that, and then in my Kali database, I'll paste them, for instance, here. So I've just added all of those passwords to my Kali database. Notice there are some of the additional passwords that I've added. I could run the script again, specify the IP address of the server that I'm going to connect to. Okay, rate limiting is enabled on the server. You can see we're getting quite a few rate limiting errors because we're trying to make a lot of connections to the server. But the script continues, keeps trying to make connections to the server. ls shows us the credentials files. If I cat that, you'll notice it's found the username, root and david, which are the passwords that were discovered previously. Okay, so this is a basic brute force SSH Python script. Hope you enjoyed this video. If you did, please like it. Please consider subscribing to my YouTube channel and clicking on the bell to get notifications. I'm David Bombal, and I wanna wish you all the very best. (bright music)",
    "transcript_keywords": [
        "Passwords",
        "server",
        "password",
        "script",
        "Kali",
        "address",
        "SSH",
        "Python script",
        "Linode Ubuntu server",
        "database",
        "username",
        "file",
        "Linode",
        "Ubuntu server",
        "Make",
        "Linode server",
        "SSH Python script",
        "Kali database",
        "leaked",
        "lot"
    ],
    "transcript_entity_values": [
        "Facebook",
        "SSH",
        "a Raspberry Pi",
        "nano",
        "Linode",
        "SSH Python",
        "ssh",
        "SSHed",
        "One",
        "millions",
        "two",
        "Hotmail",
        "Bible",
        "SecLists",
        "YubiKey",
        "100",
        "YouTube",
        "Google",
        "60 day",
        "IP",
        "Python",
        "Adobe",
        "Kali",
        "Mac",
        "david",
        "Secure Shell",
        "VMware Fusion",
        "Linode",
        "GitHub",
        "firstly",
        "Paramiko",
        "Daniel",
        "Kali Linux",
        "Ashley Madison",
        "David Bombal",
        "509 million",
        "python3",
        "22"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "FAC",
        "CARDINAL"
    ]
}