{
    "id": "bTYV7aFC6KE",
    "title": "Galaxy Tab S8 Ultra: A Monster Tablet!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-02-25T21:44:33Z",
    "video_url": "https://www.youtube.com/watch?v=bTYV7aFC6KE",
    "category": "Science & Technology",
    "tags": [
        "Samsung Tab",
        "Samsung tablet",
        "S8 Ultra",
        "Ultra tablet",
        "Android tablet",
        "MKBHD",
        "Samsung Tab S8 Ultra",
        "Tab S8 Ultra",
        "S8 Ultra tablet",
        "s8 ultra review"
    ],
    "views": 6355661,
    "likes": 170459,
    "comments_count": 7151,
    "description": "Megatablet. Hypertablet. Monster tablet. S8 Ultra.  That shirt!:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   Tablet provided by Samsung for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://smarturl.it/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat electronic music) - Hey, what's up? MKBHD here. And this, this is the best Android tablet out right now and it looks like it's from the future or something. Like, if you showed this to someone 15 years ago, they would think it's impossible. Like, it's this impossibly thin 1.6-pound powerful media machine with speakers that somehow fill a room, a massive battery, and an entire desktop computer interface inside. I mean, it's so thin you'd swear you could just snap it in half super easily, which I'm not gonna try it, but someone keep this thing away from Zach. So this is the Galaxy Tab S8 Ultra. So yes, there is a Galaxy Tab S8 and a Tab S8+. Both of them far more reasonable, far less expensive, and, most importantly, smaller. But you know what, there's a real interest in huge tablets like this, mega tablets, because there is an actual benefit to tablets that are this big. I would know 'cause I've been using this one. And the benefits of this massive, nearly 15-inch screen are for media watching, gaming, multitasking, and, of course, the huge canvas for the stylus. They're all very real. There are also some real drawbacks though. So if you are one of the many people who have been tweeting at me asking about this thing wondering if it's a legit iPad Pro alternative, well, this is everything you need to know. So, really, the number one standout piece of this tablet is the topnotch display. Sorry, I had to. We'll get there. But the screen is just awesome, and there's a bunch of things that combine to make it probably the most impressive I've ever seen in a tablet. Number one is just of course the sheer size of it. 14.6 inches diagonally, which definitely suits the Ultra name. And it's got these thin symmetrical bezels all the way around, aside from the dual cameras. Now, we're working with a 16:10 aspect ratio at 2960 by 1848 resolution, which sounds really high. In person, it's not the sharpest thing I've ever seen just because it's so huge. So it checks out to about 240 ppi. And if you get close enough with this pixel arrangement, you can actually start to see the soft edges of some text and icons and things like that. But it's definitely not a problem at all for normal viewing distances. And then it's OLED. So I think this is the largest OLED touchscreen I have ever used. We all know about the mini LED displays in some laptops and even the iPad pro with their tons of local dimming zones, but this is a full-sized, basically laptop-sized, screen where every individual pixel lights itself. So you're getting those pitch black inky blacks, you're getting an incredible contrast ratio, and watching videos that take advantage of it are very impressive. There's also an optical fingerprint reader underneath the display on the right-hand side. And the only thing, really, that's not world-class about this display honestly is that it's not LTPO, it's just 120 hertz all the time, and the max brightness, it maxes out at 380 nits, which is actually totally reasonable inside but it's not actually doing much if you go out in the sun, if you're the type of person to use a tablet near a window. So that's just something to keep in mind. Just for context, the M1 iPad Pro gets up to 600 nits and the S22 Ultra, the phone I just reviewed, gets up to 1,750 nits, but, you know, that's a phone you use outside. So let's talk about the notch then, right? So huge display. Up at the top in the middle, there's this little tiny notch with two cameras in it. That's two 12-megapixel 4K webcams, one regular and one ultra wide. There're both too big to fit in the thin bezels that they fitted all the way around the tablet, so it punches in a little bit. They've put this little notch up here. It's tiny. It's way smaller than the iPhone's notch and in a display that's way bigger. Honestly, it doesn't bother me at all. Use the screen for three seconds and it disappears to your eye and you forget about it. Now, is there a hilarious irony that this is the same company that made these commercials making fun of the notch every chance they got and now they're the first to put a notch on their tablet? Yeah, absolutely. That's really funny. But I don't actually mind it here. What I will say is they did put them in the right place, which is on the horizontal long side of the bezel, because this is a tablet that's basically meant to be used horizontally all the time. You know, an iPad, maybe you can argue sometimes you use it in portrait like a notebook and a clipboard, sometimes in landscape. This one feels pretty ridiculous holding it vertical, and I think Samsung knows it's gonna be horizontal a lot with this aspect ratio, and so they put the webcam on the top and the fingerprint reader over there on the side is easily reachable with your thumb, it's great. And then Dave2D said something really interesting, really smart in his video, which is we don't actually usually hold these huge tablets while we're using them. Like, sometimes you do, sure. Maybe you're leaning back on the couch, holding it up watching a video. Maybe typing something out real quick. But actually most of the time we're using a tablet, we're sitting it down somewhere, it's propped up or it's in a folio case. I don't think my iPad Pro has left its folio case in like a year just cause I prop it up all the time. And so there is a book cover case available for the S8 Ultra, but it costs $350. So there's your kickstand. You get to prop it up, watch stuff, but this plus the keyboard, $350. So I've been using this total at least $1,450 package for about a week. And it's great. Honestly, it's great. The performance and animations have been consistent. It's amazing for media consumption, YouTube, Netflix, games. That is not a surprise. What's interesting is the Snapdragon 8 Gen 1 in here, it turns out it's actually underclocked a little bit. This actually benchmarks lower than phones running the same chip, but I'm telling you, that's because a phone is eight-millimeters thick and it can actually fit a new cooling solution for this hot new chip. This tablet is too thin and can't fit that. So this tablet'll get a little bit warm and underclock a little bit. So then the battery life is okay. So it has a surprisingly large 11,200 milliamp hour battery in here despite being so thin, but it also has a huge screen. So evens out. I was getting about eight hours of screen-on time on a heavy day, which is a bit more than a really good phone but you definitely do still have to charge it at the end of a heavy day if you use it a lot. But if you use it occasionally, you know, the standby time is excellent. It can last you several days. I just have a feeling if you're spending this much on a tablet convertible thing, you're gonna wanna actually get a lot of use out of it. So we're probably already fully entrenched in the what is a computer conversation. So this computer is very much still a large Android tablet. So that means it has all of the pros and cons of every other Android tablet, meaning there's still no Instagram app that scales properly. My to-do list app, TickTick, doesn't really take advantage of the whole screen. SoundCloud doesn't work. There's lots of apps that don't look amazing on this huge screen because that's the way it is with Android tablets. And that's on the developers, yes, but that's a pretty consistent Android tablet thing. But you know what, there's one way you could say is maybe a way around it and that is Samsung's DeX. So DeX is Samsung's desktop UI that's built into a lot of their devices. So if you were to plug into a keyboard and a monitor, or in this case, the book cover keyboard, and hit the shortcut key, it switches you into DeX mode, which kind of feels like a Chromebook. So you've got a dock at the bottom that actually matches what you had in tablet mode, plus a windowed UI now that lets you multitask and move things around. You can do file management and treat it a lot more like a real computer, or at least a Chromebook. So the trackpad is decent. It's just overall a next level of versatility that makes this thing way more useful if you are trying to turn it into your primary computer. You can also change the opacity of windows for some reason. It's great. It's definitely not perfect though. There's plenty of apps that don't play well with the scaling. The whole system still has the same problem too that the iPad has, which is it's very top heavy. All of the weight is in the tablet and it's genuinely difficult to use it on your lap like a normal laptop. But I still say this is clearly better than the iPad's attempt at being a computer. It does a lot of things better. It does the floating window support way better than the iPad ever has. It has a micro SD card slot, which the iPad has never had. And it also has the cameras horizontally in the right place and in much better quality than the iPad. So for video calls or recording videos with the front-facing cameras, these cameras are actually really good. The ultra wide camera even has Auto Framing. Although, it's not nearly as responsive or smooth as the iPad Pro and it cuts down to 1080p in this mode. But at least it looks like you're looking at the person you're talking to on a Zoom call. And then last but not least, drawing stuff. Now, I'm not even gonna pretend to be an artist who can take advantage of the differences between this and the Apple Pencil versus others, but here are some things that I definitely did notice. So number one, this pen still charges on the back of the tablet here in only this specific orientation, which is kind of easy to scrape off and get knocked off if you move around too much, which is unfortunate. But what's funny is they did make a case, this book cover case, and you can see it has a little indentation here. So if you slap it on the back, it actually holds the pen in place if you align everything just right. So it's charging and can be accessed like that. Cool. The other thing is it actually does now attach magnetically to the top, but it doesn't charge there. So that's a good place to leave it temporarily, I guess, if you're going back and forth between using it and not using it. But yeah, if it doesn't charge there, don't forget about it. At least you have the option. Then number two, this pen is actually included with this tablet. So you can mess around with it if you want to. You're kind of encouraged to play around with it and try stuff. The features pop up and just make themselves known whenever you pull the tablet off of the back of the thing. But, you know, it's really good at just drawing and sketching and things like that. The palm rejection with these tiny bezels is good enough that I don't have to think about it. And it has lightning quick, basically real-time, 2.8-millisecond response times that make it feel like real paper. Remote controlled Air Actions are still here. Samsung Notes is as powerful as ever with the handwriting recognition and PENUP is also included for, you know, more digital drawing type stuff. And it's good. You know, I'll defer to some actual digital artists to make the call on whether it's actually better than other options out there in their reviews, but I like this overall package. And then bonus points, the Tab S8 Ultra has the second best speakers I've ever heard in a tablet right behind the larger iPad Pro. But it's got all this space, so it's got this huge quad speaker set, Dolby Atmos support. Very loud. Not quite as full and bassy as the iPad Pro but easily fills a room plenty for watching movies and videos and things like that. Really good speaker setup. So if it sounds like I like this tablet a lot, it's 'cause I do. I really like this. I think this is the best Android tablet out right now, and it's even gonna be getting better. They said they were gonna add, they're working on adding LumaFusion to the Galaxy Store, which is a video editing app on tablets, which could make it even more powerful. So then do I recommend it? Well, you gotta know what you want and if you are looking for a tablet that actually fits the Ultra name, this is the first one that actually does it. The huge screen is kind of unrivaled in any other tablet and then it's so capable with DeX and with all this other stuff they've built in that it's actually genuinely one of the most versatile computers you can get. So that's been it. Thanks for watching. Catch you guys in the next one. Peace. (upbeat electronic music)",
    "transcript_keywords": [
        "tablet",
        "Android tablet",
        "iPad Pro",
        "iPad",
        "Android tablet thing",
        "Ultra",
        "thing",
        "Galaxy Tab",
        "tablets",
        "Pro",
        "huge",
        "things",
        "Android",
        "screen",
        "huge tablets",
        "Tab",
        "lot",
        "good",
        "huge screen",
        "time"
    ],
    "transcript_entity_values": [
        "Notes",
        "about a week",
        "1080p",
        "14.6 inches",
        "12-megapixel",
        "three seconds",
        "eight-millimeters",
        "350",
        "one",
        "16:10",
        "iPad",
        "the S22 Ultra",
        "15 years ago",
        "the S8 Ultra",
        "LumaFusion",
        "1.6-pound",
        "about eight hours",
        "DeX",
        "iPad Pro",
        "8",
        "nearly 15-inch",
        "1848",
        "11,200 milliamp hour",
        "Ultra",
        "UI",
        "Android",
        "Chromebook",
        "380",
        "Auto Framing",
        "4",
        "half",
        "first",
        "at least $1,450",
        "Netflix",
        "several days",
        "Air Actions",
        "PENUP",
        "2.8-millisecond",
        "iPhone",
        "SD",
        "the Tab S8 Ultra",
        "DeX",
        "SoundCloud",
        "1,750",
        "second",
        "max",
        "YouTube",
        "about 240",
        "600",
        "number two",
        "Dolby Atmos",
        "Apple Pencil",
        "the Galaxy Store",
        "M1 iPad Pro",
        "Instagram",
        "two",
        "2960",
        "Samsung",
        "120",
        "Zach",
        "the Galaxy Tab S8 Ultra"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}