{
    "id": "BUisXF5_TCU",
    "title": "Pixel 3 XL - The Notch Is Real",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-10-09T21:53:13Z",
    "video_url": "https://www.youtube.com/watch?v=BUisXF5_TCU",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "pixel 3",
        "pixel 3 XL",
        "pixel 2",
        "pixel 2 XL",
        "google",
        "event",
        "samsung",
        "smart phone",
        "first impressions",
        "biggest notch",
        "worst notch",
        "iphone notch"
    ],
    "views": 493882,
    "likes": 16551,
    "comments_count": 3856,
    "description": "Before I review the Pixel 3, here are some early impressions after the event. I love the phone, but I don't love the notch.  Background Music: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, How's it going? Dave 2D here. So Google's Pixel Event just went down And the notch is REAL. There was a part of me that just wanted to believe that was somehow big troll from Google but it really looks like the notch is the thing I found it strange or almost humorous that during the event they did a lot of like camera techniques for the renders and they use wallpapers that kind of disguise or kind of mask that notch but it's there. I also think that in the software you can't HIDE that notch like you can on other android phones like a lot of times you can pull a black bar down but I think the notch is so BIG that a black bar in that region would just look really weird so I don't think you can actually should hide that notch in software (as of) right now The notch on the Pixel 3XL is housing 2 selfie cameras one of them being a wide angle selfie it's a 97 degree camera angle which is actually wider than the wide angle selfie on the LG V40 and its housing one of the front facing stereo speakers so there is a reason for that notch to exist as for whether or not it kind of makes the whole notch worth it really depends on the user personally, I am not a big fan of notches but, this notch despite it being so prominent is somehow tolerable to me just because how many other good things are going on about this phone so the big thing I love about this year's Pixel 3 is the design both the 3 and the 3 XL have a much more premium look to the phone than last year's Pixel 2 and Pixel 2 XL I really like the colours this year the white with the teal power button looks awesome and the glass in the front and back make the device look a little more luxurious that glass back allows it to have wireless charging which we haven't seen on a Pixel device before the most iconic feature of the Pixel and the Pixel 2 XL from last year was probably the camera it's a camera that just held up really well over time even a year after this thing came out it's still one of the best smartphone cameras on the market",
    "transcript_keywords": [
        "Google Pixel Event",
        "Pixel",
        "notch",
        "year Pixel",
        "Google Pixel",
        "Pixel Event",
        "year",
        "big",
        "Pixel device",
        "wide angle selfie",
        "camera",
        "HIDE that notch",
        "Google",
        "angle selfie",
        "thing",
        "big thing",
        "kind",
        "wide angle",
        "Event",
        "selfie"
    ],
    "transcript_entity_values": [
        "Google",
        "2",
        "last year",
        "Pixel 3",
        "XL",
        "V40",
        "one",
        "LG",
        "this year",
        "a year",
        "97 degree",
        "year",
        "the Pixel 3XL",
        "3",
        "Dave",
        "last year's",
        "Pixel 2",
        "Pixel 2 XL"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "EVENT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PRODUCT"
    ]
}