{
    "id": "BV1O7RR-VoA",
    "title": "Dell just DESTROYED the Surface Pro! - Dell XPS 13 2-in-1",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-12-23T20:30:44Z",
    "video_url": "https://www.youtube.com/watch?v=BV1O7RR-VoA",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "dell",
        "xps",
        "laptop",
        "2-in-1",
        "convertible",
        "tablet",
        "surface",
        "microsoft",
        "windows",
        "wfh",
        "office"
    ],
    "views": 2317284,
    "likes": 35266,
    "comments_count": 1823,
    "description": "Get your next PC built with LYTE:   Dell is back with their next XPS laptops, but this time, they've got a Microsoft Surface competitor. Alex is here to take a look at the XPS 13 and XPS 13 2-in-1 to see if Dell's lineup still holds the bar for easiest laptop recommendation or if these latest entries aren't up to par.  Buy a Dell XPS 13:  Buy a Dell XPS 13 2-in-1:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Need a normal laptop? 0:23 Unboxing the XPS 13 1:21 Unboxing the 2-in-1 1:58 2-in-1's Keyboard and Pen 2:43 XPS 13 design impressions 3:41 2-in-1 design impressions 4:09 Sponsor - LYTE Gaming 4:45 XPS 13 specs and 13 Plus comparisons  7:45 A closer look at the 2-in-1 9:30 Trying out the pen 10:29 Comparing webcam and mics  11:57 Comparing speakers 13:31 Gaming - Valheim 14:18 XPS 13 Teardown 14:50 XPS 13 Pricing and overall thoughts 15:42 XPS 2-in-1 Pricing and overall thoughts 16:59 Outro",
    "description_links": [
        "http://lytetechnology.com/shortcircuit",
        "https://geni.us/Yogb",
        "https://lmg.gg/g8Dwd",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is the XPS 13 Plus, a laptop that Dell spent heaps of time engineering so that it had the most power in a 13 inch frame. But what if you don't need that power and want just a normal laptop? Well, Dell's got you covered there too. Today we have the XPS 13 and the XPS 13 2-in-1. I'm kind of excited cause they look like... Well they look like laptops. Oh, oh that's pretty. This is a really fancy little color. I normally think of Dell as just, well you know, silver. This one's like a purple. Does it match my hat? So that's the XPS 13, the normal one. Oh dear. One of the things that's included in here is a USBC to 3.5 millimeter headphone jack adapter. Oh my god, Dell. I thought when they were doing the XPS 13 as like a normal laptop, they'd include normal laptop things like headphone jack. Idiots! God dammit. Well one good thing is that they're little dack, despite looking pretty small, is actually decent. You can run some proper over your headphones with them. Sounds pretty good. You know it also sounds good though? Having a 3.5 millimeter headphone jack, Dell. Anyway, for the charger we get... What is this here? A little small boy, 45 watts. This thing right here, not super powerful, doesn't really need to be. Moving on, here we have the XPS 13 2-in-1, which is more like a two cause it's in two pieces now. (Alexander laughs) Yeah, it's right here... Oh my god, look at the size of that camera! So if you couldn't tell, this is Dell's take on the Surface Pro and it well it has a massive camera on the back. That's hilarious. I am actually concerned about that, look at how much that sticks up, Andy, do they have anything in here to help protect that? Oh once again, USB to headphone adapter is there. God dammit, Dell, please! And once again we have a 45 watt adapter. Here we have our PC and our dock. Whoa! That's a strong magnet. And then this comes in here like that I'm guessing? Oh, okay. Oh, so there must be a series of magnets in the back right here. So you can adjust how much you want to go, you see how it kinda snaps the different locations there and also included is a pen. Ah, that's where it's supposed to go, right there. I'm a bit confused about how this pen gets charged. Andy was just wondering if it charges on the side, maybe. - [Bell] Yes. - Yes? Oh it charges right there. Dang, okay that's pretty well integrated, I do have to say. - [Bell] Charge lasts for 50 days and charges in under two hours. - The charge on this lasts for 50 days? Damn. Full charge in two hours that is really quite good. Alright, let's have a look at the XPS 13 right here. Compared to the Plus, it is very similar size-wise just a couple millimeters thinner at the back. The I/O is disappointing, you get Thunderbolt and Thunderbolt. Both of those do your charging which they have to cause there's literally nothing else that you can plug into it. And I do have to say that I really like that they have Thunderbolts on both sides. So you can choose where you want to put your charger. Opening it up, color is really nice on this thing. Look at this guys! They have space between their key caps on the Plus there is none and this is not as bad as you would expect, it's not like it's just like a piece of glass. They have a very little bit of a dish which does... You can get used to it pretty fast but at the same time until you're used to it, this is a pretty annoying keyboard to use. This one right here, I imagine, right out of the gate you're gonna be zooming on it. Before we continue on this too much let's have a look at the I/O on the 2-in-1. We have two Thunderbolts, that's it. Not even charger on the other side either. Just the two Thunderbolts. I'm disappointed that's gonna be really annoying. On the 2-in-1 though, there is no spacing between the keys. This is very, very similar to the keyboard that we have on the XPS 13 Plus. Ah shut up, truck! I'm trying to segue to our sponsor, Lyte Gaming. Thanks to Lyte Gaming for sponsoring this video. Lyte offers both pre-configured and custom PCs, build kits and custom accessories. They focus on being 100% transparent with their prices such as their builds where they show prices for each part and their nominal $100 build fee. On top of that they offer build kits, where pre-selected parts are delivered to you for a building taking away the stress of tracking down each individual part. Every Lyte PC comes with a one year warranty and a 30 day free return period, alongside a quick replacement service in case you need it with full shipping covered. Check out Lyte at lytetechnology.com or in the link in the video description. Okay, it's pretty clear that the engineering team has spent most of their time on the 2-in-1 here so let's just leave that for a second. Quickly run over the 13 and then we can get to the real party piece here. So this right here is a 1920 by 1200 P screen so that's 16 by 10 and I do have to say, it looks really quite good. It is obviously not as good as the one on the 13 Plus. This guy right here has a 4K OLED display, which is just... It is an exceptional display and it also means you got six hours of battery life so you don't buy that one. Instead you go with a panel that's on the 13 right here because well, you just can't accept six hours of battery life. If you have large hands this is not really gonna be great for you. This is a problem with pretty much all 13 inch laptops but as you can see here, my hand is just falling off of the back edge. One thing that's fortunate is that this is... It feels like there's a bit more of a shamp for here. On the XPS 13 Plus, it was really sharp, you can see how it's sort of this diamond cut edge here and I ended up just taking a little cutoff of this with our deburring wheel. Made it way more comfortable, highly recommend doing that but it's something that you don't need to do on your brand new XPS 13. Also, this is really light. How much does this thing weigh? Two and a half pounds, that is very light. Compared to the Plus about 0.25 grams, so like quarter of a pound, 2.9 pounds, so right in between the two, I'm impressed this feels heavier. Wait, no I'm just dumb. Okay, little bit heavier still, which makes sense. This is a very slightly larger laptop. Alright, let's see how this thing handles. The keyboard on the XPS 13 is fantastic. It's not surprising, Dell has just always done a really good job with their keyboards, particularly on the XPS line. The biggest difference between the 13 and the 13 Plus though is definitely the power. In this 13 right here we have an Intel i5-1230U. You can get that as an i7 but either way that's two performance cores, eight efficiency cores. Now this is pretty good for your battery life, that helps us get up to that 12 hours or so that they said. But it's not great if you wanna do a whole lot of very intense stuff. The 13 plus has just an exceptional amount of power for how big it is. In our video it just absolutely smashes the MacBook 13 inch, like destroys it. The 13 Plus though does not have that kind of horsepower. That said, it still has 10 cores. They fit 10 cores into this thing! Aside from that, we get 16 gigabytes of RAM and it is, yeah, 5,200 mega transfers per second, which means it's soldered down (indistinct) cannot currently get that fast. Hopefully Dell brings cam into things like this but then again, this is probably too thin for a cam module even. Here is what seems like the star of the show though in the past they had a much more traditional, the screen goes all the way around but now you get even more degrees of freedom. It can go wherever you want. You can lose this and you still have a whole laptop right here. Well, you have a tablet. The first thing I'm really curious about is can I use it as a laptop? Nope, don't do that. So this is a tabletop not a laptop. That said, on the table this thing feels really good. So I don't know if you can tell but this is just a slab of glass and aluminum and it is incredibly stiff, I don't want to harm it by bending it too much. The keyboard is also incredibly stiff especially for how thin it is. Oh, okay I can... When you try and twist it, you can twist it. This keyboard is fantastic especially given it's just here like a little floppy thing. Also, big ol' track pad here. It's actually a decent size, probably bigger than the normal 13. It is, look at that. So this display is 2880 by 1920, that is such a strange resolution. But at the same time for this device I think it is a really good resolution because they could have just slapped a 4K panel on this and been like, \"Ha-ha, we have the most pixels.\" And then it would've been dead in five hours or whatever. Instead it's able to get, what is it, Jay? Doesn't say? Oh that's not a good sign. - [Bell] Says the size but not the battery life. - What's the size? 49.5 watt hours. So that puts us just above like the Surface Laptop and this is a slightly lower resolution display. We're probably landing what, nine hours of battery life on this, something like that? The reason you get a 2-in-1 like this is so that you can use it as kind of a note-taking tool. These are the sort of things where, if you are a student particularly this device can get you through nearly anything. This stylus and screen combo, excellent. I absolutely love it. I am not an artist so I can't really evaluate the stylus against a bunch of other things. My main criteria is just if I start writing does my writing sort of turn out like my writing looks? It's not perfect. You can see sort of... Can you see this question mark right here? It's kind of a little bit strange. That was not me that did that. That was just kind of the pen spazzing out for a second. But at the same time this all just looks basically like my writing, which is how I evaluate tablets like this. Oh, these look like they do support HDR. What are these, 400 nit peak brightness? 500, damn. Okay, that's actually pretty good. This is probably gonna look really good for your Netflix and stuff. Alright, let's see how these cameras do. Oh wow, this is already immediately super clear what the winner is. The the 13 2-in-1, the camera absolutely blows away the other two. Now in fairness too, this is the XPS 13. This is a very challenging scene. If we just move this a little bit more like here, yeah, it's still doing a pretty bad job. It's okay enough but as you can see, if you have something like a light behind you, it completely blows it out. Compare that to the 2-in-1 right here. This is just so much sharper and just so much more better in every single way. Look, look at this, got the light right there, It still is exposing for my face properly. Right here, that's kind of weird but at the same time this is a very challenging scene for just a stupid little webcam and I look sharp. You can actually see beard hairs. My toque looks like a toque instead of just a blob of purple. Very, very good job on this webcam, Dell. One of the best that I've ever seen. 13 Plus is somewhere in the middle, I think. The 2-in-1 has its party trick. How do I turn this around here? There we have Bell, we have Andy. I'm gonna just have to turn this around and you'll have to compare it to the other ones but I'm fairly certain that this is going to be much better than all the other webcams. Here we go, even compared to the MacBook. Not the MacBook has a particularly good webcam but the XPS 13 2-in-1 absolutely destroys it. One thing I'm concerned Dell hasn't been able to pull off in this thing though, is the speakers. Dell's speakers lately have been very good but on devices this small, can they still do it? (soft upbeat electronic music) So on the 2-in-1 first impressions not very loud. (loud upbeat electronic music) Oh yeah, speakers are way better on this guy right here. (loud upbeat electronic music) That's impressive. Going back to 2-in-1 (soft upbeat electronic music) not as good by a lot. (soft upbeat electronic music) (loud upbeat electronic music) Alright, so we can very safely say the 2-in-1 speakers are not very good but the 13 is moving on to the next round. (loud upbeat electronic music) Okay, so the 13 plus is clearer, that's for sure. Maybe not as loud though. (upbeat electronic music) Wow, huh. (upbeat electronic music) I was not expecting that but the XPS 13 has better speakers than the 13 Plus. So here we once again have the XPS 13 compared to MacBook Pro 14. (loud upbeat electronic music) Okay, yeah, so the MacBook's way better. All of that said, for a 13 inch device the speakers on this thing blew me away. They are very clear, there's actual bass, there's notes below 100 hertz probably. Good job, Dell. Is there anything we've missed? Valheim, do you know what's my absolute favorite thing? If you want a game on this, mouse goes in here, power goes in here, where do your headphones go? You don't, you don't have it. God dammit, Dell. Given we just had 20 FPSs in the menu, things aren't looking good as low as it can get. 1366 by 768 P. Oh, okay. Okay, here we go, here we go. 50 FPS, whole 50 FPSs. So this isn't amazing but at the same time it's good enough if your kid wants to play Minecraft on it, they can get away with it. The settings are gonna be pretty low but at the same time it'll do it. Which is a lot more than you can say about a device that's this thin from what, a year two years ago. Alright, let's quickly take this thing apart. Oh my God, look at the size of the battery in this thing. I've been getting mad at some companies lately for not taking advantage of the space in their device. You cannot say about that with Dell here. Oh, boo! SSD, not upgradable. You can see it right here that thing is soldered the frick down, which means that you not only have to choose how much RAM you're getting with this device but also how much storage you're getting when you buy it. Which brings us to how much is it? It starts at $850 and as speced it's $1,150. This one's tough though, simply because headphone jack, there's no headphone jack and there's also the really large problem that that's very similar to what M1 Air prices M2 Air. Oh my god, nevermind. Okay, so the XPS 13, fantastic laptop. I did not realize that the M2 air was 16 gigabytes of RAM and 512 gig SSD is $1,600. That's stupid. This is still a bit of a tough device to recommend, simply because it's getting up there in price but at the same time it's really light. The build quality is exceptional especially for a device like this. What else? Track pad's good, screen's great, keyboard fantastic. This is a really good little laptop. Oh, and it's purple! I really like the purple. What I feel like's really easy to recommend though is the XPS 13 2-in-1. The three by two display for one just makes this so nice. It also has maybe the best webcam we've ever seen in a laptop. That was exceptional, blew me away. The XPS 13 2-in-1 starts at $1,150 if you want the stylus and folio, which I would say is a requirement. How does that compare to the Surface Pro 9? Wow, I have never been able to recommend something easier over a competitor than this. So a Surface Pro 9 with the config that you want, which requires an i7 even though you want an i5, 16 gigabytes of RAM, 512 gig SSD with the folio and the pen comes to $2,100. Oh my God, Microsoft, you are out to lunch. So the XPS 13 2-in-1, I actually really like this. If you're a student and you want to take notes, this is a great device. $1,300 is can be a bit steep but at the same time for that you're getting the i5, 10 cores. You're also getting the pen, the folio, those are a requirement, love it. This thing lost for 50 hours that's pretty cool. - [Bell] No, 50 days. - 50 days. (Alexander chuckles) Anyway, if you guys like this video hit Like, get subscribed and just have a fantastic ol' day.",
    "transcript_keywords": [
        "XPS",
        "good",
        "Dell",
        "thing",
        "pretty",
        "laptop",
        "time",
        "pretty good",
        "god",
        "things",
        "hours",
        "device",
        "headphone jack",
        "bit",
        "Surface Pro",
        "headphone",
        "Lyte",
        "kind",
        "normal laptop",
        "Dell spent heaps"
    ],
    "transcript_entity_values": [
        "Minecraft",
        "768 P.",
        "4",
        "USB",
        "Bell",
        "MacBook",
        "850",
        "1,150",
        "two hours",
        "Lyte Gaming",
        "50",
        "10",
        "Two and a half pounds",
        "Netflix",
        "3.5 millimeter",
        "one year",
        "500",
        "five hours",
        "Alexander",
        "2",
        "MacBook",
        "the Surface Pro 9",
        "Dell",
        "16 gigabytes",
        "Valheim",
        "Thunderbolt and Thunderbolt",
        "FPS",
        "2.9 pounds",
        "49.5 watt hours",
        "M2",
        "Andy",
        "Today",
        "the Surface Laptop",
        "the 2-in-1",
        "Lyte",
        "13 inch",
        "nine hours",
        "100",
        "first",
        "two",
        "XPS",
        "50 days",
        "eight",
        "1366",
        "SSD",
        "M1 Air",
        "50 hours",
        "1920",
        "XPS 13",
        "Jay",
        "RAM",
        "one",
        "about 0.25 grams",
        "second",
        "45 watt adapter",
        "13",
        "1,300",
        "45 watts",
        "30 day",
        "Microsoft",
        "the Surface Pro",
        "5,200",
        "1200",
        "512",
        "1,600",
        "jack",
        "day",
        "USBC",
        "M2 Air",
        "100%",
        "Intel",
        "three",
        "One",
        "six hours",
        "100",
        "a year two years ago",
        "jack adapter",
        "MacBook Pro 14",
        "under two hours",
        "the 13 Plus",
        "2880",
        "this 13",
        "16",
        "12 hours",
        "2,100",
        "400",
        "20"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "FAC",
        "LAW",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "QUANTITY",
        "TIME",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "EVENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL"
    ]
}