{
    "id": "bvpcfAayjtY",
    "title": "Pixelbook Go hands-on: Google’s cheapest Chromebook yet",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-15T15:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=bvpcfAayjtY",
    "category": "Science & Technology",
    "tags": [
        "pixelbook go",
        "pixelbook",
        "pixel book go",
        "google pixel book go",
        "google pixelbook go",
        "google pixel book",
        "google pixelbook",
        "google pixel",
        "google pixel 4",
        "google pixel go",
        "pixel 4",
        "pixel 4 xl",
        "made by google",
        "chrome",
        "tablet",
        "laptop",
        "google laptop",
        "google pixel event",
        "pixel event",
        "google event",
        "intel processor",
        "processor",
        "dieter bohn",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 543425,
    "likes": 7823,
    "comments_count": 727,
    "description": "Google's new Pixelbook Go brings the price down just a bit  to $650 to start. It's a small, slightly round, really nice looking Chromebook. With Intel processors, an option for a 4K screen, and a great keyboard, it could be a strong competitor to the other Chromebooks in that price range. Google is promising 12 hours of battery life, too.  Read more:  Pixel 4 and 4 XL hands-on:  Pixel Buds hands-on:  Nest Wifi hands-on:  Nest Mini hands-on:  Top announcements from Googles Pixel 4 event:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2qgDwBL",
        "http://bit.ly/35ASN0r",
        "http://bit.ly/33uhNV2",
        "http://bit.ly/2MivuAJ",
        "http://bit.ly/2prddrS",
        "http://bit.ly/2Mg686A",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Yep, Google's doing it. They're making another Pixelbook. This is the Pixelbook Go, and it's Google's first attempt to make a Chromebook that doesn't cost, like, $1,000. The Pixelbook Go starts at $650, which is a little bit more expensive than other Chromebooks, but it doesn't cost an arm and a leg. Maybe just, like, an arm. (relaxed electronic music) The Pixelbook Go is a little bit more of a traditional Chromebook than Google has made before. It doesn't have a big 3-by-2 screen. It doesn't flip around into a wacky little tablet. It's just a laptop. It has a 16-by-9, 1080p touchscreen by default. It has 8th Gen Intel processors and their Y-Series processors, so it's not the latest stuff on the block. It's also about half an inch thick, so this actually isn't the thinnest Chromebook on the block, but Google says that it lasts about 12 hours on a battery in its battery test, and their battery test is actually not that far from real life, so I'm really excited to test that. Now, even if it doesn't live up to that claim, Google says that it supports fast charging. Now, you might think the Pixelbook Go is plastic just looking at it or even feeling it, but it's not. It actually uses magnesium. Google says that magnesium has a better strength-to-body ratio than aluminum does, and that meant that they could use less material and make it lighter, so it only weighs about 2.3 pounds. It feels like it's plastic because they painted over that magnesium, so I'm really hoping that it won't chip off or anything. It comes in two colors. Just Black and Not Pink. So, the Pixelbook Go, it has a really simple design. I guess you could call it elegant, I don't know. It's built on, around the idea of having really soft curves, so you can see it on the radiuses of the corners, and when the thing is closed, they actually did a really good job of making the whole thing look like a, I don't know, like a big rectangular (laughing) lozenge. When you open it up and look inside, it looks like a Pixelbook. The bezels are on the screen. They're not too big. And the keyboard looks exactly like the last Pixelbook's keyboard, and man, you know, I got to tell you. That keyboard, it's really good. It's a little bit quieter than the last Pixelbook, which was already pretty quiet, and it feels great to type on. It's like, it's one of my favorite keyboards of the past couple of years. I really like it. If you look around the outside of the device, you'll see that there's two USB C ports, one on either side, so you can charge on either side, and they got little charging lights next to 'em. There is a headphone jack, hooray! But there is no micro-SD card slot for expanding storage, and that's kind of a bummer, actually, 'cause most of its competitors have one right now, and I don't know why they couldn't include it here. The other thing you won't find is a fingerprint sensor. If you want to log in to this thing, you got to type your password, which kind of sucks, but Google really wants to emphasize that it works with Android phones, so you could unlock with a fingerprint sensor on your Pixel or some other Android phone or the face on the Pixel 4, and that would also unlock the Chromebook, so I guess that's cool. The last thing I'll mention as long as I'm talking about security is it does have Google's Titan-C chip inside it. But I do have to bring up that the last Chrome OS device that Google made was this thing right here, the Pixel Slate, and it was a disaster. So, you might be a little bit worried about the Pixelbook Go, but I don't think you need to be because this is just a much less ambitious thing. They just made a laptop. The screen doesn't even go 360. And so, you know, we'll see if it's any good. The one thing I'll say is I'm really interested to review it and test it out compared to other Chromebooks because there are a ton of Chromebooks in, like, the 500-ish dollar range that this thing seems competitive with, so you might be paying a little bit more to get that Google logo on the back of the laptop. And actually, potentially you could be paying a lot more if you want to get something that has a little bit nicer specs. (rustling paper) Okay, so, it comes in four models. The base model is $649, and that has 8 gigs of RAM, only 64 gigs of storage, and an 8th Gen Intel M3 processor, which is fast but not super-fast, so a lot of people are gonna want to step up to the next one, which is $849. That's $200 bucks more. That gets you the same 8 gigs of RAM, 128 gigs of storage, and an I5 processor. There's a $999 tier for 16 gigs of RAM, 128 storage, and an I5 processor. I don't know why that one even exists, to be honest with you. And then the top tier, if you want to spend all the money, is $1400 bucks, and that's 16 gigs of RAM, 250 gigs of storage, a 4K screen, and an I7 processor. Oh, you know, one more thing about the Pixelbook Go, Google promises that they fixed the Bluetooth, which, I really hope that's true because on the original Pixelbook, the Bluetooth was hot garbage. And actually, speaking of the original Pixelbook, it's still available. If you don't want this really traditional laptop, and you want something with a full flippy screen, 3-by-2, you could still go buy that Pixelbook. If you want the Pixelbook Go, pre-orders for the black one start today. You can get on a waitlist for the Not Pink one or some of the higher spec models, and I expect the black one to start shipping in the next few weeks, and when it does, I'm gonna be really excited to review it and see how it compares to those other Chromebooks. (metal scraping) Hey everybody. Thanks so much for watching. Let me know what you think of the Pixelbook Go down in the comments, and of course, the big thing that Google announced at its hardware event was the Pixel 4 phone, and we've got a hands-on video with that, so you should check it out.",
    "transcript_keywords": [
        "Pixelbook",
        "Google",
        "thing",
        "gigs of RAM",
        "Chromebook",
        "original Pixelbook",
        "gigs",
        "bit",
        "RAM",
        "Pixel",
        "Pixelbook keyboard",
        "storage",
        "screen",
        "Gen Intel",
        "processor",
        "laptop",
        "big",
        "test",
        "Google made",
        "Gen Intel processors"
    ],
    "transcript_entity_values": [
        "the Pixelbook Go",
        "Pixelbook",
        "Android",
        "one",
        "the next few weeks",
        "16-by-9",
        "four",
        "849",
        "999",
        "128",
        "Chromebook",
        "Titan-C",
        "about 12 hours",
        "I7",
        "today",
        "650",
        "Google",
        "8",
        "$1400 bucks",
        "Chromebooks",
        "3",
        "about half an inch",
        "$200 bucks",
        "two",
        "The Pixelbook Go",
        "jack",
        "8th",
        "250",
        "the past couple of years",
        "1,000",
        "about 2.3 pounds",
        "Chrome",
        "Gen Intel",
        "649",
        "4",
        "Gen Intel M3",
        "the Pixelbook Go",
        "USB C",
        "Bluetooth",
        "first",
        "Pixelbook",
        "the Pixel Slate",
        "500-ish dollar",
        "RAM",
        "16",
        "a ton"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY"
    ]
}