{
    "id": "bw2UNs8rNUE",
    "title": "20 Holiday Tech Deals - 2016 Gift Guide",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2016-11-29T05:26:48Z",
    "video_url": "https://www.youtube.com/watch?v=bw2UNs8rNUE",
    "category": "Science & Technology",
    "tags": [
        "Cyber Monday",
        "Cyber Monday Tech",
        "Cyber Monday Deals",
        "Cyber Monday 2016",
        "Cyber Monday Tech Deals",
        "Cyber Monday Haul",
        "black friday",
        "deals",
        "black friday deals",
        "cyber monday",
        "best tech deals",
        "best holiday tech deals 2016",
        "best cyber monday tech 2016",
        "best cyber monday tech deals 2016",
        "best buy",
        "amazon",
        "best cyber monday deals",
        "amazon cyber monday",
        "amazon deals",
        "best black friday deals"
    ],
    "views": 422455,
    "likes": 39656,
    "comments_count": 2713,
    "description": "20 Holiday Tech Deals - 2016 Gift Guide  The 5K MacBook Pro Surprise  Check out Braintree -  Subscribe!   Xbox One S Battlefield 1 Bundle - $212   Xbox One 1TB Battlefield 1 Edition - $254.99   PS4 Slim Uncharted Bundle - $212   Xbox One Wireless White Controller - $39.99   Battlefield 1 Digital Code - $44   Gears of War 4 Digital Code - $35   HP 22es 21.5 Monitor -$59.99 @Bestbuy  HP 22er @Amazon -  7 Amazon Fire Tablet - $33   JBL Flip 3 - $20 off   Samsung EVO 500GB SSD   Dell SE2416HX 23 Monitor - $99    200GB Sandisk MicroSD Card - $50    Poweradd 20,000 man External Battery - $21   Microsoft Surface Book - $250 off   Sony Extra Bass XB950 - $88   Sony MDR1000X - $50 off   JBL Everest 700 $100 off   12 Space Gray MacBook - $200 off   2016 MacBook Pro 13 w/out Touch Bar - $100 off   Moto Z Unlocked - $499   Blue Snowball Ice - $39   Circle LED light - $35    Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=ko5P8BIvD40",
        "http://www.braintreepayments.com/techfast",
        "http://www.youtube.com/tld",
        "http://amzn.to/2gyHyPq",
        "http://amzn.to/2fXnpiw",
        "http://amzn.to/2gzQ0ud",
        "http://amzn.to/2gbm3U8",
        "http://amzn.to/2gblNEE",
        "http://amzn.to/2gbiSvF",
        "http://www.bestbuy.com/site/hp-22es-21-5-ips-led-hd-monitor-natural-silver/5588520.p?skuId=5588520",
        "http://amzn.to/2gaPXbi",
        "http://amzn.to/2gyGDi3",
        "http://amzn.to/2fEXScE",
        "http://amzn.to/2gzVRzk",
        "http://amzn.to/2gzQyzY",
        "http://amzn.to/2gotllj",
        "http://amzn.to/2gA1UEj",
        "http://amzn.to/2gzVvsK",
        "http://amzn.to/2gOInE6",
        "http://amzn.to/2gaTmqB",
        "http://www.bestbuy.com/site/jbl-everest-700-over-the-ear-wireless-headphones-titanium/5624068.p?skuId=5624068",
        "http://amzn.to/2fEHnxe",
        "http://amzn.to/2fvKhJA",
        "http://amzn.to/2fEI4qr",
        "http://amzn.to/2gOX4XM",
        "http://amzn.to/2gOQIrp",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here. For Black Friday, I covered 10 deals that didn't suck, but for Cyber Monday we are stepping it up. So here are 20 deals you may have missed. First up is the 500 gigabyte XBox One S Battlefield 1 Bundle, which is on sale for a crazy cheap $212 bucks. Now, most of these deals are going to continue on through Cyber Monday week, but I have a feeling this one is gonna expire pretty quickly, so if you're looking at this, you may want to jump on it quickly. So, I actually impulsively bought one of these bundles because I thought it would be cool to give away to you guys, so for a chance to win, go to hit that subscribe button, maybe drop a like if you are feeling like being awesome. Now, if you're someone out there who needs more gigabytes because 500 just isn't enough, there's also the one terabyte Battlefield Edition, which is on sale for $254 bucks, not much more than the 500 gigabyte bundle. The pro, or maybe the con to this deal, is that it's a completely different looking console. I personally like the looks of the white Xbox One S, but if you dig the Battlefield one, then it is a fantastic deal. On the flipside, maybe you're not into Xbox, maybe PS4 is your thing. There is also a PS4 Slim Uncharted Bundle for $212 bucks. From there, the gaming deals don't stop, though, there are so many, in fact, I'm gonna pass it off to Ralphy C to finish these up. - PS4 Pro, $399, with Infinite Warfare Legacy Edition only today! Black Friday, Black Monday. Cyber Monday? Cyber Friday. - [Jonathon] That's not on my list. - Do you like World War One soldiers? Do you like war? Battlefield 1 digital code is $44 bucks, so you're saving at least $20 bucks that you can spend on any little brother, for maybe Mario Kart or something. Mario Kart's not on sale. Now, continuing on the 50 train, you can buy Gears of War 4 for only $35 dollars a digital code, so you can enjoy all the blood, all the gore, all the chainsaws, all kinds of blood! Now, next we got $20 dollars off an Xbox One controller for little Timmy, so that you can't give him the crappy one that's back there, or something, where is it? - [Jonathon] What would you do with $20 bucks? - $20 bucks, I'd go to Speed Zone, man! (laughs) Speed Zone... Have you been to Slick Tracks, man? That track sucks! You slippin' and sliding everywhere. - [Jonathon] Get out. - (laughs) - So, next up is one of the cheapest prices I've seen on a monitor, the 21 1/2 inch 1920 by 1080 silver beauty from HP, which is $59.99. That is so cheap, you can rock some double monitor action for a buck 20, or go big with three displays, Taran style for under $200 bucks, man! Following that is the seven inch Amazon Fire Tablet, which is on sale for $33 bucks. You are not gonna get much cheaper than $33 bucks unless you go the Digiland route. No disrespect, Digiland, to you and your superior tablets, but this is a pretty sweet deal. So with the year coming to an end, and 2017 quickly approaching, if you are still on a mechanical drive, it is time to upgrade. Luckily for you, though, the Samsung Evo 500 gigabyte SSD is on sale for $129.99, which is crazy to think how much prices have dropped in just a few years. 500 gigabyte SSDs used to be four or five hundred bucks a couple years ago. So the fact that they are this cheap and accessible now is awesome, and trust me, if you have yet to upgrade, this is one of the best things you can do to your computer. Following that, got one more monitor deal for you. The Dell SE2416HX, which has a super long name with a super small price. This is a 23 inch monitor, which is currently on sale for $99 bucks. Personally, I've always been a fan of Dell monitors. So, maybe if you're looking to upgrade to something bigger, or maybe to add it to a laptop, this is a really good choice to look at. Next is a 200 gigabyte microSD card from SanDisk, which is on sale for $49 bucks, perfect for anyone looking to add some storage to their phone. After that is a 20,000 milliamp power external battery, which is a crazy cheap $21 bucks. And this time around, for Cyber Monday, we got a little Microsoft love with the Microsoft Surface Book, coming in at $250 bucks off. Next up, we have some pretty sweet headphone deals. The Sony Extra Bass XB950s are on sale for $88 bucks, which is a steal. On the higher end of the spectrum, the Sony MDR1000X, to which are some of the best headphones I've ever used are $50 bucks off right now. Alternatively, the JBL Everest 700s are $100 bucks off right now, which bring them down to $100. I am personally a little bit of a Sony fanboy when it comes to headphones, but the JBLs are really excellent as well. Jumpin' over to some MacBook love, there is $200 bucks off the Space Gray 12 inch MacBook, details on the configuration are linked down below. Also, just like we saw for Black Friday, the $100 dollar discount on the 13 inch MacBook Pro without Touch Bar is back. These, much like the Xbox deals, I think are gonna go quickly, so if you're looking at them, jump on them quickly. Jumping down the list, there is an unlocked Moto Z for $499.99, and I know for a fact that deal ends today. Anyone looking for an inexpensive USB microphone, the Blue Snowball Ice is on sale for $39 bucks. And lastly, for those asking about the circle LED light behind me, that is currently in stock and on sale for $35 bucks right now. Again, these prices may change, they may sell out, they may fluctuate, so don't yell at me if that happens. Links to everything we talked about, including some bonus deals, are down below. Hopefully you guys enjoyed the video. If you did, you are feeling like being awesome, and you want to win that Xbox One S, make sure to smash that like button. And lastly, before I hop outta here, huge shoutout to BrainTree Payments for sponsoring today's video and making awesome giveaways like this Xbox possible. Braintree is code for easy mobile payments, so whether it's the next Bitcoin, the next Apple Pay, it doesn't matter. Braintree's payment platform is chameleon-like and can adapt to whatever the future holds. You can accept everything from pounds to PayPal on any device with one integration. And just in case that new payment method does come out, all you gotta do is update a few lines of code. No late nights, no complicated recoding, no stress. To learn more, check out BraintreePayments.com/techfast.",
    "transcript_keywords": [
        "bucks",
        "Cyber Monday",
        "Black Friday",
        "sale",
        "XBox",
        "Monday",
        "deals",
        "Cyber",
        "Jonathan",
        "Friday",
        "Battlefield",
        "Black",
        "deal",
        "Slim Uncharted Bundle",
        "Black Monday",
        "Cyber Friday",
        "Cyber Monday week",
        "gigabyte",
        "Bundle",
        "inch"
    ],
    "transcript_entity_values": [
        "the Blue Snowball Ice",
        "$250 bucks",
        "only $35 dollars",
        "XBox",
        "Slick Tracks",
        "at least $20 bucks",
        "Black Friday",
        "- PS4 Pro",
        "59.99",
        "Mario Kart's",
        "just a few years",
        "Xbox One",
        "100",
        "three",
        "$200 bucks",
        "one",
        "1080",
        "SSD",
        "Taran",
        "200 gigabyte",
        "a couple years ago",
        "Jonathan",
        "Monday week",
        "13 inch",
        "Jumpin",
        "$50 bucks",
        "HP",
        "Digiland",
        "$35 bucks",
        "Black Monday",
        "Amazon Fire Tablet",
        "Bitcoin",
        "seven inch",
        "$88 bucks",
        "four",
        "five hundred bucks",
        "microSD",
        "$212 bucks",
        "The Sony Extra Bass XB950s",
        "50",
        "Monday",
        "$100 dollar",
        "Digiland",
        "Slim Uncharted Bundle",
        "First",
        "12",
        "MacBook Pro",
        "1920",
        "the JBL Everest 700s",
        "Sony",
        "World War One",
        "$33 bucks",
        "Cyber",
        "gore",
        "the Microsoft Surface Book",
        "Ralphy C",
        "War 4",
        "Moto Z",
        "10",
        "23 inch",
        "USB",
        "500 gigabyte",
        "$20 dollars",
        "PayPal",
        "under $200 bucks",
        "129.99",
        "$39 bucks",
        "212",
        "PS4",
        "$99 bucks",
        "$20 bucks",
        "Samsung",
        "21 1/2 inch",
        "20",
        "SanDisk",
        "500",
        "Xbox One S",
        "2017",
        "One",
        "Infinite Warfare Legacy Edition",
        "Xbox",
        "the year coming",
        "Timmy",
        "Dell",
        "20",
        "Braintree",
        "MacBook",
        "$49 bucks",
        "$100 bucks",
        "Battlefield Edition",
        "Mario Kart",
        "$254 bucks",
        "20,000",
        "Friday",
        "499.99",
        "today",
        "$44 bucks",
        "Next",
        "Microsoft",
        "399",
        "MacBook"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "EVENT",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "EVENT",
        "ORG",
        "NORP",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "EVENT",
        "MONEY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "FAC"
    ]
}