{
    "id": "BWX_myBQllI",
    "title": "NEW Google Pixel 8 phone - FIRST LOOK!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-10-04T16:35:08Z",
    "video_url": "https://www.youtube.com/watch?v=BWX_myBQllI",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 156640,
    "likes": 4673,
    "comments_count": 328,
    "description": "#ad For my US viewers, the first 100 purchases to use code JustineJenna at checkout on Google Store will get $50 off the Pixel 8, Pixel 8 pro OR the Pixel Watch 2. All the products I mentioned can be shopped from this video. Click the shopping button on the bottom of the video to get started.    *Promotional code offer is provided by Google LLC or its affiliates for use on Google Store only, and subject to the following terms. To redeem your promo code, visit store.google.com, while signed-in to your Google Account, and add the desired item(s) to your cart, enter the promo code during checkout to receive $50 discount for purchase of Google Pixel 8 (Unlocked or Google Fi variants), Google Pixel 8 Pro (Unlocked or Google Fi variants) or Google Pixel Watch 2 on Google Store. $50 off will be applied at checkout. Limit 1 per customer. Promo code must be redeemed by 10/26/23 at 11:59pm PT or it will expire. Promo codes may be redeemed only for eligible items as allowed by applicable laws. See Google Store Promotion Terms for more information ( All promotions in this video, including Pixel 8, Pixel 8 Pro, and Google Pixel Watch 2 bundle offers, are available only to US residents with US shipping addresses. Must be age 18 or older. Purchase must be made on Google Store US. Must be signed-in to your Google account and checkout with Google Pay profile, using a valid form of payment to redeem the code. Promotions available while supplies last and subject to availability. Offer void if selected Pixel device is returned. Void where prohibited.   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:",
    "description_links": [
        "https://store.google.com/terms/google_store_promo_codes).",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain"
    ],
    "transcript": "(upbeat joyful music) - Hey guys, it's Justine, and I am super hyped to show you the first look with the new Google Pixel 8 and Google Pixel 8 Pro phones. Thanks to Google for sponsoring this video. Now, I can't quite turn these on just yet, and show you all of the details, but please be patient and look for that review very, very soon. If you are interested in purchasing one of these new devices you could actually shop them right here from this video which is pretty awesome. Now I do already have them unboxed so just take a little look at how beautiful these colors are and I'm always such a huge fan of the Pixel camera bump design, like I just feel like this strip kind of ties everything all in together. And anytime I see them, they just look so sleek and I love this new blue color. This is the new Pixel 8 Pro. Oh, so nice. So let's dive in and learn a little bit more about each one of these new phones. Now the Pixel 8 Pro has a triple rear camera with a 5x telephoto lens, a 6.7 inch display that adjusts between 1 and 120 hertz, and an average battery life of 31 hours. This is probably one of the most surprising things. It has a thermometer. You can use this to quickly get a temperature of objects just by scanning them. Now the price is starting at 999 and it comes in bay, porcelain and obsidian colors. Now as a content creator, I am always so excited to test out these cameras on all of these new phones and with new improved low light photos, front facing cameras for selfies and Zoom, the new video Boost technology will let us shoot an HDR plus with enhanced color grading for more pro Video. Night Sight will allow us to also shoot better photos and videos at night, which I love taking night photos, so I can't wait to test that out. They also have some new features like the Magic Editor, Best Take and the Audio Magic Eraser to improve all of our content that we create. The thing I love so much about Pixel phones is they have all these hidden little features. Because it is Google, they have the ability to really harness the entire ecosystem that is Google and put that into a device. The thing that I'm really excited to test out is this Audio Magic Eraser because I feel like in the past we've been able to remove things from photos and videos, but now being able to remove things from audio and calling it the Audio Magic Eraser is kind of cute. Like I'm into that. So this is the Pixel 8 Pro in the bay color, and man, I'm obsessed with this color like it actually matches my sweatshirt quite well. It just looks so good. It also has kind of like a matte finish on the back, whereas the Pixel 8 has more of a glossy finish. So now moving on to the Pixel 8. This has upgraded rear cameras, powerful security, and an all day battery life with a new Google Tensor G3. It has a 6.2 inch display with an improved 120 hertz refresh rate, and with also up to 31 hours of battery life. Now pricing for this starts at 699 and comes in hazel, rose and obsidian. The new upgraded camera has advanced image processing for more colors and details, and I love that it now has a macro focus. And using Best Take, you can combine multiple photos of people in a group and choose to edit a person from another photo like in case they have their eyes closed. Or much like my other sister who never likes any photos that we take and we have to take a million of them. This way we don't have to take as many 'cause she can just pick her favorite shot out of the group photo and we're like, \"Cool, replace.\" Actually is magic. Now both phones have a really sleek design with dust and water protection up to IP68. With the new Google Tensor G3, this is the pixel's most powerful chip that allows you to bring the latest in Google AI and machine learning to these new phones. Now, like I said, there is this new Magic Audio Eraser that lets you erase distracting sounds from video and that again is using AI and the power of the new Google Tensor chip. Now, like I said if you are interested in getting these devices, you can shop it directly here from this video which is pretty awesome with YouTube Shopping. My sister and I are also gonna be doing a live stream to celebrate the launch of these phones on October 11th. So stay tuned for all of the information, I'll be scheduling here on my channel so you'll have all of the details and you can sign up ahead of time so that you can watch it when we're actually live. It's gonna be so much fun and I can't wait to test these out. If there's anything else that you'd like to know about either device or you'd like to see me test out in my review, please share them in the comments below. I can't wait to hear from you guys, and I look forward to shopping with you on our live stream. I'll see you guys then. Bye.",
    "transcript_keywords": [
        "Audio Magic Eraser",
        "Pixel",
        "Google",
        "Google Pixel",
        "Google Tensor",
        "Magic Eraser",
        "Audio Magic",
        "Magic Audio Eraser",
        "Magic",
        "Pro",
        "super hyped",
        "video",
        "phones",
        "Audio",
        "Justine",
        "photos",
        "Eraser",
        "test",
        "Google Tensor chip",
        "Magic Audio"
    ],
    "transcript_entity_values": [
        "Zoom",
        "between 1",
        "Google Tensor",
        "Google Pixel 8",
        "Justine",
        "October 11th",
        "YouTube Shopping",
        "5x",
        "Google Tensor G3",
        "Google Pixel 8 Pro",
        "Google",
        "a million",
        "the Pixel 8 Pro",
        "Pixel 8 Pro",
        "699",
        "night",
        "999",
        "Best Take",
        "up to 31 hours",
        "6.2 inch",
        "hazel",
        "6.7 inch",
        "AI",
        "first",
        "31 hours",
        "Magic Audio Eraser",
        "120",
        "Google AI",
        "120 hertz"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY"
    ]
}