{
    "id": "BxiNEX7SfNw",
    "title": "Galaxy Fold Unboxing: Welcome (Back) To The Future",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-09-24T10:00:35Z",
    "video_url": "https://www.youtube.com/watch?v=BxiNEX7SfNw",
    "category": "Science & Technology",
    "tags": [
        "galaxy fold review",
        "galaxy fold unboxing",
        "galaxy fold redesign",
        "galaxy fold fix",
        "folding phone",
        "folding phone 2019",
        "samsung fold",
        "galaxy fold 2",
        "mrmobile",
        "android central",
        "michael fisher"
    ],
    "views": 245163,
    "likes": 10977,
    "comments_count": 742,
    "description": "Sponsored by dbrand. Get your Galaxy Fold skins here:    [SAMSUNG GALAXY FOLD UNBOXING]  The first foldable smartphone is here  again  and you can officially buy it this Friday  again. In this video, I'll break open the box to show you what youll get if you do drop $1980 on the redesigned Samsung Galaxy Fold, and I'll take you through my initial setup to show you why Im so excited to move back into it!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SAMSUNG GALAXY FOLD UNBOXING]  MrMobile's Samsung Galaxy Fold Unboxing was produced following one day with a Samsung Galaxy Fold review sample following a Samsung press event in New York City. The device is a retail-ready unit using Samsung's new design meant to ameliorate the issues that caused the Galaxy Fold launch delay in Spring 2019. MrMobile does not produce paid or sponsored reviews; Samsung was not offered copy approval and no compensation was requested or provided in exchange for this coverage.    [LINKS]  Galaxy Fold Durability Test [JerryRigEverything]:   FPSRussia: AR500 Body Armor Test!   Foxtrot Alpha: Life Of A Fighter Pilot - An F-16 Falcon Fighter Pilot Documentary    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links, which afford Mobile Nations a commission if you make a purchase. See Mobile Nations' disclosure policy for more details:   #galaxyfold #foldingphone #samsunggalaxyfold #samsung #galaxyfold2 #smartphones #tech",
    "description_links": [
        "http://dbrand.com/samsung",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.youtube.com/watch?v=tZBk_Hb-X0w",
        "https://youtu.be/nlwlKEeJ0vU",
        "https://youtu.be/4PxnUt2yaPA",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links"
    ],
    "transcript": "- The first foldable smartphone is here, again, and you can officially buy it this Friday, again. Here's what you'll get if you do. And here is why I'm so excited to welcome it back, into the fold. (upbeat music) And folks you know, I don't normally do unboxings but this debut is different. As a quick refresher, Samsung rolled out the galaxy fold back in the spring, but it wasn't ready for prime time with design flaws that made it too fragile to survive a normal day. I covered those shortfalls along with the design changes Samsung made to address them in a video earlier this month. And now I've got my very own retail review device to borrow. Samsung says it wanted to elevate the ownership experience for fold customers, and when we pull away the box within a box that actually contains the phone, we see the first evidence of that. It's a welcome letter, hardly unique to Samsung, OnePlus has been doing this for a few years to make people feel like they're joining an exclusive club. You know, rather than just buying a phone. So I'm more interested in the insert beneath that. This is a list of perks you get when you do drop that money on a fold. Number one, a dedicated support hotline. It's open 24 seven for your questions or troubleshooting. Apparently you'll be able to call by voice or video chat, even schedule an in person meeting, if you want a Samsung rep to physically walk you through the device. Below that, is an offer for a onetime screen replacement to quote, \"give you peace of mind\". Yeah, that piece is gonna be hard to come by if you've seen the Jerry rig everything video. If you haven't, suffice it to say that this display is the softest, most fragile on the market right now. So it makes sense that Samsung is offering a repair solution if something happens to it. Still, it's only good within one year of purchase and it costs $149 dollars, which doesn't bode well for peace of mind over the long term. To protect the outside, you do get a complimentary case for the fold. It's made of Aramid, the material that forms the basis of Nomex worn by fighter pilots, because of its flame-resistance. And Kevlar, which makes a Bulletproof vests. Should be a pretty solid case in other words. At the bottom of this treasure chest, a charger rated for a not very fast, quick charge 2.0 sorry folks, the 25 watt charger from the note 10 plus didn't make the jump. Then there's a USBC to a adapter and the crown jewel of the collection, a complimentary set of galaxy buds. These are a pretty solid set of wireless ear buds that usually go for $130 bucks, so nice. Coming to the phone itself, you cannot unwrap it without seeing these care instructions and that's good cause there's a lot of them. You're not allowed to press hard on the display. Even with your fingernail. Use any objects to touch the screen, put any stickers or screen protectors on it and you should get the fold away from your credit cards because of the powerful magnets that keep it closed. Most important of all, the fold is by no means that Samsung's words dust or water resistant. So if you buy it, you'll want to mentally hop into the way back machine and treat it like you would have treated your smartphone from a decade ago. After you dropped the nearly two grand on this thing, you'll need to go buy a $30 dollar burner phone for the beach. Picking up the redesign fold, I get the same feel I reported from Berlin. A little more solid on the hinge feel and locking open a bit more firmly. I don't have to do away with the visible crease in the screen, unfortunately, but it kind of fades away when the screen is on. And frankly, I'm too distracted by my joy at being back on a foldable phone. That's kind of a misnomer, people before me have said, this is really more like a foldable Tablet and the first few things I find myself wanting to do again, bare that out. I lost my Kindle Oasis a while back and I've been without an E-reader since. Well, the fold is the perfect size to take its place. So I eagerly re-sync my Amazon account, dive back into Calvin and Hobbes and Richard Russo. The second thing I do is lament the loss of those custom colors I loved so much, which were cut from the assembly lines in an effort to streamline production. So I restore a little of that color by swapping out the Samsung keyboard for a custom G-board. It gives me a little eye candy and space for my thumbs to spread out, which I like. My third task is to round up the truly colossal amount of bloatware on this thing, and though the fold doesn't have a recycle bin, I give it the next best thing. Obviously this isn't the unlocked model, it's the 18T variant and no carrier is better than Ma Belle at burying its customers under a prodigious mountain of unwanted junk. But I give 18T credit for agreeing to sell the fold in stores, unlike T-Mobile, which canceled after the whole debacle in the spring. This isn't a review, so I'll make this my final point. Being back on the fold is a constant reminder that you're on the bleeding edge. That means bad things as well as good dealing with wonky apps that reset when you switch between screens or the phone forcing you into tablet mode to train the fingerprint sensor, which makes no sense. It means getting used to the leaden weight of this ponderous brick when it drops into your pocket. And then the anxiety when you pull it back out and wonder if your pocket lint is gonna find its way in there to kill the display somehow. And yes, you still have to deal with an external screen. Not much bigger than the Palm phone. But this is still the first day, so each time I pop it open, it all becomes worth it. Reading a book, taking notes, playing a game, watching a YouTube video, BT dubs please like and subscribe. It's like having a tablet that fits in your pocket. Remember how for years some of us begged Google to build multi window app support into Android. And when we finally got it, we never used it because the screens just weren't big enough. Well this one is, and big enough to run three apps at a time in fact. Add in the fact that the phone is its own tripod, handy for me and has tremendous battery life handy for everyone. And I continue to feel that life on a folding phone is just beginning to reveal its advantages. I'm gonna take my time exploring that life and deliver my review down the road folks. In the meantime I'm gonna document the day to day with the fold over at my Instagram account. Join in over there or on Twitter. Ask me of anything you wanna know about the galaxy fold. And if you are gonna buy one of these, and you miss the fun colors, as much as I, do what I do. And dbrand it. drand sponsored this video, and with premium vinyl skins in so many textures and colors offered at a fair price. dbrand is the best way to customize your galaxy fold while also protecting it. Hit the link in the description below. This unboxing made possible by a galaxy fold review sample provided by Samsung, but I don't do paid reviews. The company provided no compensation in exchange for producing this video, and Samsung was also not offered copy approval. That means they're seeing this for the first time, right along with you. Please subscribe to the Mr mobile on YouTube if that's the kind of video you'd like to see more of. Until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "fold",
        "Samsung",
        "galaxy fold",
        "phone",
        "back",
        "video",
        "screen",
        "Friday",
        "galaxy fold back",
        "time",
        "Samsung made",
        "galaxy fold review",
        "galaxy",
        "fold back",
        "thing",
        "made",
        "officially buy",
        "review",
        "buy",
        "feel"
    ],
    "transcript_entity_values": [
        "Kevlar",
        "third",
        "Tablet",
        "$149 dollars",
        "Instagram",
        "Calvin",
        "nearly two",
        "Samsung",
        "Berlin",
        "T-Mobile",
        "the first day",
        "Richard Russo",
        "USBC",
        "$130 bucks",
        "YouTube",
        "2.0",
        "three",
        "10",
        "25 watt",
        "OnePlus",
        "Ma Belle",
        "first",
        "Kindle Oasis",
        "18",
        "$30 dollar",
        "Google",
        "a decade ago",
        "years",
        "a few years",
        "Hobbes",
        "Nomex",
        "second",
        "the spring",
        "24 seven",
        "one year",
        "Friday",
        "Aramid",
        "Twitter",
        "Palm",
        "Android",
        "Amazon",
        "earlier this month",
        "the day to day"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORDINAL",
        "LOC",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE"
    ]
}