{
    "id": "BXMBvKPRsEo",
    "title": "Lenovo ThinkPad P1 Review",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-10-02T19:47:12Z",
    "video_url": "https://www.youtube.com/watch?v=BXMBvKPRsEo",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Lenovo",
        "P1",
        "Thinkpad",
        "XPS15",
        "macbook",
        "apple",
        "aero15x",
        "gigabyte",
        "workstation",
        "best laptop for work",
        "best workstation",
        "best laptop for CPU",
        "best CPU",
        "Xeon",
        "E-2176M",
        "core i9",
        "core i7",
        "i7-8750H",
        "i9-8950HK"
    ],
    "views": 1180699,
    "likes": 23825,
    "comments_count": 1791,
    "description": "Dave2D review of Lenovo's Thinkpad P1- the thinnest and lightest workstation laptop they make. ThinkPad P1 -   Music Credits: Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: Fili - The Break  Desktop Wallpaper from Stephanie Stutz -   If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2QpUK7p",
        "https://www.artstation.com/stephaniestutz",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey how's it going? Dave2D here This is Lenovo's Thinkpad P1. This is a workstation laptop that's geared for professional use. You can play games on it obviously because it's got a respectful graphics card but it's not geared for gaming in particular. So this device is a thin and light workstation. It's built around portability and I think it looks really good. It's covered in this soft touch material. Now normally soft touch materials on laptops aren't my thing. Normally they just degrade over time. I find that alot of the laptops that are covered in the traditional soft touch material just become gunky after a year or two. This material feels a little bit different It doesn't show fingerprints readily and from my experience with the soft-touch materials from lenovo this stuff lasts a very long time. It's very durable finish. Even a year or two later it looks pretty much brand new. The ports on this device are good. There's a bunch of USB-A, there's 2 thunderbolt 3's on the left and there's also an SD card slot on the right.",
    "transcript_keywords": [
        "Lenovo Thinkpad",
        "soft touch material",
        "soft touch",
        "touch material",
        "material",
        "touch",
        "soft",
        "Hey",
        "Thinkpad",
        "Lenovo",
        "geared",
        "materials",
        "workstation",
        "laptops",
        "good",
        "time",
        "year",
        "covered",
        "device",
        "card"
    ],
    "transcript_entity_values": [
        "2",
        "USB",
        "SD",
        "a year",
        "lenovo",
        "Thinkpad",
        "Lenovo",
        "two",
        "year",
        "3"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}