{
    "id": "bxya-divayE",
    "title": "I Made a Mistake... - ASUS OLED PG42UQ",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-09-18T16:55:28Z",
    "video_url": "https://www.youtube.com/watch?v=bxya-divayE",
    "category": "Science & Technology",
    "tags": [
        "ASUS",
        "ROG",
        "ASUS ROG",
        "ROG Swift",
        "Monitor",
        "Chungus",
        "Desk Setup",
        "ASUS Monitor",
        "azus",
        "LG C2",
        "Linus Sebastian"
    ],
    "views": 1852004,
    "likes": 61443,
    "comments_count": 2964,
    "description": "Thanks to ASUS for sponsoring today's video! Check out ASUS ROG OLED Gaming Monitors here:   Buy an Asus PG42UQ 41.5\" Monitor:  Buy an Asus PG48UQ 48\" Monitor:   The 42\" C2 that Linus JUST installed is great, but it's not a monitor. ASUS has released their PG42UQ based on the same panel, but now with less annoying ABL and proper wake-up functionality. Despite the great display, some things don't quite go according to plan...  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:49 What annoyed me the most 2:47 \"Following Instructions\" 4:40 Plouffe is helping 7:10 The peel 8:20 GASP \"oh no\" 10:39 Settings and Features 12:55 Plouffe ACTUALLY helps 14:24 KVM problems 16:23 Wendell (MVP) 18:35 One last idea 20:20 Let's play a video game 22:42 Linus drops something 23:13 Outro",
    "description_links": [
        "https://bit.ly/3QQ5omI",
        "https://geni.us/6iSnql",
        "https://geni.us/cxq4w",
        "https://linustechtips.com/topic/1455992-i-made-a-mistake-sponsored/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I just upgraded my home gaming setup to LG's 42-inch C2 and something about it. It finally went well, what the hell? I have it set to one minute, this is what I'm talking about. I just upgraded my home gaming setup to LG's 42-inch C2 and some things about it are great. Basically, zero motion blur in key OLED blacks and the size is perfect. But, using a TV as your monitor is less perfect. Thankfully, ASUS ROG who sponsored this video has the solution. This PG42UQ they sent over has all the same benefits of my existing display, but none of the drawbacks of using a TV. It's got display port 1.4 alongside its HDMI 2.1 connection. I no longer need a companion app. So my display will go to sleep and wake up alongside my system. And best of all, I can disable that accursed auto dimming function for a much more consistent experience. To say, I can't wait, would be an understatement. On paper, it's basically the perfect gaming display, but just 'cause it's sponsored, doesn't mean I'm not gonna tell you guys if I don't run into any problems. (upbeat electro music) Right out of the gate, massive shout-out the developer of LGTV companion because it's a lot better than not having it, but this was set to sleep after a minute. It has been like five minutes and it's not asleep. Also, there's no way to minimize it. So you just, I can just tuck it away. Also, you guys notice, right when I moved that box, the brightness changed dramatically. You can adjust that behavior with a special service remote in the hidden menu, but you can't disable it entirely. Probably the thing that's annoyed me the most though, aside from coming back to the office right after setting this one up and seeing the better solution sitting in our warehouse, is that I have been stuck at 60 hertz because my computer is so far away that I need an active optical cable in order to get a signal to it. And while there are HDMI 2.1 active cables available, woo. In my case, the cable is so costly, that since I already own a long display port anyway, even if the monitor version is a little more expensive, it's a better bet. ASUS sent over not one but three of these, which means that with some help from these little doodads, which let you extend a USB connection over standard ethernet cabling, I will be able to show you guys the final form of my centralized gaming system. Where it shouldn't matter, if I sit down at it here, sit down at it downstairs, the experience should be identical, no additional latency. - [Plouffe] I can help you lift it when it gets to that- I know it's super basic. - Yeah, why do I need to follow the instructions? - Geoff just told me that we've gotta do this alright? And it's sponsored, so I'm trying to make sure we do it. - No, I open boxes how I please. - [Plouffe] Oh my God. Oh my God. - All right, there's a stand. - [Plouffe] Yep. Nice. - Ooh, accessory pouch. - [Plouffe] Yeah, I actually really like that. - Complete with color calibration report. Oh my goodness. Their calibration report comes in a little sleeve. Ooh. Power. Display port. HDMI. USB. - [David] It's really weird. The instructions said specifically throw cables over your left shoulder. - [Plouffe] Yeah. - Did they really? - [Plouffe] Yeah. - Did they? (laughing) - [Linus] Remote. This is pretty handy. I mean, it's nice to be able to turn it off and on remotely, change sources, all that kind of good stuff. What else we got going here? Okay Plouffe, do you wanna grab an edge? - [Plouffe] Okay, I'll grab the other side. - Okay, according to the instructions. Okay, David frame them out. - [David] You're not here, you're not here! - Okay. Okay. With a helper. Place it down like that. That helper that definitely exists. There's a lot going on here. We've got vent holes up at the top. Is this a cooling fan? No. ASUS does advertise that it can be over clocked. So instead of just 4K120, it'll apparently do 4K138 hertz. But the cooling required to achieve that is all passive. So you don't have to worry about any additional noise. They also advertise 0.1 millisecond, greater gray pixel response times, out of box calibration, which I showed you already, as well as a whopping 98% coverage of the DCI-P3 color space. Pretty freaking impressive. Just like our screw driver, which is now available for order on lttstore.com, which happens to include the hex bit. We need to tighten up our monitor stand here. So you use the knurling for speed. Eh, then the handle for tightness. Love it! I could totally lift this myself, but ASUS insisted I have a helper, so I've got Plouffe here taking the other end. Thanks, Plouffe, that's really good. All right, oh, that's super handy. It's got a USB three port up at the top, along with one of these little threaded majigs so that you can put your camera or your webcam or anything else that has one of these. What are these 1/4 inch? Is that the one? - [David] Yeah, 1/4 inch. - 1/4 inch threaded posts on it. Love it. Oh, that's nice. I was leaning this. So David could get a B roll shot here. And it's actually got a little bit of tilt, which is something you won't normally find on a TV. In terms of IO, we've got, oh really? It's got the full compliment of HDMI ports, four of them, along with display port. And this is a pretty robust built in USB hub. It's got USB-3 in here and then 1, 2, 3. I thought I saw another one somewhere, I guess three is, oh yeah, there's another one down here. Four USB-3 ports. There's your headphone jack, power is here, Kensington here. And I'm assuming this is our GB. I guess we should plug it in and see it light up. One thing that's conspicuously absent is E Ark. So you're either gonna be using the onboard speakers or speakers that are hooked up through an AV receiver or similar. Now this is curious. There are a couple more threaded mounting holes here. Plouffe, do you have any idea what these are for? - [Plouffe] No, it does vesa 300 by 300. - Well, yeah, that's here. That's standard based amounting. - Yeah, I'm actually not sure. I never saw anything in any of the documentations. - Yeah, they're just labeled mounting port. Oh, that's cool though. - [Plouffe] Yeah. - If you didn't happen to have an LTT screw driver, it does include a little allen key for the stand. So that's neat. It uses a little center mounted nubbin nipple thing for control, so I think I just turned it on. The RGB is not on by default. - [Plouffe] I don't know. - ASUS ROG, who are you? It's got to be RGB. This is interesting. The HDMI one and two, are HDMI 2.1, three and four are 2.0. So that's good to know. Oh no, the power button is just to the right of the control nipple. Okay, got it. So did I turn it on this time? If I'm gonna fall off this desk? I think we all wanna see it on camera. - [David] Watch your back pocket cause you're with the side of the screwdriver. - [Plouffe] Oh my God. Yes. - Yeah. Yeah. Don't worry. I'm good. I'm good. I'm good. - [David] Do you wanna hand that to Plouffe? - Yeah, Plouffe. - Okay, yeah, there we go. Yeah, yeah. - [David] Why are you doing it like this? - So heavy. Oh wow. There we go, yeah. - Alright! Stand's a touch taller, but you know what? That's probably not a bad thing. It just means that I do need to move my camera a little bit. Apparently, it's got a nice anti-glare coating on it, which as long as it doesn't scatter the light too much, I'd say would be a boon. Oh wow, that is, that is quite monitor looking. I mean, you look at the like, David check out the lights I have behind me. I haven't adjusted these. I don't have any real diffusers on them or anything. That's pretty good hey. Before we update the firmware, let's just see if it's, you know, working at all. 4K120. Uh-oh. - [Plouffe] Hey! - Alright, cool. It works. Firmware update. Hey, there we go. While we wait for that, we're gonna head downstairs and roll this one out. Do you mind grabbing an end? - Yeah, here you go. - Awesome. Thank you. - No problem. - Good job. Whoa, ha. Stairs. Whoa. - Yeah, woo. - Yeah, you gotta keep up pretense. Don't you have an end of this? - You almost wait, here you go. Here you go. There. That's awesome. Yeah. So which station is yours? - This station is mine. And right now the only problem that I have is that if the kids have their friends over and their friends wanna play with them, I don't really want their friends poking around in my computer. So there'll be a separate machine for them to use. But for me, I don't want to have to reset up all my profiles and everything just because I'm downstairs. So the idea is I'm using this super cool high bandwidth display port KVM from Level One Techs to switch between those machines with a keyboard shortcut that my kids' friends are unlikely to figure out, but we had a problem. The shortcuts only work on the mouse and keyboard ports, and I only have one fiber optic connection over to that room. That's where those ethernet USB extenders come in. Is this even gonna fit here? - [Plouffe] It's gonna be really tight. - Okay, I didn't really think of that. - [Plouffe] Yeah, I noticed that. - What I considered is that it would be really nice to have matching displays. A, so that you don't have, you know, different scaling or like a different experience on both sides and B, because I didn't foresee this, but having two mismatch displays, even though both support high refresh rate has made it so that I can only get 60 hertz on both of them for now. Yeah, if you can grab of an end. - It's so hefty. - Oh, thank you. - Oh yeah, no problem. - Thanks. Okay. Alright. - Hey, it fits. - Does it fit? - Barely but I mean, it looks like it does actually pretty much. - Yeah we could, we could make that work. - Yeah. - That is a really, really big display to be on a desk this deep. I mean, I was using a 48 inch before this, so I think I'll probably be okay. - [Plouffe] If you're not, this comes in a 48. - I cannot believe how long you waited for Oh no. - [Plouffe] It's definitely we shouldn't have dragged it down the stairs. - [Linus] I don't think it's from that. - [Plouffe] No? You sure? - [Linus] Yeah. - [David] Scratch like that? - [Linus] It's an impact. It's right here. - Isn't there is, this is the one with the f*ked up box. - [Linus] Yeah. - [Plouffe] It came to us like this, like me and David did stack them in his car. - No that's an impact. - [Plouffe] Yeah, no, no, totally. I don't think it's from us either. - And that is why you always legitimately use two people to move things around. In all seriousness, based on how beat up this box is, we're fairly certain that this thing was damaged in shipping. - We probably made it worse. We didn't break it. - We definitely didn't help. - Let's say that. This is good news. I noticed almost immediately that it wasn't very bright, but, ah yes, we're in power limited mode. There we go and immediately that is way better. Before we dig around too much in the menu, I wanna show you the thing that is so annoying about using an OLED as a desktop monitor. You see how bright this is when I have this window just in the corner here. Watch as I drag it across the screen. - [David] Whoa. - Oh, that's actually not that bad. - [David] It's pretty noticeable though. - Is it noticeable to the camera? - [Plouffe] It's noticeable on camera. - [David] It's overexposed and then - Great, okay. So that's what happens. More annoyingly, TVs just randomly start doing it sometimes while you're sitting and reading a document. So, this because it's designed to be a monitor, has a feature called uniform brightness. You enable that and what happens is your maximum brightness goes way down, like somewhere on the order of around 230 minutes. I think, I guess? - [Plouffe] 250-280, I think. - 250-280. But it means that when you do this, you're not just gonna get those, those wild brightness swings is that it seems like it might still be a little bit? - [David] It's doing a little bit, it's doing a little bit. - Yeah, okay yeah. Not nearly as much. Okay, let's turn on over clocking. Nah dog, I'm going for it. 138, here we go. - [Plouffe] Might as well do 144, if you're already in the control panel. - Does it do 144? - [Plouffe] It doesn't, doesn't say it does. - It doesn't advertise it. No, no, we're gonna test 138. Only sanctioned over clocking here, alright? - [David] Hey. - Oh, this is interesting. One of the things our firmware update changed aside from making input switching a little bit faster, is their screen saving functionality to make it work more effectively in standby mode. - [Plouffe] You know how the ark could like change the screen size? - Yes. - [Plouffe] It can do that. - Oh, cool. Okay, aspect control. So if you wanna play 1 to 1 or 16 by 9 at a smaller screen size. So you wanna simulate what it's gonna be like in your at your tournament, right? When you're playing on a 24-inch display, you can set your monitor to be a 24-inch monitor. For those of you who are wondering, you're not stuck with your 24-inch monitor in the middle, you can actually shift it around. Either way it's nice to have the option. Just like you have the option of signing up for Floatplane, where we have amazing exclusives like, oh my God. All the outtakes from the screwdriver video. Yeah, I screwed up a lot. - [David] Was it driving you crazy? (laughing) - The monitor that was supposed to end up on my desk at work because 48 really is a little big kinda looking around like that a lot is now for the downstairs and we are going to for realsies, you got that side? - Yeah, I've got yes. - Carry it very carefully. - No, dragging it down the steps. - I would never, I would never do anything like that. To be clear, that was obviously not what destroyed the other one, but it didn't help. - No. David don't do that. - [Linus] What did he say? - [Plouffe] He said there's a big gash - [Linus] Oh stop. - Are you you're kidding, right? Oh my God, David. That's not funny. This is not right. This is supposed to just be the display upstairs cloned to this spot. But because we haven't set this up yet, it's not working. I have never used one of these before, but it looks super cool. It's only USB two. So, it's not particularly fast, but for something like a keyboard or mouse, it should be perfect. Probably just gonna mount this to the underside of the desk or something at some point, but we're not there yet. I swear, it's gonna be clear what's going on at some point here. I'm plugging USB for the keyboard and mouse into my KVM. So that that keyboard and mouse can be used with either of these machines. Then, I'm gonna take this network jack, that comes outta that USB adapter. I need a network cable. This one's pretty long. I have not organized my tech stuff yet. It's the one thing that is left to organize. Oh, you followed me. - [Plouffe] Yeah. - That was a lie. There are some more things other than tech things that are not yet organized. Come on, come on, come on, come on, come on. Yes! - [David] Is this going how you planned? - No, not at all. - [Plouffe] It's doing stuff! - [Linus] Okay, this is where things get spicy. - Oh, oh no, please not spicy. I just want it to work. - No, this mouse doesn't work. Kind of expected the mouse and keyboard to work. Maybe I just need, need to use a different port. Here we go. Okay, so PC two will be Yvonne's computer. PC one will be my computer. All right, we're good. Is it on? - [David] Yeah. - [Linus] No way. Okay. But the peripherals aren't working yet. Okay, I'm, Plouffe? - [Plouffe] Yeah? - I'm gonna have you be my hands. - [Linus] Okay go for it! - Nothing. - [Linus] Okay go for it. - Nothing. - And this is why I love these icron docks. They're super expensive. - [Plouffe] Like how much is that dock? - Oh, it's like $600. - [Plouffe] Holy sh**. - [Linus] But it works. - [Plouffe] What? - Okay. - [Plouffe] But this is just native. This isn't through the KVM number. - This is through the KVM. - Oh! - Yes. This is Wendell's big thing is his display port KVMs are like, full fat bandwidth. Come on Wendell, don't let me down. - I believe. - You know what? I bet the prompt is up on the other one. Oh, you might have to try again. I think I'm gonna miss it. - You ready? - [Linus] Yep. Nope. - [David] Nope. - [Linus] I've got one more idea. Wait. Yes! I'm now getting no output to either display. - [Plouffe] Oh my God. - I think they got mad because one was in over clock mode and one was not, which was exactly the problem I was having before with the mismatch displays. - [David] Oh. - Cause they actually report back to the system differently if they're in overclocked mode. Maybe if we get in touch with Wendell it's, oh wait, no. - [David] No it's 60, reverted. - How about a hundred. I'd settle for a hundred. Hundred's fine. - [Wendell] Whatever the fiber optic cable is outputting may not be high enough to get through all the connectors in the KVM plus the KVM plus the cable itself. It is like, I'm not just making shit up, it is crazy how much better their, cables are than everybody else's and when you get like the 25 foot club 3D cable, which is copper, not fiber, it's as thick as a garden hose, it's amazing. - Right, okay. We'll try that, thank you. - [Wendell] The keyboard shortcut also there are, there is a way to make it the right control key and some other different keys. It doesn't have to be scroll locked, but you might temporarily need a $5 keyboard that has scroll lock in order to use scroll lock to tell it which hotkey you want to use. - I might have just the thing here. Okay, it's not $5, but it has a scroll lock key. It would be really nice to know if that aspect of this works. Okay, scroll lock's not doing anything either. I plugged into the, wait. Oh no, I changed the KVM. Hold on. It might not be plugged into anything. Yeah, no, it's not plugged in. One sec, one sec. Okay, so the head port, I should use the front with the one on the front labeled HID - [Wendell] Yeah that's fine, there's 3 in the back as well. - Sure and those are all equally HID? - [Wendell] Yeah, well HID is the only one you can do the keyboard control on because the USB 3 is completely hands off. - Right. But all four of those HID ports are the same, right? - [Wendell] Yeah. So I am working on an HDMI extender that also runs over cat6 and it is glorious. - Working on you say, well, a fat lot of good that does me today, sir. - [Wendell] I can probably get you a prototype in like a few days. - No, it's okay, take your time. Okay, I think it's just this USB extender. I think it's just not working. It also could just be mislabeled. It's not the, wouldn't be the first time I saw that in this house. Is it possible that KVM doesn't have enough power for this bad boy? Cause it doesn't have external power on the transmitter side. - [Wendell] It's possible, but it would have to be using more than an amp. - Nothing is working. Instead of running through the network cable in the wall, we're just gonna run a cable. Okay. Hello? F***. Either the in wall cable is bad or it's mislabeled. I've got an update for you. As it turns out the USB 2 HID ports on the KVM, they're not quite full USB 2 they're tailored for HID (human interface devices). What that means is sometimes, especially if you have like a hub, especially with a Mac, you can get odd behavior with these extensions. So what I need to do is either get a different extension, send one of these over to Wendell. Maybe he can test it, fix it. The point is scroll, lock, scroll, lock, source switching is not gonna be working today, but, damn it I haven't given up yet on 120 hertz. We have an idea also to do with using the KVM and some funkery that Wendell had to do to make G sync and free sync work. It's particularly sensitive to long runs. And we have an extremely long run here. And the more couplers we have in line, the more signal loss, he says, each one of these connections is probably costing us about three DB. So what we're gonna do is we're just gonna run a little brush plate and we're gonna take our optical cable and we're gonna run that bad boy straight into the back of the monitor, Plouffe. - [Plouffe] Yeah? - A hand if you will. - [Plouffe] Yeah, what do you want? Put this? - [Linus] I want that in the thing. - [Plouffe] Aye 120! - No, no, no, no. That's just day one. Good try though. Come on. Come on. Crap. Crap. Come on. That was our big idea. Screw it, no KVM for now. The kids' friends can have no computer. Dammit I'm going straight into the back of the computer. If this doesn't run 120 hertz, I give up. We're going straight in. Are you kidding me? Oh yes. Matching displays. There we go, 120 hertz. Alright. Let's play a video game. Time to finally try this thing. - [Plouffe] Yeah. - Oh, look at that. Everything just works. - [Plouffe] Wow. - Freaking love it. I wanna make it abundantly clear that none of the problems we had today were a Asus's fault, for real though. When you're trying to do weird stuff, weird stuff happens sometimes. Man, this looks good. I love OLED. I don't even know what mode I'm in on this one. It just looks great. I don't don't want uniform brightness. I want HD. Oh wait. HDR setting is not. Oh. - [Plouffe] Check windows, make sure Windows is set to HDR, yeah. Duplicating doesn't do HDR. - Duplicating doesn't do HDR. - [Plouffe] Yes, you can't duplicate HDR. - Seriously? Are you even for real right now? - [Plouffe] Why is it like why are the settings all over the place? - [David] That's competitive settings. - [Plouffe] Yeah, shadows low and shit. - [David] Linus takes Halo serious. - [Plouffe] It's legit actually those are competitive settings. - Whatever just don't even worry about it. (laughing) - You know what matters? This looks freaking great. Oh no. Oh no. Oh no. Oh no. Oh, no. I have no idea how much of the 120 hertz upstairs and downstairs, KVM switching for the guest machine, USB over ethernet stories are gonna end up being in the video. But the one thing that hasn't gone wrong today, this monitor. (laughing) For real, ah man. There's still so many technical issues to solve for my idea here. You know what I think we might have to do? I think I'm just gonna get like a nook or something. - [Plouffe] Yeah, build a second computer. - There'll be a second computer, okay? There'll be a second computer. There'll be a NUC and I'll just have cables and I'll just plug into them. When the kids have a friend over. Wait, what is this? - [Plouffe] Anno. - I know what game it is. I just mean I started in the, in this world and I forgot. I forgot, I thought all my stuff was gone. One of the big issues I had with my old OLED was that with these lights on it was just, it was, they were so bright. They overpowered the OLED display. Yeah, uniform, brightness mode is actually on. - [Plouffe] Wow. - So then we're good. Well that's fantastic. - [Plouffe] Yes! - Oh my God. Thank you for watching. Thank you, Asus, for sponsoring this video. Did we even include like, do you have any, you got, you like measured stuff on this. Is there somewhere we can put that? Just like put it somewhere, I guess. - [David] On the screen right now. - [Linus] Yeah. It's good. - [Plouffe] It's good. - [Linus] It's like actually good. We actually measured it. I know it's sponsored, but we wouldn't lie to you. - [Plouffe] It does the things on the box that it says it does. - [Linus] It does everything it says on the box. It looks really good. If you want this one or the 48-inch model, we're gonna have those links down below. Where's all my crowds at? Yo! Get, what? They're just disappearing.",
    "transcript_keywords": [
        "Yeah",
        "USB",
        "KVM",
        "good",
        "display",
        "display port",
        "thing",
        "monitor",
        "Plouffe",
        "port",
        "HDMI",
        "cable",
        "God",
        "ASUS",
        "things",
        "display port KVM",
        "David",
        "keyboard",
        "work",
        "computer"
    ],
    "transcript_entity_values": [
        "Level One Techs",
        "one",
        "only USB two",
        "five minutes",
        "LG",
        "Asus",
        "9",
        "One",
        "Floatplane",
        "RGB",
        "zero",
        "5",
        "120",
        "300",
        "1",
        "Mac",
        "LTT",
        "about a hundred",
        "Geoff",
        "three",
        "ASUS ROG",
        "Linus",
        "around 230 minutes",
        "Linus",
        "Four",
        "48 inch",
        "ASUS",
        "DCI",
        "first",
        "2",
        "GB",
        "like a few days",
        "NUC",
        "25 foot",
        "60 hertz",
        "KVM",
        "sec",
        "AV",
        "60",
        "138",
        "42-inch C2",
        "four",
        "LGTV",
        "David",
        "48-inch",
        "16",
        "cat6",
        "the USB 3",
        "120 hertz",
        "jack",
        "3",
        "Wendell",
        "Linus] Remote",
        "2.0",
        "2.1",
        "48",
        "David] Linus",
        "HDMI",
        "600",
        "two",
        "David] Watch",
        "Yo",
        "250",
        "second",
        "Asus",
        "98%",
        "1.4",
        "0.1 millisecond",
        "USB 2",
        "Yvonne",
        "a hundred.",
        "today",
        "Plouffe",
        "24-inch",
        "one minute",
        "Kensington",
        "1/4 inch",
        "USB",
        "a minute",
        "144",
        "IO",
        "about three"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "GPE",
        "DATE",
        "FAC",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "LAW",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "QUANTITY",
        "TIME",
        "GPE",
        "QUANTITY",
        "ORG",
        "TIME",
        "CARDINAL",
        "GPE",
        "CARDINAL"
    ]
}