{
    "id": "BY7-sECF3Dw",
    "title": "Is YOUR Laptop Too Hot?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-08-14T14:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=BY7-sECF3Dw",
    "category": "Science & Technology",
    "tags": [],
    "views": 557818,
    "likes": 27194,
    "comments_count": 1465,
    "description": "Learn through problem solving, and the first 200 people can save 20% today on Brilliant at   What are safe temperature ranges for your laptop?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Nerd or Die Stream Overlays & Templates:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/s8hBAgR",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- If you've ever used a laptop in your life, chances are you know what it's like when it gets way too hot for comfort. It's uncomfortable. Unsurprisingly, when you try to pack that many electronic components in such a small space, heat is a real issue. And there's actually an entire industry based around trying to keep laptops cool. But other than getting burns on your skin from an overheated computer, how do you know your laptop is actually too hot? One easy thing to keep an eye on is your CPU temperatures, obviously. It's quite normal to see your CPU heat up under heavy use. But if you laptop feels painfully hot or if it's behaving strangely, my laptop wouldn't do that, download a reputable hardware monitoring utility and check your processor's core temperatures. Both AMD and Intel specified temperatures of around 100 degrees Celsius as a maximum, but a good rule of thumb is that if you're getting over 90 degrees under load, you should probably try to cool your laptop down. And for you gamers out there, this is a good guideline for your discreet GPU as well, and your attitude. Maybe a short break is in order before you start friendly firing on your support units. You know. But processor temperatures aren't the only thing to watch out for. Batteries don't particularly like excessive heat either. I mean, does anyone? And their tolerances are lower than they are for CPUs. The lithium-ion batteries common in modern electronics should be kept below 45 degrees Celsius. Although they can operate at higher temperatures, up to around 60 degrees or so, some laptops will stop charging once the batter temperature hits 45 degrees. If your battery is often running at high temperatures under load, its life might be shortened, and it might even swell up on you, like physically get larger, which can damage other laptop components. I once had a laptop track pad start to bulge out of its housing because the batter underneath was swollen. Not good. And on the subject of high temperatures causing deformation, heat can actually cause the soldering inside the machine to crack or warp. Infamously, this phenomenon was at the center of a controversy that happened a little over 10 years ago, called Bumpgate, sounds pretty fun, that involved Nvidia and Apple. See, Nvidia sold a bunch of GPUs to Apple that turned out to be defective, but the issue wasn't the GPU dies themselves. Instead, the soldering that held the die on to its package, arranged into small balls called bumps was apparently made of a different material that didn't behave in a way Nvidia expected once they heated up. As a result, many of these bumps expanded excessively, leading them to break entirely. Some reports indicated that failure rates were as high as 40%. To this day, relations between Apple and Nvidia are rumored to be quite frosty. No pun intended. And Apple started many of its Macs to AMD graphics in the wake of Bumpgate, though it's never been confirmed exactly how big of a role that particular incident played. But back to heat inside your laptop. We know that it's bad. But if your monitoring software indicates your temperatures are too high, how do you cool things off? Well, you start off with the simple things, a good old big glass of ice water. Just kidding. Don't do that, that was a joke. You can check the ambient temperature of the room you're in, try operating your laptop on a hard, level surface to ensure that the air vents will have clearance to breathe, and blow out those vents with some compressed air to make sure they aren't clogged with dust. If this doesn't work, it's not a bad idea to check if any curves you've set aren't somehow messed up. And if you're still scratching your head, pop off the panel, and ensure all the fans are running properly and aren't unplugged or straight up dead. Now if you haven't fixed the problem at this point, you gotta start asking questions about your competency as a laptop repair person. Just kidding. A good cooling pad to sit your laptop on might be a good idea. You don't necessarily need anything super expensive. Just find something well-reviewed. And remember, if you're in the market for a new laptop, you can save yourself a headache by reading or watching reviews, and making sure the model you're looking at hasn't been too hot to handle for other customers. Although there are a lot of great laptops out there, some of them just aren't designed all that well when it comes to heat dissipation. So do your due diligence, so you don't end up with a laptop bezel you could fry an egg on, even if you're feeling a little peckish for a breakfast sandwich. They say breakfast is the most important meal of the day. It helps your brain. And you know what else is good for your brain? Brilliant. If you're a student, a professional, or just someone who wants to understand the world better, check out Brilliant, the website that helps you reach your learning goals by helping you work on them just a little bit every day. Brilliant offers interactive explorations and a mobile app to help you master concepts in math, science, and computer science. The courses take complex concepts and break them up into bite-sized chunks. Over time, you'll be amazed at what you can accomplish. We suggest checking out their mathematical fundamentals course, which has been redesigned with interactive features to help you with the foundational concept behind algebra, number theory, and logic, which make it a great resource for STEM students. The first 200 people to head to brilliant.org/techquickie will get 20% off in annual prescription, so do that, guys. Hey, thanks for watching this video, guys. Like the video if you want to. Dislike the video if you want to do that. Check out our other videos. Comment below video suggestions, and don't forget to subscribe and follow Techquickie!",
    "transcript_keywords": [
        "laptop",
        "temperatures",
        "good",
        "heat",
        "Apple",
        "Nvidia",
        "degrees",
        "degrees Celsius",
        "hot",
        "check",
        "laptops",
        "high temperatures",
        "video",
        "high",
        "start",
        "CPU temperatures",
        "CPU",
        "CPU heat",
        "cool",
        "Brilliant"
    ],
    "transcript_entity_values": [
        "Bumpgate",
        "the day",
        "Techquickie",
        "Intel",
        "One",
        "20%",
        "this day",
        "90 degrees",
        "200",
        "around 100 degrees Celsius",
        "annual",
        "45 degrees",
        "as high as 40%",
        "AMD",
        "Macs",
        "first",
        "around 60 degrees",
        "Nvidia",
        "a little over 10 years ago",
        "GPU",
        "CPU",
        "45 degrees Celsius",
        "Apple"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG"
    ]
}