{
    "id": "bZekquvvkXY",
    "title": "Corrupted Hard Drive? - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-08-02T19:59:03Z",
    "video_url": "https://www.youtube.com/watch?v=bZekquvvkXY",
    "category": "Science & Technology",
    "tags": [
        "Corrupted Hard Drive",
        "Data Loss",
        "Data Corruption",
        "ProSoft Engineering",
        "Data Rescue",
        "Hard Disk",
        "Hard Disk Crash",
        "Apple",
        "MacBook Pro",
        "macOS",
        "Corrupted Hard Drive? - Krazy Ken's Tech Misadventures",
        "Krazy Ken's Tech Misadventures",
        "Computer",
        "Tech",
        "Funny",
        "Humor",
        "Comedy",
        "Anime",
        "Parody",
        "KKTM",
        "Krazy Ken"
    ],
    "views": 82158,
    "likes": 1694,
    "comments_count": 281,
    "description": "Is this hard drive corrupted? Krazy Ken receives a disk that was working PERFECTLY just moments before it was brought into Generic Tech Store. Join him as he troubleshoots, tinkers, and somehow enters another genre of entertainment, through a quasi-lore-infused wormhole.  Want more videos like this?   Subscribe for new content!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #62 - Corrupted Hard Drive?  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Krazy Ken] In times of darkness, we can always count on CONVERSION TECHNOLOGY! Okay, it doesn't sound like it's having a physical failure. Yep, this is horrible. I kind of withheld something from you guys. We're not done yet. Here's the truth. (beeping noises) (upbeat music) Hey guys, how you all doing? Really, that's just great. You know who is not doing great the person that gave me this hard drive. Time for the tragic backstory. (soothing music) So, this person, we'll just call him person A came to me and said Krazy Ken something's wrong with my hard drive. Can you help me out? And I was like, of course I can, I'm Krazy Ken. I have a success rate of . . . 10%. So I was like yeah I'll do it for you. So he told me that he just got a new MacBook Pro, and he wanted to migrate the data. He brought the computer in to, for a product placement purposes will call it Generic Tech Store. And Generic Tech Store said we can't get the data off the hard drive. So he comes to me and he's like, what the Hell. So I thought, you know what, I think Generic Tech Store just had a problem mounting the partition. So my thought was Generic Tech Store was maybe very PC based, and this is from an Apple computer. So, maybe they didn't have anything to mount in HFS partition which would still be weird, because HFS has been around for decades, longer than I've been alive. So you'd think they'd have a way to mount it. But maybe they didn't. So, I'm thinking if the disk was just working perfectly, and all of a sudden when person A brought it to Generic Tech Store for data migration, it stopped working, I'm thinking no. I think the disk is fine. I just think Generic Tech Store is not reading the disk properly. So, we're gonna try to get the data off of it for person A. Now, even if there is a logical failure, there's still things we can do to fix that. So, time to bust out the old drive toaster that was featured in a previous episode where I fixed a hard drive. Go check that out if you'd like. And, we're just gonna pop it right back in there. And, I must say it's nice to be back in the regular lair, as opposed to being on the road all the time, getting fire alarms set off. That's crazy. All I wanted to do was play Pac-Man in that episode and fire alarms go off. You just can't get a moment of peace, can you. Yeah, okay, so apparently the screws on the side are too THICC with two c's to fit inside the drive toaster. So that kinda sucks. We're gonna have to take those out, and stick it in the toaster. Okay, I swear I have taken these types of screws out before, but maybe these screws are different. Maybe I lost the bit I need. But every tool from every kit I have, even from someone else, I asked to borrow their kits, all of their stuff is too big to fit these torque screws. I think their kit went down to a T9, and it still didn't fit. So I don't know if these are T11 are something. I'm not a tool expert. I'm really not. But yeah, so we can't even fit the frickin' disk in the toaster, because the screws jet out by four millimeters total. And now I can't get the data off there. Or so I thought. In times of darkness, we can always count on conversion technology to save us. I mean, technically this is conversion technology, but it's not gonna work, so, bye, bye. This bad boy is the conversion technology that will save us today, because as you can see, it's just the SATA, what is the SATA II or whatever. I don't know. It's the 2 1/2 inch SATA II to USB2 card. And it doesn't have a case on it, so the screws can just sit on here freely. Now, that other one is USB3. This is only USB2, so it's way slower. But at least the disk will fit on it. And honestly that's all I care about. So, let's put her together. Begin conversion technology docking procedure. (Ken makes beeping noises) Yep, your speed is 1.21 nautical miles per second. (Ken makes static noises) That sounds pretty slow, over. I don't know math. I also don't why it's called a nautical mile. I really don't know any of this stuff. But anyway, yeah, that's a, that was really not exciting. With the conversion technology sandwich now in place, we have this USB that is hooked up to a computer conveniently out of frame. And let's see what we got. This is the more fun docking procedure. It's all sticky. Okay, it doesn't sound like it's having a physical failure. That's a good start. But what I'm not happy about is what I'm seeing on the screen. Granted, this is still not the end of the world. So let's take a look. Okay, so it looks like, yeah, there's master boot record. That's interesting. These are usually GPT if they're on Apple disk right. So yeah, something's definitely not right. It has no volumes on it. But yeah, let's throw a partition on here. Let's just call it untitled. Master boot record, that is interesting. I mean, yeah, aren't these usually a GUID Partition Table? I don't know, does it make a difference in this case, if we're not booting with it? I don't know, let's just leave it at the default settings for now. It sounded a little clicky there. Operation successful, okay. Okay. (typing noises) Alright, so yeah, I mean. So there's no data on the surface of this disk or I don't know what you call this level of the file system. But the bits are probably still in there, we just don't have any of the inodes that tell the finder, hey here's all the shit. So, there's probably actually still a lot of data on here, we just need to go deeper. So, typically, I use data rescue for a task like this. So let's see. Okay, welcome, well thank you. How cordial. Start recovering, and I don't know what the difference is between choosing this or this. Maybe if there were more volumes that would scan everything. Yeah, whatever, let's just choose that. And we'll do a quick scan, probably won't work if this thing needed to be initialized, but let's just do it for shits and giggles. My hypothesis is this is just gonna show the beat, the basic files needed to run the file system, which, yes, that is, that looks exactly like what it's doing. So, let's go back. And let's run a deep scan. So, what this will do is it will scan these catalog items, but then it's gonna scan block by block by block by block, all 1.465 billion blocks, and see if it finds anything. So, this is kinda like treasure hunting. We might find something, we might not. Thought you might just wanna listen to the hard drive for a while. Right now it doesn't sound like it's doing a lot of mechanical stuff. It's just mostly a nice little hum. Well crap. Oh shit. (computer makes clicky sounds) Ah, that is not a good sound. I thought it was working. Something ejected it abruptly, and then it made those sounds. Those sounds are like nails on a chalkboard. Ah, crap, it's going off again. Stop, I don't know, I mean, it sounds like the disk is having some kind of physical problems. But I don't know if that was a loose USB cable or the card was not connected all the way. Crap. Oh, that's not sounding good. I'm gonna try running the scan one more time. But, I'm gonna make sure everything's connected and nothing gets touched. So, just let's try it one more time. That didn't sound good. It wasn't making those sounds earlier. Okay, it seems okay so far. Okay, so I still have the sound coming from the hard drive, so we can keep an ear on that, just to hear any mechanical issues. But I think it was around, what was it, 10 million blocks. It was 10 or 11 million I think were choked last time. We're about to hit that point. Let's see if the same issue happens. I mean, it's very possible there could be some bad sectors at that point, yeah. I mean, that's not too out of the question, right? And that can cause the disk to choke. But it went offline. It actually lost connection to the computer. I don't know if a bad sector would do that. Yeah, bad sector could cause data to not be recovered or some kind, or a kinda corruption, but I didn't think it would cause the connection to break. But, it could've been a software thing, like, oh, hey, we can't find the disk. We're just gonna puke. No I don't know. Okay, it looks like it's getting further than last time. I think maybe something was just loose. But the disk was definitely making some mechanical failure sounds. I mean, there are signs of mechanical failure. We can hear that. But maybe we'll be able to scan enough to recover maybe half the files, maybe 10% of the files, maybe just something, because honestly I would like to get this recovered, because I was talking to person A, and this was kind of implied due to the fact that they wanted me to look at the disk. But, I guess they didn't have a backup of everything. So, this might be it. If I can't get this data recovered, and there is no backup, that data might be gone, unless we pay a lot of money for the Data Rescue Center to physically fix the disk and recover the data, so. If this recovery doesn't work, and there definitely is no backup, which it's sounding like that, then it could be, what, a thousand dollar job maybe to get a 750 gigabyte disk recovered physically. Yeah, I don't even know if that'll be worth it. Yep, I stepped away for one minute, yep. (computer's making clicky sounds) Yep, shoot, those aren't good sounds, man. Those are not good sounds. It's probably just damaging itself the longer it does that. Uh man, I can't believe it. Is this really corrupted, physically? It was literally just working in there person's computer before they took it out to bring it... Or I don't know if they even removed the disk. I think they just brought the laptop, either way, however they got it to the store, I can't believe the disk got corrupted within that short amount of time. It's really not working, shit. Hang on. That's crazy. It was working and then it suddenly, when they brought it in, it stopped. I thought it was maybe just a mistake, like they were reading the disk wrong. Or, maybe there was some kind of logical failure, but no that is definitely mechanical failure. That is a huge bummer. Now, before when I've used data rescue, I've been able to scan just small parts of the disk, and then abort the scan and just see what can be recovered there. I don't know if they still have that feature. I know there's a pro mode which I think we can use in a read only mode. We can't actually recover data with it, but we can still scan with it. It's a separate price you have to pay for those features. Yeah, maybe we can just scan a small portion. I just wanna see what I can find. I mean, if I have to pay for the recovery, I'm gonna ask person A if they wanna pay for it on the software level. On the physical level, it's probably gonna be out of there budget, 'cause that stuff can cost easily a thousand bucks. For grins and giggles, I should get a quote though, contact the Data Rescue Center. I think they can give you quotes. Okay, I plugged it back in. You can hear it. It's spinning. It's not doing anything crazy. But it's definitely not mounting. It's not even showing up in the tree. Alright, this is horrible. Let's try re-plugging it. Yeah, even when it's spinning down, did you hear that? Yeah, that sounded kind of rough. Is that normal? (Ken laughs) Spin up. Okay, it's, oh it mounted. Alright, well that's a start. Yes, professional license will be needed. We won't be able to recover anything, but we can at least try something. This is data rescue on steroids. I don't know if it'll let us do any, drive hex. Oh, well, this probably means something to somebody. I honestly don't know what a lot of this stuff means. Oh, end sector. Oh, okay. Well, let's just do a million sectors or blocks. Are those the same thing? It's the same number. Yeah, let's try. Well, let's see what we can do. Yeah, definitely got nothing there. Let's try just a random start at block or sector 50 million. And let's go to 60 million. Let's see if it can pull anything from there. It should be about, what, a five gigabyte scan. 5.1 okay. Let's see if it finds anything further into the sector count. I really don't know if what I'm saying is true. I should probably google this. Okay, so block scan, phase one is almost done. We're gonna go into reconstruction phase two. Archives zip, probably gonna be junk. Yeah. Gz's oh, I, no clue. Yeah, the thing is even if we find data. It's most likely, at this point, not gonna have friendly file names. And we're not gonna be able to recover without purchasing the pro license which is $299. And so that would be up to person A. But yeah, looks like it's just finding this. I'd like to find something else that we can preview, because we do have quick look abilities. I think right here. 10 of 10. Oh, you can preview 10 files. Oh man, we can only preview 10 files. My gosh. But yeah, if we can find a picture or something to prove that there's data that's readable great. Even if it doesn't have a friendly file name, we can still get some preview data. Alright, well I'm still finding virtually nothing, but at least the scans are completing helpfully, so. I just got word that the cleaning ladies need to come down to the lair and clean up. So I gotta back to my office. I'll run a scan there. I'm just gonna set a bigger range, so it's probably gonna have to run for a couple of hours. But then I will get back and see what's up. Sit tight. Alright, so the cleaning ladies did a nice job down here. I am back. And I ran another test. But before I show the results, I'm just gonna show the Data Rescue Center webpage. So yes, ProSoft has the Data Rescue software, but they also have an actual center you can ship the drive to for repair. Actually the prices for the single rotational drives are a little less than I thought. I'm still guessing this would probably be somewhere in between about a thousand bucks or so. And I contacted person A, and they said nope. I'm not paying for any type of recovery. So essentially, if I can't get anything off of here, just forget it. So that's what's gonna happen. So let's switch back to the Data Rescue software to take a look at the results from last night. So at a, yes 3:20 in the morning, this scan finished. I believe I scanned the last, what was it, 500 million blocks or something like that. And it looks like we have items showing up, folders, but the files in these folders look really small, pretty much unusable. DPX, oh, yeah, I mean the file name's are getting really corrupted there. GZ files, probably not gonna be able to do anything with that. It's attempting to reconstruct some stuff it looks like, but it's just not working. It looks like it found the file system components for the recovery partition. Oh, that's interesting, core services. But yeah, it doesn't look like any of the stuff is gonna work. It found a flack file apparently. But I doubt this is anything useful. Let's see, there is a... Oh, let's see, if we check that there is a preview option. Oh, it's grayed out. Okay. Well, guess we can't preview it. (Ken laughs) Nevermind, so it looks like it's finding data, but it's not usable in any way. So, oh man, I hate to say this, but oh, I'm callin' this a loss. Couldn't get the data recovered. But, it's not all bad. I kind of withheld something from you guys. We're not done yet. Here's the truth. As you know, Krazy Ken is comprised of these candid tech video logs. Hardly any preparation goes on before I turn on the magical device that documents these for your pleasure. However, I cheated this time. Person A came to me with this hard drive. And initially when I needed to do the recovery, I didn't have time to go down to my lair and document this for you guys. So I had to test it myself before any Krazy Ken stuff was even in question. And nothing worked. Nothing worked. No scans worked at all. So I thought, what if I could reverse the Krazy Ken Curse and go into a video and the opposite happens. And I did. I went on video and now we at least got way further than before. So it's like I reversed the curse. So, in a way we made some progress. The curse I think is finally starting to get defeated. Oh, I can feel it. I can feel it. The curse wast this invisible force screwing with me, but I think I can see it now. It's starting to show its face. (upbeat music) - [The Curse, (Ghostly Voice)] What, no, how did you know where to find me? - I knew you were there all along. These problems don't just happen, especially to me. Some force was causing them to happen. And now I can finally see your filthy face. - [The Curse] No, impossible. - Well, now it's time for me to end this. Krazy Ken's reverse curse solar beam. (Ken screams) - [The Curse] You haven't seen the last of me. (upbeat music) - I am calling that a win. (Ken laughs) Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Generic Tech Store",
        "data",
        "Generic Tech",
        "Tech Store",
        "data rescue",
        "yeah",
        "Data Rescue Center",
        "disk",
        "Krazy Ken",
        "scan",
        "Tech",
        "hard drive",
        "Store",
        "drive",
        "Time",
        "person",
        "rescue",
        "Generic",
        "kind",
        "sounds"
    ],
    "transcript_entity_values": [
        "T9",
        "USB",
        "Ken",
        "CONVERSION TECHNOLOGY!",
        "299",
        "500 million",
        "2 1/2 inch",
        "half",
        "60 million",
        "USB2",
        "DPX",
        "thousand dollar",
        "the Data Rescue Center",
        "USB3",
        "10%",
        "10 million",
        "two",
        "Apple",
        "10 or 11 million",
        "a couple of hours",
        "3:20 in the morning",
        "Generic Tech Store",
        "five gigabyte",
        "Data Rescue",
        "a nautical mile",
        "Pac-Man",
        "decades",
        "ProSoft",
        "SATA",
        "today",
        "between about a thousand bucks",
        "Krazy Ken",
        "Krazy Ken's",
        "a thousand bucks",
        "1.465 billion",
        "the SATA II",
        "one",
        "four millimeters",
        "1.21 nautical miles",
        "MacBook Pro",
        "GPT",
        "10",
        "750 gigabyte",
        "SATA II",
        "HFS",
        "last night",
        "one minute",
        "50 million"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "TIME",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL"
    ]
}