{
    "id": "c-J229FzKXk",
    "title": "I Used Stolen Software to Make a DIY Xbox - Xbox Alpha I & II Dev Kits",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-14T18:21:09Z",
    "video_url": "https://www.youtube.com/watch?v=c-J229FzKXk",
    "category": "Gaming",
    "tags": [
        "xbox",
        "og xbox",
        "original xbox",
        "xbox dev kit",
        "dev kit",
        "development kit",
        "video game development",
        "game development",
        "microsoft",
        "retro games",
        "retro game development",
        "diy dev kit",
        "sixth gen"
    ],
    "views": 2529847,
    "likes": 71158,
    "comments_count": 2232,
    "description": "Check out Thorum using the link below and get 20% off by using the code LTT at checkout:    A glimpse into the past of Xbox game development with the Xbox Alpha I development kit. The craziest part? You can build one yourself! (sort of) AND IT CAN EVEN PLAY GAMES (maybe). Oh, and we mistake CES 2001 for E3 2001, but really, who hasn't made that mistake before?   Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:28 Alpha I & Xbox's Origin Story 3:03 Inside the Xbox Alpha I 4:27 The RAM 7:06 GPU & Peripheral Cards 10:06 The hardest parts of DIY 11:12 Geriatric Dashboard 12:02 Demo Software 13:25 Simpsons Road Rage 15:48 Loading a game onto it 17:31 Dark Summit and a disappointing load screen 18:33 Conclusion",
    "description_links": [
        "https://www.thorum.com",
        "https://linustechtips.com/topic/1481385-i-used-stolen-software-to-make-a-diy-xbox/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This may look like a boring workstation from the dot-com era, and it is, but the eagle-eyed among you might have noticed that it is also adorned in Xbox logos that don't quite look like Xbox logos. That's because this Alpha One dev kit was the first dev kit created after Microsoft unveiled the big metal X at GDC back in the year 2000. Unlike the big X, this one certainly didn't cost $18,000 to build and require a solid block of aluminum to be milled for each unit. In fact, as I'm about to show you, it is built entirely out of relatively low-cost commodity PC parts that anyone can get. And there's more. This is the Alpha Two, the second Xbox dev kit. That's right, we have two generations of these things, both with working hardware, and the wildest thing about all of this is that unlike the other console dev kits that we've looked at, these can be recreated by anyone using leaked software that you can just download. Imagine being able to build your own Xbox, sort of. It's possible, mostly. You know what isn't possible to do by yourself, though? Segue to our sponsor, Thorim. Elegant rings made out of unique materials from meteorite to dinosaur bones. Use the code LTT to get 20% off today and stay tuned to learn more. The Alpha One dev kit isn't very well documented, so I am really excited to crack this thing open and especially to compare it to Alpha Two, which is pretty much a known quantity at this point. But before we do that, the origin story for the Xbox project is really interesting, and it kind of starts with this sticker on the front that says, Powered by DirectX. The way the story goes is that the original OS was basically Windows 2000, but stripped of everything but the bare minimum for running DirectX. So the name is actually short for DirectX Box. Now, Bill Gates apparently hated the prototype bastardized Windows that they showed him so much that he screamed at the original team presenting the first prototype for over two hours on the night of Valentine's Day, like, late enough to where most of them had to cancel dinner with their wives. But then he gave them the go-ahead because he liked how fast it booted and feared that the PlayStation 2 would take over the living room while also taking the place of the home computer, eventually. Right out of the gate, there are some really fun hallmarks of early 2000s computer design. I mean, you'd hate for your tower to tip over, right? If we were to pry off this fascia here, which seems to be just a piece of sheet aluminum bent and then glued onto the front of a generic case, we could probably figure out the exact model, but video gaming historians would get super mad about that. I'm pretty sure, yeah, I'm getting the nod. And really, that's not the important part anyway. We want to see the guts, which is a little... What the heck? Come on. Give me your secrets! Wow. That is generic. Yep, that right there is about as exciting as your grandpa's PC. I mean, at the time, it was pretty exciting. The motherboard is an Intel VC820. Codename Vancouver, by the way. Yay, go Vancouver. As for the CPU, I really wanted to pull this out and give you guys a closer look at it. It's got a Cooler Master cooler on it. Young up-and-comer company right there. But unfortunately, these ancient plastic pushpins are proving to be a bit of a chore to get out, and the last thing I want to do is damage any of them. So it might have to stay in there, but that's fine because the reality is it is a run-of-the-mill Intel Pentium 3 733 MHz CPU. But that's a really interesting story. The processor was, as the legend goes, supposed to be AMD, who really did have the superior technology at the time. But sometime between the aluminum monster and the unveiling of what would become the retail Xbox, Microsoft switched suppliers to Intel. AMD, though, had no idea, and they were actually sitting in the front row at E3 2001 when they found out that they were usurped by Intel, sitting feet away from Dwayne The Rock Johnson. Why was he there? He was presenting the Xbox. Yeah, the Xbox got unveiled by Bill Gates and Dwayne The Rock Johnson at E3 2001. How do I not remember that? He's been that culturally relevant for that long. Moving on to the memory, things get quite a bit more interesting, and thankfully this comes out. Rambus is probably best known today for its role in the industry as a patent troll. But back in the late 90s and early 2000s, they, alongside Intel, were pushing RDRAM in this RIM form factor as the next big thing in system memory. It had a huge advantage in terms of bandwidth over the SDRAM of the time. This module right here remember, this is from the year 2000 was clocked at 400 MHz and utilized both the rising and falling edge of the signal to achieve effectively double that 800 MHz. Wow. Unfortunately, it came at a much higher cost due to its larger dies and allegedly very high licensing fees to Rambus. Making matters worse, while the bandwidth was much higher, the latency was also higher, meaning that in the real world, performance on Rambus-based systems actually wasn't higher. So when DDR SDRAM came along, Rambus got the boot. Our Alpha 1 came with a total of 640 MB of this RDRAM, the 128 MB, and a second 512 MB stick. And this is the first way in which it differs from our Alpha 2, which actually only contains the 128 MB module and this. What in the heck is that? This is a filler card, because the way that RDRAM worked, you can't just have an empty slot on your motherboard. You must populate both channels, either with a single dual-channel module or two single-channel modules. So you had to use one of these if you wanted to use just the one. But that's weird. Why would Alpha 2 need a filler stick and have only one-fifth the amount of memory as Alpha 1? Actually, that's not that unusual. Dev kits, particularly early ones, tend to have more system memory than the final system, and the reason is that the games that they're running on them are not exactly optimized at that point in the console's life cycle. So our Alpha 1 had 640 MB, our Alpha 2 had 128 MB, final dev kit had 128 MB, but the system memory was actually shared with the GPU, which is different from Alpha 2, and finally, the retail console had 64 MB of shared memory. That is less than a tenth of our Alpha 1, which either means that the software got that much less bloated over time, wow, or more realistically means that when this dev kit was repurposed as a software development workstation, the IT department popped her open for an upgrade and threw in another stick of memory. And that's probably not the only thing they upgraded, because how else would our Alpha 1 have a GPU that is three generations newer than our Alpha 2? See how our motherboard has onboard USB and onboard audio, and they added both a USB card, which isn't that abnormal, just so you could have more USB ports, but also an add-on audio card? That's because within the Xbox OS, the only functional ports on the motherboard were serial, so these are likely to be close analogs to the audio and USB controllers that ultimately made their way into the final console, but might not have been included on whatever random Intel motherboard that Microsoft used for these systems. Then there's this RAID card. Okay, so this bad boy is called a Raptor, and it was used for DVD mastering. That is kind of all we really know about it at this point. It connected to a 40 gigabyte hard drive that could hold all the DVD information, and if you weren't mastering a game disk, it was not particularly useful, and maybe even made it slightly worse. When these were deployed as workstations, it apparently functioned just as a regular RAID card. Coming back to our Alpha 1 for a second, we are missing both the RAID card and that special sound card, which could be a big problem for us. You see, the stripped-down version of Windows 2000 that these run only contains support for the exact hardware that it's expecting to run on. So if we don't have exactly the right Alpha 1 components, this thing isn't going to boot, and since Alpha 1 is relatively uncharted territory, we're not even going to know necessarily what parts have been ripped out and put back in when this was Frankensteined together as a workstation. I mean, it's a functioning computer as it is. It just wouldn't boot up into any of the dev builds that we tried, and we made it as far as December 2000, which should have worked, but didn't. We could have started ripping hardware out of Alpha 2 and putting it in here, but we had no way of knowing if that was actually going to work, and really, Alpha 2 is the more interesting one from a gaming standpoint. Anyway, can we fire it up now? One other fun thing while we're getting set up for that is, you guys might have noticed that the floppy drives in these are facing backwards. As far as I can tell, the only reason for that is that when they put on that front fascia piece, in order to have it look cool and sleek, they covered up all the rest of the external 5.25 inch bays and external 3.5 inch bays that would have been on the stock case. You still kind of needed a floppy drive back then for, you know, installing your operating system or just like loading software onto the computer. So they would have had to throw these in, and I'm assuming anyone using them would have had to pop the panel and like throw a diskette in there if they ever needed to use a floppy. That's freaking hilarious. Also, can I just say that I love this PCI card retention mechanism? It's a little janky, like this support braces at an angle for some reason, but man, those cards are in there. That is awesome. Something to note is that even if you have all the correct hardware for your generation of Alpha, that doesn't mean you can just load up Windows 2000, strip out the extra bits and start playing Xbox games. The software that these run is highly Microsoft proprietary and should never have actually left Microsoft from a legal standpoint. It's thanks to software preservationists that we were able to download it from archive.org. And while we were willing to take that risk, we can't in any way guarantee that that software hasn't been tampered with, so you would do so at your own peril. If you did find yourself wanting to build one of these, though, one of the hardest pieces of hardware to get your hands on is going to be the sound card because they've been out of production for kind of a long time. Fortunately, a netizen by the name of N64 Freak has actually created a blueprint that you can send to an overseas PCB manufacturer to have one made for yourself, an exact replica of it for about 50 US dollars. So if you're interested in playing around with it, that is an option. Though as you can see, if you just want to play Xbox games, there's no advantage to one of these versus just getting your hands on an old Xbox. We're in the dashboard right now and the build you're looking at is from about May of 2001. So this is around the E3 timeframe and about six months prior to the actual launch of the Xbox. What we need to check right now before we go any further is to make sure that our... Oh, oh, no, no. To make sure that our audio recording is working. [\" Yeah, that evidently does nothing at this stage. Okay. Is this all I can really do with this one or what? Yeah. So if you want to load a new XDK, you actually have to restart the system. Because... Power button. Oh, wow. Up top. Other side. Oh my gosh, that feels awful. One moment, please. Bump lens. And I guess this is just showing off a light distortion rendering effect of some sort. 1300 FPS. Damn Daniel. I just have to shut the whole thing down now. Yep. Okay. Well that was worth it. Credit to the team. It does boot really fast. Yeah. Now think about how fast Windows 2000 loads. Yeah. This was back in the days of three and a half minutes. This is not a hard drive, guys. A slow, slow mechanical hard drive. They really did optimize the crap out of this thing. Okay. Dolphin classic. Now with 1100 FPS. I think I've seen about enough of that dolphins from around. That's not a good sound. Turn it back off and turn it back on again. Yep. I didn't press the button, but it's probably fine. I mean, other than the resolution, that's not bad. So they're showing real-time shadows working. And then what is this? That is our IP address. If we were to plug this into a network, it would actually show us what the IP address of the system is. And with that we can hook up a developer's workstation and use the XDK software in order to load up games onto here. So that's actually how Simpsons Road Rage got put on there. E3 demo 50% complete. Okay. Can I even change which driver I am? Ah, there we go. Well, obviously groundskeeper Willy. Even loading off a hard drive. This is pretty awful. I've never played the original game though. So maybe you guys can shed some insight into whether this is normal or whether this is just because it's an early build. That's a lot of loading screen. All right, nice. What's this 12 seconds? Game over. I clearly do not understand this game very well. I haven't verified this. I only heard about it this morning, but apparently you can plug in a keyboard. No way. Remember, remember with the PS3 how we could plug in a keyboard and access a console? I guess we'll find out soon enough. Oh, this is, I don't think this supports hot plugging. Windows 2000 didn't even get support for USB 2 until service pack 4, and we have to run service pack 1. So it's only got support for USB 1, which definitely doesn't have some of the creature comforts of modern USB. I think we should try a PS2 keyboard just for lolz, humor me. You never know when you're going to need a PS2 keyboard, Tanner. That's why I always keep one in a nearby drawer. There we go. We got lights on this bad boy. Oh, what is this? That's the, that's the BIOS. They had a customized BIOS splash screen? Yeah. That's freaking awesome. I didn't even know you could do that back then. I mean, you can now, every system integrator does it, but back then I don't think that was a thing. This does not appear to be doing anything. There might be some hacky way to do this, but maybe it's not a default behavior. There was another build of this game that I could not find where they didn't have all the voices finalized yet. So instead of hearing Homer's voice, you would just hear a Microsoft Sam kind of voice read off the file name. Oh, that's awesome. Nice. Hey, I'm getting better at this. Let's go. Oh, yeah. I'm a Road Rage Pro now. Um, well, I don't know. Look, Brandon, it's an Xbox, but it's a computer. It's the DirectX box. Yeah, yeah, yeah. I'm going to get $10,000. I've never played this game before. It's fun. I know that, but we have videos to shoot. Come on, move it! No! Yes! Yes! All right, let's try another game. And to do that, we're going to show you how we can actually load games onto this thing, because you can't just like pop a game disc into the front. Oh, wait. Can you do that, Tanner? There were some game discs that were made that you could do that with. Really? Um, they were called green discs. Green discs? But we don't have any. We don't have any. They're quite rare. Okay. They were usually dev builds. They were also sometimes completed builds that were just sent off to members of the press, though, and they actually continued past the lifespan of the Alpha 1 and Alpha 2. So those continued on throughout the life cycle of the Xbox. Now that we've connected both of these machines to our network, they can actually see each other, and all we have to do is take one of these games that we have on our local hard drive here, like, say, for example, Dark Summit, and drag it over to the shared folder on our Xbox. No estimated time. It takes as long as it takes. Which is a lot more honest than what they give us now, I guess. I'm having the early 2000s game developer experience. Time to go get some coffee. And it's done! And this is super cool. I didn't actually notice this before, but these are not just two file explorer windows. This is XB Explorer, which presumably stands for... I'm kidding. I'm kidding. I'm kidding. Xbox. Xbox. The look on his face. He's like, I work for an idiot. Anyway, Xbox Explorer, and it allows us to do all kinds of cool things. So we can select our target machine. We can reboot the Xbox remotely. Actually, that's about it. That's about all we can do. But we can run this new game. We didn't try this before filming, but our understanding is that the Mob2T version of Dark Summit was supposed to be the playable one. Clearly not loading on our Alpha 2. So let's try the debug version and see if we have a bit more luck with that. I really kind of missed the loading bar now. Yeah. No way to... No, I'm kidding. I'm kidding. What the crap? That was so fast. Wait. Oh, because it doesn't have to do a full system reset. It just resets the software. Oh, that's awesome. Version 010101.0. No game object data. Uh oh. Look at that hairdo though. Whoa, here we go. Oh, oh, okay. Which pad am I supposed to... My controller is not working. I don't think my controller is doing anything. Oh man, am I ever going to get down? Oh boy. Oh, I don't think so. I think I'm stuck. Hey, there we go. Oh no, no, Naya, not that! This is early 2000s game design, Brandon. It doesn't even make any sense. I think the most interesting thing about this experience is how basic and commodity and almost kind of bootstrap the origin of the Xboxes. They just took off the shelf, honestly, not even amazing computers, turned them into a development platform, and just a couple of years later, the ball was rolling on what would become the juggernaut that Xbox is today. Just 20 short years later. The tools were janky. They clearly had no experience, no right to be there compared to the powerhouses at the time. Nintendo, Sega, Sony, and yet they did it. Just like I did this segue to our sponsor. Thorum. Thorum has been in business for over a decade, handcrafting unique bands and rings out of rare materials. They're made out of titanium, ironwood, meteorite, and even real dinosaur bone. They've got a ring for every taste. The Aloha is made out of black tungsten carbide with a Hawaiian koa wood inlay. Each ring is as unique as the person wearing it, and Thorum simplifies the process of finding a ring that fits you by offering ring sizer kits on their website. Each ring ships within one business day and comes with a free Thorum silicone activity band, plus a beautiful wooden ring box. They have over 5,000 satisfied customers and counting. So what are you waiting for? Head to the link in the description below to get 20% off today with code LTT. If you guys enjoyed this video, I'm going to kick you back to the PlayStation 3 dev kit. That one is flippin wild. Heavy.",
    "transcript_keywords": [
        "Alpha",
        "Xbox",
        "Xbox logos",
        "game",
        "dev kit",
        "yeah",
        "Xbox games",
        "thing",
        "Xbox dev kit",
        "dev",
        "back",
        "USB",
        "system",
        "card",
        "Windows",
        "Intel",
        "software",
        "Microsoft",
        "games",
        "kit"
    ],
    "transcript_entity_values": [
        "one",
        "PlayStation 2",
        "Sega",
        "Brandon",
        "Tanner",
        "Alpha 2",
        "One",
        "USB 2",
        "Willy",
        "over two hours",
        "GPU",
        "one business day",
        "800 MHz",
        "Raptor",
        "1100",
        "Bill Gates",
        "1",
        "Thorum",
        "64",
        "Xbox",
        "AMD",
        "Powered",
        "LTT",
        "Thorim",
        "three",
        "Dark Summit",
        "about May of 2001",
        "DirectX",
        "the year 2000",
        "Nintendo",
        "Microsoft",
        "about six months",
        "512",
        "first",
        "GDC",
        "Cooler Master",
        "the night",
        "640",
        "ironwood",
        "Dark Summit",
        "4",
        "CPU",
        "XB Explorer",
        "Vancouver",
        "Daniel",
        "Xbox dev kit",
        "3 733 MHz CPU",
        "50%",
        "Intel",
        "three and a half minutes",
        "PlayStation 3",
        "short years later",
        "the late 90s",
        "IP",
        "Sony",
        "Xbox Explorer",
        "Windows",
        "Sam",
        "10,000",
        "MB",
        "Alpha Two",
        "E3 2001",
        "Windows 2000",
        "Frankensteined",
        "Valentine",
        "this 12 seconds",
        "DDR SDRAM",
        "3.5 inch",
        "Alpha 1",
        "Naya",
        "Xbox",
        "early 2000s",
        "Rambus",
        "20%",
        "about 50 US dollars",
        "only one-fifth",
        "5.25 inch",
        "two",
        "Aloha",
        "XDK",
        "PCB",
        "010101.0",
        "second",
        "DirectX Box",
        "Homer",
        "128",
        "less than a tenth",
        "N64",
        "Dwayne The Rock Johnson",
        "Hawaiian",
        "SDRAM",
        "1300",
        "E3",
        "40 gigabyte",
        "today",
        "Alpha 1",
        "the days",
        "18,000",
        "PCI",
        "Intel Pentium",
        "a couple of years later",
        "RDRAM",
        "Xboxes",
        "400 MHz",
        "December 2000",
        "Alpha 1",
        "Thorum",
        "PS3",
        "Xbox",
        "over 5,000",
        "USB 1",
        "USB",
        "Alpha One dev kit",
        "this morning"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "QUANTITY",
        "FAC",
        "PERSON",
        "FAC",
        "DATE",
        "ORG",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "EVENT",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "LAW",
        "ORG",
        "PRODUCT",
        "TIME"
    ]
}