{
    "id": "c0hv8h2a4Tk",
    "title": "Ryzen 7000 is NOT what I Expected!",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-08-30T15:23:14Z",
    "video_url": "https://www.youtube.com/watch?v=c0hv8h2a4Tk",
    "category": "Science & Technology",
    "tags": [
        "cpu",
        "ryzen keynote",
        "ryzen 7000 announcement",
        "reaction",
        "am5",
        "new amd cpus",
        "hardware",
        "conference",
        "tech",
        "rdna3",
        "zen4"
    ],
    "views": 2045856,
    "likes": 80587,
    "comments_count": 3410,
    "description": "Sign up today for Oracle's CloudWorld event hosted in Las Vegas from October 17th - 20th and use code DEVY at the link here:   Find compatible products for your system and more at   AMDs Ryzen 7000 series has been hotly anticipated from its first whisper. Now, it promises to beat Intel at their own game  And with lower power draw to boot. And they teased RDNA3!  Discuss on the forum:    GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:06 7950X 2:20 HVX512 3:16 Power Draw! 4:45 Onboard Graphics 5:22 Gaming Performance 6:07 AM5 Platform 8:00 Pricing 9:30 RDNA3 Graphics 10:00 TLDR; 11:28 Outro",
    "description_links": [
        "https://lmg.gg/CloudWorld",
        "https://crucial.gg/LTT_CrucialScanner",
        "https://linustechtips.com/topic/1452450-ryzen-7000-is-not-what-i-expected/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This is a big moment for me. My career at LMG began with the launch of the very first Ryzen CPUs in 2017. Fast forward five and a half years, and the socket that I cut my teeth on as a tech journalist is finally at the end of its life cycle. Using the new AM5 socket, AMD's Ryzen 7000 promises not only to live up to the legacy they built with Ryzen, but also to humiliate the competition in the same way they were in the before times. And even more surprisingly, they might be bucking industry trends when it comes to efficiency. I might not need to buy a new power supply, after all. What I do need is to tell you about our sponsor. - Crucial, the crucial.com website features online tools that make it easy to find compatible memory and recommended upgrades. With compatibility for more than 175,000 systems, you can find the perfect upgrade in less than 60 seconds, at crucial.com. (high intensity music) - AMD's first big announcements of the day were all centered around the Ryzen 9 7950X, the 16-core, 32-thread beast of a CPU that can boost up to a staggering 5.7 GHz, making it a massively versatile piece of silicon. From AMD's benchmarks, which we should take with a grain of salt, it performs about 15% better, on average, over the outgoing 5950X in 1080P gaming and up to a whopping 40% better in content creation. Compared to Intel's Core i9 12900K, it's either as good or up to 24% faster, depending on the game, and as much as 62% faster in content creation. Now obviously, this depends greatly on the workload, and AMD brought receipts, by showing the V-Ray renderer running on both chips. Now mind you, V-Ray is more geared towards GPU compute, but this is an illustration of the wider design principles that AMD put into the new Zen 4 cores. Built on what AMD calls a specialized N-five process, developed in close collaboration with TSMC, the new chips accomplished their performance targets while actually reducing die area by 18%. Despite the addition of new features, including the infamous AVX-512, that Intel deprecated for Alder Lake. Instead of using up die area with dedicated space for this, AMD is using the existing 256-bit structures, but in a double pumped, or DDR, arrangement, which they say causes fewer clock speed fluctuations, as all those transistors are constantly changing state and crunching on those vast numbers. But hold up a second, AVX-512 is not for gaming, and Intel's more or less abandoning it. So why is AMD embracing it? Well AMD's claim is that AVX-512 will give Ryzen a performance boost in deep-learning workloads, which Intel has dedicated instructions for. The long and the short of it is that it should improve performance while having minimal downsides, and a die that's half the size of the competition. Though, of course, this is something we'll have to test for ourselves. But perhaps the most important consequence of this shrunken die is power efficiency. It's no secret that the tech industry has been headed down the dark path of ever-increasing power draw for a while now. And with the announcement that the Ryzen 9 7950X's TDP would increase by 62%, many in the tech industry feared that Ryzen 7000 would be another example of throwing more power at the problem. Luckily for us, AMD claims that this was done on the 7950X almost entirely for the extra headroom, and in operation, the new chips have been substantially better in performance per watt than Ryzen 5000. Using the 16-core Ryzen 9s as an example, the 7950X manages 62% lower power draw for the same performance or gets 49% more performance for the same power draw. Most impressively, at a fixed 65-watt TDP, that number grows to 74% better performance, which would mean that rather than the new chips being insatiably power hungry, they're, in fact, much more efficient. I'm not sure that this isn't spin until I see it myself, but this is extremely exciting for future efficiency builds, if true. As for how they've managed it, AMD tells me that it's a roughly 60-40 split between the physical die-shrink, along with some tweaks, and the design and all the lessons learned in the mobile space, including the all-new 6 nm IO die with the new integrated graphics processor. Now they didn't really talk too much about that new iGPU in the presentation, but they say that it's not going to be as powerful as what you might find in an APU, that it's primary role is to bring up and expand displays and to offload acceleration functions for video encode and decode. They specifically said that it wouldn't be something that people expect to game on, which of course means that people are going to try and game on them. Like, come on. As we reported before, all of the new chips are going to have this new iGPU, thanks to the IO die. And if you are not GPU-limited, you're going to get a lot more performance in games, because AMD has further improved the front end, with some tweaks and a doubled-up L2 cache, giving the Ryzen 9 7950X a grand total of 80 MB of combined cache to play with. As anyone who's followed our Ryzen coverage from day one knows, keeping the beast fed is half the battle, and this should help tremendously. AMD's testing showed a 13% instructions-per-clock uplift over Ryzen 5000, thanks to these tweaks of design, when they had previously expected 8 to 10%, and those clocks are much higher. What'll also help is the transition to pure DDR5 for the new socket, AM5. The nerdiest among you, like myself, will already know this, but TLDR, socket AM5 is a brand new platform that finally transitions AMD to using a land grid array, like Intel or Threadripper do today, instead of a pin-grid array, as previous generation Ryzen processors used. This increases the pin density, in this case 1,718, and reduces the likelihood that you'll break your CPU just by putting it down wrong. No word yet, if they'll need that $8 Walmart CPU frame to prevent flexing, but the extra pins will allow for more power to flow to the socket, up to 230 watts, and allow for more bandwidths to and from DDR5 memory and PCI-express gen 5, which comes standard on all chipsets for the NVME storage that AMD says we'll see in November. But for the GPU, gen 5 will only be supported on the two Xtreme series chipset variations. Now, AMD says there is zero performance difference between the chipsets and stock operation, and that they should differ really only in IO and power delivery for overclocking, which all chipset variants do, in fact, support. AMD's claiming that they'll support AM5 until at least 2025, which I mean, that's like two and a half or three years from now. Given that AM4 lasted for twice as long, and was host to five whole generations of CPUs, we can only hope that this is a case of under-promise, over-deliver. And hopefully, they'll over-deliver on their new EXPO RAM specification, too. This is AMD's answer to Intel's XMP, and was announced a few months ago, but AMD says that we should see over 15 kits available at launch, at up to 6,400 mega-transfers per second. XMP memory will still work, but AMD figures this will make it a lot easier for vendors to tweak sub-timings for Ryzen, and in typical AMD fashion, the spec is fully open to the public. The pricing for the chips themselves hasn't changed compared to Ryzen 5000, except the 16-core Ryzen 9, which is seeing a $100 discount for the newer chip. Like, what is this, bizarro land? Like in this economy, they're gonna do a discount? Anyway, I don't have the sales data, but it seems like a good bet that the 5950X didn't sell as well as AMD had hoped, after its price hike over the previous generation's 3950X. Or perhaps they just felt embarrassed to have the most expensive desktop CPU on the market, and would like Intel's 12900KS to shoulder that now, instead. Interestingly, the only Ryzen 7 option announced today was the 7700X, not the 7800X. My guess would be that AMD will use that name for the 3D V-cache variant later on. Probably sometime later this year, they said, maybe early next year, I'm not entirely sure. Most exciting for gamers, though, is that AMD's $300 Ryzen 5 7600X seemingly competes with, and wins against, the Core i9 12900K, a CPU that costs more than twice as much. As with any claim from the manufacturer, this is something that we're going to have to verify, but it's also something that we're excited for, especially if there's over-clocking headroom available, given its 5.3 GHz stock max turbo speed. No word yet on any less expensive non-XQs, though. AMD says that they expect the lineup to expand in a similar way to Ryzen 5000, so we're probably looking at next year sometime, for true budget options from Team Red. This entire event was about Ryzen, but AMD being AMD, they just couldn't help but talk a little bit about RDNA3, as well, which is apparently going to feature a 5 nm chiplet-based design that AMD claims will provide a 50% performance per watt improvement over current-gen Radeon GPUs. Again, big win if true, next to the looming shadow of RTX 4000. They showed off a bit of gameplay as a teaser, but that's really all we got. I guess we'll just have to stay tuned. The \"too long-didn't watch,\" though, is this, Ryzen 7000 looks far more of an upgrade than people initially feared, and it doesn't look like it's just gonna be Ryzen 5000 on DDR5. Of course, this is all stuff we have to verify for ourselves, again, I keep saying that, but it's true. And we'll have a review as soon as we're able to launch it. The whole AM5 platform, including the four CPUs they're launching with it, will be coming out on September 27th, and AMD says that they're confident in their ability to keep up with demand. Now we've heard that before, but hey, we can always hope. Just like we can always hope for a response in kind from Team Blue, and for a segue to our sponsor. - Oracle, Oracle's CloudWorld event is happening from October 17th to 20th in Las Vegas. Check out the dev nucleus space, where you can meet the experts, explore new tech, and have an awesome time with fellow developers, and make sure to attend one of their many featured developer sessions, like \"Unified Observability for Microservices,\" with Sanjay Goil, or \"Kubernetes Cluster Management Made Easy,\" with Mickey Boxell. There are also going to be tons of activities, like old school arcade games, ping pong, swag giveaways, and Oracle Red Bull Racing Playseats, with plenty of snacks and beverages to keep you fueled up. So come for the games, stick around for the tech sessions, and have a great time meeting some of the smartest and coolest people around at Oracle's CloudWorld event. You can learn more at the link down below. - Thanks for watching, guys. This is a, well it's been a while since we've done an on-location shoot, hasn't it? Maybe we can look at some of the previous Ryzen releases, like the Ryzen 5000 announcement, or some of the earlier Ryzen 7000 rumors. It's been an interesting ride, and it's been an interesting ride since Ryzen 1000, too.",
    "transcript_keywords": [
        "AMD",
        "Ryzen",
        "AMD Ryzen",
        "Intel",
        "performance",
        "AMD claims",
        "power",
        "Ryzen CPUs",
        "CPU",
        "chips",
        "die",
        "AMD claim",
        "Intel Core",
        "power draw",
        "tech",
        "CPUs",
        "transitions AMD",
        "Oracle",
        "generation Ryzen",
        "previous Ryzen"
    ],
    "transcript_entity_values": [
        "40%",
        "Las Vegas",
        "$300 Ryzen",
        "IO",
        "Ryzen 9",
        "Radeon",
        "zero",
        "Ryzen 7000",
        "fed",
        "Oracle Red Bull Racing Playseats",
        "September 27th",
        "GPU",
        "Ryzen 1000",
        "less than 60 seconds",
        "5950X",
        "AMD",
        "8 to 10%",
        "7600X",
        "Oracle",
        "L2",
        "Ryzen",
        "as much as 62%",
        "49%",
        "the day",
        "256",
        "AVX-512",
        "half",
        "2017",
        "early next year",
        "more than 175,000",
        "first",
        "EXPO",
        "TDP",
        "APU",
        "32",
        "80",
        "6",
        "AVX-512",
        "TLDR",
        "AVX-512",
        "12900KS",
        "XMP",
        "7700X",
        "Sanjay Goil",
        "18%",
        "4",
        "230 watts",
        "5.7 GHz",
        "Ryzen",
        "CPU",
        "1080P",
        "50%",
        "TSMC",
        "Intel",
        "62%",
        "5950X",
        "Alder Lake",
        "day one",
        "Ryzen 5000",
        "four",
        "4000",
        "MB",
        "over 15",
        "roughly 60-40",
        "Kubernetes Cluster Management Made Easy",
        "RDNA3",
        "up to 6,400",
        "16",
        "five",
        "74%",
        "November",
        "up to 24%",
        "LMG",
        "Ryzen",
        "Ryzen 9s",
        "October 17th to 20th",
        "DDR",
        "Team Blue",
        "at least 2025",
        "two",
        "ping pong",
        "second",
        "Ryzen 7000",
        "5.3 GHz",
        "13%",
        "7950X",
        "65-watt",
        "8",
        "Team Red",
        "today",
        "1,718",
        "7950X",
        "five and a half years",
        "PCI",
        "a few months ago",
        "Unified Observability for Microservices",
        "Walmart",
        "5",
        "AMD",
        "Xtreme",
        "next year sometime",
        "100",
        "Mickey Boxell",
        "later this year",
        "about 15%",
        "socket AM5",
        "NVME",
        "V-Ray",
        "IO"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "GPE",
        "MONEY",
        "LOC",
        "LAW",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "LANGUAGE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "DATE",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "PERCENT",
        "ORG",
        "GPE",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "NORP",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE"
    ]
}