{
    "id": "C0Yu-hkk1c8",
    "title": "Apple's Most Jam-Packed Keynote Ever!",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2024-06-11T14:00:14Z",
    "video_url": "https://www.youtube.com/watch?v=C0Yu-hkk1c8",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "apple intelligence",
        "WWDC 2024",
        "Apple TV+",
        "iOS 18 features",
        "macOS Sequoia",
        "iPadOS 18",
        "VisionOS 2",
        "Apple Intelligence",
        "Apple AI",
        "AirPods updates",
        "watchOS 11",
        "Vitals app",
        "Apple Watch features",
        "Mac mirroring",
        "window snapping",
        "game mode",
        "Apple gaming",
        "iMessage updates",
        "satellite messaging",
        "Safari highlights",
        "new Photos app",
        "AirPods noise reduction",
        "AI image generation",
        "control center",
        "app icons",
        "passwords app",
        "RCS support",
        "off-grid messaging",
        "Math Notes"
    ],
    "views": 201710,
    "likes": 8256,
    "comments_count": 870,
    "description": "WWDC brought about home screen customization, a new Control Center, and the much awaited \"Apple Intelligence.\" Download a free 7-day trial of CleanMyMac X and enter code \"SNAZZYLABS\"\" at checkout to save 20% on an annual license  or watch the 9 hour tutorial to clean your Mac yourself here:   Follow Snazzy Labs on Twitter -  Follow me on Instagram -   WWDC 2024 brings a lot of new features and updates with Apple's iOS 18, including dark mode app icons, Control Center customization, app privacy controls, iMessage enhancements, Safari Highlights, Photos app redesign, AirPods improvements, and more. It also covers changes to watchOS 11, iPadOS 18, macOS Sequoia, and introduces Apple Intelligence, an AI system that aims to understand user requests and provide relevant informationjust like failed efforts from Humane and Rabbit AI. We'll discuss the potential impact of Apple Intelligence and the challenges of delivering on its promises.  0:00 There was SO MUCH stuff! 0:20 TV+? Yeah, TV+. 1:11 Game Mode to play no games better 2:40 visionOS 2 4:08 Your Mac is a disaster 5:15 iOS 18 is HUGE 5:38 Springboard changes galore 7:05 Control Center, but actually good! 8:02 Facilitate lying, dishonesty, and secrecy 8:38 iMessage updates 9:34 A litany of small, but nice changes 10:25 Photos has been entirely redesigned 11:15 Shake, shake your AirPods 11:56 watchOS 11 13:29 iPadOS got HUGE upgrades right? .right? 15:29 macOS Sequoia 17:33 Small tvOS features like Christopher Nolan Mode 18:00 Apple Intelligencedont listen to hot-takes yet 18:31 What is Apple Intelligence? 19:17 Image generation is kinda wack 20:07 Less flashy AI features will be more useful 20:32 Apples intent engine promises were HUGE 22:14 This will be a HUGE deal or a HUGE failure",
    "description_links": [
        "https://bit.ly/SnazzyLabsCMMX",
        "https://www.youtube.com/watch?v=s2anrQz2QgY",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "I think I have CTE from all of that whiplash. This may have been the most information-dense, loaded WWDC keynote ever. There was so much great stuff, some downright creepy stuff, and then there was iPadOS, poor iPadOS. I want to break the keynote down into 3 categories: content, platform, and AI. The keynote (as is typical of WWDC now) began with a TV+ sizzle reel. Normally, I dont mention TV+, but Ive been watching more TV+ than any other streamer this past year. Other than Severance and Ted Lasso, I wouldnt say any of the shows are excellent, but theres also no garbage filler. I really enjoyed Shrinking, Slow Horses, Silo, and Pachinko. Furthermore, theyve done an incredible job at bringing a monthly rotating selection of some of the best movies of all time. Basically, at $9.99/mo, Im not sure theres a better value service out there and Im excited for it to get even better. One of the ways thatll happen is with what Apple calls InSightand, uh, its basically Amazon Prime X-Ray. It will show you actors in the scene being watched, but itll also let you add the song being played to your Apple Music librarylove that. What isnt likely to get much better is gaming. In fairness, the Game Mode that made its way to macOS is now coming to iOS and iPadOS which reduces background processes to improve frame-rates, while doubling the Bluetooth sampling rate lowers latency for AirPods and controllers. Nice. Unfortunately, while improvements have been made to the debugging tools offered by the game-porting toolkit, APIs havent changed much. This year will see the release of Frostpunk 2, Control, and Prince of Persia: the Lost Crown; however, those come weeks, months, and years after their original release elsewhere. One exception is Ubisoft who says theyre bringing the next Assassins Creed installment to the Mac, iPad, and iPhone on day-1 later this year. On the surface, this sounds awesome. On the other hand, Ubisoft makes much more risky decisions than most publishers for smaller platformsfor example, they were the biggest 3rd party developer for the failed Wii U and last to pull out. So I wouldnt necessarily let yourself believe this the turning point for Apple-gaming and I think, ultimately, Apple themselves need to acquire or sign exclusive IP to get the ball rolling. But hey, 4 AA games and 1 AAA title per year is better than what we were used to just a few years ago. OK, thats content. Lets talk platforms starting with visionOS. Having launched just a few months ago, I wasnt expecting huge moves for visionOS 2, and, I was proved correct; however, there are a few small things. Biggest, theres a new hand gesturecopied from Meta yet again. Sorry, Zuck. Open your palm, tap your fingers together, and the home screen appears. No more reaching for the button on the HMD. You can also tilt your palm down to quickly view the date, time, and other infoor tap again and open Control Center. I heavily criticized the original method in my review, so this is a nice change to see. Additionally, you can create Spatial photos from non-spatial images using Machine Learning; cool, and a bunch of small improvements like recent guest user, mouse support, home screen icon rearranging, and the Bora Bora environmentall of which should have shipped day-1, come with visionOS 2. Also, apparently travel mode, which didnt work on trains, now does. That unsurprisingly debuts alongside the release of Vision Pro in countries that actually have trains. Look, the platform is young and I think it needs more time in the oven before we can start being super critical, but I have a lot of stuff to say about Vision Pro that needs to be called outget subscribed for that video coming soon. I also need to call you out because your Mac is a disaster and if you download, CleanMyMac X, today's sponsor, it will take care of the rest. See this torturous video playing behind me? Yeah, thats 9-hours of somebody doing manually what can be done automatically in just minutes using CleanMyMac X. From 10,000 feet up, Smart Scan is the headlining featureit searches for old cache files, improperly uninstalled plists, old DMGs, etc, and nukes em. But it also searches for and removes malware in addition to freeing up memory and flushing local DNS. Thats great, but I love and use CleanMyMac X for two other features I very much love: (1) the uninstaller which has gotten super great and finds stray files that longtime crown-holders like AppCleaner cant even locate, and, (2) Space Lensa really excellent visualizer of disk space that helps you find large and lost files that Smart Scan may not nuke becauseits a user file~~~~just one thats not needed anymore. Last, use the menu app for details on your battery health, SoC usage and temperature, network info and more. With my link, you can download a free 7-day trial of CleanMyMacX and enter code \"SNAZZYLABS\"\" at checkout to save 20% on an annual license. Or, try to clean your Mac manually. Ill link the 9-hour instructional video below. iOS 18 brings with it one of the biggest updates to the platform in yearsthats ignoring all the AI stuffincluding that, this might be the biggest update EVER! For the first time since 2007, you can now place icons wherever you want on your home screen. Look out, HTC Dream, Apples coming for you! You can also move multiple apps simultaneously while in jiggle mode (innovation!), and app icons themselves can now be changed without using Shortcut hacks. When in dark mode, apps will display a dark-mode icon variant, and YOU can even tint icons now as an end user. OK, so in the Apple developer documentation, devs are instructed to provide their own dark icon variant that they can make look however they want, but they must also provide a layer that can be tinted by the user. This doesnt appear to be something the developer can choose to opt out ofit auto-tints any app that doesnt follow the new guidelines. Even alternate icons which have long been upsold as an in-app purchase must now also provide dark and tint variants. I see this being controversial amongst devs that no longer feel theyll be able to sell in-app icons for an extra cost and, more problematic, brands that have logomark guidelines against changing the color. More exciting to me is the brand-new Control Center. Ive hated Control Center since the iPhone X launched, and while its placement is still absurd, it will be getting a lot more powerful. First, control groups give you paginated separation for stuff likeHomeKit, which is great since the Home app is horrible. Oh, and iOS 18 adds Matter robot vacuum support, by the way! Dont worry, Im gonna do an ad for one eventually. These pages can be customized with resizable and relocatable controls in addition tofreakin finally3rd party controls too using WidgetKit! This is something that largely had to be hackily done by the user through Shortcuts so Im excited to see it. And guess what baby!!! No more redundant camera button on the lock screen! You will be able to change both quick-access buttons to anything you want. Sweet. Somewhat surprisingly, Apple is bringing a bunch of app privacy controls that seem a little sus. You can lock specific apps to require biometric authentication to opensmartand when locked, those apps wont send notifications, surface results in Spotlight, and more. Good stuff. Whats weird is that Apple will soon let you hide entire apps within a hidden folder thats locked within the App Gallery. Save hiding your Grindr account from your wife, I dont really know the purpose of this? But, better to offer too many privacy features vs not enough, I suppose. Updates to iMessage are pretty big, honestly. On the cutesy side, you can now animate text and emojis from within a message rather than send a whole message effect. More subtle, but with a bunch more options. You can now also tapback with any emoji you wantno more confusion from that certain someone that always sends a passive-aggressive thumbs up. Messages bring with them a send-later feature. I used a Shortcut that achieved this really poorly so native support is great. Also great? RCS support, baby! It was a throwaway line in the keynote, but will be great for those that dont use iMessageand yes, the bubbles are still green. Most surprisingly, youll be able to send iMessage and even SMS off-grid using satellite with an iPhone 14 or later. No longer restricted to emergencies, you can send messages, emojis, and tapback all from the middle of nowhere for free. Pretty freakin cool. Safari Highlights display relevant info like directions, article-specific content like Wikipedia entries or Music links, entire webpage summaries, and a fully redesigned Reader with a table of contents for longer articles. Cool! A bunch of other small changes make their way over toomail gains categorial sorting (welcome to 2011), Maps takes a shot at Gaia GPS offering offline topographical and trail data, Apple Wallet now lets you beam money via UWB without sharing personal info like phone or email (I want it to kill Venmo so badlyI hate Venmo), Journal brings insights data to help you look back in pride at all your hard work, and theres some other stuff but its boring. Not boring? The fully redesigned Photos app. Gone is the tab bar at the bottom and rejiggered is every feature. Theres honestly not that much new from a feature standpoint but its very visually refined. I mean, Collections exist in the Photos app today; however, they did add the ability to see trips by year which is funand a new Recent Days mode lets you swipe in between individual dates with all of the images and videos interlaced into a nice collage. New filtering options allow you to remove screenshots, and a new Groups section clumps together individuals who have a lot of photos together. You can get hyper-specific with your search terms thanks to Apple Intelligence (more on that later), and and sharing features are allegedly refined. AirPods have gained the ability to track head nods or shakes to confirm or deny incoming Siri alerts without having to speak anything out-loud (which is delightful), and FINALLY, theres in-call noise reduction when wearing AirPods. I cant tell you how many times Ive been somewhere noisy and had to take out an AirPod so I could raise my phone to my ear like an old manall for my caller to hear me. And thats it for the iPhone. So lets talk about the iPhones bff, the Apple Watch! watchOS 11 brings a bunch of nice quality-of-life improvements. Activity rings can now be paused so you dont lose a streak when injured or need some other break and values can even be adjusted for every day of the week on days you might not be able to hit your targets. A brand new app called Vitals does sleep tracking and analysis using multiple sensors looking at heart rate, temperature, oxygen, and movement to determine irregularities and make suggestions to help you improve sleep and recovery. Super neato. For athletes, a new training load tool looks at workout intensity and recovery overtime to let you know if youre under-training or overdoing it. Developers can now access double-tapthis should have been done a year ago. Sadly, its just double-tap. No wrist flick for cycling through actions like AssitiveTouch had. Its silly that were more than a year into this feature and its still less baked than a several-year-old, obscure accessibility feature. Apples amazing new iPad Pros just came out with insane power, so surely the new iPadOS is going to take advantage of them, right? . right? Nope! Theres a new floating tab bar which initially sounded reminiscent of a menu bar, but its not, really. Its just an always persistent hamburger menuwhich is already in most apps as a bottom bar. So this just moves location, really. It is user-customizable so thats neat, but this is not a desktop-class menu bar. Nor is there desktop-class changes to the Files app or Stage Manager. Theyre completely unchanged, which is shameful. You can now remote access grandmas iPad to provide remote assistance which seems to summarize well who Apple thinks the iPad is for. Well, grandma and students. Theres finally a calculator app after 14 years that looks yeah, that looks like a calculator. But theres also a Math Notes feature thats super slick. Not only can you write out formulas and have them solved, but you can change variables realtime and even create graphs. Super cool, though not entirely innovativeother apps like Soulver do this already. Also for heavy notetakers, Smart Script generates a handwriting model based on *your* handwriting and improves the quality of your writing as you scribble stuff out during a lecture. It even pastes text as handwriting too which is neat. But that's it... for a whole another year. Thanks for nothing, Apple. Onto the only pro platform Apple actually cares about: the Mac. macOS Toyota Sequoia bring iPhone mirroring. This is sweet. Yes, its mirroring but its also not. You can access your phone while the display is completely off and or when using StandBy. You can use your Macs keyboard and trackpad to directly control the phone. And not just that, but you also receive notifications from your phone, on your Mac, that you can open on your phone, on your Mac. And even audio passthrough works toobut dont stay on Instagram too long! This is such a neat feature and I cant wait to use it. macOS has now also copied Windows 7sherlocking Magnet, BetterSnapTool, and othersimplementing window snapping and tiling. Everything else coming to the iPhone and iPad comes to the Macincluding Math Notesjust in text form. Really, the only other Mac-specific feature is Apple Pay support on 3rd-party browsers; a surprising, but welcome move. Oh, I forgot to mention that all platforms are getting a dedicated Passwords app nowit has officially been moved out of the settings appthank goodnessand theres even a Windows app available. Once we fully embrace passkeys, this probably wont be needed any longer, but were still a long ways off from that. And thats it for platformsI mean, theres some small stuff like new tvOS screensavers and a Christoper Nolan mode that actually makes dialogue audible in his movies, but meh, the big stuff is AI baby. Apple Intelligencewhat a seriously good marketing name for real lol OK, Apple blazed through their biggest announcement in a decade in less than 45 minutes. Im not going to cover all of it todayI have a lot of thoughts already, but the reality is this stuff will be revealed in more concrete details over the coming days in WWDC developer sessions and frankly, over the next months and yearsthis is a big deal thats still mostly abstract and even numbskulls like Elon Musk are posting hot-takes that are completely misinformed and show zero due diligence. Im not gonna do that. I will explain the following, though: Apple Intelligence is the name of the system-level intent systemthink of it like Rabbits Large Action Modelbut not a scam. Its purpose is to understand your request as a user, determine if what is desired can be performed on-device or if it needs to go to the cloud, and then it picks what limited data set on your device is required to complete the request as to maximize speed and privacy. Apple Intelligence is not a replacement for Siri. Consider Siri as a chef and Apple Intelligence as a well-stocked pantry. While Siri is the one creating your meal (fulfilling your request), it is Apple Intelligence that provides all the necessary ingredients (information) for the meal's (request's) completion. Basically, Apple Intelligence is Remy the rat. Speaking of rats, Apple Intelligence facilitates the generation themyes, creepy genAI ratsbut not just rats, your mom too. Image generation was a real miss in the keynote and left many people turned off. It just flummoxed meI mean, shitty-quality AI image generation is not something I ever expected from Apple: a company so focused on creativity and so close with Pixar and Disney. The AI emojis were pretty cute and harmless, but creating generated art of other people or wrecking an Apple Pencil-created sketch in favor of a stable diffusion style cheap AI image was really lame. It left me wondering if tangible AI features like image generation were necessary to explain Apple Intelligences capabilities to the general public. Other less-flashy but more useful AI features will penetrate iOS this fall. Like recording notes and phone calls to provide transcriptions and summaries, tone rewriting of typed text, smart replies to incoming messages, message summaries, and image object removal. None of these are wholly original and frankly, its these capabilities that people typically envision when they think of \"AI\" today. Far more exciting to me are the promises of Apple Intelligence as an intent engine. They showed an example of a guy that had a request to have a meeting time changed. He knew his daughter had a performance that night and he asked Siri if he could swing it. It was implied that Apple Intelligence determined who his daughter was, found a PDF with the performance details in their iMessage conversation, determined the time and the location of the event via that PDF, predicted how long it would take to get there at that time of day from his location using traffic data in maps, and then relayed an affirmative can do to both the party wanting the meeting and a heads up to the daughter about the plan change creating calendar events for both. Thats the type of crap that will be an absolute game changer; not generative imagesbut its also the same thing Google, Humane, Rabbit, and others have promised but failed to get even close tobecause turns out, understanding intent is really frickin hard. And even when you do understand intent, finding the desired data isnt particularly easy either. They kept giving examples of hyper-specific searches within Photos. Sounds incredible, but for the last several years Apple Photos thinks my cat is a dog half the time. They showed a slideshow with a bunch of potential questions you could ask and I struggle to think of ANY service today that could reliably answer ANY of the questions well. And were to expect Apple Intelligence to answer ALL of them? Apple isnt typically one to over-promise, and Im not going to postulate on theoreticals until we have more detail following the WWDC developer sessions this week, but this will either be a black eye Apple cant deliver on that embarrasses the company for yearsor the single biggest jump in practical AI ever. There isnt really an in-between. What I do know is that as these tools become more powerful and capable, theres a logarithmic amount of frustration when users run into things that dont work as expected and or cant be doneand I hope Apples ready for that criticism. Get subscribed because we arent even remotely done talking about Apple Intelligence. In the meantime, let me know in the comments down below what you thought about WWDC. Was it everything you dreamed about? Is there anything you felt was missing? Thanks so much for watching, and as always, stay snazzy.",
    "transcript_keywords": [
        "Apple Intelligence",
        "Apple",
        "Intelligence",
        "app",
        "years Apple Photos",
        "explain Apple Intelligences",
        "Apple Intelligences capabilities",
        "Apple Intelligence determined",
        "pro platform Apple",
        "Apple Intelligence facilitates",
        "expect Apple Intelligence",
        "stuff",
        "apps",
        "feature",
        "Control Center",
        "Mac",
        "year",
        "Apples",
        "Control",
        "time"
    ],
    "transcript_entity_values": [
        "iOS 18",
        "UWB",
        "this week",
        "9.99",
        "two",
        "Ubisoft",
        "later this year",
        "3",
        "DNS",
        "the Macincluding Math Notesjust",
        "2",
        "Remy",
        "Machine Learning",
        "20%",
        "months",
        "AI",
        "Apple Pencil",
        "one",
        "StandBy",
        "Rabbit",
        "Wikipedia",
        "Math Notes",
        "AI",
        "14 or later",
        "WidgetKit",
        "AAA",
        "Christoper Nolan",
        "Collections",
        "SNAZZYLABS",
        "Wii U",
        "the Game Mode",
        "just minutes",
        "file~~~~just",
        "Apple Intelligence",
        "CTE",
        "CleanMyMac X",
        "Apple",
        "Ted Lasso",
        "AirPod",
        "Instagram",
        "Apple Music",
        "IP",
        "This year",
        "SoC",
        "the App Gallery",
        "weeks",
        "iPad Pros",
        "Mac",
        "Control Center",
        "11",
        "Gaia",
        "nowit",
        "just a few months ago",
        "every day of the week on days",
        "SMS",
        "meI",
        "first",
        "4",
        "Silo",
        "Apple Intelligences",
        "iOS 18",
        "this fall",
        "Recent Days",
        "9-hour",
        "monthly",
        "a year ago",
        "WWDC",
        "iPhones",
        "Smart Scan",
        "just a few years ago",
        "Macs",
        "Siri",
        "zero",
        "Control",
        "Home",
        "Toyota Sequoia",
        "1",
        "Windows 7sherlocking Magnet",
        "Frostpunk 2",
        "Safari",
        "iPad",
        "today",
        "this past year",
        "Soulver",
        "9-hours",
        "HTC Dream",
        "Venmo",
        "Windows",
        "a decade",
        "Pixar",
        "iPhone",
        "Zuck",
        "Space Lensa",
        "2011",
        "InSightand",
        "14 years",
        "Journal",
        "Google, Humane",
        "Bora Bora",
        "annual",
        "several-year-old",
        "less than 45 minutes",
        "WWDC",
        "2007",
        "Disney",
        "half",
        "Elon Musk",
        "iPhone X",
        "Grindr",
        "Meta",
        "iMessage",
        "AirPods",
        "Persia",
        "the next months",
        "Mac",
        "Groups",
        "that night",
        "Apple Photos",
        "Vision Pro",
        "7-day",
        "year",
        "more than a year",
        "10,000 feet",
        "Amazon",
        "the coming days",
        "AppCleaner",
        "One",
        "the Apple Watch",
        "PDF",
        "the last several years",
        "First",
        "Apple Intelligencewhat",
        "AssitiveTouch",
        "3rd",
        "Siri",
        "Apple Wallet"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERCENT",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "EVENT",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "EVENT",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "LANGUAGE",
        "TIME",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "TIME",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG"
    ]
}