{
    "id": "c2J91UG6Fn8",
    "title": "Old car headlights were all the same — which was a fairly bright idea",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2022-10-16T14:52:22Z",
    "video_url": "https://www.youtube.com/watch?v=c2J91UG6Fn8",
    "category": "Science & Technology",
    "tags": [],
    "views": 1975870,
    "likes": 67981,
    "comments_count": 7617,
    "description": "There will be highs, there will be lows, but they would always be the same. Until 1957 anyway.  Links 'n' stuff: The video on turn signal sync (if you're into that sorta thing)  And the video on red turn signals and why they're silly   Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   Oh, and look at these wonderful patrons! Lami, Christopher Aloisio, Jared Shields, Cory Davis, Nicholas Botoff, L. Z., Ryan Davis, Fisher Evans, Robert Eriksson, Brian Keith, David Jones, Stephen Parker, Rami Klein, Lisa Boban, Burt Humburg, Charles Collins, Kelly Ann Scheffer, Alex Maras, James Stevens, Justin Carvacho, Craig Carl, Chris Waldrip, Eric Fyle, Topher , Dan Mulcrone, Nessa Teal, Ted Skaff, floofpants, Gavriel State, Kyle McGovern, Chris Viola, Daniel Garrett, Hari Shankar S Menon, Marek Pitasil, Rana Chakraborty, Dyllon Gagnier, Enby-Wan Kenobi, Ben Cooper, Jerry Hsu, Henrik, Dr. Muschen, Michael Poirier, Matthew West, Ted Kye, Thomas Hopkins, Martin Collins, Dyllan Carignan, Rae Ellen Clegg, Henry Chinery, III, Jenn, Eugene Wolffe, TheHolyDuck , Truxton Spangler, Coathead, Brett Booth, David Bendit, CitizenAlias, Matt Cipperly, Daniel G, Rick Beethe, Michael Bumgarner, Dan Breakiron, Smuckers T, Winged Gunsknecht, Tully, malachamavet, Tyler A. P. Moody, Kyle Tyrrell, Dawn Anthes, CJ, Alan Of Wales, ATC Loki, James Stapleton, Kerrhyphen , Noella Grady, Joshua Newville, Zachary Juang, Martin Donlon, Jude R. Wilson, Bo Holbo Rasmussen, Graham Cattley, Justin  Cramer, Rob Eastick, David B. Hill, Dex , Justus Saul, Nikolaj Tjrnild, Carl Sehestedt, Nicholas Ethan Warren, Nathan Hevenstone, Maurice Gunderson, Sean Ashman, Justin Kietur, otherwiselovely, Thomas, Douglas Harley, Etienne Dechamps, NowIOnlyWantATriumph , Christian Ptak, Thomas McDonald, Ben Harrison, Yuriy Borisov, Robert Johncox, Theoneandonly Kyle, Verolef , ZTDaily , CloudHackIX, Jason Braun, Micah Gale, Brett Moore, Daniel, cre8, Mara Sophie Grosch, Michael Lavina, Alistair Harding, Beemer, Parth Mishra, Jessi Jay, Tony Semczuk, Chris White, Avery T Grade, Larry Barker, Amanda Banks, Nick Vanni, Jeff Nevins, Matthew Alexander LaChance, UncleDrax, Dodecalope , Kristian Hy Horsberg, Michel McClure, Charles Fairchild, Tyler Compton, kerry quinn, Troysef, Wasson An, Matthew Oliver, KimRockr,",
    "description_links": [
        "https://youtu.be/2z5A-COlDPk",
        "https://youtu.be/O1lZ9n2bxWA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Have you ever noticed that old cars all have the same headlights? Although automotive styling was all over the place and wild as ever throughout the 20th century, from 1940 onwards headlights were always the same bug-eyed circles of glass. Sometimes they might be a little smaller and thered be two on each side of the car, and by the seventies we were afforded the luxury of rectangles. But until the 1980s, every car, truck, dump truck, and bus sold in the United States had more-or-less identical headlights. What was up with that? The answer is a good idea that got turned into a regulation that would then go on to go on a little too long. Those headlights of the past are known as sealed beam headlamps, and theyre more or less the same concept as a PAR lamp, or parabolic aluminized reflector. I mean, I guess they are PAR lamps just a more specific subset. And the part that might seem slightly bonkers from today's perspective is that when you had a headlight go out, you would go to the auto parts store and obtain an entire headlight. Thats right, for all intents and purposes, this is the bulb. In fact its not exactly, look through the front glass at the right angle and youll see a halogen bulb just chilling at the base of the reflector, but theres no way to replace just that. When it burns out, this entire thing gets tossed. This lamp is sold today in 12V versions as H6024. The headlight has three pins on its electrical connector because there are two filaments: one for the low or dipped beam and other for the high beam (you might know it as the driving or main beam). Although theyre very close to each other, their position near the focal point of the parabolic reflector results in a very different beam pattern depending on which filament is lit. Now, you might be thinking, OK... so headlights used to be these big glass things and they had a combined high and low beam function. Whoop-de-doo. But you see, this wasnt just a headlight, this was THE headlight. For seventeen years, every car sold was required to have two of these things. And in the US, we wouldnt give up the idea of sealed beam headlights until the 1984 model year. Today, this might sound absurd. And 1984 was ridiculously late - our Federal Motor Vehicle Safety Standards have a long tradition of being decades behind the rest of the world, at least when it comes to lighting requirements. I mean, we still allow red turn signals in the rear! Somebody oughta make a video about how silly that is. But this wasnt entirely a bad idea, and in fact as the years have gone on this has proven to have some unexpected advantages. You might ask, whyd we do this in the first place? Well, lets rewind to the 1930s. These automobile things are starting to get pretty popular, and with every manufacturer following their own inner light when it came to marketing gimmicks (and also just finding suppliers for things), an ungodly mishmash of lighting equipment was out there. Sure, we had settled on electric lights at this point, and most manufacturers had even figured out the whole dipped beam and driving beam thing, but with no established standard... well good luck going on a road trip and finding a spare bulb outside of Schenectady. Setting aside the challenge of finding spares, theres also the issue of headlight performance. Headlights are not only critical for the driver of a car to see at night, but they can also present a hazard to other drivers. If theyre too bright or arent aimed correctly, in the eyes of another driver they can become the wrong kind of dazzling. Theres a fine line here, and although not everybody would agree on where exactly that line was (and thats definitely still true today!) with enough experimentation and a dash of compromise a standard performance benchmark was established. Ideally every car would have headlights that performed to that standard. Now, if only there were a way we could force all cars to have lighting equipment which performed to that s oh wait thats exactly what we did. Every vehicle sold from 1940 until 1957, no matter if it was a Buick, a Volkswagen, a Plymouth, or a Studebaker, needed to accommodate and be equipped with two of these things. No ifs, ands, or buts, this was the headlight. You might find some fancy extra lights from time to time, maybe fog lamps or even a wacky steerable lamp, but the basic lighting equipment was always the same two headlamps. Of course there were many manufacturers producing this headlamp, and some were probably a little bit better than others, but the design and specifications were codified to the point that no matter what you drove, your headlights would perform similarly to everyone elses, and no matter where you were every service garage and parts store had spares for your car. Because there was only one thing it could be. And it was this! Sealed beam headlamps werent just for standardization, though. In fact, the name is important and explains why we would just toss the whole thing when it burnt out. A lamp like this has a metal reflector to focus the filament's light, and one of the problems with metal is oxidation. Before the sealed-beam, reflectors in headlights with replaceable bulbs would tarnish or even rust with time, greatly diminishing their effectiveness. Sealing the reflector inside of an evacuated glass envelope meant it wouldnt tarnish, and even if somehow it did - just replace it! And a huge advantage of codifying this as the one and only allowed headlight was that all a new car needed to accommodate it was the right-size hole in its bodywork and the matching electrical connector. To secure the headlight in place a locking ring would surround the edges and clamp it to a receiving basket, and the basket could be adjusted with a pair of screws to aim the headlight both vertically and horizontally. These nubs on the face of the headlight were used for aiming. In conjunction with special tools which would rest on them, you could determine whether they were level and pointing dead-ahead. If they were, then you knew they were aimed correctly - no need to wait until dark to be sure. Frankly, this was a pretty well thought-out idea. Compliance with a standard is pretty easy to assure when the standard is basically just a weirdly particular light bulb. And automakers didnt have to do any sort of testing or certification of their headlights on new cars because, I say again, this was the headlight! They just needed a hole for it. Ok, well, two. Slap one of those aiming contraptions on the front of the car, set the screws accordingly, and that there automobile is certifiably road-legal! Well, after the taillights and other signal lights were certified. Probably some other stuff to do, too. But the headlights? That work is already done. Eventually, people (by which I mean automotive executives) grew bored of this single headlight option. Clamoring for a new selling point, automakers would eventually convince regulators of the Magic of Having Two of Them per side, that is. A new arrangement of two slightly smaller lamps: one a dual-filament lamp more or less like this one and another with a single high-intensity filament for extra bright high-beams was approved for use in 1957. And suddenly, service shops and parts stores needed to stock three different headlights. Wait, no, older cars had 6 volt electrical systems. Gotta keep spares for those, too. Imagine the contemporary curmudgeons cacophonous complaints! But we wouldnt stop there! In the seventies, nothing said \"the future!\" quite like rectangles, so rectangular versions of those two schemes were approved. A single, large rectangular lamp could be used per side, or the same quad-lamp scheme was also allowed - but rectangles. And in fact we wouldnt even stop there. If my cursory glance of this here website didnt fail me, we would eventually have eleven of these big glass honkers to keep track of. How positively gruesome! For the most part, though, a car sold in 1975 would have one of four headlight setups. It was either these big singles, round or square, or one of the two quad setups - again, your choice. Round or square. However, virtually all models switched to rectangular headlights as soon as that was permitted, not only because it met the fashions of the day but their smaller size and flat front made them more dimensionally flexible. But, now you know why old cars all have the same headlights. They had but four choices. And thats also why things like headlight covers and pop-up designs started spreading. If you had to have the same glass on the front of your car as everyone else, well to make its styling distinctive you needed some sort of gimmick! Theres only so much you can do otherwise. The last major change that would occur would be the approval of halogen lamps. Thats right, this is actually an upgrade from the original specification. Before 1979, these things really were just a standardized, oddly-shaped light bulb with a couple of tungsten filaments just hangin' out in just the right places in front of the reflector. If 1979 sounds weirdly late for the innovation of halogen lights, thats because it was. Things happening weirdly late is kind of a running theme to the Federal Motor Vehicle Safety Standards. Videocassette recorders would hit the market before halogen headlights were approved here. By the way, we dont really need to get into it but the point of a halogen lamp is that by enclosing a tungsten filament in a small envelope filled with an inert gas and a bit of iodine or maybe bromine (those elements being among the halogens) the filament can be run much hotter as the halogen molecules floating around in the hot gas will essentially capture little bits of the filament that might have sputtered off (which usually causes the filament to weaken and the glass of a light bulb to darken) and it'll just slap it back onto the filament which is pretty wild. The upshot is they can create a brighter and whiter light than ordinary incandescent lights and they also dont lose brightness as they age. Theyll just, at some point, fail. Europe got to have halogen headlights in 1962, but not us. Oh, they were much too bright. Now, sealed beam headlights were not unique to the US but we clung onto them for too long. Requiring them until 19 freaking 84 was frankly embarrassing. And to make matters worse, the limits on their use were quite strict. A key disadvantage of sealed beam headlights is that they kind of wreck the aerodynamic potential of a vehicle design. Now, a simple solution to this problem is to place them in a recess behind a sculpted clear cover which matches the contours of bodywork. But we didnt allow that! As a matter of fact, we used to, but in 1968 it was decided - Nope! These have to have to be completely unobstructed when in use. That, combined with the fact that the rest of the world was moving away from these meant that there was a rather awkward period where imported cars had lets just call it, suboptimal faces. Styling consequences aside, though, it wasnt all bad. The same fundamental benefit was still there - sure, maybe Toyotas got a different headlight on their Corollas sold in Japan, but to make it road-legal in the US they didnt need to design a new headlight they just needed to put the right socket in place, And, uh, try their best with bezels to make it look less goofy. Eventually, though, regulators would finally see the light and allow automakers to have their fun and design sculpted headlights with replaceable lamps. Granting Fords petition in the summer of 83, the 1984 Lincoln Continental Mark VII would become the first US-market car with custom composite headlights. In the coming years, most other cars would quickly follow suit and the sealed beam headlamp was relegated to base-model trucks and vans, plus commercial vehicles here and there. Of course today, headlights have gone from a thing you just have to have to a full-on statement piece in car design, with brands having particular fun with daytime running light signatures. And some brands, like Hyundai, are even bringing things full-circle (or should I say square?) with very retro-inspired quad DRLs. Youre right, this was a huge draw for me. And I mean theyre also the front turn signals! How could I resist And its not just styling thats better these days. High-intensity discharge and LED technologies allow for much better nighttime visibility through drastically improved performance. Weve had some issues with glare as those technologies roll out - the regulations here are frightfully lenient on that front. Im glad organizations like the IIHS are starting to comprehensively review car headlight performance. It seems like a thing we probably should have started the moment we let automakers start fiddling with their own designs. But, with their trademark timeliness, theres actually good news on the glare front. The National Highway Traffic Safety Administration has approved for the first time adaptive beam technology which can selectively dim portions of the driving beam, blocking out small regions to reduce glare for other drivers while maintaining high illumination for you everywhere else. Its basically like if your headlights were high resolution projectors and a camera says ooh! theres a car there, block out that part but everything else stays bright! So its like you have your high beams on all the time but other drivers dont even know it! That amazing tech has been on the European market since 2009. But it took thirteen years to get approved here. I mean, at least they beat their previous seventeen year record for approving halogen lamps! [through gritted teeth] However, while Im definitely not about to suggest that we go back to the dark ages, adding more technology to headlights as we do it now is not without consequences. As a matter of fact, simply moving away from the sealed beam wasnt without consequences. I bought these headlight modules for a 1996 Honda Civic back when I made my video on turn signal synchronization. They were surprisingly inexpensive at $80 for a pair, but theyre also not a genuine Honda part. I have no idea how well these might actually perform as headlights. They are DOT compliant... supposedly, but having prior experience with aftermarket replacements like these, that doesnt mean much. And you wanna know why I have prior experience with aftermarket replacement like these? Because this is plastic. And yknow what happens with plastic when its exposed to ultraviolet light over the years? Bad things, thats what. My folks old minivan started getting cloudy headlights after about a decade on the road, as many vehicles do these days. And back in the day I embarked on a journey to replace them. I found a similarly inexpensive aftermarket pair on eBay, and after the absolute chore that was removing the cars front fascia and extracting the modules, replacing them, and buttoning it all back up, I had a much-prettier-looking Honda Odyssey staring back at me but with only marginally better headlights. The new modules had a completely different beam pattern from the old ones, with particularly mediocre high-beams, and no matter how I adjusted their aim they just werent that great. And heres a fun thing about sealed-beams: theyre made of glass. And that means they dont oxidize and yellow with time as is frightfully common with polycarbonate headlights. Now to be fair, there were bespoke headlights like this with glass lenses. Maybe some cars still have them today but its definitely not common these days. Oh, but yknow another really cool feature of these? If they should break, a replacement costs less than $15. No need to hunt down a specific module for a 2nd generation North American market Honda Odyssey - just pop into ONapazone and get yourself a new one. Heck I got these at Walmart. And in case youre thinking sealed beams just dont perform well honestly theyre not half bad! Ive driven cars with three of the four common setups: quad rectangles, dual rectangles, and dual roundies. And frankly? To my admittedly subjective eyes, they were all better than average. As someone who spends a good deal of time on country roads looking out for deer, the throw of the high beams from either of these is superior to most modern cars Ive driven. And Im not kidding you, in fact, these are arguably a bit better at lighting up the open road than even my new car. They struggle a LOT, though, on the curvy windies - sealed beams have a very focused spot which is great for straightaways, but start curving even slightly (or even just crest a hill) and youll wish for more broad coverage. So Id still rather have my new cars modern LED setup on balance, but its not as if sealed beams are terrible. Because, and heres the fun thing, replacing the entire headlight when it goes out means well youre getting an entirely new headlight every time it goes out! And these actively got better over time, in fact Sylvania even makes Silverstar versions of these. Think about cars made prior to 1979 - they had terrible headlights by todays standards. Not even halogen. But, because they all have the same headlight sockets as any other contemporary car, I could slap one of these in and suddenly they have headlight tech from decades in the future! And its not just halogen tech, oh no. Because these things are so large, there are now full-on LED drop-in replacements with modern optics, DOT approved and everything. No need to get all sketchy with a definitely-not-road-legal HID kit, just a simple headlight swap and a car from 1950 can have headlight tech from 2022. Or at least, like, 2010. Yeah OK this would totally ruin the look of that car, but for a fleet vehicle? Why not? In the end, it makes sense that weve mostly moved on from this concept. Some new vehicles, typically big things like buses and trucks, are still getting made which use sealed beam headlamps, but its pretty rare to see these days. It seems just as common to find a box truck roaming around with some off-the-shelf car headlight module slapped on, like, uh, for instance these UPS trucks with headlights from an Oldsmobile Alero. But frankly, it always seems odd to me when designers go through that trouble. Just stick a sealed beam in there with an off-the-shelf indicator and side marker! Road legal with literally none of that trouble, and it usually makes the vehicle look much better, too. I mean, I see what you were going for here, but this other truck is much more friend-shaped. Will new passenger cars get sold again with sealed beam headlights? Probably not. But I do kinda hope we bring something like them into the future with us. Modern car headlight modules often have nothing serviceable in there at all, and theyre not cheap to replace. Theres a lot to like about them, and with LEDs we can hope that they last the life of the car. If they were designed right they should but the real world tends to have other priorities. Sure, in 2022 mandating that cars all use the same headlights aint gonna fly. [music fades in] But you have to admit this wasnt the worst idea. [music ends abruptly] Just kidding! I have a piece of trivia for you before the bloopers. You may know of my absurd little car I bought on a whim in the before times. existing entirely as an exercise in excessive eccentricity, the Nissan Figaros vintage design mission incorporated headlights that are meant to look like sealed beams but in fact they are not. And that is actually a massive bummer. See one of those things many people dont realize when they import a vehicle from a wrong-hand-drive country is that the headlights are backwards. Headlights on the low-beam setting are generally not symmetrical. They are designed to throw more light towards the shoulder and less light towards oncoming traffic. Often this is accomplished through a slanted beam cutoff, and thats the case with the Figaros headlights. But, see, thats backwards! Its supposed to be driven in Japan where they drive on the left side of the road, so its throwing more light to the left and less light to the right. That makes driving it at night here in the US absolutely terrifying. Visibility is atrocious and I once got to within just a few meters of a pedestrian on the sidewalk before I even saw them. They were on the sidewalk so it wasnt a close call or anything but that scared the crap out of me. I dont drive that car at night anymore. And its not an aim issue! As a matter of fact, the car's high-beams are great! Poor timing once caught me out in the country at night in the Figaro and when I could use the high beams? No problem seeing anything! But as soon as there was oncoming traffic, dipping the headlights limited visibility on the shoulder so much that I slowed down to 40 miles an hour whenever I couldnt keep the brights on. Its that bad. The car just doesn't throw any light to the right. And, since the car IS throwing light to the left at oncoming traffic, I kept getting brights flashed at me. And frankly I deserved it. If the car had sealed beam headlights and they were the right size I could just swap them out for US-spec ones and be done with it but unfortunately thats not really an option with this car. There is a kit which is meant to do this, but, see, the glass of the headlights curves with the shape of the body - thats actually the giveaway that these arent really sealed beams. So while you can fit a US-spec sealed beam like this in those holes, they'll never look right. And since this is a silly little toy car which must be among the least practical cars ever built, and its old, small, light and barely crashworthy, thus kinda risky to be driving in the first place but especially at night, methinks Ill just leave it as is. But anyway, I'm just telling this story so that the next time you get an itch to import a set of JDM headlights for your car - Don't do that. Theyre backwards, and you will regret it. OK, now the bloopers. belatedly smooth jazz Sometimes they might even be a little smaller and ooh. No. The headlight has three pins for uh, ohh [thud] [wheeeeeeee] ...ridiculously late. Our federal boodeuh beuhh bleewuuUURGH Our federmal good gravy Our federmal why am I having a hard time saying that? I bought these headlight modules for a 1996 Honda Civic back when I ma this is upside-down, isnt it? Of course it is. Of course it is. Theres a fine line here, and although not everybody would agree on where exactly that line was, and thats definitely still true today ... (yells) Of course there were many manufacturers producing this headlump. Headlump? [laughs] [yelly-grunt] Their smaller size meant that the front of them the beh de fwe nehminehm But, you see, this wasnt just A headlight. This [taps the glass] Yeah, so they were a pretty BRIGHT idea, huh? A really ILLUMINATING concept. Those 1940's folks were really LIGHTING THE WAY, right? It was a real LIGHT BULB moment. On PAR with the best. HALOGEN.",
    "transcript_keywords": [
        "headlights",
        "sealed beam headlights",
        "headlight",
        "car",
        "sealed beam",
        "beam headlights",
        "beam",
        "cars",
        "car headlight",
        "light",
        "sealed",
        "things",
        "sealed beam headlamps",
        "beams",
        "halogen",
        "car headlight module",
        "fact",
        "time",
        "headlight modules",
        "thing"
    ],
    "transcript_entity_values": [
        "IIHS",
        "40 miles an hour",
        "80",
        "the 20th century",
        "two",
        "Lincoln",
        "Honda",
        "European",
        "1940",
        "Nissan Figaros",
        "1996",
        "1984",
        "1979",
        "four",
        "one",
        "84",
        "the summer of 83",
        "Alero",
        "1962",
        "Hyundai",
        "daytime",
        "12V",
        "Civic",
        "Headlump",
        "6 volt",
        "about a decade",
        "2022",
        "Japan",
        "Sylvania",
        "1957",
        "the coming years",
        "first",
        "Figaro",
        "these days",
        "DOT",
        "the 1980s",
        "three",
        "2009",
        "the seventies",
        "the Magic of Having Two of Them",
        "less than $15",
        "seventeen years",
        "Studebaker",
        "decades",
        "1950",
        "previous seventeen year",
        "Volkswagen",
        "today",
        "JDM",
        "eleven",
        "North American",
        "Today",
        "Toyotas",
        "the United States",
        "1975",
        "Walmart",
        "Schenectady",
        "the 1930s",
        "2010",
        "ONapazone",
        "Plymouth",
        "19",
        "the Federal Motor Vehicle Safety Standards",
        "The National Highway Traffic Safety Administration",
        "half",
        "the years",
        "Whoop-de-doo",
        "thirteen years",
        "eBay",
        "Europe",
        "Silverstar",
        "Figaros",
        "Continental Mark VII",
        "Buick",
        "US",
        "Oldsmobile",
        "just a few meters",
        "1968",
        "Corollas",
        "night",
        "2nd",
        "Federal Motor Vehicle Safety Standards",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "ORG",
        "DATE"
    ]
}