{
    "id": "C4dfddnTG30",
    "title": "Switching To The iPhone 7 Plus...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-09-20T20:49:28Z",
    "video_url": "https://www.youtube.com/watch?v=C4dfddnTG30",
    "category": "Science & Technology",
    "tags": [
        "iphone 7 plus",
        "iphone 7 plus review",
        "iphone 7",
        "apple iphone 7 plus",
        "7 plus",
        "apple iphone 7",
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "apple",
        "apple iphone",
        "iphone 7 review",
        "iphone 7 plus vs",
        "vs",
        "iphone 7 vs",
        "android",
        "galaxy s7",
        "s7",
        "galaxy",
        "iphone 7 unboxing",
        "iphone 7 plus unboxing",
        "7 plus unboxing",
        "iphone",
        "best",
        "smartphone",
        "plus",
        "iphone7",
        "iphone 7 vs 7 plus",
        "ios 10",
        "iphone 7 black",
        "apple inc. (publisher)"
    ],
    "views": 3728661,
    "likes": 65988,
    "comments_count": 6716,
    "description": "Unboxing every iPhone 7 -   I'm switching to from the Samsung Galaxy S7 to the iPhone 7 Plus as my \"daily driver\" smartphone. The iPhone 7 Plus is the largest phone I've ever used as my daily. Check back for my update in a couple weeks for my thoughts on the pros and cons of switching from the Galaxy S7 to the iPhone 7 Plus.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/vv_MLOAytl0?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "I used to do a little... mini series, here on the channel, well I guess I'm still doing it. It's just that I haven't updated that series in a while It's myself, making a commitment to switch to another phone. I don't mean, like, for a day, I don't mean for a video, I mean as my daily driver. It means in my pocket, on a daily bases. There's probably no device in my life like my smartphone, right. There's none that you interact with on such regular bases Maybe my workstation but this thing goes with me everywhere now you probably noticed that on the table sits a Galaxy S7 This S7 was actually the last switched video video with the exception of that dumb phone challenge which as you know, well so today i'll be switching from my tried and tested much-loved S7 to the iPhone 7 plus, this is important because i'm switching OS's OS's O-S-S truthfully this is really the only way to get feedback from me on the pros and cons of day-to-day life with these different platforms and different devices so what am I excited for with this guy right here the iPhone 7 plus a few things to be honest this camera it might be the best in the business right now so starting from this point forward the point that you watch this video all my Instagram photos Twitter photos and so on will be uploaded from this device for your evaluation should follow me in those places if you don't already it's a bigger phone I've never been a huge fan of giant phones this is my first step into the plus round and this thing is a big phone I told you before it's pretty slippery so i'll probably put a case on in fact I have a comprehensive 7-plus case video and 7 case video coming up after this so stay tuned for that i'll probably put a little case on it honestly I'm excited to really dive deeper into this camera module and see what I can do with it the slightly improved audio coming out of it of course experimenting with iOS 10 the display is supposedly a little bit better and also you know to see if I can get used to this new home button home button that no longer clicks things I'm afraid of iMessage some people love iMessage in fact for some people iMessage is reason that they're locked into the iOS platform, when your a person that switches phone so often it can be a bit of a nightmare iMessages is meant to like live on one sim card in one place without complications also just email right like being a gmail user and having multiple gmail accounts that i manage there's an abundance of ways to do that natively on Android might be a little bit more of a headache on iOS the critical moment android to iPhone, S7 to 7 plus here comes the sim card the ceremonial moment oh my goodness this is nerve-racking right now! Ooo its official, pick that up Jack, here we go your boy just officially switched to iPhone! Okay so check back here i'm going to update you when I feel like I've gotta a real grip and will not be touching this guy the old phone am I going to stay switched!? or am I going to switch back!?... The saga continues Wu-Tang",
    "transcript_keywords": [
        "video",
        "phone",
        "switched video video",
        "case video",
        "iPhone",
        "case",
        "Instagram photos Twitter",
        "case video coming",
        "video video",
        "iMessage",
        "bit",
        "switched",
        "iOS",
        "mini series",
        "switched video",
        "series",
        "home button",
        "sim card",
        "photos Twitter photos",
        "Android"
    ],
    "transcript_entity_values": [
        "daily",
        "iMessage",
        "Android",
        "Jack",
        "a day",
        "iMessages",
        "OS",
        "one",
        "first",
        "7",
        "the iPhone 7",
        "iPhone",
        "Wu-Tang",
        "Galaxy S7",
        "S7",
        "Instagram",
        "iOS 10"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "EVENT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT"
    ]
}