{
    "id": "c6x0AGNd1A8",
    "title": "M2 Pro Mac Mini unboxing and review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-01-23T14:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=c6x0AGNd1A8",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 198001,
    "likes": 6568,
    "comments_count": 424,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(bright upbeat music) - Today, we have the brand new M2 Mac Mini in the studio, and it's time to unbox. The new Apple silicon chips have been completely life-changing for my workflow. And I know it's not just me, because all of my other creative friends who have upgraded to the M2 devices, it is actually night and day between the Intel MacBooks. So I'm super excited to try this out with the new M2 chip. And also, like, the MacBook Air M2 was so impressive. I just, I can't even. (bright music) Oh, look at you. Now, it does look very similar to the previous versions, but sometimes, you know, when you mess with perfection, like, don't. Oh, wow. (sniffing) This smells so good. Bottle this up and spray it on me, please. I just want to eat it. (laughs) There it is. We've got our two USB-A ports, and we've got our two Thunderbolt 4/USB-C ports. We've also got our HDMI, ethernet, and our power. Like, this is so small, it's just wild that, like, you can run an entire production business off of this little guy right here. We've got our power adapter here. Like, look how nicely I'm opening this compared to what I did to the MacBook. Beautiful. Just shining, shimmering, absolutely splendid. Let's set it up and talk about it. (upbeat music) Now I'm gonna tear down my setup here. This is my setup that I use pretty much for absolutely everything. I have my previous MacBook all docked here, so we're gonna tear it down to just use the Studio Display. Oh, this hurts my heart. I have it all set up so perfect. But you know, what goes up must come down. (upbeat music) These monitors are so heavy. (upbeat music) Like, this right here is what makes all of the magic happen. If you want me to explain it, I don't even think I could. (laughs) I don't wanna disrupt anything, but I'm gonna have to. (upbeat music) My Mac Mini desk setup is all complete. So this is the Mac Mini with the M2 chip. Now, you can upgrade to the M2 Pro, which would give you four Thunderbolt ports, but this one only does have two. But it is nice, because if you do have it connected to the display, this will give you some extra USB-C ports. So let's test some things out. I wanna play some games. I wanna do some editing, photo editing, and also test out Apple's new Freeform app. I actually haven't even tried this yet. I've seen demos of it, but I've been really excited to try it. But first things first, I just wanna kind of see how responsive the apps are. So I'm actually downloading a few things right now. I've got some games. I've got Final Cut downloading. Let's just open up everything here and see what happens. I mean, it's all very, very fast. Like, it's just, everything opens. Some of these apps have never even been opened yet, so it's like, \"Hello, what's going on?\" Wow. Okay, we've opened everything in the Dock. Let's open Photoshop, too, while we're at it. Oh, that opened very quickly. That all happened very, very fast. Like, this Mac Mini, for people's everyday normal tasks, you're gonna be flying and cruising by, because everything is so fast. We've also got Lightroom. Now, Lightroom is definitely known to be pretty processor-intensive, so we're gonna add some photos in here. Actually, I have a bunch of photos already. Oh my goodness, Camera Camp is in here. Okay, we've got some photos. These are all straight from the A1, RAW photos. I mean, it's super responsive. (laughs) Like, there's no lag in editing anything. Add a little clarity. Oh yeah. All right, now I'm gonna just paste that there, paste that there. Great. Okay. (uplifting music) Very fast. I mean, I'm pasting all of those attributes. It's rendering it really quick. Scrolling through images. (keyboard keys clicking) So nice. And then what about if we want to put this into Photoshop? Go Edit In Photoshop. There it is. Okay, I'll save it. That says \"Hi,\" by the way. (laughs) I wanna go back to Lightroom. And there we go. It's beautiful. (laughs) It's really, really nice. Okay, so it's definitely passed the Lightroom test. That all happened very, very quickly. So I'm just gonna quit out of this, and let's hop into maybe a game or two, shall we? Now the cool thing is you can connect Xbox controllers, PlayStation controllers, Nintendo Switch controllers. This is so nice on here, because I've really only played this on my phone. Oh, Sneaky is hungry. Let's go visit this little bear. Hello. Look at this little lost raccoon. Do you wanna be my friend? Let's go to the campsite. Get a little snack, shall we? (gasps) Oh no. Who could it be? Oh, we're in trouble now. The Ranger. He knows I'm not allowed here. Let's get some food. A little ketchup, a little hot dog. I'm gonna put that right in my baggie. Let's put that in my bag. Gimme that last hot dog. That's mine. This obviously is not a huge, processor-intensive game, but it still is running very, very smooth. Let's try another game. This is \"Lego: Castaways.\" I love \"Star Wars.\" I don't know if anyone knows that or not. Is anyone aware? Is this new information? Oh my gosh, I can make my own character! Okay, we're shooting in 8K. I can't be wasting time. I love Lego games. (Fae Doktut speaking gibberish) I did not pay attention to what she told me to do. I mean, this is running great. Are we surprised? No, because Apple silicon is impressive. Here we go. (Lego bricks breaking) All right, so I feel pretty happy about the Lego game. This is super fun. Now, as a video editor, this is a test that I've been very excited to try out. So we're gonna open up Final Cut. Now, the only files that I have right now available are all 8K. We shot this entire video all in 8K, and I have no idea how this is gonna react. I don't know if it's gonna work, but we're gonna just open up this project that is an 8K project, and let's see what happens. Here we go. I'm very nervous. And today we have the brand new M2 Max MacBook Pro. Yeah, I know. I can't believe it either, but it's here. But it's running perfectly fine. It's running really, really well. Oh my goodness. So this is multicam footage. Now, obviously, the design of this is very similar to the previous version. So if you were to just look at this, you would've no idea that it is the brand... Well, I'm shook. (laughs) What? This is 8K, right out of the Sony A1. So let me just layer on some 8K footage on top of each other and just see how that works. Okay, that's like three streams of 8K. Okay, we finally, we got a little bit there, a little stutter. It's so smooth. So my editing test definitely has surpassed my expectations. I feel like I should probably edit something in 4K, but like, if this is running this well in 8K, then why do I even bother? (stammering) Cannot compute. Okay, well, that's still playing perfectly fine. I'm, like, upset 'cause, like, I was like, \"There's no way. We probably shouldn't test 8K on the Mac Mini, because I don't think it's gonna be able to handle it.\" Well, if I could print out my words and eat them, I would, (laughs) because that was what I was debating before I even set this up. I was like, \"Shoot, I don't have any 4K footage on this drive.\" Hmm. Well, we're done here. I'm impressed. Let's test out Freeform. Tyler, would you open up your app, please? - [Tyler] Sure. - Here we go. So Freeform is a really, really interesting app. Now, this is not something that's processor-intensive, but it is something that I've been really wanting to test out. So you can share a board with people. You can just start collaborating. So Tyler is over there on his phone doing some things. Oh my gosh. I see. Oh look, you're tracing over it. It's happening real-time. So I'm gonna be like, \"Wow, that was nice. I'm gonna move it.\" (laughs) Did it move on your screen? - [Tyler] It did. (Justine gasps) - I'm gonna move it back. Add photos. Oh, and I can add a link. This is fun. I'm gonna take my horse to the old town I don't remember that song. Is that a ranger? - Yeah. - With a little sheriff? - [Tyler] A little sheriff and his horse. (uplifting music) - So that, my friends, is the new M2 Mac Mini. I am actually way more impressed with this than I originally thought. I mean, the fact that I was able to run that 8K footage, three streams of it, to be exact, and it basically just handled it like a champion. And this is, again, the baseline Mac Mini. Like, there's no upgrades to this. This is the cheapest version that you can possibly get. And I'm so impressed. When I see things like this, it just makes me even more excited for the future. Because if we're here now, like, can you even imagine in a couple of years, like, what we're gonna be able to do? The accessibility for creators and people. It's just the barrier to entry is, at some point, gonna be almost non-existent. Like, the technology has come so far, and I am so excited about it. So thank you, guys, so much for watching. I hope you guys enjoyed this. If there's anything else that you'd like to see me test out, please leave them in the comments below. And if you haven't already, please subscribe. Hit the bell to be notified when I post new videos, and I'll see you guys in the next one. Bye. (bright upbeat music)",
    "transcript_keywords": [
        "Mac Mini",
        "Mac",
        "Mini",
        "test",
        "Mac Mini desk",
        "baseline Mac Mini",
        "Lightroom",
        "photos",
        "open",
        "things",
        "nice",
        "excited",
        "running",
        "MacBook",
        "game",
        "Apple",
        "USBC ports",
        "ports",
        "Photoshop",
        "fast"
    ],
    "transcript_entity_values": [
        "MacBook",
        "MacBook Air M2",
        "Camera Camp",
        "M2",
        "M2",
        "Mac Mini",
        "Apple",
        "Justine",
        "Ranger",
        "Sony",
        "4",
        "Today",
        "Photoshop",
        "Star Wars",
        "the Studio Display",
        "PlayStation",
        "three",
        "Xbox",
        "Lego",
        "A1",
        "four",
        "Freeform",
        "Final Cut",
        "8",
        "the Mac Mini",
        "Lightroom",
        "M2 Mac Mini",
        "Nintendo Switch",
        "today",
        "two",
        "Shoot",
        "Tyler",
        "the Intel MacBooks",
        "HDMI",
        "Mac Mini",
        "the M2 Pro",
        "first",
        "Final Cut",
        "M2 Max",
        "Freeform",
        "USB",
        "a couple of years",
        "Lego: Castaways"
    ],
    "transcript_entity_types": [
        "FAC",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "NORP",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "FAC",
        "CARDINAL",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "WORK_OF_ART"
    ]
}