{
    "id": "c97ILI7Tsk4",
    "title": "iPhone X Teardown! - Screen and Battery Replacement shown in 5 minutes",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-11-05T17:00:27Z",
    "video_url": "https://www.youtube.com/watch?v=c97ILI7Tsk4",
    "category": "Howto & Style",
    "tags": [
        "iPhone X Teardown",
        "iphone x repair",
        "iPhone x",
        "apple iphone",
        "ios",
        "smartphone",
        "technology",
        "mobile device",
        "new tech",
        "cool tech",
        "flagship smartphone",
        "replacement",
        "screen",
        "battery",
        "iphone",
        "new iphone",
        "apple",
        "repair",
        "replace",
        "fix",
        "broken",
        "how to",
        "lcd",
        "digitizer",
        "iphone 10"
    ],
    "views": 4264514,
    "likes": 73884,
    "comments_count": 3092,
    "description": "Watch as I show the teardown of my new iPhone X in 5 minutes. Fix your iPhone yourself with repair guides and parts from iFixit!:  Replacing the screen of an iPhone X is a bit more simple than previous iPhones. There is less hardware to transfer over from the broken screen to the new screen. Apple has made things a bit easier with the removal of that fingerprint scanner.   The iPhone X battery replacement is also relatively easy with its magical pull tabs holding it down. It is one of the most uniquely shaped batteries that ive ever seen! Would you ever take apart your iphone 10? let me know!   iPhone X Durability Test Video:   Current iPhone X Pricing on Amazon:   Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   SEND ME STUFF:  PO Box 6836 1721 North 400 East Logan, Ut 84341  ANYTHING SENT TO THE ABOVE ADDRESS WILL NOT BE RETURNED. If you want me to make a video on a product, feel free to send it. But there is no guarantee of a video unless agreed upon beforehand via email.  JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ifix.gd/2zNvp1N",
        "https://youtu.be/twY6zUj-t20",
        "https://amzn.to/2SiXfus",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "It's time to tear down the iPhone X. This video will show the basic screen replacement, along with how I swap out the uniquely shaped battery inside of Apple's newest flagship. Accidents happen, and things wear out and break. So it's good to know to how get things back up and running. Let's get started. [Intro] Getting into this phone is pretty similar to the iPhone 7 and iPhone 8, but it does get a bit easier once you are inside. The same familiar two pentalobe screws are at the bottom of the phone. I'll have a little tool kit linked in the video description for you, along with all the parts needed to complete these replacements. After getting these two screws out, I like to warm up the screen a little by softening the ip67 water-resistant adhesive under the iPhone 10 display. I'll use a suction cup and a pry tool to lift up on the glass a little and get my metal pry tool between the plastic edge of the screen and the metal edge of the frame. Then I can slice along the edge of the phone, just underneath the glass, to detach the rest of the adhesive. When the screen is mostly free, it doesn't pull down this time to unlock, but instead just folds right open like a book. The ribbons you see on the right side of the phone are extremely fragile, so don't put any pressure on them. Apple did simplify the process with only one metal bracket this time, which is nice of them. Still using the same y triple zero screws as previous iPhones. I'll remove the 5 screws holding that metal plate down and then keep them organized off to the side because they definitely need to go back in the same hole they came out of. It was also nice of Apple to put all the connectors in one solitary row for us here in the center. The connectors we care about during this video are first, the battery connector. Making sure to use a plastic pry tool when lifting this off as to not short out the battery. Then we can detach the two screen ribbons, one at the bottom right, and the other at the bottom left side of the connector row. And the last guy is for the earpiece and microphone. This also detaches like a little Lego from the motherboard. And here is the screen. Quite a bit simpler design now that we don't have the fingerprint scanner at the bottom. These OLED displays are definitely going to be more expensive than the LCD iPhone screens of the past just because the part itself costs a lot more. I'll have the current pricing in the description like always. It does fluctuate with time and will get cheaper as the phone gets older. The new screens will probably not come with the earpiece attached, so there are 3 more screws when you transfer over. I'll pull these out, being careful to keep track of the little gold niblet on the top screw. Then I can fold the speaker down and away, allowing me to pull up the microphone and the other small sensors. These ribbons are extremely fragile, so go slow and be careful. Now that I have the speaker out, it really does depend on how the new screens ship, but you might also need to transfer over some of the clear plastics, but that's not too big of a deal. Historically, Apple has not made things easy for people trying to fix their own phones. With the old error 51 and fingerprint scanner hardware issues, they've made things pretty complicated. But with this screen we shouldn't have any issues. All of the phone's face unlocking hardware is still tied to the phone and not a part of the display, so thumbs up for that. With only the display and digitizer connectors left on the screen, we should be safe. I'll put the screen back together before jumping onto the battery replacement portion of this video. It's pretty straightforward with all of the sensors going in the same slots they came out of and then the earpiece speaker folding over back on top of them. There's the three y triple zero screws holding everything in place. Make sure to get that gold niblet back on that center screw. I'm not sure exactly what it does, but it's probably important. Remember, the display is one of the most expensive parts of this phone, so be nice to it. Now let's take a shot at removing the oddly shaped battery. Since the screen is already off and the battery disconnected, I'll grab the first magical pull tab at the top of the battery and slowly pull it out from underneath. These are very fragile, so go slow, plus that sound is delicious. At the bottom of the battery there are 3 more stubby pull tabs. These are hard to get at, but if you have a pair of wide tip tweezers, that would be ideal. With my needle tips I'll just grab the edge and then pull it out as best I can with my fingers. If you do fail at pulling out the magical pull tabs, you'll have to commence the Pry of Shame. Another trick that might help out is to grab the tweezers and twist the pull tab around the tip of the tweezers to get a better grip. And now the battery is out and this is the most unique battery I've ever seen inside of a cellphone. Kind of interesting design choice. Hopefully the replacements aren't too expensive. Like always, I'll have them linked in the video description. Below the battery we can see the wireless charging and the metal frame of the phone. If you're replacing your own battery, you'll want to use some double sided tape to keep things from jiggling around. Personally, I'm going to be opening this phone up more in the future, so I'm skipping my adhesive for now. With the battery in place and the 3 ribbons coming from the screen I'll reattach to that center connector bridge, I can finally plug in the battery. It goes in last just to be safe. I'll test the phone out before adding that metal plate just to make sure everything is working. If there are lines going through your display, or it's gray, or nothing shows up, it might just be a bad connection. Re-seat those little Lego connectors and try again. My phone is turned back off and the metal plate slides into place with it's five screws. All of these are different sizes so they need to go back in the same hole they came from. Finally the phone can fold shut just like a little book and clip down into place. And everything is still working. I'll toss the bottom two pentalobe screws back in and it's ready to go. If you enjoyed this video, or if it helped you out, hit that subscribe button and come hang out with me on Twitter and Instagram. Let me know in the comments if you have any questions. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "battery",
        "phone",
        "screen",
        "pull",
        "screws",
        "back",
        "metal",
        "bottom",
        "video",
        "iPhone",
        "Apple",
        "LCD iPhone screens",
        "pry tool",
        "display",
        "screens",
        "things",
        "connectors",
        "pry",
        "edge",
        "tool"
    ],
    "transcript_entity_values": [
        "LCD iPhone",
        "two",
        "zero",
        "only one",
        "first",
        "three",
        "the iPhone 7",
        "3",
        "5",
        "Apple",
        "iPhones",
        "five",
        "Twitter",
        "Instagram",
        "one",
        "ip67",
        "Lego",
        "51"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}