{
    "id": "c9BrubDp1rE",
    "title": "How to make a MASSIVE Oreo Cookie!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-04-23T16:42:54Z",
    "video_url": "https://www.youtube.com/watch?v=c9BrubDp1rE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "huge oreo cookie",
        "oreo cookie",
        "how to make oreo cookies",
        "how to make an oreo cookie",
        "big oreo cookie",
        "how to make",
        "how to bake",
        "how to bake an oreo",
        "how to bake oreos",
        "homemade oreos"
    ],
    "views": 718895,
    "likes": 21915,
    "comments_count": 1844,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? Welcome back to my kitchen. Today, we are making a massive Oreo cookie. Now I tried this once before, but it didn't really work out so well, so I thought that I would go about this a different way. I got these really cool silicone molds, and we're gonna try that out and see if this works. I found this recipe online, and there was a problem with the recipe because it was all in grams, and so I have to convert them to things that I can understand. So let's get started. Here's the things that we're gonna need. 200 grams of soft butter. 250 grams of dark brown sugar. Two large eggs. Two teaspoon vanilla extract. A half teaspoon of sea salt. 200 grams of plain flour. 50 grams of cocoa. One teaspoon baking powder. Oh, there's a piece of my hair. That's cool. So now we're gonna mix our brown sugar and butter together. In you go. Time to mix. Oh, it's not plugged in. (laughs) Take two. (mixer whirring) (soft music) Okay so our sugar and butter is mixed together nicely. Now we're gonna put in two eggs. (mixer whirring) Continue to mix. (soft music) Okay that looks fantastic, so now we're gonna mix in the rest of our stuff. (soft music) Now let's mix this up real good. In you go, bud. Nice, slow. Okay, we need to turn this up because I don't have time for this. (mixer whirring) Oh yeah, that's perfect. So now it's time to make our cookies. These are the molds that I got. I got them on Amazon. I'll put a link in the description if you would like to get them, as well. This is it. It's just a big cookie mold. I'm concerned, though, because this text is so small and there's so much detail that I don't know how that's gonna work out, so I guess we'll find out very shortly. Let's see what happens. (soft music) Okay now let's get this all spread out to the sides. So I'm gonna bake these on here because these are kind of flimsy, so I want to be able to easily take them in and out of the oven. Preheat your oven to 350 and bake for about 25 to 30 minutes. I would definitely check on them, and then let them sit for about an hour after they're done. Now it's time to make our Oreo cookie icing. We've got our butter, we've got our powdered sugar, we've got our Tahitian pure vanilla extract. Oh, fancy. So I'm not really sure the measurements because, again, these were all in grams and my conversion skills, mm not that good. So we're just gonna kinda guestimate, which is my favorite way of doing things, which is the complete opposite that you should do with baking. Jam this in there. I probably should've used the stand mixer, but now I'm here, so I'm already just, I'm just gonna do what I do. I gonna use my best kitchen judgment on how much I need. Maybe we should start with a cup and a half and see where that gets us 'cause you can always add more. Put in just a little bit of this. Geez, I feel like I should double this. This isn't going to be enough for my taste. Hey, can you throw me one of those spatulas, please? Thank you. What have I done? Have I messed it up? This is not icing. Maybe it is. I mean, I guess when you think about like I'm not making cake icing. This is Oreo cookie icing. Does it look like little tiny balls? This looks like Dippin' Dots. Can you Google me another recipe. (laughs) I'm receiving a phone call from Morocco. Leave me alone. I'm clearly busy. To be fair, this actually feels like the consistency of like the Oreo cookie. - [Nick] Three cups of icing sugar. - Oh, shoot, but we're almost out of it, though. - [Nick] And then four to five tablespoons of coffee cream 18% and up. - Coffee cream? - [Nick] This might be. - You know what we could do? Let's put a little of this in. - [Nick] And it's got more milk. - Yeah, I think that's what we needed. (mixer whirring) Oh my gosh, this smells lovely. Maybe I needed to switch my beaters 'cause it's definitely a tools problem. It's not a me problem. - Pew. - Thank you. Maybe I need a smaller bowl. Blame the tools, Justine. I'm gonna give it just a taste. - Good? - Oh my gosh! - Yeah? - I'm so happy with how this turned out. This was the key. This was the key! Nick, you're a genius! - [Nick] Thank you! - This looks pretty good. Now here's the real test. How are the cookies gonna turn out because that is questionable. I was very skeptical while I was putting these into the pan, but I'm thinking that they might be okay. I'm a little bit worried, though, because I don't know if they got inside of these crevices or not. The only way to find out is, I guess, just go for it. So let's see. I put so much spray on this. (soft music) Okay, well, you know, there's a little bit left inside. That's okay. This looks good. This looks good. I'm happy so far. There is definitely a lot left inside, but, you know, I don't really know how they expected this to work out. That is some very, very tiny font. Okay, here is our Oreo. There's still the top of it, but we're gonna ice this first. And just, wow, I don't know I can wait to taste this. I think this might be the first time I'm excited to taste something that I've made, so let's hope it's actually good. This is such a thick consistency because it's not like normal cake icing. It's Oreo icing. We're gonna use all of this. This is double, triple stuf. And here we have it. Now it's time to place the top cookie on. Fingers crossed that it's gonna work out because so far, things have been going very well. Oh my gosh, I'm so nervous. Please come out and be beautiful. Maybe I'll just like drop it on. Yes! Here it is! It looks like it actually worked out! Okay, time for the placement. Oh my goodness. Did I just make something successful? Go to your calendar right now and mark today as the day where Justine has finally succeeded at baking something awesome. (gasps) (upbeat music) Okay, I gotta find a good spot. Okay, ready? Oh my gosh, so crunchy. Have you ever seen me this happy? The only time you've ever seen me this happy is when I have a new Apple product. Nick get over here. Get over here immediately. - [Nick] Wait, I have a question now. You said you're gonna eat it like a regular Oreo, so we need to dip it. - In milk? - [Nick] Into milk, yeah. - I don't have any milk! - [Nick] You don't have any milk? You can get like - I can get some. - [Nick] a bucket. (refrigerator opens) I'm teasing you. - Wait! - I was joking. - No! We gotta get milk! I think we need to dip it in a milk. - In a milk? - Hold on, wait. Don't touch it! Don't touch it 'cause I'll know 'cause I'll see the footage. - Okay, she said it earlier, Oreos are like my thing. I'm an Oreo connoisseur. (door opens) - [Justine] You're not Laved up. - Oreos are like my thing. (crashing) (laughs) - Where? Where, how do you, how do you just manifest that? - We need to get milk! - Why? - Would you like to take a bite first? - Yes, please. - Okay, and then we're gonna-- - I've just, I've been sitting back here with my mouth watering the whole time. - And then I'm going to order milk. Do you you want? - Yeah, maybe a. Oh my god, I'm so excited. - Oh, this is gonna be so great, we're gonna dip it. I'm gonna order some milk on Amazon right now. - I'm so excited. - How many gallons do you think, two gallons? - Yeah, I think two would do it. I'm so excited. Oh my gosh. - I know. It's incredible. - What? - You can't have anymore. - One little more, please? No, alright. - Yeah, you can have one more bite. - Yes! - You're allowed. - Just a little. - We have to dunk it in the milk. - Thank you. - Enjoy. Well guys, thank you so much for watching. I hope you guys enjoyed this. Leave me some comments below on what you'd like to see me make next. And if you did enjoy this and if you are proud of me, today marks a national holiday, so everyday on this day it will be Justine Did Something Right Day. So if you want to celebrate my special day, use #NationalJustineDidSomethingRightDay. I'll see you guys on Twitter and Instagram and Facebook and wherever else it is that you guys use social media things. (soft music) We've got our milk. We've got our cookie. Now it is officially an Oreo party. So lets take a dunk, see what this party's all about. Mmm, displacement. (soft music) (milk dripping) (laughs) It just feels weird. (soft music) Okay, well I guess I'll just. Oh my god. It's so incredible. I'm so happy right now. (soft music) Yeah. When anybody asks me ever again Justine, what do you do for fun? I'll send them this gif. (milk splashing) I'll see you guys later. That's it. (soft music)",
    "transcript_keywords": [
        "Oreo",
        "Oreo cookie",
        "milk",
        "Oreo cookie icing",
        "Time",
        "yeah",
        "good",
        "cookie",
        "grams",
        "icing",
        "guys",
        "sugar",
        "Justine",
        "mix",
        "things",
        "massive Oreo cookie",
        "gosh",
        "put",
        "happy",
        "Oreos"
    ],
    "transcript_entity_values": [
        "18%",
        "Morocco",
        "Dippin' Dots",
        "Amazon",
        "one",
        "about 25 to",
        "Apple",
        "Justine",
        "Tahitian",
        "Two",
        "Oreo",
        "Instagram",
        "Today",
        "200 grams",
        "the day",
        "Laved",
        "mm",
        "Twitter",
        "Google",
        "50 grams",
        "A half teaspoon",
        "Nick] Wait",
        "Oreos",
        "two gallons",
        "350",
        "250 grams",
        "today",
        "two",
        "Three",
        "Nick",
        "this day",
        "Facebook",
        "first",
        "about an hour",
        "four to five tablespoons",
        "One"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "NORP",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL"
    ]
}