{
    "id": "CAhEmKP_gPI",
    "title": "A FREE FPS Boost!?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-06-11T02:37:41Z",
    "video_url": "https://www.youtube.com/watch?v=CAhEmKP_gPI",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Radeon",
        "AMD",
        "RX 6000",
        "GPU",
        "graphics cards",
        "OpenGL",
        "FPS boost",
        "pc gaming",
        "gaming GPU",
        "PC components",
        "PC build",
        "RDNA 2",
        "RDNA 3",
        "Zen 4",
        "RX 6950 XT",
        "RX 7000"
    ],
    "views": 357498,
    "likes": 21893,
    "comments_count": 561,
    "description": "Visit  to get started learning STEM for free, and the first 200 people will get 20% off their annual premium subscription.   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 it's spatial 0:09 AMD GPUs getting a boost 1:35 Xbox Game Pass on Samsung TVs 2:40 Summer Game Fest 2022 4:03 Brilliant 4:47 QUICK BITS 4:52 'PACman' unpatchable M1 flaw 5:28 Windows 11 pushed to unsupported PCs 5:59 Insteon saved by its users 6:26 Symbiote Linux malware 6:51 Vielight light therapy for GAMERS   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.brilliant.org/TechLinked/",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/GiYN8",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- What I love about tech news is it doesn't care whether you just woke up. It says, \"Look at me, look at me! Computers!\" And you know, that is special. (man laughs) AMD talked some big talk yesterday, promising 50% more performance per watt for their upcoming RDNA3 GPUs, and 25% more for Ryzen 7000 CPUs coming later this year. But if we're gonna talk performance per watt, then you're gonna want to hear some more exciting news that slipped under the radar this week. A user called Ayxerious on Twitter posted about an insider graphics driver for RDNA2 GPUs that brings a massive free performance boost in OpenGL games and applications. The driver was speculated about a few weeks ago by RedGamingTech, which is a way easier gamer tag to read. But now it's actually available to download, and a couple of Minecraft players have already boosted their frame rates from 18 to 72, in a graphically demanding area of the, not so graphically demanding game. And from 550 to over 900 in the less demanding one. - [Man] It's over 9 - Hundred! - [Man] Hundred! - Tell that to your grandma. - [Man] She'll be so impressed. - Oh, your frames are so high. (man laughs) OpenGL is using a ton of games, but also professional applications like AutoCAD, Blender, and After Effects. So, when this driver drops to the public, Radeon 6000 series graphics cards are gonna have a lot more pep in their step, which is great because as we all know, we've been feeling a little self-conscious lately and also times are tough. I don't wanna spring for a 7,000 when the steps of my 6,000 are just so damn peppy. - [Man] Well, you just want free stuff. - And pep, free pep. Microsoft has not announced their Xbox Cloud Gaming dongle, but they have announced that you won't need one if you have a new Samsung TV, which is great because I don't think the dongle will even come out with the screen, or at all actually, it's probably never gonna come out. - [Man] It's basically just a little dongle. - [Host] Samsung's entire 2022 lineup will come with the Xbox Game Pass app, which will let you stream games from the cloud using any Bluetooth controller. And soon, you'll even be able to stream non-Game Pass Games that you own, GEForce Now style, which is a cool style, (man laughs) way better than karate. Microsoft also had some other related announcements. Its Edge browser will unsurprisingly have optimizations like clarity boost to make it the best choice for cloud gaming with Game Pass. And the company is working on bringing back game demos. - [Man] Wow! - On discs? - [Man] Uh, no. Uh, maybe? - So close. Remember when you didn't have to buy a console game to figure out if you actually wanted to play it or not. I do. And it was way better. It was way better back in the day. The older time that I'm old enough to remember was the best time. (man laughs) Today sucks. Don't have kids. And good old Geoff Keighley would like to talk to you about his lord and savior of video games at this year's Summer Game Fest, where a boatload of game trailers were unceremoniously deposited. - [Man] Actually, they were ceremonious. There was a whole ceremony. - It's ceremonious. - [Man] Yeah. - Ritualistic. - [Man] Sorry. - [Host] You got the vanilla ones like Call of Duty: Modern Warfare 2, showing off fancy weather simulation and the Callisto Protocol, aka Dead Space 4, space zombies again, but you also have Stormgate, a co-op strategy game made by StarCraft 2 veteran devs. That does indeed make you wanna give my life for Aiur. - [Man] Good. - [Host] There's yet another alien shooter called Dark Descent. Capital A Aliens? - [Man] Aliens. - Like xenomorphs? - [Man] Yes. - They're just movies. And a dishonored, but with demons game called Witch Fire. While Fort Solis, and the somehow still in game development, Routine, are new entries in the abandoned space station horror genre. Spoiler alert! Things are not what they seem. (men laughing) That's truer than ever for Skate Story, a game about a skateboarding demon made of glass and pain. Uh, if you bail on a skateboard as much as I do, this won't be a long game. - [Man] Regular - He's on a mission to swallow the moon. And that's just a tiny taste of Game Fest, so check out PC Gamers Roundup, linked to the news sources. - [Man] I swallow at least a few moons a day. No big. - Riley do the thing. - [Man] Alright! - Now it's time for quick bits brought to you by Brilliant, the website and app that makes learning stem accessible and fun. It's like those sweet fruity smoothies with kale blended in. You don't even know you're eating vegetables. Brilliant is about active learning, so it's chalk full of interactive visual problems to solve. Plus there's no harsh grading, long lectures, or strict time limits because those are not fun. See how that works? Check out the everyday math course and refresh your knowledge of foundational math topics like percentages, fractions, and basic geometry, or dive into any of the 60 other different courses because you feel like it. Join today using our link below and the first 200 people will save 20% off a yearly subscription. That's Brilliant.org/TechLinked Come on, get smart. - Quick bits don't care what you think, but they do care about what you say. Please be respectful. MIT researchers have discovered an unpatchable flaw in Apple's M1 chips, somewhat similar to the specter and meltdown exploits found in x86 chips. Apple thanked the team for finding the flaw, but didn't seem too worried about it because they were probably too busy rolling around in their giant piles of App Store money. - [Man] It doesn't matter. - Another reason to buy M2! (men laughing) Because the attack would work by guessing something called a pointer authentication code, the team named it PacMan, which has gotta be the most fun part of being a security researcher. - [Man] It's like, it's like, adopting a puppy, you know? - Yeah, or discovering a comment. Microsoft accidentally allowed some unsupported PCs to upgrade to windows 11 this week. (man gasps) - [Man] No! - Windows insiders posted on Reddit that they were installing the OS on their dirty unwashed machines, powered by heretical processors like the Intel Core i5-7300U. (men barfing) - No you! One user said, \"All seems good after updating.\" but Microsoft is quick to point out that this was a bug and the requirements have not changed. Hey, we do not, not change them further. Insteon, which is a smart home company, and not some kind of Pokemon evolution suddenly shut down operations a few months back but have suddenly come back online thanks to a small group of passionate Insteon users, also known as Pokemon trainers. I'm keeping this going. They managed to acquire the company! Wait, we can do that? Is this a Dow? Is this a crypto thing? Guys, do you wanna, do you wanna buy Google? WallStreetBets saved GameStop. Anything's possible. We could buy the U.S. Constitution. In case you thought Linux was safe from horrible software flaws, it's not. Security researchers that Intezer and the Blackberry Threat Research and Intelligence team, - [Man] Blackberry? Like the phone? It is. - They have teams. (men laughing) have discovered a Linux malware called Symbiote that can infect all running processes without leaving any sign of its presence, except that you'll have bangs. (man laughing) And a company called Vielight? Thinks it's found a way to make you a better gamer by blasting light up your nose. Vielight's transcranial intranasal photobiomodulation device has too many syllables and applies light therapy directly to the forehead. (men laughing) No, to the blood vessels in your nostrils, which can increase nitric oxide, improving oxygen- oxygenation, and thus energy levels. Energy levels win games folks, and as long as you don't turn your camera on in the discord chat, you'll be fine. - [Man] Yeah, it's over. - This is so- I'm not redoing this. We have now expanded both our energy and tech news for today, so come back on Monday for more, because I'm pretty sure it'll help you gain better somehow. - I'm gonna shave my nostril hair this week just to open the channels. - [Man] You're gonna be so much faster, in life. - I'm probably gonna get chafed just from the Earth rushing through. (man screaming )",
    "transcript_keywords": [
        "game",
        "Game Pass",
        "games",
        "Xbox Game Pass",
        "Game Pass app",
        "called",
        "game called Witch",
        "Pass Games",
        "Pass",
        "graphically demanding game",
        "nonGame Pass Games",
        "company",
        "back",
        "performance",
        "driver",
        "Xbox Game",
        "demanding",
        "demanding game",
        "demons game called",
        "game called"
    ],
    "transcript_entity_values": [
        "Aiur",
        "the Blackberry Threat Research",
        "yesterday",
        "Summer Game Fest",
        "the day",
        "Ryzen 7000",
        "9 - Hundred",
        "year",
        "the Callisto Protocol",
        "a ton",
        "Linux",
        "One",
        "Intelligence",
        "a few months",
        "60",
        "Pokemon",
        "20%",
        "Geoff Keighley",
        "Witch Fire",
        "later this year",
        "MIT",
        "Stormgate",
        "Google",
        "Minecraft",
        "Today",
        "Reddit",
        "Radeon 6000",
        "200",
        "Blender",
        "18 to 72",
        "about a few weeks ago",
        "6,000",
        "Ayxerious",
        "11",
        "Twitter",
        "at least a few moons a day",
        "Microsoft",
        "Samsung",
        "Xbox Cloud Gaming",
        "Edge",
        "Fort Solis",
        "Linux",
        "2022",
        "yearly",
        "StarCraft 2",
        "App Store",
        "Vielight",
        "the Intel Core",
        "AMD",
        "first",
        "M1",
        "GameStop",
        "Intezer",
        "25%",
        "Call of Duty: Modern Warfare 2",
        "PacMan",
        "Pokemon",
        "Symbiote",
        "Monday",
        "OpenGL",
        "this week",
        "the U.S. Constitution",
        "7,000",
        "AutoCAD",
        "50%",
        "Earth",
        "Dead Space 4",
        "Dark Descent",
        "Skate Story",
        "550",
        "Game Fest",
        "Apple",
        "today",
        "Samsung TV"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "DATE",
        "FAC",
        "CARDINAL",
        "DATE",
        "LAW",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "LAW",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "LOC",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "ORG",
        "DATE",
        "ORG"
    ]
}