{
    "id": "cB4PM4QGcLw",
    "title": "5 Apple Prototypes You've Never Seen in Person - Vintage Apple Vault #7",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-07-18T20:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=cB4PM4QGcLw",
    "category": "Science & Technology",
    "tags": [
        "5 Apple Prototypes You've Never Seen in Person - Vintage Apple Vault #7",
        "Apple prototypes",
        "Macintosh prototypes",
        "rare Macs",
        "prototype Mac",
        "Acorn iPhone",
        "iPhone prototype",
        "W.A.L.T.",
        "WALT",
        "Apple WALT",
        "PowerBook prototype",
        "Q51",
        "Apple Q51",
        "Q51 PowerBook",
        "G4 Cube",
        "Power Mac",
        "Macintosh",
        "Mac",
        "Apple History",
        "20th Anniversary Macintosh",
        "iPad Prototype",
        "Power Express 9700",
        "Hap Plain",
        "Steve Jobs",
        "Vintage Apple Vault",
        "PowerBook XXXX",
        "old Macs",
        "vintage Macs",
        "Computer Clan"
    ],
    "views": 133814,
    "likes": 3687,
    "comments_count": 274,
    "description": "Today, we'll look at 5 Apple prototypes that you've likely never seen in person. We're talking about Apple products that exist in single-digit batchesreally rare stuff. We may show a bonus 6th item, too  Get more vintage Apple tech!   Dont miss future tech videos!   Check out this Mac SE episode (and more prototypes)!    Support the show on Patreon, and help keep our content free for other techies (plus get bonus content, and get your name in the show credits!)   Like the CC on Facebook   Follow the CC on Twitter    Special thanks to our guest: Hap -  Click the link above to see more awesome prototypes from Hap.  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    THE AWESOME PEOPLE BEHIND THIS EPISODE Brent Penrose (PenroseFilms) Dylan Hopf Ean / Chewie Hap Ken  Amazon links are powered by the Amazon Associates Program.  #AppleProductHistoryCC #Apple #ComputerClan",
    "description_links": [
        "http://applevault.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/clan2Xe9MEl",
        "http://patreon.com/computerclan",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://bit.ly/clan2XJ4XzP",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- [Ken] Hey, bonus episode time. Welcome back to the vault. We're gonna take a look at five Apple prototypes. For the most part, these were scrapped. But some of them did evolve into marketed products. And some of them got radically changed before they sold on the market. So pack your bags because we're going to California to meet up with Apple prototype collector, Hap. (majestic music) - [Hap] My prototype collection probably has at least 250 pieces in it. 2006 Mac mini prototype. Super, super early 20th Anniversary Macintosh. Japanese LPGA PowerBook. Color Classic. Various prototype first gen iPads. Dual dock iPad. So Pat so one dock, two dock. - Oh wow. - So the W.A.L.T. stands for Wizzy Apple Lifestyle Tablet or Wizzy Active Lifestyle Tablet, depending on who you ask. It was essentially to be released in about 1994. It was some combination of a fax machine, email, phone, integrated through a touch display. There's a couple of them that have come out in the wild, three that I know of including my own. To the capacity that the touch screen, I'm still having some issues with, I don't know if that's a driver thing or what the issue is there but it does have an ADB port so if I plug a keyboard/mouse into it, which I just generally use for my TAM because it's all in one, I can get it to work. Somebody actually that I bought it from used it at Bell South in the area that they lived and they were using it currently or actively in the field and then I guess they scrapped the project. So it's running a very specific custom version of HyperCard. A (mumbles) process now that I've got it fully functional, trying to get to with some people in San Francisco to archive the data from it because if that hard drive crashes or fails, which I did have to repair in order for it to actually start working, then that would be really bad. Why it was scrapped is a tough one. Unless you really get to talk to the engineers on the project, I mean, we'll talk about another product here that I know why it was scrapped, but in this particular example, I don't know if they thought that it was computing kind of too much with the Newton, which was a product that was just going to be released, was a little smaller, had its own power supply, was able to be used without needing a power cord itself. Again, they served two different purposes. The W.A.L.T. had the capacity to do speaker phone to make telephone calls whereas the Newton didn't. That was more of like a PDA-style as notes, emails, dictation, which the W.A.L.T. did as well. But it was basically the W.A.L.T. being, the product I'm talking about is essentially just a hacked together PowerBook 100 conglomerate of components kind of stuffed into a case that they've reworked, packed some components together in a very raw style way. I mean, there's a lot of literally electrical tape holding these components like in place and covering components so they don't ground out and stuff. The Power Express 9700 was essentially the predecessor to the Power Mac 9600. It was bigger, badder, more expandability. I do, according to my engineer buddy that worked on the project, know why that project was killed. Steve Jobs, who had just come back, we all know how Steve Jobs felt about expandability and users being able to customize their machines and add things to it and essentially that was what Steve Jobs did not want, which was expandability, user upgradeability, serviceability. Had six PCI slots, a CPU that you could just pull it and out to do a swap on. SCSI, IDE, floppy, CD-ROM. My buddy told me basically that, according to him, that they were almost close, very close to having the final design if not basically the final design ready to go, and a lot of people came back from their Christmas basically with a note on their desk that said that your project has been scrapped, please return any and all of the products and/or components to the Apple disposal team essentially and we will essentially tell you what project you're gonna start on next. But like to the point where they had a final working product and Steve pulled the cord on it. With the blue and white and you know, the mirror door drive and the quicksilver, I think that yeah, to a certain degree that there was expandability. And I think at a certain point, that if Steve had it his way, that would have never been that way but there was probably a little bit of meeting in the middle that needed to happen there because you know, they only had so many USB ports. They only had so many FireWire ports and they were designing these products for professionals who had to be able to connect hard drives and cameras and other devices that they were trying to market themselves to a very kind of niche market of video editors, photo editing and that type of stuff. And those computers needed to have the expandability and integration for those devices who was, the individuals they were catering to that market. So Acorn iPhone 2G prototypes. When they were created, I suspect probably either late 2005, somewhere in 2006. They don't share many similarities from what the production phone was. They're all black, they have plastic screen versus glass screens. They have matte screens versus glossy screens. They have raw bezels versus polished vessels, but not necessarily hardware they makes them special. Yes, they're all black and they have some components that are different, and it's really the software on those that shows the two different ways that Apple was essentially fighting internally about which way to go. I mean, the iPod at that point in time was probably if not their biggest product so do you keep going with that scroll wheel integration and something that most consumers are very comfortable with or do you push that and go down another path, which is ultimately where we ended up. But can you imagine sending a text message, a long, or not even a long, a sentence, with having to scroll through each each back and forth to do each letter? I mean, that would have been ridiculous. You would have taken minutes to send a two or three-sentence text message. So the dual 1.5 GHz G4 PowerBook is really one of the coolest things that I have in my collection. The unreleased stuff is really rare and very hard to come by. From what I know about it is that that case that it's in, it's a very raw acrylic case used for very early rapid iteration prototype development is the only case or anything that has empirical and factual evidence that Apple was actually working on a G5 PowerBook. And the Q51 project is the code name for the G5 PowerBook. And it's fabled, people have talked about them but nobody has ever actually seen one or really been able to substantiate any evidence that Apple worked on one. I would imagine that the board for that was probably in that acrylic housing at some point in time. Where it ended up, who knows? But what is in there instead, which is also equally interesting and rare, is a red board dual 1.5 GHz G4 configuration. It's actually two physical processors. So it's not a single dual core. It is two individual 1.5 GHz processors on the board. Fastest configuration that they ever released to the public was a single core 1.67 GHz machine. With those models, as well as the very early Intel units, there was a lot of heat issues. I remember I had one of the first Intel laptops when I was in college, and that thing would get so hot that if you left it on for a while and put it on your legs, I could easily see you getting a pretty decent burn. So that was kind of why Apple scrapped the G4 PowerPC configuration and specifically the G5. The G5s ran super hot and putting that form into a computer, as well as the amount of power that it used would have been really pretty impossible. So it's a really cool machine. Its Geekbench scores are far superior to any G4 computer that was released to the public. It's a neat machine. Product Cube, G4 Cube with a speaker. Picked it up when I was working and doing the stuff with the Cube upgrades. I bought a Cube, just looked like it was in good condition. A lot of sellers on eBay don't take like pictures of every single angle, so it was kind of a crap shoot, just looked like it was in good shape so I bought it and I kind of started poking around on it and noticed that there was some stuff that looked a little bit different. And then the most telltale one was, one of two things, was one, when I looked on the back, very poorly somebody, it looks like they've used a paper clip scratched out the word prototype. I mean, you can still visibly see it. They didn't even do a decent job at it. And then when I flipped it over and opened it, it had some different stuff on the inside. A red board for the VRM chip. But then when I really looked at the bottom, there was this little round thing kind of where the handle was. You could see through the mesh a wire going to the front of the board and I noticed that there was an actual speaker that was on the bottom. But what's interesting is where I saw the wire go for the speaker, it actually still has it on all the production ones. It's the two little front wires on the logic board towards the front where the CD-ROM area above that goes. Well, I guess it would be more of the hard drive area. But there's too little connectors that are stand offs that got a little 90-degree bend in them that are still on all the boards. I have no idea why they got rid of the speaker. Cubes did come with speakers. - [Ken] That's one of the very few Macs, if not the only like sold Mac that doesn't have a built-in speaker, yeah? - Yeah, I mean, I'm trying to think. I think you could be right. I mean, I'm even going back to Macintosh Portable, the IIc, SEs all over the beige boxes, G4s, G5s, Power Macs. Yeah, that's actually a good point. I think it might actually be the only Mac that doesn't have a speaker that was built-in. Hmmm, never thought of that. Yeah, I think you're right. PowerBook XXXX is one that they did use in \"Independence Day.\" I don't think if it's the same thing. I don't know if that's the exact one that they used, but I don't know, it's kind of a weird thing. I mean, obviously Steve wasn't there when that movie was made, and I don't know why they wouldn't have just put the model number on there versus making a specific plaque. Obviously it's a prototype, but why go to the extent of silk screening a totally random series of letters versus just putting the model on there? I mean, they came in subsequent numbers, 53, 54, 55. Usually, when you get stuff like that or have other things like that that are before they've come up with a number, usually they just leave it blank. So why they would take the time and energy to come up with a machine and a silk screening process for something that was just for the sake of it? I have no idea. - [Ken] So there you have it guys. Five awesome Apple prototypes. And thank you so much to Hap for helping make this bonus episode possible. Please check out his website for more from him. And if you wanna see other unreleased footage that was a part of this bonus episode plus other goodies, check out Vintage Apple Vault on Patreon and pledge now, and you'll get access to some of that great stuff. Thank you in advance for your support. And I'm also curious to know what your favorite Apple prototype is, even if it's one we didn't cover. Feel free to drop me a line down below. And if you have suggestions for future products you wanna see on the show, let me know about that too. But for now, that's all I have for you. Thank you so much for watching and I'll see you in the not-too-distant future. (uplifting music)",
    "transcript_keywords": [
        "Apple",
        "Apple prototypes",
        "Apple Lifestyle Tablet",
        "Wizzy Apple Lifestyle",
        "Steve Jobs",
        "prototype",
        "Steve",
        "kind",
        "stuff",
        "power",
        "project",
        "essentially",
        "speaker",
        "product",
        "scrapped",
        "Mac",
        "board",
        "components",
        "back",
        "PowerBook"
    ],
    "transcript_entity_values": [
        "USB",
        "late 2005",
        "Product Cube",
        "The Power Express 9700",
        "FireWire",
        "at least 250",
        "Wizzy Active Lifestyle Tablet",
        "Acorn iPhone 2G",
        "PowerBook XXXX",
        "54",
        "G5",
        "iPads",
        "Wizzy Apple Lifestyle Tablet",
        "Power Macs",
        "two",
        "Apple",
        "Bell South",
        "eBay",
        "Christmas",
        "Independence Day",
        "about 1994",
        "90-degree",
        "PowerBook",
        "1.5 GHz G4 PowerBook",
        "PowerBook",
        "six",
        "iPod",
        "Hap",
        "2006",
        "W.A.L.T.",
        "the Power Mac 9600",
        "Macintosh",
        "iPad",
        "Japanese",
        "Mac",
        "Patreon",
        "1.5",
        "Five",
        "53",
        "Pat",
        "California",
        "CPU",
        "G4",
        "1.5 GHz",
        "PCI",
        "1.67 GHz",
        "first",
        "one",
        "SCSI",
        "G4",
        "San Francisco",
        "HyperCard",
        "Steve Jobs",
        "G4 Cube",
        "55",
        "G4s",
        "100",
        "LPGA",
        "Macintosh Portable",
        "Newton",
        "VRM",
        "five",
        "20th",
        "Geekbench",
        "Cube",
        "IDE",
        "Vintage Apple Vault",
        "Intel",
        "G5s,",
        "three",
        "G5s",
        "Steve",
        "Macs"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "EVENT",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG"
    ]
}