{
    "id": "cbV3Tfso-R4",
    "title": "Joystick Like CONTROL On A Keyboard?! - Wooting two HE Analog",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-08-04T18:59:29Z",
    "video_url": "https://www.youtube.com/watch?v=cbV3Tfso-R4",
    "category": "Science & Technology",
    "tags": [
        "Keyboard",
        "Analog",
        "Joystick",
        "Control",
        "Pressure",
        "Sound",
        "Keys",
        "Switches",
        "Gaming",
        "PC",
        "Digital",
        "Adjustable",
        "Wooting",
        "Wootility",
        "custom",
        "feel",
        "weight",
        "force",
        "Nicholas",
        "Unboxing",
        "Stand",
        "display"
    ],
    "views": 366832,
    "likes": 15478,
    "comments_count": 974,
    "description": "Save 10% and Free Worldwide Shipping by using offer code CIRCUIT at   The Wooting two HE Analog keyboard simulates gradual movement and control like a joystick. It's not 100% perfect but it's something that can make driving and flying a bit easier in games if you only have a mouse and keyboard.   Check out the Wooting two HE Analog Keyboard at   Buy Microsoft Xbox Series X Controller On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 0:33 - Unboxing and overview 1:49 - Assembly 2:39 - First impressions 3:22 - Sponsor - Ridge Wallet! 3:44 - RGB and typing impressions 4:32 - Wootility software impressions 5:37 - Playing games  6:46 - Conclusion",
    "description_links": [
        "https://www.ridge.com/CIRCUIT",
        "https://lmg.gg/tZlR7",
        "https://geni.us/XIVRAlR",
        "https://geni.us/YlxT2",
        "https://geni.us/12L8R5",
        "https://geni.us/BvNf",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Use this cutout to create a keyboard stand for those juicy pictures. (people laughing) Wait what, this is actually... Hold on, hold on. That's actually like pretty cool. The thing about keyboards that kind of sucks is that you don't get that little bit of control that you get with analog thumb sticks. You've got to like tap a key, really lightly a whole bunch, instead of being able to just push a stick forward, ever so slightly to walk right up to the edge that you want to walk up to. So what I'm really excited about with this Wooting Two HE keyboard, is it's analog. Which is really cool. Sorry, I got distracted by the switches. They're all off, they're right here. That's it, now here's the key caps. Okay, so that sucks, I gotta install all the key caps. Look, we've got an accessory pack. We've got a puller, a cable and four switches. I got to judge the cable too, real bad. Oh, this is actually really impressive. Oh, the switches and the key cap puller. Yeah, they're great, I mean, but once you have like five of them. So these are the switches. These are those Lekker switches. So I guess they give you four replacements. Yeah, what I really want to show you is the bottom of this thing. It's just got these little side clips, but no pins because it actually uses magnets. Get rid of this box. Oh, it's kind of cool though. There's like a little... You don't own a Wooting until you share it with others on our discord or tag us on Instagram. Use this cutout. Use this cutout to create a keyboard stand for those juicy pictures. Wait what... This is actually, hold on, hold on. You gotta see this, you gotta see this. So you can like, yeah. Can we get scissors? Cause we can make a keyboard stand with this thing. Yeah, it's a serious pain that I have to actually cut this out because like the cardboard is, you know, it's thick. There you go. Very cool. Can we open it and just like flip it on? No, there's no way. Yeah, there's no way. So they come in like pretty stuck in, they use the same cross pattern on the top. So any key caps that you have, custom or just, you know, like Jam K sets or whatever, you can put that from your keyboard onto this one. It's got like a little cable routing space down here. Oh and the blue stabilizers. Yeah, these stabs are look nice too. They're linear. So if you like click keys or tactile switches, it's not for you, sorry. It sounds okay. The real test though is like the space bar because a lot of stabilizers, just sound bad. I think I know what it is, why people can't... Oh, I don't know if they pre lubed them or what, but they actually don't rattle. (upbeat music) The overall sound is like pretty decent. (keyboard clicking) It's a little too high pitched for me. I like a deeper like thud to it. - Can you make the sound for us? - Like a thud, thud, I don't know. 185, okay, so this thing is almost $200. (keyboard clicking) It sounds okay for that price range. Like I guess what you're really paying for is the analog feature on the switches. The layout's fine. It's your standard full keyboard. Flexes like a little bit. But it feels okay. The cool thing is you can actually change, not the force, but like where it actuates. Okay, so we've got all our key caps on, it sounds okay. Let's try plugging it in but before I do, here's a message from our sponsor Ridge Wallet. It's a compact wallet to keep your pant bulge down. You know, you got to hate that. I don't even use a phone case on my phone to keep that down. It's got RFID blocking plates to keep everyone from stealing your info. They come in over 30 colors and styles, including carbon fiber and burnt burnt titanium. Get 10% off and free worldwide shipping by using Offercodecircuit at www.ridge.com/circuit. Oh (beep), it's got RGB now. Sorry, I'm trying not to swear. I got a mouth like a sailor from working in a butcher shop for three years. Oh, what I do like is it shines through the clear housing, on the switches really well. So I usually type about 120 words a minute at like a hundred percent accuracy. It doesn't feel bad, it feels great. I'm just doing real bad. Yeah, that was terrible. 90 words a minute. Dirt, it's got Dirt on here. So this is cool, it's not giving me keyword prompts, it's giving me controller prompts. Okay, so here's what I wanna see. So like... Okay, so yeah, holding W just got straight throttle, but then I should be able to just slightly further the gas. Yeah it works. Ah, the one thing though, is that since the travel distance is actually here to there, like that's what, I mean five millimeters or something, like it's really not much. What's it called? Wootility, that is the best name for software. (people laughing) Oh, okay. So you've got like an RGB layout, which is great. You can like fully customize where your RGB goes, but you've got these digital profiles and analog profiles. And so these analog profiles are what I was talking about earlier, where I said that you can change where exactly the height is for the actuation on everything. Dark theme, every time. Oh, you can remap everything. That's actually pretty cool too. And then you can change the actuation point. So if I go there, open like a notepad. Yeah, so I'm barely pressing it. I'm barely pressing it and it comes up. So if I go back to like 3.6 millimeters. Yeah, I got to push a lot further. Okay. Oh, you can create profiles too. So you have to switch it in software instead of just a little toggle on the keyboard, which would actually be pretty cool. Yeah, I don't see anything. - Dude, I saw macro keys. Those alpha keys. - Oh, okay. I mean, they're changing the RGB. So yeah, it looks like they are changing the profile, but like, I don't see that represented in the software. I don't know what these are doing. It might just be RGB modes. Uh, it feels okay, like having less range feels like a normal keyboard, I guess, where I'm just kind of pressing it all the way down and not really feathering it all that much. Like it's weird how much this feels more comfortable to me than trying to like feather it properly. So I'm gonna swap out, change it to, all the way down to 1.5 millimeters. I really wish you could change it to like zero. This feels okay. Again, I think my main problem overall with this thing is that like, it's not easy to feather keys. Cause it's just your finger pressing down on this thing. Especially with the higher like... Oh, what's the word? Actuation force, I guess. When it's like wait too hard to press a key down. I mean, these are like 60 grams or something, so it's not too bad. One other big downside to this keyboard is that you can only swap it with other Lekker switches. I mean, I think that the learning curve on this to try to actually get that proper, you know, ability to feather on and off, I think it's pretty high to be perfectly honest. All of your keyboard instinct is just press, press all the way down. That's where you want it to go. It's an okay keyboard. I just think that if you're trying to buy it for a purely analog experience, it's more of something you're going to end up just like playing around with for 10 minutes and then setting it to whatever you want it to actually actuate on. Even when driving in Dirt, it didn't feel natural for me to just feather on half of it. Cause you naturally, like there's too much pressor. There's too much pressure. On a thumb stick, there's a lot more control with your thumb. Like your thumb is a much, like meteor finger, right? Like we do a lot of stuff with it. Whereas your fingers are kind of delicate in comparison. I don't know, maybe the space bar. No, even the space bar, it just doesn't feel right. It's like, it always wants to push down or push up. It doesn't want to meet me in the middle. So this is going to really appeal to someone who thinks that they're going to get an edge by having this analog input on a keyboard rather than feeling like they're forced to use a controller to get there. If you're so hardcore that you've got a steering wheel and gas pedal at that point, you're not going to buy this thing. You're just going to buy a better racing rig. But I think if you want to actually use these, the way they're intended for like proper analog use, they need to up the stem, another three, four millimeters, to give you finer control. Yeah, that's the problem. It's like analog but not analog enough. Thanks for watching everyone. This is the Wooting Two HE, it's not bad. Couple of hundred bucks. I don't know, I would get something else, but I think it definitely appeals to a bunch of people out there. If you like this video, it's not a TKL, but you can check out Linus' review of the Logitech TKL, that was a nice keyboard. Especially if you like Logitech and you don't want to build your own custom board. Cause we all know that's way too expensive.",
    "transcript_keywords": [
        "Yeah",
        "keyboard",
        "switches",
        "analog",
        "thing",
        "key",
        "cool",
        "key caps",
        "RGB",
        "feels",
        "bad",
        "pretty",
        "keys",
        "keyboard stand",
        "pretty cool",
        "change",
        "Lekker switches",
        "caps",
        "Wooting",
        "Hold"
    ],
    "transcript_entity_values": [
        "RFID",
        "10 minutes",
        "half",
        "three years",
        "TKL",
        "60 grams",
        "Couple of hundred bucks",
        "three",
        "four millimeters",
        "One",
        "one",
        "90",
        "the Wooting Two HE",
        "Wootility",
        "Logitech",
        "Jam K",
        "Instagram",
        "Ridge Wallet",
        "1.5 millimeters",
        "3.6 millimeters",
        "185",
        "almost $200",
        "10%",
        "five millimeters",
        "four",
        "30",
        "Dirt",
        "RGB",
        "Linus",
        "hundred percent",
        "Offercodecircuit",
        "five",
        "Lekker",
        "about 120",
        "Wooting Two"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LAW"
    ]
}