{
    "id": "CBZHavTlT6w",
    "title": "The $900 \"MacBook\" - Buy at Your Own Risk!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-12-19T19:49:19Z",
    "video_url": "https://www.youtube.com/watch?v=CBZHavTlT6w",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Cheap Macbook",
        "Cheapest Macbook",
        "Macbook Clone",
        "Xiaomi Notebook Pro",
        "MX150",
        "Xiaomi Mi",
        "Kaby Lake R",
        "Coffee Lake",
        "i7",
        "GTX 1060",
        "Gaming Laptop",
        "Cheap gaming laptop",
        "cheap laptop for students",
        "best gaming laptop",
        "best laptop for students",
        "best laptop for college",
        "best laptop for highschool",
        "cheap laptop",
        "fake macbook",
        "macbook clone"
    ],
    "views": 1287787,
    "likes": 25711,
    "comments_count": 2167,
    "description": "My review of the Xiaomi Mi Notebook Pro. Probably the best laptop you can buy for $900 if you're brave! Available Here -  Coupon Code: MCA30  The Xiaomi Mi Notebook Pro is a great option for people on a tighter budget. It's a powerful but inexpensive laptop for students in highschool or college.  It can handle light games and is a strong performer for multi-core applications. But customer support will likely be an issue if things go wrong.  Music: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://www.gearbest.com/laptops/pp_786411.html?wid=21",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2D here So this is a laptop that's been out for a couple months, and I've had it for a couple months And you guys haven't asked me to make this video for a couple months But I've purposefully avoided doing it because I wasn't sure if I was gonna make this video I wasn't sure if I was gonna make content on this thing because of an interaction that I had with the company and You'll understand at the end of the video why but this is the Xiaomi Notebook Pro And this is for all intents and purposes a really really good laptop for the money It starts at nine hundred bucks, and it's packed with just great performance great specs and a really good design It's obviously been inspired by Apple. Inspired is a gentle word, but it looks a lot like Apple laptops They've done a great job building this thing and there's a lot to like about it So I'm gonna kind of go through things. I like about it talk about a few things that I don't like about it, and then kind of go into the reasons why I Kind of hesitated on making this video okay first the build quality in this thing is great It's got aluminum everywhere very minimal design it has very little branding on the top and on the bottom. The only obvious branding You'll see on this entire laptop is right at the bottom of the screen And it's just a very muted look to a very well-built laptop. Now it comes pre-loaded with Chinese Windows 10 Which you're gonna have to wipe and then install whatever language of Windows 10 You'd like. I used English and well the good thing is that the digital license is activated So you don't have to purchase a separate license or anything. It's just it works Windows 10 home ran perfectly fine on this laptop I like the port selection on this thing. There's two USB A's and HDMI, two USB C's as well as an SD card slot now There's only one USB C that supports charging as well as high resolution display output But it is a good selection of ports. It's pretty easy to get inside it's a bunch of screws on the bottom one of them being underneath one of the feet and when you're inside you can't replace the Wi-Fi card it's a good one the 80-65, but it looks like it's built on board But you can replace the SSD and there's room for a second SSD if you want the keyboard is nice it's easy to get used to it actually reminds me a lot of the older generation Mac books like the 2015 and earlier MacBook Pros, it's got like a nice plush key travel and the layout is really good I mean it's kind of weird that a Chinese company has one of the better English keyboard layouts But they do a good job at it, and I also like the speakers now They're positioned on the bottom, so they don't have the best location, but I mean they sound good It's just you lose some of the audio clarity because it's sitting on the table and just kind of deflects off of whatever surface You're using but they do sound good now the screen I have Kind of mixed feelings about it's a 1080p panel not touchscreen and it looks pretty sharp The color gamut and accuracy are a little bit lower than expected It just looks nicer than it actually is but when you measure with the spider comes out kind of mediocre The battery life is really good though So this thing's coming in at seven and a half hours of regular use with the screen at 215 nits I've mentioned this in other videos with 15-inch ultrabooks But I really like laptops that have 15 inch screens that are using u processors You just get better battery life and for a lot of people It's a good fit This particular model is running 16 gigs of ram and an i7 kabylake-r CPU and for multi-core stuff in short bursts this thing Kicks ass the thermals are good. They're running two fans in the chassis Which is pretty rare for a u processor and The thing is there's so much thermal Headroom with those two fans that you can bump up the waters on this thing pretty comfortably like You can hit 35 watt TDP on this thing Pretty easily and that lets you sustain higher clock speed higher boost speed so if that's what you want to do This is a great laptop for that option the fan noise that stock is pretty quiet Not that it's a completely silent computer anything like that. It does come on, but it's just a quiet fan Now this thing is paired with an MX 150, which is one of the best budget GPUs out there It'll give you reasonable gaming performance, and it's just better than the integrated chip from Intel And it gives you a little kick when you're doing some 3d applications or video edits I mean it's not a beast for 3d stuff, but if you're looking to do some casual gaming or graphical work It's a good option now There's a couple things that I don't like about this laptop But the truth is most of it is just nitpicky stuff the first thing I don't like is when I mentioned the build quality everything about it is good Except the bottom edge is super sharp like it feels unfinished compared to the rest of the laptop And it's actually a little bit uncomfortable to hold and the other thing I don't love is the trackpad so the actual tracking surface is good. It's very smooth. It's a great glass texture It feels very similar to a Mac trackpad, but the button mechanism. Oh, I don't love it It needs way more force to press down than almost any other laptop that I've tried And I also don't like the fingerprint sensor location. It's just in the way of the actual tracking stuff I've seen fingerprint sensors that have been on track pads that have been fine But this one kind of gets in the way when you're just using the trackpad Another thing that's kind of weird is that they only give two PCIe lanes for the drive so instead of the regular four lanes They're given two and the drive that they include is a really fast drive as the Samsung Pm 961 is one of the fastest oem drives You can get out there, but the speeds are crippled a little bit because of the reduced number of PCIe lanes But overall this is an awesome laptop for the money right 900 bucks gets you so much on this laptop And it's such good value that when you compare it to North American brands or just any other big named laptop brand It's really hard to compare them because you're just getting such good value with this device, but the big issue with this thing is The customer support. So, I had a friend who Purchased the xiaomi air like their smaller lighter laptop under my recommendation because I said it's a good value He bought it, and then like three months later something went wrong with it And he went through hell to try to get that thing replaced And I would you know I tried to get involved and just it never happened we're literally sitting on a brick of a laptop so I Don't know how to recommend this thing like I feel like for 99.9% of people that purchased this thing. They'll be happy They'll get this great laptop with great value, and they'll just those people get it great But for that small percentage of people that purchase this if you guys are watching this and you're interested in buying this it if you Buy it and it busts like that would just break my heart. There's people that save up for months Maybe even a year to buy one of these things and if it breaks like, that's this is a Chinese company and If you're trying to get customer support with this thing like this is the bottom of the barrel when it comes to customer support These guys are one of the most difficult companies have had to interact with for repairs or replacement of a laptop But you kind of expect it for the price of this thing right. Okay. Hope you guys enjoyed this video thumbs if you liked it subs if you loved it. See you guys next time You",
    "transcript_keywords": [
        "thing",
        "Xiaomi Notebook Pro",
        "good",
        "laptop",
        "Notebook Pro",
        "kind",
        "Apple laptops",
        "make content",
        "Xiaomi Notebook",
        "great",
        "great laptop",
        "thing pretty",
        "make",
        "good thing",
        "things",
        "make this video",
        "good laptop",
        "performance great specs",
        "Apple",
        "pretty"
    ],
    "transcript_entity_values": [
        "99.9%",
        "North American",
        "HDMI",
        "nine hundred bucks",
        "English",
        "Dave",
        "900 bucks",
        "only one",
        "Windows 10",
        "CPU",
        "Kicks",
        "USB",
        "one",
        "Mac",
        "Samsung",
        "USB C",
        "Apple",
        "the Xiaomi Notebook Pro",
        "15 inch",
        "150",
        "second",
        "15-inch",
        "16",
        "35 watt TDP",
        "215",
        "80-65",
        "SD",
        "MacBook Pros",
        "USB C's",
        "two",
        "2015",
        "SSD",
        "first",
        "seven and a half hours",
        "months",
        "four",
        "three months later",
        "Chinese",
        "961",
        "a couple months",
        "Intel",
        "Mac",
        "1080p",
        "MX"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "NORP",
        "ORG",
        "MONEY",
        "LANGUAGE",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "NORP",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ]
}