{
    "id": "CCjlU7uLXgs",
    "title": "Wireless charging FASTER than Wired?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-10-20T00:41:37Z",
    "video_url": "https://www.youtube.com/watch?v=CCjlU7uLXgs",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Xiaomi",
        "wireless charging",
        "80W",
        "80 watt",
        "80 watts",
        "Magsafe",
        "iPhone 12",
        "iPhone 12 Pro",
        "iPhone 12 mini",
        "speed",
        "charging speed",
        "phone"
    ],
    "views": 507243,
    "likes": 32190,
    "comments_count": 1007,
    "description": "Buy CORSAIR iCUE 4000X at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 enough's enough 0:10 McAfee sucks even more 1:12 Xiaomi wireless charging 2:06 Cruise self-driving cars 2:59 Corsair iCUE 4000X Case 3:31 QUICK BITS 3:36 Samsung flagship in January 3:58 iPhone 12 preorders 2x iPhone 11 4:31 MSI Ryzen 5000 support 4:59 Tesla free upgrades  NEWS SOURCES  NOT THE USUAL MCAFEE BLOATWARE     CLOBBER IT WITH ELECTRONS     WE DON'T HAVE A PILOT?     QUICK BITS  A NEW GALAXY    BY THE BUSHEL    CONGRATS, YOU DIDN'T BUY A PAPERWEIGHT    A FREE LUNCH?     ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/zcBYb",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.engadget.com/china-apt-31-impersonated-mcafee-in-election-attack-175247625.html",
        "https://www.pcmag.com/news/google-chinese-hackers-are-posing-as-mcafee-antivirus-to-phish-victims",
        "https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats",
        "https://mashable.com/article/xiaomi-80w-wireless-charging/",
        "https://www.gsmarena.com/xiaomi_creates_80w_wireless_charger_tops_up_a_battery_in_19_minutes-news-45852.php",
        "https://thenextweb.com/plugged/2020/10/19/xiaomi-claims-its-new-wireless-charger-can-juice-up-your-phone-in-19-minutes/",
        "https://arstechnica.com/cars/2020/10/cruise-will-soon-hit-san-francisco-with-no-hands-on-the-wheel/",
        "https://techcrunch.com/2020/10/15/cruise-can-now-test-driverless-vehicles-on-the-streets-of-san-francisco/",
        "https://www.cnbc.com/2020/10/15/gm-cruise-to-begin-testing-unmanned-autonomous-vehicles-this-year.html",
        "https://www.kitguru.net/lifestyle/mobile/matthew-wilson/samsung-tipped-to-launch-next-gen-galaxy-s-in-january/",
        "https://www.androidcentral.com/samsung-galaxy-s21-leaked-full-release-date",
        "https://9to5mac.com/2020/10/19/iphone-12-preorders/",
        "https://appleinsider.com/articles/20/10/19/initial-iphone-12-and-iphone-12-pro-pre-order-results-best-iphone-11-kuo-says",
        "https://www.tomshardware.com/news/msi-400-series-motherboard-amd-ryzen-5000-cpu-support",
        "https://www.kitguru.net/components/cpu/matthew-wilson/msi-will-update-all-400-series-motherboards-to-support-ryzen-5000-cpus/",
        "https://electrek.co/2020/10/17/tesla-strangely-back-premium-connectivity-some-owners/",
        "https://www.engadget.com/tesla-restores-premium-connectivity-for-some-car-owners-191203715.html",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I've been doing tech news for seven years now. And I swear if I see one more tech story, I'm gonna tell you about it, gladly! Dealing with popups from antivirus bloatware, like McAfee on new laptops, is annoying. But if you're involved in the US election, it might actually be dangerous to something other than your own mental health. A new report from Google indicates that a Chinese hacker group dubbed, APT31 has been impersonating McAfee employees with the goal of infiltrating computers used by campaign workers. APT31 used phishing tactics to try and get staffers to install McAfee products from GitHub, instead of the official McAfee website, which to be fair, just as sketchy, if not more. And these downloads also contain malware which could be invisible to the end user. Google says this is part of a larger trend of government backed malware attacks, which have increased as 2020 has gone on. The upcoming presidential election in the US is no doubt, a huge impetus for these attacks. And here I was thinking attack ads were the worst part of election season. Ha! Not this year, this is the hell year. Everything's worse. - [Guy] It's only gonna get worse. - Just you wait. Although the big news recently in the world of wireless charging has been out, Apple is bringing back MagSafe, all the wireless charging enthusiasts are talking about it. Don't sleep on Xiaomi. Today, they unveiled a wireless charger that can deliver 80 Watts, which is more than the power bricks for a lot of mainstream laptops. - [Guy] That's a lot of Watts - Wow! That's a lot of Watts, Marty! Xiaomi claims that its new product can wirelessly charge a 4,000 milliamp hour battery in just 19 minutes, as well as get from zero to 50 in less than nine minutes, which would be quite impressive indeed. Although there are faster charging solutions around, this appears to be the fastest wireless one yet, although we're not yet sure exactly when it's going to hit the market. In the meantime, remember to plug your phone in before you pass out, just in case, when it hits the mark when it hits the market and then you're gonna pass out. That's Guy, we love you Guy. - [Guy] That's our Guy. - That's our Guy. If you live in San Francisco, look out for driverless cars tooling around with a bit more regularity. Cruise, which is owned by General Motors, has gotten a permit from the California DMV to put up to five driverless cars on the road for use as taxis. In this case, their Chevy Bolts that have been modified to run autonomously. It's not the first driverless car pilot in the US, but San Francisco streets are notoriously busy. So it'll be interesting to see how the cars perform. The test-- - [Guy] them go uphill. - (laughs) They can actually do it. The tests will be limited to just one neighborhood for the time being. Hopefully it's the one with the squiggly, that's insane. - [Guy] The \"Full House\" one. - Yeah, exactly. And the cars won't exceed 30 miles per hour to reduce the risk of, you know, a wayward car going careening into... - [Guy] Step on it driver, I'm in a hurry. - No word on if and when these trials would expand to the rest of the city or beyond, but it would be awesome not to have to make small talk with an Uber driver. Today's quick bits are brought to you by the CORSAIR iCUE 4000X Case, oh yeah! It has tempered glass front and side panels with dedicated front vent channels for airflow. You also get the iCUE Lighting Node core for full control and synced RGB lighting, for up to six fans with CORSAIR iCUE software. - [Guy] Yeah! - [Riley] It comes with two CORSAIR 120 millimeter AirGuide fans. - [Guy] Preach! - [Riley] They utilize veins, to direct air flow and enhance cooling. - [Guy] See you later. - Click the link below to learn more. Quick bits, smooth going down, smooth going up. It looks like we'll be getting the next flagship Galaxy S smartphone a little earlier than anticipated, as leaks indicate it'll be coming in January. Although we're expecting it to again, have three cameras on the back, it's not clear yet whether it will be called the S21 or the S30, but I'm sure I'll be calling it, the expensive. I'm liking these fingers today. - [Guy] Finger gun! - Finger Guy! The iPhone 12 was criticized in some quarters for not offering too many compelling new features. But as the first 5G iPhone, that hasn't stopped it from pulling in preorders in more than twice the clip of last year's iPhone 11. Estimates indicate that up to 2 million preorders were placed, though that's still only about half of what we saw with the iPhone 6, which we all remember fondly, I guess. That phone famously gave the lineup a larger screen. Maybe Apple just needs to sell an iPhone the size of a TV, for preorders to really take off. Think about it, Tim Apple, you got the idea here first. A new CPU lineup can often mean needing to buy a new motherboard, if you wanna upgrade. But MSI has come out and said that all of its 400-Series chipset boards will indeed support the new Ryzen 5000 CPUs, with a BIOS update, and they're joining ASUS in this as well and a few other manufacturers. However, the updated firmware probably won't be ready until January. So I hope you can get through Black Friday, as well as Christmas, without too much gadget envy. Don't count on it. - [Guy] Went with that gadget every New Year's. - And oddly enough, Tesla looks like it's giving freebies out to a select number of car owners. Some Model 3 owners are getting premium options, like satellite maps, live traffic, and streaming music, without paying for Tesla's premium connectivity package. It's possible that this might only be available to drivers in Canada, yes, finally, we get something that the US might be missing out on. I don't wanna talk about this anymore. That's our show. So come back Wednesday for more tech news, with that tangy tomato flavor you crave. John made a, John made a joke about ketchup chips. That's why this... Hey, don't you throw your really cool stylist shoes at me. - [Guy] They're not the sponsor.",
    "transcript_keywords": [
        "Guy",
        "tech",
        "McAfee",
        "San Francisco",
        "iPhone",
        "cars",
        "tech story",
        "year",
        "Watts",
        "wireless",
        "driverless cars",
        "CORSAIR iCUE",
        "CORSAIR",
        "car",
        "Apple",
        "lot of Watts",
        "wireless charging",
        "case",
        "election",
        "Finger Guy"
    ],
    "transcript_entity_values": [
        "S30",
        "General Motors",
        "only about half",
        "three",
        "last year's",
        "Guy",
        "just 19 minutes",
        "one",
        "US",
        "New Year's",
        "Tesla",
        "Model 3",
        "Watts",
        "iPhone",
        "Google",
        "this year",
        "Marty",
        "up to six",
        "Today",
        "Watts",
        "Tim Apple",
        "John",
        "seven years",
        "4000X",
        "80",
        "CORSAIR",
        "2020",
        "Xiaomi",
        "less than nine minutes",
        "2 million",
        "S21",
        "5",
        "AirGuide",
        "January",
        "50",
        "120 millimeter",
        "G iPhone",
        "first",
        "Chinese",
        "McAfee",
        "San Francisco",
        "two",
        "MSI",
        "up to five",
        "Lighting Node",
        "Canada",
        "4,000 milliamp hour",
        "Galaxy S",
        "Chevy Bolts",
        "Black Friday",
        "Wednesday",
        "GitHub",
        "30 miles per hour",
        "RGB",
        "the California DMV",
        "CPU",
        "Ryzen 5000",
        "Christmas",
        "ASUS",
        "Apple",
        "today",
        "zero"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "GPE",
        "EVENT",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "LOC",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "QUANTITY",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}