{
    "id": "CCnlFUGN7xI",
    "title": "SURPRISING DWAYNE JOHNSON - Rampage Set Tour",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-04-11T18:04:39Z",
    "video_url": "https://www.youtube.com/watch?v=CCnlFUGN7xI",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "the rock",
        "interview",
        "surprsing dwayne",
        "dwayne johnson",
        "surprising the rock",
        "rampage",
        "rampage media tour",
        "rampage set tour",
        "rampage behind the scenes",
        "rampage movie"
    ],
    "views": 276456,
    "likes": 11760,
    "comments_count": 622,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat music) - Hey guys, so, right now I'm on the set of Rampage and I'm so excited because we are here in Atlanta, Georgia and we're getting a sneak peak of behind the scenes on the set. A huge thank you to Warner Bros for sponsoring this video and set tour and also stay tuned because in a little bit we'll be chatting with Dwayne Johnson. Right now, let's walk around the set and see some things. (upbeat music) This set is so crazy, so basically this is the Federal Plaza in Chicago and it is completely just destroyed. There is destruction everywhere. There's just, there's crap just all over the place that has been destroyed. It's pretty cool. (upbeat music) So the whole premise is, we're gonna chat about mutations because so much stuff in the film has to do with animal mutations, so we've got some Photoshop mutations here. We're gonna see if we can figure out what they were previous to their mutations. And I also have a special surprise, back in 2008, the first time I've ever done a red carpet event this photo right here, I photoshopped my face on Dwayne's face and I made him sign one of these and then I gave him one, that I signed for him. Super disturbing. (upbeat music) - Yes - So we were on set all day today and we saw so many crazy things. - Yes. - There was this massive airplane, but the crazy part about is it was cut into 3 different sections. - So we have a big cargo plane - Um-hmm A C-17 that is transporting, without giving the movie away, that is transporting one of our big genetically mutated animals. - Yes. - [Dwayne] Who's massive. Having George on that plane is a big mistake. (dramatic music) (growling) - I think we'll be alright. (rattling and crashing) - And then we also have, which I believe you saw today, was part of a um - a lot of Chicago is, what do we call that oh, completely been crushed. - It's Destroyed. - So I've got some genetically altered animals. And we're gonna see what they are. - Perfect. - I think it'll be okay. - This is my jam. Let me just give context to everyone watching, this is part of my makeup right? She just didn't like kick (beep) out of me (laughing) and bring me in here. - I was concerned when I gave you a hug, I was like is this movie makeup or is this actual real - It's real blood, she likes the blood. (papers hitting desk) - What do we think this is? - That is dog mixed with a pig. - Pig Pug? - Pig pug. - Pig pug. - Okay there's also - - Do you have a dog? - I do, his name is Matty. - Matty. - Actually I think I might have something in here. - Oh great. - This is my face on Maddie. - Yes. - It's very very cute. - And is there a combination of the name? Like that we have? - Uhhh no. Um let's see here's another little number. - Oh, look at that - So now- - I think that's you again. - It is. But, don't worry I have some of you too. Is this potentially your dog? - It is potentially my dog. - With my dogs face on it. - As if they amalgomized. That's me, it's the bald eagle cause it's bald and it's rock, I get it. - Yeah we have so many of these. - Oh my tattoo is there, look at that. - I wish I could say I Photoshopped it, but I didn't. - I was gonna say she didn't do this. - I didn't. I could, but I didn't. So we have one last one. - Alright. - And this is extremely embarrassing, - Here we go. - I hope you don't remember this. You were one of the first people I ever interviewed on a red carpet. And I don't even wanna show this to you, cause it's so embarrassing. - That's crazy, wait. - This was in 2008. - Okay. - In Las Vegas. But there's a catch. - Okay. Alright. - Oh please don't remember ever signing this. - Oh my god. (laughing) - So there was this kiosk and you could put your face on somebody else's body and it just so happened - Wow. that I was going to interview you. I saw this kiosk, so I signed one, I gave it to you and then I had you sign this. And it is terrifying. - Wow, so this I mean this - if you've ever wondered what Justine would look like with a really thick neck. (laughing) - Oh my gosh, I can't believe it. I was like I hope he never remembers - So this is the second time. - Yeah - So everybody knows, when I first walked in the room I gave Justine a big hug because I felt like, dude I feel like I've known you for such a long time. We're following each other on twitter - Um-hmm. - Every once in a while I'll comment on things and now I realize we met many years ago in Vegas - It's okay. This, I never want to forget again. - Yes, this is (laughs) this is me after the operation, yes. - Well thank you so much. - Thank you. - I can't wait to see the film and we will see you guys in the theater. Bye. - See ya. (piano music plays)",
    "transcript_keywords": [
        "set",
        "sneak peak",
        "Warner Bros",
        "Dwayne Johnson",
        "Atlanta",
        "Georgia",
        "Rampage",
        "set of Rampage",
        "Pig Pug",
        "face",
        "Bros for sponsoring",
        "Federal Plaza",
        "mutations",
        "set tour",
        "destroyed",
        "crazy",
        "big",
        "dog",
        "pig",
        "gave"
    ],
    "transcript_entity_values": [
        "all day",
        "Matty",
        "second",
        "one",
        "Dwayne Johnson",
        "Justine",
        "the Federal Plaza",
        "Dwayne",
        "Warner Bros",
        "Chicago",
        "Maddie",
        "Georgia",
        "many years ago",
        "3",
        "George",
        "today",
        "C-17",
        "Las Vegas",
        "Atlanta",
        "Vegas",
        "first",
        "2008"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "FAC",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "GPE",
        "GPE",
        "GPE",
        "ORDINAL",
        "DATE"
    ]
}