{
    "id": "CCQ8NJUz2Ss",
    "title": "Aero 14 Review (GTX 1060) -  The Lightest Gaming Laptop!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2016-12-11T03:21:06Z",
    "video_url": "https://www.youtube.com/watch?v=CCQ8NJUz2Ss",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Gigabyte",
        "Aero",
        "GTX 1060",
        "GTX 1070",
        "Aero 14",
        "Razer Blade",
        "Razer Blade Stealth",
        "Thinnest Laptop",
        "Best Gaming Laptop",
        "XPS",
        "MSI"
    ],
    "views": 747996,
    "likes": 13396,
    "comments_count": 1141,
    "description": "Dave2D review of the Gigabyte Aero 14 (GTX 1060) - Is this the best gaming laptop? A Razer Blade competitor that is thin and light but cheaper! A Guide to Spinning -  Purchase Here -   Laptop GTX 1060 Performance Video -   Be sure to check out my other thin and light gaming laptops review: Razer Blade 14 (GTX 1060) -  MSI GS63 (GTX 1060) -  ASUS GL502 (GTX 1060) -    Music Credits: Intro: Matanoll - Clearness (Robotaki Remix) Background: Fili - Dollar For My Thoughts  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2gxWHzC",
        "http://amzn.to/2hhzNxA",
        "https://youtu.be/ac9ogKirkGQ",
        "https://youtu.be/G_VUD7r0gVA",
        "https://youtu.be/lvkZRMPM8aQ",
        "https://youtu.be/IDJd_9CMkEg",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Okay, we got it. We're good. Hey, how's it going guys? This is Dave2D and this is the Aero 14 from Gigabyte. So, it's been updated with a GTX1060, it's a relatively affordable, thin and light, yet powerful gaming laptop. And I say relatively affordable, because a lot of gaming laptops in this kind of form factor are significantly more expensive. This starts at $1600, give or take a little bit. Let's take a look. These come in several colors. This one's orange with a faux carbon fiber finish, but they do have a more muted black version. The build quality is good. It uses a lot of aluminum, but there are some plastic components, so the screen has a little bit of flex to it. It is engineered well, and the overall finish and durability is quite good. In terms of ports, there are a couple of display outputs and a bunch of usb options, including USB-C, but this isn't a Thunderbolt 3 port. There is also an SD card reader and an audio jack. The speakers are down firing, I don't love that. They're loud, and the upper frequencies are surprisingly clean, but it lacks bass, even for a laptop speaker. The bottom panel opens up easily. You can see the speaker on the side here. It has upgradeable RAM, this unit came with 16 gigs. But I did notice one thing. There is a sticker on this device that says 8 gigs or what looks like there should be 8 gigs, but it came with 16. So I'm not sure if this review unit was a mistake or there are some 8 gig configurations available, that would be cheaper. I'm not sure, but this one has 16. There is one drive bay, the previous version with the 970M had 2 drive bays, but this time there's only one. The stock drive they've included is a 256 gig SATA stick, so the speeds are pretty mediocre, it is easy to upgrade it to an NVME, though. The battery is down here. It's a 94 Wh battery, which is actually huge for a thin 14 inch laptop, you'll get around 7 hours of battery life with screen at around 250 nits. This is with regular use. And if you're playing games it will be around 2 hours, which is actually surprisingly long. Most gaming laptops are significantly less than that. The backlit keys have a good layout. So at first, I found it to be a little springy. It means it needs a lot of pressure to get the keys down, but it has good travel, and once you get used to it, it's a really nice keyboard to type on, and it's great for games. The macro keys on the side are spaced a little further out, so i never misclick them. Overall, it's a good keyboard. The trackpad uses E-LAN drivers. So the size is good, and the surface texture is really nice, the button mechanism feels good too, but the tracking is just not up to par. It's not very good with precision tracking, like when you move your fingertips really lightly to fine tune your position, it doesn't detect it properly. Now, I almost always use a mouse, so this kind of stuff doesn't affect me too much, but if you're someone who needs a perfect trackpad, this is probably not the machine for you. The display is a 1440p panel, it's not a touch screen, contrast and viewing angles are great, but even after calibration and playing around with the software, color accuracy was never perfect. Overall, the screen is good, I was just hoping for it to be a bit more color accurate. The webcam looks like this, it's a pretty standard 720p image. Now, performance on this machine is excellent. The 6700HQ and the GTX1060 are excellent for 1080p gaming. You can easily play some lighter titles at the native 1440p, but I always prefer playing in 1080p. Light and moderately demanding games will easily break 60 frames per second on ultra graphics at 1080p. It's only heavier titles that you'll need to drop graphics quality down to maintain 60 frames per second, but if you want to see more benchmarks of other games for this CPU and GPU combination, there's a link below in the description. Thermals are comfortable in the keyboard area, fan noise on idle is audible but it's still pretty quiet, when it's under load though, it gets loud, you're going to need headphones. The performance on this machine is really good and heat is managed well, there's no thermal throttling. The trade-off, though, is fan noise. But honestly I'd way rather see this than a quiet system with throttled CPU speeds. The 150 watt AC adapter is relatively compact, it has a USB pass-through for charging up a phone or something, but on a device with four USB ports, I don't know how necessary this is. It is a nice touch, though. So, with the Aero 14 you're getting an aluminum chassis, with good build quality and several colors to choose from. A 1440p screen, that's great for games and has decent color accuracy. The keyboard is really nice to type on. It has macro keys. The trackpad, I'm not a big fan of. Inside, the SkyLake i7 and the GTX1060 deliver good performance and are very well cooled, but fan noise can get loud when it's under load. The RAM and the SSD are easy to access for upgrades and the 94 watt hour battery is a beast. It will last you 7 hours of regular use. So, I really like this machine, they took a high-performance system, built it into a thin and light chassis and they charge a reasonable price for it. What's not to like about that, right? The touchpad and the screen color accuracy aren't perfect, but those are things that you don't care too much about. Fantastic machine, I highly recommend it. Thumbs if you like this video, subs if you loved it. It's been nice, I'll see you guys next time.",
    "transcript_keywords": [
        "good",
        "screen",
        "nice",
        "machine",
        "games",
        "color",
        "gaming",
        "battery",
        "keys",
        "color accuracy",
        "keyboard",
        "fan",
        "gaming laptops",
        "usb",
        "laptop",
        "gigs",
        "fan noise",
        "lot",
        "bit",
        "hours"
    ],
    "transcript_entity_values": [
        "around 2 hours",
        "2",
        "Gigabyte",
        "SkyLake",
        "the 970M",
        "60",
        "only one",
        "CPU",
        "GPU",
        "usb",
        "14 inch",
        "one",
        "1080p",
        "AC",
        "USB",
        "94",
        "jack",
        "1600",
        "second",
        "Wh",
        "16",
        "SD",
        "256",
        "the 94 watt hour",
        "NVME",
        "around 7 hours",
        "150 watt",
        "first",
        "SSD",
        "6700HQ",
        "four",
        "7 hours",
        "RAM",
        "around 250",
        "USB-C",
        "8",
        "Thunderbolt 3"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "PERSON",
        "LOC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "TIME",
        "MONEY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT"
    ]
}