{
    "id": "CdvK7sydqNo",
    "title": "Huawei P20 Pro Review: Violet Delights",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-05-05T01:41:07Z",
    "video_url": "https://www.youtube.com/watch?v=CdvK7sydqNo",
    "category": "Science & Technology",
    "tags": [
        "huawei p20 pro review",
        "huawei p20 review",
        "best phone camera",
        "best smartphone 2018",
        "best phone 2018",
        "mrmobile",
        "michael fisher"
    ],
    "views": 332690,
    "likes": 8961,
    "comments_count": 700,
    "description": "Sponsored by App Academy. Apply now for a chance to get the $1,795 Bootcamp Prep course for free! Click here:    [HUAWEI P20 PRO REVIEW]  Confession time: I never really liked Huaweis P-series phones. Theyve never been released in the US, and theyve usually lagged behind the companys Mate line in features I prioritize. Well, the P20 Pro changes all that, with an insane triple-camera system that has me more excited for a phone than Ive been since the Lumia 1020 back in 2013. Its still not slated for sale in the USA, but this time, that wasnt going to stop me. Join me for the MrMobile edition of the Huawei P20 Pro review!   [LINKS]  Android Centrals Huawei P20 Review / Huawei P20 Pro Review:   Nokia Lumia 1020 review [Pocketnow]:   iFixit P20 Pro Teardown:   Btekt on Instagram:   Mobile Tech Podcast with Myriam Joire:   Android Authority 40MP Shootout:    [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S HUAWEI P20 PRO REVIEW]  MrMobile's Huawei P20 Pro Review was produced following 30 days with a P20 Pro review device (model CLT-L29) provided by Huawei. The device was tested on T-Mobile US in the United States, TiM in Rome Italy, and SK Telecom in Seoul and Jeju Island, South Korea. It received one software update during the review process, resulting in a version number 8.1.0.107(C432) at presstime.    [PRODUCTS IN THIS VIDEO]  Huawei P20 Pro [Amazon]:    [MUSIC]   Superpop by Tiny Music, available at Premium Beat:    Escapade by Vincent Tone, available at Premium Beat:    Live Up by Cymatix, available at Premium Beat:     [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://apply.appacademy.io/learn-to-code-online-2/?utm_source=YouTube",
        "https://www.androidcentral.com/huawei-p20-p20-pro-review",
        "http://pocketnow.com/2013/07/27/nokia-lumia-1020-review-the-warthog-of-cameraphones",
        "https://www.ifixit.com/Teardown/Huawei+P20+Pro+Teardown/104605",
        "https://www.instagram.com/btekt/",
        "https://worldpodcasts.com/mobiletechpodcast/",
        "https://www.androidauthority.com/huawei-p20-pro-vs-lumia-1020-857050/",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4nm",
        "https://www.premiumbeat.com/royalty-free-tracks/superpop",
        "https://www.premiumbeat.com/royalty-free-tracks/escapade",
        "https://www.premiumbeat.com/royalty_free_music/songs/live-up",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Voiceover] It's been tough to get ahold of a Huawei phone in the US for, well basically forever. But this is the first time that I've ever been sad about that. Because this is something special. I'm Mr. Mobile, and this is the Huawei P20 Pro review. Brought to you by App Academy. I wanna start with a question my fellow Americans are probably asking, when you can get a great smart phone at your neighborhood carrier store, why would you consider paying a premium for one that's not officially supported? Well, there are three reasons actually, and they're grouped together right up here. A 20 megapixel monochrome, an eight megapixel telephoto and a monster 40 megapixel primary, make for a smart phone camera system the power of which has not been seen in five years. It's so central to the P20 Pro's story that Huawei put all its branding sideways. An undeniable cue that you're meant to hold this phone like a camera. If only there were a shutter button on top. Oh well. All the buzz about the camera has a lot of folks comparing the P20 Pro to the Google Pixel Two, which makes sense. For me, the Pixel Two has the best camera you can find in a phone. But these two are designed for very different types of photographers. Google's phone just wants to give you the best shot without you having to think much about it. Well, all the options and features on the Huawei phone, not to mention the Lika branding, seem to want you to rise to its camera's potential. I know that sounds tacky, but this phone really does make me wanna be a better photographer. In fact, I haven't felt this inspired by a phone camera since the Lumia 10-20 of 2013. And that's no coincidence either. The current director of imaging at Huawei is one of the guys who invented that camera back at Nokia. Okay, history lesson's over. What can all this hardware do for you? Well, for starters, you can take a 40 megapixel photo. But you probably don't want to because you'll fill up the onboard storage in no time, and there's no micro SD card when you run out of space. So the default setting is 10 megapixels. And while that might sound like a waste of a huge sensor, it's not. See this phone uses a technique called pixel binning to combine four of the camera's pixels into one. Now this isn't new. It's not unique to Huawei. A lot of phones have done it. But not many of them have a 40 megapixel sensor to spread out on. On the P20 Pro, this approach makes for an equivalent pixel size about 40% larger than on most modern phones. And when you're talking pixel size, bigger is better. More light gets collected, and there's less digital noise, or grain in the resulting photos. Leaving the resolution at 10 megapixels also means you can use one of the two halo features here. Hybrid zoom. Here's where that telephoto lens comes in. When you punch in on a subject, it gives you three X optical magnification. And the phone isn't just relying on that camera, it also peppers in image data from the main sensor to enhance sharpness. In fact, most of the time, at least two of these cameras are working together. That monochrome sensor, it's not just for black and white photos. It helps add dynamic range to regular pictures too. All that added data, is part of the reason you can push past three X all the way up to five X and still get a better picture than most. I mean, just take a look at the P20 Pro zoom shots next to the iPhone 10's to see what I mean. These are the best zoom shots I've seen from a phone. Well, at least one that doesn't have a protuberance. I'm gonna circle back at the end for the bad stuff on this camera, but I can't move on without talking about the other halo feature, night mode. This is where Huawei pulls off some real magic. It's a crazy mix of long exposure and HDR that combines multiple photos into one. Now snapping a night mode shot takes awhile, between four and twenty seconds, which on most cameras would guarantee blur from hand motion, particularly if you drink as much coffee as I do. But the P20 Pro has software stabilization good enough to correct for that so you don't need to bring a tripod along. It's not perfect. You'll sometimes get a more cartoony look than you might want, especially if you use it during the day. But in the right situation, this can pull more detail and color from the shadows than anything else. Okay, let's move beyond the camera for a bit. Much of the P20 Pro is similar to the earlier Mate 10 Pro. And I'll toss the specs up here so you can get a refresher. Since I recently reviewed the Mate 10 Pro, I won't retread my complaints about Huawei's software. In brief, I still think it's ugly and cumbersome, and I decided to just run Nova Launcher this time with the pixel icon pack. It doesn't help with the lock screen difficulties or the memory management idiosyncrasies, but it does make them livable. And so does the fact that the phone is fast. Moving into hardware, do you wanna talk about it? Okay, let's talk about it. The display is bright and beautiful, but everyone's saying it and everyone is right. The purpose of a notch in a display is to maximize the real estate of that display. And if you're just gonna build a chin into the phone below that screen anyway, well you've kind of missed the point. I understand wanting to leave room for the fingerprint sensor, and I'm glad it's not on the back, which would've ruined the look. But I wish Huawei had built that sensor into the display instead. I mean, it did it on the Porsche addition of this phone. You can solve this aesthetic challenge by hiding the notch in settings, but at the expense of spawning new, strange problems in apps like Instagram. I guess we're already in the details phase, so a few more things you should know before dropping a couple car payments on this thing. It's as smudge-prone as an ice cream shop window, and so slippery you can literally watch it wander off a table top. Mine has taken a few falls and I've been spared from too any scratches so far, with the exception of this little bit of weathering. It does come with a case in the box, and also a charger that's apparently super fast, but it won't fit in US outlets. Well, okay, but how about wireless charging? Nope. Well, fortunately, you won't need to charge often. The battery in this thing is a monster. And even after a month of use, I routinely go to bed with over 50% left in the pack. That was also the case during my time in South Korea, when I was using the phone in dual SIM mode. With my T-Mobile account in one slot, and the local provider in the other, I lost maybe six to eight percent more battery over a day, which still left plenty to spare. And I know you like hearing about voice calls. The VoLTE works, but Wi-Fi calling does not. Though I had no issues with reception anywhere I went. So kind of a moo point for me. For all the things I really enjoy about the P20 Pro, I'm still gonna be packing a Pixel Two for most of my camera needs and there's one reason for that. Video. See the P20 Pro has good stabilization in HD mode, but toggle up to 4K and you can see every tremble. That's frustrating, because the phone has all the parts for optical stabilization on all three cameras. Check out the I fix it tear down. But for some reason it's only enabled on the telephoto. And there are a bunch of camera features that are just bad. Like the iPhone aping portrait mode that feels like an afterthought. And the wonky super slow-mo showcased here by Betect. Also the jury's still out for me about this selfie camera, which seems to leave a bit of beauty mode blurring even when I turn it off. Now I would say that updates could fix these problems, and I hope they do, but Hauwei's track record on updates is inconsistent. So for now, the Pixel Two stays as my primary camera companion. Back at CES, executive director, Richard Yu, said the sidelining of his company's smart phones in the states was a loss for American consumers. I didn't really agree at the time. I mean the Mate 10 Pro was cool, but it just wasn't that special. Well, if you care about getting creative with your photos, or pushing the boundaries of mobile photography, the P20 Pro is that special. And frankly, not having it on shelves in the US is a shame. If you do want one, it can be imported on eBay and Amazon for between 800 and 14 hundred dollars, depending on whether you want this twilight paint job, which you do. And I know, I know, I know, I've missed so much about this phone. Well, stick around through a word from my sponsor, it's less than a minute, I promise. And I'll tell you where you can learn even more. Folks, becoming a software developer is something I know next to nothing about. But I do know that it's less about learning a specific set of tools than learning a new way of thinking. Well, App Academy is the best way to get there. It's a coding school. The number one coding school, according to independent reviewers. And it's no wonder. At least 120 students went from being unemployed, or at minimum wage, to earning an average of $100,000 a year for their first post boot camp job. After two to three years, most App Academy grads make at least $130,000. That's nuts, and so is this. You can choose a plan to put off paying tuition until after you've gotten that high-paying job. This is the kind of thing that can change your life, and almost anyone can do it. Be one of them. Hit the link in the description for a chance to go to boot camp, coding boot camp, for free. And thanks to App Academy for sponsoring this video. One of the great things about delaying a review for a few weeks is you get to mooch off everyone else's hard work, so I wanna shout 'em out here. Miriam Juar has two great episodes of the Mobile Tech podcast going super deep on the P20 Pro's camera. Android Authority has some amazing side-by-side comparisons with the old Lumia 1020. And if you just want an avalanche of everything on the P20 Pro, the P20 not Pro, and the crazy Porsche design variant, hit up Android Central's marathon review. All those links are in the description. And of course, I'll answer all the questions I can in the comments. Until next time,& folks, please subscribe so I can keep these videos coming. Thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Pro",
        "phone",
        "camera",
        "Huawei",
        "Huawei phone",
        "Pixel",
        "phone camera",
        "App Academy",
        "smart phone camera",
        "Pro camera",
        "basically forever",
        "time",
        "smart phone",
        "phone camera system",
        "sensor",
        "phones",
        "megapixel",
        "camera pixels",
        "mode",
        "cameras"
    ],
    "transcript_entity_values": [
        "Huawei",
        "eBay",
        "20 megapixel monochrome",
        "10 megapixels",
        "eight megapixel",
        "Porsche",
        "the P20 Pro's",
        "Instagram",
        "Betect",
        "100,000",
        "two to three years",
        "the P20 Pro's",
        "Lumia 1020",
        "next time",
        "Wi-Fi",
        "at least one",
        "T-Mobile",
        "Android Central's",
        "over 50%",
        "a few weeks",
        "a month",
        "14 hundred dollars",
        "up to five",
        "American",
        "Mobile Tech",
        "four",
        "10",
        "between 800 and",
        "Mobile",
        "the P20 Pro",
        "Richard Yu",
        "at least $130,000",
        "US",
        "P20",
        "iPhone",
        "one",
        "first",
        "South Korea",
        "One",
        "less than a minute",
        "the P20 Pro",
        "Google",
        "40 megapixel",
        "two",
        "the day",
        "about 40%",
        "4",
        "six to eight percent",
        "VoLTE",
        "App Academy",
        "Lika",
        "Nokia",
        "Nova Launcher",
        "Hauwei",
        "five years",
        "Android Authority",
        "At least 120",
        "CES",
        "between four",
        "Two",
        "Miriam Juar",
        "Americans",
        "three",
        "at least two",
        "Lumia 10-20",
        "Amazon"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "EVENT",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "LAW",
        "PERSON",
        "MONEY",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "ORG"
    ]
}