{
    "id": "CfbPijGGaoI",
    "title": "I can't believe this costs $100!!! - EVERCADE Handheld Console",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-05-21T22:58:42Z",
    "video_url": "https://www.youtube.com/watch?v=CfbPijGGaoI",
    "category": "Science & Technology",
    "tags": [
        "Gaming",
        "Hand Held",
        "Retro",
        "80s",
        "Atari",
        "Namco",
        "Arcade",
        "Interplay",
        "Racing",
        "Kid",
        "Children",
        "Unboxing",
        "Nintendo",
        "Switch",
        "Games",
        "Pack",
        "Pre-Order",
        "Emultator",
        "1980",
        "1990"
    ],
    "views": 441136,
    "likes": 18502,
    "comments_count": 953,
    "description": "Sign up for Private Internet Access VPN at   Who wants to play games dating all the way back to the early '80s and has two thumbs? This guy!!! ^^  Check out the Evercade Handheld Console at   Buy Evercade Retro Handheld Console On Amazon (Paid Link):   Buy Nintendo Switch On Amazon (Paid Link):    On StockX (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/piashortcircuit",
        "https://lmg.gg/UwohL",
        "https://geni.us/xcNGB",
        "https://geni.us/Hf7Zd",
        "https://shop-links.co/1725432032277686646",
        "https://geni.us/gjNt",
        "https://geni.us/RHBJJin",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "I'm not sure that anyone thought this product was ever gonna see the light of day. Inside this box I've got this giant stack of retro game cartridges. Got some Namco games, Techno's Peacoat, Interplay, Megacat and Atari games that I'm gonna be trying out on the Evercade handheld game console designed specifically for these older abandon-ware types of games. Most of these I actually am not familiar with because as a 1986 baby I might actually be too young. But we're gonna give it a shot today and I'm even gonna have my son try out some of them. So he can see what gaming was like in the stone age. And this video's gonna be brought to you by Private Internet Access, It's a VPN that encrypts all your internet traffic so you can use a safe protected IP, you can connect up to five devices at once. They've got Windows, MAC OS Android IOS and Linux clients. Their internet kill switch keeps you in control of your connection and you can try it out risk free with their 30 day money back guarantee at the link in the video description. Let's have a look at the features of this thing. The reaction to it has been a little bit mixed. I'm a fan of the delightfully retro look but I've seen some misgivings about particularly the shape and size of the D-pad. Very clicky left and right triggers, A B X Y kind of SNES style and curiously, it's got a 16 by nine display. When a lot of these older games that you'd be playing would end up pillar boxed in that case. This is another interesting feature though. In addition to being a handheld, the Evercade SC has a mini HDMI port so that you can actually run it out to your TV. Let's have a look at the accessories. Oh yes that's right! So it comes in a couple of different configurations. The starter pack comes with one cartridge and the premium pack the one that I have, actually comes with three cartridges. So between all of this, I've got 10 game packs each with anywhere between six and 20 games on the cartridges. - This doesn't belong on the floor. - Dash doesn't eat that kind of foam it's okay baby. (beep) Turns out this is the on-off switch. That makes sense. Flipping it around to the bottom we've got volume up volume down, a headphone jack and a USB micro B port. So that's gonna take care of charging the 2000 milliamp-hour internal battery that you also get. They claim around four to five hours of play time. The console uses a 1.4 Gigahertz Quad Core Processor and the screen resolution is 480 by 272. Apparently you are emulating the games on this handheld but the emulators are under license from Evercade. So it's all basically legit. So I'm gonna let you pick, what game or game pack should we try first? Okay, all right, we're gonna get some Super Spike Volleyball and some Dodgeball. Double Dragon 2 the Revenge. Display is not terrible, not great definitely TNAF. Horizontal viewing angles are pretty good though, it's definitely functional for a single player experience. (game beeping) You can see there's a two player option but it's not actually two player in it's current state. So they left the two player option in the game, in case there's a future console that they can enable it with. But this is a single player only experience. I would describe the sound output from the device as not amazing but good enough, given the kinds of musical scores that we're listening to here and definitely loud. You gotta stop kicking backwards when you got enemies in front of you there kiddo. - I'm not trying to. - Honestly I'm not sure that they- - Ah hah. - (laughs) All right you ready to try another game? - Yeah, that one's hard. - Games used to be hard. Now I'm not sure how to get back into the menu here. - Menu, press menu. - Oh. - (laughs) - All right well, - See? - Fair enough. This is cool, like most emulator software, it's got full support for save states. What's that Super Dodgeball? Sure. - Yeah. - 1989. - That's old. Oh start. - Yeah now who can't find the buttons? Ssup now? I gotta say the emulation does not look good on this one. There is a lot of flickering that I'm pretty sure is not supposed to be there. Okay, not all old games were good. Wait a minute, ooh I think I understand. So you're the green players. Yeah, you gotta watch out for the guys that are wearing the white shirts. Hey, you gotta stop hitting your own guys here, all right? - (laughs) Boom. - Good, see you, right in the face. I can't see myself playing this for longer than about 45 minutes. I'm gonna try battle cars 1993. - Ew. - What do you mean ew? - (laughs) I said ooh. - Dada dada dada dada daa. In the age of hour long tutorial segments of games, I do miss sometimes the whole, hey, pop the game in the console and play. But I have no idea what's going on. I'd say if you're after licensed versions of these games, which are actually kinda hard to get your hands on these days, the hardware is not bad for the price. So it's $79 for the one game pack version and then it's 99 for the three game pack version and the additional packs are I think $12 each or something like that I wanna say. Let me double check that, $20 each. It certainly doesn't hold up to modern triple a gaming but for something to just kind of goof around with in your pocket if you're into retro games, I've seen much worse value propositions. Okay, here's the real question though. - Yeah. - If I tell you, you've only got an hour to play video games, do you play with this, or do you play with the Switch or VR or whatever else. - The Switch. - Yeah, it's kind of what I thought too. Costs a lot more though. So, thanks for checking this out. I think it's available for pre-order now so we gonna have that linked in the video description. We'll also have of course our sponsor, Private Internet Access down there. Go check those guys out.",
    "transcript_keywords": [
        "games",
        "game",
        "Private Internet Access",
        "game pack",
        "Techno Peacoat",
        "Yeah",
        "Megacat and Atari",
        "Internet",
        "game pack version",
        "pack",
        "Private Internet",
        "Internet Access",
        "player",
        "kind",
        "Namco games",
        "Atari games",
        "Evercade handheld game",
        "play",
        "switch",
        "good"
    ],
    "transcript_entity_values": [
        "four to five hours",
        "1986",
        "Ssup",
        "the age of hour",
        "Namco",
        "12",
        "Atari",
        "Evercade",
        "Private Internet Access",
        "three",
        "milliamp-hour",
        "1.4",
        "Gigahertz Quad Core Processor",
        "one",
        "272",
        "USB",
        "20",
        "TNAF",
        "Techno",
        "IP",
        "1993",
        "Windows",
        "nine",
        "Super Spike Volleyball",
        "99",
        "Super Dodgeball",
        "79",
        "30 day",
        "Linux",
        "the Evercade SC",
        "one cartridge",
        "MAC",
        "between six and 20",
        "10",
        "SNES",
        "first",
        "these days",
        "16",
        "two",
        "up to five",
        "Megacat",
        "1989",
        "about 45 minutes",
        "dada daa",
        "VPN",
        "480",
        "a minute",
        "today",
        "2000"
    ],
    "transcript_entity_types": [
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "FAC",
        "MONEY",
        "DATE",
        "GPE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE"
    ]
}