{
    "id": "cFsRWM7Zviw",
    "title": "Did The Galaxy Fold Kill Foldable Phones?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-04-25T03:29:02Z",
    "video_url": "https://www.youtube.com/watch?v=cFsRWM7Zviw",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy fold review",
        "galaxy fold review",
        "foldable phones 2019",
        "folding phone",
        "samsung fold",
        "galaxy fold vs mate x",
        "mrmobile",
        "android central"
    ],
    "views": 205775,
    "likes": 9196,
    "comments_count": 869,
    "description": "Sponsored by dbrand. Get your Samsung Galaxy Fold skins here:     [SAMSUNG GALAXY FOLD NON-REVIEW]  During the first four days I used the Samsung Galaxy Fold in public, the two questions I got most often from strangers were what is that? and then is that the Samsung folding phone?   By the *last* four days of my review period, those two questions had become: is that the Galaxy Fold? and  ... so did yours break too?  As Samsung knows all too well from its Galaxy Note 7 experience, it doesnt take long for a flawed product to go from setting the world on fire to getting caught in its own combustion. The Galaxy Fold has a major issue with its folding display, one that caused Samsung to put an indefinite hold on releasing the device while it works to solve the problem. To see a defect this widespread, so soon after Samsung told the world it had redoubled its efforts on Quality Control following the Note 7 fiasco  its disheartening. Almost unbelievable.   But all those saying this issue will be the death of foldable phones? I think theyre wrong. Because after ten days using the Galaxy Fold, I cant wait to get mine back. Heres 4 reasons I think Foldables are still the future  (and 4 other reasons why your next phone will probably still be fold-free).    [SUBSCRIBE TO MRMOBILE]     [ABOUT THIS VIDEO]  MrMobile considers a Samsung Galaxy Fold review to be premature until the world sees final production hardware following any changes Samsung makes to the design in the coming weeks. As such, this video is a combination of editorial opinion with impressions gathered across ten days with a Samsung Galaxy Fold review device, since returned to Samsung. When and if the Samsung Galaxy Fold sees retail availability, MrMobile may follow up with a proper Galaxy Fold Review.   Samsung's statement concerning the Galaxy Fold review device failures is below:  \"We recently unveiled a completely new mobile category: a smartphone using multiple new technologies and materials to create a display that is flexible enough to fold. We are encouraged by the excitement around the Galaxy Fold.   While many reviewers shared with us the vast potential they see, some also showed us how the device needs further improvements that could ensure the best possible user experience.  To fully evaluate this feedback and run further internal tests, we have decided to delay the release of the Galaxy Fold. We plan to announce the release date in the coming weeks.  Initial findings from the inspection of reported issues on the display showed that they could be associated with impact on the top and bottom exposed areas of the hinge. There was also an instance where substances found inside the device affected the display performance.  We will take measures to strengthen the display protection. We will also enhance the guidance on care and use of the display including the protective layer so that our customers get the most out of their Galaxy Fold.  We value the trust our customers place in us and they are always our top priority. Samsung is committed to working closely with customers and partners to move the industry forward. We want to thank them for their patience and understanding.   [PRODUCTS IN THIS VIDEO]  MrMobile's Star Trek Discovery sciences jacket provided by Volante Design:    MrMobile's sunglasses provided by ROAV:    [MUSIC]  Let Em Ring by Tonemassif, available at Premium Beat:   \"Seeking Perfection\" by Vincent Tone, available at Premium Beat:   True Persistence by Cymatix, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #samsunggalaxyfold #galaxyfold #fold #foldingphone #foldable #samsungfold #tech",
    "description_links": [
        "https://dbrand.com/samsung",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://bit.ly/2W8swBA",
        "http://www.roaveyewear.com/‎",
        "https://www.premiumbeat.com/royalty-free-tracks/let-em-ring",
        "https://www.premiumbeat.com/royalty-free-tracks/seeking-perfection",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "(upbeat music) - During the first four days I've used this device in public, the two most often asked questions I've gotten are, what is that? And then, is that the Samsung folding phone? During the last four days of my review period, those questions became, is that the Galaxy Fold? And did yours break too? (upbeat music) It doesn't take long for a flawed product to go from setting the world on fire to getting caught in its own combustion, as Samsung knows all too well. The Galaxy Fold has a major issue with its folding display. Note the characteristic pimple that appeared on my phone on day nine. It's a foreign object or some other defect that probably would eventually result in problems similar to these. To see a defect this widespread on a phone that would have cost nearly $ 2000, so soon after Samsung told the world that redoubled its efforts on quality control following the Note 7 fiasco. I don't really know what to call it, it's disheartening, it's surprising, it's almost unbelievable. But all those saying that this will somehow be the death of foldable phones. I think they're wrong, because after 10 days using the Galaxy Fold, I can't wait to get mine back. Here's four reasons I think foldables are still the future. And for other reasons why the present is still Fold free. (upbeat music) Okay, let's start with the arguments against the Fold, chief among them, it's often awkward, me I like a phone that's heavy enough to make my jacket sag, and it's a special nerdy bonus that it resembles a classic smartphone from a decade ago. Most normal folks though, they just want something light and easy and the fold is neither. Worse than that, give your fists a little squeeze while you're holding it and you can feel the two halves of the Fold rub up against each other as the hinge flexes. It seems like a small thing but I've made a habit of calling out companies for charging a ton and then bundling the basics, the Mont Lone Summit2, the Asus Novago, et cetera. And Samsung deserves no more slack than those folks get. This is a company that knows or used to know how to make great hinges. I've been using them for about 18 years. (soft music) I was also wrong about something in my hands-on, the outer display. While I still believe you'll prefer to open to the main screen for most heavy use, that outer screen really does feel too small for a lot of things. Calling an Uber changing music tracks even scrolling Twitter fine, but the minute you need to type something or you wanna watch a video one handed, I just forget it, I expect this to be the biggest advantage Huawei points to when it launches it's Mate X foldable later this year. But Huawei probably won't be able to escape negative number three either. See when you're on the bleeding edge of technology like the Fold is, it's hard not to ship something that looks like a prototype. The giant bezel around the outer display, that raised plastic rim around the interior one and most damningly that gutter of a crease running down the middle. I have a few friends with bad eyesight and none of them had trouble finding the dividing line between the two halves of the display. Even when you view it from the right angle to hide it, you feel it, every time you swipe across it. I mean, this is probably just the state of material science in 2019, there's no way to avoid a crease or a bubble. But it's still unfortunate. My fourth and final reason you might wanna pass on the Fold isn't something obvious like the price or the defects that have rendered its release date indefinite. It's the apps. Right now, most Android apps just don't expect that you're gonna close them and re-open them on a different screen. So if you're expecting the seamless transition between small screen and big, well you often don't get it. The app instead restarts, and puts you back at the top of your feed, or it stays in its small screen configuration even when you open to the big screen. So you need to manually restart it anyway. The inconsistency means every time you use a new app you're kind of like, is this going to work or not? Hopefully the next version of Android helps with this. (soft music) And now for the four reasons I'm gonna miss the Galaxy Fold. Reason one is another thing I was wrong about it my hands-on. The battery life is great. Several times during my week with the Fold I was too tired or too ill to remember to charge the phone before bed. Vacation in my old college town, you know how it is. But despite that, the phone always had at least half a charge when I woke up in the morning. That's impressive, especially after a full 14 to 16 hours of use on day one. So are these cameras. Now I expected to enjoy these because they're the same ones I really liked on the Galaxy S10+, but the Folds big display changes the shooting experience. You know those goobers who take tablet photos at concerts, Well, they do that because tablet screens are so big they make it look like you're taking a great photo, even though most tablet cameras are terrible. Well the galaxy Fold gives you a tablet sized viewfinder, and three very good cameras, telephoto, standard and ultra wide. Hey, shout out to the Sprint store I used to work at. MacArthur Center Yeeey! And if it's too awkward to shoot in tablet mode, 'cause sometimes it is, you can close the Fold back up. This is especially useful for all those selfies. (soft music) On the subject of greatness imported from the rest of the Samsung Galaxy. The Fold has great fundamentals. Excellent voice quality, loud, crisp speakerphone performance with wide stereo separation, and the displays look amazing. Samsung's decision to stick to a capacitive fingerprint sensor was a good one. It's great to scan in with a quick touch to the side of the phone, instead of fiddling with an under display sensor. And one particular bonus from the S10 family has come in quite handy, the Fold comes with Galaxy buds in the box and I've several times used wireless power share to top them back up. It's so nice not to have to bring a separate cable. Finally, the biggest reason I'm sweating for a Galaxy Fold comeback is because right now it's still the only thing I've used in the real world that can be a phone, or a notepad with a huge keyboard, or a TV or four different kinds of camera while changing its size and shape, to be a better version of each of those things. I've read two entire books on the Fold in the past week and I'm sad to go back to my clunky iPad for them. The size and shape makes this the perfect kindle replacement. The Galaxy Fold is its own tripod, Its its own kickstand. I'm excited to see the first apps that take advantage of a half deployed folding phone to function as a mini laptop. Not to mention all the other crazy ideas creators have any dreamed up yet. And when you're done doing all these crazy things, being able to fold it up and put it in your pocket is a beautiful forgotten convenience that's so overdue for a comeback. (soft music) If you think the entire future of foldable phones is in the toilet because of the Galaxy Fold setback, well, you're either a YouTuber trying to justify a ridiculous thumbnail, or you've been misled by one. And since there's no helping the former, I'll address only the latter. Folding phones are still the future folks, and with at least three more expected in 2019. We're just barely getting started. Folks, the matrix skin on my Galaxy Fold came from my sponsor Dbrand. I love it because it lets just enough of that martian green paint job through to make for some fun accents. That of course it protects the phone makes it a lot easier to handle too. If you want your own Dbrand skin they're available for the Galaxy Fold and for most mainstream phones in the market, hit the link in my description to see all the different ways you can Dbrand. As for official timing on that re-release, well, Samsung's official statement is in the description below, and the second I have another Galaxy Fold I'll post it to my Instagram @theMrMobile, And the customary disclosure, this video was made possible by a 10 Day Review device loan from Samsung. No compensation was requested and no copy approval was granted. As always, Samsung is seeing this at the same time you are. Let me know what you think of the Galaxy Fold, the Huawei Mate X, the Motorola Razor and whatever other foldable phones you know about that I might not, down in the comments. Until next time. Thanks for watching and stay mobile my friends. (soft music)",
    "transcript_keywords": [
        "Galaxy Fold",
        "Fold",
        "Galaxy",
        "galaxy Fold gives",
        "Galaxy Fold comeback",
        "Galaxy Fold setback",
        "Samsung",
        "phone",
        "Samsung Galaxy",
        "Folds big display",
        "Samsung folding phone",
        "foldable phones",
        "phones",
        "display",
        "screen",
        "Fold back",
        "Folds big",
        "asked questions",
        "Fold gives",
        "folding phone"
    ],
    "transcript_entity_values": [
        "the first four days",
        "Huawei",
        "day nine",
        "the Galaxy Fold",
        "a ton",
        "at least three",
        "10 days",
        "about 18 years",
        "Galaxy Fold",
        "the Asus Novago",
        "half",
        "MacArthur Center Yeeey!",
        "S10",
        "Samsung",
        "the Samsung Galaxy",
        "the last four days",
        "the Galaxy S10+",
        "Mate X",
        "four",
        "Fold",
        "my week",
        "Dbrand",
        "first",
        "the past week",
        "Fold",
        "The Galaxy Fold",
        "YouTuber",
        "two",
        "Galaxy",
        "Sprint",
        "Fold",
        "a decade ago",
        "the Galaxy Fold",
        "another Galaxy Fold",
        "at least half",
        "later this year",
        "14 to 16 hours",
        "Fold",
        "2019",
        "fourth",
        "second",
        "day one",
        "iPad",
        "Twitter",
        "three",
        "one",
        "Android",
        "nearly $ 2000",
        "10 Day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "FAC",
        "DATE",
        "NORP",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE"
    ]
}