{
    "id": "cGpCUVUmXOU",
    "title": "With Current Gas Prices - How long until my EV is FREE?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-03-28T13:44:00Z",
    "video_url": "https://www.youtube.com/watch?v=cGpCUVUmXOU",
    "category": "Howto & Style",
    "tags": [
        "Electric vehicle",
        "tesla",
        "rivian",
        "nissan",
        "Nissan Aria",
        "EV",
        "best electric car",
        "gas price vs electric",
        "first drive",
        "nissan aria review",
        "gas prices",
        "model 3",
        "electric cars"
    ],
    "views": 539552,
    "likes": 24622,
    "comments_count": 2257,
    "description": "How many miles do I need to drive until my electric pays for itself in Gas Savings?! Today we do some rough math and find out! Obviously the cheaper the car, the sooner it will pay itself off. For example, a Chevy bolt is around $33,000 and would break even with gas prices even sooner than the Nissan Aria 2023.  Huge thanks to Nissan for bringing us out to test drive their cars. Nissan has no editorial control or review over the content of this video. All thoughts are my own.   Check out Dans video here:   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/8FRLkOeThsk",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Behind me is a brand new 2023 Nissan Aria. An all-electric crossover that we have the privilege of taking on a first drive today. Let's get started. [Intro] It's super cool to have this experience. Right now we are in Spain on a professional race track and this is my first time driving this car. But like other electric vehicles, like, it just feels so solid. One thing I love about electric vehicles is that all of the weight is right next to the tires and so it has a super low center of gravity. When you think about it, like a gas powered engine is sitting a little bit higher up off the ground and so it makes the car rock a little bit as you're driving, you know, turning left and right. But this car, with everything so low, it just feels so solid and grippy on the track. It's also raining a little bit, giving us the full experience with the track. One thing I was thinking about on the way over here is that there are so many different kinds of cars on the road, kind of like, you know, a different model for whatever color or shape your heart desires. And so I'm a huge fan that most vehicle manufacturers are coming out with electric vehicles, especially at cheaper price points. It's interesting when you think about the cost effectiveness of driving in an electric vehicle. Accelerating here for a second. Driving a gas powered vehicle, especially now that gas prices are going up all around the world. I think in the United States the average price per gallon is $4.25. And the average miles per gallon of a gas powered vehicle according to the EPA is around 25 miles. So the cost per gallon driving a gas powered vehicle is around 17 cents per mile. But if you factor in, or kind of compare it to electric vehicles, the price per kilowatt in the United States on average is around 13 cents. And as we know, electricity prices have been way way way more stable than gas prices. You can kind of like do the math and factor in how much an electric vehicle is going to cost over its lifespan. It all works out to about 3 or 4 cents per mile when we're driving an electric vehicle. Now if you extrapolate that out and do the math over the whole lifespan of the vehicle, in order to pay itself off in gas savings alone it would take around 300,000 miles, especially considering the price point of this Nissan Aria. I think the basic version starts off around $47,000. But that 300,000 miles is also not factoring in that there's no maintenance on electric vehicles...virtually no maintenance. There's no oil changes. Both cars still have to change out the tires. Both cars still have blinker fluid. And, you know, electric vehicles might actually have to change out their tires more often because of the amount of torque they have while accelerating. -[Dan] Whoo! He just barely squealed the tires a little bit! I didn't do that when I drove. Okay, we're getting to the really fast part where you need to drive 120 kilometers an hour and let's push it on this and get to the max speed because I didn't do it the first time. -Let's do it. Alright so we're going to go around this corner. Also in here a little bit as well. So we're going 84...88...92...100....oh man! 31....36! That was sick! This specific car right here is not...I mean, it's not a race car, and it's not as fast as some other electric vehicle, but it is, you know, it's built for the masses. It's built to be one of the electric vehicles that anyone can buy and enjoy and it's the way technology is headed. So while it does take around 300,000 miles for an electric vehicle to pay itself off with gas prices alone, you start saving that money on your very first tank or fill up of electricity. You might be thinking that 300,000 miles is a lot and you're right. A gasoline powered vehicle with over 200,000 miles would be considered relatively old. But electric vehicles have a whole lot less moving parts and less opportunity for something to go wrong inside of an engine or a transmission. And Tesla, who's been making electric vehicles for a really long time, and has more data than anybody says that their battery packs are still at 90% capacity even after 200,000 miles. And this Nissan Aria is using a very similar lithium chemistry to what the Teslas have inside. So 200,000, or even 300,000 miles isn't entirely out of the question. Eventually this car will pay itself off in gas prices alone. And, of course, one way to make that happen sooner is putting solar on your house or buying used. There's no really good way of getting gasoline from your backyard. But, if you do drive an electric vehicle and you put solar panels on your house, then you end up driving for free. So if you do have solar panels, or you know, if you run an extension cord to your neighbor's, it is very likely to drop the price of your driving down over time, whereas with a gas powered vehicle, I mean you can't like refine oil in your backyard. -Did you say draw an extension cord from your neighbors? Is this something that...Yeah, I mean maybe I do need to be neighbors with you. -This Nissan Aria has two displays. One here off the center console and one here in front of the driver. And they are called monolith displays, meaning that they can kind of interact with each other just like a tablet or cellphone. And I can slide information from this screen onto the main screen as well as I have a heads up display that you can't see there from the passenger seat, but it's in front of me giving me the speed limit, as well as my current velocity. We also have a square rear view mirror up here at the top and repeating geometric patterns all throughout the cabin, which Nissan said was kind of going back to their Japanese heritage. So you might be thinking that the car we've been driving is black, but it is actually green if you catch it in just the right sunlight. There is a green hue to the black which I think is pretty cool. As you've seen, we've been in the driver's seat most of the time. There are heated and cooled seats. This center console can move back and forth. This is in the all-forward position and it can motor all the way back to that point, as well as the repeating geometric patterns that kind of align over the speakers. If we go to the back seat, plenty of room, spacious interior. Kind of the same fabric. Since this is a crossover hatchback, it does have some more storage space underneath these little panels. Not a whole lot though. Not really sure why those are back there unless it's to make it an even plane because the seats do fold flat. With the seats completely laid down I guess it's just more of a flat surface for all kinds of storage, or you know, sleeping back here even. And I think Nissan's paying attention to detail. Most cars have like a rubber, you know, floor mat, but here we have almost shag carpet looking stuff. One thing that is a little bit disappointing though that we've seen in a lot of other electric vehicles, is here on the Nissan Aria, they've actually used the front space for the motor. So there's no storage or anything else in the frunk. All of the storage you get for this car is going to be in the rear and just the normal seats. There is, however, additional storage space here. Kind of like a glove box that we can open up and put some extra stuff inside. On the steering wheel we have quite a few normal buttons, as well as the two displays. And then over here on the wooden dash we have capacitive buttons that are flush with the wood surface. And each time they get pressed there's like a little vibration behind giving haptic feedback that I can feel kind of shaking the dashboard a little bit with each press. The Nissan Aria has the ability to charge at 130 kilowatts, which means that if you're road tripping you can get 180 miles in about 30 minutes. But I imagine most people are just going to plug it into their garage at night and never have to worry about going to a gas station again. The grill here on the front is solid, no air flow. But I do like how long these blinkers are. They are mistakeable when they go from right to left. Quite possibly the largest blinker I have ever seen on a vehicle before. Final thoughts, I'm a pretty big fan of where electric vehicles are headed. I think if someone were to just get in here and sit down and press start, they wouldn't really notice right off the bat that it's not a gas powered vehicle. Grandma could get in here and operate it just fine. If grandma got into a Tesla and accidentally floored it in plaid mode, she would die. The Nissan Aria is a more economical vehicle at a more economical price point. Not every electric vehicle needs to be a spaceship, or have the acceleration of a fighter jet. With the Nissan Aria we don't necessarily need to worry about that because it's built more like a regular car for regular people. Pulling into the pit stop. Still it's super fun that they let us drive on this professional track. You know, most guys are doing like 200 miles an hour, but we're here in these normal electric vehicles. Super, super fun. I'm excited where the future's headed. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "electric vehicles",
        "Nissan Aria",
        "gas powered vehicle",
        "vehicle",
        "electric",
        "powered vehicle",
        "vehicles",
        "Nissan",
        "gas",
        "gas powered",
        "Aria",
        "miles",
        "gas prices",
        "car",
        "driving",
        "kind",
        "powered",
        "price",
        "bit",
        "prices"
    ],
    "transcript_entity_values": [
        "2023",
        "4 cents",
        "92...100",
        "around 25 miles",
        "120 kilometers an hour",
        "around 13 cents",
        "130 kilowatts",
        "two",
        "Japanese",
        "over 200,000 miles",
        "Nissan",
        "4.25",
        "36",
        "31",
        "Spain",
        "about 3",
        "about 30 minutes",
        "around 300,000 miles",
        "Grandma",
        "EPA",
        "the average miles per gallon",
        "90%",
        "200,000 miles",
        "around $47,000",
        "200 miles",
        "the United States",
        "180 miles",
        "around 17 cents",
        "first",
        "second",
        "gallon",
        "Tesla",
        "today",
        "200,000",
        "Teslas",
        "One",
        "84",
        "one",
        "300,000 miles"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "GPE",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY"
    ]
}