{
    "id": "chgG_9rmDgg",
    "title": "OMG Setup #1 - Overwatch!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2016-05-19T00:38:17Z",
    "video_url": "https://www.youtube.com/watch?v=chgG_9rmDgg",
    "category": "Science & Technology",
    "tags": [
        "Ultimate Setup",
        "Overwatch",
        "OMG",
        "Setup",
        "Alienware",
        "Herschel",
        "SteelSeries",
        "3M",
        "PS4",
        "Xbox",
        "Blizzard",
        "iphone",
        "esk setup",
        "ultimate desk setup tour",
        "gaming setup",
        "battlestations",
        "editing setup",
        "ultimate gaming pc",
        "gaming pc budget build",
        "man cave",
        "best gaming setups",
        "desk tours",
        "pcmasterrace",
        "amd gaming",
        "gtx graphics cards",
        "epic desk tour",
        "epic gaming setup",
        "dream setup",
        "dream desk",
        "ultimate setup",
        "perfect desk",
        "Laptop Setup"
    ],
    "views": 343453,
    "likes": 8309,
    "comments_count": 736,
    "description": "O.M.G. Setups Episode 1 - Overwatch The Ultimate Laptop Setup for Online Mobile Gaming  Gear List: Overwatch -  Herschel Pack -  Alienware 15 -  Dbrand Skins -  Steelseries Mouse -  Steelseries Headset -  Mousepad -  Ravpower Pack -   Music Credits:  Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: FILI - Domo  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/25bBkbR",
        "http://amzn.to/25bA1tD",
        "http://amzn.to/1R9llhi",
        "http://bit.ly/1VL7O7c",
        "http://amzn.to/25bt6R7",
        "http://amzn.to/1R9lzVH",
        "http://amzn.to/25btbUQ",
        "http://amzn.to/1W35cCf",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going guys? This is Dave 2D and welcome to the first episode of a series that I'm very excited to share with you guys called OMG setups. Now in this particular case OMG stands for Online Mobile Gaming and if you've seen my channel I do a lot of stuff on laptops So I do most of my work on a laptop most of my video editing on a laptop But I also play most of my games on a laptop so in this series I want to showcase an upcoming game something that I'm super excited about something that I've experienced I want to share with you guys as well as some hardware to play that game while mobile So I'm glad you guys are here for the first one. I hope you guys enjoy this series. Let's go mobile! Overwatch is a first-person shooter developed by Blizzard you might know them from other franchises like Warcraft or Starcraft or Diablo They've been making games for years in almost every game that they put out has been wildly successful for years Blizzard was working on a project called Titan they spent a ton of time working on this thing something like seven years But they ended up scrapping it and from its ashes came over watch their first new franchise in 17 years They created a whole new world for the game with backstories and animated shorts for some of the characters so when I played the beta last year the big question I had was what makes this game different from Other shooters like what makes this Blizzard game because they don't develop games that are just pretty good, right? They tend to make some real bangers Overwatch nails all of the standard shooter stuff, so awesome graphics cool weapons, snappy controls, but there's a lot of games like that What makes it unique are the characters these aren't classes like team fortress? Or other [team-based] shooters these are 21 individual characters all of them extremely different from each other in play style and feel and yet somehow They're all relatively balanced, but what ties everything together is that each of these characters have a unique ultimate ability? It's essentially a super move that you can use once you've done enough damage in a match So at first it seems kind of cool if you do enough [stuff] you get to use this fun ultimate ability and then you repeat the process but then you realize that there's strategy and Synergy to these ultimates Similar to strategies in mobas like dota so as you play you learn to coordinate your abilities with your team to do some more advanced Stuff and that's where the magic lies because with good timing and coordination You can make some awesome plays and that's essentially what makes overwatch special You still need good reflexes, but I've never played another shooter that had this kind of depth to the decision-making and strategy It's a lot of fun, and I think it'll do well in the competitive esports market So I've played overwatch on a lot of different hardware but for this video I chose some gear that was kind of themed to the orange and white of the game if you want to check this stuff out I'm going to put links to all of these products in the video description So the packet went with is a Hershel Lennox pretty clean looking bag and a the area for the laptop It's not specifically designed to hold a bunch of tech But it holds what I need and most importantly It's not butt ugly like most tech backpacks the smartphone is an iPhone 6s Wrapped in a white and orange skin from DBrand and one really useful accessory is this battery pack from ravpower So it's got flip-out prongs to charge it And then a built-in lightning cable to charge any Ios device super simple And it has no cables to lose The laptop is an alienware 15 this one has a 1080p panel and has some pretty fast components It easily handles over watch when I'm playing with graphics maxed out at 1080p and still getting over 60 frames per second now There's a lot of good gaming laptops out there but the things I like in particular about the Aw15 it's got a great keyboard for gaming thermal management is on point And it's got a lot of internal drive slots for recording Gameplay or video edits I'm also a sucker for that light up trackpad the minimum requirements are actually relatively light I'm glad that they optimized the game like this people with older hardware can still play the mouse is a white Rival 300 from Steelseries side grip color adjustable leds for the logo and scroll wheel Great ergonomics, and adjustable DPI it goes from 50 up to 6,500 the mouse Pad is from 3M I use these often at work, and I've grown to love them. They have a slightly sticky bottom. It's not tape or anything It's just grippy And it's awesome for transporting around there are two main Sniper classes widowmaker is Easier to Aim with because her rifle shots are instant You line it up in the scope and you can get some nice kills Honzo's Bow and Arrow has travel time and the shot drops so it's definitely a harder character to aim with But it doesn't matter which [of] these characters you're playing with you want a good mouse on a good surface for sniping The Headset I went with is the steelseries siberia 200 in white super comfortable headset with a retractable mic And it has inline volume and mute controls the voice clarity on the mic is good Now overwatch [has] voice chat built into the game so you can communicate with teammates even in pickup games The positional audio and overwatch is really well done possibly the best of experience in a game each of the 21 characters have their own Unique footstep sound so not only can you hear enemies through walls and stuff, but if you're experienced? And you have a good ear you can actually tell which character it is and then prepare accordingly It's pretty cool now having played this for a few months. [I've] really enjoyed it I think it's going to be a pretty popular game and hope some of you guys get to play it as well if you're not Part of PC. Master-Race. It's available on PS4 and Xbox as well just know Mac client yet I'm still not very good at it but one [of] the most important elements of the game is knowing when to switch characters during a match and Obviously which character to switch to because changing to a different character at the right time can make a huge difference for your team? So [unlike] many strategy games where you're stuck with the one character [that] you chose the beginning of the match in overwatch You can switch in fact it's encouraged to switch because team composition is such a big part of the game So the game cost $40 But I'm actually going to be giving away a couple keys if you want to win one follow me on Twitter and Instagram Because I'll be running the contest there. Hope you guys enjoyed this video Give me some thumbs if you liked it subs if you loved it, it's been nice, and I hope to see you guys in overwatch",
    "transcript_keywords": [
        "game",
        "guys called OMG",
        "guys",
        "Overwatch",
        "good",
        "Online Mobile Gaming",
        "characters",
        "games",
        "lot",
        "character",
        "play",
        "good gaming laptops",
        "laptop",
        "called OMG setups",
        "stuff",
        "Blizzard game",
        "video",
        "pretty",
        "makes",
        "Blizzard"
    ],
    "transcript_entity_values": [
        "Unique",
        "Hershel Lennox",
        "60",
        "21",
        "Dave",
        "Synergy",
        "a few months",
        "Titan",
        "6,500",
        "years",
        "Starcraft",
        "Easier to Aim with",
        "Mac",
        "one",
        "Xbox",
        "17 years",
        "Warcraft",
        "40",
        "Master-Race",
        "second",
        "1080p",
        "Steelseries",
        "50",
        "DBrand",
        "200",
        "Twitter",
        "Overwatch",
        "a ton",
        "Online Mobile Gaming",
        "Sniper",
        "Arrow",
        "two",
        "Honzo",
        "Pad",
        "first",
        "seven years",
        "15",
        "300",
        "last year",
        "PS4",
        "Instagram",
        "1080p"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}