{
    "id": "cjFj6N-Dkaw",
    "title": "My First Electric Skateboard...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-12-06T17:54:16Z",
    "video_url": "https://www.youtube.com/watch?v=cjFj6N-Dkaw",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "evolve",
        "skateboard",
        "skateboards",
        "evolve skateboard",
        "evolve skateboards",
        "electric",
        "electric skateboards",
        "boosted",
        "boosted board",
        "vs",
        "boosted board vs",
        "gt",
        "best",
        "2016",
        "amazing",
        "inventions",
        "futuristic",
        "cool gadgets",
        "cool",
        "cool gadget",
        "cool technology",
        "new inventions",
        "amazing inventions",
        "innovation",
        "new gadgets",
        "awesome inventions",
        "things",
        "board",
        "electric skateboard",
        "cool inventions"
    ],
    "views": 2002534,
    "likes": 55351,
    "comments_count": 3054,
    "description": "Today's mystery video ()    Evolve Skateboards -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/bbDmsb6rqp4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://www.evolveskateboards.com/",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So if you guys have been around youtube You've probably seen all kinds of videos about Electric skateboards It seem like they're the hottest thing right now But believe it or not, I have not done a video on An electric skateboard At all, yeah. But that's changing right now because I've got the carbon series from Evolve Skateboards And I've been pumped up to receive this thing It's made out of carbon fiber It's super cool looking It's fast And it can even be transformed from a street version With street tires to an actual off road verison So I'm definitely going to injure myself I don't know which configuration they've sent It's kind of a surprise That's the cool part You can tell it's a pretty big box But let's crack it open, charge it up And get into some trouble Now keep in mind, my experience level With electric skateboards is limited Woah This thing is serious Wow That's like an actual transportation device You got the grip tape with the cutouts so you can see the carbon fiber the whole way through Look at the size of these tires If you've ever rode any kind of electric transportation in the past You know that when you're going on a sidewalk for example or over some bumps Having a small street tire makes it a little bit more difficult So, a tire like this is gonna roll right over that You'll hardly even notice it Woah On the back, where the drive train is, that's pretty wild And the belt goes around here It's cool because I guess the battery unit is all enclosed in here Man, that carbon fiber looks nice And over here we have a power switch And this is the charge port, it looks like I've got the street conversion kit Allen wrench Probably for the wheels tires And here's the remote Woah It's got like a screen on it So this is how you're gonna accelerate, slow down Charges over micro-usb And it even has a screen on it, that's pretty wild Let's see If it has some power It'll tell you how fast you're going, wow How far you've traveled, how fast you're going, and a precentange of battery life All on this display right here, that is pretty sweet A charge brick, extension cable, and here's the conversion kit, street conversion kit Since, you can tell it's got the off road tires already on it Some road-ready, street, wheels I'm a be learning as we go, As we go ride this thing,along with you So let's take this over to the new studio where we have a lot of space And let's see if I can stand up straight or not So, the thing has some charge in it In fact, what I like is the remote is actually telling me 91% charged over here And another thing I noticed, Just an experiment, If you tap this button here You can put it into reverse mode Now, keep in mind it has the off road tires on So the center of gravity is up a little higher I feel like I have a lot of control over it, a surprising amount of control And can make pretty tight turns too Now keep in mind guys, I'm not like a skateboarder at all I got no skills What do you say Tom, you ready? Whats your experience level? Skateboarding? Not great You're gonna feel it in a second You'll feel more comfortable Ooooh, little more juice Alright give the people some feedback, what do you think? Pretty amazing I would imagine it goes a lot faster in a straight line Yeah definitely, in a straight line. It's on Eco mode right now as well Oh no, you put it on GT mode? Yeah I hit a button right before I got on You put it on GT mode! Yeah it's going pretty fast Oh let me try I was on Eco mode Whoa, that's the difference Whoa baby, wow I think Eco mode, for the record, is perfectly fine for most people Like I felt breezy enough on the Eco, which is also gonna give you a bit better battery life I assume based on the name But this GT You wanna get crazy? We did the conversion on it It's now got the street wheels If you've ever messed around with a skateboard If you've put new wheels, new trucks on a skateboard, you can handle a Allen wrench You're pretty much good to go But it's a much smoother ride Then the other, off road tires Having the lower center of gravity Just being closer to the floor Whoa If you're riding around on the street, or on flat surfaces or whatever You're not planning on going off road this is probably the better bet for you But the best thing about this skateboard, is that it can do both So this unit also has regenerative braking so It can actually charge up it's own battery If you use the braking system on here So it'll give you a little bit more juice In the entire time we've been riding it, we're down to about 80% battery life And I think we started around 87% So either way, this thing is a ton of fun, and it does both. Off road, street, indoor, outdoor It's a versatile unit and it's a ton of fun And tom agrees with me Tom? There you go, tom had fun Give tom a thumbs up, Ok? I'm out",
    "transcript_keywords": [
        "Electric skateboards",
        "thing",
        "carbon fiber",
        "street conversion kit",
        "Eco mode",
        "Eco mode Whoa",
        "Evolve Skateboards",
        "Electric",
        "street",
        "hottest thing",
        "skateboard",
        "pretty",
        "conversion kit",
        "conversion kit Allen",
        "road tires",
        "Woah",
        "remote Woah",
        "tires",
        "electric transportation",
        "street tire makes"
    ],
    "transcript_entity_values": [
        "second",
        "about 80%",
        "around 87%",
        "Eco",
        "a ton",
        "GT",
        "91%",
        "Evolve Skateboards",
        "Tom",
        "micro-usb",
        "tom"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "PERCENT",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON"
    ]
}