{
    "id": "CJisIIUIbT8",
    "title": "What Is A Chromebook, Anyway?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-08-05T20:24:11Z",
    "video_url": "https://www.youtube.com/watch?v=CJisIIUIbT8",
    "category": "People & Blogs",
    "tags": [
        "chromebook review",
        "asus chromebook flip",
        "chromebook 2016",
        "chromebook tips and tricks",
        "chromebook vs laptop",
        "chromebook android",
        "michael fisher",
        "mrmobile",
        "pocketnow",
        "android authority",
        "android central",
        "chromeos",
        "chromium",
        "notebook computer",
        "laptop computer",
        "cheapest laptop",
        "cheap laptop",
        "cheap notebook",
        "best chromebook",
        "chromebook",
        "chromebook (computer)",
        "chrome",
        "oneplus 3",
        "note 7",
        "captain2phones",
        "mobile nations"
    ],
    "views": 270634,
    "likes": 6916,
    "comments_count": 788,
    "description": "Chromebooks have been the hot laptop replacement for the past few years, more than a tablet and somewhat less than a netbook. But whats it like to use one, and is the cheap price tag worth the sacrifices? It may be hard to believe, but MrMobile never used a Chromebook until this week! Fortunately, he just got his hands on one for the very first time  so come along for his first-ever Chromebook hands-on!   [SUBSCRIBE]     [PRODUCT]  ASUS Chromebook Flip C100PA-DB02 Buy on Amazon:    [ABOUT THIS VIDEO]  Michael Fisher's Chromebook Hands-On was produced following four days using an ASUS Chromebook Flip C100PA-DB02 on loan from Android Central. The full ASUS Chromebook Flip review is available here:    [SOCIALIZE]         [MUSIC]  \"The Ballad of MrMobile\" (Mobile Nations, 2016)  \"E-Business\" by Olive Musique, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/8",
        "http://www.androidcentral.com/asus-chromebook-flip-c100-review",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/e-business",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Speaker] People are always looking for ways to get a laptop without spending laptop money. Eight years ago, it was netbooks, four years ago, it was tablets, and today, it's Chromebooks. Modest little laptops from Google that I've largely ignored. But then something interesting happened. Chromebook shipments overtook Mac shipments for the first time, and that made me wonder what I was missing out on. I'm Michael Fisher, and yeah, this is my first Chromebook. It's also maybe my last. The first thing to understand about Chromebooks is that there are bajillions of them. As this video goes to press the Google Store features 25 different models from 11 manufacturers ranging from run-of-the-mill clam shells to super rugged field computers. The model I've been using is the Chromebook Flip, which retails for a bit below the average selling price of $295. That's the second thing to understand. Chromebooks are popular in large part because as my fellow kids say, they're cheap A.F. For my first couple days on the Chromebook, all I could see was the cheapness. As I mentioned in my Everyday Carry video, my primary computer is a 15 inch MacBook. So the Flip's smaller, lower resolution screen is a big let down. The Flip makes me feel like an old timer, making me hunch and squint whether I'm in laptop or tablet mode. It's processor is neither Intel nor Qualcomm nor Tegra, but a Rock Chip, which maybe accounts for it bogging down on some webpages, or maybe that's Chrome OS itself. There's a reason the operating system shares a name with the web browser. While Chrome OS does have a desktop and a notification area and a little bar to pin your programs to, almost all of those are actually web apps that run within the Chrome browser. And that makes it pretty easy to learn a Chromebook. If you're like me, you spend most of your time in the browser, regardless of which computer you're using. And since the Chromebook pulls from your Google account, everything you've synced with Chrome on your other machines comes over with you. That includes things like passwords and bookmarks, and you'll find all the usual keyboard shortcuts in place as well. When you're in the browser, you almost forget that you're using a $300 machine instead of a $1,300 one. And that's exactly what makes the Chromebook so appealing. The big caveat is that you need a stable and speedy connection to the internet for most of this to work. On a recent train ride, I tried streaming Spotify through the web client, and the constant skipping made me wish I'd loaded music onto a micro SD card in advance. Remember, most every thing on a Chromebook is running in the browser, which becomes a lot less useful the moment your Wi-Fi connection has a hiccup, which it will on Amtrak or an airplane. Fortunately, that doesn't leave to the kind of battery impact I expected. In fact, this thing is a champ when it comes to endurance. Starting with an 80% charge one morning, I used the Flip continuously for five and a half hours, and when I finally gave it a rest, it still had 15% left. Every model will perform differently, but excellent battery life seems the rule, rather than the exception when it comes to these. In my time with the Chromebook has taught me that Chromebooks aren't really for me. I'm in the minority on this, but I prefer using the Android powered Pixel C. With the latest software, it's actually a really nice productivity device that's much less cumbersome in tablet mode, and it's gorgeous to boot. But here's the thing: The Pixel C is also more than twice as expensive as most Chromebooks, and it certainly doesn't offer twice the functionality. So, if you're a penny pincher, a college student, or a former college student with more loan notes than dollar bills, a Chromebook makes a lot of sense as a low cost laptop. That's especially true considering the big upgrade Chrome OS is about to get. Soon, you'll be able to run almost any Android application on a Chromebook as well, which will do a lot for its offline utility. Just keep two things in mind: First, if you already own a modern tablet, iOS Android or Windows, doesn't matter, consider buying a keyboard accessory for it instead. It'll be way cheaper, and you'll likely get much of the same functionality. And second, if you do decide to buy a Chromebook, make sure you've got a solid internet connection wherever you're planning to use it. There's a button below labeled Subscribe. Push it if you wanna be the first to see new videos just like this one. And hey, if you have a Chromebook, leave a comment below telling me which one and what your Chrome OS experience has been like. I wanna hear about it. Until next time. Thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Chromebook",
        "spending laptop money",
        "Chrome",
        "Chromebook Flip",
        "years ago",
        "Flip",
        "browser",
        "thing",
        "laptop money",
        "Google",
        "spending laptop",
        "Chromebook makes",
        "laptop",
        "Chromebook shipments",
        "Chromebook shipments overtook",
        "Chrome browser",
        "makes",
        "Android",
        "time",
        "Google Store"
    ],
    "transcript_entity_values": [
        "First",
        "four years ago",
        "295",
        "Chromebook",
        "15%",
        "Qualcomm",
        "MacBook",
        "Wi-Fi",
        "Spotify",
        "Rock Chip",
        "Chromebooks",
        "Mac",
        "25",
        "today",
        "first",
        "Tegra",
        "A.F.",
        "Google",
        "Intel",
        "$1,300",
        "five and a half hours",
        "one morning",
        "two",
        "Flip",
        "Amtrak",
        "second",
        "Chrome",
        "11",
        "Eight years ago",
        "Windows",
        "SD",
        "a penny pincher",
        "Michael Fisher",
        "my first couple days",
        "Android",
        "300",
        "80%"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "PERCENT"
    ]
}