{
    "id": "ClHHPLMx5xE",
    "title": "LG QNED Mini LED TV Unboxing!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-12-30T15:19:24Z",
    "video_url": "https://www.youtube.com/watch?v=ClHHPLMx5xE",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 293485,
    "likes": 9910,
    "comments_count": 662,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and we're back in the new studio with the first TV unboxing. And I cannot wait because this is something that the studio needed. We really needed a new television to brighten up this space. And, I could not be more excited because this is one of the new LG QNED Mini LED TVs. I did see some early prototypes over the years of Mini LED TVs. And I can't wait because guess what? It is here in the studio, and we're gonna unbox it, and set it up, and check it out. And I was kinda just like walking around the box, checking out the specs, seeing what I can see. Look! This is the new magic remote with NFC. Thanks to LG for sponsoring this video, and giving this new TV a wonderful new home. (box ties snapping) (cardboard ripping) I don't think I've even cut the tape. I've just cut the box. (chuckles) (tape snapping) (paper rustling) Some assembly, looks to be required. (box rustling) Oh no. Oh boy. Okay, yup. Yup. (groaning) I just missed trash day. Yeah, I'll just um, there, that's nice. All right little TV that is not so little, welcome to your new home. All right, so it looks like I may use some small assist. (paper rustling) It's a little heavier than I thought. (paper rustling) (upbeat music) (paper rustling) (upbeat music) Well, the legs are on. I think I'm actually gonna set it up right here on this desk. And this can be kind of like the studio TV. - [Man] It goes right in the middle. - Oh my. (upbeat music) I also just realized in the intro that I didn't tell you guys that this is an 8K television. Oh, there's another sticky. (upbeat music) (paper rustling) Satisfying. (upbeat music) So we have it all set up. It's plugged in. I can't wait to see what this thing looks like. I am interested to see how this NFC remote works. - [Lady] Press the okay button, wheel on your remote. Volume 15, 19, 20. (upbeat music) - Whoa. Whoa. (upbeat music) Oh my gosh. LG's deep learning technology can enhance image clarity and resolution according... Whoa, I definitely heard a huge difference. See if you guys can hear a difference. (upbeat music) This is without the sound pro turned on. (upbeat music) Whoa. That's incredible. Second activate TV to the ThinQ app, which connects all of my other LG devices together like my washer, my dryer, my LG styler, and even my vacuum. So I can actually get a notification on my TV when my clothes are done in the washer or dryer. I know, pretty awesome. I think now it's finally time to watch something. Whoa, this looks absolutely... Oh my God. (upbeat music) Like I've done a lot of video reviews on TVs before, but like actually sitting here and seeing the freaking future. (upbeat music) So this is my first Mini LED TV and this type of TV tech just recently started rolling out into the mainstream. We've pretty quickly evolved from CRT to the backlit TV using LCD and OLED with self lighting pixels. The difference with Mini LED is that they are about 140 of the size of a regular LED. There's also greater control over dimming zones, leading to much deeper blacks and a higher contrast ratio than other types of LED TVs. It is really difficult to show you how incredible this picture quality is through a YouTube video, but having this be my first experience with the Mini LED TV, I'm absolutely blown away. (upbeat music) These colors are so incredibly vibrant and the thing I love about HDR is it really does give you that just impressive color range. Like these blacks, that actually doesn't even look like the TV is on. Like, you don't even see anything. I'm even so close to this TV, but like the detail, everything is so crisp. Like I can watch this TV from here. I mean, you probably shouldn't do that, but I could. One of the things I love about smart TVs is all of the built-in apps. It's really cool because this actually does have Apple TV built in. So you can enjoy all of the Apple TV content. There's even LG fitness. And of course, you can sell any of your favorite streaming services. Even the remote now has Netflix, Prime Video, Disney+, LG channels. It has Alexa and Google built directly into the remote. And I love the new NFC feature. So you can share content directly from the remote to your TV. We can also do airplay directly from our phone to the TV. So I'm gonna airplay a piece of content, just a little knife fight action. No big deal. (upbeat soft music) I love that I can just talk to my TV by pressing this little microphone button. I can change settings, I can adjust the volume, and I can even fix a leaky faucet. How do I fix a leaky faucet? (upbeat soft music) Oh yeah. I'm gonna fix that leaky faucet. Maybe even... How do I get rid of ants? Looks like some of these people have even more issues than I do. Set volume to 10%. (TV bleeps) Pretty cool. (TV bleeps) Thank you. - [Lady] I look up thank you in YouTube. - That's not, I... Okay. (chuckles) Viewing angles is also pretty impressive. So even if I'm like, kinda right off here to the side, like you're still going to be getting an incredible view of this TV. Hey, Tyler, can you hit the lights real quick? (upbeat music) (Justine gasps) Oh, this is a cinematic viewing experience if I've ever had one. This is just what the studio needed. (Justine howling) (upbeat music) The entire design of this TV is beautiful with minimal bezzles and a super slim design with its Quantum Dot NanoCell display, full array dimming using the Alpha 9 Gen4 processor 8K. This gives you an immersive viewing experience. It also features Dolby vision IQ and Dolby Atmos for the best in class HDR. And as a creator myself, I love when a TV has a filmmaker mode. This turns off motion smoothing and preserves, original aspect, ratios, colors, and frame rates that the creator intended. With HDMI 2.1 and game optimizer you'll get the best viewing experience with picture quality that optimizes depending upon the genre of game you're playing. Well, thank you guys so much for watching. I'm gonna put a link in the description if you wanna check out more information about this TV and all of the amazing things that LG has to offer. And with that, my friends, I will see you in the next video and I'll just be right here, watching TV. I love watching TV. (upbeat music)",
    "transcript_keywords": [
        "Mini LED",
        "Mini LED TVs",
        "QNED Mini LED",
        "LED",
        "LED TVs",
        "studio needed",
        "Mini",
        "Justine",
        "studio",
        "love",
        "remote",
        "Whoa",
        "video",
        "TVs",
        "QNED Mini",
        "needed",
        "NFC",
        "set",
        "guys",
        "wait"
    ],
    "transcript_entity_values": [
        "LG",
        "Apple",
        "Justine",
        "YouTube",
        "20",
        "the years",
        "CRT",
        "LCD",
        "Alexa",
        "NFC",
        "Google",
        "LG QNED Mini",
        "about 140",
        "Second",
        "8",
        "9",
        "Netflix",
        "10%",
        "2.1",
        "Quantum Dot NanoCell",
        "15",
        "Mini",
        "Tyler",
        "first",
        "Apple TV",
        "Dolby",
        "19",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}