{
    "id": "clo2Gq5Gydg",
    "title": "Nintendo kind of sucks, actually",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-11-21T05:38:54Z",
    "video_url": "https://www.youtube.com/watch?v=clo2Gq5Gydg",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Nintendo",
        "Super Smash Bros",
        "The Big House",
        "tournament",
        "Slippi",
        "netcode",
        "online",
        "cease and desist",
        "cancelled",
        "DMCA",
        "takedown",
        "Twitch",
        "Hyrule Warriors",
        "Age of Calamity",
        "Hyrule Warriors: Age of Calamity",
        "Melee"
    ],
    "views": 464211,
    "likes": 29654,
    "comments_count": 1422,
    "description": "Get up to 25% off everything sitewide plus free shipping until Dec. 2nd at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 Tech Daddy is Linus 0:10 Nintendo shuts down Smash tourney, Twitch streamers 1:19 Apple privacy stuff 2:17 Gnome Chompski goes to space 3:17 Vincero 4:00 QUICK BITS 4:02 YouTube ads on everthang 4:35 Stadia / Geforce Now coming to iOS 5:00 Intel NUC M15 5:19 Arecibo telescope shutting down 5:38 Roblox goes public  NEWS SOURCES  NINTENDNOOOO WTF is Nintendo doing? - Shuts down Smash tournament   DMCA takedowns for Twitch streamers playing Age of Calamity   I KNOW THERE IS GOOD IN YOU Apple and IDFA   EU complaints   GNOME CHOMPSKI CANCELLED Gabe Newell sending Gnome Chompski into space   parachute  Half Life 2 new achievement   QUICK BITS  YOURE ALL PARTNERS, *IN HERE YouTube putting ads on non-Partner videos   also audio ads   GAMES FIND A WAY Google announces Stadia web app for iOS   Geforce Now too   WHEN A NUC ISNT A NUC Intel NUC M15 whitebook      E.T. STUCK HERE The Arecibo Telescope is being taken out of commission    MULTI-META-VERSE Roblox goes public to build the metaverse     ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://vincerowatches.com/techlinkedsale",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1271346-nintendo-issues-cnd-to-tournament-organizers-for-using-project-slippi-an-emulation-mod-allowing-a-20-yr-old-game-to-be-played-online/",
        "https://www.shacknews.com/article/121617/the-big-house-smash-melee-ultimate-online-event-canceled-following-nintendo-cease-desist-order",
        "https://linustechtips.com/topic/1271234-nintendo-issues-dmca-takedowns-against-hyrule-warriors-age-of-calamity-streamers/",
        "https://arstechnica.com/tech-policy/2020/11/apple-moving-forward-with-plan-to-limit-creepy-user-tracking/",
        "https://www.forbes.com/sites/johnkoetsier/2020/06/24/apple-just-made-idfa-opt-in-sending-an-80-billion-industry-into-upheaval/?sh=13fd779f712c",
        "https://www.ft.com/content/aa43188a-0624-48b2-bc18-96b1e78df836",
        "https://linustechtips.com/topic/1270977-gabe-newell-sends-half-life%E2%80%99s-gnome-chompski-into-space-thursday-for-charity/",
        "https://www.space.com/rocket-lab-launch-booster-recovery",
        "https://techcrunch.com/2020/11/19/rocket-lab-makes-its-first-booster-recovery-after-successful-launch/",
        "https://www.kotaku.com.au/2020/11/half-life-2-episode-2-just-got-a-new-achievement-because-gabe-newell-is-shooting-a-gnome-into-space/",
        "https://linustechtips.com/topic/1271190-youtube-monetized-ads-on-channels-who-were-not-qualified-for-it/",
        "https://9to5google.com/2020/11/20/youtube-to-begin-putting-ads-on-non-monetized-channels-but-wont-pay-creators/",
        "https://www.xda-developers.com/youtube-audio-ads-during-background-playback/",
        "https://www.kitguru.net/gaming/matthew-wilson/google-stadia-is-coming-to-ios-as-a-safari-web-app/",
        "https://9to5google.com/2020/11/19/stadia-will-be-playable-on-ios-via-safari-in-the-coming-weeks/",
        "https://blogs.nvidia.com/blog/2020/11/19/geforce-now-on-ios-safari/",
        "https://www.slashgear.com/intel-nuc-m15-laptop-kits-revealed-small-and-powerful-19648150/",
        "https://ark.intel.com/content/www/us/en/ark/products/205490/intel-nuc-m15-laptop-kit-lapbc710.html",
        "https://www.guru3d.com/news-story/intel-releases-the-nuc-m15-laptop-kit.html",
        "https://www.youtube.com/watch?v=3Kg2DymFmDI",
        "https://www.engadget.com/what-were-losing-with-the-destruction-of-the-arecibo-telescope-173040347.html",
        "https://www.youtube.com/watch?v=JaRGzm3m0pM",
        "https://www.theverge.com/2020/11/19/21578491/roblox-ipo-announced-dau-increase-pandemic",
        "https://www.cnbc.com/2020/11/19/roblox-s-1-ipo-filing-released.html",
        "https://www.washingtonpost.com/video-games/2020/04/17/fortnite-metaverse-new-internet/",
        "https://www.oculus.com/facebook-horizon/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Look, Tech Daddy is giving us a timeout so I'm in my room. But that won't stop me from (laughing) doing the Tech News even though I'm grounded. (laughing) I'm not supposed to. Nintendo, beloved for their cutesy characters and family friendly games, put on its bad guy mask again this week as the company ordered The Big House, an annual Smash Bros tournament, to cancel this year's event. The year is The Big House's use of Slippi, not the frog (laughing) from \"Star Fox.\" It's a mod for \"Super Smash Bros. Melee\" that improves online play, which would have been especially useful in this case as the tournament was an online only event. - [Man] No. - It's organizers were apparently asked not to use Slippi and they refused, at which point Nintendo sent a cease and desist letter, meaning no consent, leading all of The Big House events to be canceled including the \"Super Smash Bros. Ultimate\" portion of the tournament, which would have used an unmodded copy of the latest Smash game. This morning Nintendo also banned a number of Twitch streamers from Australia, New Zealand, and Japan for playing \"Hyrule Warriors: Age of Calamity\" as the game launched in their respective countries, seemingly because the game hadn't launched worldwide yet. - [Man] Wait for it. - Honestly, if it was EA pulling this crap, they'd be skewered online. But for some reason, it's hard to stay mad at Nintendo. You know, they're like dogs, they're like \"Nintendogs.\" They don't know what they're doing. They just poop on your floor, but it's so cute when they do it. - [Man] Oh, he's a Chungus. - We might mock Apple a fair bit around here, but they do at least seem to care about privacy a bit more than their big tech counterparts. That's evidenced by an iOS 14 feature called App Tracking Transparency or ATT that allows you to just to be notified and opt out of being tracked using their I-phone's unique IDFA code which stands for Identifier For Advertisers. Apple delayed the feature to next year after Facebook and advertising firms, whose business relies on that type of tracking, complained about it. But now the fight is intensifying again with Apple accusing Facebook of invasive tracking and Facebook accusing Apple of abusing their market power to boost their own data collection. Everyone sucks. On the other side of the issue, Apple is under investigation in the EU for allowing IDFA tracking at all. So they really can't please everyone here. I sort of feel bad, you know? You know, you know what Apple? Those M1 Macs are pretty cool. - [Man] They're all right. - I'll give you that one, you need a little boost, you know? And if you've played \"Half-Life 2,\" you're probably a millennial and you might be familiar with Gnome Chompski, with a G, a gnome that awards you an achievement if you carry it through the entire game and place it inside a rocket. Well, Valve President Gabe Newell has brought the meme to life by sending a real-life replica of the gnome on Rocket Lab's Electron Rocket as it delivered a payload of satellites into real-life orbit. The launch marks the first time Rocket Lab has successfully returned a rocket second stage to Earth using a parachute, not as cool, it's like landing itself, but Chompski won't be around to celebrate. He's still in space on the kick stage which will burn up on re-entry. - [Man] But how will they know what to think about economics? - Don't worry. (laughing) He'll be remembered with two new achievements in \"Half-Life 2,\" a game that launched 13 years ago. You know, I respect Valve's priorities. Why make \"Half-Life 3\" when you can do this kind of stuff instead? - [Man] I much prefer this way better. - It's a better ending because he's just carbon now. (laughing) Now it's a time for the quick bits brought to you by Vincero, provider of classy time pieces that look good, no matter what your budget, unless your budget is zero because this is a business. Vincero creates exceptionally crafted, sustainably made modern watches, all that at an affordable price. They understand the frustrations of online shopping and that's why they make it easy for you. They offer 30-day returns and guarantee your watch for two years. And they're currently having their biggest sale of the year with up to 25% off site-wide until December 2nd. The discount will be automatically applied at checkout. So no need to apply any coupon code. Avoid the holiday stress and order your stuff online today, and you'll get 25% off if you use our code plus free shipping, Vincero. Quick bits, (bell dinging) they're on for BOGO. YouTube is facing some backlash after announcing that ads will be enabled on videos by creators not currently in the YouTube Partner Program, who also won't get a share of the ad revenue until they do become partners. If creators really don't want ads on their videos, though, they can remove monetization from their channel by violating the terms of service. (fingers snapping) So there's that. YouTube is also adding audio only ads for music playback. You can get mad, but apparently, YouTube still barely makes any profit at all. So maybe they should start thinking about getting a Patreon. (laughing) It's official, game streaming on iOS is a Safari affair. Google has announced they'll be bringing Stadia to iPhones and iPads through a web app access through a browser. And Nvidia will be doing the same thing with their streaming service GeForce NOW. This makes so much more sense than having a normal streaming app on the App Store like every other platform, Apple. Great call. - Thanks. They're truly a leader. - Intel has announced the NUC M15 laptop Kit, a so-called White Book, ooh, meant to be used as a baseline device that manufacturers can modify, rebrand, and sell. I guess NUCs are now something more than just tiny PCs that are missing some storage and RAM. I know it's weird, it's 2020, we're all trying to adapt. The damage inflicted to the Arecibo radio telescope is too severe to repair safely. So the observatory will be shut down and dismantled according to the National Science Foundation. Without the telescope, our ability to listen for alien signals will be considerably reduced. So here's hoping the invasion doesn't happen until after we build a replacement. We're sitting ducks here, thanks entropy. And smash hit kids' game \"Roblox\" has gone public after experiencing a 68% revenue increase in 2020 so far. The game's creators are looking to turn it into a more of a social space that can serve as a sort of metaverse, which is exactly what \"Fortnite\" and Facebook's \"Horizon\" are trying to do. I would say it kind of sucks that these are the companies that are creating the virtual universe of the future, but who am I kidding, we deserve this. - [Man] We've done horrible things. - We must atone, and you deserve a nice restful weekend. So recharge and then come back on Monday for more Tech News. We may have paninis by then. - No. - But no promises. - [Man] Oh, that's why I come here. - I'm here for the panini.",
    "transcript_keywords": [
        "Super Smash Bros",
        "Daddy is giving",
        "Big House",
        "Tech Daddy",
        "Smash Bros",
        "Big House events",
        "Smash Bros tournament",
        "Super Smash",
        "Apple",
        "annual Smash Bros",
        "Smash",
        "game",
        "Big",
        "Apple accusing Facebook",
        "Facebook accusing Apple",
        "Daddy",
        "big tech counterparts",
        "rocket",
        "big tech",
        "Nintendo"
    ],
    "transcript_entity_values": [
        "68%",
        "ATT",
        "up to 25%",
        "EU",
        "two years",
        "Google",
        "EA",
        "White Book",
        "Arecibo",
        "2020",
        "Smash Bros",
        "Patreon",
        "Super Smash Bros. Ultimate",
        "Nvidia",
        "Australia",
        "iPhones",
        "BOGO",
        "today",
        "IDFA",
        "the \"",
        "30-day",
        "Japan",
        "the year",
        "Gnome Chompski",
        "Hyrule Warriors: Age of Calamity",
        "Star Fox",
        "Rocket Lab",
        "Smash",
        "This morning",
        "first",
        "two",
        "Tech News",
        "Monday",
        "Chungus",
        "this week",
        "The Big House's",
        "Nintendogs",
        "Horizon",
        "Half-Life 2",
        "Vincero",
        "zero",
        "Valve",
        "Chompski",
        "Super Smash Bros. Melee",
        "Gabe Newell",
        "second",
        "Nintendo",
        "Safari",
        "Slippi",
        "YouTube",
        "M1 Macs",
        "Apple",
        "The year",
        "Stadia",
        "GeForce",
        "year",
        "Intel",
        "14",
        "Roblox",
        "App Tracking Transparency",
        "Half-Life 3",
        "13 years ago",
        "weekend",
        "next year",
        "Fortnite",
        "annual",
        "Rocket Lab's",
        "Valve",
        "New Zealand",
        "Facebook",
        "25%",
        "the Tech News",
        "iPads",
        "Earth",
        "Twitch",
        "December 2nd",
        "The Big House",
        "the National Science Foundation"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "GPE",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "GPE",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "ORG"
    ]
}