{
    "id": "cMGCOaJ7SJU",
    "title": "SHARK DIVING!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-07-27T23:25:46Z",
    "video_url": "https://www.youtube.com/watch?v=cMGCOaJ7SJU",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "klangstof",
        "everest",
        "hawaii",
        "oahu"
    ],
    "views": 506307,
    "likes": 14106,
    "comments_count": 1525,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(\"Everest\" by Klangstof) Shape me up until I follow All I want is Everest Shape me up until I follow All I want is Everest Trickster playing all the roles for lesser people What's up when the ceiling's got you down? Let go 'cause you're going to feel underrated Mind blown by the feelings that you never trust - Good morning. It's very early. I woke up at three o'clock today and we are now over on the North Shore of Oahu. And we are going on a Swim with the sharks, 100% guarantee. This is what we're gonna be filming the sharks with today. I've got the GoPro Hero 6 here and the RX-0. Why I'm bringing both is, I'm not sure. Because I have a problem and uh I just want to test them out and see which one looks better underwater. So, we did this for the first time, how long ago? Was like four or five years ago? - I think it was about four years ago. - I could look it up, exactly when that was. (\"Forgetting This\" by Elijah N) Wearing light shoes Walking down the shore Diving head first Down to the ocean floor Your dark brown eyes Reflect fireflies Living bright nights - We were not shooting in 4K. - I thought we like a case on, a waterproof case. - I think I still using that little Canon camera. It's a night to stay up late - This doesn't really look fun to me. They're getting thrashed around in the sea. Hey sharky. Wowee he's, he's big, wow. - [Girl] I know there's a lot of them. We're about to head in guys. How's my look? I'm kinda scared. - Well to be honest, me too. To run the full length of the north shore Stay up for the sunrise, make a wish There is no way we'll be forgetting this - Oh God. This is so, I'm afraid to go underwater guys. I'm, I'm not good at being an ocean person. We'll take a long walk 'Til we start to freeze Hearing small talk Over the summer breeze Out of safe zones Finding hidden caves All the wet stone Shaped by the ocean waves It's a night to stay up late Things we have to do can wait We've got catching up to do (water bubbling) (water splashing) - Well this is quite the experience. My mask keeps filling with water every time I go under water so I can't even see anything. Oh man. There are a lot of sharks though. This is the perfect night to catch a cold To run the full length of the north shore Stay up for the sunrise, make a wish There is no way we'll be forgetting this This is the perfect night to catch a cold To run the full length of the north shore Stay up for the sunrise, make a wish There is no way we'll be forgetting this - Well that's it. Brianne says she doesn't get seasick but apparently you do. - Yeah - Yeah. - It happens. I started feeling not so well towards the end of this little boat ride. We're back on land. I'm on Ginger Ale duty. My tummy tickles. Oh excuse me ma'am, were you just on a shark excursion? Yes. - Aww thank you , but I what I think that oh. - They had Ginger Ale on the boat. - [Justine] Really? - Yeah. - Oh. So many people on that boat were puking, like everybody. Whenever I hear puke I wanna puke, and everybody was puking. (\"Shine Bright\" by Digital Camel) This is Leonard's. It is a famous bakery and they have these really good, what are these things? Masal, masala-- - Masalasadas - Malasadas. - And we're gonna try 'em for the first time. Let's see here, four custard. Oh my gosh, they're super warm. - [Girl] Give me a bite. - [Friend] Be careful, but you have. - [Woman] No, if that ones, - [Girl] It's just cinnamon that one's just the donut. - Oh well, oh (laughs). - [Girl] What? - [Friend] What? - Definitely. - [Woman] Oh really? - [Girl] Yeah. - It's full of air. I didn't have a to go cup. Bri, this is what I've resorted to. - Wah. - We're on our way to a hike and if you don't know, guess what, we're in Hawaii. Bri's driving; no one trusts me. Let's go to the hike. Like, I don't know where to put this coffee. Like it is not made for this vehicle. (\"Shine Bright\" by Digital Camel) Look guys, I'm bleeding out, I'm bleeding out. - [Bri] Shut up. I'm hurt. I dropped my camera, almost fell into my coffee and then I cracked the little protective screen that I have on it and then I slid my finger across the glass and then I cut myself. So, I'm bleeding out, I'm bleeding out. Bri I'm injured, what are we gonna do? - Nothing. - Help. - You're fine. - Yeah but it hurts. - [Bri] Well 'cause your squeezing the blood out. - I gotta get some more blood out so I can show Jenna to make it look like I'm injured. - [Bri] She knows you're lying (laughs). - No, but I saw it. I've got an injury. Look. - [ Bri] She's like, I need to squeeze out some blood, so I can show Jenna. (laughing) - [Justine] Do you see it? - [Jenna] No. - [Justine] If I squeeze real hard some blood will come out. - [Bri] You're fine. - [Justine] Look you can sorta see it. - You're fine. (\"Shine bright\" by Digital Camels) (\"If I Was Your Girlfriend\" by Mondays) (\"Linen\" by Frook) - We just stopped at the Valley of the Temple and this place is so beautiful. You guys might recognize this from many different movies. Was this is Lost? - [Girl] Yeah. - [Girl] I don't remember if it was in Lost. - Yeah, it was like a wedding scene. I'm gonna have to look it up. I am in shock right now. These fish are huge. (\"Rue Montorgueil\" by Thomas Skyldeberg) Right now we are at Kualoa Ranch and this is probably one of my most favorite places, I think, in the entire world. It is the most beautiful ranch. There's over 4,000 acres and they have shot so many films here. I'm pretty sure you guys have seen so many of them. We also did a really amazing tour here, back in October. We're going to hop on this boat and go to a small, tiny, cool island. What a lot of stuff. (\"Rue Montorgueil\" by Thomas Skyldeberg) So guys one thing that I definitely recommend, you should never drone from the boat. It's a really bad idea. So thankfully we're not moving. I mean it's definitely possible but I would not recommend it. So I'm about to attempt a really fun drone shot. I basically want to fly it through this little boat and up and away. So let's hope that it works. I'm gonna try two. I'm gonna do one facing me and then one facing away. (drone whirring) Fingers crossed guys. - [Man] Whoa, whoa. - [Bri] Look. - [Jenna] Awesome, so awesome. (\"Rue Montorgueil\" by Thomas Skyldeberg) (\"Siren Screen\" by Ooyy) (\"Rue Saint-Antoine\" by Thomas Skyldeberg) Everything will be fine - You guys, thank you so much for watching this vlog that was basically, it seems like almost six months in the making. I love this place and if you guys are ever in Oahu, I definitely recommend you have to check it out because it is just incredibly breath-taking. The views, the scenery and all of the people here are so nice that it's such an experience and I hope that one day you guys can also experience it too. For now, that's it, that's the end of the vlog. I'll see you guys later. (\"Rue Saint-Antoine\" by Thomas Skyldeberg)",
    "transcript_keywords": [
        "Everest Trickster playing",
        "Everest Trickster",
        "Everest Shape",
        "Trickster playing",
        "north shore Stay",
        "Everest",
        "guys",
        "Shape",
        "shore Stay",
        "North Shore",
        "roles for lesser",
        "follow",
        "Yeah",
        "stay",
        "underrated Mind blown",
        "feel underrated Mind",
        "Trickster",
        "Shore",
        "boat",
        "North"
    ],
    "transcript_entity_values": [
        "Bri",
        "Digital Camels",
        "one",
        "Everest",
        "masala-- - Masalasadas - Malasadas",
        "sharky",
        "Mondays",
        "Justine",
        "Temple",
        "Rue Saint-Antoine",
        "three o'clock",
        "Oahu",
        "Hawaii",
        "Klangstof",
        "100%",
        "Rue Montorgueil",
        "RX-0",
        "about four years ago",
        "Ooyy",
        "four or five years ago",
        "almost six months",
        "four",
        "Shine Bright",
        "Brianne",
        "Leonard",
        "Siren Screen",
        "Down",
        "Thomas Skyldeberg",
        "Everest Shape",
        "Diving",
        "Valley",
        "the North Shore",
        "Everest",
        "Shine",
        "today",
        "Frook",
        "two",
        "Swim",
        "Digital Camel",
        "over 4,000 acres",
        "Ginger Ale",
        "Kualoa Ranch",
        "first",
        "Elijah N",
        "Wowee",
        "Jenna",
        "October",
        "a night"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "TIME",
        "GPE",
        "GPE",
        "PERSON",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "LOC",
        "GPE",
        "LOC",
        "LOC",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "TIME"
    ]
}