{
    "id": "cSdUyXZrS3A",
    "title": "Riding a Mule in the Grand Canyon!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-10T16:33:22Z",
    "video_url": "https://www.youtube.com/watch?v=cSdUyXZrS3A",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "mule",
        "grand canyon"
    ],
    "views": 128096,
    "likes": 4611,
    "comments_count": 580,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- We're at the Grand Canyon. In the middle of winter. We didn't realize it was gonna be this cold. We knew it was gonna be chilly. This is a whole other level and we're about to go on some mule rides but first, the sunrise. (light music) So right now we're debating on if we do the mule rides or not because it is extremely cold. It says it's zero degrees on my Snapchat like that's really cold. I'm only using Snapchat actually just to see what the temperature was 'cause does anybody actually use Snapchat anymore? I'm not sure. I don't know, we're checking in. We decided to do the mule ride. We're packing up, we're getting some breakfast right now and this is our bag that we're gonna be putting our water in for the ride because we're not allowed to take bottled water. Oh, thank you so much. Commemorative cup on the mule ride. This is for Ed. It's so cold, guys, it's so cold and we also can take selfie sticks so my entire plan is foiled. - [Girl] You're foiled. (light music) - Go to the Grand Canyon, Jenna says, go to the Grand Canyon, it's gonna be great. Wow, is it cold. - To be fair, there was a storm. - There was a storm, it was slightly unexpected but man, it's beautiful. Like it is so pretty. We're about to hop on the mules. We basically can't bring anything so I'm kind of gonna strap my phone to my body but I'm gonna have to be holding on and focusing on my mule and my body and not falling or getting hurt so I don't know what I'm gonna be able to film. I haven't seen snow in awhile. - [Jenna] You just saw it. - Yeah but this is like legit snow. - [Jenna] What's the other snow? - I don't know, Jenna, don't ask me questions. - You will be cold. I mean like really cold so if you think you're gonna be cold at all or if you're not prepared, now is your time to hop back on there but it will be cold. - Look at them. (light music) So here's the mules that we'll be riding. I think they're ready. This one right here is really rowdy. He's probably gonna end up being my mule. (light music) So I thought it was gonna be like vlogging and filming while I was on my mule. No, we gotta drive it like I don't, I gotta control it, I gotta motivate him, I gotta slap his butt. Like. - Stop it, stop it. - Ah no. That's my motivator. We just got our mule assignment and you guys are not gonna believe this. My mule's name is Maddy like I can't even make that up. Maddy the mule, Maddy the mule. They're gonna be like go Maddy! (light music) This is Maddy my horse, mule, mule. You're a mule, of course. Currently on our mule ride on our way to our first stop. Look at this view. He looks like he's gonna do something. My horse is eying up Susie's horse, don't you even, I'm very nervous. Is she mad at me? - No she just doesn't respect you. - So it's a me problem? - Yeah, yeah. (light music) - So far our ride is going very well. My mule has started to behave a little bit better. It's getting colder but we're almost done but this was so awesome. The views are incredible and surprise, I'm still cold but my mule, Maddy, she's being a good girl now, check her out. Maddy my mule. (farting) - I'm laughing so hard I'm crying. Oh my God. - Okay we made it back to the stables and man, I am just, I just wow, I had so much fun. It was a lot more fun than I thought. As soon as we started I was a little bit terrified because Maddy was listening to me but she obeyed and now I think we're best friends. She's probably like, I'm glad this girl is off my back now. - Josie was very well behaved, very well behaved. We had a very good time together. - Mine was not so well behaved. Hello, it's Justine reporting back on the bus. So we just ate at this historic restaurant, there is a lot of history here and they said that all kinds of presidents have eaten here, lots of celebrities and of course, me, Jenna and Susie. - Yeah, what's up. - Add it to the list. We got back from riding the mules and Susie's mule, it farted for a solid minute and a half. - You missed it, we were crying like the guy was like, why are they crying? He's like I haven't had anyone cry before, I'm like I'm so sorry. - They were laughing so hard I had no idea why they were laughing well this is why. (farting) Still the clip. - That was my clip. - [Justine] You posted your video before me. - It's me, Jenna. - [Justine] Exclusive. - [Man] Watch your step, this way. - Look at these, they're like little sheep, they look like Maddy. There's a lot of cute, little things here. Some music, some sounds of the canyon. This is so crazy guys, there is, the canyon is grand, super grand. - Remember when it snowed? - [Justine] Remember when I slid down a. - Yes. - mountain at Yosemite? - I do, I was there. - [Justine] Yep. What did you do, Jenna? - It's not attached to me anymore. Is it cracked? - [Justine] No. Tag 21, baby, tag 21. - [Man] So these two brothers, they went down the Grand Canyon in a wood boat way back in the day and they took this camera with them, they took pictures all along the way then they built this cabin here and they would sell their pictures to all the guests that came and stayed at the Grand Canyon. - [Justine] How nice. - They stayed at the Altavore. - But this is so cool 'cause this is the original house where they did their dealings. Is that their camera? - [Man] Yeah. - Wow, their camera's here. There they are, the bros. Look, they're riding mules. We had such a fun day today. Now we're here watching the sunset, it is so beautiful and still so cold. I don't wanna keep talking about how cold it is but I don't have anything else to talk about because that's all I'm feeling right now. Good morning, day two at the canyon. We are off to see the sunrise once again and who knows what else is gonna happen today because I never know. - [Driver] Hello, guys. - [Girls] Good morning. - [Justine] Is it gonna be warmer today? - A little bit. I think it's already warmer like right now than it was this time yesterday. - We stopped at McDonald's to get some coffee, obviously. This is a much better sunrise than yesterday already just because we got some coffee. I got the time lapse app finally set up on my Sony camera. It's so weird 'cause you have to actually download apps on the camera to be able to use the time lapse feature so I finally did it so let's see how it works. Oh God the elevation, I can't breathe. (light music) It was beautiful. I got two different time lapses. One on the Go Pro and one on my Sony, let me know which one you guys like better. It's interesting because if they have that sign there, that means that someone definitely has been drinking out of the toilet so I'm confused. We're gonna go to the gift shop and get some things. We just ate breakfast and then we're gonna head off on more adventures. There's my sister Jenna. - I'm gonna get this for Maddy but it's a little mule. - [Justine] It's a little mule, he's gonna love it. - I like the big mule but. - No, he's gonna love this. I hiked Grand Canyon. Look, the Mule Train Mail. Did you guys know that the Grand Canyon is the only place that still delivers mail by mule? Look, mule mail. - Put this in, put this in your vlog. Mule mints. - [Justine] Mule mints. Mule mug, mule mints. - Mule. - Bookmark. Let's get a postcard for mom and Gram, mom, dad and Gram. - Mom, dad and Gram. - [Justine] Put this in my vlog. - We gotta get one for Ed. - Yes, didn't I get him one before? - Yes, oh no. Oh my God, wait, it says Ed and it says Matt. - [Justine] No way. - [Jenna] What? - [Justine] Best friends. - [Jenna] That's crazy, that's not right. - [Justine] Look, there's two Justins but no Justine. I might get a Justin for myself and just etch my E into it. - Postcard, wow, look at this one. - Oh I like it 'cause it looks like a stamp. Get that one. Grand Canyon snow. Grand Canyon snow. Let's see what we've got in here. So many animals. What are you? What are you, what are you, what are you? So now coming up on a watch tower. We actually saw this from very, very, very far distance yesterday but we were riding the mules and now we're sitting it up close. Hey, you cold? - No, I'm just tired. - We're all very tired 'cause we got up super early to see the sunrise. (light music) Going into the tower. Wow, it's so much warmer in here than it is outside. Nice little fireplace. Nice little Jenna. - Hello. - [Justine] Hey, look out, Jen. - [Jenna] What are doing? - Oh, oh, it goes like this. Black mirrors. (light music) Looks like the Mario Vince mighty star. This elevation, man. We made it almost to the top. We're arrived at Lipen, this is supposedly one of the best views in the park and I'm no gonna lie, I think it definitely is. I just can't, it's like so big. - That's what she said. - I'm a she. Also just saw the reflection of what I look like right now with this hat on. It's super silly. We're packing up to leave. We packed so much. I think that we thought that we were actually camping the Grand Canyon but we weren't at all. We didn't really even make it down inside of the canyon and now we're all packed, we're gonna head back and drive for about eight hours, maybe even longer 'cause once we hit that LA traffic, it's very unexpected. Oh. - Oh, forgot my mule. - Get my mule. 2:43 pm. - [Jenna] No, three. - What? - [Jenna] It's 3:43. - It's 3:43? - Oh, we get an hour back. - We do, yay! Yay! Wow. - [Jenna] Wow, it feels like Christmas. - It's the little things. The drive begins now. So it's five minutes later, 3:47, we're at our first stop, I can't make this up. We're at Starbucks. Look at this cactus, wow, all of these are so cool. Cactus Arizona mugs. Hello. You're actually fine. Jenna doesn't want me to drive, I'm not sure why, we're gonna go to Wendy's . I just had a Yerba latte and I'm feeling super, super silly. - How will I know? We're listening to Whitney Houston currently. - Currently Whitney, I wanna go to Wendy's. I really wanna get a single patty with mayo and lettuce, should we, we gotta go to Wendy's, can we please go to Wendy's? - You gotta chill. - Oh my God there it is. I haven't been to Wendy's in so long. - Are we going to Wendy's or what about Carl's Jr? - We can pee, we can pee, no, no, we're going to Wendy's, go to Wendy's, there's no Carl's Jr., yes there is, no let's go to Wendy's. - How do I get there? - Turn, right there. - That's the highway. - Turn, no, don't turn there. - This is why Justine's not driving. I'm like I get back on the highway and go long way. - Turn there. I'm gonna get a fro, I'm not gonna get a frosty. - [Jenna] Justine will get french fries, I always get french fries. - Oh yes, french fries, do they have a kids meal? I would love a kids meal. Do you know they're not gonna put hamburgers in happy meals anymore? That's because, that's because they're trying to be more health conscious. Take out all the food, makes sense. - [Jenna] Here, you can have some fruit. - Oh yes, look at you. What do you guys want? Oh I'll get you anything you want. - Large fry. - Oh large fry. Guess what, it's my turn to drive. My turn to drive. I got a sand, guess what I got. I got a single with mayo and cheese and lettuce. Oh, look at our little sandwiches and our fries, great, let's go. Guys, I just filmed this whole piece about, I was so excited for my french fries, I showed them in the bag and then I looked and my camera wasn't filming so it's really not even that riveting of content but we've got our Wendy's, we've got four hours left, I think Jenna's gonna make me drive now. (screaming) - I almost got you. - I'm ready to drive. So approximately, I would say maybe three hours ago, or two hours ago, how long ago did we stop at Wendy's? - Like an hour ago. - An hour, it's only been an hour? - It's been like an hour and a half. - Okay well now we're at McDonald's, I'm gonna get a shamrock shake because I'm driving. - It's like a minty - Oh it's really good. Three? No, no we're sharing. This is a lot of green. This is something we're unfortunately I'm gonna see later today or tomorrow. We gotta get home, we gotta get home, we're not well. After nine pm I get silly. (lively music)",
    "transcript_keywords": [
        "Grand Canyon",
        "mule",
        "Canyon",
        "Grand",
        "Wendy",
        "cold",
        "Maddy",
        "Grand Canyon snow",
        "Jenna",
        "mule ride",
        "mules",
        "back",
        "mule rides",
        "guys",
        "Wow",
        "drive",
        "Mule mints",
        "Canyon snow",
        "ride",
        "Snapchat"
    ],
    "transcript_entity_values": [
        "about eight hours",
        "21",
        "french",
        "patty",
        "the Go Pro",
        "one",
        "three hours ago",
        "Justine] Put",
        "an hour",
        "Justin",
        "Justine",
        "nine pm",
        "Justine] Mule",
        "Maddy",
        "Lipen",
        "Grand Canyon",
        "Sony",
        "four hours",
        "Wendy's",
        "the middle of winter",
        "Whitney Houston",
        "three",
        "the day",
        "Altavore",
        "Justine]",
        "the Mule Train Mail",
        "LA",
        "an hour and a half",
        "Justine] Exclusive",
        "Yosemite",
        "two hours ago",
        "Wendy",
        "2:43 pm",
        "Jen",
        "Starbucks",
        "Ed",
        "today",
        "two",
        "Josie",
        "Maddy",
        "the Grand Canyon",
        "Snapchat",
        "Susie",
        "Justine] Best",
        "Justins",
        "Whitney",
        "Carl",
        "Three",
        "zero degrees",
        "first",
        "Mario Vince",
        "Matt",
        "Christmas",
        "tomorrow",
        "five minutes later",
        "Cactus",
        "Arizona",
        "Yerba",
        "Gram",
        "Jenna",
        "yesterday",
        "McDonald's",
        "One"
    ],
    "transcript_entity_types": [
        "TIME",
        "CARDINAL",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "GPE",
        "LOC",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "TIME",
        "PERSON",
        "GPE",
        "TIME",
        "PERSON",
        "TIME",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "GPE",
        "LOC",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "NORP",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL"
    ]
}