{
    "id": "cSjlzRLEVlk",
    "title": "Making a Camo Cake with Karlie Kloss! 💚",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-05-15T17:06:36Z",
    "video_url": "https://www.youtube.com/watch?v=cSjlzRLEVlk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "karlie kloss",
        "kode with klossy",
        "stem",
        "camo cake"
    ],
    "views": 201364,
    "likes": 6771,
    "comments_count": 857,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and this is Karlie. - Hi. - How are you? - I'm so good. I'm so excited to finally be doing a video together. - Guys, we've been planning this, it feels like, honestly for two years. - It might actually be two years. - Trying to coordinate schedules, you travel a lot, I'm always traveling, and finally we are here. We also shot something super fun for your channel. Do you wanna tell them about it? - Yes, we shot a video series that I'm so excited to be launching. It's about women in STEM and using their science skills in really creative, cool industries, and gaming is an industry that I'm so fascinated by and you are such a pro and we just got to talk to Justine about it. So anyway, that's a long way of saying tune in to this series and yeah. - It's so fun, I love it. We even played some Call of Duty together and this was the second time you played Call of Duty at my house, in your entire life. - [Karlie] So this is the second time I've ever played Call of Duty. I'm really bad. It might be the last time I play. - [Justine] It's okay, it's alright. It is definitely a really tough game to get into, especially just not ever playing before. Now in that theme of Call of Duty, you guys know that my favorite color, color combination is camouflage and I've always wanted to do this cake. So, to celebrate, we're gonna try to make a camouflage cake. - Which, what does that even mean to you? Like, do you envision all of the colors different, kind of circles or colors on top of colors? I have a feeling it's gonna get messy. - Yeah, probably. I'm gonna take my rings off, do you have any? - That's a good idea - Yeah, 'cause sometimes things get to be a little messy. - I love to bake and so this is really exciting. - Really? - I love to bake. I love the science of baking and I love actually like making cakes, and you did all the hard work. - I did that for us because it takes a lot of time. So here we go, these. - It looks good. You did alright. - They came from a box. Well I made three for us because we're gonna make this all layered. We'll just flop this down here. Do you wanna cut off the top of one of those other ones? - Yes, put me to work here, give me the big knife. - Okay, here you go. Before we started, Karlie was like so what's the plan? I'm like you know what girl, usually these baking videos, I have no plan whatsoever. - That's part of the fun. How do you find baking? Do you find it like-- it takes patience. - It does. I feel like if I'm not doing it for a camera, it's kind of relaxing, but when I'm filming videos about baking and stuff like that, it gets a little stressful 'cause we're trying to make sure we're filming and then getting the shots. There we go, in the garbage, cake. - You are so funny, I love that you just used box cake. Nothing wrong with boxed cake. - Nope, especially if we're mostly about the decorating. Do you have like a favorite baked good that you like to make? - I am all about cookies. I love making cookies, but I love cakes. I mean I learned how to read by baking and yeah. Oh yeah, my grandma and I used to always make these things called Jiffy cakes. You basically just add water and then you get like, it's probably full of chemicals and really not organic whatsoever or vegan or gluten free. Okay, so this doesn't have to be perfect. - [Justine] That looks good. So now we're gonna slap on I guess some icing in here. - I'm making a mess in your kitchen. - Oh, girl, the things that have happened in this kitchen. It's just-- - [Karlie] Do you ever eat as you go? - I wouldn't suggest eating this one though, 'cause you know, I didn't really put that much effort into it. - How flat do we want this? Should I make this a little-- - [Justine] That's perfect. - Are you sure, 'cause I'm a bit of a perfectionist I will-- - This is this opposite. Think of perfection and then just do the complete opposite of that. That's what we do here. So this is just the glue to kind of hold it all together. So I must say that I love all the stuff that you're doing with girls and coding. What was the summer camp like that you did? 'Cause that's an incredible idea. - Well, so I first took a coding class at like a summer workshop a while back. This is gonna be our fourth summer that we have coded across these summer camps that we're teaching girls to code. But is all started because I took a class and I was absolutely blown away by the fact that coding is this super powerful language that actually builds all the tech that we all use. And you learned how to code in school, right? - I did, that's honestly, some of you guys might not even know this, but that is what really got this whole passion of creating videos started because I loved creating, and at the time, that was what I thought I had to do to be able to create. You know, doing like web development, stuff like that. - Yeah. - I was like this is so much fun, but I really loved sort of the front end of it, of like design and stuff like that. - In your front end development classes, were there a lot of girls? - In high school it was mostly all guys because we didn't really have a front end class, it was more just, - It was just basic. - It was basically like just the coding and then I liked designing a lot better. - So you seeked out? - Yeah, so then I went into like graphic design and video production. So from there, it's kinda crazy. Just the long story short, here we are, now we're baking together - Now we're baking together. It's all full-circle. - That looks good! Let's just, do you wanna just throw it on top of there? - [Karlie] Yeah. But I told you, I'm a perfectionist-- - We're not gonna see that. You are, yours is great. - [Karlie] I'm also gonna eat it as I go. - [Justine] Okay, that's totally fine. And then we can throw that one now on top. - [Karlie] Steady. - [Justine] Oh my goodness, this is great. - Ta-da! - Now I learned something. I made a really big mistake on a previous video that we did and I didn't trim the edges to make it even. - Smart. - And some things happened. So I'm just gonna do a nice little slice here. I was trying to make this the least messy as possible for you 'cause-- - No, are you kidding me, you're the one that is, we're in your home. I feel like I'm you know, I'm so happy to be here with you. - [Justine] That actually looks pretty good. - [Karlie] Even though it's a box cake cake, I'm not gonna lie. Maybe I'm just hungry. - Well you guys can take that all to go, I'm not gonna hog. - Yeah I might eat a little piece of this cake while we ice. - Oh yeah, I usually make vanilla cakes but wow, this is really good. If we just go like this, mhmm. - [Karlie] Just like that, just slap it on. - So maybe like plop some of the different colors around it? - [Karlie] Okay. - [Justine] And then we'll kind of merge them together. - When you were growing up, did you bake a lot though, in Pennsylvania? - My mom did, yeah, and usually I feel like I would try to help her, but I think my helping would usually just make more of a mess, so that kind of I guess probably has carried over into my adulthood. So are you guys doing another summer camp this year, too? - So basically how it all started is I took this class and I was like whoa, this is crazy, coding is something everybody should know. Whoa, you're quick at this. Nicely done. - I ice a lot of cakes. - Yeah, you're good at this. So I was like whoa, everybody needs to know about this, how to code. And I did not intend to build something, I just kind of wanted to help other people have an experience to learn. So it's been really fun. So this summer, we have a big summer ahead. Last summer, we had 300 girls in our camps that we taught how to code. - Oh my gosh, that's so cool. - In cities all across the country. And yeah, it's basic, kind of HTMLs like ruby. They basically build the projects. - That's so great. - And they're awesome. I'm so proud of them. - [Justine] Sounds like it's great. - [Karlie] I'm so impressed that you learned it in school and that, did that inspire you in any way to think about a career in tech or even-- - Well it's weird too, 'cause I never really thought about a career, which my mom always was very worried about. She was like well you gotta do something, you gotta go to school. And I think because they were very accepting to the weird things that I like to do. - Your parents are awesome, the fact that they're like-- - That they let me just make videos and like I was just always stealing my dad's video camera. - No, but they must be so proud. - They are, they're great, so I definitely owe a lot of this to them. And it's just great to have that knowledge of how things work, even if you're not coding yourself, just to take a class, just to understand it. You know, it could open your eyes to so many more things that you might wanna be doing. - Totally. - How's your cake looking? - You're like flying by me here. I'm kinda just watching you ice this cake. - [Justine] It is all good, this is great. - We have very different styles. You're like fast and you get it all done. I'm like slowly da-da-da. - Yeah but yours looks really good. I'm just kind of goin' for it. - No, yours looks better and you're much faster, you win. - That's okay. (gasping) I'm just gonna start filling in the blanks here. So what else is new, how's everything, how's New York? - Everything is good. New York is freezing cold and so I'm very happy to be out here with you. That actually looks really good. I'm pleasantly surprised. - Yeah, you know I'm just gonna kinda like merge them together a little bit. - [Karlie] I'm mainly just watching you ice this cake. (laughing) Actually, I wanted to ask you, what's your favorite old school game? Like the first one that you really got excited about. - I mean definitely Mario Kart, but I think Goldeneye was probably what made me love first-person shooter games, so that's I feel like where my love of it all started, really. And you've gotta get a Nintendo Switch. - I do! - You have to. There's a GameStop probably right on your way, it's the next place you're going. There's a Best Buy up the street. (laughing) Yeah, I want you to come to my Mario Kart parties. - I am so impressed, I love it. So what do you guys do? - So we basically all just have our Nintendo Switches. - Oh, everybody play on the Nintendo Switch? - Yes, my friend had a $10,000 Mario Kart tournament. - What? - We thought that he was just having a Mario Kart party, and we show up - Oh my gosh! - And he throws down $10,000 and he's like this is a tournament of a lifetime, and it really was, and I lost, unfortunately. - Wait, $10,000? - Yes, crazy. - The winner took home $10,000? - Yeah. - That's high-stakes Mario Kart racing there. - We don't have that at my house. We just have pizza, so that's really it. I think this looks pretty good. - Wait, so you were three girls? - Three of us, yep. - I have three sisters, so we're four girls in my family. - Oh wow. - Did you guys play together growing up? - Well, my middle sister, no, we would always take the T.V. and she would get so upset because she'd be like \"When do I get to watch my show?\" And me and my younger sister, she'd be like no no no. - You're like um, we're taking over. - Yeah, poor Brianne, she's the middle one. - She's the middle one? I had a middle sister. - Really? - I swear, there's something about middle sisters that you kinda have to like fend for yourself because your older sister and your younger sisters are getting all the attention. - Yeah, that's true, actually. - So middle sisters, Brianne? - Brianne, yeah. - I feel for you, Brianne. Call me. - Karlie feels for you. (laughing) - Call me. - Yeah, but I feel like she's our normal sister, whereas there's me and my other sister, Jenna and we're just, this is what we're doing, you know? - It's cool. No, that's awesome - But I feel like we've created different job types, too. - You're creating a career and you're like one of the most prominent faces in tech and in gaming and YouTube. - Thank you, I appreciate it. - I mean this is a whole other world that I've only recently started getting into. Okay not recently, that's not true. - I was so excited when I saw you started a channel and you did a video with Casey, too. - Yes, yes. Loved it. - And I have an amazing friend, her name's Anna Lauren, she helped me start my channel and it's been like this whole other world that I'm just so inspired by by the YouTube community. I'm so impressed with the way that people really support one another and all the YouTube collaboration videos that-- - It's so fun, I've seen you do so many videos with all my friends and I was like please come here and now here we are, we're making a camo cake. - Yes, finally. - Look at this, beautiful. - [Karlie] Ta-da! It's so cute! - I mean I feel like if we had several hours, we could probably make it a little bit better, but for the time being, I'm quite impressed. - [Karlie] For what it's worth, the icing tastes great. - I think this looks good. - Ta-da, so cute. - Thank you so much for coming and helping me make this delicious camo cake. - You did all the hard work, but I'm just happy to hang out with you. - I love it. - And so excited we finally are. Like, we need to do more. - We do, I know. Next time we have some free time, which is usually very rare. Next time I'm in New York, - Next time you're in New York - I'll let you know. - Come to the classy office and we should make something fun. - It'll be great. Well guys, make sure you go check out Karlie's channel. I'll put a link in the description to her channel and to where you can see the video that we shot together where we played Call of Duty. Thanks for hanging out! - Thank you, Justine. - Yay! - Yay! (bubbly outro music)",
    "transcript_keywords": [
        "yeah",
        "make",
        "good",
        "cake",
        "love",
        "Mario Kart",
        "Call of Duty",
        "kind",
        "time",
        "guys",
        "Call",
        "Duty",
        "great",
        "feel",
        "video",
        "summer",
        "videos",
        "baking",
        "Mario",
        "Kart"
    ],
    "transcript_entity_values": [
        "Karlie",
        "second",
        "Karlie] Ta-da",
        "one",
        "New York",
        "this summer",
        "da-da-da",
        "Justine",
        "Mario Kart",
        "a big summer ahead",
        "300",
        "Last summer",
        "three",
        "Call of Duty",
        "YouTube",
        "two years",
        "four",
        "Brianne",
        "several hours",
        "10,000",
        "our fourth summer",
        "GameStop",
        "Karlie] Steady",
        "Pennsylvania",
        "Jiffy",
        "summer",
        "Nintendo Switch",
        "T.V.",
        "Karlie",
        "Call of Duty",
        "Ta-da",
        "Casey",
        "this year",
        "a Mario Kart",
        "Three",
        "Ta-da!",
        "Anna Lauren",
        "first",
        "Goldeneye",
        "Justine] Sounds",
        "Jenna"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}