{
    "id": "csnnfJi1j2g",
    "title": "Don't drop your internet! - TP-Link Deco XE75",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-05T18:18:56Z",
    "video_url": "https://www.youtube.com/watch?v=csnnfJi1j2g",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "tplink",
        "router",
        "gaming"
    ],
    "views": 784530,
    "likes": 17695,
    "comments_count": 891,
    "description": "Thanks to TP-Link for sponsoring this video! Use code 30LINUS on both Amazon & TP-Link for $30 off your Deco XE75 or Deco XE75 Pro Deco XE75, 2-pack (Amazon):  Deco XE75, 2-pack (TP-Link):   Deco XE75 Pro, 2-pack (Amazon):  Deco XE75 Pro, 2-pack (TP-Link):   Getting a strong WiFi connection to your entire house can be tricky. But TP-Link is here to solve your problems with their Deco XE75 Wifi 6E mesh router.  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:26 Wi-Fi 6E! 0:58 Unboxing 5:15 Setup 10:15 Speedtest 12:35 Conclusion",
    "description_links": [
        "https://www.amazon.com/Deco-Mesh-Wifi-6E-Router/dp/B09VW5JHPH?maas=maas_adg_46553F87647DE951272CBC2F141B323A_afap_abs",
        "https://bit.ly/3SMJkdK",
        "https://www.amazon.com/TP-Link-Deco-Tri-Band-XE75-Pro/dp/B0B89L8QKZ?maas=maas_adg_EDF9522A587592D767D67C3E8EE8444D_afap_abs",
        "https://bit.ly/3T8jUrn",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- The Deco XE75 from TP-Link, who sponsored this video, promises to solve your WiFi problems. And no, wait, wait, wait. This time it actually might. It's available in either a two- or three-pack and allows you to quickly and easily, with their app, which I've actually used on multiple occasions, set up a mesh WiFi network in your home or small business. But what makes this pack truly special is that it uses the new WiFi 6E standard. And this isn't some little speed bump or, you know, \"Oh, you could have even wider channels, but--\" (coughs) \"good luck actually utilizing them.\" WiFi 6E opens up an entirely new range of six gigahertz spectrum on top of also allowing 160 megahertz channels, making it perfect for things like video streaming, high-bandwidth file transfers, and even gaming in VR. Let's go ahead and pop these bad boys out. It's available either in the regular XE75 or the XE75 Pro. And the only real difference is that the regular XE75 has three gigabit ports on each of the base stations, while the Pro has a two and a half gig port. And that two and a half gig port is gonna be useful if you have a ton of clients connected to this thing, which well, you very well could, because TP-Link rates it for up to 200 clients. One of the cool things about their Deco system is that there's no main base station. They're all identical, which means that when you're setting it up, you don't have to worry about, like, \"Oh, well this is the, this is the main one, so this one has to go here in the middle of the house, and then the other ones have to go kind of above and below it, and they're going to relay data through it.\" None of that. It's completely AI-driven and can actually reconfigure itself on the fly, depending on what's going to work best for your home. If I recall correctly, Brandon is actually using a Deco system at his house that I set up for him as part of his Intel Extreme Tech upgrade. Not really a whole lot to see here, which is good, because what you want from a WiFi access point is for it to blend into its surroundings. Let me tell you, the conversations that I had to have with the wife about the like, big UFO-shaped things on the ceiling, especially given that I was changing out to like a bigger one at the same time that I put in that DIY air conditioning that had those big ceiling cassettes. Not good. (laughs) These can go anywhere you've got an outlet. The only stipulation is that at least one of them has to plug in via ethernet where your internet connection comes into your house, be it cable, ADSL, fiber, or whatever the case may be. Some new technology that you, watching in the year 2034, will know about, but I don't... (crickets chirping) What? Never take this for granted. Okay? Easy to access reset switch on wireless equipment. It's good to have. Not that I think it'll screw up the configuration process. Step the first: download the app. Okay, well we've already done that because it's already set up on this iPhone for me. Thanks, Bell. Turn off your modem. Required. Remove the battery if your modem has one. (mumbles) Yeah, you probably don't really have to do that. (speaking in regular volume) Step three: plug in the modem and a Deco. Oh, look, they got a nice little wiring diagram. Open the app to finish set up. So wait, are we going to at least, like, plug it in somewhere? We have an interwebs? - [David] Yep. - Oh. Oh! Wonderful. Wait, did I even talk about what's so great about WiFi 6E yet? - [David] No. - Oh, WiFi 6E is fricking amazing. So depending on the country, I think Europe is getting about 500 megahertz of spectrum, and much of the rest of the world is actually getting more like 1200 megahertz. WiFi 6E opens up a completely, as of now, unused chunk of spectrum that is very close to the five gigahertz spectrum that we use for WiFi now. And what's so great about it is absolutely nothing else is using it. So your microwave, which can interfere with 2.4 gigahertz, or your stupid Sony surround speaker system that interferes with your five gigahertz WiFi, none of that can interfere with six gigahertz. It's a blank slate right now, which means that unlike previous versions of WiFi, whether it's 2.4 or five gigahertz, where theoretically, yeah, you could go for 40 megahertz wide band or 80 megahertz. Unlike those, you actually could use those super, super wide bands for super-high transfer speeds, and not necessarily be just stomping all over the WiFi access of your pets and neighbors. For now. I'm sure it's gonna get cluttered up eventually, but if you are an early adopter of WiFi 6E, it's gonna be a pretty sweet time. Not every device supports Wifi 6E. You are going to need devices that do explicitly support it, and your country actually has to turn on support, otherwise it is not going to work. But we have tried it out, and it's just, well it's, it's sick, 'cause nothing else is on it. It's like driving on the highway by yourself. Where's my network? No one's ever heard of. Gimme the 2035 networking. No, no, that's just regular fiber. I don't want it. It's super simple. It doesn't matter what port you plug into. Just... done. Last time we checked out one of TP-Link's Deco units, we had an issue where we weren't really able to use it properly in our office because we already have a router set up for, you know, our internet connection. Fortunately, we do have a backup internet connection, but it's really, really far away, and so we needed to build ourselves a nice, long ethernet cable so we could plug into that modem directly, unless we wanted to do a bunch of fancy reconfiguration of our other router. Then, someone took that cable. So today, I get to make a new one. (laughs) But that's fine. I have this whole box-- (exclaims) - -of CAT6A cable. (grunts) (box thuds) And this termination kit. (speaking as the Terminator) So I am going to terminate it. Dang it. This kit is not complete. [Bell] What do you mean? - I do not have side cutters. I will make it work. But-- [David] Just use your teeth. - Jerryrig Everything Knife to the rescue. Yep. Lttstore.com, baby. That's right. We carry other creators' merch now. Oh, balls. I didn't put a boot on it. Well, guess that's not happening. Moment of truth. Do we get signal? Ah... Hmm. I know this is sponsored, TP-Link, but just a little bit of constructive feedback. Indicator LEDs have not gone out of fashion on network ports. Look at that. It does have an indicator LED! It's just on the front. So that's good. Wait, no. That seems to just be indicating a readiness to do things. Nope. There is still no LED there. But the good news is we can actually set up our Deco now. We have the X75, some variant of it. Yes, we have all of those things. Sure. We powered off our modem. (ding) We plugged in our devices. Yes, yes, yes. Yeah, yeah, yeah, yeah. We definitely did that. Okay, wait till it pulses blue. Yes! We are now looking for Deco. Finding Deco. It's the sequel, but there's no fish anymore because fish weren't in fashion anymore. Bad movie, but good tech tip. Where have you placed this Deco? Short circuit set. There was a crooked Linus-- Ethernet cable's not connect--? - [Bell] Only one is flashing. The one you're plugging in is flashing. The other one's not. - Oh. - [Bell] You need to set up the other one. - I apparently set up this one. Well, that's a good thing to know. Try again. There you go. All right, so watch out for that. The lights on the front indicate what exactly that particular station is doing. You will have a much better password than this because you're not a big dumb. Two of these is good for about 5,500 square feet of coverage with three being for about 7,200 square feet of coverage. Now we're gonna join this. What I'm a little confused about is this one has a green LED, but what's the setup process for this boy? Failed to connect-- oh, that's probably just doing a little rebooty boot. Found it! Connected. There we go. Yep. That was indeed what happened. One online client. Ah, yeah, they have their HomeShield Pro, which includes, well, apparently intrusion prevention, malicious content filtering, DDoS prevention, and then they also mentioned parental controls. Is this one just immediately working? Oh, cool. Well, that was that. This one's gonna be in the living room. Cool. I'll, I'll go-- I'll go put it there. Nice. Firmware update time. (vocal improvisation and rhythms) Come on. (nonsense syllables) Watched pot never boils, so I'm gonna do this. - [David] It worked! - You... (BLEEP). Ooh, fast roaming. Wireless devices to switch connection to different Decos seamlessly. May result in some older wireless devices being disconnected. Probably should be fine if you have, like, reasonably new stuff. It's a pretty cool feature. I wanna do a speed test. Do you have like a speed test in here? I guess we should probably update it before we do that. We'll find out how long it takes. And I will eat chips, 'cause I haven't had lunch today. (bag crinkles loudly) (upbeat music) Oh, wow. That was actually really quick. (coughing) Those hot chips are very hot, though. (clears throat) We'll just use a third-party speed test. Go. I don't even think this is a WiFi 6E device, and 6E is not working in Canada yet. Also, that's not very fast. Oh, it got a little better towards the end, there. Oh, that upload speed, though. Okay. You know what? The fact that we're uploading at 350 and downloading at 208 means the bottleneck is probably on the server side. That's the issue with an internet-based speed test is that you can only be as fast as the-- Oh, AEBC internet. Who are even these guys? I never use these guys for speed tests-- Okay, well we're over 300 now, so it's clearly not a WiFi issue. What happens, though, if I move? I mean, just, yeah, just-- Just turn it. Yeah, just, just turn it. I don't even... Okay, so I'm gonna go, I'm gonna go to the living room. Deco style. - [David] Into the darkness he goes. - [Linus] See ya later! - [David] Are you just gonna yell? - [Linus] Yeah, yeah. Can you hear me? - [David] Yeah, sort of! - [Linus] Okay, cool! I roamed over to this one now. I can tell because I only had a couple of bars. Now I have lots of bars. I'm testing again! It's 300! Oh, my upload speeds. My upload speed's tanking. It's tanking. Oh, oh! I'm back on the, I'm back on this access point again, I think. Oh, it's going up. There you go. Oh, it's going up only towards the end, there, but you're gonna see. It's gonna be faster again. Here we go. Okay. Who are-- Who is AEBC? You stop. You stop now. The government of British Colom-- You can-- The government of British Columbia has a test server on here? All right, BC. Ooh, wow. 23 milliseconds. Gross. I mean, lots of bandwidth, though. Okay, so can confirm, it did roam back to the correct base station. All right, go government of BC internet! Over 400 megabit. The point is, with multiple clients, you can see speeds of over two gigabit per second to one of these Decos. Assuming, of course-- remember? Remember this part?-- that you get the Pro variant. Otherwise, you're gonna be limited by your gigabit uplink. And up to 574 megabit per second on the 2.4 gigahertz band. Also, more importantly, where to check out the Deco XE75 and 75 Pro? You're gonna find that link down below. TP-Link is running a couple of specials. You can get the regular XE75 two-pack for $249, and they're discounting it even further to $219 with our offer code. We'll have those details down below. And the Pro two-pack is $299, but with $30 off with our promo code, to $269. Nice. 99. If you guys enjoyed this video, subscribe. See you later.",
    "transcript_keywords": [
        "WiFi",
        "Deco",
        "Yeah",
        "set",
        "good",
        "speed",
        "Pro",
        "promises to solve",
        "gigahertz",
        "wait",
        "speed test",
        "Deco system",
        "things",
        "WiFi problems",
        "modem",
        "plug",
        "test",
        "internet",
        "megahertz",
        "time"
    ],
    "transcript_entity_values": [
        "up to 200",
        "Linus-- Ethernet cable's",
        "about 5,500 square feet",
        "30",
        "DIY",
        "three",
        "80 megahertz",
        "One",
        "six gigahertz",
        "one",
        "6E",
        "British Columbia",
        "TP-Link's",
        "2035",
        "23 milliseconds",
        "iPhone",
        "249",
        "Bell",
        "two and a",
        "160 megahertz",
        "five gigahertz WiFi",
        "five gigahertz",
        "Over 400",
        "99",
        "second",
        "574 megabit",
        "2.4 gigahertz",
        "about 7,200 square feet",
        "the year 2034",
        "about 500 megahertz",
        "1200 megahertz",
        "2.4",
        "VR",
        "today",
        "350",
        "Deco",
        "at least one",
        "ADSL",
        "David",
        "219",
        "75",
        "Decos",
        "X75",
        "208",
        "third",
        "300",
        "BC",
        "Brandon",
        "299",
        "first",
        "Sony",
        "two",
        "2.4 gigahertz",
        "Canada",
        "British",
        "269",
        "the XE75 Pro",
        "Two",
        "six",
        "Intel Extreme Tech",
        "6E",
        "five",
        "HomeShield Pro",
        "Jerryrig Everything Knife",
        "Europe",
        "40 megahertz"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "NORP",
        "MONEY",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "LOC",
        "QUANTITY"
    ]
}