{
    "id": "cssjQ0HKhnI",
    "title": "These Games Are AWFUL",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-02-16T19:00:23Z",
    "video_url": "https://www.youtube.com/watch?v=cssjQ0HKhnI",
    "category": "Science & Technology",
    "tags": [
        "bad",
        "games",
        "developers",
        "cyberpunk",
        "2077",
        "duke nukem forever",
        "duke nukem 3d",
        "george broussard",
        "e3",
        "sonic 06",
        "xbox 360",
        "princess elise",
        "sega",
        "sonic team",
        "yuji naka",
        "ea",
        "star wars battlefront ii",
        "reddit",
        "downvoted",
        "lootboxes"
    ],
    "views": 302755,
    "likes": 21106,
    "comments_count": 2001,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   With the recent fiasco surrounding the Cyberpunk 2077 launch, let's have a look at some other infamous titles that went horribly wrong due to developer shenanigans.  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- As much as we love video games, it's easy to end up feeling disappointed when developers let us down in some ways, and with the Cyberpunk 2077 fiasco, fresh in everyone's mind, let's have a look back at some other times when game devs, infamously got egg on their faces. (Dream sequence music) Starting out, Duke Nukem Forever. If you think Cyberpunk had an absurdly long development cycle, Duke Nukem Forever took 15 years or practically 'forever' to get to the market. So, what the heck happened there? Although the original plan was to get the game out in mid-1998, about a year after development started it quickly started running into delays The developer, 3D Realms, licensed the Quake II engine because the 'Build engine' used for the 1996 success, Duke Nukem 3D was dated by this point. But after about a year of development they switched to the Unreal Engine. Since the studio was unsatisfied with the Quake engines rendering performance, meaning a huge amount of work they did based around the Quake engine was Nuked. But this was only the start of the drama. The lead developer, George Broussard kept wanting to make changes to the game to make it more similar to other 'hot titles' of the day. And to be fair, it looked like the strategy might've paid off as people were impressed with the trailer that was shown at E3 2001. However, with such a small development team progress was still slow. And Broussard continued to ask for more changes to keep up with the rest of the gaming industry which of course just sent things back further. It took so long to finish that the studio ran out of money in 2009 and laid off at staff leading to a different developer, picking up the game and finally releasing it in 2011, after some of the original dev team had to work to complete the game on their own time at home. Unfortunately, the final game was disappointing in large part because ironically. despite Broussard's efforts to keep placing modern features into the title, the game felt dated, by the time it was released. Let's move on to a different sort of game, that was arguably just as infamous, Sonic The Hedgehog for the PS3 and Xbox 360, or as fans typically call it Sonic 06. By the time 2006 rolled around, Sonics foray into the world of 3D gaming had been marked by disappointment but Sega was hoping the technological advances built into the much ballyhooed PS3 and X-Box 360, could help turn their fortunes around. The idea was relatively simple. Put Sonic in a more realistic setting complete with actual human beings and use cutting edge graphics to produce a hit. Although Sonic Team used a new game engine that did look much better than older titles thanks to the console is more powerful hardware, The studio ultimately put out a game that, had a now familiar problem. It was visually pleasing, but not very fun to play During development, Yuji Naka, head of Sonic Team, and one of the key forces behind the original 2D Sonic games, left Sega altogether reportedly unhappy with his 'managerial responsibilities' which suddenly left the dev team, a rudderless ship After Naka left, Sega split the dev team in two, so that they could push out a separate title for the Nintendo WII. So now a much smaller team without the programmer are responsible for much of Sonic's greatness in the first place had to rush out a game and time to hit store shelves by,. you guessed it, the Christmas season And the result was an unmitigated disaster. There seemed to be consensus, that Sonic was just dropped into a role playing game, that didn't suit the play style gamers were used to. And the sequences that did feel more like classic Sonic games were hopelessly broken and unfairly difficult. Combined with a convoluted storyline, and an incredibly uncomfortable human on hedgehog kiss, the game went down as probably the worst in Sonic's history. Oops! `Let's wrap this episode up by talking about evidently, a piece of low-hanging fruit. 2017's Star Wars Battlefront II. Like the aforementioned Sonic 06, the developer set out to make a 'good looking game'. And that's exactly what they did. And the multiplayer was received as being actually pretty fun too. Gamers might've been able to forgive a short and disjointed single-player campaign as the focus was mostly on multiplayer, but what they couldn't forgive, was the horrendous progression system that required an absolutely insane amount of gameplay in order to unlock playable characters like Luke Skywalker and Darth Vader that EA had heavily marketed. In fact, it would take 40 whole hours of grinding, just to unlock one underpowered hero If you saved your credits or over 100 times that amount to unlock everything in the game. Unsurprisingly players were also given the option of buying, ding, ding, ding loot boxes, with real money in order to unlock characters and items more quickly. But EA asking players to sink large amounts of money into an already expensive game, did not sit well with the community leading to the now notorious post from an EA employee about how the system was designed, to give players a sense of pride and accomplishment, that became the most downvoted comment in the history of Reddit. At the time we shot this video, that record still stands, without a close second, at all. The situation became so egregious, that it attracted mainstream attention outside of the gaming world, and led to government efforts to restrict loot boxes, as a form of gambling. Ultimately EA admitted that they botched the situation, but Battlefront II was left for the ignominious title, of possibly having the worst launch, of any game, of all time. But do you think there's an even worse example of developers making us mad? Let us know down in the comments, If you'd like to see another episode in this series, and which games we should feature. This episode is brought to you by FreshBooks. FreshBooks is an easy to use accounting software designed specifically with you in mind, the small business owner. FreshBooks has everything you need to manage your books. It's designed to be easy to use with built-in automation. So you can spend less time invoicing, expensing, and tracking projects and more time doing what matters most, growing your business. Whether you're a trades person, creative agency or a YouTuber, you can choose a plan that's right for you. And they have an award-winning Toronto based support team. Who are always happy to help if you need it. So try FreshBooks free for 30 days today. No credit card is required at freshbooks.com/techquickie. So thanks for watching guys. If you liked this video give it a like, hit subscribe. and hit us up in the comments sections with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "Duke Nukem Forever",
        "Duke Nukem",
        "game",
        "Nukem Forever",
        "Sonic",
        "Sonic games",
        "Sonic Team",
        "team",
        "time",
        "love video games",
        "infamously got egg",
        "end up feeling",
        "feeling disappointed",
        "classic Sonic games",
        "dev team",
        "Duke",
        "Nukem",
        "engine",
        "Forever",
        "games"
    ],
    "transcript_entity_values": [
        "Duke Nukem",
        "the Unreal Engine",
        "over 100",
        "Broussard",
        "the day",
        "2009",
        "30 days",
        "the time 2006",
        "3D Realms",
        "Xbox 360",
        "E3 2001",
        "Sega",
        "George Broussard",
        "Nuked",
        "2D",
        "EA",
        "Reddit",
        "second",
        "Battlefront II",
        "Nintendo",
        "FreshBooks",
        "2077",
        "Sonic",
        "Put Sonic",
        "Darth Vader",
        "the Christmas season",
        "Sonic The Hedgehog for the PS3",
        "2017",
        "Toronto",
        "first",
        "Sonics",
        "about a year",
        "15 years",
        "Yuji Naka",
        "two",
        "the 1996",
        "Sonic 06",
        "Sega",
        "Sonic Team",
        "2011",
        "YouTuber",
        "Luke Skywalker",
        "mid-1998",
        "Sonic",
        "today",
        "40 whole hours",
        "Naka"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "GPE",
        "ORDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "NORP",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON"
    ]
}