{
    "id": "Ct0wFde9XcI",
    "title": "How Cell Towers Work: Hands-On!",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-01-05T18:30:22Z",
    "video_url": "https://www.youtube.com/watch?v=Ct0wFde9XcI",
    "category": "Science & Technology",
    "tags": [
        "cell tower climbers",
        "cell tower radiation",
        "cell site tour",
        "cell tower climb",
        "at&t",
        "wireless carrier",
        "radio tower",
        "hidden cell tower",
        "cell tower disguise"
    ],
    "views": 696121,
    "likes": 21610,
    "comments_count": 1244,
    "description": "Fun fact: when I was selling mobile phones back in 2004, I would spend the store's slow days taking online training courses reserved for my employer's engineers, fascinated by the networks that made mobile phones work. Twelve years (and a change of career) later, my network curiosity still burned strong. So I asked AT&T to let me go hands-on with a cell site  and to my great surprise, the carrier said yes!  Come along as I scope out not one, but two cell sites: one hidden in the steeple of a church, the other perched high atop the tallest mountain in the Northeast. In the process we'll learn about RF energy, what happens when the power goes out, and why the term \"tower\" isn't always accurate.    [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's Tower Tour was produced based on a pitch by MrMobile to AT&T in the Spring of 2016. To make this video possible, AT&T provided access to two cell sites and several network engineering personnel. AT&T also reviewed MrMobile's final script for technical accuracy, but no editorial changes were made as a result of the company's input. Travel expenses were entirely paid by MrMobile/Mobile Nations, and there was no consideration paid to MrMobile by AT&T for the production of this video.   [FURTHER READING]  AT&T Network videos [YouTube]:   This Is How AT&T Covers 19,000 People Under One Roof [Pocketnow]:   AT&T Disaster Recovery Team [Pocketnow]:   Inverse Square Law [HyperPhysics]:   Mount Washington History:   Mount Washington New Lowest-Temperature Record:    [MUSIC]  Sensational by Cymatix, available at Premium Beat:   Green Fever by Flash Fluharty, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.youtube.com/user/ShareATT/search?query=network",
        "http://pocketnow.com/2012/05/21/this-is-how-att-covers-19000-people-under-one-roof",
        "https://www.youtube.com/watch?v=bJILzLhdCmU",
        "http://hyperphysics.phy-astr.gsu.edu/hbase/hframe.html",
        "https://blog.nhstateparks.org/mount-washington-state-park-blog-post-friday-january-13th-2012/",
        "https://www.bostonglobe.com/metro/2017/12/28/washington-summit-breaks-daily-record-low-temperature-wind-chill-reaches-minus-degrees/iste1AC0wDUnrOcmpujUtI/story.html",
        "https://www.premiumbeat.com/royalty_free_music/songs/sensational",
        "https://www.premiumbeat.com/royalty_free_music/songs/green-fever",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- That mobile phone in your hand is a stunning piece of technology that's almost completely useless without a network to power it. When you're at home or in the office, that's taken care of by wifi. But when you go out into the world, you need a cellular network to keep you connected. That's why you see cell towers all over the place these days. But the most interesting ones are those you don't see. I asked AT&T to take me on a tour of two of them. One in a church steeple, and one on top of a mountain. And to my great surprise, they said yes. I'm Michael Fisher. Join me to learn about the network behind your phone on the Mr. Mobile tower tour. (upbeat music) Duxbury, Massachusetts. Home of excellent oysters, beautiful coastlines and Shakespeare productions featuring familiar YouTubers. Down the road from all that, is the First Parish Unitarian Church built in 1840. Nothing seems out of the ordinary as you cross the parlor and pass the pews in the meeting house. But when you head up in the attic, you find more cables than any church should need. It's nothing nefarious though. These are the conduits feeding the cell tower, or more properly, the cell site hidden up above. Obscured in the steeple itself to preserve Duxbury's bucolic landscape. We followed the cables up some narrow stairs and I do mean narrow. The hardhat isn't just for looks. And we come to the bell tower. Yes the bell is real and yes it still works. (bell chimes) Now we're pretty high off the ground at this point but not quite far enough to be optimal for the kind of coverage this site needs. So it's up an even smaller ladder to the base of the steeple itself. This is where the magic happens. Magic you can hear on the audio feed here. (audio feedback ringing) That's the sound of one of the camera's poorly shielded components reacting to the radio frequency energy up here. And while that might sound scary, it's actually safe. The workers who have to come up here to service the equipment are safe because they follow strict procedures. And the people down below in the church are safe for two reasons. The first is called the oil rig effect. The antennas up on the steeple aren't pointed straight down, but outward. Which makes sense if you think about it. The second reason is something called the inverse square law. See radio frequency energy drops off with distance, and it does it fast. Up here in the steeple, I'm standing about 10 feet from one of the antennas. Down at ground level, about 50 feet away. The RF signal is 16 times weaker. This is one of the reasons carriers need to build so many cell sites to cover a given area. The further you get from a tower, the harder your phone has to work to stay connected to it. For the same reason, this entire church steeple had to be replaced with a fiber glass replica. Which is why you can see the sun glowing through it here. Fiberglass is more transparent to radio waves than wood. It's all about getting the strongest possible connection to your phone. But the radio side is just part of the story. The data packets that flip back and forth when you send a text message or subscribe to a YouTube channel, well they have to traverse the internet. And to get to it, landlines are still usually the most efficient way. So we follow the conduits back down the steeple, through the church and out back to the equipment shelter. This basically a concrete shack where the connection to the landline network happens. This is what's called back-haul. And these days it's all done with fiber. You ever wonder what happens if the power goes out? Well that's where this rack of lead acid batteries come in. They provide an uninterrupted power supply in an event of an outage. There's also a diesel generator outside with enough fuel to power the site for about a day. Generally that's more than enough to last through the storm in this part of the country. Speaking of storms, this south side doesn't worried about them much. Tucked away as it is inside that cozy church. Well I wanted to see a tower that was a little more rough and tumble. So I woke up early one day and drove and drove and drove up to the white mountain of New Hampshire. Specifically, Mount Washington, the highest point in the Northeastern United States and 20th century record holder for highest wind speed ever recorded. In fact as I wrote this script, the mountain had just broken another record for coldest recorded temperature at the summit at minus 34 degrees Fahrenheit. Well that's why I went up there in August on what turned out to be a gorgeous day. It's still a treacherous ride up the incline though. So at 2700 feet, I traded in my rental car for more appropriate transportation. (train horn blares) it took about 45 minutes to chug the remaining 3500 feet to the summit. Much of it at angles almost too steep to stand. But I hopped off at the very peak of Mount Washington. The weather was still excellent. And the views were amazing. The climate was so good during my visit, that in fact it was hard to imagine the kind of violent storms I heard about. Until I rounded a corner and saw this. This is not the tower I came to see. It's a microwave transmitter for back-haul. More on this in a second. Anyway this cover was made of fiberglass and it was almost totally demolished. As I meandered around the mountain top, I saw several of these things. And fiberglass and canvas alike just ripped right open by the punishing weather here. Some were just plain missing. Now I had assumed that one of these huge structures was the AT&T site. No these are actually old school. They're FM transmitters for radio stations WPKQ and WHOM In fact the tower that I came to see, it's this humble little stove pipe. This was a pre-existing structure that AT&T acquired. It's history stretching all the way back to the 60's when it was built as a transmitter for TV station WMTW. Well it's been here ever since. So apparently these cable stays are indeed as strong as they look. Remember all the antenna equipment we saw up in the steeple in Duxbury? Well imagine all of that crammed into this. There's not quite as much gear in here since there's just the one carrier. But it's still a densely packed mammoth of machinery. The mast is actually part of the site, covering lands south of the mountain. The northern regions are taken care of by a dedicated sector built on to the side of the observatory. It looks much more like the antennas you're probably used to seeing on towers and buildings. By the way, the clouds really do move this quickly up here. It's pretty awesome. Following the wave gods into the yankee building, we can see that the equipment shelter looks much the same as the one down in Duxbury but a little more spartan. Well because it's at the top of a mountain. This site doesn't have the kind of fiber back-haul to connect it to the landline network like Duxbury does. Instead it relies on microwave back-haul. Remember those beat up antennas? And this particular installation hasn't yet been updated to support LTE. So for the moment, this is one of the few AT&T sites left in the whole country that doesn't have it. The company tells me it's planning an upgrade for this spring. As soon as it's safe to work on the mountain again. At which point, even this tower will be an LTE site. Both of the cell sites I visited did the same job. Filling up that signal bar on your phone. But each has to deal with it's own particular challenges to do that. Down in Duxbury, keeping people happy meant refitting half a church so folks could preserve the look of their town instead of adding a cell tower. Up on Mount Washington, aesthetics are secondary. The primary concern is keeping the tower upright and broadcasting. Even as punishing weather pummels the site nine months out of the year. There are a great many more challenges to running a network from capacity concerns, to roaming agreements. And maybe I'll take a closer look at those in a future video. But even putting those extra hurdles aside, I came away from my double tower tour with a renewed appreciation for how much thought and sweat goes into the networks that keep you connected. Folks I've wanted to climb a cell tower for 17 years and it's something I never expected to be allowed to do. So I want to thank AT&T for opening these sites to me. And for letting me talk the ears off all their engineers in the process. Drop a thumbs up if you want to see more videos like this. And if you've got a cool idea for another Mr. Mobile field trip, drop it in the comments. I'd love to read it. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "tower",
        "site",
        "church",
        "steeple",
        "cell tower",
        "stunning piece",
        "piece of technology",
        "completely useless",
        "Duxbury",
        "Mount Washington",
        "cell",
        "mountain",
        "church steeple",
        "network",
        "cell sites",
        "tower tour",
        "sites",
        "Mobile tower tour",
        "phone",
        "radio"
    ],
    "transcript_entity_values": [
        "LTE",
        "minus 34 degrees Fahrenheit",
        "nine months",
        "2700 feet",
        "half",
        "about 10 feet",
        "Shakespeare",
        "AT&T",
        "the year",
        "the Northeastern United States",
        "Duxbury",
        "YouTube",
        "60",
        "3500 feet",
        "WPKQ",
        "Massachusetts",
        "Mobile",
        "20th century",
        "yankee",
        "16",
        "about 50 feet",
        "One",
        "first",
        "about 45 minutes",
        "these days",
        "two",
        "Mount Washington",
        "August",
        "1840",
        "Duxbury",
        "this spring",
        "Mount Washington",
        "New Hampshire",
        "YouTubers",
        "second",
        "about a day",
        "WMTW",
        "early one day",
        "17 years",
        "Michael Fisher",
        "one",
        "the First Parish Unitarian Church"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "FAC",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "LOC",
        "GPE",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG"
    ]
}