{
    "id": "CTiRNnSg0jA",
    "title": "Bought AMD? You got played – Ryzen 7000 non-X Review",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-01-09T14:00:00Z",
    "video_url": "https://www.youtube.com/watch?v=CTiRNnSg0jA",
    "category": "Science & Technology",
    "tags": [
        "amd",
        "ryzen",
        "7000",
        "zen",
        "zen 4",
        "7900",
        "7700",
        "7800",
        "ryzen 5",
        "ryzen 7",
        "ryzen 9",
        "cpu",
        "review",
        "benchmark",
        "performance",
        "gaming",
        "productivity",
        "value",
        "power consumption",
        "performance per watt",
        "heat",
        "thermal",
        "cooling",
        "processor",
        "intel",
        "core i9",
        "13900k",
        "core i7",
        "13700k",
        "core i5",
        "13600k",
        "5800x3d",
        "7900x",
        "7700x",
        "7600x",
        "PC",
        "computer",
        "components"
    ],
    "views": 2150411,
    "likes": 62191,
    "comments_count": 3666,
    "description": "Visit  and use offer code LTT for 10% off  Create your build at   AMDs Ryzen 7000 series cranked up the power draw, but had performance to match. Now that the non-X chips are out with limited power draw, did AMD accidentally play themselves  And you?  Discuss on the forum:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:18 Specs, or: What does an X mean? 2:14 Intel's trying not to compete too hard 3:36 Some notes about our test setup 4:34 Gaming benchmarks 8:04 Productivity benchmarks 11:03 Thermals 12:08 Clock stability 13:04 Power consumption 13:41 Performance per Watt 14:41 Overclocking 15:44 Pricing, platform cost, and upgrade path 17:03 Conclusion - An excellent value",
    "description_links": [
        "https://www.squarespace.com/LTT",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1480113-bought-amd-you-got-played-%E2%80%93-ryzen-7000-non-x-review/",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(lighthearted guitar music) - [Linus] AMD played you all for suckers. Played us all for suckers, really. I mean, look at this. They're releasing basically the same Ryzen 7000 CPUs, but for way cheaper. Not only that, but they run way cooler and they draw way less power. I wouldn't blame you for feeling pretty bad right now, but don't feel bad. This is exactly the kind of sucker punch that we've gotta love because it means the whole market is moving in a less costly direction. And it means that AMD is putting heavy pressure on Intel in a way that we wish they would do to NVIDIA. I mean, it's a good thing. Same-ish CPUs, lower price, which, mm I mean, there's gotta be more to this, right? What are we giving up in exchange? And is it worth the buyer's remorse that I know some of you are feeling right now? Let's find out right after I give you buyer's remorse for not checking out our sponsor. - Build Redux. Build Redux makes it easy to configure your new build with support guides to help along the way. They also offer competitive pricing as compared to building a PC yourself. Head to buildredux.com/linus and start your new build today. (upbeat techno music) - [Linus] Where the X labeled Ryzen 7000 chips enjoyed TDP ratings of 170 and 105 watts, taking the, uh, X away leaves us with essentially the same CPUs with the same core specs, but at lower base clock speeds, slightly lower boost clock speeds, and a friendly 65 watt TDP, with a stock socket power of just 88 watts. The cache, thread counts, and most importantly, overclocking support are all identical. And the accompanying 600 series platform keeps all of its capabilities no matter which CPU you plunk into it. You're still getting TDR 5, PCI Express Gen 5, and the same RDNA2 integrated graphics cores. Although, as with the X series chips, those two GPU compute units aren't gonna do much more than light up your display and handle hardware video encoding and decoding, all of which sounds pretty good though. What's the competition up to then? Good question. We couldn't help noticing that Intel has already launched their non-K competitors to these chips. We noticed when we read about it in the news. And it looks like we weren't the only ones who got completely blindsided by this launch. As far as we can tell, there aren't any proper reviews for these chips anywhere as of the time of recording this. Could it be that Intel made an oopsie-whoopsie, underestimated AMD, and doesn't really want anyone to talk about these? Honestly, it kind of looks that way. Not only did Intel cut out over clocking support and cut down base and boost clocks, but these chips dramatically exceed their 65 watt TDP in a way that we didn't observe with AMD, and they won't opportunistically boost forever like the K series will. And like AMD's entire 7000 series will. What's worse? The core i5-13600 inexplicably loses a big chunk of level 2 cache. That might not sound like a huge deal, but cache can make a huge difference in performance across a wide variety of workloads including, you guessed it, gaming. So did they kneecap this chip on purpose? Unfortunately, we don't have any of them on hand, so we're gonna have to look into them at a later date. And we will look into them, Intel, even if I have to personally camp out in front of the store to buy one. I'm kidding. Nobody's camping out for these. Bleh. (scoffs) Coming back to Team Exciting though, AMD. They claim that by simply dropping the TDP, they're able to achieve industry leading performance-per-watt, which obviously we're going to be putting to the test today. We're gonna be using a Noctua NH-D15 for cooling in order to let all of our chips stretch their legs. But it should be noted that the entire non-X lineup ships with a box cooler. And you should expect to get maximum performance out of these ones without spending any extra money on an exotic cooling solution. As with our previous Ryzen 7000 review, our Intel bench is using DDR5 6800, and our AMD bench will be using DDR5 6000. This is not to give Intel an advantage, but rather to keep our comparison fair. AMD benefits more from running tighter timings and keeping the Infinity Fabric clock synced to the RAM even if that is a little lower. If you wanna learn more about the Infiniti Fabric's relationship with RAM, we did a whole video on RAM speed on Ryzen a little while ago that is still relevant to the current Gen In CPU bound 1080p gaming, Shadow of the Tomb Raider starts the non-X chips off pretty decently with the Ryzen 9 7900 and Ryzen 7 7700 falling behind their X cousins by about 8%, while the 7600 managed exactly the same performance. We tested CS: GO next, but modern chips have actually gotten so fast that it's quickly becoming irrelevant. The lowest result is 450 FPS, meaning that the differences basically don't matter and sometimes the results are even contradictory. Moving on then, Cyberpunk is a slightly worse story for our X free chips than Tomb Raider was. With the dip in performance sitting at anywhere between 8% and 15% for the higher core count parts and between 2% to 3% for the Ryzen 5 7600, it's clear then that demanding multi-core optimized games are going to take better advantage of the X series' much higher All Core Turbo characteristics. F1 22 brings better news to the non-X chips though where the 7900 comes within 5% to 6% of its X counterpart. While the Ryzen 5 meanwhile manages once again to match its X counterpart, which at this point is becoming a bit of a pattern. Far Cry 6 shows a bit more of a gap between the non-X and X chips though, with the 7700 in particular falling behind an average FPS, while the 7900 falls behind in minimums. And Forza Horizon 5 sees the 7900 falling further behind thanks to its higher core count, and thus lower relative clock speeds compared to the 7700 and the 7600, which are mostly in line with their X counterparts. Modern Warfare 2 evens the playing field a lot though, hinting that perhaps the game is a little more GPU bound at 1080p than we initially realized. Still, the Ryzen 5 7600 seems to fall behind a little here compared to the others. Hinting that perhaps thread count to a point is more important for this title. The same can't be said for Total War: Warhammer III though, where we actually got some weird data that looks like a bug with high thread count chips. The 7950X ends up slower than the 7900 for example. And look at the 13900K. But it seems like it's okay on the lower core count chips where we see about a 2% to 9% performance gap between X and non-Xs. Perhaps the most interesting game we tested though is Factorio, which is lightly threaded, but still highly demanding. In this, the non-X chips performed admirably within 5% of their X counterparts and nearly on par with Team Blue. Keep in mind as you're looking through these charts, guys, that we don't have the price competitive Intel chips on our charts because they paper launched them. You can't actually get them. Overall then, none of our tested CPUs performed poorly. I counted only 17 occasions where any frame rate dipped below 120 FPS. These are all capable gaming CPUs. But more importantly for these new Ryzen processors, the 7900 came within 5% of its X counterpart, with the 7700 coming within 4%, and the Ryzen 5 7600 being, on average, bang on with the 7600X. That is incredibly impressive. Now, the 5800X3D still stands out for the impressive performance that it delivers on a last gen DDR4 platform. But with the way that DDR5 has come down in price, and not to mention the upcoming X3D 7000 series chips, AM5 is starting to look like the place to be if you want an upgrade path. Kind of like our plaid flannel shirts are the place to be. They're super comfy and warm and they come in more fun colors than ever. If you're less concerned with gaming and more concerned with work though, you might be a little disappointed. Cinebench puts the Ryzen 9 7900 at just 88% of its X variant and the 7700 manages just 80% compared to the X. Thankfully, with fewer cores to feed, the 7600 manages to stick closer to its unthrottled counterpart, which is a pattern that you'll see repeated through a lot of these tests. Well, a lot of them. Not all. Blender is another bloodbath for the new chips. Clearly they're power constrained except for the 7600. And Handbrake's AV1 encoder has all the non-X chips trailing their almost equivalents. Our Chromium Compile is an example of one of those, um, for the most parts where the 7600's shorter power leash does hold it back. And it took a good seven minutes longer to finish. Meanwhile, the rest of the non-Xs stayed within spitting distance of the X series. None of them, it should be noted, are going to threaten Intel since, as we'll see, their chips are very liberal with power consumption even compared to the Ryzen X series. And in spite of their power chugging ways, they don't manage to win everywhere anyway. Even the X-less variants manage to outperform Intel in very light tasks like Flac encoding. Other more lightly threaded workloads such as those in Procyon are a little easier on the X-less CPUs, with the 7900 dropping just over 10% in photo editing, and coming within 3% in video, which isn't bad at all. The 7700 does even better. And the 7600 manages to evenly match its X series equivalent in video editing performance. Pretty cool. Now let's take a detour into synthetics, to look at 7-Zip, where that same pattern we saw with heavily threaded loads makes a return. It's worth noting though that in the real world this would be a lot more limited by storage speed than it would by your CPU. So it's mostly academic like Y-Cruncher. Hey, hey. Segue. Y cruncher is interesting though because it lets Ryzen flex its AVX-512 muscles. While Intel's chips only have AVX2, they still manage to beat the lower power Ryzen chips. And this is in part thanks to the absurd amount of energy that AVX-512 requires, causing them to throttle hard to their comparatively low base clocks. Now let's head back to the real world with SPECworkstation. I'm not gonna lie. None of these tests are exactly a win for the new lower end chips and a lot of the performance differences are similar across the field. But there are some cases where they at least come close to their high performance Intel counterparts like Calculix. Overall then, the productivity performance for the 7900 and 7700 are only slightly better than their price difference would suggest. But the 7600 manages to stand out at an impressive 96% of the 7600X's performance, effectively making the 7600X obsolete. It seems like six Zen 4 cores are perfectly happy then, running at under 100 watts. Speaking of which, are you ready for a magic trick? What do you get when you have two processor dies and a power target that's under 100 watts? 40 degrees in Prime95. That's what. That is ridiculous. Yes, before you ask, CPU utilization was at 100%. And as you'll see, the power draw was as expected. That's just how it is. The Ryzen 9 7900 then would make an awesome small form factor CPU, not that the others are slouches either. The 7700 does get a bit toastier thanks to its higher core clocks and single CCD, but it's absolutely in another class than its X labeled twin and the Core i7-13700K. The Ryzen 5 7600 is very much the same story as the 7700, embarrassing both of its competitors in our lineup here, even though it has slightly higher thermals. Again, thanks to its high core clocks and single CCD. Here's all of them on the same graph. That is hilarious. I mean, why does the scale even need to go up to 120 degrees? Right. Because of the Core i9. Yeesh. Core clocks are interesting because while thermals were very low clocks remained at or above base clock on all of our chips. The Ryzen 9 7900, while much lower than its X twin, managed to hover around 3.9 Ghz before dropping to base clocks after the first half of the run. That is frankly really impressive. The Ryzen 7 7700 meanwhile is significantly closer to its twin and hangs around the 4.5 GHz range or about 700 MHz over base. That is phenomenal. Remember guys, that Prime95 is an unreasonably heavy load. It's a stress test that is designed to make chips choke. The Ryzen 5 7600 meanwhile has the same base clock as the 7700, but manages to boost 200 MHz above and beyond even that chip, which you can see when we stack them all together on the same graph like this. It's hard to believe that these are all staying within 90 watts, but they are. Here's the Ryzen 9 7900 just embarrassing the 13900K when you consider the relatively small difference in performance. I mean, is that a spike to 350 watts? This same story keeps playing out because each of these chips maxed out their 90 watt power target while Intel shot to the moon. The Core i5 is a little less of a power gremlin and managed to keep things under 200 watts. But I mean, just look at this combined graph here. It's just a single line. All things considered, especially with the energy crisis going on right now, this is an absolute win for AMD. - How could we forget performance per watt? Well, we did. But at F1 22, the Ryzen 9 7900 remained at its maximum power throughout the run, which just happens to be much lower than either of the other 9 series CPUs. And when we capped it to 100 FPS, its power consumption drops even further, while remaining roughly the same distance away from its X counterpart. The 7700 isn't that much less power hungry in gaming than its X sibling, and we can see that in action when we cap the frame rate. The lines match up pretty well. The Ryzen 5 7600 was already very close in terms of power and performance to its X sibling. And capping the frame rate gives us basically the same line, which just so happens to be roughly half the power draw of the Core i5. This all works out to a watts per FPS, nearly three quarters that of the X series for both the Ryzen 9 and 7, while the Ryzen 5 7600, somewhat predictably, is roughly the same as the 7600X. - [Linus] For enthusiasts though, stock performance is only part of the story. We couldn't run our entire test suite on all of the new chips, but we did run the 7900 in a handful of applications to see if you can simply save a few bucks by altering the power targets in the BIOS yourself and then scribbling your own little X onto the heat spreader. And it looks like you kind of can. Is that a 1% difference in Cinebench? Considering the fact that we are not even manually overclocking the chip. All we're doing is letting it draw more power. (claps) This is phenomenal. I mean, I can't speak to what overclocking potential above and beyond stock boost operation, whatever you wanna call that, would be there. You know, maybe the Xs are better binned chips. But if all you want is for it to run out of the box? Whoa, these things look great, especially for the money. Although, it should be noted that cost comparisons are complicated somewhat by the underlying platforms today. While the non-X 7000 series chips are significantly less expensive than even Intel's KF SKUs, not to mention they come with coolers, Intel does still hold the crown here in raw performance. And maybe more importantly, the LGA 1700 platform supports both DDR5 and DDR4, making it somewhat more versatile and cheaper to build on especially if you go with an older 600 series Intel chipset motherboard instead of a 700 series one. DDR5 may no longer be a scalper item and its price premium has been coming down, but a kit of DDR5 6000 is still gonna set you back about double what a low latency DDR4 3600 kit would. If your angle is the F word, future proofing, AMD's Socket AM5 platform is newer and AMD has committed to supporting it through 2025 and beyond, which normally is the kind of claim that I wouldn't take at face value. But with AMD's history with Socket AM4, and AM3 before that, I at least want to trust them. Intel's pattern meanwhile though, is to just release two CPU generations per platform and that is it. So that money that you're saving today by going DDR4 on Intel could end up costing you down the road if you're a frequent upgrader. So then is this the shot in the arm that AMD needed post Raptor Lake? I think so. While it's a step in the opposite direction to computing in terms of performance, it is a leap in the right direction in terms of value. Not only that, but the thermal output of these CPUs is low enough that you could put any one of them into a small form factor rig with a low profile cooler and get stock performance out of them. I mean, you'd need to drop to a non-K SKU to do that on Intel right now. And even then things could get pretty toasty. We don't know for sure because Intel evidently doesn't want anyone to look too closely. Hopefully that changes. For now though, I guess it doesn't really matter what Intel's doing because with these new chips AMD has something in their lineup for just about everyone. Just like I have this segue for everyone. To our sponsor, Squarespace. If you're building your brand online in 2022, you should absolutely have a website. And if you need a tool to help build that brand and website, look no further than Squarespace. Squarespace is the all-in-one platform to make expanding your brand online easy. You can make a beautiful website, engage with your audience, and you can sell anything and everything from products to content. We love Squarespace so much we use it here at Linus Media Group. Its custom templates make it easy to stand out with a beautiful site that fits your needs. And you can maximize your visibility thanks to their suite of integrated SEO features. Their analytic insights help you optimize your performance so you can see what's going well and what needs a little work. So get started today and head to squarespace.com/ltt to get 10% off your first purchase. If you guys enjoyed this video, go check out our review on Intel's 13th Gen K series Core processors for more details on the Raptor Lake platform. Here's to hoping that Intel and AMD keep one-upping each other like this. Man, even low-cost processors are cool again. It's great.",
    "transcript_keywords": [
        "Ryzen",
        "Intel",
        "chips",
        "AMD",
        "power Ryzen chips",
        "performance",
        "core",
        "power",
        "Intel chips",
        "series",
        "lower power Ryzen",
        "nonX chips",
        "series chips",
        "CPUs",
        "performance Intel counterparts",
        "Ryzen chips",
        "core clocks",
        "lower",
        "competitive Intel chips",
        "CPU"
    ],
    "transcript_entity_values": [
        "one",
        "100",
        "90 watts",
        "9",
        "Team Exciting",
        "just over 10%",
        "Ryzen 7000",
        "the Infiniti Fabric's",
        "Tomb Raider",
        "10%",
        "7600X",
        "Xs",
        "GPU",
        "Handbrake",
        "6000",
        "TDR",
        "RDNA2",
        "Cinebench",
        "FPS",
        "AMD",
        "7600",
        "7700",
        "Flac",
        "7600X",
        "Ryzen",
        "120 FPS",
        "40 degrees",
        "200 MHz",
        "nearly three quarters",
        "only 17",
        "3600",
        "700",
        "Shadow of the Tomb Raider",
        "96%",
        "first",
        "TDP",
        "a few bucks",
        "2022",
        "just 88 watts",
        "Forza Horizon 5",
        "AVX-512",
        "170",
        "4.5 GHz",
        "the first half",
        "LGA 1700",
        "Blender",
        "200 watts",
        "4",
        "the Ryzen 5 7600",
        "Ryzen",
        "Squarespace",
        "CPU",
        "2025",
        "13th",
        "DDR5 6800",
        "six",
        "120 degrees",
        "just 88%",
        "22",
        "7900",
        "Intel",
        "about 700",
        "The Ryzen 9 7900",
        "KF",
        "Bleh",
        "1080p",
        "Linus Media Group",
        "90 watt",
        "The Ryzen 5 7600",
        "Factorio",
        "a good seven minutes",
        "5%",
        "2% to 9%",
        "3%",
        "105",
        "between 8% and 15%",
        "100%",
        "Build Redux",
        "about 8%",
        "4%",
        "Gen K",
        "mm",
        "Team Blue",
        "Noctua NH-D15",
        "Ryzen 7000",
        "two",
        "65 watt TDP",
        "100 watts",
        "F",
        "Ryzen 5",
        "7600",
        "600",
        "7950X",
        "Gen",
        "PCI Express Gen 5",
        "Infinity Fabric",
        "between 2% to 3%",
        "today",
        "NVIDIA",
        "1%",
        "roughly half",
        "the X series",
        "7000",
        "Y-Cruncher",
        "RAM",
        "Procyon",
        "5",
        "SPECworkstation",
        "450",
        "CCD",
        "the Ryzen 9 and 7",
        "AMD",
        "2",
        "CCD",
        "350 watts",
        "5% to 6%",
        "AVX2",
        "just 80%",
        "DDR5",
        "Calculix",
        "Core",
        "5800X3D",
        "Core Turbo"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "FAC",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "QUANTITY",
        "ORG",
        "NORP",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "LAW",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "LAW",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "LAW",
        "PERSON",
        "TIME",
        "PERCENT",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "FAC",
        "PERCENT",
        "PERCENT",
        "EVENT",
        "PERSON",
        "ORG",
        "ORG",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "EVENT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "ORDINAL",
        "PERCENT",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}