{
    "id": "cTruhP1eUhY",
    "title": "My $1,300 \"Senior Computer\" (I Want My Money Back!) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-02-17T17:00:22Z",
    "video_url": "https://www.youtube.com/watch?v=cTruhP1eUhY",
    "category": "Science & Technology",
    "tags": [
        "My $1300 Senior Computer (I Want My Money Back!) - Krazy Ken's Tech Misadventures",
        "WOW Computer",
        "PC",
        "Linux",
        "Customer Support",
        "Tech Support",
        "Refund",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Journey Health and Lifestyle",
        "Telikin",
        "Computer",
        "Tech",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan"
    ],
    "views": 148097,
    "likes": 6842,
    "comments_count": 462,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below I bought a $1,300 computer for seniors. It's called the WOW Computer, but frankly I want to return it. And boy, it was NOT easy. x_x  Watch part 1   Watch our tech scam-busting episodes   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord     Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/1TtXknHoeL4",
        "https://bit.ly/clan3o1EdZ2",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Oh, hey there kids. I was just about to log onto the information super highway. Oh, wait, where's my computer? Oh, right. I returned it for a full refund. Yes. Let's take a look. Wait a minute. Where's all my money? Martha! Sponsored by Linode. (upbeat techno music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and it's time for a follow up on the WOW! Computer. I released an episode about this computer a couple of months ago, and clearly you guys liked it. You guys went crazy over that episode. So what am I gonna do next? Of course, make a sequel. Because there's been some juicy developments going on. By the way, if you haven't seen the original episode I recommend checking that out first. Okay. So here's, what's been going on. Shortly after I posted the episode I received some DMs from people who claim to be working at the company or people who claimed to have worked at the company in the past. And they hinted at some not so good business practices and management practices, we'll just kind of put it plainly. I took that stuff with a grain of salt because anybody that leaves a company can say bad things about the company, if they left on bad terms especially, but it's still something I noted, especially because I had my own bad experience with the company from a customer end. So what caused this problem to happen? Well simply, I wanted to return the computer because it was kind of pricey. Let's be honest. and I didn't really have any more plans for it. And I wanted to return it before the return window closed on me. Now, before I bought their computer and I do this with everything, I checked the return policy and the terms seemed reasonable. You get a full refund except for the processing fee and maybe shipping or whatever. So you lose a little bit, but it's not bad. The problem was how you're supposed to return the product. When I scrolled down and notice you have to call a phone number to issue a return, I just knew it was gonna be a (bleep) show. I've never had to call to initiate a return. And the reason why I was concerned about that is because now there's a lot of human error that can happen with the return process. But here's where things got a little weirder. And this happened very early on. On November 18th is when I launched my episode, right? But I also noticed I had a refund in my bank account for $1,160 and 51 cents. It seems like they issued me a return, but I never asked for a return. So for a brief moment, I thought, \"Wow, maybe they saw my episode. And they were like, whoa, give him his money back. He's not happy.\" But I took a closer look at the bank statement. That accidental refund was issued one day before I released the episode. So I have no idea why that happened. I never called them. I never emailed them. They never saw the episode, unless they were snooping around in my Patreon or something, so I don't know why they issued that refund. So I called them on November 26th and I was just being honest. I was like, \"Hey guys, I don't know why you guys gave me a refund but I think it was an accident. Can we fix this?\" And of course they had no problem taking the money back. Now at this time, I truly was not planning to do a return because I was still working with the computer. But when I officially decided I wasn't gonna do any more content regarding the computer, that that's when I decided to initiate the return later on. So in late November, I called them and I said, \"Okay, hey guys, I would like to return the computer. How can I do this?\" And they asked me to write the RMA number on the box. I've never been asked to do that before. It's usually a slip or it's usually filed somewhere on their website or wherever where they can read it. Didn't even have to put a label on. They were gonna send a guy out to the lair and pick it up. So I went to the surface, dropped it off and they picked it up. Seemed like it was working flawlessly. But then, I think it was on December 7th, I got a package. They sent the computer back to me. It was the exact same box. What the? So I called again, and this was a 50 minute phone call, most of it was me waiting on hold. We repeat the whole process and I put the box outside with the RMA number still on it. And then they picked it up and I haven't seen it since. So it looks like it actually mailed out correctly this time. But I'm waiting and waiting and I don't get my money back. So then I call them and these are the WOW! Computer/Journey Health guys that I normally call. But this time, even though I swear, I called Journey, they actually directly mentioned Telikin this time. And as you may remember, Telikin is the actual maker of this computer product and Journey Health I guess just slaps their logo on it and resells it. So this is the first time that was brought up. But then, I got put on another hold because I guess they had to transfer me from the Journey people to the Telikin people. So I'm waiting and waiting and waiting. And it says, you're number 10 in the queue. And I keep waiting and it says, you're number 10. And it says, you're number 10, you're number 10, probably five times. But it also said, press two, if you want to be called back. So I was like, okay, I press two. And the phone hung up. So it's, January's 6th now. I still didn't get a call back. So I went to the WOW! Computer website and the number I've been calling this whole time is in the return section of the website. And I was like, well, I'm getting nowhere with that. Let's call the number right on top. It seems like it's a general number, call it. And I get an error. We are unable to complete this call. So the number they have on the top of the website for everybody, to see just doesn't go anywhere. Very nice. So I go back to the number I was using previously, and this time it sounded like a different guy was talking and he actually sounded very knowledgeable. There was some hope building. He took care of everything. He didn't forward me to anybody else like a lot of other people did. And he said it would take four business days for the money to hit my bank. Five days went by, nothing happened. I still didn't have the money back in my bank account. It's January 13th at this point. This process has been going on since I believe November 23rd is when I made the first call. So we're almost two months into this process and still no resolution. So I waited another, I think eight days and there was still nothing in my bank. So I called them again and it sounded like I got the same guy as last time. His voice sounded the same. But he said, \"Sir, we already issued a refund to your bank.\" And I knew this was gonna be awkward 'cause now I had to explain, well, yeah you guys did earlier the by accident before I called. But then if you check the statements, I just pulled up my bank statements and told him the dates. I was like, you guys took the money back, please check that. So he did, but still, I can see where that would be confusing. I'm really trying not to go all Karen mode on him, you know, can I speak to the manager? No, I'm trying not to do that. And just trying to put 'em in my shoes and be like, \"Hey, would you want to wait two months for $1,200?\" Like, that's a lot of money. Like you don't wanna be without that for a long time. And I was just trying to be, not pushy, not a Karen, but just trying to be assertive. Now it's January 27th, over two months since the whole thing started. Still no visible progress. So I called again and this time I recorded it. The funny thing is, I think they knew who I was, not Krazy Ken, but they knew, oh, hey it's the guy that wants his money back, because I don't even think I told him any information. I just think from the phone number, like he already knew. Oh yeah, we got your case pulled up here. Yeah. We're working on the refund. - [Gerald] Thank you for calling Journey Health and Lifestyle. My name is Gerald. How may I help you today? - Hi, Gerald. I'm calling regarding a refund for the WOW! Computer. - [Gerald] All right. So it looks like we're trying to confirm with Telikin that they received the WOW! Computer back. All right, sir. Thanks for holding. Well, I do see we sent out an email on the 24th, 24th to confirm the return. - This time, I actually have a date regarding to Journey contacting Telikin. That's a little bit tangible. There's some hope here. They were talking about like, \"Hey we need to actually make sure the box got back to us.\" 'Cause you know, they don't wanna give me money back if I truly didn't ship it out. So I thought, \"Hmm, what if for some reason the box didn't make it there.\" So I checked the two tracking numbers that I had. Oddly enough, the first one shipped to Virginia according to the tracking information but it actually returned to my lair, so I don't know what happened there. And the second tracking number, didn't go to Virginia. It went to Pennsylvania and it said it arrived on December 10th, which at this point was about six weeks ago, which makes me think what was it doing for six weeks? Was it just like chilling there on a pallet? Like where is it? Well, it's next to the coffee pot in the break room. But then I got a voicemail on, on February 1st. - [Sean] Hi sir. My name is Sean. I was given a call with Journey Health and Lifestyle in regards to a return for the WOW! Computer. I just wanted to let you know that we have issued refund back to your card as of today. So you should have it back to the account within 24 to 48 hours. - Okay. Good news. It looks like things were working. So now I'm checking my bank account like every few hours to see when it hits. But then at 6:29 in the morning on February 3rd, still within the window, I checked my bank one more time and boom, the money was in there, the whole amount, minus the processing fee. Finally, after two months of back and forth with Journey Health and Telikin, the money was finally in there. So would I recommend buying a computer from these guys? Eh, no, it here's what I usually say to people. Even if a company, any company has a bad product or they made a mistake, good customer service can absolutely override that. I'm sure we've all had stories where we maybe had a bad product, but the customer service was so good, we gave the company another shot. So I really think customer service is the last line of defense and they can make it or break it for a company or a brand. And in this case, the customer service, even though the people sounded nice was atrocious and it took a long time to get a significant amount of money back. And on top of that, the product itself wasn't even that good and it was valued at a $1,300 price tag. So if you wanna try out any WOW! Computer products, good luck, have fun. Let me know how it goes, but I wouldn't recommend them. By the way, if you want to hear about more fun, tech situations like this with shady questionable companies, definitely check out my scam busting playlist because there's a lot of fun stuff in there and hey, you might learn something too. There are a lot of bad and shady and questionable and just poorly run businesses out there. But I think there's some equilibrium and with every bad one, there is a good one. And I'll tell you what, Linode is one of the good ones and I need to give these guys a shout out for making this episode possible. Linode has helped me a lot and they can help you out too. You can simplify your infrastructure and cut your cloud bills in half with Linode's Linux virtual machines. Whether you're developing a personal project, building a website or managing larger workloads, you deserve simple, affordable and accessible cloud computing solutions. And that's exactly what Linode is for. Heck, you can even deploy \"Minecraft\" and \"CS:GO\" servers. And as a thank you for watching my show, I'll give you a 60 day, $100 credit when you sign up today. You also receive 24/7 365 human support regardless of your plan size. You can choose shared and dedicated compute instances, or you can use your hundred dollars in credit on S3-compatible object storage, managed Kubernetes and more. To put it simply, if it runs on Linux it runs on Linode. Visit linode.com/computer plan and click the create free account button now and you can get that $100 in free credit. And hey, when you do that, you're also supporting the Computer Clan, so thank you very much. So I hope you enjoyed my WOW! Computer journey of despair. I know why I sure did. And hey, if you have any of your own customer support horror stories, feel free to leave a comment or tweet me. I love hearing about them. And feel free to subscribe for more tech episodes coming out every week. I love doing episodes about rare and retro tech, new tech, and of course scam tech. And hey, if you liked this episode, you know what to do. Thanks. And I'll see you next time. Catch the crazy and pass it on. (upbeat techno music)",
    "transcript_keywords": [
        "computer",
        "return",
        "back",
        "money back",
        "Journey Health",
        "time",
        "number",
        "WOW",
        "money",
        "Journey",
        "hey",
        "guys",
        "episode",
        "call",
        "refund",
        "called",
        "bank",
        "Telikin",
        "company",
        "Hey guys"
    ],
    "transcript_entity_values": [
        "WOW",
        "6th",
        "about six weeks ago",
        "24 to 48 hours",
        "December 10th",
        "one day",
        "February 1st",
        "January 27th",
        "a couple of months ago",
        "half",
        "six weeks",
        "two months",
        "hundred dollars",
        "January 13th",
        "January's",
        "a minute",
        "60 day",
        "every week",
        "Sean",
        "two",
        "100",
        "the 24th, 24th",
        "Karen",
        "50 minute",
        "Patreon",
        "Kubernetes",
        "today",
        "February 3rd",
        "Krazy Ken",
        "Computer/Journey Health",
        "Gerald",
        "Virginia",
        "Pennsylvania",
        "Minecraft",
        "Martha",
        "1,200",
        "1,160",
        "December 7th",
        "every few hours",
        "first",
        "one",
        "Journey Health",
        "four business days",
        "November 23rd",
        "24/7 365",
        "S3",
        "10",
        "almost two months",
        "6:29 in the morning",
        "Five days",
        "Journey",
        "Telikin",
        "five",
        "late November",
        "eight days",
        "November 18th",
        "Journey Health and Lifestyle",
        "second",
        "Linode",
        "1,300",
        "51 cents",
        "Linode",
        "Linux",
        "RMA",
        "the Computer Clan",
        "November 26th"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORDINAL",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "TIME",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "MONEY",
        "DATE",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "EVENT",
        "ORG",
        "DATE"
    ]
}