{
    "id": "CTZTtvuQGcA",
    "title": "The Tech of an $80,000 Audi Q7",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-04-05T15:23:46Z",
    "video_url": "https://www.youtube.com/watch?v=CTZTtvuQGcA",
    "category": "Autos & Vehicles",
    "tags": [
        "audi",
        "audi q7",
        "2018 audi q7",
        "audi q7 2018",
        "q7",
        "virtual cockpit",
        "suv",
        "tech",
        "audi q7 review",
        "cars",
        "quattro",
        "car tech",
        "austin evans"
    ],
    "views": 566685,
    "likes": 14614,
    "comments_count": 1543,
    "description": "The 2018 Audi Q7 has some of the coolest car tech I've ever seen. Thanks to Audi for sponsoring this video...and for letting me borrow the Q7.  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is is Austin. I've been a big fan of Audi for years. In fact, my last two cars, including the RS3 that I drive today, are all Audis. So when they reached out and wanted to give me a Q7 for a week and sponsor a video, it didn't take me long to say yes. This is the 2018 Audi Q7. And as a big luxurious SUV it is absolutely loaded with cool tech. Something that the Q7, and a lot of modern Audis have is Traffic Jam Assist. Especially when you get into bumper to bumper traffic, something like this is so much nicer. Now mind you, this is only going to be enabled when you're going below 40 miles per hour, so you don't have to worry about following exactly behind the car, trying to stay in your lane, watching around, the car does a lot of that work for you. It's not going to be full self-driving, but as long as you kind of keep an eye on things, it does a really good job of actually keeping you in the right spot. And now that we sped up above 40 miles per hour, the Traffic Jam Assist turns off, but we still do have the lane keep. So we're following the truck in front, and it's doing pretty much all the steering. I have to do a little bit, especially when we get into sharper corners, as you can see here, it's following the bend, no problem. So of course, no driving video is complete without a little bit, you know, actually driving. So no one would suspect that the Audi Q7 is going to be a great canyon machine. But it handles surprisingly well. Big part of that are the giant 285 Summer tires on this guy. But for an SUV that's this big, it handles surprisingly well. Something you can really notice with this though is that when you actually lower the air suspension it makes a big difference. So you can crank it all the way up if you're doing something like off roading, but for like a canyon drive like this, lowering not only makes the car feel a lot more planted, but I think it just looks really cool on the outside, as well. Also, I've gotta say, Angeles Forest is such a beautiful, beautiful driving road. (laughter) Oh man. So of course, no one in their right mind is ever going to take a Q7 on a spirited canyon drive, or maybe you will, you knows? But the idea here is that you're getting a full size SUV that, not only has all the tech that you would expect, but it also drives like a proper, proper driving SUV. I mean, I'm legitimately impressed when you look at the size of this thing with how well it actually handles and what kind of power it's got. Ken, are you scared yet? There are a lot of cool convenience and safety features when it comes to driving the Q7, but there's even more cool tech on the inside and that starts with Virtual Cockpit. As opposed to a standard gauge cluster, what we're getting here is a full LCD display. Now not only is the entire thing going to be completely configurable and run at a full 60 frames per second, but interestingly it's being powered by an Nvidia Tegra K1 processor. You know, the same chip that's in a certain very popular handheld game console. Now a few other cars are starting to add LCDs to their gauges, but as far as I've tried, nothing really touches what Audi's been able to do with the Virtual Cockpit. And especially in my car, where I can actually pull up some of the performance stuff it is so, so cool to be able to just look down and get all of the stuff I want to see at a single glance. Another cool option is the heads up display. So this is going to give you some basic information like your miles per hour, without having to take your eyes off the road, as well as your speed limit. But you're also going to be getting other stuff like information on the assisted driving tools, and if you have navigation running you're gonna get that all without ever having to take your eyes off the road. The main thing you're going to be using in the car though is the MMI interface. So that's going to be controlled with the dial here, as well as your little touchpad. Now you can actually use this for a lot of different things. So for example, if you're using Google Maps to navigate somewhere, you can actually just use the handwriting recognition to write up where you're gonna go, it'll be able to pull it from there. When you start the Q7 the screen is going to rise from the dash and this is where you control pretty much all the main things, including your navigation, your vehicle controls, as well as things like CarPlay. I actually really like CarPlay. So for me, it's something I use everyday, when I'm listening to podcasts, music, that kind of stuff. And the navigation is also pretty decent, especially now that Apple Maps has started to catch up to Google Maps. Something that's really cool is the top view camera. So the Q7 has cameras all the way around the car, so on top of being able to see, say, when you're pulling into a tight spot, it will switch to like the right front camera, or the main front camera, or the left front camera, or whatever you're closest too. But you can also do a top down view. So say, you want to see if you're exactly right up into the spot, you can see that. But of course, the tech doesn't stop there. So it even comes across as some of the smaller things like the climate controls. So you actually have a display in each knob, so when you adjust the actual temperature, you're going to get a full display, which is totally unnecessary and totally awesome. So one of my favorite parts of the Q7 are the seats. So not only are they going to be in this nice soft leather, but they're going to be heated, they're going to ventilated, and they are going to be massaging. Yes, I like the massaging seats a lot, don't judge me. It's so cool to be able to have the car sort of driving itself for the most part on the freeway, listening to some nice music on the Bose stereo, and then just crank up that massage and relax. So of course huge shoutout to Audi for sponsoring this video. I'm curious, what do you guys think about all the tech inside the Q7. Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Traffic Jam Assist",
        "Audi",
        "cool",
        "car",
        "Traffic Jam",
        "driving",
        "Jam Assist",
        "Austin",
        "lot",
        "SUV",
        "things",
        "Audis",
        "big",
        "tech",
        "full",
        "Google Maps",
        "Virtual Cockpit",
        "Traffic",
        "miles per hour",
        "cool tech"
    ],
    "transcript_entity_values": [
        "285",
        "miles per hour",
        "Audi",
        "2018",
        "below 40 miles per hour",
        "RS3",
        "CarPlay",
        "Google Maps",
        "Ken",
        "Audis",
        "two",
        "Austin",
        "one",
        "Apple Maps",
        "60",
        "second",
        "years",
        "LCD",
        "above 40 miles per hour",
        "Nvidia",
        "a week",
        "Summer",
        "Bose",
        "Traffic Jam Assist",
        "today",
        "MMI",
        "Angeles Forest",
        "Q7"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "GPE"
    ]
}