{
    "id": "cU22ECHeAZM",
    "title": "iPhone 4 Prototypes You've Never Seen (Until Now) - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-06-30T16:00:21Z",
    "video_url": "https://www.youtube.com/watch?v=cU22ECHeAZM",
    "category": "Science & Technology",
    "tags": [
        "iPhone 4 Prototypes You've Never Seen (Until Now) - Krazy Ken's Tech Talk",
        "Rare iPhone",
        "iPhone Prototype",
        "Expensive",
        "DongleBookPro",
        "SwitchBoard",
        "Internal Software",
        "iOS",
        "iPhone",
        "SkankPhone",
        "Death Star iPhone",
        "iPhone 4",
        "Antennagate",
        "Apple",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Smartphone",
        "Computer Clan"
    ],
    "views": 149630,
    "likes": 6208,
    "comments_count": 242,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below iPhone 4 is Apple's most drama-filled iPhone (maybe aside from the first-gen). Today, let's explore its story, and the rare prototypes that lead up to its release.  iMac internal software episode   See more rare tech   Patreon!    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Special thanks to  @DongleBookPro ! Check out his channel    Special thanks to @Mac84 for additional footage! Check out his channel    Get your very own virtual \"Death Star\" prototype with augmented reality! Check this out    Listen to @JonathanMann's iPhone Antenna Song!    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/YBhN7kn8j-g",
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://youtube.com/channel/UCIABllrbO0blEcCG_VYY0jQ",
        "https://youtube.com/mac84",
        "https://deathstar.internalarchive.com",
        "https://www.youtube.com/watch?v=VKIcaejkpD4",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Remember the iPhone 4? Very few smartphones have a wild and crazy story behind them. From the prototype being left in a bar to the Antennagate controversy, the iPhone 4 certainly left its own dent in the universe, but that's just what's on the surface. I have some extremely rare iPhone 4 prototypes here with me today and you and me are gonna travel back in time and take a look at the changes throughout these development stages. Sponsored by Linode. Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and we're talking about iPhone 4 prototypes today, including the ever so intriguing Death Star prototype. But before we dive into the prototype history, let's quickly recap the iPhone 4's public history because it has already been 12 years since it came out. Holy crap. The iPhone 4 was publicly introduced on June 7th, 2010 at Apple's annual Worldwide Developers Conference. But several months earlier in March, a funny little thing happened. A pre-release iPhone 4 prototype was left behind at a bar in Redwood City and this breaking news hyped up the tech world. People were theorizing about the design, about what the black lines on the band were, about what the specs and the features would be, a whole bunch of stuff. Then during WWDC, Steve Jobs revealed the new phone with the quip... - Stop me if you've already seen this. (audience laughs) - iPhone 4 featured an all new design of stainless steel and glass, an LED flash and for the first time, a custom-designed Apple A4 system-on-a-chip. Another feature iPhone 4 introduced into the iPhone line was a front-facing camera. That's right, selfies and FaceTime calling were now possible. iPhone 4 also introduced the Retina display, which over time evolved into the incredibly high resolution displays we have in not only iPhones, but other Apple products too. Oh, and let's not forget about the network issues at the WWDC keynote. - You know, you could help me out, if you're on WiFi, if you could just get off. (audience laughs) I'd appreciate it. We figured out why my demo crashed because there are 570 WiFi base stations operating in this room. - So iPhone 4 was a game changer, but with any new ambitious hardware design, there's bound to be a problem or two and that problem just might get exaggerated by the media. The iPhone's new stainless steel band also functioned as the antenna system, but there were reports of dropped bars when users would grip their phone. This led to the Antennagate controversy and on July 16th, 2010, only 22 days after iPhone 4 launched, Steve Jobs hosted a press conference addressing this issue, which is something he rarely does. Arguably the issue was blown out of proportion and the data Steve Jobs showed during the press conference indicated only a small percentage of users were having the problem, but he wanted to reassure us that they cared about every user. So Apple released iOS 4.0.1, which displayed bar status more accurately and they offered free bumper cases for every iPhone 4 through September 30th, which should help reduce the death grip issue. - Okay, great. - Oh, and let's not forget Jonathan Mann's iPhone 4 antenna song. Steve jobs played that during the press conference and it's a banger! And you can call me fanboy I've been called worse things But Gizmodo is ridiculous Pulling their anti-Apple strings So why did the Antennagate issue happen in the first place? Well, there's a couple of hints we can examine when we look at the prototype stages and we'll take a look at those soon. In the end, the iPhone 4 still sold very successfully, selling 1.7 million units in just three days. So now that we've covered the general history of iPhone 4, let's dive back in time with these prototypes and I need to give a huge shout out to DongleBookPro for loaning me these units and helping me with this episode. If you wanna check out more of his prototype stuff, you can click the link down below in the description and head over to his channel. Okay, let's take a look at the Death Star. This prototype is in the EVT stage of development. EVT stands for engineering validation test which essentially means a product has a working prototype and now it's time to make a dozen or so units and begin testing. This EVT prototype uses a Death Star logo instead of an Apple logo to help protect the device's identity and disassociate it with Apple. Google has also done this, for example, with their Pixel phones. In addition, instead of saying iPhone on the back, it says prototype and an FCC disclaimer is written below it and the volume buttons do not have the plus and minus symbols engraved on them and another small detail, there is no ring around the rear camera, unlike in the production version, which was sold to consumers and also there's no screws on the bottom. Regarding electronic components, the Death Star prototype has an early version of what would eventually become the Retina display. The displays subsystem appears to be different compared to the production iPhone 4 and if you look closely at them side by side, you can see the sizes of the connectors are different too. In addition, the CPU is unmarked with an EVT sticker. A series chips in production iPhones have the Apple logo and chip name on them. So along with prototype hardware comes prototype software and this device is running an early version of iOS 4 with a compiled date of November 4th, 2009. The UI of this early build is primitive compared to the public release but it serves its purpose, providing testers with applications to make sure the phone works properly before stacking more software and pretty user interface things on top of it. Applications include operator, which shows statuses of components and probably my favorite name, SkankPhone, which combines phone, web browser, music player functionality, et cetera, into one application. The next prototype we're gonna take a look at is the XX Gigabyte prototype and visually it looks a lot like the one that was left behind in the bar. So odds are good the one in the bar is the same version of prototype as this one. This prototype features the iPhone name and Apple logo on the back, along with regulatory marks. The model number and some other numbers are x'd out, however. The gigabyte rectangle also has the storage capacity x'd out, but it's common to see placeholder text in these development stages. This prototype iPhone has an accompanying stealth case which when this is put on the phone, it kind of disguises it to make it look like an iPhone 3Gs. We can't confirm a hundred percent that this case is specifically made for this prototype, but it's similar. Employees would use these to disguise the iPhones when testing them out in the field. The case's configuration label also tells us what parts are in this build and the N92 code name indicates this is a CDMA prototype. At least that's what the case was made to go with. This means that it's being tested to work with Verizon and Verizon iPhones were launched in February, 2011. Oh, and let's not forget about 'BAT ASSY'. Now we come to the white XX gigabyte prototype and this unit is in the DVT stage. DVT stands for design validation test. At this point, you're now testing more units, usually up to a hundred or maybe a couple hundred, and you're ensuring the product meets environment requirements, regulatory certifications, it goes through battery testing, durability testing, et cetera. This unit is running a normal version of iOS but it does have a non-production proximity sensor. Note the array of small holes at the top. In comparison, the production version has a small pill shaped cutout at the top for the proximity sensor, which detects when the iPhone is held up to your face so the touch sensors and screen turn off when necessary. So why was this change made? The white color of the iPhone cause some light problems, not only with the camera and the flash but with the proximity sensor, it was getting triggered by accident and these issues caused the white iPhone to come out 10 months after the black version. But thankfully this new design worked but it appears apple originally planned to ship the white iPhone with the previous sensor design. It wasn't just a prototype design because the product photos on the website show the older look but all the photos were updated to the newer design when it launched. But if you didn't wanna wait, companies like iResQ offered white iPhones via conversion kits and these kits used pre-release parts from Apple. John Rettinger and gumballtech both did videos on this. Up next is another DVT unit but this time with an internal version of iOS. This unit physically looks more complete, with filled out model number and FCC ID on the back. The gigabyte box is also gone by design. Apple chose to remove this for the production version. Software wise, this prototype would usually run an internal build of iOS 4, but this particular unit is running an internal iOS 6 build, but there's many similarities. Just whatever you do, don't press that brick button. There's a keyboard tester, iAd demo app, a movie player tester and Fly Trap, which was used for tracking bug reports. Oh, and we can't forget about tanks and can you believe it? [Steve Ballmer] REVERSI! And that brings us to this last unit, which according to the serial number, it was manufactured in week 24 of 2010. So it's likely one of the earliest manufactured production models. But the interesting trait about this iPhone 4 is the back. It has holes cut out of the glass and a handwritten label on it. This back piece is missing the camera ring and doesn't have any markings or logos on it so this piece by itself is likely from an earlier stage. So why would this potentially older piece be on a newer phone? Well, there's two possible theories here. One, they were doing some early testing with a production unit or two, maybe a customer actually owned this phone and they returned it to Apple and Apple was trying to debug a problem. What were they trying to debug and test? Probably the antenna issues/Antennagate. These cutouts are specifically made around antenna connections and there's a theory about how this whole Antennagate issue possibly got missed during testing. When testers were using these phones out in the field with these stealth cases, their hands were not gripping directly onto the phone. So some of the test results may have been skewed and some issues maybe got away but despite the whole Antennagate drama, iPhone 4 went on to sell successfully and the iPhone line continued to prosper, surpassing 2.2 billion unit sales to date and I absolutely love exploring the backstory of products that touched so many lives and seeing what was scrapped, changed and tested throughout the development and I love sharing these discoveries with you guys too. So again, special thanks to DongleBookPro for loaning me these units and if you want to check out more stuff on his channel, click the link in the description and head over there and a big thanks to Linode for making this episode possible. They helped me out and they can help you out too. If you have an app or a website that needs to be scaled and deployed, Linode has the 24/7 support and infrastructure that you need. Linode offers out of box apps for game servers like TF2, CS:GO and even Minecraft. You can run your own virtual private network with open VPN, build an online application with Joomla's content management system or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines and to boot, they offer award-winning 24/7 technical support. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the create free account button and when you do that, I'll give you a 60 day $100 credit just for watching this episode and you're also supporting the Computer Clan so thank you very much and feel free to subscribe for more tech episodes coming out every week. I love making episodes about rare and retro tech, new tech, and of course, scam tech and hey, if you liked this episode, you know what to do. Thanks and I'll see you next time. Catch the crazy and pass.... (phone vibrates) Hey, what's up? Hello? Aw dang it, I lost the signal. Hey Steve, can I have a free bumper? - Okay. - Thanks Steve! - (upbeat music begins)",
    "transcript_keywords": [
        "iPhone",
        "prototype",
        "Apple",
        "Death Star prototype",
        "Steve Jobs",
        "Death Star",
        "iPhones",
        "Apple logo",
        "unit",
        "version",
        "Star prototype",
        "Steve",
        "Antennagate",
        "design",
        "phone",
        "Linode",
        "prototype iPhone",
        "Death",
        "time",
        "back"
    ],
    "transcript_entity_values": [
        "Steve",
        "VPN",
        "ASSY",
        "anti-Apple",
        "a dozen",
        "July 16th, 2010",
        "Verizon",
        "10 months",
        "every week",
        "x'd",
        "60 day",
        "a hundred percent",
        "February, 2011",
        "Redwood City",
        "Antennagate",
        "Apple",
        "two",
        "DongleBookPro",
        "Gizmodo",
        "a hundred",
        "Fly Trap",
        "week 24 of 2010",
        "Linux",
        "2.2 billion",
        "24/7",
        "100",
        "DVT",
        "TF2",
        "Joomla",
        "iPhones",
        "today",
        "November 4th, 2009",
        "Krazy Ken",
        "several months earlier in March",
        "iOS 4.0.1",
        "1.7 million",
        "John Rettinger",
        "Retina",
        "Google",
        "only 22 days",
        "SkankPhone",
        "CPU",
        "Steve Ballmer",
        "CDMA",
        "XX",
        "first",
        "4",
        "570",
        "12 years",
        "Jonathan Mann's",
        "Steve Jobs",
        "one",
        "iPhone 4",
        "iPhone 4",
        "September 30th",
        "FCC",
        "FaceTime",
        "One",
        "A4",
        "Death Star",
        "iPhone",
        "Minecraft",
        "XX Gigabyte",
        "Linux",
        "Linode",
        "the Computer Clan",
        "Linode",
        "just three days",
        "the Death Star",
        "EVT",
        "UI",
        "iOS 4",
        "a couple hundred",
        "WWDC",
        "iPhones",
        "June 7th, 2010"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "EVENT",
        "NORP",
        "DATE"
    ]
}