{
    "id": "CWhJqD7W-ak",
    "title": "The Sonos Ace are so impressive — but so unfinished",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-06-06T14:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=CWhJqD7W-ak",
    "category": "Science & Technology",
    "tags": [
        "sonos ace headphones",
        "sonos",
        "sonos ace features",
        "sonos ace review",
        "sonos headphones release",
        "sonos ace hands on",
        "headphones",
        "sonos ace price",
        "sonos headphones",
        "sonos ace",
        "airpods max vs sonos ace",
        "anc headphones",
        "sonos ace vs airpods max",
        "sonos ace design",
        "new sonos",
        "airpods max",
        "sonos ace test",
        "new sonos headphones",
        "sonos over-ear headphones",
        "sonos arc soundbar",
        "tech",
        "the verge",
        "verge"
    ],
    "views": 80489,
    "likes": 1811,
    "comments_count": 183,
    "description": "The Sonos Ace have a stylish design and are among the most comfortable headphones we've tried. Their sound quality doesn't disappoint, and the TV Audio Swap feature lets you privately listen to movies, shows, and games. But the Ace feel finished  with several features still \"coming soon.\"#Technology   00:00 Introduction  State of Sonos 00:50 Hardware, comfort, ear cushions, headband 03:12 Audio fidelity 03:41 Sonos ecosystem 04:17 Sound quality  05:05 Active Noise Cancellation (ANC) and transparency mode  05:51 TV Audio Swap 07:08 Gaming  08:18 Conclusion  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://link.chtbl.com/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- My friends, Sonos has been going through it lately. The company's new redesigned app has made a lot of people very mad because of bugs and a long list of missing features. Now, I've been covering this company for many years now and I've never seen its Reddit community this upset about anything. There's a widespread perception that I think is reasonable, that Sonos released this app before it was ready just so that the company could ship its first headphones on time. Hopefully the app situation looks a lot better in the next month or two. We're gonna have to see. But the $450 Sonos Ace noise-canceling headphones are here right now. They look great. They're super comfortable on your head. The sound quality doesn't disappoint. And there's one trick that sets the Ace apart from all competitors. So let's jump into the review. (upbeat music) The Ace headphones come in this nice felt-covered case. Once you're inside that case, there's a little pouch that stores both of the cables. There's USB-C and USB-C to 3.5 millimeter headphone jack cables. You can listen wireless to either one. I'd advise using some caution with the zipper though. I already had one snag and break before I was able to get it reattached. That might've been just a fluke, but not the best first impression. Then come the actual headphones and my first impressions still hold up. Sonos has nailed their design, the fit and the comfort so well that I keep forgetting these are its first set of headphones. The Ace are like a mishmash of the SONY 1000XM5s and the Apple AirPods max. The embossed Sonos logo on the right ear cuff doesn't call much attention and I like that. And the stainless steel slider arms allow for very precise fit adjustments. Though as usual, my giant head needs full extension. These magnetic memory foam ear cushions just pull right off whenever you have to replAce them. I'm curious how the pleather headband is gonna hold up after several months of usage, but in most respects, the Ace are a fantastically made pair of headphones that balance subtlety and sophistication. And, damn, are they comfortable. Now the Ace weigh 312 grams, which is kind of a halfway point between the Sony and Bose headphones and Apple's noticeably heavier AirPods Max. Now I wear glasses, as you can see, and the clamping force never put too much pressure on my frames or anything like that. I've used these headphones for hours at a time with no real complaints. Maybe just one. See, I much prefer Apple's fabric ear cushions, especially as it gets warmer outside over the spring and summer. They just breathe better. You know what doesn't breathe? Pleather. We love buttons here at The Verge, and I'm so glad that Sonos has gone with physical controls, which I'll take any day over touch pads and swipe gestures, Sorry, Sony. On the right ear cup is the content key, which can slide up or down to adjust volume. You press it once to play pause, twice to skip forward a track, or three times to go back. Hold down the content key and you trigger the big headline feature of these headphones, TV audio swap, but we'll get to that. Now, below the slider is a round button that toggles between active noise cancellation and the aware transparency mode. On the left of your cup is the USB-C port along with a powered and Bluetooth pairing button. The Ace support multi-point Bluetooth, so you can pair them with two devices at the same time. They've also got on-head detection and will pause your music if you remove them. Battery life lasts for up to 30 hours, which is more than enough. So I know there are a lot of you out there who are pretty disappointed how the Ace aren't some groundbreaking pair of wifi headphones that can group with your other Sonos speakers. When it comes to music, these are just regular Bluetooth headphones. Sure, they support aptX Adaptive for lossless streaming, but that only applies to a small list of Android smartphones. This Galaxy S24 Ultra can't do it, neither can my Pixel Fold at home. If you really care about the highest audio fidelity, the best option as always is just to plug in. But why aren't these more tied into the Sonos ecosystem? It's a fair question, and it turns out we're just not there yet from a tech standpoint. Last week, Sonos addressed this very subject and pointed out that the Ace have a fraction of the CPU power compared to its regular speakers. Even something like the tiny Roam, there would also be substantial battery trade-offs. So in the company's own words, \"We prototyped it. We built that headphone. It was not the right headphone.\" Could that change in the future? I sure hope so. I'd love to listen to vinyl on these things or have them automatically transfer music to my speakers as soon as I arrive home. Maybe someday. So for now, let's focus on the Ace headphones we have today and how they sound. To my ears, the answer is pretty great. Look, this all gets so, so subjective. I prefer the overall tonality and the balance of the Ace compared to both the AirPods Max and the Sonys, but you might not. They're all pretty close in the same ballpark and often this comes down to what genre of music people like the most. The Ace are detailed, they're punchy when they need to be. They're consistent, and the sound stage is about as wide as it gets for closed back headphones. You can fine-tune the treble and bass EQ from within the Sonos app if the default profile isn't quite to your liking. They're consistent. I've been listening to Kacey Musgraves and The Black Keys, so they can go from chill to rock without any problems at all. (light music) Sonos claims these have world-class noise cancellation, and it is very good, but not quite Bose level. The QuietComfort Ultra headphones still have the crown if you need to escape reality and find some peace. With the Ace, I can still hear some traffic noise cutting through when I'm walking around the city and it can't fully bring down the ambient noise at my local coffee shop, but it chops off enough to do the trick and the mics do a good job at combating wind noise. I've been satisfied by the ANC, but I've been blown away by the transparency mode. Apple's AirPods Max do this feature so well that sometimes you forget you're wearing headphones in the first place. And now Sonos has come the closest to matching that same sensation. It sounds so natural, so crisp that it's easy to have full conversations with people or just maintain awareness of your surroundings without any real downsides. Then we come to the headline feature, TV Audio Swap. You just long press the content key and instantly the sound transfers over from the Sonos Arc soundbar to the Ace headphones. Sonos says, both generations of its Beam soundbar and the much cheaper Ray will pick up support for TV Audio Swap soon. But for now, you need the much more expensive Arc. It all takes about a second. You hear a short tone and bam, the audio from your TV just starts coming through the headphones. Do the same thing again and the audio beams back to the soundbar, but at a safe volume to avoid loud bursts. Now get this. TV Audio Swap does use wifi to make this connection between the Ace and the Arc. So there is a wifi chip in these headphones, but it's only used for this one special trick. There are two ways to activate TV Audio Swap. One's by holding the button, but the other is from right inside the Sonos app. That's where you're gonna enable spatial audio and head tracking as well. Spatial audio as usual, just gives everything a more cinematic feel when watching content that has a 5.1 or Atmos surround sound mix. Even for stereo content, Sonos will virtualize a spatial audio mix. Fake it essentially. You can always just turn this feature off if you want plain old stereo. Spatial audio worked wonders during \"Top Gun: Maverick\" and often makes action sequences just feel bigger and more captivating. But I didn't find myself using it for TV shows or cable. Keep in mind, the Ace can play any audio that would normally come out of your soundbar, and that includes games. I've tested TV Audio Swap for hours with a PS5, and if there's been any latency, I haven't noticed it. Plus, you're getting a multi-channel spatial audio mix while gaming. That's made MLB: The Show and Ratchet & Clank just sound that much more immersive. Yes, you can listen to an Apple TV with AirPods, that's great, but it only works with the Apple TV. Here, you are getting everything, and I can't overstate how convenient that versatility really is. That is what sets TV Audio Swap apart from every other private listening mode we've seen to date. But I've got bad news for anyone with an Android phone, TV Audio Swap just isn't available yet. You'll need an iPhone or an iPad to set it up. Sonos claims Android support is coming soon, and there are a lot of coming soons with these headphones, in case you hadn't noticed. On a handful of occasions, it's also proven a little buggy and failed to do the handoff like it should. When it's seamless, it's awesome. When it's not, it can be frustrating. But Sonos tells me a software update due in the near future should make TV Audio Swap more consistent. (light music) And so there we have it, the Sonos Ace. Look, I like these headphones a whole lot, even if you only use them for music. Are they my favorite new wireless headphones? It's close. The design, the comfort and the sound all prove that Sonos belongs in the same conversation as Apple, Bose and Sony. But buying the Ace today for $450 takes a little faith, faith that Sonos will make good on its promises to bring TV Audio Swap to Android, faith that the Beam and Ray soundbars will be supported sooner than later, and most of all, faith that Sonos will clean up this mess it made with a new app. I genuinely think that it will, but there's no harm in waiting a few months to see for yourself. These headphones were rushed out the door, but you shouldn't feel any rush to go out and buy them yourself. There's a ton going on on The Verge video channel lately. Becca has a great new series on creators. WWDC and big Apple news is right around the corner, so keep it locked on The Verge for all the latest.",
    "transcript_keywords": [
        "audio swap",
        "Sonos",
        "Ace",
        "audio",
        "headphones",
        "Sonos Ace",
        "Ace headphones",
        "swap",
        "Sonos Ace noisecanceling",
        "spatial audio",
        "Apple",
        "Sonos app",
        "Apple AirPods max",
        "Ace noisecanceling headphones",
        "Sonos Arc soundbar",
        "sound",
        "AirPods max",
        "Sonos claims",
        "Sonos Arc",
        "Sonos claims Android"
    ],
    "transcript_entity_values": [
        "WWDC",
        "hours",
        "PS5",
        "Android",
        "ANC",
        "450",
        "one",
        "Atmos",
        "TV Audio Swap",
        "Apple",
        "three",
        "today",
        "the next month",
        "several months",
        "up to 30 hours",
        "the AirPods Max",
        "Adaptive",
        "many years",
        "CPU",
        "Sonos Ace",
        "5.1",
        "iPad",
        "Reddit",
        "Ray",
        "Becca",
        "Bose",
        "This Galaxy S24 Ultra",
        "Apple TV",
        "a few months",
        "two",
        "AirPods Max",
        "Pixel Fold",
        "the Sonos Ace",
        "SONY",
        "Ace",
        "AirPods",
        "USB-C",
        "a ton",
        "Bose",
        "Sonos",
        "Sony",
        "the spring and summer",
        "Last week",
        "Kacey Musgraves",
        "second",
        "MLB",
        "EQ",
        "any day",
        "first",
        "iPhone",
        "3.5 millimeter",
        "Top Gun: Maverick",
        "The Show and Ratchet & Clank",
        "AirPods max",
        "Sonys",
        "The Verge",
        "Beam"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "TIME",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG"
    ]
}