{
    "id": "cXFmqapcP8Y",
    "title": "Does JerryRigEverything Know Phones?",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2020-05-30T15:58:36Z",
    "video_url": "https://www.youtube.com/watch?v=cXFmqapcP8Y",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "jerry rig everything",
        "jerryrigeverything",
        "jre",
        "royole flexpai",
        "galaxy",
        "note7",
        "samsung",
        "google",
        "android",
        "apple",
        "smartphone",
        "pixel 3a",
        "oppo",
        "oppo reno",
        "htc",
        "htc ultra",
        "redmagic 5g",
        "vivo",
        "vivo nex",
        "oneplus",
        "oneplus 7 pro",
        "lg",
        "lg g7",
        "s20 ultra",
        "motorola",
        "moto g4",
        "s8",
        "game",
        "smartphones",
        "teardown",
        "jerryrigeverything lego",
        "samsung galaxy",
        "technology",
        "durability test",
        "jerry rig",
        "lifes a diy project",
        "tech",
        "dbrand",
        "game show",
        "trivia"
    ],
    "views": 411911,
    "likes": 17363,
    "comments_count": 627,
    "description": "JerryRigEverything has taken apart A LOT of phones, but how well does he remember them?   Subscribe to Zack!  Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Does MKBHD Know Tech?  Galaxy Z Flop:  Does Snazzy Labs ACTUALLY Know Phones?  Does Austin Evans ACTUALLY Know Phones?  Buying the TINIEST Phones on Wish:   Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://www.youtube.com/JerryRigEverything",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "https://youtu.be/cXFmqapcP8Y",
        "https://youtu.be/ZskdtxrPJoE",
        "https://youtu.be/O8ri-QIP1eE",
        "https://youtu.be/Ltq96nc-64M",
        "https://youtu.be/UGYfi06PGJU",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, welcome to This Is JerryRigEverything, do you know your own videos? Do you know the smartphones that you have tortured and, and surgery ed, and how would you describe what you do? - Um, It's repair, mostly, kind of sometimes. - Okay. I like that. Sorry. The, the, the smartphones you have repaired. So the name of the game is very simple. We have a list of 12 phones that you have repaired, and for everyone you get right, you get one step closer to winning the ultimate who wants to be a phone millionaire prize, except there's no prize. So the only thing we're doing here is a gentleman's agreement. If you get six or more rights, so 50% This Is account will tweet, literally whatever you want. However, if you cannot get six or more correct then you have to tweet out a congratulations link to us. Does that seem fair? Does that seem like a wager you you'd like to take up? - Fair enough, let's do it. - Alright, cool. Let's start out with the very first device. Okay. All right, all right. Ready, and (snaps) - Oh man, this is going to be rough. (laughs) - So before we get too far into it, I can let you know that you do have one lifeline available. It's phone a Ken, where you can call Ken and he may or may not be helpful. Previously he was very helpful. Other times he's literally had no idea. So just putting it out there. You've got 12 phones to go through, but the phone a Ken is available if you need it. - Trying to remember what blue phones I've worked on recently. How far back do you guys go? To the beginning of time or what? - The beginning of time my friend. - Blue phone is it, this is an HTC phone maybe. Full disclosure I'm not emotionally attached to any of the phones I take apart obviously. So, shoot. What if I get the brand but not the model? - Ooh, I can give you half points if you get the brand. That seems, that seems reasonable. Can I ask what happens to the phones, after they've been repaired? - Um, a lot of times, well, I keep them I only keep two years worth of phones at a time. After that two years, then I you know part them out or sell them or whatever. But like this Galaxy S20 Ultra, like I've used in probably four or five different videos. Like taking apart you know, the camera and you know different parts of it to explain what's going on. As I take apart other phones, like I do use the phones for multiple videos. Um, shoot. I don't know. I would say this is an HTC phone. - Okay. Would you like to hazard a guess at what type of HTC phone? - It wasn't, was it? No. The 10 was a terrible phone to take apart. So it wasn't the 10. I'm second guessing myself now. I have no idea what the model is. I'm going to I'm going to guess HTC, but I have no idea anything else? - Well, Zack from JerryRigEverything, you are 50% correct. It is an HTC. It is the HTC Ultra. - Was it? I thought that one was pink, wasn't that phone pink? That was the Ultra Sapphire edition. Okay. Okay. I took apart two HTC 10 Ultras, all right. - Okay, okay. - You guys are making this tricky. - Well, okay. Well, if you think it's tricky, why don't we move on to phone number two. - This is the, it's not the Galaxy Fold. Is that other one. The, the weird one. Ah, this is going to take me a minute, it's not the Galaxy Fold. It's the I've tweeted about it (laughs) and oh Royole Flexpai, Royole. That's what this one is. Okay. That only took 20 minutes. (laughs) - You are 100% correct, my friend. You were worrying me there a little bit. I was like, oh, I mean cause there's a literally two folding phones like this. All right. So you are currently at three of four potential points. So looking pretty good so far. Shall we move on to phone number three? - This is a, I want to say this is the Google Pixel. Um, is it the Pixel 4? I'm going to go with that, Pixel 4 and it's probably the XL, but if I get the brand right then it's half a point, Right? - And you will have and indeed got half a point. This is actually the Google Pixel 3a. - Ah, all right. I was close. That the power, the colored power button gives it away. - Mm-hmm, mm-hmm. It's a little bit of a tough one though, because I feel like the Pixels are a little um, generic looking inside, I guess. I mean you can certainly see like this one is, I'm assuming this is the Lite one. - Yes. And I have it in a stack right there. - Yeah. I actually didn't think about that. That you would have all of these phones, literally like off to the side. You don't even need the photos. You can just look over and see. (laughs) - If I had them like mounted on the wall. This would be so much easier. - 50% points means you were still in the green, my friend. So let's move on to phone number four. - Okay. Um, this one is the Galaxy S20 Ultra, right? Let me just hold this phone up real quick. Oh, we're losing parts. Yeah. We're going to go with that one. - All right. As soon as I saw you, as soon as I saw you pick up the S20 Ultra. I was like, Oh damn we should have put this one on the list. (laughs) Yes, of course you were 100% correct. This is the Samsung Galaxy S20 Ultra. I think the one that really gives us away is the huge main camera module. Look, it looks ridiculous. - [Zack] That's definitely it. Cause like the way the cameras are arranged, that's one of the giveaways of any phone really to be honest. - Yeah. Yeah. Well you say that, but, well actually I was about to say you're, you're actually doing you pretty much acing this so far. So why don't we move on to number five. - Hmm, Hmm, Hmm. Okay. This is the Red Magic 5G. Hold on, hold on, hold on. It's got the ribbon cable connector above it. I'm going to go with Red Magic 5G. - And yet again you are 100% correct. I'm afraid we made this too easy for you. You're just cruising through this. - I mean I did just take this one apart, like a week ago so. (laughs) - Okay. True, true. How many phones do you think you've taken apart over the entire career of your YouTube channel? - I would say there's probably like 300 or two or 300 phones that I've taken apart on there that I've recorded at least. - That's pretty impressive. Well, you were absolutely acing it right now. In fact, you're, you're only you're not even halfway through and yet if you get a couple more of these a 100% right. You're going to actually be completely set. So it's time to crank up the difficulty a little bit with phone number six. - Wow. You guys went way back for this one. Holy cow. Look at that camera. What phones was I taken apart back then? Dude this is like from at least five or six years ago. - So walk me through your process right now. What is it that you're looking for on these phones that kind of gives you clues or hints as to what they really are? - Usually I mean, if it can remind me what the video like what I said in the video. So I'm looking for things that I would have talked about in the video. And then once I think of the video, then I can remember the name. But this one, this was like before I had my prior tools and everything. Otherwise they'd be on camera I think. I want to say this is another HTC phone, before they went crazy with their design process. I don't think I have this one guys. I think that, I think you got me on this one. There's two SIM card trays uh, I remember this one because only one SIM card tray was visible in the video. And then the other one was visible after you took the back panel off. Is it like a weird ZTE phone or something? I want to go with that. Is it a ZTE phone? - Zack from JerryRigEverything, you have had an incredible streak of victory so far. And yet that ends because this is the Moto G4 - Motorola's. Alright. Alright. You got me. - And I feel like the thing that really jumps out to me with this one is the green PCB. I feel like most people have kind of like, if phones look much cooler, but this things looks straight out of like 2012 no. We're currently halfway through the game and you're looking pretty good. You have eight of 12 potential points, which means you are comfortably above the 50% threshold. However, let's see if we crank up the difficulty and by crank up the difficulty I mean, it's going to be the same difficulty with item number seven. (laughs) - Hmm, Hmm, Hmm. This is the Galaxy S... You can see the no dogs allowed sticker on the on the battery. So it's gotta be a seven or an eight, but I'm not totally sure which one. Let's go with Galaxy S8 maybe. - Final answer is Samsung Galaxy S8? - Yes. - That is 100% correct. It is the Galaxy S8 with the no dogs allowed sticker. Well done. Well done. That was a tricky one. I, to me that looks more like an S7, but like they're almost identical on the inside as far as I can remember it. I don't remember anything that was hugely separating them. - Except for I know that my, my galaxy S7 video. I know that phone was gold, because I used that phone for like the next year or two after I tore it down and burned it. Cause it had the burn mark in the center of the screen. - Well, you're looking really good, my friend. You're looking really good. So why don't we move on to phone number eight? - Phone number eight. This one's a weird one. What's weird it has the back metal panel that comes off. Which is part of the frame. Cause usually it's the other way around. You remove like one slab and it's just the back and the frame of the phone stays in place. And so like this particular design I haven't seen in a while. So it's definitely one of my older videos at least like two years old probably. Yeah, you guys got me on this one. How about we let's phone a Ken. How about that? Let's use that lifeline. And how is he going to help me again? Is he, has he taken apart phones before? (laughs) - He's probably not going to help you realistically, he might give you some words of encouragement or he might just tell you that he wishes that he had your amazing bald head. - Alright, that works. How's it going, man? It's going great. So I have a little issue. I'm playing this game and I have no idea what this phone is that I took apart how many years ago. Alright. They're cutting us off. Not even none of the names come to my head right now. So we're just gonna go with that one. - All right. Well, I'm sad to say that Ken has led you astray. This is in fact the Vivo Nex Dual Screen. - I should have known that. Okay. I still, I would have never gotten that though. Cause like I would've never gotten that. I wouldn't have never popped in my head. Okay. You guys definitely won this round. - Oh, it's okay. You're still well ahead, my friend. You still have four phones. - Totally remember that phone. Okay. - So you have eight of 12 questions answered and you were sitting currently on 10 points. You just need essentially two more points to tie. As soon as you hit 50%, you win. All right, move on to phone number nine. - OnePlus 7T final answer. - This is the OnePlus 7 Pro. - Pro, dang it. Oh, man. As soon as you were saying that the OnePlus and you paused I saw the pop up camera and I'm like, ah, shoot. I missed that. - So obviously the battery had to be removed because I mean, you know if you had the battery, it would look like one of the wonderful Teardown skins available @dbrand.com/internet. Can you pitch it? I don't even know what it is. - It is the the skin I use on my regular everyday carry though. So you can see the inside of the phone without actually being inside the phone. - Well, half a point or one point here, because you did get the brand. Means you're still very close to finishing this one out, but still just have three more phones to go. So let's move on to number 10. - It's another popup. What was the one that snapped in half? That was the Oppo Find X and that one had a dual motors. This one has a single motor. The Vivo Nex 3 I think. It was, yeah let's go with that. Let's go with Vivo. - That is incorrect. This is the Oppo Reno. - Oh, cause it pops up. Okay. You guys got to show. Mm-hmm, yeah, this is that weird carrot pizza slice camera. - Yeah. Yeah. So I'd just like to point out that your instincts have been very close, but you thought the Vivo was the Oppo and the Oppo was the Vivo. So you're like you're in the right ballpark. - Shoot. Alright. - Okay. Two more phones though. Two more phones. I still have confidence. Yes, you just need to get one point on one of these two phones. So still very promising. Let's move on to phone number 11. - So it's not, not promising what phone did I take apart that was purple. I know I took apart an LG phone. That was a cool purple color a while back. I don't know if this is it though. I'm going to go with, what I kind of don't know if I can say LG, I'm going to go with LG. Cause that's the only last, that's the last purple phone that I took apart it was like a V40, maybe the LG V40 - Zack from JerryRigEverything. You've made it all the way through 11 questions. And this is the point in which you clench the victory. It is the LG G7. So you officially have 12 points, which means that from this point on the next phone is completely a wild card. You could get it 100% wrong and you still barely squeak out the victory, but well done my friend. Yeah, that is in fact the LG G7. All right. Let's move on to the final phone. See if you can get some extra bonus points here. - Okay. So I think this is a Samsung Note. Was this the Note 7? I think it is the Note 7. That is my final answer. - Congratulations, my friend that is in fact, the Samsung Galaxy Note 7. Famous for it's world, famous reliability. Obviously a phone that had no problems. That clearly was a wild success. - Of course, not. Yeah. Mm-hmm. - Congratulations, my friend you have successfully won the does JerryRigEverything know phones challenge. How do you feel right now? - I feel good. I feel good. The giveaway for this last one was a little marking on the battery connector because that I researched that brand for hours, trying to figure out like the chemistry of the battery and like what was going on with this. So that was the giveaway for this phone, besides the fact that it had the S pen as well. So that was fun, man. Thank you. - So now it is up to you to decide what you would like us to tweet on your behalf. - Oh man, do I have to do that right now? - You can, or you can wait until later, but if you want to come up, come up with it on the spot. It'll make it in the video. Or if not we'll just tweet it at a later date. When this goes live in a couple of weeks, whatever totally up to you. You're the winner you get to choose. - I'm going to, I'm going to marinate on this one cause it's going to be good. (fast-paced music)",
    "transcript_keywords": [
        "phone",
        "phones",
        "phone number",
        "HTC phone",
        "Galaxy",
        "HTC",
        "Samsung Galaxy",
        "number",
        "Yeah",
        "Ultra",
        "points",
        "point",
        "move",
        "Hmm",
        "friend",
        "Samsung Galaxy Note",
        "Ken",
        "video",
        "ZTE phone",
        "Galaxy Fold"
    ],
    "transcript_entity_values": [
        "2012",
        "the HTC Ultra",
        "11",
        "Pixels",
        "Teardown",
        "hours",
        "Red Magic",
        "seven or an eight",
        "only one",
        "the OnePlus 7 Pro. - Pro",
        "one",
        "Samsung Galaxy S20 Ultra",
        "S7",
        "four",
        "Lite",
        "Royole Flexpai",
        "three",
        "the Galaxy S8",
        "six years ago",
        "Galaxy S8",
        "the Samsung Galaxy Note 7",
        "LG",
        "Samsung Galaxy S8",
        "the next year",
        "nine",
        "many years ago",
        "the Vivo Nex Dual Screen",
        "SIM",
        "Royole",
        "Zack",
        "the LG G7",
        "eight",
        "six",
        "Pixel 4",
        "the Galaxy S20 Ultra",
        "two years",
        "V40 - Zack",
        "100%",
        "half",
        "V40",
        "Samsung",
        "two years old",
        "Moto G4 - Motorola's",
        "two",
        "20 minutes",
        "four or five",
        "50%",
        "3a",
        "12",
        "The Vivo Nex 3",
        "Two",
        "HTC",
        "300",
        "Vivo",
        "at least five",
        "Ultras",
        "a couple of weeks",
        "second",
        "five",
        "ZTE",
        "YouTube",
        "first",
        "Ken",
        "a week ago",
        "the Oppo Reno",
        "PCB",
        "seven",
        "Oppo",
        "XL",
        "OnePlus",
        "10"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL"
    ]
}