{
    "id": "CxhjKExMrD0",
    "title": "Sony Vision-S concept car first look",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-01-08T15:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=CxhjKExMrD0",
    "category": "Science & Technology",
    "tags": [
        "sony",
        "sony vision s",
        "vision s concept car",
        "concept car",
        "sony vision s concept car",
        "sony car",
        "sony electric car",
        "electric car",
        "electric cars",
        "electric sony",
        "electric vision s",
        "sony electric vision s",
        "sony surprise announcement",
        "surprise",
        "announcement",
        "sony ces",
        "sony ces 2020",
        "ces 2020",
        "ces",
        "2020",
        "consumer electronics show",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 430365,
    "likes": 7703,
    "comments_count": 618,
    "description": "Sony made a car. That's right, the Japanese tech conglomerate surprised everyone at CES 2020 when it announced the Sony Vision-S, an electric concept car that's chock full of screens, sensors, and all sorts of technology the company is known for. Sony doesn't plan to mass-produce the car, but it's certainly turned a ton of heads at this year's show.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/302pvW1",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey everybody! This is Sean O'Kane from the Verge, and I'm standing in front of what is probably the surprise announcement of the Consumer Electronics Show this year, at least in my mind. Which is that Sony announced a car. This is the Sony Vision S. That's right, at the end of Sony's press conference the other day the company just rolled out an electric concept car, talked about it for a few minutes, and then that was it. None of us were really expecting this in any way. I think the most surprising thing about it is that it looks pretty legit. Sony calls it a prototype car, but it really falls between what we traditionally consider to be a concept car and a prototype. Meaning that it has things like functional brakes, and a dashboard and touchscreens that work, and a whole bunch of other little touches that you expect to see on a car that a company is actually going to try and develop and test out on the road. And on the design side, it actually looks pretty competent. It shares a lot of traits with modern electric vehicles like your Teslas, or even some stuff from start ups like Lucid Motors. That means a lot of really smooth lines and a big sweeping glass roof, and lighting that sort of pipes all the way around the front and rear of the vehicle, and of course door handles that pop out. Probably the most impressive thing inside the car is that the software looks really well polished, the design of it is really clean, and it all moves really well. There's really fluid animations, the graphics all look really nice, there's basically everything you would expect from a Sony touchscreen product. Not everybody's going to want a set of touchscreens that span the entire dashboard, but as we head towards a future where automakers put more touchscreens inside their cars, this might be one of the better ways to pull it off with these sections that go across the dashboard, that have the ability to display different content for the driver and the passenger. So that the driver isn't as distracted by whatever it is the passenger's looking at. There's also a lot of different interface elements here. You can use the touchscreen up on the dashboard, there's this touch pad on the center console, as well as a volume knob. You've got buttons all over the place. It's basically everything you would expect from a screen based Sony product, and it again sort of speaks to this idea that Sony is really trying to get the point across that this is not just a concept car, this is not just something that's throwing a lot of ideas out there, but this is something that is basically close to a prototype. They wanted to make something that felt like a real car. And sitting inside here and spending a little bit of time with some of the user interface elements, it does really give that feel. Now why did Sony go and make an electric concept car? Well, the company basically makes a whole bunch of different technologies that it thinks would play well in the automotive space. That could be it's camera sensors, which are crucial to things like autonomous driving, to things like 360 degree spatial surround sound that permeates the inside of the cabin. And Sony figured, what better way to advertise that we really want to push into the automotive space, than to make a pretty legit looking car on our own. That said, they developed the car in conjunction with an automotive spire called Magna, so they had a little help in putting this thing together. But as far as Sony is saying, this is a real car that could roll. You wouldn't be able to drive it on roads right now, but they really put the work in to make something that would prove to potential customers in the industry that they're really thinking about what it would take to put their technology in an actual car. Now that unfortunately means you're probably not going to be able to buy a Son car any time soon. Sony says it has no plans to mass produce this, or even do a limited run version of this car. And knowing how hard it is, and how much money it takes to put a car into production, it's probably for the best that Sony isn't going down that road as exciting an idea as the Sony car might be. Hey everybody, thanks for watching ! And if you liked the Sony car, maybe you'll like the video that we just made about Mercedes Benz's very weird Avatar concept car.",
    "transcript_keywords": [
        "Consumer Electronics Show",
        "Sony",
        "car",
        "concept car",
        "Sony car",
        "Consumer Electronics",
        "Electronics Show",
        "electric concept car",
        "Sony Vision",
        "concept",
        "Sony touchscreen product",
        "Sony touchscreen",
        "Show this year",
        "Sean O'Kane",
        "Avatar concept car",
        "lot",
        "make",
        "dashboard",
        "inside",
        "basically"
    ],
    "transcript_entity_values": [
        "the Consumer Electronics Show",
        "Sony",
        "Verge",
        "Son",
        "Mercedes Benz's",
        "Sean O'Kane",
        "the other day",
        "a few minutes",
        "Lucid Motors",
        "this year",
        "Magna"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "PERSON"
    ]
}