{
    "id": "cYcPJR_IE1o",
    "title": "2020 iMac Review - Worth the Wait! - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2020-08-28T20:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=cYcPJR_IE1o",
    "category": "Science & Technology",
    "tags": [
        "2020 iMac Review - Worth the Wait! - Krazy Ken's Tech Talk",
        "2020 iMac",
        "iMac (2020)",
        "iMac 2020 Review",
        "27-inch iMac",
        "Apple",
        "Mac",
        "macOS",
        "MacBook Pro",
        "Intel",
        "core i9",
        "AMD Radeon",
        "iMac",
        "Macintosh",
        "CPU",
        "Computer",
        "Tech",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer Clan",
        "AMD Radeon 5700 XT"
    ],
    "views": 33257,
    "likes": 1632,
    "comments_count": 224,
    "description": "Apple's new 2020 iMac has arrived. This is a build-to-order 10-core i9 configuration with an AMD Radeon 5700 XT. Is it worth it for everyone? Should you wait for Apple silicon? Is it fast? Good questions. Also, I share a few tips on how I saved hundreds of dollars while buying this computer. ; )  Join our channel and get cool stuff   What is Apple silicon?   Subscribe for more tech videos!   Watch more videos like this!    Save money on that RAM upgrade. ; ) 32 GB RAM Upgrade for iMac   64 GB RAM Upgrade for iMac    Follow us on Twitter   Like us on Facebook    Krazy Ken's Tech Talk - 2020 iMac Review - Worth the Wait!  Like the wallpapers? Get more of them on the Computer Clan website     Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!   Contact Us    Want music for your videos?   (We use these guys a lot. They're good.)  Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program. #KrazyKen #ComputerClan",
    "description_links": [
        "https://bit.ly/clan2JGWYhz",
        "https://bit.ly/clan2Vmb3Hq",
        "http://subscribe.thecomputerclan.com",
        "http://bit.ly/clan2UrG7G5",
        "https://amzn.to/31Aezl0",
        "https://amzn.to/3hEoDiq",
        "http://twitter.com/thecomputerclan",
        "http://facebook.com/computerclan",
        "http://thecomputerclan.com/wallpapers",
        "http://Patreon.com/KrazyKen",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "https://bit.ly/clan2Dr3M3e",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- Okay, so I'm converting a 4K video in HEVC on this MacBook Pro. So let's try it on this iMac now. And holy frick, that is fast. (electronic intro music) Hey guys, how are you all doing? Really? That's just great. You know, I'm doing pretty great today too, because Apple's new 2020 iMac is now in my lair. Honestly, it's been a long time since I purchased a new Mac. It's been about seven years, and I've never purchased an iMac before. I've always been a laptop guy, so this is kind of new to me, and trust me, I wanted to get this review episode out earlier, but this is a build to order configuration. So those take a little bit longer to process before they ship, but it'll be worth it. Now, before I continue, I will say, I have decided to officially return this iMac, and I've had some people asking me why I want to do that, so later in this episode, I will explain that, don't worry. So is the new iMac worth it? Should you wait for the Apple silicon version with the new redesign? Is it fast? Good questions, let's talk. Let's start with the design. If you've followed Apple at all for the past eight years, you'll notice the design is, well, exactly the same as it was eight years ago. I don't think that's a problem, personally. I still really like the design. I think it's beautiful, and the next iMac design is going to follow more of the iPad Pro type of design language. So if you want to wait for that, that's okay too, but keep in mind, from today, you're going to be waiting about a year minimum before they have that new design ready. So you'll have to determine whether or not the wait is worth it for you. I just bit the bullet and did it anyway. The design, yes is getting a little old, but it's a little bit timeless too. I think Apple is sticking with it because they have cool plans coming and they just want to get it right, but also, it's kind of just good the way it is. I mean, I know some people would like thinner bezels and all that, and don't worry, I think we're going to see that soon, but for right now, I still think the design is great with a really thin edge. And how about that display? It is a Retina 5K display with P3 color and True Tone, which automatically adjust the displays color temperature based on the ambient lighting. Now Apple's had Retina 5K iMacs for a couple of years now, but this is the first time they integrated the true tone feature, and if you're daring, for an extra 500 bucks, you can get the nano texture glass, which is a glass that has a matte finish to it, so glare is reduced dramatically, and I'd like to try that out sometime. This is just the regular gloss screen version. So I was using this LG 34-inch display for a long time, which is still a nice display, but switching from that to this iMac was a night and day difference. The resolution is so high on the screen, everything is just so fricking sharp and crisp, and the colors pop just a little bit more, which looks really nice. But also an important thing to me as a video guy is I can see 4K video output in a canvas that doesn't take up the whole fricking screen. The pixels are so packed together that I can see true 4K resolution without consuming the whole display, so I still have room to work in other parts of the interface. And this is like, this is gonna sound kind of funny, but my LG display actually wasn't a 4K display. So I'd been editing and releasing 4K episodes out on YouTube for the past couple of years or so, and I actually haven't been able to view them at native resolution this whole time. Oops. But with this new iMac, now I can. Okay, so the IO on this thing makes me really happy. I can plug in anything I have. I just need one adapter for my Thunderbolt 2 stuff, no big deal, but everything else is built in USB type A, perfect ethernet, I don't need a dongle for it, like I do on my laptop. Ethernet's built in, SD card reader. So, a perfect compilation of ports ready to go. So this iMac has an updated camera and microphone system as well compared to the last model. So the camera can now record in 1080p resolution and there's a T2 chip in this computer, so it can do some automatic adjustments with the image signal processor in it, kind of like what your iPhone does. So the camera can do things like automatic tone exposure and adjustments and stuff like that too. Okay, so you can't see me right now, but it's okay. It's me, you know who I am. So let's test out the camera system here to see how it looks, and we'll also test out the microphone to hear how it sounds. So, this is the new 2020 iMac FaceTime camera, and the microphone's not too bad for built-in stuff. The only awkward part is now, what the heck do we talk about? Oh, tongue twisters. Yes, let's do some tongue twisters. Um, unique New York. Can you say that? That was pretty easy. Ooh, Irish wristwatch. That's a fun one, right? Fool your friends with that one. It's a cool little party trick, not that I'd know. I don't get invited to parties. So as you can hear, it's not studio level quality, but it's a little bit better than what you'd get on the older systems. and compared to my laptop, I've noticed it is way better too. This is the camera and microphone on the MacBook Pro I just upgraded from. You can see uh, definitely not as good with the highlight roll offs, and the color, and a lot more noise 'cause it looks like it's boosting the ISO to try to compensate for less light, especially in this area here, in the darker areas, lots of noise, and the microphone has more of that, kind of like, wishy washy, kind of like noise cancellation going on there. So yeah, definitely not as good, nice improvement. So I mentioned the T2 earlier, which again, can help with things like the cameras and the microphones, but overall it is a security chip, and this is the first non-pro iMac to feature the T2 Security Chip. So, that offers things like secure boot and on device encryption to keep your data safe. You can use that in addition to the file vault feature, which encrypts your data, so you have plenty of security there to make sure your data can't be read by anybody else. But this chip does other things too. Like what I showed at the beginning of the episode with that HEVC hardware accelerated encoding. The reason why it's able to render so fast is because of the T2 chip, and it screams. So there's nothing new with the speaker system in this particular upgrade, but just for fun, let's try it out anyway with a little bit of music so we don't have copyright issues. (music plays briefly) Okay, those are pretty loud. They got a little bit of bass in there too. I mean, those are pretty loud considering they're built-in, tiny speakers that, when you're looking at the computer from the front, you can't even see them, so. Not too bad. This next feature is really important to me, and I don't even think Apple advertises it as a feature, but it's still important. Silent operation. So I've been using laptops for pretty much all of my professional life, and laptops have small, high RPM fans in them, which generate loud noise when they're at full throttle. But this iMac, when it's idling, you can barely hear the fan, and even under load, the fan does top out at 2,700 RPM, according to max fan control. But even at max speed, it's nowhere near as loud as the MacBook Pro. Okay, so let's take a break from that stuff and just geek out about the specs for a while, right? We all like to do that every so often. So this particular configuration has the maximum processor config you can get on Apple's website. It's a 3.6 gigahertz Intel core I9 10-Core processor. It also has an AMD Radeon 5700 XT with 16 gigabytes of video memory. That is also the highest config you can get with this model, and it has a one terabyte SSD with speeds up to 3.4 gigabytes per second, but you can configure it up to eight if you want. So what about the RAM? Well, thanks to you awesome YouTube viewers, you reminded me that you can actually upgrade the RAM in this iMac, which is good because Apple charges $600 for the 32 gigabyte RAM upgrade. Six hundred dollars. Why? So, I actually ordered the 32 gigabyte RAM configuration at first because I forgot you could upgrade it, but when everybody reminded me, I actually canceled that order, and then just ordered the 8 gigabyte stock version and bought 32 gigabytes of RAM from a third party and threw it in there, and it turns out there's four slots, not just two, so my two 16 gig sticks just combined with the two 4 gig sticks in there, and now I have 40 gigabytes of RAM, because why not? So, yes, the RAM is upgradable. My advice to you, just buy the stock 8 gigs and upgrade the RAM later. You'll save hundreds of dollars. Enjoy that while you can, because the Apple silicon iMac will probably not have upgradable RAM. We'll see. But anyway, thank you YouTube viewers for looking out for me. So now the big factor, probably the main reason I bought a new computer in the first place, speed. How fast is this thing? Well, we already saw how fast the HEVC encoding was. That was beyond impressive, but what about Final Cut Pro renders? So fun fact, every episode you watch from me has been cut, rendered, and exported with Apple's pro video software Final Cut Pro, and it screams on this computer. So I used my Windows '95 \"Krazy Ken's Tech Talk\" episode as the benchmark for this. It's an 8 minute and 51 second long 4K episode. The export time on this iMac, 4 minutes and 53 seconds. But more importantly to me is application performance, not just rendering and exporting and background tasks and all that stuff, but how smooth does the application function when you're actually using it? So, on my older MacBook Pro, I would have usually a lot of frame drops and, it was still good, like Final Cut Pro still worked really well considering how old the hardware was, but there would be frame drops, audio stuttering. I would have to use the better performance mode, which plays back the image at lower resolution, but at an ideally, hopefully better frame rate, but even then I would still drop frames. I got used to it, but it was just kind of sluggish, but on this iMac, virtually none of that. No lag, I don't need to use the better performance mode, I can just use the better quality mode. I can watch the 4K video, complex timelines, scrolling, scrubbing, trimming, playback. It's all just smooth as butter. Now, keep in mind, not every application is going to get magically faster on faster, newer hardware. It depends on how the software works. So for example, if I'm doing audio corrections and like fixing and sweetening in Adobe Audition, and I have the spectral display up, well, part of me was wondering, wow, I wonder if the spectral display can redraw itself faster on this newer hardware, but no. It performs the same as it does on my MacBook Pro, so it depends on how the software is optimized for your hardware, so just keep that in mind. So was the new iMac worth it? The 2020 iMac. If you purchased a new iMac, like the previous generation within the last year or so, you probably don't need to upgrade. You can stick with what you have. But if you have something that's older, yeah. I would say it's worth it. But if you've waited as long as I have, definitely it's worth it. Just don't buy the RAM from Apple. Is it fast? I believe we proved that. Absolutely, it's fast. I say go for the 10-Core configuration. That's what I did. And should you wait for the Apple silicon version, considering all this stuff we looked at? Well, again, if you're in need of a new computer, you're in need of a new computer. I personally don't care about the Apple silicon stuff, and the new design and stuff, because I just needed something new, and when Apple transitions to Apple silicon, there's going to be some bumps in the road. Keep that in mind. So if you want to be an early adopter, great, but expect problems right at the beginning, and if you want to avoid that and just have a faster system, don't worry about Apple silicon. Don't wait, just buy the new computer now. Now Apple silicon is kind of a rabbit hole we could get down, but I don't want to do that right now, because I already did do it. Go check out this other episode after you watched this one. It's really good. Also if you'd like some awesome royalty free footage for your own videos, channel affiliate Artgrid has you covered. They also have royalty free music too. Feel free to grab all of that with the link in the description. Okay so, everything sounds so freaking awesome. Why am I returning this iMac? Well, there's two reasons. The first reason is nano texture. I know, that may sound silly. I really want to try the nano texture. Again, the glossy wasn't too bad, but I saw some other people tweet about how cool nano texture is, and I've never tried it before so I just want to try it. Jonathan Morrison swears by it. Maybe I should have listened to him from the beginning. So, we'll see how it goes. I might post a followup episode about the nano texture model once I get it, or I'll at least talk about it on Twitter, so make sure you're following me on there. So, stay tuned for that. And the second reason is, I accidentally ordered this iMac without being logged into my Apple Business account. There is a business store on their website. So my advice to you is if you have a business, purchase through the business store, you can save a couple hundred bucks on some Macs, and that's what I did for the nano texture model. So I actually saved a couple hundred bucks doing that. Keep that in mind, you got a business, buy with the business store, save some moolah. So I'm insanely excited to keep testing out this new iMac, and the nano texture once that gets here. If you have any questions about the iMac, maybe you're on the fence of buying it, just let me know. I'll do my best to answer them, and feel free to comment anything that you like or don't like about this iMac. I don't mind which way you go. I just want to hear what you think. If you'd like to support this channel, plus get some awesome perks, feel free to click the join button below or use the link in the description. Thank you for your support, and if you liked this episode, you know what to do. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat electronic music)",
    "transcript_keywords": [
        "Apple",
        "iMac",
        "Apple silicon",
        "Final Cut Pro",
        "RAM",
        "Pro",
        "Apple pro video",
        "Apple silicon iMac",
        "MacBook Pro",
        "Cut Pro",
        "design",
        "display",
        "Apple silicon version",
        "Apple pro",
        "episode",
        "nano texture",
        "kind",
        "stuff",
        "bit",
        "Apple silicon stuff"
    ],
    "transcript_entity_values": [
        "3.6 gigahertz",
        "a couple of years",
        "YouTube",
        "up to eight",
        "about a year",
        "4 minutes and 53 seconds",
        "two",
        "Final Cut Pro",
        "the MacBook Pro",
        "YouTube",
        "Apple Business",
        "four",
        "one",
        "hundreds of dollars",
        "MacBook Pro",
        "Final Cut Pro",
        "Twitter",
        "2,700",
        "the past couple of years",
        "2020",
        "this MacBook Pro",
        "Apple",
        "max",
        "40 gigabytes",
        "8",
        "Retina 5K iMacs",
        "HEVC",
        "my MacBook Pro",
        "Mac",
        "Irish",
        "about seven years",
        "16 gigabytes",
        "IO",
        "first",
        "4",
        "1080p",
        "iMac",
        "8 minute and",
        "600",
        "Macs",
        "USB",
        "the MacBook Pro",
        "32 gigabytes",
        "Thunderbolt 2",
        "eight years ago",
        "Artgrid",
        "New York",
        "ISO",
        "iPad Pro",
        "today",
        "Jonathan Morrison",
        "the T2 Security Chip",
        "Six hundred dollars",
        "Windows",
        "10",
        "AMD Radeon 5700 XT",
        "the last year or so",
        "LG",
        "iPhone",
        "32 gigabyte",
        "third",
        "P3",
        "8 gigabyte",
        "Adobe Audition",
        "34-inch",
        "2020",
        "a couple hundred bucks",
        "an extra 500 bucks",
        "T2",
        "SD",
        "RAM",
        "iMac",
        "up to 3.4 gigabytes",
        "Intel",
        "second",
        "95",
        "iMac FaceTime",
        "the past eight years"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "GPE",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "FAC",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "NORP",
        "DATE",
        "QUANTITY",
        "LOC",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "FAC",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE"
    ]
}