{
    "id": "cyJ7aWLWSSM",
    "title": "Apple’s NEW MacBooks for 2018 - My Predictions!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-03-10T17:29:28Z",
    "video_url": "https://www.youtube.com/watch?v=cyJ7aWLWSSM",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "dave2d",
        "dave lee",
        "laptop",
        "laptop 2018",
        "notebook",
        "notebook 2018",
        "apple",
        "macbook",
        "mac",
        "macbook air",
        "macbook pro",
        "macbook pro 13",
        "macbook pro 15",
        "new macbook",
        "best macbook",
        "most powerful macbook",
        "best laptop for school",
        "best laptop for students",
        "best laptop"
    ],
    "views": 614000,
    "likes": 14384,
    "comments_count": 1299,
    "description": "Apples upcoming MacBook lineup for 2018 looks pretty awesome with a new MacBook Air and a refresh to the best MacBook on the market - The MacBook Pro Marble MacBook -  Marble Laptop Skins -   Music Credits: Fili - H2O  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2DgmHYo",
        "http://bitly.com/1MovGDv",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave 2D here, so it's 2018. We're gonna get refreshes on basically every single Apple laptop. Some will be bigger refreshes, some will be smaller. But, I'm gonna take this time to kind of explain what I feel like those changes might be. So, the first one, the big one, is gonna be this 13-inch entry-level laptop. This is gonna be like the \"new\" MacBook Air. And what makes this thing special is its price tag. It's supposed to come in around $900. So, cheaper than the current MacBook Air. And I think it'll have USB-C charging, but no Thunderbolt 3, no fancy stuff, no touch bar, no super high-res display. It's just gonna be a very productivity focused device that's thin and light. And the key here is price. They want this thing to be affordable for everyone. Basically for students, or anyone who doesn't need a super powerful computer, this can be a good option. Now, it's gonna have 8 gigs of RAM, nothing super crazy. And the processor is gonna be probably a Y processor. Maybe a U, but it really will be just a refresh version of something like the MacBook Air. Now the existence of that product, the existence of a $900 MacBook is going to affect the sales of this. The base model 13-inch MacBook Pro without the touch bar. I actually think that this model, the one without the touch bar, is going to be removed. And the rest of the 13-inch MacBook Pros are going to be upgraded. So I think those laptops will not be running Kaby Lake R chips. So I think a lot of people think that those Kaby Lake R CPUs that we see in a lot of ultrabooks will be running in those 13-inch MacBook Pros. I don't think so. They're gonna be running the new Coffee Lake U processors. And what makes this thing special is the 4-core CPU. So, basically every single 13-inch MacBook Pro that has ever existed has used a 2-core CPU. This now has a 4-core CPU that can have 8 threads if its hyper threading. It's a very, very good computer for applications that can take advantage of multi-core stuff. I think one of the big examples is content creation. So, if you're a video editor or photo editor, a lot of people prefer to have the size of a 13-inch MacBook. But, they want that power from the 15-inch MacBook. Now, you have a 4-core CPU in a small form factor. I think a lot of content creators are going to like that. So let's move on to the next one. The 15-inch MacBook Pro is gonna be changed. This is still not gonna have an Nvidia card. It's going to be AMD. I think a lot of my audience wants to see an Nvidia card in a MacBook. It's just not gonna happen any time soon. One, the wattage is too high. You can't run any of the ten series cards from Nvidia with just a Thunderbolt 3 port. It goes way over 100 watts. The other thing is thermals. There's no way that a MacBook Pro with this kind of thickness is gonna be able to cool any kind of ten series cards effectively. So you're gonna get AMD cards here. Lower wattage AMD cards. In terms of the CPU. I think a lot of people are hoping for the Kaby Lake Gs. So that 8th gen chip that pairs an Intel CPU with an AMD GPU. The performance is very good and it's very efficient. Both energy and space-efficient. So on paper it seems like that's like the perfect chip for Apple. But, that's just my guess is they won't be using that. That's just not how Apple does stuff. They tend to use more custom stuff. So they're I think they're going to use the H processors from Intel. Like those Coffee Lake H processors, 6-core and a custom AMD chip to go with it. A 35-watt Vega GPU. It's gonna be good. It's gonna be an upgrade from the current existing 2017 ones. But, it's not going to be like a massive increase in the GPU side. The CPU because it's running that 6-core. It's gonna be a big step up for certain applications, but again, it's gonna be one of those things that are multi-core dependent. The last one is the 12-inch MacBook. I think it'll get a bit of a spec bump, nothing crazy. I'm thinking the CPU will just bump up to canon, Lake Y. It's a really good seller for Apple. So they're not gonna get rid of it, it's just not my type of laptop. So, I'm not that interested in it. So upgrades across the board are gonna be pretty good. And I think battery life for these new laptops will be bumped up a bit. Obviously, with more efficient CPUs. But, I actually wouldn't be surprised if they try to put terraced batteries into the MacBook Pros. So the 13 and the 15-inch. When they first launched these in 2016, they didn't use terraced batteries. Like the type of battery tech that we see in the 12-inch MacBook, where they kind of shape the battery to the space of the internals. It's impressive technology, but, the 2016 and the 2017 inch MacBook Pros didn't have that tech. And there were some reports that Apple is trying to put that battery tech into their MacBook Pros before launch, but, it never happened because they ran out of time. Hopefully they do it this year. And there's actually a lot of space in here for extra battery, so, we'll see what they do. Hopefully this video was helpful. I mean, if you're thinking of buying a MacBook Pro or MacBook right now, probably hold off because all these things are supposed to come out kind of end of Q2, like June-ish. So, yeah, I would wait till then if you could. Okay, hope you guys enjoy this video! Thumbs if you liked it, subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "MacBook",
        "MacBook Pro",
        "CPU",
        "MacBook Air",
        "Kaby Lake",
        "Pro",
        "Pros",
        "Lake",
        "lot",
        "AMD",
        "Apple",
        "Coffee Lake",
        "good",
        "Air",
        "running Kaby Lake",
        "AMD cards",
        "kind",
        "battery",
        "Kaby",
        "inch MacBook Pros"
    ],
    "transcript_entity_values": [
        "the Kaby Lake Gs",
        "Thunderbolt 3",
        "Kaby Lake",
        "2",
        "Kaby Lake",
        "Coffee Lake H",
        "8th",
        "MacBook Pro",
        "Lake Y.",
        "4",
        "MacBook",
        "Dave",
        "AMD",
        "Q2",
        "CPU",
        "GPU",
        "the MacBook Pros",
        "ten",
        "12-inch",
        "this year",
        "Apple",
        "15-inch",
        "MacBook Air",
        "Y",
        "35-watt Vega GPU",
        "2018",
        "CPU",
        "MacBook Pros",
        "Coffee Lake U",
        "first",
        "2017",
        "13-inch",
        "the MacBook Air",
        "2016",
        "RAM",
        "13",
        "MacBook Air",
        "6",
        "MacBook",
        "June-ish",
        "Intel",
        "900",
        "Thumbs",
        "USB-C",
        "One",
        "8",
        "Nvidia",
        "U"
    ],
    "transcript_entity_types": [
        "LOC",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "LOC",
        "LOC",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "FAC",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "LOC",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "FAC",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP"
    ]
}