{
    "id": "CYoGJIIyEcs",
    "title": "I actually like this! - Epomaker RT100",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-04-02T18:46:41Z",
    "video_url": "https://www.youtube.com/watch?v=CYoGJIIyEcs",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy"
    ],
    "views": 504141,
    "likes": 13254,
    "comments_count": 739,
    "description": "Check out Volta Anchor using the link below:   We've covered a lot of gimmicks here on ShortCircuit, but this mini-display might be the cutest gimmick yet. Will Plouffe be wooed by this new idea, or do other issues overshadow this keyboard?  Buy an EPOMAKER RT100 Mechanical Keyboard:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Plouffe's two favourite things 0:33 Unboxing 1:59 The mini-display and misc. features 3:35 Build quality, weight, and design impressions 5:33 Sponsor - Volta 6:06 Plouffe loves the cable 7:03 Trying out the display 9:03 Included switches/keycaps and typing test 12:10 Pricing and overall thoughts 14:25 Outro",
    "description_links": [
        "https://www.voltacharger.com/products/volta-anchor-wireless-stand",
        "https://geni.us/p8Q9",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- You've seen me talk about a lot of keyboards. You've seen me talk about a lot of displays, but what about the EPO Maker RT100? As you can see here, it's got the optional, smart screen. And our box is checked off. I swear to God, if we open this thing and it doesn't have the screen included, I'm gonna be so mad. We've also got some switches from EPO Maker. They're Flamingo switches. I've never tried these, but they're pink and they look cool. So, I'm excited. And we've got a little card from EPO Maker that says, they wanna thank us for supporting their community. I haven't bought any EPO Maker keyboards before, But, you know, I've never heard anything bad. I've never heard anything particularly good. So let's open the box and give it a shot. As we've got on the back, actually I wanna look first. It's got a customizable knob, wireless could driver, I think that's supposed to be cloud, gasket structure, double sound absorption, built-in lithium battery. So this thing is wireless. It's got a 5,000 milliamp power battery. And, innovative smart screen. On top of full keys, hot swappable. And I don't know what the refined stabilizer is. I get what they mean by refined stabilizer, but I don't really understand the graphic that they've chosen. It's like a little gear cog and there's a switch and there's a circle around it. I don't get how that is a stabilizer, but whatever. It's supposed to be a retro design and I can see that. It's pretty apparent with the like, brown and gray. The enter key is upside down for some reason. We'll fix that. If you like an 1800 layout, it's kind of like that. With the navigation cluster in the bottom here. But, like it's compressed. So it's not a full keyboard, but you're really only saving like, half an inch to an inch compared to a TKL, which can shave off like, a couple inches of space. Oh I guess more than that actually. User manual for the smart screen. See this? I actually need to know. Click the sketchpad menu, click adjust screen time. - [Bell] That isn't interesting. - And then what else we got? We got a cable. Okay, it's got this like fake leather cable tie. So, I guess it's just pleather. Oh, it feels like kind of okay. And then it's got the absolutely thickest USB cable, I have ever had the pleasure of handling. We've also got our switch and key cap puller. And then, there's something in this foam box. It's the display. Oh my God. This is our little, little mini TV thing, that we slip onto to the end of the keyboard, I'm guessing. Cause it's got like, what looks to be a USBC connector. It looks pretty cool. It's like an old CRT monitor. It's not very big. This is probably like, an inch by one inch. Well an inch by, whatever three quarters of an inch is. And then it looks like it's just plugged in through USBC on the bottom here. It normally houses the dongle and it's actually kind of nicely labeled too. 2.4 gigahertz RF transceiver, looks pretty good, I actually like the labeling. And this will house your dongle. However, I don't want the dongle. I don't like how flimsy it kind of feels, just seated through USBC. I wish there was a better like rail system or some kind of lock. So, it's a little wiggly. But to be fair, once it's on your desk and you're not moving, like it's not gonna move around anyway. It's not like you're constantly touching the monitor or something like that. So whatever. It's a tri mode keyboard. So you can do Windows, Mac, I guess Linux, probably too. And it'll basically go through, ah ooh, there's a little on off switch. It's got south facing RGB, for those of you who care. And then it's also got, you can go between Mac or Windows. Which will probably just change your like, Windows key, to a command key. If you don't want to use the dongle, but you also don't want to keep it wired, it does have Bluetooth 5.0. So, you can connect it through Bluetooth. I wouldn't necessarily recommend it, but you know, do whatever you want. It's got flip up feet, adjustable. So two stage. Actually before I do, I'm gonna take this monitor off, before I start flipping the keyboard around. Cause like I said, it already felt kind of flimsy in there. And I went to go move it and it was leaning up against the table and yeah, just not good. It's plastic construction. So, a lot of you out there, who are like, metal only. It's, it might not be the keyboard for you. However, honestly I think it's pretty tasteful especially with the retro look. It definitely looks and feels like, like old plastic, from back then. With a little bit of the like beige kind of tinge to it. And honestly because it's wireless, if you do want to travel around with this thing, lighter is kind of better. And so for a wireless keyboard, I don't mind at all that it's not metal, personally. Speaking of weight, let's see how much it weighs, under a kilo. So it's just over two pounds. Which means to travel with it, yeah, it's really not that bad. If it was a full metal keyboard, CNC aluminum, we're probably talking at least like, three or four or five pounds at least. It doesn't feel like really cheap. It is pretty flexible, but I don't know, not in a bad way. And I personally really kind of dig it. Especially the knob. One kind of minor thing that I noticed right away though. Is it's a separate housing on the bottom, than it is on the top. So this little play button, or whatever, with the speakers and stuff, that all stays perfectly still and it's just the side that's rotating here. Which is a really small thing, but I actually really like that. And I like the play button's got RGB on it. As for the keycaps, I actually think they're okay. They're PBT. Doesn't look like double shot or shine through or anything like that. But, I actually really like the typeface they've chosen. It's kind of fun. It's like a more industrial kind of feel to it, with a backspace, press to backspace. And like, need more space and it's a big space bar. Even the, why are these little running men, with the minus and a plus arrow on them? I'm gonna try typing on it and take a look at the little included screen, turned on. But, not before a word from our sponsor, VOLTA. Thanks to VOLTA, for sponsoring this video. Are you haunted by visions of tangled cables and clutter? Well you're in luck. VOLTA's Anchor is your one stop shop for charging all of your devices, simultaneously. It helps you keep your desk tidy, by combining all of your charging needs into one. Anchor's 3 in 1 charging, allows you to charge your phone, earbuds and your Apple watch at the same time. It supports up to 15 watts of fast charging and its mag ring allows you to use it as a stand, while you charge your device. Head to the link in the description to check out the VOLTA anchor. And use the code SC30 to get 30% off, today. Before I plug it in, I actually want to appreciate this USBC cable a little bit. I really like these connectors on the end. This kind of looks like one of those, slimline LEMO connectors. But, it's on the edge where the USPC is. It's not like a, like a plug, that you plug in and and and unplug it together. And then the USBA is this really crazy metal housing. It sounds like metal. And it looks like you can actually take it apart really easily, with those triangle tip screwdrivers. So, I would love to actually take this apart sometime and check it out. Cause, normally the construction on the ends of these, isn't nearly as good as this. Let's plug it in. Cause what I really want to care, what I really wanna see is this screen. Wow. It's got a really satisfying like, like slot in, on a USB. I've never experienced that in my life. I gotta figure out where they're getting these connectors, cause I actually really want the housing for everything now, to be honest. It's such a dumb point of the cable to like, but I really, really dig it. Is this working? If you're confused like I am, just turn it off and then that's just the wireless mode being turned on or off. It's not the keyboard itself being turned on or off. Because now it's detecting just fine, Device RT100 wired, is set up and ready to go. I don't know why they went with RT100, cause it's 97 keys. And then I guess, maybe they're adding the knob, plus the rotation, for another two. And then what's the third one? The display. I don't know if our display is borked, but it's currently just showing like, a couple of garbage lines here on the outside. Let's see if we can set that up with the driver. This is pretty sick. We've got our driver installed. It took a little while. But, now it's going through this little like, boot up kind of thing. It's cycling through some dates, Monday, Tuesday, Saturday, Wednesday. I have no idea why it's doing that. It's got a little temperature gauge and a CBU usage, which is pretty sweet. I don't think they're working at all, because my CPU is definitely in use and the temp isn't zero degrees, that's for sure. You can change it in the sketch pad, kind of thing. You can change it between RGB or black and white. And you can do a frame by frame picture, if you want. So you can actually make your own animations. Or, you can just upload images. So, say you want a static image, you can do that too. How do I apply? That's what I really want to know. I've made this really garbage, you know, circle plus some lines and I would love to apply it, save. I'm finding the software a little bit confusing. Mostly just to apply, like I can't find a way to actually like take the image that I'm setting and then get it to here. I'm sure you can, but you know, don't expect to just open this thing and start scribbling stuff down, and then applying it to your little extra display. Still super cool. The display definitely works. The software seems to work, just you know, buyer beware, it's not as easy as click, click, you're done. Let's try the actual keyboard itself here. That's what I'm really curious about, because while the display is super cool and I kind of, I kind of like it and I kind of want one now. The reality is if the typing experience sucks, then who cares? You've just wasted all of your money. So we're gonna do a quick monkey type, on the switches that came with this. Let's check those actually really quick. I think that they are, They'll look like just some Kailh yellows, with a clear housing. And this is hot swap. Also, now you can definitely see that. There we go. One thing that they're promoting is that these are Kailh Hot-Swap sockets. I don't know why they're calling them Kailh sockets. More, more people than Kailh, use five pin switches or sockets. But yeah, it's five pin, which is great. So any switch is gonna fit in there. And then like I said before, it's south facing RGB, which is preferable for a lot of people. Luckily, that sounds like just the case. Was that your whole phone, Andy? - [Andy] Yeah. - I'm not crazy about this switch. I don't know what it is. It's just a linear, with kind of like, it feels almost mushy on the very bottom. And I'm just, I'm not sold on simply the switches alone and I don't have time to swap out for these flamingos that came with it. Let's take a quick look at them, before I actually do our typing test. They look pretty. They're pink, if you're into pink. And, Yeah, these are much more my speed. Okay, we looked it up and we're pretty sure these are the sea salt silence, that come with the board. There's four different options. One of them, I can't pronounce at all. I'm not crazy about silent switches, because there's something about them, to get them to be quiet, that feels like almost mushy or like it's dampened, in a way that I'm not fond of. So overall, I'm probably gonna be a little disappointed by the typing test. But that is, I wanna be very clear, that that's definitely the switch this time. And I don't think it's the keyboard. This thing seems relatively well constructed and I'm actually pretty happy with the PCB itself. So, we'll do a little test and yeah you'll hear right away. You can't, you can barely hear this thing. And away we go. Man, I can type pretty quick on them. Ah. No. - Okay, I screwed it up right at the end there. But I was actually going pretty quick. I actually really like the keyboard itself, overall. The switches and stuff, they're something else, and I'm not fond of them. But, that's the silent, those are, that's just kind of silence for you. I've never tried a silent switch, that I'm a big fan of. And I'm sure if I swapped it with these guys, I'd like the whole experience a lot more. Honestly though, the layout itself is something I'm a big fan of, because I like relatively full keyboards. But I wanna save that, just a little bit of extra space. Cause I don't like giving up my num pad. So, if you like a full keyboard, but you want something a little smaller and you can't give up the F keys in your num pad. Maybe a layout like this, is the layout for you. It's definitely the layout for me. This is basically the same as my Odin, that I have at home. I think that's a little bit bigger actually, but not much. The keycaps themselves are PBT and they're an MDA profile. Which isn't super pronounced, but it's also not flat either. And with something that could have up to this much of an angle, I'm actually pretty fond of that. But, I like SA keycaps, call me a heathen, if you want. I just, I like those big sculpted keycaps. So, I'm actually pretty fond of these ones. And I definitely like the style choice as well. So, I think what it comes down to at the end of the day is, is this thing worth any money? And I've gotta say, it's actually really feature rich. The keyboard itself goes from anywhere between, 105 to $120, depending on which switch you want to have included with it. And honestly, for a 5,000 milliamp power wireless keyboard, with a Window and Mac switch, so that you can actually just, have a command key and it just, works like a command key. Both options for a dongle or Bluetooth wireless and then a full keyboard, with adjustable feet and like hot swap. And apparently, there's some, yeah I can see some layer, some there's some, foam above the switches here and there's probably a silicone pad on the very bottom or something like that. Honestly, overall for like 120 bucks at the top end, that's pretty good. And the only way that you're going to beat it, is by going with something that's got a lot, I mean. I forgot about the screen, 120 bucks and you get an additional screen, like I don't know, I'm pretty sold. I also really like the quality of this cable. It's not something that I actually focus on too much. Because most of the time like, a cable's just a cable and I mean, I'll be honest, the USBC end could be, well no, it's pretty good actually. These connectors are just really impressive. I'm having a really hard time. I, I think that if you don't want the silent switches and you want something more normal, like these flamingos that we have here. That I unfortunately, don't really have time to try. I think you'd actually get a pretty good experience out of this thing. Because even with the silence, I can kind of, I can kind of judge how good it would be anyway. I don't know what they've done to the stabilizers, but they're not bad, honestly. So, I am gonna recommend this thing, not to everyone. There's definitely a subset of people, myself included, that just don't really care about wireless, personally. I'm never taking my keyboards anywhere. I don't mind the cable, cause I like having like, a nice coiled cable attached. But frankly, I think you're getting something pretty decent. But, other than that I, I think you're actually getting quite a few features for $120, at the absolute top end. For a full keyboard, cause that's coming with switches. And yeah, I, I just, I can't think of something else that I would recommend more than this. If you want all of those features, or at least most of them. Thanks for watching. It's the EPO Maker RT100. If you wanna see another keyboard with a gimmick. Check out the 65% less. That was pretty cool.",
    "transcript_keywords": [
        "EPO Maker",
        "kind",
        "pretty",
        "keyboard",
        "EPO Maker keyboards",
        "thing",
        "cable",
        "switches",
        "EPO",
        "screen",
        "Maker",
        "pretty good",
        "full keyboard",
        "switch",
        "yeah",
        "wireless",
        "good",
        "USBC",
        "end",
        "full"
    ],
    "transcript_entity_values": [
        "USBC",
        "2.4 gigahertz RF",
        "3",
        "15 watts",
        "RT100",
        "120",
        "the 65%",
        "LEMO",
        "TKL",
        "USPC",
        "one inch",
        "four or five pounds",
        "Flamingo",
        "three",
        "One",
        "105 to $120",
        "one",
        "USB",
        "USBA",
        "CRT",
        "half an inch",
        "Mac",
        "Andy",
        "Windows",
        "SA",
        "30%",
        "Kailh",
        "Windows, Mac",
        "MDA",
        "a couple inches",
        "third",
        "Linux",
        "1800",
        "EPO Maker",
        "first",
        "Bluetooth",
        "VOLTA",
        "1",
        "two",
        "USBC",
        "Monday, Tuesday, Saturday, Wednesday",
        "PBT",
        "four",
        "three quarters",
        "F",
        "Odin",
        "Mac",
        "120 bucks",
        "the end of the day",
        "CNC",
        "RGB",
        "CPU",
        "97",
        "five",
        "5,000",
        "PCB",
        "Apple",
        "today",
        "Kailh Hot-Swap",
        "Kailh"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "MONEY",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON"
    ]
}