{
    "id": "CzJKxUCKOBg",
    "title": "Induction cooking - but what about woks?",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2024-08-31T14:29:23Z",
    "video_url": "https://www.youtube.com/watch?v=CzJKxUCKOBg",
    "category": "Science & Technology",
    "tags": [],
    "views": 994257,
    "likes": 50696,
    "comments_count": 6252,
    "description": "Don't tell Fozzie Bear about this. Links 'n' stuff:  That test I mentioned that I did with my car:   Technology Connections on Bluesky:   Technology Connections on Mastodon:   Have you ever noticed that I've never done a brand deal? That's all thanks to people like you! Viewer support through Patreon keeps this channel independent and possible. If you'd like to join the amazing folks who fund my work, check out the link below. And thank you!",
    "description_links": [
        "https://www.youtube.com/watch?v=yO5fJ8z66Z8",
        "https://bsky.app/profile/techconnectify.bsky.social",
        "https://mas.to/@TechConnectify",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Have you heard about induction cooktops? I surehave, but every time I mention them and how cool they are, theres always somebody getting up inmy bus- oh crap, the power went out. Well, I guess my familys just gonna starve tonight sinceI dont have that gas stove anymore. Hold on, let me go grab the candles. [match strikes] Oh? Whats this? Hold on, I need more light. Ohhh, its my old camping stove! I wonder if itstill works. [thud] Here goes nothing! [gasp] It does! Thats cool. Well, too bad werenot camping otherwise this could really come in handy right now. Please tell meyou understand the point of that joke. I have to tell you that using a campingstove indoors is dangerous and that you should follow all manufacturer warnings andinstructions. Uh, but aside from power outages, theres another little gotcha that comesup with surprising frequency any time I talk about how cool it is to cook with the power ofmagnets. But what about woks? Youre not thinking about cultures that use woks! And properwoks dont work with induction cooktops, so whaddya say to that? I say check yourassumptions. Because look at what Ive got here. This is an induction wok! It wouldappear that induction woks actually exist. This ones carbon steel and has a round bottomand everything! And this isnt very fancy - it plugs into a standard wall outlet and it costabout $200. Thats not a cheap kitchen gadget, to be sure, but its also prettyreasonable for what this is. Now, real quick and very important caveat, this video should absolutely not be seen as an endorsement of this particular product. For one, I have never cooked with a wok. Well, a good one anyway and I definitely do not haveany decent wok skills. So I cannot really vouch for how well this wok handles all your wok needs. I also already have several complaints about this thing - it seems to be trying too hard andsome features are confusing and dont seem that necessary but the bottom line is it exists and is a product you can buy today. The technology has arrived. And I wouldargue, based on what I've gathered about the important factors in this style of cooking, its actually pretty great to wok this way. [sudden Aerosmith riff] For those who arent familiarwith induction cooking already, Ill explain how it works in a moment butfirst I want to pose a simple question: what are we asking our cooktops to do? Regardlessof the technology, be it an open flame, a cast-iron wood stove, or an electric heatingelement, were just trying to heat up pieces of cookware so that we can cook in them. Thatsit. Its not really any more complicated than that. We just need to get a pan or pot orskillet or griddle or dutch oven or, yes, wok hot. People have strong opinions on which method for getting cookware hot is the best, but in the end all of them are simply producing a lot of heat right below the cookware, then that heat is transferred into the cookware and eventually into the food youre trying to cook. Induction cooking is completely different,though. Power electronics send a high-frequency alternating current through coils of wire belowthe cooking surface, and thanks to electromagnetic induction, that induces electrical currents insideof the cookware placed atop those coils. Those currents, as they travel through the metal of hecookware, end up producing heat through a process called joule heating. And that means the cookwareitself becomes a heating element. No heat transfer from hot thing to cold cookware occurs, insteadthe cookware itself is the thing which gets hot. Its similar to how wireless phone chargingworks, but at much, MUCH higher power levels. There are tons of benefits to this approach. Forone, it offers the same instant heat output that gas does. You dont have to wait for the heatingelement to warm up because your cookware is the heating element. Similarly, when you turnthe heat down, theres no lag like in a traditional electric stove. Stop inducing currentsin the cookware and the cookware instantly stops producing heat, just the same as shutting off agas flame. So you get all the control of a gas stove but you also get none of its downsides such asthe wild amounts of excess heat they produce in the kitchen as a large majority of heat emittedfrom the gas burners goes around the cookware. Start noticing that and you may become a bit annoyed by your gas stove, especially in the summer. That just doesnt happen with an inductionstove since nearly all of the heat produced is coming from the cookware itself. That also means the surface of the cooktop never gets that hot. Its onlyas hot as the bottom of the cookware, making cleanup a breeze and makingthe stove safer for the childrens. If youve never had the chance to playwith an induction cooktop before and youreinduction-curious, there are plenty of inexpensiveoptions these days which let you take it for a test drive. Note, however, that most of theseplug-in units are not the best. Theyre built to cost - this unit from Ikea currently retailsfor $60 US dollars - and some nicer features you might find in a proper cooktop are omitted. Themost frustrating thing with these is their kind of clunky touch controls, limited power outputselections (just 9 in this case) and they tend to produce more noise than a true induction cooktopor range will, both fan noise as it cools the electronics inside of here and high-frequency ringing soundscaused by tiny vibrations in the cookware. Still, theyre very impressive for what they are and this one lives next to my conventional electric stove to supplement it. To check if yourcookware is compatible with an induction cooktop (which is their major downside), see if a magnetwill stick to the bottom. If it will, you should be good to go. But if it doesnt, sadly that pieceof cookware wont work with an induction cooktop. But then, theres woks. Traditionally, woks havea round bottom. There are woks with flat-bottoms to allow them to work on traditional electricor induction cooktops, but many people would say those arent even woks. A round bottomis much better for certain styles of cooking, particularly stir-frying. Woks used overa gas burner can be supported by a simple ring surrounding it, but on the flat-surface ofan induction cooktop uhh that doesnt really work. Even if you got a round-bottom wokto sit correctly somehow, induction relies on the cookware being close to the inductioncoils. So a typical induction cooktop will work very poorly if at all with a round-bottom wok. But whos to say were limited by the typical? Certainly not this company because theyve madethis thing. Its actually not far off at all from this Ikea unit, but the induction coil isformed into a bowl-shape just like the matchingwok. That means you can put the wok in it. And nowyou have an induction wok! Look at that! What was previously an impossibility is now a reality. Andsince this is powered by induction, the wok gets hot incredibly quickly. Look, right now the wokis stone cold. Now Ill turn this unit on. After only 10 seconds of heating, watch how it reacts towater. Who says you need a gas flame for a hot wok right now? When I first got this and followedthe instructions to season it, the oil started smoking quite intensely after only about 30seconds. Its pretty dang hot pretty dang quick. Now again, I am not a good judge of a wok. This could very well be a pretty terrible wok, but Im not really interested at all in singingthe praises of this product. I just want to make you aware that it exists. There are a numberof things that could be improved upon here, and a proper cooktop freed from the limitations of a North American power outlet would be evenbetter than this. My only point today is thatwoks are not an induction gotcha, and I think Ive proven that well-enough. But I do want togive some useful information on how this product you can actually buy actually performs, so letsdig out the thermal camera and do some testing. First, lets just look at where the heat endsup getting produced. Perhaps unsurprisingly, its mostly generated in the center of thewok. From what I can tell this is usually what you want - however its more ring-shapedthan you might expect. The direct center of the wok remains a little cooler than the areassurrounding it, though of course heat conduction means it still gets plenty hot. Since thisis a round-bottom wok, you can move the wok to change which areas are getting heat, which canhelp replicate some traditional wok techniques. One thing that can only kind of be replicated,though, is tossing food. Obviously theres nothing stopping you from removing the wok fromthe base and doing that goodness (you can tell Im really good at it) except uh, well whenyou lift the wok away from the induction coils, it stops heating. Thats not all that differentfrom picking it up over a gas burner, but the induction unit complains when you dothat. Most induction cooktops enter some sort of angry state when you remove the cookwarefrom them, but its rather annoying when a wok does that since tossing is a commonly-usedtechnique. In fairness this unit gives you a decent amount of time before entering a safetyshut-off mode (10 seconds by my count), but it does enter an error state after that and requiresresetting. I think that needs to be more generous. Well add that to the needs improvement pile. What doesnt need improvement, I think, is heatoutput. Pay attention to those numbers in the thermal camera. This thing heats up extremelyquickly. Were approaching 500 degrees after only 30 seconds. Of course, heating the wok isonly one part of the equation - cold food you put in here to cook will absorb a lot of thatheat. I mean, thats the point of cooking. And this fella is limited to a weedy little plug! It only pulls 1,500 watts from the wall, which is about 5,000 BTU/hr. Thats no match for fire, is it? Well, no, but to rehash an argument I once hadonline (the very fuel of many of these videos) induction technology means you cannot comparethings quite so easily. Some people may scoff at the 5,000 BTU/hr this can put out - someproper wok burners will do 30,000 BTUs. But remember that essentially every watt of heat this pulls from the wall is becoming heat directly in the wok. While Im sure those 30,000 BTU rocket burners can get a wok hotter than this thing can, since well over half of theirheat energy ends up just going around the wok, the actual difference in cooking power is likely much smaller than those numbers suggest. Oh but right, I said not to focus too much on this particular unit so... dont focus too much on this particular unit! If built-into a proper cooktop or range, this wouldnt be limited to an ordinary plug and could be muchmore powerful. This whole video is simply - look at this! Its an induction wok! So look at this! Its an induction wok! Im wokin here! However, now I will get annoyed at this particular unit because it annoys me in several particular ways. Firstly, the controls. I may be a simpleperson, and I may not know my way around a wok, but I really dont know what on Earth isgoing on here. The simple unit from Ikea may arguably be too simple, but it at leastoffers 9 power levels. This only offers three: 600, 900, and 1,500 watts. But also youset the temperature. Uh, since the cookware is the heating element in an induction cooktop, we can use temperature sensors to see how hot the cookware is getting. And this has one. Butits not using it merely as a safety device, its using it as a thermostat so it will react to the temperature of the wok and keep itfairly constant. I think this could be a usefulfeature depending on what you're trying to do, but you have to choose a temperature. You cannotsimply say go and change the power levels based on how the foods cookin'. I suppose you could getused to this, and maybe that offers a layer of repeatability which might jibe with some brains, but I feel like thats introducing a variable which is more confusing than it is helpful. Id rather this just have a bunch of power levels - preferably changed with a knob for extrafine control and just let me do the thinking. The other incredibly irritating thing this does is set a timer by default. Every time you switch this on, it willturn itself off after 20 minutes. Now, you can extend that time by turning this dial soits not like its a big deal, but as a default 20 minutes feels very short. And the dials areawful. Not, like, how they feel or anything but the arrangement is just overly complicatedand confusing. You press this one to start it but this one pauses it. And dont press it againor it will shut off entirely. I just its bad. It didnt take too long to get used to the one time I actually used this but it was irritating. And youre right, I only used this one timebecause of my next annoyance: the wok itself. Look, if its not dishwasher safe I dont haveroom for it in my life. Thats just how it is and I will not be taking any questions. Now, okay,I know that carbon steel woks which are properly seasoned are the bees meow according to some, but even if I were willing to embrace that lifestyle, seasoning this with the wok unit isnt thateasy. Youll be dealing with the hot spot in the middle and not getting much heat up thesides, and unfortunately this handle grip means you cant use the oven to season it. Even setting thataside, this wok just feels kinda flimsy. Again, all of that is not a knock on the technology ofinduction or its appropriateness for wok-style cooking, just this particular wok. And if I founda better wok which was induction-capable and had the same general curvature as this one, it should work absolutely fine in this base. And maybe Ill do that! I used this to stir-frysome vegetables and I will admit they came out a lot better than they usually do in my bigflat skillet. So I am pretty confident that if I spent time learning to use this thing, I could eventually wok the wok. I just gosh I really just hate washing dishes by hand. Ihave a machine for that and I love it dearly. Oh and by all means, please feel free tostart a flame-war in the comments about non-stick coatings vs. cast iron vs. stainlesssteel vs. carbon steel. It boosts engagement. Oh theres one last weird thing you can do withthis: if you're so inclined, you can program in a series of steps so it will, say, be at400 degrees for 5 minutes, then 350 for 10, then 450 for 7. I mean I dont really know whowants that but its there. But now, let me remind you for the umpteenth time that the point ofthis video is not to say this is a good product or which style of cooking is best or anything likethat - its just to let you know induction woks exist. Models on the market now are flawed in severalways that even this person has figured out so, theres definitely room for improvement. But Ithink the proof-of-concept is quite sound, and the technology is ready. It just needs a few tweaksand then I think itll be a real wok in the park. What I think is likely to happen before toolong is that proper induction cooktops with normal controls and higher power levels will startoffering one or two bowl-shaped burners just like this. How common that will be in markets where woks arent typical is a giant open question, of course, but I feel like theres enoughdemand in the US for at least one appliance manufacturer to offer such a thing. And if thatdoesnt happen, plug-in units like this will undoubtedly get better. They mayremain power-limited here in the US, but Id bet dual-voltage units might appear which will put out 3 kilowatts if hooked up to a 240V supply. There are NEMA outlets for that, yaknow. Theyre just not common in todays kitchens. To close this video out, I want to give my$0.02 on induction technology in general. I appreciate that it exists quite a lot, but Ive alsorealized that I find radiant electric stoves to be just fine. Personally, I dont find it challengingto manage their quirks, so while I said this unit lives next to my stove - I dont actually useit all that much. Mainly I use it when I want to bring water to a boil. My conventional stove isonly faster than this at that task if I'm using a pot large enough to cover its largest burners. So for most general needs, this is faster. And in fact it's replaced my electric kettle - I nowuse this stovetop kettle on this thing and its just as fast as a plug-in kettle, in fact it might beslightly faster since this will pull 1,800 watts from the wall. But generally I prefer cooking onthe radiant stove. So thats what I usually do. If you cant stand electric stoves, though,and I realize many cant, I think youll find induction to be a game-changer. It really is the best of both worlds, and if you havent already seen someof the wild demonstrations where 10kW of boost power brings a pot of waterto a boil in seconds, well - look those up. Theyre pretty impressive. And since this technology can be tweaked to work with woks, I think its ready to become the new normal nomatter where you live or what youre cooking. And dont forget - if cooking over fire is an absoluterequirement for you there are many different ways to make that happen. Dont let the gas companyconvince you that theyre the only flame in town. deliciously smooth jazz I left out the other reason I keep this fellaaround: Power outages. Yeah. My electric car lets me plug stuff into it, including this. And Itested its vehicle-to-load function over 24 hours and determined it could supply emergency power formy fridge, freezer, modem, laptop, some lights, and cooking needs for about a week if fullycharged. Batteries, turns out, are pretty cool. Its only as hot as the bottom of the pot making cleanup a braayze what? I almost got through that. ...making cleanup a bray - I did it again! You all buhfffh ...these days which le - beguhberklebub Was that enough wok puns? I guess you could say this video was a woky-talkie. Oh that'll surely get inducted into the bad pun wok of shame. Get it, 'cuz induction? Or was it another wok pun?",
    "transcript_keywords": [
        "wok",
        "induction",
        "cookware",
        "induction cooktop",
        "induction wok",
        "heat",
        "woks",
        "power",
        "thing",
        "hot",
        "cooking",
        "stove",
        "cooktop",
        "unit",
        "gas",
        "cooktops",
        "power levels",
        "induction woks exist",
        "time",
        "induction cooking"
    ],
    "transcript_entity_values": [
        "5,000 BTU/hr",
        "Firstly",
        "Butits",
        "450",
        "over half",
        "900",
        "my$0.02",
        "9",
        "nowyou",
        "two",
        "350",
        "Ikea",
        "only 10 seconds",
        "600",
        "tonight",
        "Ill",
        "20 minutes",
        "umpteenth",
        "24 hours",
        "dutch",
        "10 seconds",
        "today",
        "10kW",
        "Thatsit",
        "North American",
        "at least one",
        "about a week",
        "NEMA",
        "US",
        "1,800 watts",
        "200",
        "first",
        "one",
        "these days",
        "the summer",
        "30,000",
        "Earth",
        "10",
        "seconds",
        "1,500 watts",
        "One",
        "about 5,000",
        "240V",
        "3 kilowatts",
        "First",
        "500 degrees",
        "only 30 seconds",
        "5 minutes",
        "$60 US dollars",
        "three"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "PERSON",
        "TIME",
        "ORDINAL",
        "TIME",
        "NORP",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "NORP",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "TIME",
        "MONEY",
        "CARDINAL"
    ]
}