{
    "id": "d-o-OJeIA3o",
    "title": "VR Headset Test!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-12-01T23:11:25Z",
    "video_url": "https://www.youtube.com/watch?v=d-o-OJeIA3o",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "lenovo solo mirage",
        "180 degree camera",
        "virtual reality",
        "VR headset",
        "VR",
        "world sense",
        "standalone",
        "headset"
    ],
    "views": 175995,
    "likes": 6160,
    "comments_count": 662,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we are checking out two things: the Lenovo Mirage Solo with Daydream and the Lenovo Mirage Camera with Daydream. Both of these things are really exciting and they kind of work hand-in-hand. This is a VR 180 camera. So, I'm sure most of you guys are very familiar with 360 cameras where you can see everything. You may have seen some VR 180 where it's just kind of like-- 180 degrees, so it's not entirely all-around but it just gives you sort of that extra little bit of view. So not only am I excited to try this out, but I'm also excited to try out this headset because this is one of the world's first stand-alone Daydream headsets. You don't need a PC, you don't need a phone, you just need this headset and everything is built in here. A huge thank you to Lenovo for sponsoring this video and sending me these things to check out. I feel like I just keep talking and I'm not even opening, so let's open and chat more about what's inside. (upbeat music) Smells like fresh technology. I just, I don't know guys, if you've ever opened up a new piece of tech, it just has the new tech smell. It's like new car smell, but oh my goodness. It's so lovely. So here is what the inside of the box looks like. Here's the headset. One of the things that they were talking about that this features is it has a lot of extra paddings. We will be very comfortable. That's also another huge thing with some of the headsets, is they end up being heavy or not comfortable. This is supposedly perfectly balanced, so that if it is on your head, it's not going to be wobbling different ways and be uncomfortable. We will test that out and see if that is true. (upbeat music) Oops! That adjusts it to make it tighter or looser on your head. We've got an on button, and two volume buttons. We've got USPC. I'm assuming this is all of the... things that we need to power it. Oh, we've got what looks to be some headphones. This also appears to be a perfect length, so it's not too long, so you can just plug this in and you don't have too much extra chords or cables hanging out. This is the little remote. Power brick, USPC cable. Okay, I'm going to plug in the headset, charge it up for a bit while I open up the camera. So with this, it's pretty cool because you are capturing content in Google's 180 format. So if you have ever seen 180 content on YouTube, then you're very familiar with what I'm talking about. I really like 180 because I feel like sometimes 360 gives people too much freedom, so as a creator, this kind of limits you to what's in front of you and to the sides of you. So you can transfer all of your footage from this camera using the VR 180 app. (gasps) Here it is-- ooh, it's so cool. I've never really played around much with shooting 3D content, and this does shoot 3D, so you are able to view it in a VR headset. Obviously Lenovo wants us to use their Mirage Solo headset, but if you do have another headset already, you can still that content. And if you do view this content on your phone or computer, it does convert it to 2D so you will be able to actually enjoy watching whatever it is that was shot. Let's see what else is in here. Charging brick, another USPC cable. Looks like there's two batteries in here. Oh, oh there's a carrying pouch. It's got a little magnet right here, so you can put your little charging cables in here, you can put your camera in here. This is cool too because you can also live stream, which is pretty neat, I've actually never tried that either. It's your... USPC, micro SD card slot. So basically we let this headset charge for just a few minutes. Whew, I'm impatient. We need to try it out. Power button... Are you on? Oh, you're turning on! I'm gonna kinda set it up, test it out, and then hopefully any of the content that I do shoot on the 180 camera, I will a separate link in the description so you guys can go check that out. I'll also include some links to some of the creators that made videos with this headset and the camera, so you can check those out as well. Okay, so it's telling me that I need this. Oh wow, god, VR is so freaking cool. I thought the thing that's cool about this headset is it uses a new Google technology that allows you to have positional tracking. That normally was only something that you could get using PC and a bunch of sensors, but all of that technology is built into this headset. And a lot of times those sensors aren't able to tell where you are in space in virtual reality, so if you step forward, or even backward, or to the side, you duck, you dodge, this will be able to detect all of that with no sensors. While that's updating, we've got our VR 180 camera. What's cool about VR 180 is it's one of those things where you feel like you're actually in the room with a person, or maybe not with a person, but wherever the camera happens to be. The best shooting practices when you're shooting something in 180 is to keep the camera still, steady, and don't move it. You don't have to move this, because it's already capturing the whole world in front of you, right below you, above you. I pushed this to turn it on. And then there's an app I already downloaded; it's called the VR 180 app. So it's searching for my camera right now. What are you doing? System update installing. Where's my... oh my gosh. One of the things you should never do is have a knife sitting directly in front of you when you can't see what's in front of you and you're looking for a remote control. So this is what the camera is seeing right now, and you can see that it's kind of in like, this spherical setting. So if you're moving the camera up and down, you can tell that it's capturing this whole world. So obviously this is gonna look way cooler inside of the headset, but for an example of what it would look like not in a headset... And if you have Google Cardboard, that's also something that you can use as well. You can look down at my desk, and... you can look and see what's over there-- surprise. Here's... stuff. So because I can't show you what this looks like in the headset, me scrolling around like that is kind of what it would look like for you. So this is what it would look like... whoa! - [On Video] This is my first 180 video. I'm kind of in shock right now. And I'm sorry that it's not more interesting, but here it is. This is my unboxing desk. Welcome to it. First 180 video; I'm kind of in shock right now. And I'm sorry that it's not more interesting, but here it is. This is my unboxing desk. - Oh yeah, this is great. So everything is officially set up, it's complete, everything is updated. And one of the things that I did mention earlier about this being comfortable, it definitely is true, because I feel like everything, like it doesn't feel like it's too heavy on my head, and this also helps to be able to adjust, so if I need it to be tighter or looser, that is also something that I can do. One of the most difficult things about VR and sharing it with other people is you are inside of your own head. But this is cool because it has built-in ChromeCast, so you can basically cast what you're seeing to the TV. So if you have friends over, or family, or whatever it is, they can enjoy what you're seeing. So 360 is something that is so fascinating for me, because when you're a storyteller, you have to tell from all angles, because you can't really control where the user is looking, so with this.. oh god, no! Do not.. you are absolutely terrifying. (gasps) (screams) I think you guys are still over here. I'm not even sure. Okay, this is something I don't want to be watching by myself, 'cause I'm scared. Oh wow, okay. Well, now we're in the Play Store. Epic Roller Coasters? I like free fun; I'll install it. Oh boy, this is scary. I'm not really a big roller coaster fan to begin with. Oh my goodness. We're going up. Oh, we're going down. Oh, we're going down, we're going down! (laughing hysterically) Yes! Oh god... Can I push them out of the way? I lost my controller. Look at me! Oh, god! I hate roller coasters in real life! Oh jeez, oh! This is so intense. So this is really cool. So I did a studio tour of Laika Studios, this was two years ago for Kubo and the Two Strings, - [On Video] Studios, and we're gonna be behind the scenes 360 tour of their studio to show you guys how they made their new film, Kubo and the Two Strings. - I love this! - [On Video] So I'm with one of their animators right now, they can give you a little more detail on how they made this because it is awesome. - There he is! Hey bud! - [Brad] I'm Brad, how are you? - Hi Brad! I'm Justine. - [Brad] And I'm the supervisor here. - [On Video] And these are our friends on the internet. - [Brad] Oh hi everybody. - [On Video] And we're gonna take them on a really fun tour. - Thank you guys so much for watching, if you would like to get more information about the Lenovo Mirage Solo headset or the Lenovo Mirage camera, I will put all of the links in the description below. I will also add some links to some other creators who made some videos featuring these products. If you wanna watch those, you can do that in where? Where is it? Oh, that's right-- in the description. Thanks for watching. I always have so much fun checking out new tech with you guys. Tell me what you guys think about this. What do you think of VR, what do you think of 180, because yes, I think this is incredible. As a creator, it just gives us this sort of whole, new fun platform to create content. But what about you guys? As viewer, what do you guys think of it? And what is something that you would most like to see shot in VR? I look forward to hearing all of your feedback, I will see you later. Bye. (upbeat music)",
    "transcript_keywords": [
        "Lenovo Mirage Camera",
        "Lenovo Mirage Solo",
        "Lenovo Mirage",
        "headset",
        "Camera",
        "Mirage Solo headset",
        "things",
        "Lenovo",
        "Mirage Solo",
        "guys",
        "cool",
        "kind",
        "Mirage Camera",
        "Mirage",
        "Daydream",
        "content",
        "Solo headset",
        "Daydream headsets",
        "standalone Daydream headsets",
        "USPC"
    ],
    "transcript_entity_values": [
        "Daydream",
        "Mirage Solo",
        "the Lenovo Mirage Camera",
        "ChromeCast",
        "Laika Studios",
        "one",
        "two years ago",
        "Lenovo",
        "Kubo",
        "just a few minutes",
        "Justine",
        "3D",
        "Two",
        "Brad",
        "Google Cardboard",
        "YouTube",
        "Google",
        "the Lenovo Mirage",
        "the Play Store",
        "VR",
        "USPC",
        "SD",
        "two",
        "180 degrees",
        "first",
        "First",
        "180",
        "VR",
        "One"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}