{
    "id": "d-rl_caPTmk",
    "title": "4K Isn't Really 4K",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-04-19T18:38:07Z",
    "video_url": "https://www.youtube.com/watch?v=d-rl_caPTmk",
    "category": "Science & Technology",
    "tags": [],
    "views": 561382,
    "likes": 34483,
    "comments_count": 1642,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   The term \"4K\" is very often tossed around in a way that makes it misleading...  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://www.freshbooks.com/techquickie",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- Hey, did you know 4K often isn't actually 4K. (gasps) What? (laughs) Even though tons of electronics companies advertise screens, game consoles and streaming sticks with 4K support, there's actually no real standard for what the heck \"4K\" really means. It's just a word, it's just, it's just made up. You see 4K is called \"4K\" because it refers to resolutions that are approximately 4,000 pixels across. The most common resolution that's advertised as \"4K\" is 3,840 pixels horizontally by 2,160 pixels vertically, which is what you typically see on TVs and computer monitors often marked as Ultra HD or UHD. So this resolution isn't quite 4,000 pixels across, but the 4K used in movie production, called DCI 4K, measures 4,096 x 2160. So the aspect ratio is about 1.9:1, a little wider than the typical 1.78:1 we're used to on TVs and your typical computer monitor. You might know that aspect ratio by its other name, 16 x 9. But DCI 4K isn't the only movie 4K, as it's primarily used for shooting the film. By the time you get to the movie theater though, you're probably seeing the film in CinemaScope 4K. This sounds awfully fancy, but the actual resolution is only 4,096 x 1,716. And while that produces the 2.39:1 aspect ratio that looks (sultry voice) cinematic, a typical 4K display at home, has over one and a quarter million more pixels. So don't be fooled into thinking you're supposed to be seeing the latest blockbuster in some kind of mind blowing detail. You're mostly just cutting off the top and bottom. To further illustrate this point, some products cut down resolution even further to get that cinematic wide screen look. Sony's line of Xperia phones are known for this with their trademark CinemaWide 4K displays, but CinemaWide is actually just a cut down version of garden-variety UHD with a resolution of 3840 x 1644, to achieve a more theatrical 21 x 9 aspect ratio similar to many Ultrawide monitors. Of course, we're not trying to say these displays are bad, as there are still good looking OLED screens with HDR support, just don't expect more pixels than you'd get on a $300 TV. This illustrates why 2160p isn't an exact synonym for 4K, even though many people might want to call it that since we often refer to HD by its vertical resolution 1080p. Now, we've already covered two resolutions marketed as 4K with vertical resolutions falling well short 2160 pixels. And on the other side of that coin, there are products like dash cams, advertised as 4K because they're 2160p but less than 3000 pixels across, producing a more square-looking video that isn't really close to what we typically think of as 4K. So why, why do we use incomplete terms like 2160p in the first place? It's actually a weird historical holdover that we'll tell you about right after we thank FreshBooks, the invoicing and accounting solution that's built for owners and their clients. FreshBooks users save a ton of time and money, we're talking and 11 hours a week that they used to spend sorting through invoices and keeping track of financials. Plus 94% of FreshBooks users say it's super easy to get up and running, And with award-winning support, you're never alone. Switch to FreshBooks today and join over 24 million people who've used it and loved it. So try FreshBooks free for 30 days, no credit card required, go to freshbooks.com/techquickie to get started. So the use of terms like 1080p and 2160p to describe resolution, actually go back to the age of CRT displays. You know, those big, heavy TVs and monitors we used until the late 2000's and are still used today at really cool Super Smash Bros. tournaments. CRTs didn't have pixels in the sense that we think of them today. Rather, they generated horizontal lines that contained analog data which varied as you went across the screen. In other words, they had a vertical resolution but not a horizontal one. This is why the industry used terms like 480i or 576i to describe TV signals back when CRTs ruled the world. With the \"i\" standing for interlaced, meaning that a CRT would only scan half the lines of a frame at once to save bandwidth. By contrast the \"p\" in 1080p stands for progressive, meaning the monitor scans the whole frame all at once. But even though modern LCD displays have a defined horizontal and vertical resolution, the practice of using a single three or four digit number to represent the entire resolution, stuck around. But even if a product clearly states both its horizontal and vertical resolution you really need both that information and the size of the display to get across how much detail it can convey, since a 4K resolution doesn't really mean much if you're sitting two feet away from a 200 inch screen. Which is why the 8K TVs on the market are mostly they're really big. So isn't there a better way than 2160p to describe how much detail a display can show? It, yeah, it turns out that there is, indeed. It's a spec called pixels per inch or PPI, which is just what it sounds like, the number of pixels in a one inch line. PPI, combined with aspect ratio, gives you a really good idea of what the actual visual experience will be like. And this system is used by, none other than, Apple, who uses it as the basis for the retina display marketing. Wow, they were actually right about something all along. Hey, that's the end of this video, thanks for watching guys. Like it if you liked it, dislike it if you disliked it, check out our other videos and comment below with video suggestions and oh, and oh, and don't forget. Oh, there's one more and oh, subscribe and follow y'all, I see you almost forgot that part. (chuckles nervously) Just don't, don't forget.",
    "transcript_keywords": [
        "resolution",
        "pixels",
        "vertical resolution",
        "aspect ratio",
        "aspect",
        "ratio",
        "vertical",
        "FreshBooks",
        "display",
        "displays",
        "TVs",
        "horizontal",
        "monitors",
        "screen",
        "called",
        "DCI",
        "movie",
        "support",
        "typical",
        "UHD"
    ],
    "transcript_entity_values": [
        "a single",
        "half",
        "2,160",
        "two feet",
        "less than 3000",
        "2160p",
        "30 days",
        "a ton",
        "three",
        "one inch",
        "4",
        "8",
        "2160",
        "one",
        "4,000",
        "DCI",
        "CRT",
        "DCI 4K",
        "only 4,096",
        "CinemaScope",
        "94%",
        "9",
        "Super Smash Bros.",
        "11 hours",
        "21 x 9",
        "approximately 4,000",
        "FreshBooks",
        "four digit",
        "about 1.9:1",
        "UHD",
        "1644",
        "first",
        "4,096",
        "Sony",
        "16",
        "two",
        "1080p",
        "24 million",
        "LCD",
        "480i",
        "3,840",
        "Ultrawide",
        "1,716",
        "300",
        "Ultra HD",
        "a 200 inch",
        "Xperia",
        "Apple",
        "today",
        "the late 2000's"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "DATE",
        "DATE"
    ]
}