{
    "id": "D2saGKLGb7w",
    "title": "Nintendo Switch - 10 Things Before Buying!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-03-03T08:49:44Z",
    "video_url": "https://www.youtube.com/watch?v=D2saGKLGb7w",
    "category": "Science & Technology",
    "tags": [
        "nintendo switch",
        "before you buy",
        "switch",
        "nintendo",
        "TLD",
        "Jonathan Morrison",
        "Switch",
        "breath of the wild",
        "legend of zelda",
        "switch review",
        "ten things",
        "10 things",
        "gameplay",
        "gaming",
        "nintendo switch review",
        "nintendo switch reaction",
        "joy-con",
        "zelda",
        "nintendo switch games",
        "switch gameplay",
        "review",
        "switch unboxing",
        "nintendo switch gameplay",
        "new",
        "nintendo switch unboxing",
        "video game",
        "game",
        "unboxing",
        "breath of the wild review",
        "nintendo switch hands on",
        "nintendo switch price",
        "switch games"
    ],
    "views": 2353032,
    "likes": 42016,
    "comments_count": 2775,
    "description": "Nintendo Switch Unboxing & Review + Gameplay!    My reaction and thoughts on the brand new Nintendo Switch, Legend of Zelda Breath of the Wild, accessories, gameplay and more!   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/VDnACMpqEr4",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here, and the Nintendo Switch has officially arrived. But before you go run out and scoop one of these up, here are ten things to know. So for starters, we're gonna kick this off with a weird one. Because the cartridge is so small, about the size of an SD card, Nintendo actually Heisenberged a way to prevent kids from ingesting this. Now from what I've heard, Nintendo applied a layer of Denatonium Benzoate on the cartridge, and that's apparently one of the most bitter tasting chemical compounds on the face of this earth, that way if a kid sticks it in his mouth, he's gonna spit that out. In the name of science though, I think it's only fair if I test this out myself. The question is though, do I lick it or do I completely stick this in my mouth? That is the obvious answer. (speaking gibberish) That's nasty. No kids eating this for sure. I don't know if that was the best idea doing this as the first fact. Ugh, I don't even know what it tastes like. My mind's going, did I lick a sharpie? (lips smacking) What is that? (coughing) I need some water. Taste update, I'm getting a waft of nail polish, and hats off to Nintendo for being true, I guess, because I don't think there's a kid on the face of this earth, or adult for that matter, that's gonna enjoy the taste of that. So next up on number two is the fact that game availability really isn't that great at launch. You just got your Switch, you're excited to play, and then you realize the only truly major title available at launch is The Legend of Zelda: Breath of the Wild. There are smaller indie titles which are also available on the PS4 and Xbox One, but as far as Switch exclusive, you really only have a couple of options. One of them being 1-2-Switch, which essentially is a group of party games. Currently as far as major releases go, you will need to practice some patience. Mario Kart 8 Deluxe is slated for April, Splatoon 2 in the summer, NBA 2K in September, but if you're looking forward to Super Mario Odyssey, you're gonna have to be extra patient because that is not comin' out until the holidays. So next up at number three, jumpin' in to some positivity. The system is super adaptable for day to day life, but I think, by far, one of the coolest features about the Switch is how easy it is to switch between all the different ways you can play. You can play around the house then hop on the couch, pants being optional. You can even maybe go outside and get some sun, although I'd say pants are probably mandatory on that one. And then when you're ready for that TV action, just pop it on the dock and magic. Now it's not actually magic, but what happens when you place the system in to the dock is that it automatically ups the system's clock speed which it to output it in 1080p. The Switch also features a built in kickstand just in case you wanna dock it on to a desk or hard surface. And I emphasize hard surface because the kickstand really isn't that great, so if you place it on a soft surface, it is guaranteed to fall over. There are of course other accessories that do a much better job at this, so if you like the idea that is probably the route you want to go. Then next up at number four, speaking of accessories, the pricing is insane. So out of the box, the Switch comes with two Joy-Con controllers, those are those little detachable handles, one controller grip, which allows you to combine two of them to make a more traditional controller, and then lastly, some wrist strap attachments, that way you don't accidentally throw a Joy-Con out your window. Now this is totally adequate for the single player games and some of the simpler two player games, but if you want any more of that, you are going to need to pony up. Each Joy-Con is 50 bucks. You can however get them in a double pack for $80, but you will need to tack on an extra 15 bucks for the controller grip. There's also a Pro controller option for 70 bucks. So you can see, if you were buying this for just yourself, it really isn't that big of a deal, but if you got a giant household or a double D 50 amount of kids, this is gonna do some serious damage to your wallet. So next up at number five, if we threw pricing out the window for a second, with those accessories, there are so many ways to control the games. The simplest option you have is by holding a pair of Joy-Cons. One in each hand where you just relax your arms and use them independently. This is surprisingly comfortable and personally my favorite way to play. If, however, you want something closer to a more traditional controller, you can attach the Joy-Cons to a comfort grip but you're gonna be disappointed because honestly, it feels worse. The grip handles themselves are super tiny and not particularly well shaped to the human hand, plus, once you're used to using the Joy-Cons separately it kinda feels like you're taking a step back. If however you absolutely need that controller feel, you're much off spending the extra money and getting the Switch Pro controller. So next up on number six, talkin' a little bit about gameplay. In terms of portable mode, surprisingly, it looks really good. In terms of specs, the Switch's built in screen is a 6.2 inch capacitive multi-touch panel with a resolution of 720p. Now I guarantee people are gonna hear 720p and lose their minds. Where's 1080? Where's 4K? What is this caveman crap? But the thing is, the screen is so small, in terms of scale for its size, it actually looks incredible. For comparison, the PS Vita is capped at 544p. Could you imagine inviting someone over and ask if they wanted to watch a movie on your 544p TV? That ain't quad HD, that's quarter HD. Specs and resolution aside though, the backlight is great, the colors are even better, and I'd even go as far as saying the Switch is at its best when used in handheld mode. Now next up on number seven, as great as the graphics are, battery life is actually kind of a concern. The Switch's battery life is expected to be somewhere between three and six hours and you can actually expect closer to that three hour range if you're playing more demanding games like Legend of Zelda. Alternatively, you could remedy this by plugging yourself into a wall outlet, but if you plan on being on the go consistently, that battery bank you got to chug through those Pokemon Go session isn't gonna hack it here. You're gonna need something way more powerful. With that said though, if you are gonna be that guy or girl on the go, I'll post some of the biggest, baddest power options down below. Now next up on number eight, if you are worried about battery life, one bright note with the Switch is auto sleep. Now with previous Nintendo systems, those would continue to run until the battery was completely drained. So in the instance where your system's saying hey, plug me in, I'm about to die, and you ignored it, you're gonna lose all of your progress. The Switch however features an emergency sleep mode, that way just in the case the battery gets to a critical point, it's gonna automatically put itself to sleep, in turn preventing itself from dying and you losing your data. So next up at number nine, one really important thing to consider is the fact that the built in storage on the Switch really isn't that much. So for example, Legend of Zelda is 13 gigs, so if you were to download that, instantly half of your storage is gone. Now while the Switch doesn't support USB thumb drives or USB hard drives, it does feature an SDXC card slot located beneath the kickstand, but again, diving back to the fact that the accessories are expensive and they add up, this is gonna be one more thing you're gonna have to buy. Now last up at number 10, one thing to consider is the fact that online support really fully hasn't arrived yet. Currently the only thing you can do online is browse and buy from the eShop or add a friend using Nintendo's painfully outdated friend code system. Now Nintendo has promised more online features in the future specifically with their companion app, but that is still a little ways away, so as of right now, we're kind of in the dark with that. The good news is though because you're essentially a guinea pig right now, everything is free. But as features roll out and it becomes a little more robust you can definitely expect to pay a fee. P.S., as a bonus fact, for some reason the Switch charges a MacBook. Seriously. Aside from that, hopefully you guys enjoyed the video. If you did and you appreciate me licking cartridges, make sure you drop a like, and about that giveaway, you can find out more details here or down below. This is Jonathan and I will catch you guys later. I'm gonna actually-- - You're actually gonna do it. - I'm gonna stick it in my mouth. - Wait, wait, wait, wait, that's my game.",
    "transcript_keywords": [
        "Switch",
        "Nintendo",
        "Switch Pro controller",
        "Nintendo Switch",
        "number",
        "controller",
        "Legend of Zelda",
        "Switch battery life",
        "fact",
        "battery",
        "Switch Pro",
        "games",
        "Switch battery",
        "thing",
        "features",
        "system",
        "Pro controller",
        "battery life",
        "Nintendo systems",
        "Switch built"
    ],
    "transcript_entity_values": [
        "Nintendo",
        "Deluxe",
        "two",
        "ten",
        "NBA 2K",
        "1-2-Switch",
        "the Nintendo Switch",
        "Super Mario Odyssey",
        "na actually-- - You",
        "P.S.",
        "544p",
        "quarter",
        "April",
        "One",
        "70 bucks",
        "SD",
        "10",
        "number nine",
        "between three and six hours",
        "Joy-Cons",
        "the Joy-Cons",
        "4",
        "1080p",
        "13",
        "Switch Pro",
        "USB",
        "seven",
        "50 bucks",
        "Mario Kart",
        "Pokemon Go",
        "15 bucks",
        "eShop",
        "50",
        "80",
        "six",
        "Legend of Zelda",
        "Xbox One",
        "6.2 inch",
        "three hour",
        "second",
        "Legend of Zelda",
        "three",
        "Splatoon 2",
        "PS4",
        "Heisenberged",
        "first",
        "the PS Vita",
        "number two",
        "half",
        "one",
        "1080",
        "number eight",
        "Switch",
        "SDXC",
        "544p",
        "September",
        "the summer",
        "the Joy-Cons",
        "Denatonium Benzoate",
        "MacBook",
        "The Legend of Zelda: Breath of the Wild",
        "day",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "FAC",
        "PERSON",
        "FAC",
        "WORK_OF_ART",
        "DATE",
        "PERSON"
    ]
}