{
    "id": "D4pdh0eTsxw",
    "title": "Green Eggs and Not Ham | St. Patrick's Day Breakfast",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-03-08T18:07:12Z",
    "video_url": "https://www.youtube.com/watch?v=D4pdh0eTsxw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "st partrick's day",
        "breakfast",
        "eggs",
        "green eggs and ham",
        "green eggs and not ham"
    ],
    "views": 303113,
    "likes": 6809,
    "comments_count": 833,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hello everyone this is Justine back in my kitchen. And I've got some stickers today because we are about to hop into Saint Patrick's day festivities. We're gonna start baking a Saint Patrick's day, something here but I was like man I really wish that I had a green T-shirt and only have 1, and that 1 and going to wear for Saint Patrick's day. I got to save it. But what I do have are some stickers. So got a pot of gold here on the microwave. And I've got this little. I think I'ma just gonna put it here. That's it no its not to big. I'm not even baking actually. If you read the title video and green eggs, and not ham. And that not ham is green pancakes. Let's get all of our ingredients ready. Where going to need not very much actually at all. We're basically making pancakes and all you need is water with a pancake mix, and for the green eggs green food coloring. Whoa. This just loose. 2 cups of dry mix. So let's do that in you go 1 1/2 cups of water. Now were going to add some green food coloring. This is basically the theme of all of the Saint Patrick's videos is green food coloring. Definitely not good for your health. Never once did I ever claim that anything I made was healthy. (Irish music) (Irish music) Do not beat or over mix. Am I beating it? Beat it beat it. So I'm doing exactly what your not supposed to do. To be fair I read the box while I was doing the thing that I was not supposed to do. So just let me live. God this shirt is disgusting. Like its wrinkled I really like to look my best for my videos. Like I could have put on a different shirt. Like this is it actually is disgusting but whatever. This is the life that I'm leading. This is getting warm very quickly. Lets find some butter. To get it all juiced up. Wow let's talk about sizzling. (Irish music) Did I just make a pancake? Ah, yeah I did. Yes. So this is definitely time to flip. Oh shoot, oh god, oh geez, oh god, oh boy, oh boy. I should probably start making another 1 because I've got this whole freaking thing. Oh no. What the heck. Help. Oh my god. Now I'm shook it. Okay I put that in the hole. There's a hole you shove the butter into. These look don't look like circle's. My hair is getting stuck in my sticker. Happy early saint Patrick's day. That's disgusting. Welcome to my Restorante featuring death. I'll just finish up this mix. This is boring. I'm making Pancakes and they look disgusting. See man. Oh my God I am so talented. When someone says Justine what do you do for fun? What are your talents? This is the GIF I will say look at my talents. Did you see that? God I can just do this all day. Like honestly. Oh I'm so talented. Let's jus flip the big guy. Oh he is a beefy beefy boy. Okay so now what were going to is were basically making the eggs whites green and then I'm going to hopefully save the yolk and put that in middle. So its going to in theory work. But as we know about my theories. Um yeah, they don't go so well. Gonna save him and put him in here. Oh oh, that's a lot. That's a lot. By little I mean. That is so green. Where going to put the green in and hope this work. I think I beat it to much. So I wanted to put the egg in the middle. See look. Because it needs to cook from the top. (Irish music) Man, this is actually turning out so good and it's almost done cooking and I'm going to keep this on for a little bit longer. Until its completely cooked at the top. (slow music) (slow music) (slow music) So because it took me so long to make this egg. I had to put the pancakes back on the griddle so that they would get a little bit warm. So I also have something I made a head of time Which is very exciting. These are gold coins. I melted butter and I put these gold flecks in them. Before I put the melted butter in I dusted this gold powder on the inside of this. So I don't even know what this is going to look like. But were going to find out. Because this is a group effort here. So let's take a peek. Of our gold butter medallions. I've seen worse. It's not bad. You can actually see it has a little bit of butter golds on there. I'll come up closer. So let's see if it melts. Alright pancakes. You look delicious. Well guys thanks for watching. Theses are our pancakes and our green egg. Green egg and not ham. The not ham is pancakes. You know I really think that I should reconsider cooking for views because every time something as simple as a pancake. How can I mess it up? I don't know it is truly an art form. I feel like to be able to be this bad at cooking. Thank you guys for watching look for another fun Saint Patrick's Day video on actual Saint Patrick's Day which is march 17 in case you didn't know. Alexa told me. Bye and no I'm not eating this because I do not want to die. Think I'm crazy. (Irish music) (upbeat music)",
    "transcript_keywords": [
        "Saint Patrick day",
        "Saint Patrick",
        "Patrick day",
        "green",
        "Patrick",
        "Saint",
        "put",
        "Saint Patrick videos",
        "pancakes",
        "day",
        "fun Saint Patrick",
        "God",
        "Patrick day festivities",
        "Patrick Day video",
        "green food coloring",
        "early saint Patrick",
        "actual Saint Patrick",
        "green food",
        "butter",
        "green eggs green"
    ],
    "transcript_entity_values": [
        "Alexa",
        "saint Patrick's",
        "1 1/2",
        "the Saint Patrick's",
        "Saint Patrick's Day",
        "march 17",
        "2",
        "Irish",
        "1",
        "today",
        "Saint Patrick's",
        "Justine",
        "Restorante"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "CARDINAL",
        "FAC",
        "PERSON",
        "DATE",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON"
    ]
}