{
    "id": "d58neQ6Ewho",
    "title": "Zenfone 6 Flip Camera TEARDOWN! - How does it work?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-06-21T10:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=d58neQ6Ewho",
    "category": "Howto & Style",
    "tags": [
        "Zenfone 6",
        "Asus Zenfone 6",
        "zenphone 6",
        "Flip up camera",
        "flip camrea",
        "Zenfone 6 teardown",
        "repair",
        "how to fix",
        "Disassembly",
        "swivel camera",
        "Crazy flip camera",
        "Best camera",
        "smartphone",
        "iphone",
        "asus",
        "technology",
        "budget phone"
    ],
    "views": 3082505,
    "likes": 57236,
    "comments_count": 3120,
    "description": "The Zenfone 6 has one of the coolest cameras that weve ever seen in a smartphone. Asus has their camera flipping up from the backside. But how does the Asus Zenfone 6 camera even work? What does the Zenfone 6 camera look like from the inside? Today we are going to disassemble the Zenfone 6, take it apart, and review the new smartphone from the inside.   Here is the Zenfone 6 Durability Test:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/ZPv9XPHMYfg",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Asus Zenfone 6. You might not remember the name, but you'll definitely remember the flip up camera. It's the one that swivels out of the phone like some kind R2D2 accessory. We've done the durability test and we know the camera hinge is secure and the motor is rated for 100,000 flips. But in order to see how it's all put together and learn how it works, we're going to have to review it from the inside. It's time to teardown the Zenfone 6. Let's get started. [Intro] The Zenfone 6 is built like most other glass and metal smart phones with a large glass panel on the back held on with adhesive. There's no water resistance rating on the Zenfone 6, so I assumed it would be easier to take apart, but I was wrong. The adhesive holding the thing together is incredibly goopy and strong, and really hard to slice through. But I eventually managed to make it happen, and I removed the glass. There is one long fingerprint scanner ribbon attaching the back panel to the phone still. I'll pop off that fingerprint scanner from the glass and set it off to the side. You'll also want to watch out for the fragile Google Assistant ribbon cable that's super close to the edge of the phone. I went ahead and accidentally on purpose sliced mine in half as an example of what not to do and what you should avoid. The phone should still work though, even if I did kill the assistant. There are 7 Philips head screws holding down the black plastic plate, then I can unsnap the fingerprint scanner ribbon and lift off those plastics. The NFC coil comes off as well. I thought at first this might make a cool looking transparent phone, but then I changed my mind, mostly because the majority of the flippy camera is hidden underneath the metal camera housing and would not be visible in a clear phone. Let's take a closer look. I'll unplug the battery from the motherboard for safety since we do want this phone to turn on again someday. And I'll grab the singular battery pull tab down here at the bottom. But then, without even pulling, the battery falls away from the phone basically all on it's own. That's a pleasant flaw in the assembly process for me. Thumbs up for an accidentally too easy battery removal. The Zenfone 6 has a massive 5000 milliamp hour battery, which is twice the capacity of the iPhone XS. You can see the two pretty worthless battery adhesive strips down here pretending to do their jobs. I'll unclip the two extension ribbons like little Legos, then the metal camera housing up here at the top is held in place by 4 more screws. Two additional screws already got removed with the back plastics. Once those are out, I can gently lift away part of the metal structure from around the top of the camera and I can slide the little edge of the bracket out from underneath the motherboard. Even with that support bracket now gone, the camera is still solidly in position. We can see a bit more of the motor and gear as the camera flips back and forth. No long stepper motor shaft this time around like we've seen in some of the pop up camera phones. The Zenfone 6 has just one gear going straight from the motor to the camera. The camera control ribbon connector is also very different. It's not like the little Lego style this time around. I'll remove the one motherboard screw and disconnect the 3 additional ribbon cables, and two more wire cables, and then lift the motherboard out and away from the frame, revealing yet another motherboard like some kind of high tech Oreo cookie with pink frosting inside. There are two different motherboards. I'm not sure what the overall goal with that thermal paste is though. Each motherboard is heating up and transferring the heat right back into the other motherboard. I'm no expert, but using functional motherboards as heat sinks seems counter intuitive. There are two more screws holding down that flippy metal camera unit bringing the total up to 8 screws. Then I'll detach another one of those strange connectors, and after a bit of shimmying and unplugging the motor connector, the whole camera contraption can come out of the Zenfone 6. It looks like these odd connectors can be unplugged, but the appear to be a bit more fragile and require more finesse. Not a huge fan. Either way, the camera is out now and we can get a close up look at the attached motor. Positioned off to the side, it has a direct connection with the hinge of the camera. The brackets that secure the camera require 8 different screws, which I imagine is what kept the camera so structurally solid during my durability test. Let's take a quick look at the bottom motherboard. The dual SIM and SD card slot is on the lower motherboard, with a circular white water damage indicator next to the opening. The loudspeaker is down at the bottom of the phone and has 6 screws holding it in place over the lower electronics. And once it's removed we see another water damage indicator on top of the headphone jack. There is one screw holding down the charging port board, along with one more large Lego style ribbon connector. Then the charging port can lift up and out of the phone. The USB-C charging port does have a black rubber ring around the tip to help cushion the port and provide some water resistance, but as a whole, the phone is not water resistant at all. The front screen is permanently glued to the metal housing like we've seen in a lot of other glass and metal phones. It can be replaced, it's just difficult. It's time we get everything situated back inside of the Zenfone 6 so I can clean up the mess I made with all the internal guts spread out everywhere on my desk. Before putting the motherboard sandwich back together, I do need to clip in the strange camera cables that Asus is using. Still not a huge fan. They don't slide in easily like the Lego style ribbons, and it makes the whole repair much more difficult. Finally, after hopefully getting it clicked in, I can put the Oreo motherboard halves together with the strawberry frosting in the middle. Then I'll get the black camera cable plugged in, along with all the other more normal Lego style connectors for the top motherboard. The metal camera bracket gets secured onto the camera housing with it's 4 remaining screws holding it in place. Then the battery can get set into the phone and plugged in, along with the fingerprint scanner and back plastics. The fingerprint scanner gets placed directly back into the rear glass panel, and I can set the whole thing back down onto the phone. And luckily everything still turns on. Overall I'm a fan of the Zenfone 6. I like seeing phones do new and unique stuff. Yeah, the motherboard sandwich is kind of strange. We should watch that for overheating, but the internal camera and bracket both look pretty solid. I'm not a fan of those camera connectors though, as it appears my camera is malfunctioning at the moment, but at least the phone itself still works. You win some, you lose some. It was still worth it to see the insides. Would you rather have a phone with a flip up camera, or a pop up camera? Let me know down in the comments. Come hang out with me on Instagram and Twitter. Hit the subscribe button if you haven't already. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "camera",
        "phone",
        "Zenfone",
        "motherboard",
        "metal camera",
        "back",
        "screws",
        "metal camera housing",
        "metal",
        "camera housing",
        "Lego style",
        "screws holding",
        "fingerprint scanner",
        "battery",
        "glass",
        "ribbon",
        "phones",
        "camera phones",
        "Lego",
        "motor"
    ],
    "transcript_entity_values": [
        "Google",
        "6",
        "8",
        "Lego",
        "SD",
        "Instagram",
        "the Zenfone 6",
        "two",
        "100,000",
        "jack",
        "Philips",
        "Two",
        "Legos",
        "The Asus Zenfone 6",
        "half",
        "5000 milliamp hour",
        "4",
        "The Zenfone 6",
        "NFC",
        "the iPhone XS",
        "Oreo",
        "first",
        "Asus",
        "The Zenfone 6",
        "3",
        "one",
        "7",
        "Twitter"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "EVENT",
        "ORG",
        "EVENT",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}