{
    "id": "d6VVF4nXTJA",
    "title": "BlackBerry Motion vs KEYone: Buttons Make The BlackBerry",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-11-23T06:02:20Z",
    "video_url": "https://www.youtube.com/watch?v=d6VVF4nXTJA",
    "category": "Science & Technology",
    "tags": [
        "blackberry motion review",
        "blackberry motion vs keyone",
        "blackberry motion hands on",
        "blackberry motion camera",
        "blackberry keyone vs motion",
        "mrmobile",
        "michael fisher",
        "crackberry"
    ],
    "views": 204246,
    "likes": 6236,
    "comments_count": 452,
    "description": "In 2017 more so than ever before, taking a keyboard off a BlackBerry makes it just another smartphone. On the other hand, the new BlackBerry Motion packs a huge battery, a larger screen and some of the best security in the Android world  on top of being the first water- and dust-resistant BlackBerry ever. How much does that matter in light of the loss of its halo feature? Depends on how badly you need a physical keyboard. Join MrMobile for a rare comparison video: BlackBerry Motion vs BlackBerry KEYone, aka \"A Tale Of Two BlackBerrys.\"   [SPONSOR]  This video was made possible by Thrifter, a new way to save money on everything from gadgets to home goods by shopping based on value, not hype. To get all the leaked ads and the best deals for Black Friday, check out Thrifter here:    [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  BlackBerry Motion [Amazon]:   BlackBerry KEYone [Amazon]:    [ABOUT THE BLACKBERRY MOTION VS KEYONE VIDEO]  MrMobile's BlackBerry Motion vs KEYone comparison was produced following ten days with a BlackBerry Motion review device and six months with a BlackBerry KEYone review device, both provided by BlackBerry.   [FURTHER READING]  BlackBerry Motion Hub at CrackBerry:   The new BlackBerry Motion does away with the KEYone's best feature [Digital Trends]:     [MUSIC]  Raiders by Cymatix, available at Premium Beat:   Live Up by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.thrifter.com/",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/3q6",
        "http://mrmobile.tech/3q7",
        "https://crackberry.com/blackberry-motion",
        "https://www.digitaltrends.com/mobile/blackberry-motion-news/",
        "https://www.premiumbeat.com/royalty_free_music/songs/raiders",
        "https://www.premiumbeat.com/royalty_free_music/songs/live-up",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [MrMobile] The new BlackBerry Motion does away with the BlackBerry KEYone's best feature. I can't claim credit for that sentence, it's a headline from Digital Trends. But it's so good, I just had to borrow it. Because it seems to me that today, more than ever, taking a keyboard off of a BlackBerry makes it just another smart phone. Mostly, anyway. I'm MrMobile, and this is not a review. It's a rare, head-to-head comparison. A tale of two BlackBerries. (upbeat music) Blackberry fans, I know you're already down to the comments rattling off reasons I'm wrong, so let me say this: the Motion certainly has stuff going for it if you've already decided a BlackBerry is what you're buying. It preserves much of the character of the KEYone, soft to the touch with a rubberized backplate bracketed by metal accents. That'll come as welcome news to anyone tired of the glass sandwiches dominating phone design these days. Around front, a big 'ol physical home button stamped with a BlackBerry logo, and yes, the multi-colored notification LED with its signature red spark. This is not another case of a hasty rebadge, like the old DTEK line. Aside from being a little too light for my taste, the Motion is very much a BlackBerry. It's also, in some ways, a better Berry. Without a big porous keyboard, the Motion repels dust and water well enough to earn it an IP67 Ingress Protection rating. And it packs a 14% larger battery than the KEYone. That means it keeps pace with the insane endurance of that earlier phone, despite the bigger display. Recently, on a moderately busy 12-hour day, it was trending toward six hours of screen-on time by the time I got done with dinner. It also seems a bit speedier than the KEYone, thought to be fair that's not saying much. Neither of these will feel particularly fast, if you've used phones from Motorola, OnePlus, or HTC. The Motion also has new features in tow that, as yet anyway, haven't trickled down to its smaller sibling. The bigger fingerprint sensor means you can swipe the home button to drop the notification shade. In the camera, tapping that fingerprint sensor will snap a photo and send it directly to the BlackBerry Locker, bypassing the gallery so only you can see it. Press the Convenience Key on the side and you now have three options for quick shortcuts, not just one. Otherwise, everything's about the same - from the DTEK security suite, to the secure boot process, to that rather cool privacy shade. Unfortunately, BlackBerry still refuses to follow the laws of common decency, so the convenience key is where you'd expect the power button to be. So get used to fumbling around a lot when you try to lock the phone. That's fun. Keep in mind the class of device we're talking about here. The KEYone launched at about $550, and while the Motion hasn't come to the States yet, there are indications BlackBerry wants to make the Motion a little more affordable than the KEYone actually. So there are compromises, there's an HD LCD with a lot of bezel, and not a lot of color. That display is protected by Dragontrail glass, which is fine but its durability coating holds onto fingerprints like you wouldn't believe. The spec sheet is almost identical to the KEYone's, which is adequate, but old. It's certainly not pushing the envelope in any way but battery size. And the camera is not great. BlackBerry wouldn't tell me which sensor it's using here, which would be fine unless you remember how eager the company was to boast about using the same sensor as the Google Pixel for the KEYone. That suggests that the Motion packs a less expensive component and my testing bares that out. The Motion tends to kick out softer shots. I have more trouble focusing on specific subjects than I do with the KEYone. And in general, the pictures felt very soft. Now other times the Motion did actually manage the better photos, so it's not worthless by any means. And the cameras did equally well at capturing color in 4k video. But both also suffered from the lack of electronic stabilization at that resolution. Finally, what's it actually like to trade in that tactile thumbboard for yet another pane of glass? Well, the software has been brought over from the BB10 platform, so if you're coming from an old Z10 or Z30 you'll probably like it. I've always enjoyed how BlackBerry lets you flick up on those keys to autocomplete, and it's got other cool quirks like that clipboard viewer, which is nice. But of course you can't feel out the buttons like you can on the KEYone and that cheap haptic vibration motor makes it feel mushy and slow, and if you decide to do some dictating well the BlackBerry keyboard is much slower and a little bit less accurate than Gboards. If you're thinking I sound like a hardcore KEYone fanboy who'd never consider the Motion, you're right. I think most of the reason we're still seeing new BlackBerries in 2017 is because the company took a risk. It leaned into this antiquated idea of a physical keyboard, and it paid off. The Motion eliminates that keyboard and in so doing, it wipes out what I think is the single most compelling feature about the modern BlackBerry. That being said, I still remember some commentors on my KEYone review saying they loved the long battery life and security features of that phone, but had no need for physical buttons. So if you're one of those folks or you find value in all the features I tend to ignore like the BlackBerry Hub, and Productivity Tab, the Motion might be great for you. And I'm sure it'll do well in the enterprise market where corporate customers might buy it in bulk. For everyone else looking for the next exciting thing from BlackBerry, seems to me we're gonna have to keep looking. If what you want is a Black Friday deal to go with your BlackBerry, check out today's sponsor. Thrifter is a new way to save money on everything from gadgets to home goods by shopping based on value and not hype. Click the link in the description to get all the leaked ads and the best deals for Black Friday, Cyber Monday and beyond at Thrifter.com. Until next time folks, thanks for watching. Please subscribe, and stay mobile my friends.",
    "transcript_keywords": [
        "Motion",
        "BlackBerry",
        "KEYone",
        "Digital Trends",
        "BlackBerry Motion",
        "phone",
        "BlackBerry KEYone",
        "keyboard",
        "headline from Digital",
        "Black Friday",
        "sensor",
        "Motion packs",
        "BlackBerry Locker",
        "Convenience Key",
        "button",
        "Motion repels",
        "BlackBerry keyboard",
        "Motion eliminates",
        "BlackBerry Hub",
        "home button"
    ],
    "transcript_entity_values": [
        "2017",
        "BlackBerry",
        "Z10",
        "the BlackBerry Locker",
        "Dragontrail",
        "Gboards",
        "4k",
        "IP67 Ingress Protection",
        "Black Friday",
        "12-hour",
        "States",
        "Thrifter.com",
        "14%",
        "KEYone",
        "Monday",
        "OnePlus",
        "Motorola",
        "BlackBerry Motion",
        "the Google Pixel",
        "the BlackBerry Hub",
        "today",
        "about $550",
        "these days",
        "two",
        "Thrifter",
        "the BlackBerry KEYone's",
        "Digital Trends",
        "Productivity Tab",
        "Berry",
        "six hours",
        "Blackberry",
        "MrMobile",
        "HTC",
        "BB10",
        "Motion",
        "Friday",
        "three"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "EVENT",
        "TIME",
        "GPE",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "CARDINAL"
    ]
}