{
    "id": "d8QOyDvKxZg",
    "title": "This wireless keyboard has THOCK! - Keychron K8 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-04-27T17:48:17Z",
    "video_url": "https://www.youtube.com/watch?v=d8QOyDvKxZg",
    "category": "Science & Technology",
    "tags": [
        "Keyboard",
        "Ethusiast",
        "Keychron",
        "K8",
        "K8 Pro",
        "Mechanical Keyboard",
        "Custom keyboard",
        "custom",
        "This keyboard has THOCK",
        "Thock",
        "thock sound",
        "good sound",
        "lube",
        "Turn down for THOCK!",
        "Logitech",
        "Corsair",
        "Gaming",
        "Wireless",
        "Bluetooth"
    ],
    "views": 951630,
    "likes": 18423,
    "comments_count": 987,
    "description": "Get your Linksys Hydra Pro 6 router today at:   Keychron is probably one of the top favorite brands for custom mechanical keyboards as they're well priced, quality builds, and full of THOCK! The Keychron K8 Pro keyboard makes some big claims, and so far, it holds up.   Check out the Keychron K8 Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 - You can get that? 0:11 - Who is Keychron? 0:43 - Unboxing 1:44 - Keyboard exterior first impressions 3:05 - RGB impressions 3:36 - Keyswitch impressions 4:01 - Pricing impressions 4:50 - Low thick standards 5:06 - Internal thoughts 5:40 - Sponsor - Linksys 6:21 - Typing impressions 7:03 - QMK/VIA impressions 7:44 - Final thoughts",
    "description_links": [
        "https://lmg.gg/LinksysSC",
        "https://lmg.gg/x317l",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Do you ever wanna buy a nice wireless keyboard? One that you can customize with firmware and hot swappable keys and everything? The new Keychron K8 Pro has got just about everything you need. For those of you who don't know, Keychron is a keyboard company and a lot of you in the comments are always saying, \"Hey, check out the Keychron.\" And you're right. I agree with you. I love Keychron. I think they're great company, especially if you want something that's a little higher end but still it's not enthusiast level. It's just a solid option and it's someone that I typically recommend to my own friends for anyone who doesn't wanna wait six plus months for a group by the end. They've got a ton of features advertised on the box. They've got Screw-In-Stabilizers, Hot-swappable, PBT Keycaps. I think they're double shot. VIA, QMK, Bluetooth 5.1. I love that sound. Cool, they've got a little guide here. An open source customizable keyboard for peak productivity. So yeah, here's our board, it's a TKL. Before we look at it any further though, let's take a look at what else is in the box. We have got a cable. And they've got like a right angle connector. I have actually wish more places did them because it's just a nice sleek look especially. I think these guys have a side connector. Theirs is on the side so that's gonna look great coming straight off of it. We've got a screwdriver which is really teeny. We've got our other windows keys, like Alt and Windows and stuff. This has got the Mac layout on it already. And keycap and switch puller. I think that's pretty much it. I think there's not a whole lot. And then an instruction book. Extra keycaps, warranty, VIA. Wow! They actually tell you how to use VIA though. A lot of people in the mechanical keyboard community love customization. And the fact that they've included this for anyone who hasn't used VIA before, is kind of nice. Honestly, I wasn't expecting that. So here's the board. Well, the layout itself is fine but I don't like this edge on the metal here. I would much prefer to honestly at this point, remove this extra lip. But otherwise you end up with this like tray, I'd much rather that the housing came all the way up and covered all of this. So that you'd have like a metal layer that just goes right around here. It's an aluminum on top and then you've got a steel plate with the bottom being made outta plastic. And it's fine. It doesn't really flex around because of all the metal in there. But if you're looking for like a much heavier build or something with like a bar on the bottom and all that, it's not gonna be quite at that level, 2.865 pounds. So it's just try three pounds, which isn't crazy heavy. So you've got feet. I'm always a fan of feet, especially with two modes. You gonna do the big guys of the little guys for different typing angles. One minor quality issue that I'm not crazy about is you can see how there's like a connection here on each of the corners. So it's not one giant piece of mild aluminum for the top. You've got a Windows and Mac switch and then you've got a BT off or cable. It's a little thick on the bottom. That's because there's a big battery in here. And it's I think 4,000 milliamp hours which nets you something like a 100 hours of on time if you've got the Bluetooth running and RGB on. So that's not bad. Like a 100 hours is quite a long time. Oh, I turned it on. Hey, look at all the RGB. Tab works, turns the back light on and off. FNQ, cycles through modes, sweet. As you can see there's kind of a lot going on in this board and they've got a little arm processor built in. That's probably to handle everything that's got going on like the RGB, the Bluetooth connection, the QMK Firmware. One small issue on the keycaps is they're not shine through which is fine for some people, but in the dark it's actually a lot easier to type if you can see the light underneath your keys. The typing experience is not bad. These are just Browns, the new Gatorade Jeep Browns. And I like them. I'm not crazy about them. I feel a little scratchy. I think they're pre-lubed but I could go for a heavier lube. They're just Browns. One small thing to note that I completely forgot about until I took the switch off is it's all south facing RGB as well. So if you care about that, that's a big plus for some people, a lot of people don't like the north facing RGB 'cause they find it doesn't shine through or everything as well. So you can get this fully assembled with just a white back light using one of any of the three switches that they offer. And it's your stereotypical like red, blue, or brown Gatorade options. That's 89 bucks. That's a good deal. Now that being said, this one's got the aluminum frame and it's got a full RGB backlight. So this one is a 110. Getting something like this for a $110 is just such a better buy, at least in my opinion than going with like Corsair, or Logitech, or Razer or anyone else who is like a more major name brand, gaming brand who's making their own mechanical keyboard. Those guys are kind of catching up a little bit in terms of features like hot swap and adding foam and stuff to the board but they're still not there. Like I I'll never tell someone to buy a Corsair board. I'm sorry, Corsair. I like a bunch of your products. I just don't like your keyboards. - [Instructor] Look at that thock, dude. - It's okay. - [Instructor] It's pretty sexy. - It's okay. - [Instructor] Jono just has a low standard for thock. - Love thocks too. - [Instructor] As long as your thock looks at me, oh baby. This one, the more expensive one does have a nice layer of silicone on the bottom. We saw the same thing in that mountain board was a big layer of silicone on the bottom. And I'm wondering if we're honestly gonna start seeing more enthusiast boards come that are like full kits come with a big silicone layer for the base. And then you've got some foam under the PCB I believe and screw and stabilizers, which is really nice. If you do wanna change them if you have your own like just cherry style stabilizers, you can do that. The quality on them's okay. They're probably not clipped or lubed or anything but like it's not bad. It's pretty cool keyboard. I really like it and we should probably plug it in and try typing on it. But first, a word from our sponsors Linksys. Thanks to Linksys for sponsoring today's video. It's time to take your WiFi to the next level with Linksys Hydra Pro 6 router. The Hydra Pro 6 uses 160 megahertz channels on WiFi 6 to deliver up to four times more WiFi capacity compared to older WiFi 5 routers. Intelligent Mesh System ensures that you get that great connection in every corner of your home. You can also easily set up and control your home internet through the Linksys App so you can customize your WiFi, see who's online, protect your network, and more. Get your Linksys Hydra Pro 6 router today at the link below. 125, 100%, that's pretty good in terms of length for a banana for scale. It's basically your average TKL length which I don't know the exact centimeters, but it's like one in like a half banana. It's almost a full size keyboard, but 10 keys less. So the keys like the regular keys are fine, but the space bar makes a very distinct like it is actually a pretty distinct thock. And I noticed it every time I would hit the space bar when typing on this test. I'm very torn on. I love the way the space bar sounds. I just kinda wish the rest of the keys sounded more like it as well. It's just the way the stabilizers are lubed and stuff probably. So download, Show Design tab, on. Load My Jason file. Jason V2, cool. We've got like four layers that we can alter. They're already kind of preset a little bit, but it's sweet. You can just like reassign keys to whatever you want, make a up a bunch of macros and lighting and stuff like that. Oh, and there's a bunch of presets too like Media, Macro, Special, QMK Lighting. You can use all of this stuff or just go full custom. I don't bother usually personally but it's there, it's an option for anyone who wants a good wireless keyboard, who wants a good mechanical hot swap wireless keyboard with QMK and VIA functionality. This is like basically it. They're saying it's the world's first. I don't know if that's a 100% true. I haven't really been able to find anything else that's comparable to that point where they've got all the same features. So yeah, maybe, honestly, if they can do that, then I hope that we see more of them down the line from both enthusiast boards and other companies because I have respect for all these other companies I just wish that they would kind of keep up with the times a little bit better. Especially at $110, especially if you don't need an N-pad and especially if you need Bluetooth and it works with Windows and Mac, no problem. Just outta the box, there's a little switch on the side. The things it just does it all. I love this thing. I would change the key caps probably. I would probably change the switches as well. That's not hard when you've got hot swap. Like it's great. I really like it. I don't want one, but I wouldn't be unhappy if someone gave it to me for Christmas gift or something like that, like it's great. There you guys have it. That's the K8 Pro from Keychron. Really nice keyboard. I think it's great value for the price and if you wanna check out any other short circuits, check out the Logitech one I did on the Pop keyboard. That was a lot of fun, not the best keyboard but it was an anesthetic and they went for it and they kinda nailed it. So check it out.",
    "transcript_keywords": [
        "keyboard",
        "Linksys Hydra Pro",
        "Keychron",
        "RGB",
        "Hydra Pro",
        "keys",
        "lot",
        "Pro",
        "kind",
        "Linksys",
        "board",
        "Linksys Hydra",
        "love",
        "nice",
        "great",
        "Bluetooth",
        "QMK",
        "windows",
        "bottom",
        "love Keychron"
    ],
    "transcript_entity_values": [
        "brown Gatorade",
        "three pounds",
        "half",
        "six plus months",
        "TKL",
        "100%",
        "a ton",
        "three",
        "One",
        "Linksys",
        "4,000 milliamp hours",
        "2.865 pounds",
        "one",
        "Intelligent Mesh System",
        "Corsair",
        "110",
        "PBT Keycaps",
        "QMK",
        "Mac",
        "Logitech",
        "Jason V2",
        "160 megahertz",
        "125",
        "Windows",
        "Keychron K8 Pro",
        "Browns",
        "The Hydra Pro 6",
        "the K8 Pro",
        "110",
        "89 bucks",
        "Keychron",
        "Bluetooth",
        "first",
        "10",
        "Media, Macro",
        "two",
        "Razer",
        "four",
        "Windows and Mac",
        "Mac",
        "FNQ",
        "Linksys Hydra Pro 6",
        "RGB",
        "100 hours",
        "Show Design",
        "Christmas",
        "Gatorade Jeep Browns",
        "Tab",
        "PCB",
        "today"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE"
    ]
}