{
    "id": "D9fLxKY8UQs",
    "title": "Color E-ink looks CRAZY Under a Microscope!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-04-20T16:23:40Z",
    "video_url": "https://www.youtube.com/watch?v=D9fLxKY8UQs",
    "category": "Howto & Style",
    "tags": [
        "E-ink tablet",
        "e-ink smartphone",
        "color e-ink",
        "electronic paper",
        "how does color e-ink work",
        "e-ink display",
        "boox note air 3c",
        "durability test"
    ],
    "views": 1032994,
    "likes": 34865,
    "comments_count": 1736,
    "description": "Taking apart our FIRST color E-ink Tablet! Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring the show!  The Boox Note Air 3 is a large electronic paper e-reader for graphic novels or colored comics. Is a color i-ink display any good? Are colored E-ink displays durable? Today we will find out!  Current pricing of the Boox Note Air 3C is here:  Watch my E-ink smartphone teardown here:",
    "description_links": [
        "https://www.stamps.com/jerryrig.",
        "https://amzn.to/3TZObuM",
        "https://youtu.be/4wf3ebnqzn0?si=xptGHWJAkOdGZXN_"
    ],
    "transcript": "I never thought I'd see this technology in real life, but colored e-ink displays are fascinating. Normally, this technology is black and white, but today we have our hands on an electronic ink display that can show more than 4,000 different colors, with that same pixel-flipping technology that doesn't require any power to hold its position. For reference, the shirt I'm wearing is blue. This jerry-rig razor knife is a very hot pink. This is a more darker blue, and this lighter is a red. These colors aren't as vibrant or realistic as what we would see on a smartphone that can display 17 million colors versus 4,000, but it should look very cool underneath a microscope. This book's Note Air 3C tablet was delivered to me today, and let's hope its first day is also not its last. And speaking of deliveries, huge thanks to Stamps.com for sponsoring this video. When I first started selling my jerry-rig razor knives, I knew that I did not want the to just sit in the landfill for the next 500 years. So I found this mailer entirely made from paper where even the interior padding is made from biodegradable and recycled paper. These do cost a few more pennies than the bubble plastic mailers you see everywhere, but I estimate that me and my team have managed to keep over 700 pounds of plastic out of landfills by using these mailers, which makes every penny worth it. And of course, if you have your own printer and your own computer at home, you can take care of shipping wherever you are. Even on the go with the Stamps.com mobile app, Stamps.com offers shipping rates you can't find anywhere else, like up to 89% off USPS and UPS rates. And seamlessly connects with almost every online marketplace and shopping cart if you sell online. Join a million other small businesses just like mine at Stamps.com/jerry-rig So you can get a four-week trial, free postage, and free digital scale. There are no long-term commitments or contracts, and my favorite part is that you can ship day or night with no waiting in lines at the post office. I know my business isn't a 9-5, and it's nice that I can do business whenever I need to. Thanks to Stamps.com for sponsoring this video. When I first unboxed the Books Note Air 3C, I was definitely not expecting iPad OLED picture quality. At 500 bucks, this tablet is in a different realm with both price and technology. Inside the brand new box, you can see from the screen that the colored e-ink display is already turned on, turned on while not consuming even one iota of power, which is one of the perks of e-ink, depending on your usage. The battery can be calculated in days instead of hours. And with no refreshing, it's way easier on the eyes for reading. The box also has a cool little stylus for taking notes. Comes with a little rubber sleeve on cap. Rubber protection is always a good idea. There's also a USB-C cable and an SD card removal tool. And since the tablet is already on, let's turn the tablet on. E-ink technology is fascinating. There is technically no refresh rate, as it just refreshes when it needs to. It's a very slow, very visible flash, but once the pixels have chosen their image, they can stay in that position forever, regardless of power in the battery. It's just like a really expensive etch-a-sketch. You'll notice though that even with this new colorized e-ink tablet, we get the same ghosting effects that we would see on other black and white e-ink displays. Ghosting means that the previous image or text lingers a bit on screen after a refresh. And you can see it even as I'm using the notepad to draw new colors on the screen for our microscope. The ghost of the menu gets baked into the colors until I do a manual refresh. We have sky blue and some grape. The noise you hear on screen is the physical sound of a stylist on the textured glass and not generated from the speakers. I'll add some green and red. Obviously we aren't looking at Skittles level of color brilliance here, but the colors are still indeed colors. And I'll add a substantial amount of black, which to be honest definitely looks the best. I'll manually refresh the image so we can eliminate the selection boxes ghost. And then I'll add some white back into the black so we can see what the white looks like as well on a microscopic level. And lastly, for good measure, let's toss some orange into the equation up here on the left. I feel kind of like Bob Ross without the hair. And while indeed Bob had more hair than I, what he did not have however, is a 230 times digital video microscope, which I can turn on right now. It might be a bit discombobulating at first since the capsules look far different than normal pixels. And your first question might be something like, hey Jerry, why is a white background full of colors? And that's because technically the color white is all of the colors at once. And even the color white on LCD displays is still created by mixing red, blue and green diodes. So it's interesting but predictable that this color ink display is also RGB. Sliding over to the orange shade of E Ink, we can see now there is some black mixed in to darken the hue. And then the blue obviously starts mixing green, blue and black pixels to get the sky blue shade our eyes can pick up. Like that wooden palette thing artists used to hold and smear colors together with before computers came along. Now it was when I started exploring grape that I realized the tapioca looking bumps that my microscope is picking up isn't actually part of the pixels. It's the textured surface of the screen that's distorting our image and not giving us a proper look at the E Ink capsules. Which is fine, a little bit of glass has never stopped us before. And we'll get a clearer look at what's going on here in a second. Patient survival is optional when it comes to our education. The coolest contrast comes when we see the white and black pen strokes side by side. White is the bubbly RGBs and black is just as dark as it can be. Zooming in deeper though still reveals some color in between all that darkness. And I'll get to why this might be a negative in a minute. The book's Note Air 3C technically has two different resolutions. In black and white it can display 300 pixels per inch, but in color it has that resolution to 150 ppi. I assume this is because the RGB filtered microcapsules just take up more space. If we look at the black and white E Ink smartphone we took apart a while back, may it rest in peace, you can see that there are no filtered color capsules or color bleed wasting space. Just super crispy white and blacks. And that means that if you're reading a lot of comics or graphic novels, the colored E Ink is awesome and definitely what you want to get. But if you're primarily reading only black and white books, then a pure black and white E Ink display is going to be noticeably more crisp since there is less wasted space between pixels. The reason that the E Ink tablet can only display 4,000 different shades of color instead of millions is because of the individual pixels' inability to dim. You'll notice that the white AMOLED numbers on my Note 24 Ultra are also created with colors when we zoom in on a microscopic level. And these little pixels are self-lit and individually capable of dimming to hundreds of different levels, which ultimately produces far more colors. 16,777,216 different colors to be exact. But just like you wouldn't dig a hole with a rake, these are different tools for different jobs. Kind of nice that I can just doodle my Mohs scale of hardness right onto the surface of the book's Note Air 3C, which is a nightmare of a name by the way. As we work our way up the scale, we start seeing scratches at a level 4 with deeper grooves at a level 5, which is rather strange since I was assuming that the surface was glass this whole time. But apparently not. It's textured plastic. Durable plastic to be sure. And even though the numbered scale disappeared, it still has definite damage on the screen. We do not find any plastic on the frame though. The black exterior appears to be anodized aluminum. There's a little weird design thing on the side. Not sure what that's for. The top is made with more metal, along with a fingerprint scanning power button. On the other side of the tablet we have our orange accented USB-C port, along with dual stereo loudspeakers and an SD card slot, which is fantastic for transferring documents, PDFs, books, or notes from one device to another. And the bottom of the tablet is just more metal. Making our way to the back of the tablet, there are no cameras or camera bumps like we would see on an iPad. Nor any rubber feetsies like we've seen on some of the other e-readers like the Kindle Scryon. It does have some nice subtle orange accents crossing the edge though, which I think is rather peachy. To confirm our plastic screen theory, we can bring out the lighter. Glass would never melt with just a small butane flame, but plastic will. The heat doesn't appear to be affecting any of the E-Incapsules at all, but after 20 seconds we can see the heat from my lighter start to deform the display. There is indeed a thick plastic exterior. One thing that was included in the box is a large black stylus, which is incredibly resistant to breaking. And apparently, back to the odd design we saw on the side of the tablet earlier, it's magnetic. The little side design is apparently where we can mount the stylus or clip on a magnetic case. The inside of the stylus is pretty much the same technology that we've seen inside of the S-Pen or the Apple Pencil. Just some copper coils wrapped around a tip that can be sensed by a digitizer under the to digitally recreate physical writing strokes. Finally, the bend test. If we're going to get a closer look at the color of the E-Incapsules, we need to get inside this thing one way or another. And luckily for us, Books has made the internal access easy by just shattering. Turns out the thick textured plastic is just a layer on top of the glass, making it a large glorified screen protector, which can be completely removed to expose the onyx glass underneath. Remember, the screen of the Note Air 3C is still on. It's also off, while being on and broken, it's just pretending to be okay, aren't we all? Bringing the microscope back, we can now get a clear image of the colored E-Incapsules without the granular texture of the screen protector on top. And there they are. The red, the blues, all the muted colors of the Note Air 3C in their circular capsules. The particles inside the capsules are not tinted, just a filter over top, which we'll see in a second as we dig deeper. It's super cool seeing the different technologies, this close up and personal. Definitely gets a thumbs up from me, and hopefully from you as well. To prove that the screen is indeed on while being off, let's unplug the battery. There are no screws to undo, just copious amounts of glass shards to avoid, and a whole lot of prying with my razor blade. But the screen can indeed be pulled from the back metal housing. The power button has a single ribbon still holding the halves together. But once that's removed, it's all very surprisingly simple in here. Just a few chips, a small motherboard, and a long flat 3700 milliamp hour battery, which we can unplug with my plastic pry tool, leaving the E-Ink display completely parked in its previous pixel positions, pretty permanently might I add, and positively phenomenal. Going deeper to find the filter layer, we can pop the Kaleido 3 display out from the metal frame to extract some of the glass that's keeping us from the information we see. The goldish copper digitizer on the back is what senses the stylus tip as it traces on top of the screen. And the mirror looking thing is probably the backside of the backlight. But now, when we carefully peel away one of the glass shards from the rubbery filter that normally sits on top, leaving all of the soft capsules intact, we can zoom in really close and we can see that indeed the answer to all of our questions is finally here. The colored E-Ink displays, this one at least, is just a regular E-Ink display with an RGB filter on top of the capsules. We can see the small black and white orbs change into colored orbs where the rubbery filter patch is still attached. The orbs can individually flick on and off, and depending on the filter placed above it, can be visually combined into 4,000 unique shades of color. I think it's great. I kind of wish we could get a smartphone made with this kind of stuff. Or a smart watch Would you rock a colored E-Ink wristwatch? Let me know down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "book Note Air",
        "Note Air",
        "colors",
        "white",
        "black",
        "color",
        "screen",
        "color ink display",
        "display",
        "ink display",
        "ink",
        "eink",
        "Note",
        "book Note",
        "tablet",
        "color white",
        "colored eink displays",
        "plastic",
        "eink displays",
        "black and white"
    ],
    "transcript_entity_values": [
        "four-week",
        "the S-Pen",
        "17 million",
        "hours",
        "its first day",
        "up to 89%",
        "days",
        "day",
        "SD",
        "Stamps.com",
        "230",
        "two",
        "more than 4,000",
        "the Kindle Scryon",
        "Glass",
        "Bob",
        "Jerry",
        "the E Ink",
        "700 pounds",
        "RGB",
        "500 bucks",
        "16,777,216",
        "4",
        "Books",
        "hundreds",
        "the Note Air 3C",
        "USPS",
        "iPad",
        "a few more pennies",
        "USB-C",
        "Bob Ross",
        "millions",
        "E-Ink",
        "first",
        "second",
        "9-5",
        "3700 milliamp hour",
        "the next 500 years",
        "LCD",
        "today",
        "24",
        "4,000",
        "5",
        "One",
        "20 seconds",
        "every penny",
        "150",
        "one",
        "a million",
        "300"
    ],
    "transcript_entity_types": [
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "LAW",
        "QUANTITY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}