{
    "id": "d_Gmsyvo-uc",
    "title": "These cost HOW MUCH?! - Master & Dynamic MW75",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-07-09T22:29:43Z",
    "video_url": "https://www.youtube.com/watch?v=d_Gmsyvo-uc",
    "category": "Science & Technology",
    "tags": [],
    "views": 311939,
    "likes": 11991,
    "comments_count": 674,
    "description": "Get your UGREEN Nexode 65W charger and use code 15GAN65W for an additional discount at:    Adam took a look at the new Master & Dynamic MW75 headphones to see if the $600 headphones stack up to the steep competitors in this price range, but can they dethrone the Airpods Max?  Check out the Master & Dynamic MW75:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something specifically for a video? Make a suggestion at    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:39 Unboxing 1:47 Build quality and included accessories 2:56 Wireless Bluetooth adapter 4:00 Sponsor - UGREEN 65W Charger 4:32 Headphone features/specs 6:16 Fit and feel impressions 6:53 Included NSFW Assistant 7:18 ANC frustrations  9:25 Audio quality impressions 10:16 ANC testing and AirPods Max comparison 10:56 Headphone controls 11:38 Qualcomm AptX didn't work :( 11:47 Conclusion and M&D's competition 12:37 Outro",
    "description_links": [
        "https://amzn.to/3Of2zdZ",
        "https://lmg.gg/V3m0I",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Obey your master, master. These are the Master Dynamic MW75, active noise canceling headphones. They are the newest product from Master & Dynamic, a relatively new player in the audio scene. They're made in 2014 and they kind of fit into a unique niche of being like very lifestyle focused, and very fashion focused. You might remember them from the Louis Vuitton headphones video. 'Cause these guys actually made the Louis Vuitton earbuds. Louis Vuitton just slapped their brand on it, and charged literally five times more (chuckles) for them. And you know, I kind of like what they're doing. So they're trying to be style focused. That does come at the cost of price. We'll talk about that in a bit. I'm excited to look at these. They're made of premium materials. That's always good. Adaptive, active noise canceling. And also best in class talk. Eight microphones. What else have we got on the back? You have a list of the products that are on the inside. Looks like we have headphones, a case, some cables. An airplane adapter, that's kind of nice. Quarter inch adapter, which is honestly unexpected from a lifestyle headphone. That's usually the kind of thing that you'll see with studio focused headphones. Something to note is that these are $600 US. That's a lot of money. To put that in context. That's $50 more than the AirPods Max, which are kind of already a famously expensive headphone. This is a very interesting case. It's like felt. You can even see the little hairs and stuff. You can see it's... This just looks like it's gonna get dirty really quickly. Decently durable case. Again, I thought about this with the Barracudas as well as with these, if you're gonna be a lifestyle headphone, and your whole point is about portability. It's really, really nice if you could fold in. So here's a banana. They should really put a measurement on this. If it's gonna be for scale, it should at least have some gradation on it. These are the headphones, which look pretty nice. Oh wow, this is... These ear cups are plush, also kind of small. These kind of look like they might be more over ear on my ears. Here's your quarter inch. Airplane. USB-C to Type-A adapter. Braided cables. So I guess this is for plugging into the air port adapter. USB-C to USB-C. That means there's USB-C on this end. Oh, very nice. Is this real leather on it? It's a lamb skin. It's a lamb skin that they did? It's not even an adult sheep? - [Bell] No. Babies only. - Oh, God. So they're aluminum and tempered glass. Are the ear cups removable? Okay. Hey, look at that. Oh, they are, they're just magnetic. That's sweet. Yes, good job, I like that they're replaceable. So they have memory foam, ear pads. Here we have the controls, plus and minus, a mystery button. Here we have the power button, and then that has a little wavelength, that might be the noise canceling. (laughs) Here's the other thing that was in the box, which was a wireless Bluetooth adapter. This thing's huge. All day power, 22 hours of battery life, premium materials crafted from machined aluminum. Look at this thing. This is like a charging block. Oh, (laughs) okay. I get what it's for. It's for the airplane, again. So that tells you something about the target audience for this. Is that they're targeting people who are gonna be flying a lot. This is so you can use your headphones wirelessly, and also listen to the airplane movie. But I love the idea of somebody sitting down beside you, just... They sit down the airplane beside you like, \"Suh.\" And then they plug in and then... This is also a battery pack then. And it has Bluetooth 5.0 with aptX LL & aptX HD. Also works with exercise equipment, portable game consoles and record players. I dunno if I've ever seen a portable game console that has this configuration. Do you know how much this is? $70 for this? I mean, I got a Bluetooth adapter from Canadian Tire for like eight bucks. So okay. It's headphone time, I guess. But before that, a message from our sponsor. Thanks to UGREEN for sponsoring today's video. UGREEN's here to make charging more convenient with their new Nexode 65 watt charger. It's a three in one charger that has two USB-C ports, and a USB-A port in a super compact package that fits into the palm of your hand. Though it's small, you can still charge your 13-inch MacBook Pro from 0 to 100% in less than two hours. It also has foldable prongs, and an intelligent power system that adjusts power output to protect your device's battery. So check out UGREEN to get your 65 watt Nexode charger at the link below. Let's talk about the features on this bad boy. So one, they have 40 millimeter Beryllium drivers, 32 hours of battery life with 28 hours if you're using ANC. 15 minutes of quick charging gives you six hours of battery. It has Bluetooth 5.1, which is a little disappointing considering that Bluetooth 5.2 is already exists. It should have 5.2 at this price point, because these are $600. So you're competing with AirPods Max. You're like 33% more expensive than the Bows noise canceling headphones, the iconic travel headphones. You're really, really pushing it with this. And I get it. They're more of a fashion brand, but still. And in a way, the Bows headphones have their own sense of status. It's like, \"That guy works in business. That guy has a real job.\" Because they're the de facto ones. They have their own status. It's the same thing with Apple products, where it's like Apple products denote a sort of status. Whereas Master Dynamic is coming in here and being like, \"We're also status.\" Let's turn them on. Whoa. Okay, so they have... It keeps pinging me with sounds. They have on ear detection. You can see right there that there's little holes in the ear cups. It's very similar to the AirPods. They keep making little (chimes). So I think that's it's searching for a Bluetooth, which is nice because a lot of devices will just be not telling you what they do. That's one of the biggest grievances I have with Bluetooth, is how often you just don't know what's happening. And so it's super frustrating when Bluetooth breaks. Because is it working? Is it slow? Am I an idiot? And this at least lets you know that it's searching for something. These do have Qualcomm aptX enabled, which is why we also got this phone. What is this phone? It's the Sony Xperia. Brandon, you like this phone. - [Brandon] I do. - These are actually really quite nice. I could see you having issues if you have bigger ears. The cups aren't that big. And I can feel them kind of pushing up against my earlobes a little bit. Mileage may vary on these ones, but the ear cups are very, very nice. They're very plush. They feel supportive. These actually feel really comfortable, which is great. And the hinge feels... It's very much the same kind of mechanism as the Maxes. You can have any sort of distance you want, and it just kind of holds it there. It's really nice. Ooh, it's got a lady that talks me. It's also, I don't know if you've watched DankPods, but it's the sexy voice. It's like a sexy voice. Listen to how horny this is gonna make you. - Ambient listening on. - Can you imagine you're laying down with the wife and then she comes into you, and she just goes, \"Ambient listening on.\" Oh and if you like DankPods, you can actually find him streaming on Floatplane, he does drum streams. So check that stuff out. It's Garbage Time (chuckles) is what the channel's called. The mic's on here, there's four of them. There's one here on the top of each earphone, one on the bottom of each earphone. These are beam forming microphones, which is, just means that they have directionality, and they're aimed towards your mouth. Okay, so this is one of my pet peeves. So this is the normal seal, they're off, and then if I wanna listen, I have to choose between ANC on or ambient listening, which is super annoying because both of those change the sound. I'll switch to ambient listening, there's about a second long delay before it actually switches into that mode. And then it's just like, there's like a hiss. There's a background hiss from the microphones. And that's also present in the noise canceling. Maybe they're turned up really loud. That might be something that I should check before I play anything into my freshest little ears. No, it's still there. 'Cause sometimes headphones will like... There'll be a little bit of a hiss when they start getting a signal, they go, \"Oh we're playing something.\" It's a bad thing, no matter what, you want there to be no hiss. That's kind of a disappointment. 'Cause if I have the $50, less expensive AirPods Maxes, those don't have any noise. Yeah, the hiss is just gone. And again, Master Dynamic, this is your competition. Maybe it's something that can be fixed in update. Maybe it's a... Because they do have an M&D, Master & Dynamic app. Okay, cool. So my device is up to date. So apparently there's no firmware to fix this issue. Maybe it will come in the future. You can switch between ambient, ANC and neither. That hiss is just kind of always there. What is that? Even when it's off. So strange. By themselves they get a pretty good seal which is great. Auto off time or anywhere protection. You have some EQ presets, but no actual EQ. You have bass boost, bass cut. Vocal boost, emphasize vocals and mid-range sounds. Oh sweet, you can add the third option to the headphones. My complaint about there being no option to have the ANC off I had, without listening, that is solved by getting the app. Okay, listen time. This is just over AAC, not the highest definition codex you can deal with. It's also on YouTube Music, not the highest definition audio. (moderate music) These sound pretty dang good. I'm very surprised by how reserved these headphones are compared to their MW07s that were the Louis Vuitton headphones. Those were much more emphasizing a V-shaped curve, whatever, lots of bass, extra treble, a very fun sound. These are, these are classy. Not exactly referenced to my ears, but they're really not trying to be... They're not trying to change the sound of what you're listening to too much. The noise canceling doesn't affect the sound of the music too much. It does make it a little more brittle. Things appear a little bit sharper compared to having noise canceling off. Yeah. And the ANCs done pretty well. Obviously, the laptop isn't a great test, because ANC, it tends to block out more of the lower sounds, and the laptop just can't really produce sounds that low. The nice thing about this is that you have different settings for your ANC. I'm not sure if they're adjustable through the headphones, but you can adjust them through the app. You have Max, All day and Adaptive. Adaptive, I guess, is just based on how loud the surrounding environment is. All day is less aggressive. ANC Max is like, if you're gonna be on an airplane, or something. Let's compare the ANC on these. (machine roaring) Okay. The Max have far better ANC. They're a little more aggressive. (car hooting) But it's just it's just quieter. It really is. Let's give it a quick listen with the Qualcomm aptX as well. Hey, it actually does have mult... It's connected to both, it's switching. It has ear detection. (music in headphones pause) It paused. But yeah, this is for your Qualcomm aptX. Oh my God. Also, volume buttons on the headphone, thank you. There's a button to pause, that's the same but... One tap to pause. A long press opens your voice assistant. Oh, that's a pretty bad delay. This is via just Bluetooth, as opposed to aptX, which has far lower latency. I'll check that in a moment. You got your skip forward. These are the controls that I want. What's happening? (music stuttering) Don't worry, they won't copyright strike this. So can I recommend these? That's really tough to say because $600, AirPods Max, $50 less. And then if you want the Sony XM5s, that's $150 less. No, that's $200 less, because they're only $400 for the XM5. And if you wanna go cheaper than that, the XM4s which are almost as good as the XM5s are only 270 bucks right now. Do they look cooler than these stupid metal earmuffs? Yes. Do they look cooler than the old man Bows little sticks? Yes. As a fashion item, I think these succeed wonderfully. I think they look great as an accessory. You won't be disappointed if you buy these, but I can't really recommend them for $600. So if you know that you care about the style, and the looks and you like what Master & Dynamic's doing, these are a great get. But they are really, really expensive. Thanks for watching ShortCircuit. If you liked this video, why don't you check out James's video on the Master Dynamic MG20s? That's their gaming headset, which is an interesting move for this company. But you know, maybe he liked them, I haven't watched the video. But I'm gonna go there right now and watch it. So why don't you come with me?",
    "transcript_keywords": [
        "Louis Vuitton headphones",
        "Louis Vuitton",
        "headphones",
        "Master Dynamic",
        "kind",
        "Bluetooth",
        "ANC",
        "master",
        "Vuitton headphones",
        "noise canceling",
        "Dynamic",
        "ear",
        "nice",
        "noise canceling headphones",
        "Max",
        "Vuitton",
        "noise",
        "Vuitton headphones video",
        "Louis Vuitton earbuds",
        "USBC"
    ],
    "transcript_entity_values": [
        "Nexode",
        "USB",
        "DankPods",
        "Max",
        "Bows",
        "5.2",
        "third",
        "15 minutes",
        "the AirPods Max",
        "M&D",
        "Bows",
        "today",
        "32 hours",
        "the Master Dynamic MG20s",
        "AirPods Max",
        "USB-C.",
        "the Sony Xperia",
        "quarter inch",
        "AirPods Maxes",
        "ANC",
        "22 hours",
        "aptX LL & aptX HD",
        "Louis Vuitton",
        "AAC",
        "Bluetooth",
        "Sony",
        "two",
        "200",
        "Eight",
        "65 watt",
        "one",
        "only 270 bucks",
        "only $400",
        "second",
        "eight bucks",
        "$600 US",
        "Suh",
        "YouTube Music",
        "40 millimeter",
        "Master & Dynamic's",
        "Brandon",
        "Floatplane",
        "Canadian Tire",
        "Master & Dynamic",
        "2014",
        "MacBook Pro",
        "ShortCircuit",
        "Louis Vuitton",
        "five",
        "Apple",
        "Maxes",
        "AirPods",
        "Qualcomm",
        "three",
        "One",
        "5.0",
        "less than two hours",
        "six hours",
        "13-inch",
        "0 to 100%",
        "the Master Dynamic MW75",
        "65 watt Nexode",
        "28 hours",
        "70",
        "Dynamic",
        "UGREEN",
        "150",
        "33%",
        "Adaptive",
        "four",
        "600",
        "EQ",
        "Barracudas",
        "USB-C",
        "50",
        "James",
        "All day",
        "XM5s"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "TIME",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "TIME",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "NORP"
    ]
}