{
    "id": "DbyCnYsTEbA",
    "title": "This controller can do ANYTHING!!! - 8BitDo Pro 2 Controller",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-07-28T20:59:55Z",
    "video_url": "https://www.youtube.com/watch?v=DbyCnYsTEbA",
    "category": "Science & Technology",
    "tags": [
        "8BitDo",
        "Controllers",
        "Retro",
        "Gaming",
        "Modern",
        "USB-C",
        "Bluetooth",
        "Games",
        "Sticks",
        "Custom",
        "Analog",
        "Controls",
        "Control",
        "SNES",
        "Nintendo",
        "Switch",
        "Steam",
        "Compatible",
        "Old school",
        "Playstation",
        "Sony",
        "Joystick",
        "Wireless",
        "Wired"
    ],
    "views": 856584,
    "likes": 26902,
    "comments_count": 1771,
    "description": "Thanks to Unbounce for sponsoring today's video. Go to   and use the promo code circuit at checkout to get 20% off.  A mouse and keyboard can't do everything, especially when you are playing a platformer, driving games, or you want to have that retro feel when you're playing on an emulator. The 8BitDo Pro 2 Controller might be something you want to consider if you can find one in stock!  Buy 8BitDo Pro 2 Controller On Amazon (Paid Link):  On NewEgg (Paid Link):   Buy Xbox Series X Controller On Amazon (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 1:19 - First Impression 3:31 - Other box contents 4:51 - Sponsor - Unbounce 5:20 - 8BitDo Ultimate Software 9:57 - Trying out the controller 12:29 - Linus tries to out 12:57 - Final thoughts",
    "description_links": [
        "https://thld.co/unbounce_circuit0721",
        "https://geni.us/ROoh53i",
        "https://geni.us/TZtItAI",
        "https://geni.us/BvUf",
        "https://geni.us/LAX2",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's retro. No, it's not. Not today, anyway. 8Bitdo is known for their retro controllers or retro style controllers, but these are a little bit different. They're more contemporary, kind of like the Xbox controller here. And this is kind of the yardstick I'm going to use to measure them. So these are the pro 2 controllers. What are pro 2? The pros were controllers that had the handles and the sticks along with the kind of retro style aesthetic. While the pro 2s, well looking at it, I don't really see much of a difference. So, let's see what they have to say about themselves. Not whole lot on the back here, it just says that it supports the Switch version 1.0 and above for the, I guess, the traditional Switch. It's the firmware. And 9.0 and above for the Switch Light. Windows, Android, macOS, Steam. I mean, if it works with the operating system, why would it not work with Steam? Raspberry Pi as well with Bluetooth 2.0 and above. Interesting. So, I can't imagine the Bluetooth 2.0. experience would be very good, but I don't have a Pi handy to test that with. Yeah. Not a whole lot else going on in the box. So I guess it's time to take it out. I am a bit of a fan of 8Bitdo's packaging. Okay. That is kind of neat looking, but I do not like the plastic. It needs to all be cardboard, be environmentally friendly. First of all, I feel like they've changed the shape of the grips. They were basically like circular before, like just basically you're holding onto cones. Whereas now they're a little bit more triangular prism-shaped. Sort of. It's kind of weird to describe, but it's better. It feels better in the hand. Analog triggers. Yeah. That's something that 8Bitdo hasn't had. I don't think the pro original pro controllers had them. You can correct me if I'm wrong. That is huge. And also I'm noticing I'm pressing these little pedals on the back here. Yeah. It's got grip triggers as well, which I think you can program to be separate functions. Like I'm not sure if they can be macros or what, but yeah. That's kind of cool sticks. They feel all right. I have grown very accustomed to having the sticks in this position, which, I mean, at first I didn't like it because I was used to the PlayStation, but now I'm not. And this no longer is all that comfortable to me, but your mileage may vary. And there's another thing that I noticed on the back here that is not on the pro as well, the original pro and that is a battery door. Yeah. It's got a built-in battery that can be taken out and you can just replace it with a double A's. How about that? Yeah. So you don't have to worry about your 8Bitdo controller dying over time and you had to use it wired all the time. Capacity is a thousand milliamp hours. I don't know what the battery life is though. - It says 20 play hours with four house of charging time. - 20 play hours with four hours of charging time. Yeah, that's about right, I guess. Obviously I was putting it in wrong before I guess it goes in contacts first and then it yeah, slips down like that. Neat. Cause yeah, you can't remove the battery at least not easily from other 8Bitdo controllers that I've used. Or the PlayStation five controller. Microsoft's been pretty good about that over the years. Yeah. I'm not a fanboy or anything like we're on Linux, but their controller is just nice. So let's put this aside for now and go through the rest of the box. There's not a lot in here. You get a USB type C I believe. Yes. USB type C charging cable, which yeah. It's type C to A and it is wired for data, but USB 2.0 only, which is fine for a controller, but don't use it to plug in a USB, a SSD or something. And also we have the instruction manual. And is this also plastic? It feels like it's plastic and it's glued in, I mean. It's fine. I guess. I'm not sure what aspect ratio you would call this CVS receipt. Yeah. There you go. And on the back, we've got a mode switch. That is interesting because before you had to hold down a face button while turning on the controller to change different modes, which is super confusing. And I to this day, do not remember how all of them work. They say that they don't support HD rumble. IR camera. Of course they don't. Notification LED or anything like that. Nor can the system be woken up wirelessly. Really? Does Nintendo not wirelessly turn on the switch when you turn on a controller? I thought the switch pro controller did that. Yeah, that sucks. Good thing. I'm not using another switch. But before I use it on anything else I need to talk to you about Unbounce. Unbounce is the landing page platform that helps you convert more visitors into leads, sales and customers. You can build beautiful high converting landing pages with no coding required. Thanks to their easy drag and drop builder and a hundred plus templates that allow you to bring any campaign vision to life in a fraction of the time it would with a developer. Plus you can earn up to 30% more conversions with their latest AI powered feature, smart traffic. Why wait? Use the link below and use the code CIRCUIT for 20% off your first three months of Unbounce. Okay. That looks cool. We've got profiles that we can set up here. That's what that profile buttons all about. I think technically they could display as many as six profiles with these LEDS but you only get three. So it's not the most intuitive interface in the world. In order to map everything you've got your controller map here. You would think that you'd like click on something and it would like give you an option. But no, over here is what you're looking at. So L2 goes to left trigger. You can assign that to whatever you want. Same with L, up, down left, right. So you can literally modify any, anything you want here. So let's see. Can I do turbo from here? I know there's a turbo setting you can do separately. So let's say I want Y. Oh no, no, you can't do that. Okay. That's a little unfortunate, but not a big deal. I mean, once you change something, you just click sync to controller and it syncs. And then please turn off the software after customization, in order to, for the controller to return to its required motor playing games on USB connection What? I don't understand what it's telling me. I guess it means quit the software. Press to low-profile. Okay, cool. So let's go back to what it was. And it actually shows, thankfully it shows the default with a little dot here. Regardless as to what you have at set to. So if I have it set the X for the X button, it still has Y as where it should be. And it is a it's currently saved as the X button. So if I set it to Y sync it again, there you go. That's helpful. Let's see the sticks. It's not the highest resolution thing in the world. It's kind of skipping over a bunch of steps so we can adjust the dead zone. I don't know why this says zero here. It should be adjusting to show me a number so I can get like the actual percentage I want. Again, that's kind of interface fail, but it's nice to be able to adjust these things. So with the dead zone set like this, I can go this far, actually, without actually waiting anything. And then we go out to here and it's a hundred percent. We can also set it so that the actual active area is much smaller. So you get a hundred percent much sooner. That is kind of cool. What that allows you to do is make it so that you don't have to flick quite so far in order to get to a hundred percent of your motion. So if you're playing a driving game and you are well insane, you can make it so that our hundred percent is pretty much instantaneous. That's kind of cool. You can invert your sticks here along both axes. That's interesting. You can swap the sticks. So for games that for whatever reason have movement on the right stick, you can swap them. The triggers. So these have the same kind of range of motion adjustment. Now it's not going to actually change the range of motion of the controller itself. It's still going to go the whole way. But I can make it to the left trigger's. Full actuation is like right there. So basically giving you a hair trigger, I can make it even shorter. So it's got two vibration motors. So the right motor is obviously the fine motor and the left motor is the chorus motor. And I guess, yeah, you can adjust how powerful you want your rumble to be. So you can actually set it to zero. If you don't like it. Like some people I know do. You can set it for five, which is the highest possible. So you have the biggest range of vibration. Yeah. That's actually a really cool feature because not all games let you change the strength or the intensity of the rumble. And finally we have the macros here, so macros. Hm. How do we make one? Okay. So down, down forward forward and say, Y yeah. So that'll now do basically immediately. So I don't see a way to even so much as test the motion capabilities of this controller, but it looks like the switch mode is required for it. So a Nintendo switch mode, it emulates, a pro controller, and interestingly in switch mode, it has a fairly deep dead zone of like, it says it's like 25%, but it feels more like, okay, maybe it is 25%. So yeah, I'm just gonna go ahead and not do that. There we go. Now I've got the full range of motion on that. Yeah, that should be just about right. So switch mode in case you didn't know, should work perfectly fine with Steam, with Retro Arch, with a number of things that actually support it. Steam should work with gyro aiming with flick stick. I haven't tried it yet. And I may not because we're currently signed in as David and I don't know if he wants me to kill his KTR in CS go or whatever. So let's see play through this thing's strengths and play some retro games. Feels solid actually. Like I was using those retro handhelds before. They had you know, a fair amount of input lag. At least by default, you can set them up for much better input lag configurations If you put the like the time into it. I feel like that's probably part of why this feels so good, but like, this is Bluetooth. You wouldn't normally expect Bluetooth controllers, particularly on windows to be quite so good. Okay. So that D pad is very responsive. All of the buttons are very responsive actually. There's a nice snap to them. I don't normally really like that, but for a membrane controller like this, there's a rubber membrane underneath these buttons. It's pretty good. Like, it feels good. It feels right to me. Now Linus, who grew up as a Nintendo kid and you know, is entirely in love with the super Nintendo controller, will probably have plenty of things to say about this. But you know, for me, I actually kind of like it it's comfortable. You've got the handles and you do have these sort of grip buttons there. Okay. How do we put this? Those grip buttons can be used yes. For turbo and yes, for like holding down buttons, stuff like that, which is great. But there's no reason why you couldn't have set up any of the other buttons for that as well. It's just not exposed in the software. So we're looking at the software here now. I can assign any button to any button. That's the thing I can do. But only on these extra buttons, like the, the star button or these trigger buttons. Can I do turbo or hold or swap or any other special function? I guess those are the only three. That seems really arbitrary to me. There might be times that I want to have the Y button here set to the B button and the B button here set to the A button. But there would also be times where I want like this. And then these used to be turbo. And like being able to select between profiles like that on the controller without having to go through the emulator would be a lot easier to me. With that being said, maybe I can set it up so that when I'm holding down these switches, those changes are made, but it seems a little clunkier than it really should be. Now, Linus just walked into the building and I'm sure I could find something that would make him upset about it. - Is it cool? - It's cool. Enough. - Yeah. It's all right. It's kind of trying to be a SNESS and PS1 controller, and it's sort of neither. - Yeah, how's input like over Bluetooth? - I swear like not all my bees are going through. - Hmm. - Come on one up. I need more one ups. No that's not a one up, that's he opposite of a one up. Wired, wired is the way to go. - Like I don't like everything that 8Bitdo does. Their original pro controllers. They didn't really wow me in the same way. Like I was like, oh yeah, finally, a retro style controller with handles that I can kind of hold and you know, it just didn't really do much else other than have the handles compared to the SN30. So with that in mind, this feels like a lot more of a mature product. It's got a lot more features to it. It's got the rumble, it's got the six X controls. It's got the removal battery, it's got USB type C, it's got switch pairing mode. It's got pretty much everything you can want. It's programmable. And yeah. I mean, how much is it like 50 bucks, not in stock, but yeah, 49.99. It gets you a very competent controller that feels right for retro games. These sticks, aren't going to blow you away. They feel fine. They're perfectly serviceable, but they're certainly not on the level of the X-Box series controllers nor the dual sense or even the dual shocks. But that's not what these sticks are for these sticks are there for more of a general purpose kind of thing. It's for your PlayStation one games, your N64 games. Basically for games that are going to be, you know, old enough that the sticks that were on the original consoles, weren't all that great, but these are better. They're not amazing. And that's kind of what this controller is all about. It's bringing back that feel of the classic controllers, but better. Is it worth the $50? I would say so. I would say that if you're into retro gaming at all. Yeah. You could do way worse than getting an 8Bitdo controller, especially one like this. Well thanks for putting up with another retro short circuit. It gets subscribed. So you get to see more like this one or not like this one, if this wasn't your jam and I'll see you soon.",
    "transcript_keywords": [
        "Yeah",
        "controller",
        "kind",
        "Switch",
        "set",
        "button",
        "retro",
        "pro",
        "buttons",
        "sticks",
        "feels",
        "USB",
        "guess",
        "games",
        "cool",
        "switch mode",
        "time",
        "switch pro controller",
        "Bluetooth",
        "pro controllers"
    ],
    "transcript_entity_values": [
        "Y",
        "three",
        "8Bitdo",
        "USB 2.0",
        "your first three months",
        "one",
        "20%",
        "USB",
        "Switch",
        "a hundred",
        "49.99",
        "up to 30%",
        "this day",
        "as many as six",
        "the Switch Light",
        "1.0",
        "Nintendo",
        "L2",
        "David",
        "Microsoft",
        "PlayStation five",
        "Linux",
        "KTR",
        "Raspberry Pi",
        "20 play hours",
        "8Bitdo",
        "Bluetooth",
        "first",
        "N64",
        "Bluetooth 2.0",
        "two",
        "9.0",
        "25%",
        "Android",
        "Retro Arch",
        "four",
        "the years",
        "our hundred percent",
        "four hours",
        "a hundred percent",
        "LEDS",
        "Linus",
        "a thousand milliamp hours",
        "Xbox",
        "six",
        "First",
        "five",
        "2",
        "50 bucks",
        "50",
        "PlayStation",
        "today",
        "zero",
        "CS",
        "SSD"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "PERSON",
        "TIME",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "TIME",
        "PERCENT",
        "WORK_OF_ART",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}