{
    "id": "Dc-EG4ABsxA",
    "title": "This is a Handheld Gaming PC",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-30T16:27:38Z",
    "video_url": "https://www.youtube.com/watch?v=Dc-EG4ABsxA",
    "category": "Science & Technology",
    "tags": [
        "gaming pc",
        "portable gaming pc",
        "portable pc",
        "game console",
        "gpd win 2",
        "gpd win",
        "mini pc",
        "handheld gaming",
        "pc gaming",
        "mini gaming pc",
        "unboxing",
        "tech",
        "austin evans"
    ],
    "views": 1802351,
    "likes": 37491,
    "comments_count": 3943,
    "description": "Get 10% off any purchase with Squarespace!  This tiny handheld gaming PC can run actual Windows 10 games. GPD Win 2:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://www.squarespace.com/austin",
        "https://www.indiegogo.com/projects/gpd-win-2-handheld-game-console-for-aaa-games-laptop#/",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- This video is sponsored by Squarespace, whether you need to domain, online store or website, make it with Squarespace. Hey guys, this is Austin! This inconspicuous box right here contains a portable game console that is a full fledged PC with Windows. This is the GPD WIN2. Now to be clear, this is the light prototype, so the final version will have some fit and finish differences, but it should give us a good look at what this guy is actually going to be like when it goes on sale. Yo! It looks like a little laptop! Wow! (laughs) This is so cool! So if you guys remember last year, we did a video on the world's smallest laptop at the time, which is also made by GPD. Well this actually takes a lot of cues from that, but it actually has pretty much a full Xbox controller built in, in addition to a tiny keyboard. I've gotta say, the hardware feels surprisingly solid. So it's all metal and- actually is that metal? (taps) Oh yeah this is definitely metal. Man! This is very unusual, there's all kinds of weird buttons and ports, there's a full size USB port on the back of your tiny game console. So in addition to a slot for the SSD, you will also see the tiny fan. Now what separates this from something like that GPD laptop that we took a look at last year, is this has a proper core processor, now mind you, its a low wattage core M3, but still, it actually should be enough to play some decent games. There's a pretty wide variety of ports, including a USB type C, which can also be used for charging, a headphone jack, a full size USB 3.0, Micro SD, we have a Micro HDMI, as well as we have three sets of shoulder buttons. Take a look inside the WIN 2 and you'll see it's a pretty interesting little device. So in addition to having a pair of joysticks, you also get a D-Pad as well as your standard X, Y, A, and B buttons, there's a little toggle here that will switch between mouse input as well as just turning it into a game controller. But even on the keyboard there's some specific options, including the Xbox buttons, select, start, you can even use the arrow keys as well as the WASD. Now is it a good idea for you to set your tiny little laptop portable console thing up, and use it with a mouse and this tiny keyboard? No, that's not a good idea at all. But you have the USB port so, you can do it. So while I might not sound impressive with a six inch 720p display, it actually does make sense considering that the fairly limited power of the actual computer... Or, game console? What do I call this? Do I call this a computer, you think? I mean, it runs Windows. It's a computer, right? - [Man] Handheld PC. - Handheld PC. Coming back! 2018! The year of handheld PCs. Do you hear that? That's the sound... of portable power! It's actually not that loud; it's just a little... Little high pitched. I will say one thing: Now that we're actually into Windows, 720p on a six inch display is very, very small. Inside, this guy is rocking that core m3 processor with the integrated HD 615 graphics, 8GB of RAM, 128GB SSD, as well as a pair of 4900 milliamp hour batteries. Which especially when you're doing longer gaming sessions should definitely come in handy. So because this guy only has 120 gigs of storage out of the box, I am using an external drive, but let's actually see how the controls hold up in gaming. The first game I'm going to be trying is CS:Go. Now, this is a famous game that is really well known for how well it is supported by controllers and, how it really is the ultimate way of playing the game. Alright, I'm just gonna walk around with a pistol because I don't know what the controls are to switch... Oh it's space. So, immediately the performance seems decent. Um, I definitely need to tune the sensitivity of these sticks but getting like 45 frames per second on medium at 720p. The more I play this, the more it really does feel like I'm playing on a PC version of the Switch. The six inch screen, even though it's not super high resolution or anything, because it's so small, it makes a lot of games, even on medium, look pretty decent. Next, we have Rocket League. Now here I'm also going to turn it down to 720p on quality settings. But, I think we should be playable. A game like Rocket League does feel at home on the Win. Not only is it powerful enough to play it pretty well, the controls feel really nice. So, something that I'm noticing here is that the quality of the buttons and especially the sticks feels solid; it feels like, while yes, this is going to be a little bit of an expensive portable, would you see where they spent it? It wasn't like they were just going crazy... And oh yeah, come on, come on come on... No, no... Next, we have GTA5. Now this, it claim, is able to be played back at around 40 frames per second with max settings. However, while I'm playing it here at 720p on normal, I'm getting like 20 frames per second. So I'm not exactly sure how they're getting that number. I mean, it's kinda playable, just about as much as, like, the Xbox 360 version, maybe? But, yeah not the greatest experience. Even thought the controls are good for the most part I will say it is a little bit awkward to have three set of buttons on your shoulders instead of two. So instead of being able to press in the sticks for R3 and L3, you actually have that dedicated button around back. And that's fine, but I accidentally keep grabbing it when I mean to do something like shoot at someone or something, which is kind annoying. Now comes the real test. Can I play Overwatch on this guy? So at first glance, a portable Overwatch machine sounds like a great idea. But I'm curious to see what the actual performance looks like. So in Overwatch its 720p on low. We do see the frame rate dropping a little bit from time to time, especially when you get into a big battle, but it is usable. My big issue is just the sort of the sensitivity of the sticks; I feel like it does need a little bit of sort of customization to be able to really get it into a good sweet spot. But it's, uh, it's not bad. Also, what am I doing here? That was a bad idea. So, should you pick up the GPD Win 2? Well, it's a little bit more complicated than a lot of videos. On one hand, even though, yeah, it's a little bit of a weird concept, the Win actually pulls it off pretty well. The biggest downside is price. So it's $650 on Indiegogo right now, and somewhere north of $800 when it goes for full retail sale. The GPD Win 2 is for a very specific person. For everyone else, may I interest you in something called the Nintendo Switch. And, if you pick up a Switch, you can use all the money you saved to sign up for Squarespace. See what I did there? Squarespace is the ultimate way to build yourself a Nintendo Switch fan page, or well pretty much anything else. And, in case you don't have a ken to build a website for you, Squarespace makes it super simple with their easy drag-and-drop templates, to not only be able to create a really custom looking website, but something that's going to be really easy to build. Squarespace makes everything super simple with their all-in-one platform. There's no need to install, patch, or upgrade anything ever. And, in case you ever have any issues, they have awesome 24/7 customer service. It's simple to get up-and-running with a custom domain, as well. So if you already have one such as AustinEvans.com, it's very simple to port it into Squarespace. But if you don't already have a domain, if you signup for a year, you're actually going to get one for free included. So, if you are ready to make your next move with Squarespace, head over to Squarespace.com/Austin to get 10% off your first domain or website purchase. Anyway, thank you guys so much for watching, and I will catch you in the next one.",
    "transcript_keywords": [
        "Squarespace",
        "game",
        "GPD Win",
        "GPD",
        "online store",
        "switch",
        "pretty",
        "buttons",
        "WIN",
        "USB",
        "game console",
        "bit",
        "full size USB",
        "USB port",
        "full",
        "tiny",
        "Squarespace makes",
        "good",
        "Nintendo Switch",
        "portable"
    ],
    "transcript_entity_values": [
        "2",
        "4900",
        "8GB",
        "three",
        "Nintendo Switch",
        "2018",
        "128GB SSD",
        "AustinEvans.com",
        "800",
        "650",
        "Windows",
        "first",
        "RAM",
        "Overwatch",
        "the Nintendo Switch",
        "615",
        "USB",
        "jack",
        "Austin",
        "two",
        "Xbox 360",
        "a year",
        "Windows",
        "Rocket League",
        "Switch",
        "Xbox",
        "Y",
        "120",
        "Squarespace.com/Austin",
        "M3",
        "one",
        "Indiegogo",
        "The year",
        "second",
        "around 40",
        "L3",
        "R3",
        "a Micro HDMI",
        "m3",
        "SSD",
        "WASD",
        "Switch",
        "last year",
        "10%",
        "Yo",
        "Win",
        "Micro SD",
        "45",
        "Squarespace",
        "max",
        "six inch",
        "20"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "LOC",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL"
    ]
}