{
    "id": "dEpHBK8ipdI",
    "title": "The BEST Galaxy S10 Accessories!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2019-04-19T05:22:01Z",
    "video_url": "https://www.youtube.com/watch?v=dEpHBK8ipdI",
    "category": "Science & Technology",
    "tags": [
        "Galaxy S10",
        "Galaxy S10 Dex",
        "S10 Dex Setup",
        "Galaxy S10 Desk Setup",
        "Galaxy S10 Dex Review",
        "Galaxy S10 Review",
        "TLD",
        "jonathan morrison",
        "Galaxy S10 Accessories",
        "Best Tech",
        "Tech Under",
        "Galaxy S10 MicroSD",
        "Galaxy S10 Headphones",
        "Best Headphones",
        "USB-C Dac",
        "angry birds",
        "rovio",
        "fun games",
        "mobile",
        "mobile game",
        "puzzle game",
        "angry bird",
        "piggies",
        "casual gaming",
        "slingshot",
        "addictive game"
    ],
    "views": 543528,
    "likes": 7330,
    "comments_count": 400,
    "description": "This video is sponsored by Rovio Entertainment\" Download Angry Birds 2 from your app store today! The best Galaxy S10 accessories including a cool portable wireless charger and an entire setup that transforms the Galaxy S10 into a desk setup!  What's in my Tech Bag 2019!   Apple AirPods 2 vs Samsung Galaxy Buds!:   USB-C Headphone DAC -  AOC 24\" Monitor -  Anker SoundCore Speaker -  Samsung Dex Station -  Gigastone 3-in-1 Wireless Charger -  Logitech K600 Wireless Keyboard -  512GB MicroSD Card!   Tech that made my iPhone better:  The Perfect MacBook Pro Setup:   TLD Spotify Playlist!   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:",
    "description_links": [
        "https://c.singular.net/api/v1/ad?st=59571402224",
        "https://youtu.be/0orbL_WNcWE",
        "https://youtu.be/-dkfZuT7OCE",
        "https://amzn.to/2UHdxBT",
        "https://amzn.to/2Iu2LZ9",
        "https://amzn.to/2V8WUyd",
        "https://amzn.to/2XqOcJ8",
        "https://amzn.to/2XtXQLj",
        "https://amzn.to/2XtAi9j",
        "https://amzn.to/2XtAi9j",
        "https://youtu.be/LrcHHyMSVtY",
        "https://www.youtube.com/watch?v=fBTNg...",
        "https://open.spotify.com/user/jonathan.morrison/playlist/3wmqwmIrP6MFizjiyM7k6y?si=x_rBjHbiQp2lFmyM5Qj5SQ",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQ...",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq..."
    ],
    "transcript": "- Today's video is sponsored by Rovio Entertainment. Yo guys, Jonathan here today I'm looking at some of the best Galaxy S10 accessories from this awesome portable wireless charger to an entire setup that will transform the Galaxy S10 into a desktop. Before we hop in though let's check out a word from today's sponsor. Angry Bird's Two is everything you love about Angry Bird's but better. You can win prizes daily in the Tower of Fortune that level up your birds and make them more powerful than ever or grab some of these sweet, sweet hats. It's available for free in the App Store or Play Store a link is down below, and again big thanks to Rovio Entertainment for sponsoring this portion of the video. So kickin' off the list is actually a quadfecta of gadgets and that's actually what's transforming the Galaxy S10 into this beautiful setup behind me. It's clean, it's simple, and at the heart of this is Samsung's DeX Station which allows you to dock the S10, it then transmits video through HDMI to the monitor but also charges the phone at the same time which is awesome. It also adds a couple USB ports, and yeah you could totally just use a USB C to HDMI cable which I'll link to down below. But I think this is a much cleaner solution. Now the monitor is from AOC and one I love the design it's slim the aesthetics match the DeX Station, but also this thing is a steal in terms of cost. It comes in under a 150 bucks which is crazy cheap. You get full HD and funny enough the base of this monitor works perfectly to drop this Anker Bluetooth speaker which helps level up the sound. This is the original Anker Soundcore and just like the monitor it's also really affordable comin' in at just over 30 bucks. It's packing surprisingly great sound. There's no wires so it's perfect to take on the go, and more than anything I love the splash of blue that it adds to this setup. Now the icing on the cake with this is the Logitech K600 wireless keyboard. It's Bluetooth so again we're minimizing clutter but more importantly there's a built-in trackpad which eliminates the need to use a mouse which is awesome. If you travel you can totally throw this into a backpack and again the Galaxy S10 will work with DeX with just a single USB C to HDMI cable and that is a really lightweight minimal setup. Next up is one of the coolest products I've seen in a really long time, it's this three-in-one charger from Gigastone which is a weird name but it's awesome I promise. I recently featured this in the newest What's in My Tech Bag, which I will link to down below. But it's a battery bank, a wireless charger, and then you charge the charger by plugging it into a wall. I think we've all been there before where not only your phone is dead but your battery bank is dead as well and you have no way to charge it. So it's kinda like the episode of the Twilight Zone where the dude has all the books all the time but no way to read them. What's also nice is the attention to detail. You've got this sweet little power indicator to show you how much charge is left. It's packin' 8,000 milliamp hours, Quick Charge 3.0, USB C, and fast wireless charging. With a battery bank what else could you ask for. Next up the Galaxy S10 it's packing so many awesome features including really decent storage out of the box but what if you could add just a little bit more. You could actually add on up to a freaking terabyte of storage in these Galaxy S10s, but the problem is that is crazy expensive. Unless you want to drop the price of a house payment on storage this is a much more practical option. It's packing 512 gigabytes of storage, has really fast read and write speed. So if you shoot a lot of 4K video which I know you are with the Galaxy S10 this is going to be your new best friend. From there unlike most smartphones the Galaxy S10 opted to keep the headphone jack, and while it does sound good if you want to level up to that snazzy Q-audio file level this Spectra USB C deck is awesome. So if you're using Tidal or your packin' that micro SD card full of FLAC files, this will elevate the audio experience on the Galaxy S10. So if you're in that world of beyerdynamic, or Focal, or Sennheiser this will help you take advantage of those really great sounding headphones. And maybe you want that LG V40 deck experience but you don't want everything, the baggage that comes with LG this is something you definitely have to scoop up. Last week I dropped a comparison of the Galaxy Buds against the brand new AirPods 2, AirPods 1.5, AirPods S whatever you want to call 'em. The gist of that was if you own an iPhone grab AirPods, but if you own a Galaxy S10 grab Galaxy Buds because they are the perfect companion. Sound quality is not gonna blow your face off, but it's pretty freaking good. And honestly I think these are the better choice if you work out or you travel a lot, because the isolation is actually a lot better than AirPods. Now while I wholeheartedly still feel like if you own a Galaxy S10 you should buy Galaxy Buds not AirPods if you want to see a full comparison, how they stack up side-by-side I will drop a link to that down below. Thank you guys so much for watchin' this is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "Galaxy",
        "Galaxy Buds",
        "Rovio Entertainment",
        "Angry Bird",
        "USB",
        "grab Galaxy Buds",
        "awesome",
        "AirPods",
        "Today",
        "HDMI",
        "buy Galaxy Buds",
        "video",
        "HDMI cable",
        "charge",
        "DeX Station",
        "Samsung DeX Station",
        "monitor",
        "link",
        "setup",
        "Rovio"
    ],
    "transcript_entity_values": [
        "Last week",
        "iPhone",
        "Anker Soundcore",
        "Focal",
        "the DeX Station",
        "FLAC",
        "LG",
        "DeX Station",
        "USB C",
        "Sennheiser",
        "4",
        "Galaxy Buds not AirPods",
        "Rovio Entertainment",
        "USB",
        "512 gigabytes",
        "AirPods S",
        "the Galaxy S10",
        "micro SD",
        "AirPods",
        "Two",
        "the Galaxy Buds",
        "Quick Charge",
        "the Tower of Fortune",
        "Galaxy S10",
        "just over 30 bucks",
        "8,000 milliamp hours",
        "S10",
        "Anker Bluetooth",
        "three",
        "150 bucks",
        "V40",
        "AirPods 1.5",
        "AOC",
        "jack",
        "Gigastone",
        "the App Store or",
        "today",
        "Samsung",
        "DeX",
        "the Twilight Zone",
        "Spectra USB C",
        "Logitech",
        "AirPods 2",
        "Tidal",
        "Galaxy Buds",
        "HDMI",
        "3.0",
        "Yo",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "MONEY",
        "TIME",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "LOC",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON"
    ]
}