{
    "id": "desL7v-gBUk",
    "title": "ZenFone 6 - $500 + All Screen + CLEAN Android",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-05-16T19:12:58Z",
    "video_url": "https://www.youtube.com/watch?v=desL7v-gBUk",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "zenphone",
        "zenfone",
        "best 500 dollar",
        "best budget",
        "best android phone",
        "all screen",
        "pure screen",
        "pixel 3a",
        "pixel 3a XL",
        "oneplus 6t",
        "oneplus 7",
        "oneplus 7 pro",
        "samsung s9"
    ],
    "views": 1290999,
    "likes": 35749,
    "comments_count": 3727,
    "description": "Mini review of the Asus ZenFone 6 with no notch, no punch hole, clean android a 5000 mAh battery ZenPhone 6 -   Background Music Fili - Tribe called mess  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2YxieM0",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "[intro] ASUS just announced their new ZenFone6. And before you close this window just because I said the word, ZenFone. I get it! They've been making bad phones......for years! Their very first ZenFone was okay. The second phone was also pretty good for the money. But, the software has been terrible for the past four years. Ever since the ZenFone 2 to ZenFone 5. They just had good hardware with terrible software. They just filled it with bloatware to the point where I as a reviewer just stopped reviewing their phones. They sent them every year and I'll just like This isn't worth showing my audience because I will never openly recommend those older ZenFones solely for their software issues. ZenFone 6 changed all that. Now I don't know what it is, something at their company something with their, I guess desicion making process for how they wanted to market these phones. Then don't have any bloatware on this phone. When you look at the installed apps they have one thing they have like the MyASUS app everything else is just stock Google or...maybe this weather app but basically everything on here is super clean. If you look at this in comparison to their old stuff, they were just stuffed with crap and I think they've realized that filling your phones with useless apps that no one uses and having these really terrible names does not make them sell well. So ZenFone 6, very clean UI, and it's finally fitting of that ZenUI name. The menus, the interface, the whole phone feels so much cleaner. And I think they finally made a phone that was worthy of being in this competitive space in that kind of $500 smartphone market. Okay, so for that money that I think they are trying to hit $500, I don't know the official pricing yet but I've been told it's gonna be around $500. For that money, you get hardware features that are really solid. You get a Snapdragon 855, you get 6 gigs of RAM, there's a 64 gigs of storage for the price, but it's expandable. You can pop out the SIM tray, you'll get a microSD in there. You also get a headphone jack which is something I think a lot of people want back in 2019. You also get stereo speakers, I mean the hardware on this thing overall is very solid.",
    "transcript_keywords": [
        "ASUS just announced",
        "ASUS",
        "ZenFone",
        "phones",
        "phone",
        "software",
        "terrible",
        "money",
        "hardware",
        "announced",
        "years",
        "apps",
        "app",
        "good",
        "making",
        "close this window",
        "solid",
        "bloatware",
        "market",
        "clean"
    ],
    "transcript_entity_values": [
        "ZenFones",
        "MyASUS",
        "years",
        "one",
        "64",
        "jack",
        "second",
        "Google",
        "2019",
        "500",
        "RAM",
        "ASUS",
        "6",
        "UI",
        "the past four years",
        "every year",
        "microSD",
        "ZenFone",
        "ZenUI",
        "the ZenFone 2 to ZenFone 5",
        "around $500"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "EVENT",
        "MONEY"
    ]
}