{
    "id": "deymf9CoY_M",
    "title": "Intel's future computers have two screens",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-18T15:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=deymf9CoY_M",
    "category": "Science & Technology",
    "tags": [
        "Intel",
        "computers",
        "computer",
        "the prototypes",
        "prototype",
        "cpu",
        "lenovo",
        "yogabook",
        "yoga book",
        "lenovo yoga",
        "lenovo yoga book",
        "computer hardware",
        "prototyping",
        "amd vs intel",
        "i7 9700k",
        "i9 9900k",
        "computex 2018",
        "2018",
        "consumer",
        "consumer product",
        "processor",
        "dieter bohn",
        "lenovo yoga 730",
        "future tech",
        "first look",
        "hands on",
        "hands-on",
        "the verge",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "tech news",
        "engadget",
        "latest updates",
        "is it worth it",
        "pre order",
        "review",
        "google",
        "verge"
    ],
    "views": 317261,
    "likes": 6785,
    "comments_count": 671,
    "description": "Intel doesn't make computers, but that doesn't mean the company doesn't build prototypes of them. When Intel thinks of new ways their chips can be used, they build prototypes to prove it's possible, then partner with device makers to turn it into a consumer product. A recent example is Lenovo's new Yoga Book C930, which is based on Intel's Tiger Rapids prototype. In this week's Processor episode, Dieter  Bohn visited Intel's Client Experience Center to learn why they build technologies for the future of computing just to give them away.   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- We started this whole video series that you're watching out by asking a seemingly simple question, what's a computer. And, I'm kind of obsessed with that question or, more specifically, with how PCs are changing. We know that Microsoft has a Surface and Apple has the iPad, and the Mac, and Google has Chromebooks, but that leaves out one really important company, Intel. So, here's a question. What does Intel think the future of PCs looks like? To answer that question, I went to Intel's headquarters in Santa Clara, California. We went inside the room that Intel calls The Client Experience Center, which is a boring name for actually not a very boring place. It's where Intel works on prototypes for entirely new kinds of computers. This is Murali Veeramoney, a Senior Director here at Intel. Veeramoney is one of the people in charge of making stuff like what you see spread out on this table. So at this table we're looking at the, looks like almost a whole development process, microcosm for Tiger Rapids? This is the Tiger Rapids prototype. You might have seen it before, Intel's actually been showing it off for a few months now. It has an LCD screen on one side and an e-paper display on the other where a keyboard would usually go. You've got the idea, and then you start moving on to actually like 3D printing stuff and building boards? - Exactly, so then comes the electronics of it, which is, you know, how does all of these fit into the form factor that we have, so we do different kinds of motherboards and here's an example of another Motherboard we did. It's a whole computer, the whole laptop is this size. - So, yeah, Intel makes computers, sort of. Intel has to do more than just come up with the idea, it actually has to build it to prove out that it's even possible. Intel goes 90% of the way towards creating a finished product. It builds the boards, checks the thermals, and even develops a little bit of the software on Windows. But, you can't go into a store and buy an Intel computer, they don't sell stuff. What you will be able to do is go into a store later this year and buy the Lenovo Yoga Book C930, which is sort of like a bigger version of this prototype device. You can see that the two things here are basically the same idea, one side's an LCD panel and the other side is an e-paper display. - We work very closely with Lenovo to get their product to market using our learnings and our engineering collaterals to the things they want, and then they say, okay, that's pretty good, let us now do it our way. - You kind of give them like a blueprint and then they modify it to their own needs. - We just have to work with them and realize it's their product. - Right. Correct. And make sure that we can satisfy our eventual requirements, which is all silicon. - You have done a huge amount of work to even get to this point. How does it feel? Like as to basically be making nearly consumer-ready products and then not finishing that last mile? What's that like for you? - It's a tough thing, and I tell my team, the analogy I give is like, bringing up your kids. You want them to grow, want them to have a successful life, but we don't get to live their life. - Right. - So it's the same thing like us, we don't get to put our product because that's not our business goal. - So, hang on, we got to stop here because there's a thing that we haven't really talked about yet. Intel has had a garbage year. It started with Spectre and Meltdown which were two huge security vulnerabilities that required everybody to slow down their chips, and then, ah, Intel CEO resigned in July after disclosing an improper relationship with an employee and as of right now, it still only has an interim CEO, and the other thing to say is that for a long while now, Intel has been facing kind of a downturn in its core business. So it's spent the past couple of years trying some really weird stuff. We went behind the scenes at CES is here and we saw drones, and voxels, and self-driving cars, and back in January, we also went to Intel's office to see some normal-looking AR glasses that they called Vont, and that project got canceled because Intel couldn't figure out how to get it from prototype to product. So, you know, yeah, garbage year, not great. All of which means that, right now, I think Intel is trying to refocus on the PC, and specifically on what the PC is turning into. - My grand theory of Intel is PCs are great, smartphones came along and argh, but then you hit Ultrabooks and that was a really big moment, and then there was a bunch of weird stuff that you made, glasses, and balls that charge things and, you're making drones, and all that stuff, but it feels like it's time for the next generation of PCs to happen again. - It's fair to say we do experiment with things. But I would say the magic that we have in our engineering capability when married to our customer's engineering capability, is we bring practical innovations that can change or allow people to use computers in new ways, but also can scale into the market. - Now, Intel's real goal with making all these prototypes is to create something that's actually possible for an OEM to make and it'll actually get sold on the market. Now, Tiger Rapids was one thing, but the next thing is this. A dual-screen device called Copper Harbor. It's a cool prototype, but it's also really prototypy. The software is more proof of concept than actually usable thing. - In Copper Harbor the whole idea is to have two symmetrical screens of similar capabilities coming together and that opens up a completely new landscape. - Okay, two screens, but if I want to use it as one big screen, like it's just like a, I don't know, a tablet, I could open up Excel here, Excel pops up and voila, we've got 46 rows. One other demos you showed me was PowerPoint. - You have the speaker notes on one side and you're presenting on the other side, so you could be presenting this to me, so this is showing the use case of having a Tiger Rapids like, but much more powerful because this whole side is color. - Why is this better than just having a big old tablet with two windows open? - The whole idea is that it can fold, it can be a portable device, - Right, okay, sure - multiple modes like for example, you couldn't do the temp mode on a tablet. Of course, the tablet has its own capability that, until we get screens which kind of span across, you know, there are benefits of the tablet, as well. - Right. And I guess the other thing, not only does it fold up smaller to carry it, but it could also fold this way so that you've got a nicer reading experience or something. - [Murali] Yeah, yeah. - Whether we actually see this dual-screen thing turn into an actual product, is still an open question, but if you want to know what Intel thinks the future of PCs looks like, it looks a little bit like this. - We have driven the thickness of PCs to single millimeter thicknesses, I mean, super thin. What's gonna happen is as you carry your thin machine around, you're gonna be able to use it more, and more, and more, to do the things you want. You'll have the different surfaces, you'll have amazing screen technology to do, not only screens and keyboards, but you can imagine other things you can do on a second screen. - After everything that I saw at Intel, here's what I think its idea of what's next for the PC actually is. That they're gonna look and act a little bit more like phones. That you're gonna be more willing to carry them around with you wherever you go. Intel, it missed out on the first 10 years of smartphones, so now it has to be hyper-focused on what it's good at, to make sure that it doesn't miss out on the next interesting thing. And you know what that might be? Computers. Hey everybody, thanks so much for watching and let me know, would you use a device that has a screen here, another screen here, and then it folds and folds the other way? Let me know on the comments, and if you want to know how to actually use all of the weird technology we keep talking about, we've got a great tip series called Workflow, you should check that out, too.",
    "transcript_keywords": [
        "Intel",
        "seemingly simple question",
        "Tiger Rapids",
        "thing",
        "things",
        "question",
        "seemingly simple",
        "Intel makes computers",
        "screen",
        "side",
        "stuff",
        "product",
        "Google has Chromebooks",
        "idea",
        "PCs",
        "Tiger",
        "Rapids",
        "Tiger Rapids prototype",
        "Intel CEO",
        "Intel computer"
    ],
    "transcript_entity_values": [
        "The Client Experience Center",
        "CES",
        "LCD",
        "one",
        "Tiger Rapids",
        "Spectre",
        "Murali Veeramoney",
        "Windows",
        "Vont",
        "Tiger Rapids",
        "Google",
        "90%",
        "Copper Harbor",
        "California",
        "the first 10 years",
        "iPad",
        "Ultrabooks",
        "Excel",
        "Veeramoney",
        "46",
        "a few months",
        "the Lenovo Yoga Book C930",
        "two",
        "Motherboard",
        "the past couple of years",
        "a garbage year",
        "One",
        "Murali",
        "July",
        "January",
        "later this year",
        "second",
        "Workflow",
        "Lenovo",
        "Microsoft",
        "Surface and Apple",
        "Mac",
        "Intel",
        "PowerPoint",
        "Santa Clara",
        "Tiger Rapids"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "LOC",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "LAW",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "GPE",
        "GPE"
    ]
}