{
    "id": "df4gwAJRf2M",
    "title": "Twitter blue check chaos and CarPlay squabbles",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-04-07T17:33:30Z",
    "video_url": "https://www.youtube.com/watch?v=df4gwAJRf2M",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "gadgets",
        "carplay",
        "apple",
        "android",
        "auto",
        "general motors",
        "tesla",
        "infotainment",
        "twitter",
        "elon musk",
        "verified",
        "mastodon",
        "blue",
        "social media",
        "chat show",
        "spotify",
        "audio",
        "music",
        "entertainment",
        "amazon",
        "prime",
        "subscription"
    ],
    "views": 5330,
    "likes": 152,
    "comments_count": 27,
    "description": "The Verge's Nilay Patel, David Pierce, and Alex Cranz discuss the end of Twitter, the future of infotainment, and more.   Vote for us in the Peoples Voice Webby Awards for Best Technology Podcast:   00:00 - Intro 00:32 - Color quiz 05:31 - Twitters blue check drama 31:22 - Spotifys next move 38:35 - GM kills Carplay and Android Auto on EVs 55:47 - Walmarts redesign 59:13  - Amazon and Prime Videos faults 1:07:37 - Asus April Fools 1:08:47 - Sonys next handheld and PSVR 2 1:14:27 - Foxconn in Wisconsin update  Links: The color quiz:  Elon Musks obsession with blue checks is a verified problem:  Today in Twitter: where are the retweet labels, and why did Doge replace the bird?:  Spotify shuts down its Clubhouse competitor:  Spotify shows how the live audio boom has gone bust:  Everybody hates GMs decision to kill Apple CarPlay and Android Auto for its EVs:  The rest of the auto industry still loves CarPlay and Android Auto:  GM is cutting off access to Apple CarPlay and Android Auto for its future EVs:  Could a new PlayStation handheld be built for Remote Play?:  Asus ROG Ally handheld gaming PC is no April Fools joke:  Walmarts redesigned website looks better than Amazon:  Donald Trump was arrested, please like and subscribe:  The Home Assistant SkyConnect is a combination Zigbee and Thread dongle for better smart home control:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Shop The Verge's merch here:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Read More:  Community guidelines:  Wallpapers from The Verge:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:",
    "description_links": [
        "https://vote.webbyawards.com/PublicVoting#/2023/podcasts/general-series/technology",
        "https://www.theverge.com/c/23589074/color-quiz-test-facebook-reddit-twitter-netflix",
        "https://www.theverge.com/2023/4/4/23668722/elon-musk-twitter-blue-checkmark-verified",
        "https://www.theverge.com/2023/4/3/23668356/twitter-doge-bird-logo-retweet-labels-following-timeline",
        "https://www.theverge.com/2023/4/3/23668533/spotify-live-clubhouse-competitor-shutdown",
        "https://www.theverge.com/2023/4/4/23670193/spotify-live-shut-down-obamas-audible-amazon-jay-shetty-iheart",
        "https://www.theverge.com/2023/4/4/23669523/gm-apple-carplay-android-auto-ev-restrict-access",
        "https://www.theverge.com/2023/4/3/23667793/gm-carplay-android-auto-ford-volvo-honda-response",
        "https://www.theverge.com/2023/3/31/23664814/gm-ev-restrict-apple-carplay-android-auto-google",
        "https://www.theverge.com/2023/4/5/23670943/streaming-playstation-handheld-rumor-vita-remote-play",
        "https://www.theverge.com/2023/4/1/23666084/asus-rog-ally-handheld-windows-gaming-portable",
        "https://www.theverge.com/2023/4/4/23669383/walmart-website-redesign-amazon",
        "https://www.theverge.com/2023/4/5/23671490/donald-trump-protest-arrest-content-creators-influencers-truth-social",
        "https://www.theverge.com/23641940/home-assistant-skyconnect-thread-matter-zigbee-smart-home",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "https://shop.theverge.com/",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://goo.gl/XTWX61",
        "http://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com"
    ],
    "transcript": "Hello. Welcome to The Vergecast, the flagship podcast of not knowing what color Spotify's logo is. I'm your friend, Nilay. It's so hard, so hard. Uh, Alex Franz is here. I'm not colorblind, but I think I might be after the color quiz. Yeah. David Pierce is here. Hi. I got the first four right on our color quiz and was so like absolutely outrageously proud of myself, and then I think got the next three wrong and have not forgiven myself for it. It's not great. So it's Design week here at the Verge. It's got a great package. It's super fun. We've got pieces on ui, we've got pieces on the, like how the logout button on website works, or more importantly, doesn't work. We've got pieces on accessibility and design that are coming. That's very exciting. But the highlight of the whole week was our color quiz. Uh, which is designed by our, uh, associate creative director, Chris Raske, who's a genius, our engineer, uh, Graham, who is an evil mastermind. And it's ma it's just made to torture us. And all you're supposed to do is you open it, you see five shades of blue and you gotta pick the one that's the Facebook logo. And the, the, the thing that makes it evil is that as you roll over each of the shades of blue, there's an actual Facebook logo that changes. So then you just sit there arguing with yourself, cuz every one of them looks correct. Well, the Facebook one's also like a cheat because there's like an old Facebook color on there. So you're like, that's the one because you haven't checked Facebook in 10 years. Ivan taking this quiz over and over again all week. I've, I can't get better at it. The only one that I get consistently is Snapchat. I'm very good at yellow. Yeah, just, just. Well, so, uh, the only app on my phone that Max wants to use is Snapchat, but she can't, she can't read. It's, and it's cuz she's four. That's an important She's four. Don't worry guys, it's so, she just calls it the ghost button. Yeah, she's, I mean, it's perfect sense. First of all, unbelievable product idea for Snapchat to sell something called a ghost button. I don't know what it does. She'll just pick up my phone and be like, ghost button. And I was like, and then we just do the filters so I know what that one looks like. Yeah. Yelp. No, no, no idea what color Red Yelp is. And there's actually, there's science in the quiz. If you haven't taken it, go on the site, do the color quiz, it will drive you bananas. And then with a sense of smugness and superiority, go make other people take it. Yes. Uh, there are people on our staff who have gotten them. All right. Uh, we, over 20,000 people have taken this quiz so far. I think it's up to 50,000. It's up to 50,000. A lot of people have taken this quiz. Uh, and like you can see the scores they normalize like around 4.5. I got six. The second, the first time I did it, I got four. Oh my God. The second time I got six and the two I got wrong. I was like, that can't be the color. I'm gonna pick this other one. And it was the color. So I feel like I could do, do eight if I just practiced. C. C, yes. C. Just keep doing it. David, how'd you do? Uh, I got, I ended up with six out of eight. Um, Yelp was the one that I got to and was just instantly like, I'm not gonna know this one. This isn't gonna happen. So I just basically like closed my eyes on hammered or shade of red. And that was that. Um, the one I got wrong. That I'm furious. Like I, I can still, you know, picture the moment when I got it wrong with Spotify. Uh, and I was down to two shades of green and my, my rubric was basically like, pick the second best looking one if I don't know which one it is. Because usually there's one that's like simple and clean and chill and like no tech company's ever gonna choose that one. So you pick the, the second chillest one and that's usually the one. And it served me really well, except in Spotify's case where they just went like full bonkers, neon and it just is supposed to hurt your brain. Yeah. Spotify. Yeah. Spot and Lyft. Go take it. Go look at Olive of Design week. It's super fun. It's great. Sarah has a piece about the poop emoji in legal filings and how it's breaking database systems across our country's court system. V. Very good. Like cackling. When I was reading it, um, we got one about the shuffle button and then we, we were doing this big partnership with the Computer History Museum about the history of the Lisa. So we just had the Apple Lisa, the precursor to Macintosh. It's super cool. Go watch that video. Go read that piece. All great design week happening. Go look at it. Take the color quiz, fail at the color quiz. Tell us what you got. Tell we want to know. Well, the reason I want more people to take it is right now the audience average score is higher than the Verge team score, and I feel like if we can just get more people to take it, We, we, the staff can outdo the world. I, I think everybody's cheating. I think everybody's like going and like they've got it on their phone. They're holding their phone up next to it. Oh. Whereas we didn't, we took it the real way. Yeah. We all had to take it on camera in a conference room so that we could make like marketing videos for it. It's v My favorite was someone on our team who I won't name, uh, said in Slack, cuz we were all talking about it. Like, oh, I didn't do very well. But then when I got to be on a monitor with a better color gamut, I got, I did better. And it was like, oh, okay. My controller's broken. Yeah, exactly. Must have been the lag. I don't know. Yeah. All right. Go take the color quiz. Look at Design Week. A very cool, uh, situation on the verge.com this week, speaking of the Verge dot. Uh, a story that we've uncovered. This is the worst segue in the podcast. Where's the showing? Speaking of websites that start with the letter T. Twitter is kind of a disaster this week. Much better, much better segue. It's not great. It's what we're doing. Uh, Twitter had a very hard weekend. Mm-hmm. I would say, uh, in the context of Twitter's other weekends actually not that hard, like equally bad. Yeah. Uh, but this is the weekend they, that they started turning off verification. Have you, have you been deified? No. Same, uh, there was a rumor going around that if you blocked the verified account on Twitter, they could not deify you. I, I did it just to see if that'll happen. I was like, I got nothing to lose. Um, but like David, the, the actual mechanics of unifying and then what they actually did, None of it seems to make any sense. No. So what turns out to be the case, there was some really good Washington Post reporting on this a few days ago, is that essentially there's just like a database of all the verified people on Twitter. You would think this is like a, a thing that lives inside of the app that is somehow sort of controllable and understandable. It's really not. It's like somebody just went and like pasted a, a picture onto your profile and then like wrote down in a line of a spreadsheet. I pasted the picture onto their profile. Uh, it's slightly more technical than that, but not much more technical than that. And so what that means is what seems to be happening is there is no way to sort of systematically find out and remove verification. So simultaneously what has been going on is. The whole idea of paying $8 a month for Twitter, blue has become deeply embarrassing, which is what we've talked about on this show and called it. So yeah, you did like you, you who have been right about that. So the, I'm so worried you're gonna be right about the other thing. I am, I'm gonna win that bet. Monica. Liz, get ready. I'm ready. We're not talking about this now. Just listen, we this, a lot of things happened while I was on leave. Put her back now and we can't do this anymore. Alex. It's coming. Just kidding. Alex thinks Elon's gonna tweet a don. I just, let's be clear. That's what she thinks is gonna happen. It's, it's every day we get a little closer. Anyway, Alex, victory lap one blue, check mark of shame. Go ahead. Continue to uh, so being verified is now bad if you've paid for Twitter blue. And also they can't unverified people. So it's become this messy thing where they've actually changed the message on verification to, they either paid for Twitter blue or are a legacy verified account and. There's no real indication if that's sort of the end state or if it's gonna change. People have come up with chrome extensions that will show you, which is which, like there's one script that replaces the verified icon with the nerd emoji if you paid for Twitter Blue, which is just wonderful. And so it's gotten to this point now where this, there's, it's just a disaster, right? Like the upside of paying for Twitter blue is that you get. Play you get shown in the for you page, you get, uh, supposedly up ranked in replies and things like that. Uh, so it's literally just a mark of thirstiness and so there's no reason anybody would pay for it. And so you've had people like LeBron James say, of course I'm not gonna pay for Twitter blue, which is a terrible look for Elon Musk in Twitter. Uh, you have folks like the New York Times who have said there was a big round of media organizations talking about whether or not they're gonna pay for Twitter blue. Uh, and then Elon Musk Vindictively was like, well, then we're gonna take that away from them. So he took off the blue check for the New York Times, but not a bunch of the other New York Times accounts. So it's just some of which, by the way, some of which have gold checks, whatever that is. Yeah. So the is my, here's my understanding. In this disclosure alert, we run Twitter accounts. I yeah, sure. I dunno what to tell you. We're all verified on Twitter. Yeah. Dis disclosure. I, I have a phone. It contains all the apps. I use them all. We have accounts to pay for Twitter, blue Be honest. I did not. This is a safe space. No. So I paid for old Twitter Blue. He paid for it. I paid for old Les Patel. Paid for it? Yeah. Reckless Patel paid and then got banned. My, my Doppel gang got, uh, banned for impersonating me. Even though that person was Alex who's sitting right here. Um, uh, what? It's gone now. It's gone. It's all gone. Amazing. Alright. Truly, truly wonderful. Um, so we run Verge accounts. Yeah. The Verge has an account. We verge reviews, verge Science. We got a bunch of accounts. What we were told, and I think has become publicly disclosed by Twitter is that if you were one of the top 10,000 followed accounts on Twitter, you got Twitter blue, you got a check mark for free and you have to like use the API tools and then you could like have five affiliated accounts. But then if you weren't one of those and you paid for it, the affiliated accounts got like gold check marks. And then like icons next to them. Too much very unclear. Like how it actually works. So the times, some of their accounts have gold check marks, which means they're affiliated with the New York Times, but the New York Times does not have a check mark because Elon's have added them. Perfect. I don't know, man. Like all that's crazy. So we, the Verge accounts are affiliated. They're in it something, something something. API usage rules, something, who knows it will change tomorrow. Our poor, like audience director Ruben, is just like beside himself every day. Softly weeping what's going on. Um, and then the other piece of the puzzle, as far as I understand it, is like he's just adding labels to things like NPR saying your state affiliated media. Yeah. And you just get, there's just. There's a conference room, a Twitter headquarters that's been stripped to furniture cuz he sold it all on eBay and he is just sitting on the floor like adding and removing labels from people's Twitter's account. There's an air mattress in the corner for some He has added beds. Yeah, there's beds. Like people are living there. Yeah. And he's like, he's like, I don't know, make it the Doge icon. It's actually good. Like there's a part of it that I love. Yeah. Which is what if you were allowed to screw the major social network? It's like, yeah, I would just do whatever he wanted. And he did. I mean, it, it is sort of fun to imagine like what he would do differently if he were trying to kill it as fast as possible. Like, would, would any of his moves change it? No. This all seems so destructive. And the thing is, like the Twitter blue stuff is, is silly and funny and whatever. And like the changing the Twitter icon to the doge icon is like whatever. Ultimately I have no feelings about that. It, it's, it's sort of hilarious and doesn't really matter at all. But like Twitter blue is the. O overwhelming favorite to be the future of Twitter. If Twitter has a future, like it's ad business has tanked, its usership is going down. Like Elon Musk has said over and over, he has like big weird banking ideas that he won't let go of. But like fundamentally the way Twitter is going to survive, if it's going to survive, it's to get a lot of people to pay for Twitter blue. And basically all that has happened so far is paying for Twitter. Blue has gotten deeply embarrassing and no one who ha has any actual like reputation to protect will do it. Like there was somebody who was tweeting the other day, like imagine if you had a platform, imagine what it would cost to get LeBron James to provide content for you. And imagine if by some crazy miracle you had done that for free. Imagine then what would happen if you just systematically drove him away. Yeah. For $96 a year. It was a very good tweet. It's a good tweet. We'll, we'll find it and put it in the show notes cuz it's, it's a good tweet. Uh, that is the part to me, and there are arguments that I've seen from people I respect. It's for paying. Right. If you run a small publication and you are paying and you get boosted in for you, sure. That might work for you. I've seen arguments from advertisers right now of small companies who are like, this is the most efficient advertising we can buy because no one else is here. Yeah. For eight bucks a month, it's worth a shot. It's us and then MyPillow guy. Yeah. No, not even like, uh, not just Twitter, blue, like actually buying Twitter ads right now. Oh, interesting. Because they're so cheap. Cuz there's no, it's it's like you, it's you and the MyPillow guy. Yeah. Like's what you're doing. And so you can just buy a reach on Twitter as long as it exists. So there's, there's a dynamic there that's happening, but the more important thing that's happening, and we don't have to like talk about mask done because who knows. But the mo more important thing that's happening is anecdotally a lot of people I know are like, my engagement on Twitter has plummeted. Yep. The audiences aren't real. It, it's all just a bunch of people yelling about Elon all the time. Even there was the, the, you know, the Trump indictment this week. Like, it's quiet. There was a time when not being on Twitter during that day would've felt like a huge miss. Like all the actions unfolding on Twitter, and I was like, I just opened cable news. Like I, I'm, this is weird. Yeah. Like what a weird reaction to this day is like, I'm gonna watch cable news because Twitter isn't any good. Yeah. It was not, it's not worth it anymore. Yeah. It's like just kind of weirdos being angry about, I say that as somebody who's still on Twitter, I'm one of those weirdos. I count myself as one of those weirdos. But yeah, it's just people being vaguely angry about whatever's happening that day. And it like boils, Twitter's boiled down to like the most obnoxious elements of Twitter previously. With no real value added and then an Elon Musk tweet in every other slot on your timeline, because he demanded, I, I actually don't ever see him on, on mine. I don't know why. How is that possible? Maybe he blocked me. Maybe I blocked him. I don't know. A very funny thing that happened this week, uh, is that Elon is using the four UAB as well. Yeah. So he's just replying to ancient tweets. So he just replied to an ancient tweet from our own James Vincent about Bard and Bing citing each other. Yeah. And he just hit it with a lull. So like James woke up to an army of bots lull that follow Elon around the internet, repeating whatever he said, replying to like a tweet from two weeks ago, like a perfect encapsulation of the, of the Twitter moment. Do you think Alan's ever gonna realize that so many of his followers that he thinks love him and adore him are bots? Like we knew he, he's always had an issue with bots, but do you think he realizes that like what he bought was a giant bot network? Oh, he definitely knows. He bought, he tried to not buy it because of the bot networks, if you will recall. That's true. And now he's like, wait, they're the only, they're what I got. Uh, I don't want to, a, a big theme of the podcast today for the audience is, uh, the host assigning themselves stories that we've talked about and not yet published. So David, I don't want to get too much into what comes next in Masteron, but you and I have talked a lot about activity pub. We have, and you have promised me a story next week on this, so we can follow this up, but there's no yet there's no big competitor to Twitter yet, right? That's right. Every other social network is like, ah, what if we were TikTok instead? Yeah. That is kind of happening and I think it looks increasingly unlikely that Mastodon is going to be that thing like Mastodons scoring really fast. It's doing really well. I think anyone paying attention would say that Macedon is of success story, right? But it is like, Several orders of magnitude smaller than Twitter, and it's even having its own funny issues now because Macedon set itself up as such an aggressive counter to Twitter that now like if you're on Macedon, you're obligated to call Twitter the bird site. You can't even say Twitter. You just say the bird site. And if you, if you acknowledge being on Macedon and on Twitter, it's like you've violated the spirit of Macedon and thus everyone will yell at you like it's, it's really become a thing that if you are a person who uses Macedon on Twitter, you are like unwelcome on Macedon. And in a really funny way, that is a huge problem for Macedon because it is supposed to be the place that is like, Better than Twitter. And instead it's just people yelling about Twitter, which is also what Twitter is like. We've accomplished nothing here. And so I think we're in a place now where I keep talking to people who are really excited about like the next phase of things, right? And I think Activity Pub in this whole idea of a decentralized internet and social ecosystem that doesn't rely on one platform and one person because we've seen what happens now, right? Like we, we all used to talk about, you know, what would happen if Mark Zuckerberg stopped being the c e O of Facebook and someone with less good intentions came in. That all seems like hilariously naive now in retrospect. But like we used to have those conversations and then it was like, what if a maniac buys Twitter and does insane stuff with it every single day? Like we know now, right? And so there's this big push towards. An internet and a social world that is immune to those things. But I think there was a brief moment where it was like maybe Mastodon is ready to take all of this stuff in. And for a big variety of reasons, including like discovery and identity and its own like toxicity. It's just not there. But I keep talking to people who are absolutely not put off and are like, fast forward 12 months from now and we're gonna have really exciting answers to these questions. So I hope so. Sure. So there's a difference there between Mastodon and we just had Eugene Rajko, the CEO of Mastodon, the protocol. On decoder. So masked on, there's masked on the company. Yeah, there's masked on the protocol. Okay. There's massed on social, the website. Mm. These are all different things. It's like Apple tv. Yeah. There's Mask it on Plus, yeah. Uh, max. Um, they're all different things. Yeah. David, when you say like, you can't talk about Twitter at MAs on, do you mean on mastodon.social because there's like 9,000 different servers? Yes. Well, and like welcome to the problem, right? It's like, uh, on Mastodon, where do you go? Uh, do you go to a server that is just like run by a. Dude with a server in his house, like a lot of people do. Uh, do you go to macedon.social, which is the one that is officially run by Macedon the company, but is so overloaded with people that it crashes all the time and they actually don't allow signups often. Uh, do you just pick one and then move later? Like we, these are questions you don't have to answer when it's go to Twitter and pick a username and the, the like workflow for like, I, I want to go to this new internet, where do I go? Uh, and, and like Casey Newton keeps making this point, which is like, people don't want to administer their own servers. And we're, we're kind of in a phase where doing this is not, you don't have to administer your own server, but you have to like know what it means to administer a server in order to use Macedon. And that's too much work. And so we're, we're in this interim phase where like Activity pub is a, is a protocol by which a lot of different. Tools can come up that you'll use the same follower graph, the same content, and build lots of different experiences, right? It was like, what if you could use your Twitter account to post Instagram photos? Like that's the future. That's where we're headed. That's what everybody believes in. Uh, none of that is built yet. And the problem with Masteron is that it just requires two steps. Too much work. And so the people who are mad enough at Twitter to leave are already there, and they're mad at the people who aren't mad enough at Twitter to leave. And so, uh, it just becomes this sort of self-perpetuating thing that like, until it gets easier, people are just gonna stay where it's easy. And overwhelmingly, that's still Twitter. Like it's hard to leave a thing even when it sucks, but it's probably like mastodons not gonna be the thing, right? I don't know. Well, what, what comes next? So there's, there's a universe of competitors, right? So Mastodon is the decentralized one. It is built on this protocol called Activity Pub. Right. That I will not shut up about. Yes. Like I've been running around the halls of this company being like, activity Pub Act like I love it. It's kick and making David write a story about it. Uh, there's something there like, uh, if you, and you just look at the universe of people who are building on it. Mm-hmm. Meta is building some sort of Twitter competitor that is built on activity. Pub Flipboard is all around Tumblr Activity Pub. Yep. We had Matt Mullenweg on Decoder. He said Tumblr and WordPress are gonna support Activity Pub, which is kind of wild to think about Tumblr like being a decentralized social network that can interact with mass. Like that's weird, right? Yeah. Um, Mozilla is gonna do something with it. Like you just see these companies, these like OG web companies and people be like, all right, we can tear the wild gardens down using this new protocol. And we'll talk about it more after David's story comes out next week, so I don't get the whole thing away. That's just cool. Yeah. Then there's like post news. Which is a Twitter competitor that is totally closed. And I think Care Swisher is on the board. They have a great proposition, which is that if you sign up for it, you use it, you see a New York Times article that you like, they've built microtransactions into the app to let you slide through their paywall. Okay. That's, that's cool. Yeah. That's cool. Like, that's a thing Twitter should have built ages ago and never could get done. Yeah. They're starting with that. Then there's a thing called Spout Audible, which I haven't used, I don't know Spout. Yeah. But people keep asking me about it, you know, in the way that like it's, that it's that moment it's like of, uh, evolutionary explosion, like Cambri and Explosion. Yep. Where people will just send me emails. It's like, will the Virgin gauge a spout? And I'm like, I don't know what that is. Are you a cop? But like, there's just like, but like a lot of sports people are on it and, and you just see like, okay, there's a bunch of new networks starting. Are you looking at it? I'm trying to, but you have to create an account, see, nevermind, and bounce right out. Uh, I, I just think it's really interesting to see this many new competitors because it's obvious that the thing is falling apart. Yeah. Yes. That's the best part of this. And the Doge e everybody, like overwhelmingly in the course of reporting this story, I have asked people like, why do you think this is the moment? Because people have been working on this idea of like distributed open social for 25 years. Like this is not a new idea. There have been a million attempts of it. Like, remember Jabber back in the day when you could put all of your IM clients into one app. Like that's this, that's the same thing you just talked to all your friends. It doesn't matter where they are. Like that is functionally the exact same idea. Uh, and we ran away from that because Google Talk got really big and Google said, well, we don't need to deal with X and ppp. And so they stopped supporting it and it all fell apart. Uh, and that is just what happens here. The Verge cast. Yeah. It's just what happens. And so I keep asking people like, why do you think this is the moment? Why is there so much excitement? And almost every single person, I can't think of one person I've talked to for this story who hasn't said, Because of Elon, because Elon Musk showed up and made abundantly clear to a lot of people how bad this can go and how fast and how ugly it is to have something that you've invested this much time and energy into fall apart like this. Like there's so many people, and I'm one of them who have stories about making friends on Twitter and like we all, you know, the real Twitter is the friends we made along the way. It's, it's a, it's a really important place to a lot of people and it's just crumbling in a way that I think is really painful. And so the pitch is now like, what if that can't happen anymore? And I think it's, it's sinking in for people in a way it never has before. It's just that the right product for it doesn't really seem to have appeared yet. Yeah. If you're listening to this podcast, you are almost certainly the sort of person that can deal with your own server just to guess. I'm making, it's not that. I, you, you've, you've probably got an ass, you probably have a plex server that you don't wanna tell the authorities about. It's okay. I support you. You're, you're using it to distribute Linux. Yeah, I know what you're doing. It's the best way to use it. Only Linux. It's all I share on my, it's open source. Open source textbooks and Lennox on Alex's Flex server. Look, you're probably the sort of person, you can figure this stuff out. You should start a master on account just for the experience of doing it because it's difficult. And then you should start a Pixel Fed account. Pixel fed is the activity pub Instagram. Okay. Same deal. You gotta find a server, all the blah, blah. And then you should. Posting from Mastodon to in posting from Twitter to Instagram is a thing you can do with those services, right? Yeah. From Mastodon to pixeled, from pixeled to Mastodon, you can make a pixeled post from your Mastodon account. Like that is, that's the magic, right? Yeah. And there's just something there, like once you do it, you're like, oh, this makes a lot of sense. And I know like usually we spend this entire show talking about AI and that's where all the hype is. But the, I think the thing that actually changes the nature of the social internet is somewhere in here. And then I promise we'll have a story about it next week. We'll actually talk about the actual story with the actual reporting. But like, I just like watching this week in particular with Twitter, where like the legacy thing happened, the Trump stuff having no impact on Twitter. Like cable news for the last decade has been people with great haircuts reading tweet. And it was beautiful. Was it? I loved it. It might have destroyed democracy. Just a little. Just a little. And to watch it this week and be like, oh, there's no, there's literally no loop here. Mm-hmm. It's like, oh, the thing is over. The vibrancy of the thing is over. I, um, I don't know when Aaron Rodgers gonna, the Jets. I dunno if it's gonna happen, but there's, there have been years of my life where I have one Twitter list that's just all the Packers beat reporters. And I used to check it a thousand times a day. And now I don't. That's actually a really good example of like, where are those people gonna go? Like, are we gonna lose that? Should we lose that? Are we are, does everybody go to Mass? Like, I don't know. Casey on Platformer wrote a good thing about this, like, why journalists can't quit Twitter. And like, as a journalist who quit Twitter, I'm here to tell you, like, it is possible. It's actually not nearly as hard as anyone thinks, but, uh, it, it, there is just something too, like as long as anyone is there. People are gonna stay, right? Yeah. And so I think it's gonna be really interesting to see what it takes, and I assume it's like some great product and some huge news event kind of in tandem. Uh, that might be that poll, but I don't know, like my, my sense is Twitter can be broken for a long time and we're going to keep having to talk about it because it's just really hard to leave. So Ben Smith, who is the editor-in-chief at Buzzfeed News, uh, and left to found, co-found SE four, the new news site. He's got a book out called Traffic, which is not out yet, but it's coming at me. He's coming out. De coder traffic is about Gawker versus Buzzfeed in like the early days of the internet. And he's got, it's great, it highly recommended when it comes out. Um, but he is got a theory in there that new, new sites, new properties come into form. There are opportunities that come into form during election years. Ooh, I like that. Right. So these, like Buzzfeed news was like rushed out for an election. I actually remember when I was@vox.com, we, we pushed it to hit the election. We like, that's the moment, like those cycles, there's lots of news, lots of whatever this is like, and if you just kinda like look at the history of the media, this is Yeah. Every four years for some reason a new, a new publication. Yes. Cuz they line up with elections. Um, cuz there's just like, there's two teams and they hate each other and you can't get them to talk shit about, it's like, it's just very easy. Yeah. Right. Um, and I just wonder if this upcoming election cycle is when you see a, a mass of like people moving to a new kinda media. So like it's, it's just on my mind that there's a thing happening. The one thing I wanna point out before we move on and talk about Spotify completely not knowing what it's doing, um, is uh, CK put out notes this week, which is basically they added a Twitter feed tock in the app. Ooh. That looks exactly like our quick post. Uh, on our site. And like the reasoning is exactly the same. Like sometimes you don't wanna write a whole thing. And I'm like, yeah, yeah, yeah, we made that. Um, but they're, this is the next move, right? Is to, if you talk to any subs, stackers, their biggest audience funnel was on Twitter. Like they, they monetize their Twitter audience with, and if that goes away, I'm not sure where the next generation of subs, stackers finds audience. Yeah, because they can't build it from like TikTok or Instagram. The idea of making a TikTok video that's like sign up for my newsletter is so bonkers. It would be like, can you imagine Casey just like dancing for dollars on TikTok? Just a little shuffle. So there's just a yawning need for a platform that's like Twitter, a text-based, real-time news platform, and someone's gonna fill it. And I think that's actually really exciting regardless in the, the chaos of Twitter itself is like regardless of the chaos of Twitter itself. Uh, but it's exciting to see this much activity in that space. Yeah, because there just hasn't been for a long time. But it's not gonna be masked on. I'm just gonna say it now. That's my, my third prog prognostication. So you got, I got, everybody's gonna think the blue check mark's dumb. Elon's gonna tweet his Don And Mastodon is not gonna be the true. What if he tweets his dog Enma Don, I'll pay you $20 because I'll just be like, oh my God. I feel strongly that we should take a break. I quit the podcast. Goodbye. We're gonna be right back. We gotta talk about Spotify. We gotta talk about what GM's doing with CarPlay. We'll be right back. Welcome back to the Verge. Uh, where we don't make bets about dogs no more. It's done moratorium on that. It's good. Yeah. It's a family show. Find your children. Don't explain what's going on. We gotta talk about Spotify. Yeah. So. In the pandemic. Mm-hmm. Spotify decided that it was all in on podcasts and that it was all in on live audio. Right. And then it is not, it's done, it's done with both of those. Uh, so Spotify bought this thing called, what was it, green Room David. It renamed it Green Room. Um, the app before it was bought by Spotify was called uh, locker Room cuz it was specifically about like live talk about sports was like their main thing. Okay. And then they renamed a green room. And they were gonna compete with Clubhouse, which is itself, by the way, just a hilarious statement. They were gonna compete with Clubhouse is now, with hindsight, a very funny thing to say. It turns out you could compete with Clubhouse and the thing that competed with a clubhouse was leaving your house was outdoors like any other room with people in it, competed with clubhouse, touch grass, look in the depths of the pandemic. I swear to God, the tech industry was like, all right, we've got 'em. Brains and vats, they're never leaving the house again. Software will eat not only the world, but the human population and they, they, they, and like I get it, we, we, I, we had a million versions of this conversation, like what trends are here to stay and what trends are gonna go back and most everybody bet wrong. And now all these companies are having layoffs. But the reason I wanna talk about Spotify in particular is their big bet on podcasts is shaky. Yeah. And then this big bet on live audio. Where you would just like open Spotify at the end of the night and talk dudes would be talking Mm. What is next for this company? Um, have they heard of music? Have they heard of like, like I think everybody just needs to go look at Apple Music Classical. Mm-hmm. And do that, like if Spotify did that and gave you more access to metadata and let you search and, and browse that way, that would be better than to spend all the money on locker room and rename it Green Room, which I presume is just Broadway show tunes. So I was reading the comments of your Apple Music classical piece, which was great. Everyone should read it. Um, and a lot of people in the comments were like, this is Roone. Oh really? Uh, and so if you don't know who Roone is, Roone is like a wild idea. It is a subscription based music player that has not music in it. So you gotta plug it into a title account or a, a lot of people use this thing called Cobas. Is this the one that like you use for your smart home? Yeah. Like people integrate it with smart homes, but it's, it's a music player, right? So you like plug it in a title, or if you have a big local library on your Linux distribution plus whatever, server, whatever, uh, it'll like read it all. It'll figure out all the metadata. It'll show you like lots of links. It'll reorganize the metadata. So like, okay, this guitar player in this song played on this song. Yeah. And like peop the, the thing people say is like, this is just a discovery interface. Like, I'm just like falling down the rabbit hole of music in a way that like, but you don't have kaza to like back up the falling down. Right. You gotta pay for, you gotta pay, you gotta pay the money. Source your music somewhere. Yeah. Yeah. You know, I spent like a significant part of my legal career defending kids who use Kaza. Thank you. They, they all lost. Oh no. I'm just letting you know these are not winnable cases. Yeah, and that's why Kaza is a hundred billion dollar company. They did it. Everybody. No, but the, the thing about that is, I, I, what I was gonna say is, what Spotify needs to do is stop thinking about itself as the audio company. Like that's what they've been saying over and over, right? They're not a music thing, they're about audio. And what it actually seems like needs to happen and where there is much more room for doing interesting stuff is to go all in on music. Like Spotify should take the fact that every musician has a link tree in their social bios as like a direct threat to Spotify. And like hundred percent if you wanna buy merch, that should be Spotify. If you wanna buy concert tickets, that should be Spotify like, There is no money to be made in licensing music to stream on a platform. There's a hell of a lot of money to be made in all of the other ways that artists make money. And that all sucks now, like everybody's mad at Ticketmaster, thanks to Taylor Swift, uh, buying stuff on the internet is a disaster. Everybody's merch stores are ridiculous. Like if I'm Spotify, I'm chasing the entire music industry much more than I'm chasing the audio industry at this point. Yeah. But I, but what Spotify wants you to do is pay them 15 or $20 a month and then keep all the money. Yeah. And the thing you're describing is like, what if other people made money? Right? Like when you listen to music on Spotify, some complicated set of algorithms assigns 4 cents to every artist that you listen to per string, whatever. And they've gotta give a huge chunk of your subscription dollar away when you listen to podcasts. That is not true. Yeah. Cuz they've already bought and ingested them. Right? Well they have like a weird relationship with the music industry, right. Because of the fact that, you know, they only get 4 cents for every song, but the music industry also owns a huge chunk of Spotify. Yeah. So they, so theoretically they could just go in and be like, okay, you're the new Ticketmaster, let's go. Yeah. I mean maybe Ticketmaster also owns all the venues. Yeah. Uh, this is a very complicated thing to unwind. I'm just saying if you look at Spotify's arc, right? Right. They desperately tried to keep more of your dollars by pointing you at audio that they already own they owned outright so they don't have to pay further royalties on or that other, that users are making for free. And things like, whatever Spotify Clubhouse Jr. Or whatever it was called, green Ram Green Room, uh, clubhouse Junior's really different. We don't, we don't talk about that here. Uh, I'm just saying like, I think Spotify is not in just in a shakier zone Yeah. Than any of the other big tech companies. Like we, we talk about the other streamer, like we, we'll end up talking about Disney and it's like war with the state of Florida and it's reorg and Netflix and all this other stuff. And they've all had cuts and they've like stopped spending money. Spotify is a streaming service. It's competitors are Apple and Amazon, which heavily subsidized their services and then they're in title Dear C, forget about title. Title, which is part of Block, which has like a research report that's like Block is built on fraud. Mm-hmm. Very good. Isn't that great? Uh, so yeah, it's just a weird, a weird moment for that company in particular. Yeah. And it, the, the same was with Twitter, right? It's the foundation of like an entire ecosystem and it's like, what if that one, what if this domino falls? Yeah. I mean the, the thing for Spotify though is I think because the music industry is so invested in it, It, it they just, they're, they can't let it fall. Right? Like, you let it fall and it's just Apple, Amazon, and YouTube own the music business. And that for the music business is like an abject disaster. So I, I would, I I have high or like geezer, like what if geezer just wins? Get it geezer. Like I'm in on that plan. It's all ro we should talk. So this brings me to CarPlay. Oh yeah. Okay. So everybody's favorite geezer consumption location. Only way I listened to Zer. Uh, well it's interesting, like, so GM had an announcement this week. Uh, very odd announcement. They released a fact sheet and then I think only Reuters like Reddit and like Reuters had a headline. It's like GM walks away from CarPlay. And we saw that headline and we were no, yeah, that's dumb. And then we acquired the fact sheet, which we published so people could actually see this was sourced cuz. It is such a bonkers thing to say that we didn't think people would believe our headline, so we like put the PDF in the story. Um, they're walking away from CarPlay Android Auto in just the EVs, and their reasoning is that the cars are computers now and that they want to do things like, have you used the built-in nav so that when you're on your way to a charging station, the battery's pre-conditioned so you can charge. Yeah, that sounds great. I wish they'd thought of that 20 years ago. Like, welcome to the party gm. I think this is the beginning. I think every automaker is gonna start to do things like this in five years. That's the public reasoning. Right? And it's like that reading the story, it was like that's the one thing they could think to say that sounded like a feature. And then everything else is just, we don't make any money from CarPlay and we think there's a lot of money to be made in not CarPlay. Right. Like how, is there any other way to read this than that? Yeah. Patrick George did a great piece for the site that was just that he went and spoke to a lot of people and they're like, oh yeah, they just wanna make money. And so they're gonna, they're gonna kill it so that they can like, yeah. The future of cars is no steering wheels and you're shopping all day in the car. Yeah. Or looking at ads while you like stream movies or whatever. Like just like Minority report. I have been to enough ces, future of Car. Panels where they're like, soon we will reclaim the time you spend commuting. And it's like, oh, awesome. For what? For literature, for art and like for advertising and e-commerce, it's like, oh, that's not what I thought. 30%. It's like to improve the human condition. And it's like, no, no, no, no. Shopping Candy Crush, uh, candy Crush. Uh, so yes, I think that's what Jam wants to do. I do think there's some valid stuff in there, right? If you make a self-driving car and you don't control the navigation system, you almost certainly have a problem. Are you saying this because you hate CarPlay and you wanna support big, big. Yes. I love big car. Big car. The big car's my favorite, you know, a big car. Who doesn't love a big car? Yeah. Um, my parents, by the way, refer to our cars as small, medium, and big. Yeah, that's, that's my mom's like, can we borrow your medium car? It's a real thing that happens. Oh my God. So much. It's very good. Um, uh, no, I, I think CarPlay is bad. Like, just to be clear, I, this is my opinion. CarPlay is bad. It is superior to have the radio on the bad infotainment screen and then mount your phone. Using a MagSafe charger. We'll put an affiliate link in the show notes. This is my white whale. It's like the world's best MagSafe charger. If you make a new one that's be like 5% better than what I will buy it in a heartbeat. I will spend $70 on a new MagSafe charger for my in one second. I'm imagining like, you know the people who have like McDonald's boxes all over their cars. That's just you with MagSafe chargers. You like can't get in the passenger seat. Cause there's 200 MagSafe chargers. It's a perfect impulse by gadget. I swear to God. Because if you, cause you can always make it 5% better. The magnets click a little harder, the charging's a little faster, the mount's a little smarter. And you put the map. My phone is almost as big as the infotainment screen in my car. How, what? What year is your car? Uh, Raptors of 2020. Okay. And that's a tiny little screen that's before the new big screen. Okay. So that one is like whatever. Yeah, like that's sync three. I've sworn on blood oath that I will not buy another Ford until they go to the Android based system. I'm like, I can't have more sync in my life. It's real bad. It's not allowed. This is the point, right? Like the CarPlay is bad, except that it's so much better than everything that any car company makes. It's not, it absolutely is not better. Yes it is. It is way better. So I've got, I've got a Mazda CX five, and I know every single time I forget to plug my phone in, cuz I'll be like, I'm just gonna call someone. And this robot voice is like, who do you want? Hello? I'm like, the hell are you? Yeah. I dunno what you're doing there. You can. I'm just saying. So, uh, they're all small screens except for our new Jeep, which is an Android computer and is basically like a tomagotchi. Like I have to go into the garage every night and be like, are you okay? Who's petting? And we like this better than CarPlay. Just to be clear, this is an improvement on just plugging your phone in and everything works fine. Do you know, uh, consumer satisfaction with car infotainment systems has been going steadily down since wireless CarPlay was introduced because it's so unreliable. That's what Monica was talking about this when we were having a huge argument and I was telling you, you were both wrong for hitting CarPlay because she had it wireless and it kept like disconnecting and she'd be like driving and it'd be like, where are we going? And she'd be like, where You should know. Right. And so integrated is better than weird, fragmented. Yeah. I'm just telling you. It is superior to mount your phone and the car using a i, I should just make a wireless MagSafe charger at this point. It's superior to mount your phone. Put the map on there. Mm-hmm. And then do your audio on the regular cuz you can deal with it. You can get through it. We just, we just need a little slot and you just, you can even Bluetooth. Yeah. And, and it just projections your phone. Yeah. Just done. Anyhow, the reason I'm doing that CarPlay horrible and I'm correct. And I don't know what any anyone wrong, wrong. It's not good. The only thing you wanna do with it is show your maps. Are you so excited about having the one app for music that exists? No. Cuz I'm gonna stick my phone on the dash and it's gonna start charging through the power of magnetism. It's gonna be awesome. Every time you can't stop me, you're arguing for more Dons Steve Chevy. What are you gonna do to my house? Arrest me. He's getting, pull me over. Cause I, he's getting into small car because I use the blinding power of magnets to overcome your stupid infotainment. No, I'm gonna do whatever I want. You can see. Well make your point, David. Let me just make sure I understand. So what, what you're arguing is I would like to get in my car, I would like to attach my phone to an incredibly powerful magnet, and then I would like to plug my phone in to some thing. No, it's just the magnet is there. It's charging. Are you listening to music out of the speakers of your phone? No. With Bluetooth into the car, James's gonna still let you Bluetooth into the car. Okay. So you're playing your music over Bluetooth, you're steering wheel controls to control the music player, and you got a map on the phone and you're not stuck in some weird projection system. Mm-hmm. And you've got two. What Vergecast listener does not want two screens going instead of one. What if I had one small good screen and one big bad screen? Like what a, what a cool future that is The Mercedes experience. Uh, I don't know, man. I'm just saying CarPlay is not great and Apple's dream that it would colonize all of the screens in your car is hitting reality. Remember last year at WWE C where they're like, here's the future of CarPlay. Yes. And they showed all the logos and all the car companies, like, uh, they were like, nuh, what are you doing? It's, uh, about to be a year later, no car makers have announced any plans to support that version of CarPlay and GM's like, actually we're not gonna support CarPlay at all, cuz we need to take the screen back because this is where people will shop in the future by giving it to Google. Yeah. Like they're just gonna make something crapp. Like all of the other systems, you're still using your phone when you use your very powerful magnet because the system behind your phone is garbage. They're all garbage and CarPlay just a little better. And I really, no, it's not. It's, but like GM's not gonna do better. They did q your car infotainment in the best case scenario now is like a four year old Android tablet. Like, congratulations on the four year old Android tablet. So the, the arguing that I'll, I'll give, I don't own a Tesla. But every Tesla owner has already experienced this life, right? Where like there's no CarPlay integration. They've asked for it, but Tesla's like, this is the future. We want to control your experience in the car. Mm-hmm. We're gonna put games on here, we're going to do over the year updates every day. Every automaker thinks that's their future too. Whether or not they can execute at the level that Tesla is executed remains to be seen. Yeah. No, like I think it makes sense. They all wanna do this. They're doing the exact same thing TV makers did where they're all like, we're gonna own the the home and we're gonna put our smart TV in. And most of 'em have been like, this kind of sucks. Yeah. Go buy a, I'm just saying the outrage about GM walking away from CarPlay, if you just look at CarPlay itself, Mm. It's kind of bad, but that's, that's the thing, like the fact that CarPlay and, and there have been all these stats that say like, 80% of people won't buy a car without CarPlay. It's not because CarPlay is magical software. It's because everything else is shitty. Like the, the, the thing about Tesla is like Tesla has people who make good software and has a decent reputation for making good software. And a lot of Tesla people still want CarPlay, but at least. Broadly works, right? Like it's pretty good software, right? The the, there is nothing in the history of the auto industry to suggest that they know how to make good software. They didn't know how to make good simple software. Like when, when all the software had to do was change the radio station. It was horrible. Yeah. And now I'm, I'm supposed to assume that these companies are just gonna turn around and figure out how to make it like car plan Android Auto worked because they were so bad at making software in cars. So they just came and said, well, we're just gonna show up and go over the top. And like, what, how, is there any evidence that that has changed? One of the car makers is doing like Akm, morphic one, right? Didn't, didn't they all invest in like Epic? No. Yeah, no. They, they all run Unreal Engine now. So the new, uh, the new Mustang Uhhuh, which is still. Why, but like, uh, the, all the graphics in it are unreal engine. There's like, uh, uh, Rivian or Unreal engine, but it's such high res sync. Yeah, it's so high res. Too hot. I mean, it looks beautiful and you're like, is this the new Android system that you announced like over 18? And they're like, no, it's not, sir. It's garbage. What is It's like hot, hot garbage. Uh, it's, look, Q and X will never go away. It's gonna be in Fords forever. Um, they did announce an Android based system. They're supposed, it's supposed to come out. Yeah. No one knows when it's coming out, but it runs Unreal Engine and that's all the graphics. Rivian run Onal, engine T There's tons of that going on in the auto space because they know that when they move to ev drive trains, the actual difference in driving a car will be nil. Like they, they, they cannot make it ver they all the cars are gonna kind of be the same. Yeah. Is that why they're all making such futuristic looking designs to like, because they have to loudly exclaim, this is a new kind of car or else no one will notice. Yeah. And put the little hemi speaker in. So it sounds like a hemi. Yeah. That's my hemi impression. Uh, that's not, that's the wrong sound. That's a Honda impression. And, uh, the Hemi, you should, the frat Xanax speaker and the new, uh, charger, the EV charger or whatever is no ev challenger. Yeah. Uh, it, it's like rumbles. Yeah. It's like a dinosaur. Sounds, I can't get that low. Like my, that low. You're like, uh, anyhow. Yeah, they, they're doing it because this is their opportunity to break from history. Mm-hmm. And they know, they're like the ev buyer wants to feel special. EVs are more expensive and they have to be more expensive cuz the margins are lower on these cars cuz they're invent, they're full of new technology that hasn't been proven out. And then they all think we're all gonna not drive and shop in the car. Like, I promise you every auto CEO is like, I can't wait for people to start shopping in their cars. On our screens where we take 30% and like the C of BMW is like, and soon you'll subscribe to your heated seats. And they're, and people hate all of that. Yeah. No one likes it. Like, like Apple. Apple was, has the benefit of being first movers and the, I'm gonna bake a big technological walled garden and all the car companies are now like 30 years later saying, we're gonna do it too. And everybody's like, no, that sucks. Yeah. Yeah. We're just heading back to the early days of cell phones where everybody had their own operating system with their own app store, with their own brand new ideas about how to do absolutely everything. And the weird thing that's different here is they're all picking Android, right. It's fair because it's easy to build on. Well, but it's like weird. So like the GM system is Google built in? Mm-hmm. So it's not a hundred percent clear if the thing is Android. Yeah. Like the operating system is Android, but the navigation is Google Maps. Is it gonna have like play store in it? Ooh. D dunno. Like is it, is it Android? Like Huawei is Android or is it Android? Like So my Jeep is Android. Like Huawei is Android. Yeah. And boy does it show, boy is that obvious and that's bad. That's like not a place to go. Like they're very proud of it. Getting three guys who just graduated from college to build your entire car, infotainment system seems like a bad idea. And that's kind of the sense of what I get from all of these, these attempts, right? They've all forked Android in some way, or they're using qnx and Google is there to be their mapping provider. Yeah. Or there's Android Automotive, which is Google's the whole OS of your car, which is like what Poll Star uses. Mm-hmm. But just in response to David, they're all picking Google services. So Google is colonizing more of the auto. Whereas Apple is like, what if we do all the screens for you? Same with TVs. They did the same thing. Right. None of the TV makers wanted to, they all wanted to build their own TV stuff and then one day they said, oh, Android does it good enough, and then we can still slap all our logos on everything and, and pop it out and yeah. That's what they've done. So Android's just doing that again for a new market. Yeah. It's like, it's hard to see consumers don't change their cars enough. Right? So it's like that market's just moving way, way, way, way slower. Yeah, because it's like every, what? 10 years? I don't know. Yeah, it's, I just got this car. Who know? Have it forever. Forever. Have you gotten a mag safe from Matt for yet? No. I, cuz I, I plug in, oh my god, with the lightning and then I throw it in my mic. I'm just gonna get, I've got like a drawer full. I'm just gonna get you one, you one, bring me your second best one. You can keep your best one, but bring me like your second one. The idea that I'm giving you my best one. It's like completely off the table. Alex, I don't even know why you, you open that door. Just to suggest that I give you the best one. I just like, Uh, how are you gonna convince me? Otherwise, I really need to feel that snap. It's very good. Oh my God. Oh, the good. A good MagSafe click. It's very good. Um, anyhow, yeah, this is, I'm telling you by the by at ww d c. This year, apple will say nothing about CarPlay. This is my prediction. Okay? Because it has gone nowhere. It's all, it's all me headset talk. Anyway, and then this time next year, two more automakers will have dropped. Phone projection. Mm. That's my another prediction. I can see it. That's shit. No. Dons inside. Glad I bought a car already. Yeah. My bets are better than you. All right. We gotta take a break and we got a little bit of a lightning around. There's a lot going on in the sliding round. We'll be right back. All, we're back. What I just realized, at some point on the Vergecast, we're gonna do an entire segment about ne Eli's favorite MagSafe chargers, and I could not be more excited about it. Right now, I'm on Bekin, like I've got a mofi one in the, in the truck Uhhuh. No, I don't, don't, I have a moment. One in the truck. I wanna just hear the click. I want you to do a whole segment where you just click 'em all against the microphone so we can really hear. Oh, that's really good. Andrew Producer. Just instantly green lit that segment. Absolutely guaranteed. Done so the, the truck is weird cuz there's not a, uh, cigarette port, a power port. Yeah. Close enough to it. It's just a weird situation. So I can use the moment ones which aren't actually chargers and moment uses stronger magnets. Ooh. And they're very proud of their stronger magnets, which are not mag safe approved. So if you get in a car accident, your phone probably isn't twirling around. All the metal in your car is just gonna attach to the machine. It's very good. Welcome to the third segment of the Vercast, where we just continue the previous segment about how cool magnets are. Uh, mag save is legitimately my favorite feature on the phone. Is that your lightning? Have you done the thing where you hang the puck in your bathroom yet next to your mirror? No, you gotta get a max safe. They're like five bucks in Amazon. Like a, I live in a small apartment in whatever New York City. Just hang the puck on the mirror, and then when you're like brushing your teeth, you can like have YouTube TV open. It's great. I'm all right. All right. Okay. I'm, it's like, it's the best thing you can do. I'll believe you. All right. I believe you. In my heart. I'm never gonna do it again. As a person who has a five-year-old in their house, I'm like, this is my me time, baby. I'm like, just like rocking and rolling. Close the door, watching TV in the bathroom. All right. Lightning round. David, you start. Sure. So, uh, I had two. Um, we'll do, they're both fairly quick. Uh, the first one is that Walmart rolled out a big redesign of its website, um, because Walmart, Which I have been proclaiming is a secret like sneaky tech giant and nobody realizes it, uh, is now a drastically better looking website than amazon.com, which, yes. Uh, a very funny thing that happened this week was when this news came out, everybody sort of all at once had this moment on our staff of being like, wait, Amazon is ugly. Like what a bad website amazon.com is. And uh, we've all just been sort of slowly like frog boiling and water to amazon.com and we just didn't realize it's a hideous website. And then Walmart, which used to be a like roughly equivalently hideous website, came out and said like, oh, we care about curation and we're gonna make things look a little nicer and we're gonna use like colors and the names of things aren't gonna be 65 words long. And we're gonna have like a, a thing that actually makes sense for shopping. And everybody's just like, oh, Amazon sucks. And that was my favorite part of this whole thing. It was like Walmart did a redesign and everybody's like, you know what's bad? It's amazon.com. Yeah, it does look very pretty. It's nice. It looks nice. I'm still not gonna shop there, but like I, I appreciate that Walmart was like, we're getting our asses kicked and we're actually gonna come back and, and go after a big tech company, even though we're just the guys that like destroy small towns with our giant, very convenient and lovely shopping centers. But yeah, Walmart has been on this like, relentless quest to just solve logistics in a way I think is super funny and interesting that during the pandemic they, they started talking a lot about we're gonna turn our stores into essentially like super optimized warehouses for Instacart shoppers to come pick stuff up. And they were really big on curbside pickup and they've just, they have this like, omnichannel, buy everything any way you want. It all magically appears at your house vision in their head. And I don't know if it's what anyone actually wants out of their life, but it is the vision that Mike, that that Walmart has. Find it sort of fascinating watching them go after it. Well, they're like, they saw Amazon doing what they do best and doing it a little better. And they went, oh wait, no, we're the biggest guy in the room. We're not just gonna give that up. And as a me have a me, because they were, for the longest time, they were like the largest employer in the United States and Amazon took that over. And so Walmart's like, no, no, no. We can employ the most people. No, we actually already have all these warehouses built out. We don't have to go do it. We just call them stores, right Supercenters. And in fact, we can just fill that with crap and get it to you faster. So like that part of it I think is really, really interesting. They just said, nuh, we're really good at doing this. F you. There's a weird set of rumors that Walmart will be the one to buy TikTok, which I think is just like perfect. What? Uh, it's very good. I don't have any, it's true. I've just love this for the Walmart, I just heard the rumors. Speaking of Amazon, And things. Amazon does pretty devastating report in the Hollywood Reporter this week about Amazon Prime Studios. Yeah. Yeah. And how badly it's going over there. Uh, I'm just gonna do the disclosure now. I'm gonna talk about streaming. Get ready, buckle up. Comcast NBC Universal Division is investor in V Media. They own Peacock Uhhuh. They Comcast do not love Meme, but they own Peacock. That's a competitor. Uh, we made a Netflix show on the EP of a Netflix show. Um, I've used Hulu. Yeah. Uh, everyone in this room has opinions about the Mandalorian. Apparently I like succession. It's on hbo. O Yeah. Uh, yeah. Disclosures, um, uh, Amazon Prime video that invested a ton of money in the Lord of the Ring Series. Yep. 37% completion rate. It's brutal. No one talks about it. Do you watch it? No. Yeah, I watched all of it. That's for nerds. What do I look like? It was real bad. I got like, I fell asleep. I didn't like laundry during it. Yeah, it was one of those shows. Jesus. Yeah. When I was told it was slow, their quote in the piece was like, we we're definitely doing a second season. This was all world building, which is bad. Oh yeah. Season one was just set up for season two is quite a thing to say. A hundred million dollars of world building. Yeah. Whatever. Nerds. Uh, yeah. Nerd stuff. Yeah. Um, look at these wizards. Huh? Elves, tsm. Elves. Uh, that's what it was though. You're right. That's what it was. It's like that was show Have you met Hobbits? You love those? Right? Here's Sumo all collide. It was, it's very slow show. Uh, but the bigger point is Amazon's entire idea about this thing is you will subscribe to Prime, then you'll get great shows, and then it'll make you stay, subscribe to Prime. So you keep shopping on Prime. Right. And the thing itself does not need an identity, just has to be good enough. That you're happy about it and say, subscribe to Prime. What is fascinating to me, and Alex, I really want your view of this is the normals that I know mm-hmm. Are all fire TV people. Yeah. Like everyone, all of Becky's ants are like fire TV people. Not Roku. Not Roku. It's all Fire tv. It's bonkers to me. That's wild. And I'm like, are they happy with Prime? Are they watching the Lord of the Rings? Clearly not Prime is stealthy. Like it does technically. It has like the, the largest number of subscribers, or second largest over 200 million subscribers. But they're also, that's because they're also just regular prime shipping subscribers. Yeah. And so most people I don't think really think about it that often, except for when they wanna watch a movie and it happens to have it. Or they, they heard like a leave of their own and then they watched it and went, this is gay because it's very gay, it's great, watch it. But a lot of people then were like, no, I didn't want that. And click out. Um, so I don't think. As many people are engaging with it and we, and we're there. That was a big part of that piece too, was about how it hasn't had a big hit. Yeah. The closest it's had is a couple, like bro, shows like the Boys. And The Boys is great. Jack Reacher. Do you like Jack Reacher? I didn't watch Back. Great. Jack Real, bro. Like, it's like, bro, spy shows the Boys is particularly weird because I think people are taking the wrong message from the boys. Yes. Which is that homeland is cool and it's like, mm. That's not it. Yeah. That's not what that show's about. They're like, what a white supremacy was awesome. No, no. Wrong. Wrong. That was, yeah, kill it. What if we lasered everyone's heads? If they pissed us off, that would rule the boy. It's like, no, that's not. Yeah, that's not it. Everyone. Most people. It's, it doesn't have these big moments. Like it got Fleabag, but Fleabag wasn't even an Amazon show. They picked it up, they acquired it from I think the BBC or something. And that's fine. Yeah. Well, and then, and this was a detail that, that was in the story. Uh, Amazon then gave Phoebe Waller Bridge who created Fleabag a truckload of money to make more stuff. And then she didn't make anything for them. So she was supposed to make the, part of the issue here is that their, their idea is, okay, we need to get people on board, so we're gonna throw money at creators, which reasonably good, especially nowadays where everybody's throwing money around. Yeah. It's what everybody did. Yeah. But then they're not following through. And so Phoebe Waller Bridge and Donald Glover were supposed to make a Mr. And Mrs. Smith show. There was, things did not go well there, there was some personality clash clashes and stuff. So they, they parted ways and she's still now doing a Tomb Raider show, but she has a tendency to go and come up with the idea for a show and then walk away, huh. Because that's what she like Killing Eve. She did the first season and she's like, this is cool. Bye. And. The show got progressively worse as different showrunners came on. The first season's amazing though. It's really good. I, the show still was great. I loved it. But yeah, so they're doing that a bunch. They're just throwing money at people and then being like, Hey, do you do anything with that 20 mil we gave you? No. Cool. Here's the, why can't I get these deals? Right. Like, I gotta go do that. That sounds great. The thing that really strikes me with all of these mm-hmm. Is the harshest criticism. And I think the most devastating criticism in the story is they don't know what they want. Yes. Yeah. Right. And that is to some extent the criticism of Netflix. All the big sort of data driven, to some extent, the criticism of YouTube is like, this thing has no point of view. It's just a mishmash of stuff. It's all driven by data. Well, and they hired, so the person who's running Amazon Prime, she was hired to have vision and she does have vision, like she was a big fan of Ali or their own, she's been pushing some other stuff and she's running into conflict with the people who are data driven. And then also the stuff she, that she puts all her effort into aren't, it's not good without working, doesn't actually land the Lord of the Rings. Yeah. So it's, well that wasn't her her deal. Like she came in to do that. That was Jeff Bezos being like, I wanna watch my Nerd show. And The Expanse Yeah. Which spun completely in like literally into Orbit. Yeah. The second they went through that gate, I was like, the show's done, like I'm Over it. And more seasons came. Yeah. Yeah. They kept making it so many seasons. Uh, I just wanna compare that to hbo. Mm-hmm. Which absolutely has a point of view. And just like fires off hit after hit, right. Even with all the corporate chaos of HBO and at and t and all the rest, they're like, what we do is we make things we like. And then we show them to people. And that's how you get the white Lotus and succession and all the rest of it. And it just doesn't seem like the tech companies that want to take over streaming have gotten it with the notable exception of Apple. Yep. Apple's the only one. And they, they, and that was partly because they hired a bunch of H V O people. Yeah. So part of this is, is Amazon doesn't wanna listen to, to these people that they hire. They go and they hire them and they're like, let's do this. And Amazon's like, nah, let's do this other stuff. And, and so there's just this constant disconnect. And Netflix is having the same issue. Netflix is totally driven by the algorithm to the point that it cancels shows that are really, really popular and then gets people furious and lots of bad press and everybody yells at them and Apple is figured this out because. They just trusted that we don't know what we're doing here. We're gonna pay people who do and let them work and like get out of the way and also give them a ton of money to do it. Just a ton of money. Well, and and to be fair, apple has had its share of stinkers. It's just also had some really massive successes in a way that Amazon hasn't. But the thing for me is it's always been like this at Amazon. Mm-hmm. Like, do you remember when Amazon would put out a bunch of pilots and let people vote on which ones they thought should go to series? Like it turns out that if you do the whole Amazon thing, which is like start with what the customer wants and you know, go out to the end, which is how Amazon says it does everything, you're gonna get shitty stuff because people don't know what they want. And if you ask people what they want, they're gonna say, Lord of the Rings. Yeah. And then you have to make a good Lord of the Rings show. And that's much harder than just saying, do you like Lord of the Rings? But then on the flip side, Amazon. A, at least as far as I can tell, has never been at all clear about what its video stuff is for. And even in the course of this story, they talked a bunch about, like, one of the compelling things about Lord of the Rings was all the like merchandising opportunities, right? And they, they've talked about this with football too, that if you get people to sign up, like we're gonna be able to sell you football related things, like maybe you'll buy. J Todos through Thursday night football. And that that's actually as big a victory as getting you to watch Thursday Night Football through Prime video. And so there's just been this weird thing where it's like, what? What are these shows and movies here to accomplish for Amazon? And I don't necessarily think Amazon has a clear answer to that. They at least have not communicated that to Hollywood. And until they do, it's gonna keep being the same thing where people just come and they're like, what? What do you want from us? Like, what does success look like here? And they had even people saying that. I think the guy that did a league with their own was like, what do you want from us? Like Green Lit our show. They wanna sell baseball bats. Apparently just a little girls. All right. This is the longest lightning round ever. You can tell we have a lot of feelings about this story. Yeah. But it is notable that the data-driven, like the data-driven streamers are not producing. At the rate of the people who are just like, have taste. Yeah. Oh, there's a lesson there. Shock. All right. What's your lightning round item? Ooh. So mine is kind of, I'm, I'm folding two in together because we had some handheld news this week. Oh boy. So first of all, Asus, on April Fool's Day, it was like, this was not great of it. It was really bad. Asus was like, Hey, we're gonna do a really cool handheld April Fools. And everybody's like, well, that's stupid. Like the steam deck exists. You could have done that. And then a few days later they're like, oh, actually we are doing it. And everybody's like, well that was stupid. Why didn't, why did you message it with April Fools? And I think the idea there was supposed to be, you'd get really excited and wish it existed and then be really excited when it did exist. Oh, the, uh, the classic April Fool's Gambit. Yeah. And instead they just pissed everybody off. And we don't really know a lot about the pricing or what's involved. Uh, there's a couple of YouTubers that have seen it so far, it seems potentially really cool. It runs Windows. Could be neat. Could be $600 and nobody would want to spend that on a handheld when a steam deck, why is it called the RO ally? Because it's your ally in gaming. Oh my God. Also, have you ever seen Jesus's product names? Ro Ally is like the best it's ever done. RO is Republic of Gamer, which was a gaming, yeah. Thing that they acquired years ago, and so they just, this is the ally. Yeah. All right. This is your friend. I'll take it. And then the other part of this is Sony is considering also making a handheld super late to that party in some respects, even though they did the Vita and they did the psp and they're both were great, overpriced. Nobody bought them except for me and probably Sean. I had a p, PS P. Okay. You, me and Sean. Yeah. We were the three that owned the psp. It was great. Mine was pink. Did I have a Vita too? There's a real chance I might've had a Veta along the way. The Vita was like, it had like 3G in it. You were like, it's like it's practically a phone. Yeah. I can justify this purchase. It's weird that a gadget made so little impression that I can't remember if I owned one, but it feels like the sort of thing that I bought. It was not great. The games were great for it, but so Sony is looking into this again, curiously not for cloud gaming. That's probably because they have a really bad cloud gaming infrastructure. They farmed it all out to Microsoft. They don't, everybody's now, somebody's gonna yell at me in the comments and I'm sorry. I know you all love it and it works, but it's garbage. So they're not making it for that. They're making it for remote play. So you can just play your PS five Yeah. Far away from your house. That makes sense. But that might be the only thing you can do with it. And how much is it gonna cost, cuz everybody's struggling to get it under $400. And why would you spend $400 on something to just play your PS five that's at home when you could spend $400 on the steam deck that lets you do that and play other games. I would assume this has to. Uh, coming alongside some like, huge expansion in Sony's cloud gaming stuff, because if not, yeah, you're exactly right. This just becomes like, history's most expensive, barely useful PlayStation, peripheral, uh, just slightly edging the, the move sticks that existed, but, uh, I'm just barely edging it. The reporting was, was like emphatically like, it's not for cloud gaming, it's for remote play, which is why it's so weird. Also, the name is bad. What's the name? Q Light. It's okay. It's worse than Rock Ally. Yeah, it was like, which do you want? Rock Ally or Q Andon, the video game system. Let's hope that's a code name. Yeah. Can I tell you whatever? They can do whatever they want. Okay, that's fine. You'll buy it. Sony needs to put PSVR two grand Temo demo stations in every mall and store and seven-eleven in America. How many times have you vomited playing it? No. So the first day was really bad. Okay. So I had Addie send me one of our psvr two review units, and then I bought a Logitech G 9 23 wheel in pedals and a love it and a chair. Just, it's, I was like, whatever. This is like fully ridiculous. But I live in the woods, I'm in the basement. No one can see me headset on, and the first day I was like, Ooh, this is a mistake. Super queasy. And then, uh, just a couple days later is fine. Okay. So a couple days of queasy. I'm obsessed. It is like being in the stupid cars. I love that. Do, do you like miss the brake? Do you have brake pushback and stuff? Uh, the real car, you can feel it when you're breaking. No, because it's just, they're plastic pedals. I was gonna say, you, you know, you can spend like 30 grand on this setup, Eli, and I feel like we are, we're headed down a dangerous road. Yeah. I've spent a bunch of credit card points and fine, like, I haven't spent like, it was like a hundred dollars on a bunch of credit card points to accomplish this setup. It is legitimately the most compelling thing you can do in vr. Yeah, yeah. Like it is so cool. It's so much fun. Uh, you convince yourself that you're moving, which is bizarre. Like, absolutely bizarre Uhhuh to be sitting dead, still holding a plastic wheel that you cannot see cuz you're wearing a VR headset and like leaning your body. Like it's crazy. I took off, my wife came down the stairs the other day and I took off the headset and I literally went, you gotta try this. And she was like, what is wrong with you? She just went right back. She was like, I'm outta here. Uh, before all of the, we've talked so much about last week, talked about ar killer apps, all this stuff. It's an incredibly complicated, full setup. Yeah. It's like $1,500 worth of stuff, right? You need a PS five, you need a headset, which another five, $600 you need to buy a wheel, a chair. It's all ridiculous chair. Uh, and you can, you can spend like $30,000 on like full motion iRacing PC based. Yep. Max for staff in the f F1 racer has a full rig in his trailer. So he leaves F1 races and then sim races against people using his real name, which is incredible. It's badass. Devastating sim racing as yourself is the coolest, imaginable thing. Uh, and all that's fine. And like I have friends and I've tried those things and screens with the three, three screens around you. I'm telling you put on the VR headset, you're like, oh, this is the coolest thing you can do in vr. Yeah. Sony needs to throw this cloud gaming, whatever, get people the headsets with the racing games. That should, that's like they're Tetris. Yeah, it's $1,500 of sim racing setup. Uh, also it judges you every time you put it on, it's like, are you sitting down again? And it's like, I'm definitely sitting down again. It's like, don't you want a play standing up, moving around? It's like, no, no, no. I'm in the chair, bro. Stationary mode. What's up? Yeah, let's go. It's like every time it's like, are you, uh, you're stationary again, huh? It's like, sure. Him. Let's just put the pedal to the metal, bro. It's very good. Okay. One more. Wait, how many picks are we at? That was like one each, basically we did one each. You, you get one more and then I think we should probably go. All right, let me wrap this up. Last lightning round item. This is me just assigning myself a story again. We'll have it on the website tomorrow. Okay. Something is happening in Wisconsin. Cheese. It's no 49ers. Aaron Rodgers is leaving. It's the only things anyone can think of. Uh, so as you know, I'm obsessed with the, the Fox on plot, which is just minutes away from the child, my childhood home in Wisconsin. Yeah, they're gonna do something on it, and it's not coffee robots or whatever nonsense they claimed they were doing. It's definitely not building TVs. A K A I. Yeah. Wait, so the first thing, let's just, let's run through the history of this real fast. So it was real fast. Do you think that's possible? It was gonna be TVs, right? Yes. So in the Trump administration, Donald Trump, golden shovel, breaks ground with Terry Go, chairman of Foxconn says, we're building a TV factory in Mount Pleasant, Wisconsin. They ram it through, they bulldozed houses the whole thing. It was ai eight k plus 5g, the plus, sure they're gonna do 15,000 jobs, billions in tax subsidies. I don't need to tell you that this did not happen. It was never gonna happen. And it definitely did not happen. At one point in the course of this story, when they broke ground on the factory, uh, display experts told us that foundation doesn't look correct for an LCD fab. And we asked them and they said, the special clay soil in Wisconsin does not means that we do not need to build the foundation that you need in the rest of the world. And I went, I'm from there. And no one ever told me that the dirt was special. So that was weird. So then they built this weird building. They call it the multipurpose building. It is all but empty. They used it for storage at it, rezone to storage. They cleaned a coffee. Robots, they think they're making server boards for Google there, but they won't claim, no reporters have ever been there. There's a tiny dome that they claim is a data center, but the actual data center is in shipping containers outside the dome. It's, it's all very good. Geodesic dome. Yeah, it's like a little, it's so, it's like by my parents' house. Every time I go home, I look at it, I'm like, it's so small. It's just a little, little snow globe data center. That's, and it's not, it's just like a conference center. You can rent it out for weddings. Anyhow, first of all, let's, let's do that. Yeah. If any first house listeners are getting married, um, in was, might I interest you in Mount Pleasant, Wisconsin? Mili will officiate your wedding at the Dome. It's true. Uh, every time, uh, when my sister got married, my parents renovated the house. When my, when I got married, they did the backyard. My parents, they're looking to do the bathroom and apparently it takes a wedding to kick him into gear. So if you're listening to this, get us, let me know. Uh, anyhow, so there's a news report, uh, uh, somebody tweeted this at me and just looking at Twitter in the background. Mm-hmm. I, I came upon it days late. M Mount Pleasant, the board that approved the Fox hunt deal, just like quietly announced that Microsoft would be building a data center there. They have not taken the votes to do it, but they announced it before the election approved. The fox hunt is a great idea. So I'm looking at the story and I'm like, I don't, I don't know about this. Yeah. I will say Microsoft President Brad Smith is from Appleton, Wisconsin, loves Wisconsin. There's a big tech campus at Lambeau Field called Title Town Tech. Okay. The man loves Wisconsin. He likes investing in Wisconsin. Love it. Love it for me. Love it for him. Uh, I've not yet been invited to Lambeau Field. I'm just putting that out there, but I feel like it's too hometown boys. We could really vibe. Um, so I asked Microsoft, Microsoft sends me in the following statement, uh, this is all they say. Our data center campus investment plans with the Village of Mount Pleasant and Racine County are part of Microsoft's long-term commitment for the local communities in Wisconsin. We look forward to our work there. Other than that, we don't have more to say, nor are we doing interviews, so that's nothing. Okay. All right. I was like, can I talk to anyone About how many jobs are Will this data center? It's a room full of servers. It's a one job. Yeah. Microsoft data centers, they're around the country. You can see they don't make a lot of jobs and they know it. Uh uh, Kevin Scott, the CTO of Microsoft, has a whole book about how data centers don't make a lot of jobs. It's a great book. He was on again, on Dakota. We've talked about it. He's like, this is not the thing that is like an engine of job creation. Yeah, but you need to have them and like then you build infrastructure and you have power grids and this helps local communities. Uh, they're getting tax rebates and subsidies for it as always. And Mount Pleasant and Foxconn are like, this is what happens when you build the infrastructure. The clients will come and it's like, no, you guys were, you tore down people's homes. To build a TV factory. Where's the TV factory? Where are the jobs? Where are the jobs? Yeah. Uh, so we're gonna be tracking the Microsoft data center in Mount Pleasant. I'm sure they're actually gonna build it. They literally, they field of dreams did. They just, if you build it, they will come, just throw up a giant empty building and somebody will come put servers in it. And by it, just to be specifically clear is it is declaring the land on which people's homes sit as blighted, tearing them all down. Trucking water from Lake Michigan over there and building a power substation for no one to life fallow for three years. So that eventually Microsoft is like, yeah, sure. We'll put one Classic Field of dreams. That's a, I mean, that's field of Dreams too. Just the movie. We're, uh, so we're, again, we're tracking it. I, I dunno what to tell you. Like it is very silly. Uh, I'm. I think it is very odd that Microsoft isn't like pounding its chest. They're building a data center in southeastern Wisconsin. Like they just, they just don't want to talk about it. Yeah. Nei, when do you run for Mayor Ofe, Wisconsin. This is the only outcome here. Uh, I don't know that I could get my dad to vote for me, so that's gonna be tough. You did swear once on the verse.com. You didn't like that? It did. My parents were not, I think I could get my mom. Okay. Uh, that's a good start. Yeah. Just promise you'll never swear again. Would that help? I don't know that I'm prepared to make these commitments to the people of Wisconsin today, and I will consider my options at this time, uh, hearing from my attorney. We're not doing interviews. We're not doing no interviews. No press. Sorry. No press. All right. That's it. That's a vergecast. I promise. All of these stories we've talked about will be published. David, we'll publish about activity pub. Yes. I will write about Wisconsin. I made no promises that, but But you did one last week, right? Yeah, I did one last week. I did. I did Apple Music classical. Yeah. So all right, I promised it and I delivered. I swear to God this entire story you is just for us to ideate stories put on the website, but that's why you love it. That's the cast, uh, stuff on the website you should look at. Uh, we do have a retrospective of the Lisa going on the Apple, Lisa, the precursor McIntosh with the Computer History Museum. It's great. Go look at it. I really want people to read McKenna's story about the Donald Trump. Protests in front of the Manhattan Courthouse and how they, everyone, there was a streamer. It is one of the verges verge stories we've ever published. It's very good. Um, and we have the same with the home assistant Sky Connect, which is another just extremely verge story. It's so verge, it's so the most, like that's the range. And then take the color quiz. Whatever. Uh, David, do you wanna tell people the vote for the People's Choice Award? Yes. So the Vergecast is nominated for a Webby Award for best technology podcast. Um, we're currently losing to a TechCrunch podcast. Ooh. Uh, I like TechCrunch Fine. They're all lovely people. I would like to destroy them and bury them in the ground with our votes. Uh, please go. We'll put the link in the show notes. Please go vote for the verge so that we can gloat to everyone we ever met that we on the webby and they didn't. Please press like a spring. Yeah. Yeah. The award itself is rad looking and I want one, so let's, let's get it. Very good. Uh, that's it. That's for chest back roll.",
    "transcript_keywords": [
        "Yeah",
        "Twitter",
        "people",
        "thing",
        "Twitter blue",
        "Spotify",
        "car",
        "Amazon",
        "people Twitter account",
        "good",
        "things",
        "make",
        "big",
        "Android",
        "show",
        "great",
        "CarPlay",
        "thing Twitter",
        "people Twitter",
        "lot"
    ],
    "transcript_entity_values": [
        "Clubhouse",
        "Android",
        "J Todos",
        "Elon",
        "three",
        "4 cents",
        "Mazda",
        "Reddit",
        "Macedon",
        "Akm",
        "mm",
        "EV",
        "37%",
        "Yelp",
        "the first day",
        "one day",
        "Fire tv",
        "logout",
        "Spotify",
        "the first season",
        "Asus",
        "this week",
        "Pub Act",
        "third",
        "Mass",
        "Brad Smith",
        "Appleton",
        "NPR",
        "Zer",
        "Google",
        "4.5",
        "YouTube TV",
        "Matt",
        "the Verge dot",
        "the weekend",
        "600",
        "Eugene Rajko",
        "Activity Pub",
        "New York City",
        "Jam",
        "Rings",
        "Kevin Scott",
        "Instagram",
        "20 years ago",
        "Q Light",
        "next year",
        "Broadway",
        "30",
        "McIntosh",
        "TechCrunch Fine",
        "Comcast",
        "Platformer",
        "Windows",
        "AI",
        "20",
        "Dear C",
        "April Fools",
        "Eli",
        "all week",
        "the last decade",
        "gm",
        "last week",
        "one last week",
        "the People's Choice Award",
        "CX five",
        "Reuters",
        "tomorrow",
        "Traffic",
        "the year",
        "1,500",
        "First",
        "Steve Chevy",
        "one",
        "Tetris",
        "Temo",
        "Olive of Design week",
        "McDonald",
        "Snapchat",
        "Macintosh",
        "Android Automotive",
        "Linux",
        "every night",
        "Spotify",
        "eight",
        "Fox",
        "six",
        "Phoebe Waller Bridge",
        "API",
        "3",
        "the United States",
        "Mm",
        "Walmart",
        "Apple tv",
        "Amazon",
        "Patel",
        "a year later",
        "Sony",
        "the Apple Lisa",
        "F1",
        "New York Times",
        "McKenna",
        "CarPlay",
        "fed",
        "Mandalorian",
        "OG",
        "years ago",
        "three years",
        "qnx",
        "Mercedes",
        "Twitter",
        "96",
        "Jeff Bezos",
        "Ben Smith",
        "Peacock Uhhuh",
        "UAB",
        "Alex Franz",
        "a couple days",
        "200 million",
        "This year",
        "Donald Trump",
        "Huawei",
        "Vergecast",
        "HBO",
        "GM",
        "Twitter",
        "Kaza",
        "Terry Go",
        "Nerd",
        "eight k plus",
        "first",
        "Buzzfeed News",
        "Pub Flipboard",
        "Linux",
        "30 years later",
        "CarPlay Android Auto",
        "Ticketmaster",
        "Elon",
        "Ruben",
        "Alex's Flex",
        "Disney",
        "the early days",
        "WWE C",
        "Virgin",
        "amazon.com",
        "Q Andon",
        "two weeks ago",
        "BBC",
        "Lisa",
        "Crush",
        "Tumblr",
        "12 months from now",
        "400",
        "Android Auto",
        "Sean",
        "Bluetooth",
        "hbo",
        "a. Dude",
        "Becky",
        "Washington Post",
        "the New York Times",
        "Apple Music",
        "Twitter Blue",
        "Apple",
        "Dome",
        "Wisconsin",
        "15 or $20",
        "a Webby Award",
        "Ofe",
        "Doge",
        "Thursday Night Football through Prime",
        "eight bucks",
        "Florida",
        "years",
        "Trump",
        "Foxconn",
        "season two",
        "Green Lit",
        "all day",
        "Spotify Clubhouse Jr.",
        "David",
        "webby",
        "the end of",
        "Ali",
        "next week",
        "Dakota",
        "65",
        "Max",
        "Twitter Blue",
        "Sky Connect",
        "the whole week",
        "Classic Field",
        "Spout",
        "max",
        "WordPress",
        "Les Patel",
        "Enma Don",
        "Roone",
        "a hundred billion dollar",
        "Don",
        "Decoder",
        "20 mil",
        "CTO",
        "Nilay",
        "Taylor Swift",
        "8",
        "the Village of Mount Pleasant",
        "Mozilla",
        "Science",
        "a hundred dollars",
        "this a few days ago",
        "Buzzfeed",
        "Hulu",
        "Rock Ally",
        "Uhhuh",
        "Meta",
        "like hundred percent",
        "One",
        "Alex",
        "Google Maps",
        "a million",
        "Mastodon",
        "Liz",
        "YouTube",
        "Title Town Tech",
        "David Pierce",
        "Orbit",
        "TechCrunch",
        "2020",
        "PS",
        "Elon Musk",
        "Netflix",
        "BMW",
        "Mustang",
        "Universal Division",
        "Roku",
        "last year",
        "eBay",
        "Jack Reacher",
        "Sarah",
        "Lennox",
        "the Ring Series",
        "Lotus",
        "Graham",
        "Alan",
        "Twitter",
        "YouTubers",
        "Facebook",
        "Andrew Producer",
        "billions",
        "seven-eleven",
        "second",
        "five",
        "Unreal",
        "Vercast",
        "PlayStation",
        "kaza",
        "Jesus",
        "the Manhattan Courthouse",
        "Elon Musk",
        "nuh",
        "five years",
        "Spout Audible",
        "four",
        "Masteron",
        "a hundred percent",
        "Jeep",
        "like $30,000",
        "Aaron Rodgers gonna",
        "Hollywood",
        "night",
        "Racine County",
        "over 20,000",
        "Thursday",
        "PS P. Okay",
        "Veta",
        "Mili",
        "one second",
        "Tumblr Activity Pub",
        "Unreal Engine",
        "Mark Zuckerberg",
        "Rivian",
        "Onal",
        "Vita",
        "T. Twitter",
        "Ro Ally",
        "Slack",
        "Addie",
        "Pixel Fed",
        "the Computer History Museum",
        "Casey Newton",
        "Packers",
        "Spotify",
        "five, $600",
        "that day",
        "Fox",
        "The Expanse Yeah",
        "a thousand",
        "Monica",
        "Poll Star",
        "the day",
        "Donald Glover",
        "this day",
        "Xanax",
        "30%",
        "Bard",
        "Hemi",
        "9,000",
        "MyPillow",
        "Green Room",
        "up to 50,000",
        "election years",
        "PDF",
        "Patrick George",
        "every single day",
        "CarPlay",
        "James Vincent",
        "TikTok",
        "a second season",
        "Microsoft",
        "80%",
        "Mike",
        "Honda",
        "LeBron James",
        "Red Yelp",
        "The first season's",
        "200",
        "Smith",
        "a few days later",
        "15,000",
        "Mount Pleasant",
        "IM",
        "Cobas",
        "Verge",
        "Casey",
        "four year old",
        "Lake Michigan",
        "Fleabag",
        "25 years",
        "Aaron Rodgers",
        "SE",
        "10 years",
        "apple",
        "James",
        "Republic of Gamer",
        "a ton",
        "Twitter",
        "Vita",
        "Lambeau Field",
        "LCD",
        "Macedon",
        "Instacart",
        "Cambri and Explosion",
        "just minutes",
        "Tesla",
        "Fords",
        "5%",
        "five bucks",
        "10,000",
        "Block",
        "Elon Musk Vindictively",
        "Matt Mullenweg",
        "9 23",
        "the four year old",
        "Ivan",
        "Logitech",
        "Care Swisher",
        "Ford",
        "iRacing",
        "April Fool's Day",
        "Arrest",
        "today",
        "Apple Music Classical",
        "Block",
        "Amazon Prime Studios",
        "Epic",
        "70",
        "America",
        "two",
        "the Donald Trump",
        "MagSafe",
        "Gawker",
        "Bekin",
        "Rock Ally",
        "A hundred million dollars",
        "five-year-old",
        "Chris Raske"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "LAW",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "EVENT",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "FAC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "GPE",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "MONEY",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "FAC",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "EVENT",
        "ORG",
        "PERSON",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "FAC",
        "PRODUCT",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "PERSON",
        "GPE",
        "TIME",
        "GPE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "NORP",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "FAC",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "LOC",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "LOC",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "FAC",
        "ORG",
        "PERSON",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "GPE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON"
    ]
}