{
    "id": "dFFBEYDmYUY",
    "title": "This looks great on paper… - Poco X5 Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-12T18:30:27Z",
    "video_url": "https://www.youtube.com/watch?v=dFFBEYDmYUY",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "POCO",
        "xiaomi",
        "X5 Pro",
        "budget",
        "affordable",
        "mid-range",
        "phone",
        "smartphone",
        "gaming",
        "genshin",
        "camera",
        "108mp"
    ],
    "views": 198136,
    "likes": 7688,
    "comments_count": 538,
    "description": "Subscribe to our Floatplane channel for exclusive content today at   Mid-range phones have been looking better and better over the last few years and POCO's new X5 Pro is another great phone competing for your hard-earned dollars. With a 108MP camera sensor, 120hz AMOLED screen, and a 5000mAh battery, this phone seems like it could be perfect, but will Bell be impressed or can specs be deceiving?  Buy a Xiaomi Poco X5 Pro:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 It's all mid here 0:14 Unboxing 1:10 Design and port/button tour 4:25 Sponsor - Floatplane 5:40 Battery life, screen brightness, and fingerprint scanner 7:07 Thoughts on OS/bloatware 7:34 Screen and speaker impressions 8:32 Camera test 13:07 Gaming impressions 14:26 Pricing and overall thoughts 15:37 Outro",
    "description_links": [
        "https://lmg.gg/scfloatplane",
        "https://geni.us/VbQ3",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- We are back with another Poco phone. I know you'll love mid-rangers and I love talking about 'em. And this one looks mid-rangey as heck. It's the Poco X5 Pro 5G, which is what we've been waiting for on Poco phones. And they finally listened. We have this nice, the standard kind of black and yellow text that Poco loves and honestly, I love, and who is it Wiz Khalifa loves? - [James] Bumblebees? - You like Jazz? Nothing too crazy about the box. Just says Poco X5 Pro all over the place and what we have for specs on the back. But I like to be surprised. Well, I guess not too surprised 'cause I looked. Spoiler alert, we have the Poco. Oh, someone's definitely been here 'cause it's got fingerprints all over it. 2 million subs, no respect. We've got the sim popper, we've got our handy dandy case. Feels like they included case with a Poco phone. And what else we got in here? Ooh, okay, we'll come back. We'll come back to this guy. And in here, we got our 67-watt Euro charger and the orange USB A to C for that fast charging. And then we have our meter long A to C cable, again, with those nice colored orange tips. And that's it. We're already onto the phone. No frills here in the box, but ooh, I gotta say I really like this yellow. I'm actually not a huge fan of the color yellow, but this is like a frosted glass yellow. So you might look like it's kind of the reflection that's making it that pale. But no, it's just like a nice frosted yellow. Oh, it's got some goo on it but that's fine. What's a little goo? We got our branding here for 5G and all of the safety things, and of course, that big old Poco logo. And this looks like it's part of the camera bump, but it's not. It's just flat, flush colored plastic. It is a plastic frame and a plastic back with the glass front, which is fine. I think it actually feels pretty nice in the hand. And then we have our cameras on the back here. But before we get too far into that, let's take a look at what we have on this phone. So we have our volume rockers here. Ooh, good-sounding buttons. And the yellow power button slash fingerprint scanner. I can't get over those buttons. That sounds great. On the top, we got our, well, we got my favorite, the IR blaster, the Michael, one of our dual speakers and the headphone jack because again, this phone's under a thousand dollars, so it has all the features you want. On the left side here, we got absolutely nothing, just that nice rail. And on the bottom, we have our sim tray, Michael, USB-C, and speaker. And I'm just gonna open it up here as I know it's a dual-sim phone, but I wanna see if it has expansion. Does this get rid of the SD card slot or does it keep it? Drum roll. Ooh, just dual nano. So they got rid of the headphone expansion even compared to the M5S which we've covered previously. A little disappointing. I mean, again, one of those weird things where these mid-range phones seem to have features like that, but I guess lacking an SD card slide is a feature that's now falling down from the flagships into the mid-range. But I hope this isn't something that kind of sticks around. On the front here, we have our 6.67-inch, full HD plus AMOLED display and it's 120 hertz. It is really nice to have that high speed from when you're scrolling through feeds or even just your settings on your phone and it doesn't look so choppy. So really glad to see it here. And it's Gorilla Glass 5 on the front. So again, not the newest, hottest Gorilla Glass, but pretty good. I don't know what it is about this aspect ratio if it's just the rails and how flat it is, but it doesn't feel like it fits great in my hands and yet this one kind of noticeably stands out as like not feeling great. And as you can see, I can't reach all the edges super comfortably, which isn't ideal. But if you have bigger hands, maybe you won't notice. Or if you consistently two-hand your phone, whatever, it is obviously good for media to have a larger-sized phone. As for thickness, only 7.9 millimeters thick which I, we've deemed, I don't know what millimeters are, but it's thin. And again, the camera bump is not too big, especially when we have a whopping 108-megapixel main cam. That's nuts. It's too much. We also have the 8-megapixel, ultra-wide, and two-megapixel macro, which you're gonna use all the time. I can tell. This is the year you do macro photography at two megapixels, plenty. But otherwise, that's about it. It's a very minimal phone, just like a slat with bright yellow coloring. So I guess, all that's left is to turn it on. But first, let me tell you about our sponsor, Floatplane. - [James] What? - That's us. Have you ever watched a ShortCircuit video or LTT and wondered, how do they do that? Well, Floatplane's a place for you. That's where we upload exclusive vlogs behind the scenes, and funny may maze. It's a good time. Let's take a look. Alright, we got Floatplane up here where we put all of our videos across all of our channels as well as exclusives. So you can easily just type in what you're looking for, exclusives to see everything or we're gonna type in vlog 'cause that's where my specialty comes in. As we can see here, we got quite a few different vlogs that we made. and I mean let's just randomly select a few like maybe, the \"Paris Evnia Launch\" or \"The Great Sony FW900 CRT\" road trip, or \"Behind The Scenes at Nanosys\" where, James, you were there over at Nanosys. - [James] Yes. - That was a great time. These ones are great. Now, I'm not biased because I shot and edited them, but hey, they're great times where we can see some of the behind the scenes of what we've done when we go to all these different places, or how it actually works to make a video. I think the Nanosys vlog is really good for that where you can see James actually writing, talking to the different Nanosys employees and then shooting the video. It's really cool to see how we do it and hopefully gives you a little bit of insight into what it's like to work for what, a multinational corporation? So if you wanna see more from us and how we work, make sure to subscribe to Floatplane for just five or ten bucks a month at lmg.gg/scfloatplane. All right, well, the phone was dead, so it's plugged into the charger. Now, we can test out that fast charging 'cause they actually don't have an advertised charge time with their fast charger. We're not using it, so we'll never know. But it is a 5,000-milliamp power battery, which is pretty good size especially for again, a mid-ranger phone. They do advertise some interesting battery lengths. So first for call time, they advertise 28 hours, so plenty for you and your significant other to chat on the phone literally all day. They also advertise 20 hours of video playback, so you can binge watch \"Malcolm in The Middle\", again all day. And then, finally they offer 21 hours of reading time, which is not a spec I've really ever heard of, but go nuts with your eBook. As for brightness, it does get pretty dim. So if you like to use your phone at night or while you're in bed, you won't have your eyes absolutely searing. But the max brightness isn't fantastic, so it's only 500 nits with a max of 900 peak brightness, which isn't gonna be great for outdoor use. Like obviously, it will be usable. But again, be aware if you're coming from a higher-end flagship, those are hitting up to like 2,000 nits. So it's gonna be quite a big difference, but you will be able to survive with something like this. Now this does have the fingerprint scanner built into the power button, so let's give that a try and make sure it's not completely awful. All right, this seems a bit excessive. This has taken on a minute. All right, this better work well. And it's asking if you wanna add a face. It does have the AI face unlock as well, but, again, I'm not a huge fan of that. Yeah, not bad. Goes right in. I mean it's a fingerprint scanner, it works. I don't think I mentioned this is MIUI 14 built on Android 12 and there is a ton of bloatware. Ali Express, Bubble Shooter, Crazy Juicer, Dust Settle. There's a ton of stuff that just comes default on these that again, I am not a fan of. You have to go through and delete them manually. Always a bummer. Some of the ways that these phones stay cheap is actually by selling the space on these phones that they come preloaded with these certain apps. So if that's the way of keeping the price down, I guess that's fine. All right, let's take a look at the screen and speakers by doing some Crab Raving. (light upbeat music) (light upbeat music continues) It sounds okay. Definitely not the best-sounding phone I've ever heard, but I think it's not anything awful. It's more apparent that the sound is louder on the left side instead of that dual speaker on this right side. But when you hold it up to your ear, there is some separation, but it doesn't feel wide. If you're really hoping for Dolby Atmos on an affordable phone, I don't think you're gonna really have that expectation here. As for the screen, it looks good. Nothing to really complain about here, everything's crisp. It is a, you know, full HD plus screen. It's not gonna be extremely sharp, but it does look pretty good. What is noticeable though is that camera bump wobble. It's on quite a bit of an angle and wobbles around quite a bit. Not great, but also not really avoidable with any phone, unless you have the Pixel 7, which is not gonna rock, but it's gonna be on a definite angle there. Alright, let's take a look at these cameras and see if that 108-megapixel camera kicks everything else to the curb. We got our friendly faces over here, James, doing work. We have our ultra wide. Now, it does show a zoom button, but do know it is just cropping in on that 108-megapixel camera, so it's nothing too too wild there. And we gotta try out our macro mode. Alright, we have our model here. Let's see how that macro camera does. I'm assuming it's just gonna automatically switch to it here. Oh, maybe. Wow, there's a lot of bokeh there. All right, you know what? For a two-megapixel photo, it doesn't look bad. It's definitely noisy, but the bokeh looks really good. And the depth of field, it's pretty solid. Definitely not bad. I dunno how often you'll use a macro camera especially enough to have its own dedicated lens. A lot of them will use the ultra-wide lens just as a macro, but obviously, it's kind of nice to have. For the other shots here, the 2x zoom does look good. You do lose a little bit of clarity 'cause again, it's just punching into that regular 108-megapixel sensor, but I don't think it looks bad at all. All right. This is the ultra-wide, and it's got an interesting look. It's almost like film, which I don't think it should be for eight megapixels, but the colors are just really kind of deep. There's a lot, you lose a lot of the detail between James's blue shirt and his green pants that look brown. It's very odd. And when you zoom in, his hands have lost all sort of quality and it just looks bit crushed, which is very odd. Onto the main camera, it's still not fantastic. As you can see, if we zoom in on his hands here, James's hands again are pretty crushed. Like they, it doesn't look like there's enough pixels even though that 108-megapixel sensor is binning down to a 12-megapixel photo. So it's taking nine pixels, making one big pixel to hopefully give you better night shots. But we can take a photo in the pro mode that will be just the straight, 108-megapixel mode. So let's try that. Wow, one fine, young gentleman. Let's take a look at that photo. So with this 1081, it seems to be affected by our studio lighting a bit more, but it does look a bit sharper. Again, not a great photo. I don't know if it's like an AI trying to smooth or beautify or sharpen, but it doesn't seem to be doing quite great. James does look a little bit like a painting. So something to be aware of, even though on paper it does have some impressive specs, it might not actually translate to what you're gonna be taking in your day-to-day life. Selfie time, I love taking selfies. I'm a millennial guy. Is millennials known for selfies? I don't know, but I'm taking one. Looks like we got our little stars highlighted here. So there's definitely some filters on, original. There's me and all my glory. (chuckles) Selfie's look good. I look sharp. I'm glad there's just an original mode again. We have seen it before where you just have to turn everything down by itself, which I was not a fan of. So Poco has changed their ways. Amazing. Video again. Here, I'm connected to a cable. Gonna have to unplug. Now, again, adjustments, bright studio lights. They're leaving it blown out to keep me fairly exposed, which is I think the better way to do things. My skin color looks accurate even with James's very red jacket. We can see all the colors do look pretty lifelike, which is great to see. - [James] That was too red. - Too red? There's no such thing. The video looks good. I don't think it sounds good though. So if you do wanna use this as a sort of vloggy phone, I actually do think it could be viable. Like it does look quite sharp, steady, everything like that. It does film at 1080p 60 on the front camera, so pretty solid. But that mic is pretty darn tinny, but maybe the main camera is better. Here we are taking a video. There he is. There's James, I'm jostling. This doesn't have any sort of optical image stabilization, but maybe it still looks good. We're zooming. Wow, what's he swatting at? Wow, it goes 6x. Does it go all the way out to 1x? Cool. (chuckles) (chortles) Okay, so this is really weird. I was gonna talk about the video quality, but there's a related videos bar at the bottom, and these are not videos on the phone. And I'm guessing it's like Bilibili or some other YouTube knockoff. Really weird to have in your gallery. I guess that's a thing. As for the actual video quality, it looked really good. The stabilization looks like there's OIS built in, but they don't set it as any sort of spec, and the mic is still not great. So again, be aware if you're gonna use it. Video, very, very viable on this, but you'd want another audio solution. But that's not why you bought this phone, right? You bought this phone because you are a gamer, so let's try gaming. We gotta talk about what's in this thing. It's got the Snapdragon 778G, which is a pretty strong mid-range performer. You should be able to handle almost anything you throw at it. And then Genshin or you know, COD mobile, any of those more intense games. You'll probably be able to handle medium to high depending on how sensitive you are to that 60 fps. But if it's something more basic or you find with low settings, you should be able to hit 60 easily or over 60 since this screen supports it if the game does. So we're in the settings for Genshin Impact's visuals. I put it into medium and it warned me that this phone probably can't handle it, and it's gonna go into overclocked mode, which is very hardcore. If you do it on low, it says it'll be smooth. But I would like to try medium. I feel like it should be able to handle that and maybe part of it's because it's not fully charged, but I've got confidence. Yeah, it's a little choppy so far, but maybe it just needs to load for a second. I gotta say, even at medium, this game looks pretty good. And now, it is running a bit smoother. But as you walk into different areas, it is choppy. Like this is not a smooth 60. Be aware, again, this is a mid-range phone, so maybe put your expectations in like the mid-range you know? (laughs) Does that make sense? - [James] Medium settings. - Medium. It's got great specs on paper for the camera. It's got great specs on paper for the SOC. It's got IP53 water resistance. It doesn't have wireless charging, but it does have 5G and an IR blaster. It costs 295 US dollars. I do think the price is starting to creep up a little bit there, like 300 US dollars for this. It really depends on your use case. If you're someone who's playing Genshin Impact, maybe get something different. If you're somebody who takes a lot of photos, maybe look into something different. But if you wanna general, all-around phone that's gonna be decent at everything, and just that the odd time that you wanna play games, you can. And you know, when you're out with friends, you just wanna be able to take a quick photo or a video at a concert, I think this will do fine. But I do feel this budget range is starting to get pretty darn competitive as we'll start to see with some of the devices coming up for MWC and into this new year. So if you're in for a phone right now and you really need something that's gonna do you well, this might be it, but this isn't a review. I'm not telling you what to do. Do not say this is a review. (laughs) This is something I've only been using for the last hour, so this phone might not be enticing for very long. Thanks so much for watching. This has been ShortCircuit. Make sure to like, comment, and subscribe right now.",
    "transcript_keywords": [
        "phone",
        "Poco",
        "great",
        "good",
        "Poco phone",
        "pretty",
        "camera",
        "video",
        "bit",
        "James",
        "pretty good",
        "time",
        "yellow",
        "phones",
        "nice",
        "Poco loves",
        "Wiz Khalifa loves",
        "back",
        "kind",
        "photo"
    ],
    "transcript_entity_values": [
        "two-megapixel",
        "Crab Raving",
        "eBook",
        "AMOLED",
        "ten bucks",
        "Nanosys",
        "millimeters",
        "two megapixels",
        "a minute",
        "IR",
        "300 US dollars",
        "only 500",
        "6.67-inch",
        "just five",
        "12-megapixel",
        "a ton",
        "Nanosys",
        "Poco X5 Pro",
        "Selfie",
        "Wiz Khalifa",
        "the year",
        "LTT",
        "1080p 60",
        "21 hours",
        "max",
        "Genshin Impact",
        "2,000",
        "James] Medium",
        "67-watt Euro",
        "first",
        "two",
        "Ali Express",
        "SD",
        "The Great Sony FW900",
        "Behind The Scenes",
        "the Poco X5 Pro 5G",
        "2x",
        "295 US dollars",
        "one",
        "Bilibili",
        "Dust Settle",
        "nine",
        "SOC",
        "1081",
        "second",
        "Genshin Impact's",
        "6x",
        "Floatplane",
        "1x",
        "120",
        "James] Bumblebees",
        "this new year",
        "ShortCircuit",
        "Dolby Atmos",
        "jack",
        "YouTube",
        "MIUI",
        "the Pixel 7",
        "all day",
        "only 7.9 millimeters",
        "60",
        "Michael",
        "MWC",
        "night",
        "Poco",
        "108",
        "AI",
        "Android 12",
        "28 hours",
        "2 million",
        "5,000-milliamp",
        "5",
        "8-megapixel",
        "Gorilla Glass",
        "20 hours",
        "eight megapixels",
        "Floatplane",
        "the orange USB A",
        "Malcolm",
        "a thousand dollars",
        "USB-C",
        "Bubble Shooter",
        "James",
        "Genshin",
        "the last hour",
        "108-megapixel"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "LAW",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "QUANTITY"
    ]
}