{
    "id": "DGNZi7pxC5Q",
    "title": "The 2021 Apple iPad Pro is definitely a computer NOW!",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-06-01T14:39:35Z",
    "video_url": "https://www.youtube.com/watch?v=DGNZi7pxC5Q",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "iPad Pro",
        "M1 Processor",
        "2021",
        "New",
        "Tablet",
        "Touch screen",
        "Mini LED",
        "Bright",
        "NITS",
        "Riley",
        "Unboxing"
    ],
    "views": 645597,
    "likes": 31199,
    "comments_count": 1701,
    "description": "Get a new skin for your new iMac or iPad at   Whoa! The M1 processor and Mini LED make their way into Apple's newest iPad Pro! Riley opens it up and wants to tell you his first impressions.   Buy Apple iPad Pro 2021  On Amazon (PAID LINK):  On B&H (PAID LINK):   Buy Apple Magic Keyboard 2020 On Amazon (PAID LINK):  On NewEgg (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/kOp6",
        "https://geni.us/4UomAbI",
        "https://geni.us/6pfR",
        "https://geni.us/x53rf",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Oh Apple, always trying to convince people that iPads are computers, and no one listened, so then you got frustrated and finally put a desktop computer chip into an iPad. That's right. The iPad pro for 2021. Sorry, you want to see that Andy? I can't do this too much. The 2021 iPad pro has an M1 chip inside, processor, system on a chip, CPU and a GPU and memory. It's the same thing that's in the last year's Macbook Pro and Macbook Air, as well as the Macbook Mini and now the iMac as well. They're just sticking this M1 wherever it'll take. They're just throwing it at the wall and being like, that's a computer now. Like the iPads we've had in previous years were very impressive in the features that Apple added to them, both in terms of iPad OS and in terms of the physical changes they made to the iPad. So I'm actually pretty interested to do this unboxing today, even though the iPad is supposed to look very much similar to the previous iPads. There's a lot of changes here. So let's check it out. Please. As usual, this was sent to us by Dbrand. You know that I'm expecting a horrible shock when I open the box. Will it be unicorns? Will it be transformers fighting in a- anyways, let's find out. Ready? We'll find out together. Three, two, one. Oh. How do I make this dramatic? I'm not even looking. My fingers are going to leave a bunch of fingerprints. Whoa, that's crazy. - [Jono] That's prism. - I don't know what it is. Is that what it's called, Prism? - [Andy] That's the Damascus Skin. - Oh Damascus, like Damascus steel? Shimmer, shimmer, shimmer, shimmy yo, shimmy hey. Dbrand, every hour, every day. I can't rhyme. Nope. Okay, well that's the unboxing guys. Thanks for watching. Go to dbrand.com/shortlinus. Really, short Linus? Go check them out, get a Dbrand skin. We've got the same camera, square rounded corners module thing there, and I think that the back cameras are the exact same. There's like a regular field of view one and then an ultra wide and the LIDAR sensor that was there in the previous two models, I believe. But on the front we got a new ultra wide camera. Do you know about that Jono? It's got a 122 degree field of view, also 12 megapixels, but that uses Center Stage, and you can move around in the iPads, like I see you. You can't get away, Apple knows. What happens on the iPad stays in the iPad, because we took it. Wow, that screen is so bright Because they're like, oh, we use the same Mini LED technology that we had on the Pro XDR display, and we miniaturized it and put it in the iPad. That's their whole deal. So apparently this gets up to 1600 nits peak brightness. What country are we in again? They don't have North Korea. Why not? Whoa. Just to kind of give some context here, so this is the 12.9 inch model. It starts at $1099 with the M1 chip desktop class, sort of, it started with laptops. The smaller 11 inch model starts at $799, which you know, it's an iPad. So when you think about it as just a tablet, that's kind of expensive, but if you think about it as like, okay, it's a computer, like Apple wants you to think, maybe not that bad. Siri, oh what's in the box. What's in the box. That's what you guys do in Short Circuit? It's a charger, USB-C. Actually, it's not just USB-C, it's Thunderbolt people. The 2020 iPad Pro has Thunderbolt 3. This one has Thunderbolt 4, which means we're allowed up to 40 gigabits. That M1 chip I've been talking about sporadically throughout this video, is supposed to perform 50% faster than the previous chip in the 2020 iPad Pro which was the Apple A12Z or Zed for Canadians, and 40% better GPU performance. Although I've taken a look around at some of the reviews that are out there so far, some people get a large difference in performance and other people are like, yeah, it's rendering this video like 30 seconds faster than the old one, and why is it so bright? Why is there so many nits? Because there's 10,000 Mini LEDs in here, with over 2,500 local dimming zones. I want to see that right away, before we get any further. Can I ask Siri to do it? How do you get Siri? - [Siri] Hi, I'm Siri. Hi, I'm Siri. - I like the old one. Hey Siri, turn on dark mode. - [Siri] Okay, dark mode is now on. - I actually did not expect that to work because I have not used Siri in a long time, and the last time I used Siri, she was kind of useless. Wait, but now it's dark. So now I can. So some people were saying there's a blooming issue with this screen, which is one of the things that the Mini LED display is supposed to prevent specifically, because Mini LEDs with all of these like tiny individual LEDs and their local dimming zones, it's supposed to prevent white stuff on a black background from having this like blooming effect, but I'm not noticing it here or am I? This is funny because this is not something I would do with a regular screen, you know, but because Apple has all these bold claims like, oh a Mini LED, its perfect contrast. 1 million to 1 contrast ratio. In the vast majority of cases, you're not going to see any sort of blooming effect, but you know people pick apart these Apple devices. Hey Siri, take a screenshot. Can we turn the lights off? Oh, maybe I do see it now. I feel like I see a little bit of blooming. Yeah, who knows and importantly who cares? Let's move on to, ah, jeez Louise. Okay. One of the other cool things about this year's iPad is the fact that unlike previous models, Apple is actually telling you how much RAM is in it, which again, signals them trying to tell pros of various sorts that this is something they could use. It's a computer. - What's a computer? - What's a computer. The other thing about that memory thing is that there's more memory. There's 8 gigs and 16 gigs, which makes iOS's already stellar memory management even better. I feel like I'm talking a lot about the iPad and not using it. Wait, do I have to go into, I probably have to go to FaceTime to use Center Stage. No you idiot. I feel like I should not take photos just to discourage people from using the iPad as a camera. Hi guys. On the front, we have the same two cameras. So this is the wider view, but we can also switch to the back and now we can do the same thing. Oh, I can't get you all. It's hard to get you all in there this way, but what if I, I mean, that's nice though. If they should have an ultra wide camera on anything, it should definitely be with an iPad, because this is like a big unwieldy square. Selfie with the rear camera because I'm so crazy. What do I do now? The reason that this ultra wide camera is necessary and cool is because when you go to FaceTime it will be able to kind of do this Facebook Portal sort of thing, where it doesn't use this wide shot, it zooms in on one area, and then it'll kind of like follow you around as you're moving around the scene. Yeah, so Center Stage in FaceTime, I think will let you use that but I'm not using FaceTime because I'm not signed into an account, because this is Short Circuit. It's supposed to be short, and I'm taking way too long Jono, I'm so sorry. This is something you can do in previous iPad Pros. Makes it a little bit more like a desktop where you have kind of have icons closer together and then you can have customizable widgets on this side. Oh, I'm a professional. I have an iPad pro. So I'm checking stocks. I'm riding the style of the house. How's crypto these days? But yeah, you can you can have your desktop widgets and stuff. This is going to be the question for me. Every time I've done an iPad video, it's the question of can this be a computer? To remind us of that, let's see if it fits in the old magic keyboard. The thing that will play into whether it can be your main computer is whether they change iPad OS enough to make the people who are skeptical about this, happy. The file manager they've improved a ton, the overall interface, it has mouse and keyboard support, but there are some people are still not happy with the way that like Files is implemented. You can connect to servers but like often the servers will disconnect, and that's annoying to me personally, big server lover. On the plus side, there was some talk when they first announced this that it wouldn't fit with the older Magic Keyboard model that's meant for the 2020 version, but I mean, as you can see it goes in there and it closes. I don't understand what's different about it. I feel like that's more sturdy. Look, it goes on there Jono, aren't you impressed? That's definitely a computer. No comment, wow. Battery is supposed to be around the same, from what I hear, 10 hours I think. I mean, the speakers are the same, I believe. So this is the real test of a XDR Retina Display Mini LED screen Crab Rave. Rave, rave, rave, rave, rave, rave. (upbeat music) I think this is about the same thing we said last time where we're like it's a tablet, but the speakers are really good for a tablet at least. I don't know about other things as comparison points, but it's pretty good for a tablet. As usual, you know, we hear about this having this like really amazing new display and it definitely looks nice I mean, at first glance, but the question is once you compare it to the previous iPad models and to other things that have apparently really nice displays, which I will do in the LTT review, you wouldn't be not subscribed to Linus Tech Tips if you're watching this video. Subscribe to Short Circuit for good measure. I love this video and I love you. Hey, do you want to show me that you love me too, watch more Short Circuit videos, subscribe even and stay tuned for the full LTT review of this, and also subscribe to Carpool Critics Movie Podcast. Help us help you.",
    "transcript_keywords": [
        "iPad",
        "iPad pro",
        "Mini LED",
        "Siri",
        "Apple",
        "Mini",
        "Short Circuit",
        "pro",
        "computer",
        "thing",
        "people",
        "Mini LEDs",
        "short",
        "Rave",
        "previous iPad Pros",
        "previous",
        "iPads",
        "Center Stage",
        "year Macbook Pro",
        "camera"
    ],
    "transcript_entity_values": [
        "40%",
        "iOS",
        "iPad",
        "Carpool Critics Movie Podcast",
        "FaceTime",
        "Macbook Air",
        "Three",
        "year",
        "a ton",
        "One",
        "Canadians",
        "4",
        "Thunderbolt",
        "8",
        "Louise",
        "Center Stage",
        "Selfie",
        "one",
        "122 degree",
        "Crab Rave",
        "Macbook Pro",
        "1099",
        "2021",
        "iMac",
        "USB-C. Actually",
        "Linus Tech Tips",
        "Damascus",
        "every hour",
        "Andy",
        "Siri",
        "10,000",
        "LTT",
        "2,500",
        "up to 40 gigabits",
        "the Macbook Mini",
        "2020",
        "Mini",
        "North Korea",
        "Dbrand",
        "Jono",
        "30 seconds",
        "1 million",
        "Shimmer",
        "the last year's",
        "11 inch",
        "first",
        "M1",
        "1",
        "iPad Pros",
        "these days",
        "16",
        "two",
        "12 megapixels",
        "Zed",
        "12.9 inch",
        "iPads",
        "GPU",
        "LIDAR",
        "iPad Pro",
        "iPads",
        "iPad Pro",
        "10 hours",
        "Short Circuit",
        "50%",
        "799",
        "Linus",
        "USB-C",
        "Siri",
        "Magic Keyboard",
        "Facebook Portal",
        "CPU",
        "Apple",
        "today",
        "previous years",
        "1600"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "DATE",
        "ORG",
        "GPE",
        "NORP",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "ORG",
        "PERCENT",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL"
    ]
}