{
    "id": "DhGTbDh5w6g",
    "title": "You've Never Seen Headphones Like This...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-01-28T21:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=DhGTbDh5w6g",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "halo",
        "halo sport",
        "sport",
        "neuroscience",
        "neuro",
        "halo sport system",
        "brain",
        "brain gadget",
        "cool gadgets",
        "inventions",
        "halo neuroscience",
        "science",
        "smartphone",
        "invention",
        "iphone",
        "awesome",
        "innovation",
        "iphone 7",
        "new inventions",
        "cool",
        "2017",
        "android",
        "apple",
        "video",
        "products",
        "crazy",
        "vs",
        "new gadgets",
        "cool gadget",
        "amazing inventions",
        "future",
        "things",
        "technology (industry)",
        "apple inc. (publisher)"
    ],
    "views": 5696571,
    "likes": 86283,
    "comments_count": 6938,
    "description": "Halo Sport System -   This is the Halo Sport System from Halo Neuroscience. This device claims to improve muscle memory, strength, explosiveness, and endurance.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2kFoWzt",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So today I'm about to do something experimental legitimately experimental This thing in front of me is on the fringe it is a new development it looks from a distance like a pair of headphones but really it's doing something it's doing a lot more potentially you you gotta look at the studies for yourself this thing is called \"Halo Sport\" and it is a brain stimulating device I'm a little bit nervous about trying it out to be quite honest. There's all kinds of trials that have gone on with various athletes from different sports and and people are seeing improvement from wearing this headset in training their brain putting their brain in a particular state before the training begins by stimulating a certain part of the brain that is directly connected to motor skills lifting, lifting weights building muscle strength and performing particular tasks that go along with a sport. Now I have been told there is a little weird sensation when you wear it a little tingling it is actually kind of shocking your brain sort of i don't know let's let's check it out alright so \"Halo Sport\" the company's called Halo neuroscience so very nice packaging so far Oh... factory-fresh some replacement ear cups right and left i like that as it around the ear style big fan of that but these are the magic without these you got nothin'. now these use moisture you actually spray them with a little bit of water before you used them, and they use moisture to sort of help them penetrate i guess or to build up that interactivity between your brain and the headset itself is just install onto the headband like that so that's what it looks like here's what the headset looks like when you're using it whoa.... you have this little spray bottle pull these off, and spray em alright so there's an app to go with it as you imagine \"Halo Sport uses electrical currents~\" for contact I knew it alright you are suppose to completely saturated and install them on there here we go I mean they sound like your average set of high-end headphones so they didn't, they didn't skimp on that front Jack here's what we do we take them out to the ice rink again ok so, i've been wearing this thing around for a little bit one thing I notice these spikes on the top they have to be saturated. i went back into the locker room i got them more soldiers than they were before and we have immediate conductivity here so you can see you can decrease or increase the amplitude. That's the amount that you feel. you can select.. which area of your body your training whether it's your hands and fingers with the right emphasis left emphasis or legs or an arms. For hockey I think hands and fingers with the right emphasis it's probably best for me and the session is about to be 20 minutes so this is what it might look like if I was using this to train a particular skill maybe stickhandling, passing, shooting whatever might be out here obviously we're not going to see results immediately but the goal here is to go out.. stickhandle a little bit, i'll start the session. let's see what happen see how much I feel it on my head too. all right here we go 20 minutes starting now obviously we're not going see the improvement immediately.. but the goal here is.. that right now, my brain is supposedly in.. some special state of neuroplasticity so that these movements are more likely to stick after i'm done with this particular workout also keep in mind, these are headphones. so fol- if I need some music to get more amplified right now and up the workout I could do that too what do you think jack? my stickhandling little. improve there what do you think huh? *laughs* your body's like writing information like your brains an SSD or something you lulled me up with the lesson on stickhandling or something I don't know cause a lot of people were skeptical as well i gotta be clear with you guys guys like \"calm calm\" super skeptical a lot of people talking the big game bout' these youngsters on their team let me tell you something i got- i could teach these youngsters a finger to you gotta bring on the veteran present uncle lew's your guy alright hit me up the phone lines are open BOOOOOOOOOMMMM!!!!! BOOOOOOOOOOOOOMMMMMMMMM!!! some of you are probably wondering like \"hey man what did that feel like on your head?\" it's kinda like a pins and needles. feeling it's like if a.. if your leg fell asleep or something like that or.. you know what im talking about. its that kind of feeling but at the top of your skull so now, now the session is complete by the session they're referring to the headset portion. So now theoretically I take this off and my mind is in this position it's hyperplasticity position now so I've got an hour here this will be the equivalent to.. going straight into action now like I'm actually going to whether it's exercise or gain. who really knows how this technology is going to be used who knows if I'm going to drop that on my way out was it worth it? i hope we brought the heat for you guys. thats what we aim to do that's the process... trust the process. *music continues*",
    "transcript_keywords": [
        "experimental legitimately experimental",
        "Halo Sport",
        "brain stimulating device",
        "experimental legitimately",
        "legitimately experimental",
        "company called Halo",
        "called Halo neuroscience",
        "brain",
        "Sport",
        "Halo",
        "stimulating device",
        "called Halo",
        "experimental",
        "brain stimulating",
        "bit nervous",
        "thing",
        "bit",
        "headset",
        "Halo neuroscience",
        "alright"
    ],
    "transcript_entity_values": [
        "SSD",
        "uncle lew's",
        "an hour",
        "20 minutes",
        "Halo Sport",
        "BOOOOOOOOOMMMM",
        "jack",
        "Jack"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "TIME",
        "TIME",
        "WORK_OF_ART",
        "EVENT",
        "PERSON",
        "PERSON"
    ]
}