{
    "id": "DI2NdqlwnGo",
    "title": "iPhone 15 rumor time #shorts",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-08-04T19:11:22Z",
    "video_url": "https://www.youtube.com/watch?v=DI2NdqlwnGo",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "iphone",
        "tech",
        "mobile",
        "rumors",
        "iphone 15"
    ],
    "views": 26671,
    "likes": 662,
    "comments_count": 26,
    "description": "Just when we thought phones couldn't get more expensive  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "So here are the three biggest things we think we know about the iPhone 15. Thing number one: There's going to be a physical redesign. It's going to be titanium instead of stainless steel like the current iPhone, it's gonna have much slimmer bezels on the side, and it's almost certainly going to have a USB-C port instead of lightning, because the EU is pretty much forcing Apple to do that. Thing number two is it's going to have an action button on the side. Probably something customizable, kind of like on the Apple Watch Ultra where you can use it to launch something or change a setting or what have you. What exactly will be available for it? Don't know, but I love the idea of an extra button. And thing number 3: It's probably going to be more expensive. In addition to all that stuff, there's going to be some chip upgrades, and some overall improvements like we get every year, and there has been reporting, especially by Bloomberg, that says outside the US these phones are likely to be more expensive, and that may even be true in the US. So if you want all this new stuff, and that cool action button, start saving now.",
    "transcript_keywords": [
        "Apple Watch Ultra",
        "Thing number",
        "biggest things",
        "Apple Watch",
        "Thing",
        "iPhone",
        "number",
        "Watch Ultra",
        "Apple",
        "current iPhone",
        "button",
        "USBC port",
        "action button",
        "forcing Apple",
        "side",
        "biggest",
        "physical redesign",
        "expensive",
        "stuff",
        "action"
    ],
    "transcript_entity_values": [
        "3",
        "two",
        "iPhone",
        "EU",
        "Apple",
        "US",
        "Bloomberg",
        "three",
        "the Apple Watch Ultra",
        "USB"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}