{
    "id": "dItCj676GmA",
    "title": "How the iPad Pro is CHANGING music production 🎶",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-11-22T07:32:53Z",
    "video_url": "https://www.youtube.com/watch?v=dItCj676GmA",
    "category": "Science & Technology",
    "tags": [
        "iPad Pro Review",
        "iPad Pro music",
        "iPad Pro music production",
        "iPad Pro beats",
        "Henny tha Bizness",
        "Henny iPad",
        "iPad pro video",
        "iPad Pro video editing",
        "12.9 iPad Pro",
        "iPad Pro review",
        "iPad Pro unboxing",
        "iPad Pro",
        "2018",
        "2018 iPad Pro",
        "New iPad Pro",
        "2018 iPad Pro Review",
        "Review",
        "unboxing",
        "2018 iPad Pro Unboxing",
        "jonathan morrison",
        "tld",
        "A12X",
        "iPad Pro vs PC",
        "Mac Mini",
        "Apple",
        "iPhone XS",
        "iPad Pro Benchmark",
        "iPad Pro Hands on",
        "iPad Pro vs iPad",
        "Ken Lewis",
        "Kendrick Lamar",
        "Drake"
    ],
    "views": 584173,
    "likes": 23734,
    "comments_count": 2325,
    "description": "The iPad Pro music review ft. Henny Tha Bizness & Ken Lewis creating/producing a beat from start to finish! How to make beats on iPad -  I tried to edit a video on the iPad Pro   The Best Music apps for iPad + iOS!   Subscribe for the full iPad Pro review!  Wireless  Henny is using!    KEN LEWIS     This is the new 2018 MacBook Air!   Which has the best smartphone camera?   The Definitive iPhone XR Review:  iPhone XR Unboxing & Impressions!:   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:   Instagram:",
    "description_links": [
        "https://youtu.be/WylD6HK1oVI",
        "https://youtu.be/-ZpsliNmJLo",
        "https://youtu.be/i-qScJuXnTI",
        "http://www.youtube.com/tld",
        "https://amzn.to/2BpNC6q",
        "https://audioschoolonline.com",
        "https://iproducemusic.com",
        "https://youtu.be/ZUbo3q0f2t0",
        "https://youtu.be/oF5vWKfcaow",
        "https://youtu.be/i0JV95H1TDM",
        "https://youtu.be/Bat05NtQ4y8",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- In time, right? Technology's always going to advance and to the person who says, you know, it's not possible to be professional on an iPad in any type of creative, everyday lifestyle, I say OK. You're gonna see because two years down the line, you're gonna be the guy looking to jump in when everybody's 10 miles ahead of you and your gig is gone. The Bizness (upbeat drum music) - [Narrator] This is Henny the Bizness, who needs no introduction, but has worked with the likes of Drake, Kendrick, the list goes on, and I got a chance to hang out with him and see how he now produces all of his music on an iPad Pro. - I wanted to be able to create like I was 18 years old again, right? When I was young, I had one piece of gear. I had one keyboard. I was like, you know the ideas would come quick. I'd be in school, I'd be in college and be around with my boys and we could just vibe and kick it. But as you get older, as you get more successful, you get more gear, you get the best of the best and what happens? Your workflow slows down because now you're just looking for the best of the gear, right? Now you're just looking for the top-notch things and it slows you down. And when I initially got on the iPad four years ago, I wanted something where I could generate ideas quickly. Back when I first started, I was one the iPad Air 2 and I was using BeatMaker 2 and I was showing a lot of the producers in the studio, whether it be like PoLo Da Dawn or Jermaine Dupri, some of the guys out there in Atlanta doing music where I'm at, and word got around that I was making this music on an iPad using a few little devices, a little midi keyboard and I got a call from this 305 number and I was like... Yo, this is Timbo the King and I'm saying, so what? Right, I've never talked to him a day in my life and you know he was telling me how much he enjoyed thinking the idea of using an iPad and always, he's always been on the cutting edge of music. He's always been on the cutting edge of trying new things and so he wanted my take on it. And so we talked for almost an hour. We exchanged information, but from there it was just kinda like, you're doing something right Justin. Just keep going. Just keep going. And so that was just another thing that had me like, OK, this is real, this can really work on a professional level. Today was awesome. It was one of the days where for me it was a transcending moment of seeing the tech that I've been after and the career that I've had start to really mesh together and we created some magic. We created some (muting) fire. I know we're gonna bleep that out, but it's cool. It was just coming together bringing really high-end tech with really, you know, the next level of music and I believe that that is with the iPad Pro for sure. So starting out, I started with the app Block Suede, that's my main app to kinda get ideas generated quickly. So it's a bunch of loops that I'm going through where I'm trying to find that vibe, that energy. So I brought in mode bass and I literally sampled that into Block Suede. (hip hop music) Brought some keys and some pianos. You know, sampled that as well. And I started building the percussion, building the drums, and had a good vibe. (piano-centric music) People ask me about the CME Xkey Air all the time. It's my 25-key Bluetooth keyboard. And when I first saw that keyboard, and I was like, this was made specifically for Apple products, right? It just had that look to it. It's thin, it's lightweight, it's Bluetooth, you can put it in your bag right behind your laptop and the latency, right? The tactile feel of it, you don't feel any type of issues when it comes to trying to get your ideas out. From there we exported that and took the idea and brought it into BeatMaker 3. And then from there, I took the loop that we had, we had a nice loop and we brought in the legend, Ken Lewis, and he wanted to see exactly how that could work, you know, from a mixing standpoint, mixing on an iPad. And I tried to give him a few tips, tried to see if it was real, and, you know, I think (muting) with me. So, at the end of the day I think, he saw the capabilities, I saw, you know, somebody who's a legendary engineer be able to see the possibilities of what I do every day. (piano-centric hip-hop music) - That's nice. - [Justin] Yeah. - That's dope. (piano-centric hip-hop music) (synthesized keyboard) (chuckling) (synthesized keyboard) - When you automate on the fly, so like if you arm, I think it's too complicated right now. - Right, you can though. - But if I armed this and in real time I could-- - Yes. - Manually that would record. - Yeah, that's what you call the midia, midia. Effect the midia, I think that's how you do that. - Yeah? Let's hear that in the whole mix though. And then if I just want to adjust the levels. - Yeah (muffled). (keyboard-centric hip-hip music) - So I could bypass the fuzz and then just get what it's doing without it. (keyboard-centric hip-hip music) - It didn't even dawn on me the fact that if you've been in the era of touching knobs and making sure you're getting the right type of mix kind of from the way you feel it, the way you feel the buttons and the knobs and to be able to have everything so tactile on an iPad, I saw, I saw it. It was like a thing just went off in his brain, and he was like, yeah, this could work. - I never really thought I would be doing this on an iPad. - Yeah. - So... - But from your experience, it's very capable, right? - Yeah, I mean, the thing I love about it is, it's all tactile and I come from old school analog. You know, you have 15-foot mixing consoles in front of you and those have gotten smaller and smaller, but I'm still on an analog board, and one of the reasons I'm on an analog board is because it's all tactile and I can touch it and work it and get the feel for that musical connection that turning the knobs gives you and moving the faders gives you and it feels like one of the things I have always disliked about the mouse that's kept me analog for so long is that that tactile experience of being able to look at the whole console and just grab whatever you want to tweak on the fly and to me, this is like the best version I've seen so far of that in the box. - This I'm not-- - There you go, yeah. - I am definitely going to be like taking this to the beach and putting the headphones on with the controller and sitting there for hours just making music and my favorite part is the tactile response of it that I can just scroll around and I can very easily select everything that I want to do and I don't have to use a mouse to do it. That to me, I love that. It might be awesome to see Dr. Dre on the iPad, right? I mean, the whole lineage with Beats and Apple, and just the fact of somebody like Ken talking about his tactile. So to have him see it, to have him like, OK, I can really-- You know, 'cause I know he was one of the last to say, you know, I'm jumping into digital. Or I still love my tape, I still love my two-inch reels, I still love my analog keyer, but to go full circle and say, I can mess with this, it would be like, OK, yes. Like that the stamp of approval from a producer for sure. (hip hop music)",
    "transcript_keywords": [
        "iPad",
        "Yeah",
        "iPad Pro",
        "tactile",
        "music",
        "Henny the Bizness",
        "feel",
        "love",
        "Block Suede",
        "analog",
        "ideas",
        "wanted",
        "Bizness",
        "keyboard",
        "brought",
        "iPad Air",
        "work",
        "years",
        "things",
        "thing"
    ],
    "transcript_entity_values": [
        "Timbo",
        "the iPad Pro",
        "Kendrick",
        "18 years old",
        "Justin",
        "Today",
        "Block Suede",
        "10 miles",
        "iPad",
        "Ken",
        "Jermaine Dupri",
        "Bizness",
        "Apple",
        "iPad",
        "iPad Pro",
        "CME",
        "PoLo Da Dawn",
        "two-inch",
        "Henny",
        "iPad Air 2",
        "25",
        "Drake",
        "BeatMaker 3",
        "hours",
        "first",
        "the end of the day",
        "one",
        "four years ago",
        "15-foot",
        "almost an hour",
        "Atlanta",
        "Ken Lewis",
        "midia",
        "Dre",
        "BeatMaker 2",
        "305",
        "Yo",
        "two years"
    ],
    "transcript_entity_types": [
        "PERSON",
        "LAW",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "FAC",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "TIME",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "TIME",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE"
    ]
}