{
    "id": "DjiZBPu6sgM",
    "title": "Unboxing Weird Tech from My PO Box",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-01-22T17:41:08Z",
    "video_url": "https://www.youtube.com/watch?v=DjiZBPu6sgM",
    "category": "Science & Technology",
    "tags": [
        "tech",
        "weird tech",
        "unboxing",
        "po box",
        "gadgets",
        "technology",
        "camera",
        "insta360",
        "nixie tube",
        "infinitton",
        "latest gadgets",
        "cool gadgets",
        "austin evans"
    ],
    "views": 1296643,
    "likes": 29211,
    "comments_count": 1185,
    "description": "Weird tech shows up at my PO Box sometimes... Trying Mystery Tech from Amazon:  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=MCueFfNV9S4",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. Today we're going to be checking out some weird tech. We have a PO box listed on the channel, and sometimes companies send us some weird tech. So Ken, please, what is our first item? That was a poor throw. Infinitton, the smartest screen keyboard in the world. I mean, with a Bing button, you know it's gotta be smart. So, there are 15 programmable keys, and each key is 72 by 72 pixels. So, there is a product that I've seen that's kind of similar to this, which would be the Elgato Stream Deck. The idea is that, once you plug it in, you can have each of these buttons be customizable. At least in the Elgato's case, it's usually used for streaming. So, after a few minutes of setup, we have a few things that are programmed in. So, for example, I can open up a Word document, copy and past \"Hey guys, this is Austin,\" and then press the other button to actually launch the channel. This is super simple, and at $150, this is not going to be for everyone, but it's actually kind of decent. USB motion sensor. It places the computer into sleep mode if no motion is detected for a period of time. You could just set the screensaver. I genuinely cannot think of a single reason why you would use this over just setting your computer to go to sleep. Oh boy, the Russian Federation? Oh, this is gonna be exciting. See, the fun of doing this is that usually Ken picks out things that I know he gets on purpose to be terrible, but with this, I have legitimately no idea what's inside this weird box from Russia. \"Greetings Austin, we're a small company \"from Moscow, Russia, and we sent you \"one of our wonderful Nixie tube clocks.\" If you guys have never seen a Nixie tube before, it's essentially like a retro way of looking at the time or numbers or something, and, I mean, I didn't even realize that anyone still made these. (laughing) Look at that! Whoa, that looks so cool! Ooh! That is so cool! And it's not really a traditional piece of tech, but man, that is not what I expected to see today. I was expecting lots of terrible tech and not this really elegant and cool looking retro clock. Two? Two what? Auto water? What? \"Step into the future with touchless faucets?\" Wait, so is the idea that this is just going to be an automatic faucet where you don't have to touch it? Yep, that's exactly what it is. Hey guys, this is Austin, and welcome to Austin's Kitchen Corner, where I review the latest in hot new bathroom gadgets. Oh, so you can actually already tell that, even though there's no water, that the faucet's turning on and off when I put my hand underneath it. The Leagoo S8. Oh, I get it, S8 like a certain other Samsung Galaxy S8. Wow, that's really heavy. Why is it so heavy? So, at first glance, the phone, even though it is similar to the Galaxy S8, actually isn't too bad. So what jumps out to me is that it feels not only a little bit thicker, but a lot heavier, which I actually kind of don't hate. Although, the back is an absolute dust and fingerprint magnet. I can say one thing they did well though, there's a fingerprint sensor at a reasonable spot on the back of the phone, unlike, you know, the real Galaxy S8. Oh, I've got the blur mode. All right, let's try the blur mode. Whoa! Wow, blur mode, not good, not good. How much is this thing? I wonder, I'm actually curious, how much does it cost? The Leagoo S8. Oh, it's only like $100. That actually makes it a lot better. I expected it to be a lot more expensive. It does have a 1.5 gigahertz octacore processor, three gigabyte of RAM, 32 gigabytes of storage, as well as a 3000 milliampere hour battery. I will say though, for around $100, this is actually really nice hardware. Yeah, the software is a little weird and the cameras aren't exactly great, but for $100. Climate Case, insulating smartphone case. Prevents your smartphone from overheating and freezing. Fits all brands and models of smartphones. Man, they're making some bold statements here. (laughing) What? What is this? What? What's inside here? It's so heavy. Oh, there's nothing inside here, it's like gel. So, the idea here is that, if you're gonna go out in a cold area, you microwave this case, and if you wanna go out in a super hot area, you put it in your refrigerator. What? Not only do you have this metal carabiner, which obviously shouldn't go in the microwave, what happens when some person doesn't read the instructions, puts their cold phone inside this, and microwaves the whole thing? Soft Glass, you are unique. Is this a screen protector? What? It's for the iPhone X. Oh, it is a screen protector. Can I have a volunteer to try the Soft Glass screen protector, Ken? Ken? - This is the front, so we do that later, so I guess we peel off the back first. - Yeah, peel off the back. - Just take this off. - Oh, dude. - [Ken] Wow, I think we might've put a good screen protector on my iPhone. - The first time ever. \"Hey Austin, I'm a 360 camera from Insta.\" It's kinda weird that the camera apparently wrote a note. Someone could've just said, \"Hey, \"we have this really cool camera that does these things,\" not \"I am the camera, this is what I do.\" Insta360 ONE, a 360 VR camera. They promise it can do 4K video and 24 megapixel photos in full 360. Inside the Insta360 ONE, we get the camera. So, the idea here is that, not only is this going to be usable as a standalone camera, but if you plug it into an iPhone. Okay, so I am now recording using the Insta360, which obviously will not look quite as good on YouTube, but the idea here is that I can get a full 360 view of pretty much everything around me. And, I mean, it actually looks kinda cool. I've played around with a few 360 cameras like this, and while a lot of them look kind of okay, especially the ones that plug into the iPhone, this actually has really surprisingly decent looking quality. I didn't have high expectations when I saw a 360 camera show up, but I gotta say, this is a lot cooler than I thought. I might actually have to take a closer look at it later. So that's it for this first episode of Weird Tech from My PO Box. Definitely be sure to let me know if you wanna see any more of this stuff in a future video, and I will catch you guys in the next one.",
    "transcript_keywords": [
        "Austin",
        "camera",
        "Hey guys",
        "Hey",
        "weird",
        "weird tech",
        "idea",
        "kind",
        "Elgato Stream Deck",
        "tech",
        "Hey Austin",
        "guys",
        "lot",
        "Ken",
        "cool",
        "inside",
        "screen",
        "Austin Kitchen Corner",
        "screen protector",
        "case"
    ],
    "transcript_entity_values": [
        "the Elgato Stream Deck",
        "Bing",
        "15",
        "ONE",
        "only like $100",
        "Kitchen Corner",
        "iPhone",
        "the next one",
        "three gigabyte",
        "first",
        "RAM",
        "Moscow",
        "the Galaxy S8",
        "Ken",
        "PO",
        "USB",
        "Two",
        "Austin",
        "32 gigabytes",
        "24 megapixel",
        "Weird Tech",
        "Galaxy S8",
        "Insta",
        "150",
        "Russia",
        "a few 360",
        "S8",
        "Today",
        "Austin",
        "4",
        "one",
        "The Leagoo S8",
        "72",
        "YouTube",
        "a few minutes",
        "Samsung Galaxy S8",
        "Nixie",
        "Soft Glass",
        "3000",
        "1.5 gigahertz",
        "My PO Box",
        "Infinitton",
        "100",
        "the Russian Federation",
        "Elgato",
        "today",
        "around $100"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "LOC",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "PERSON",
        "MONEY",
        "GPE",
        "ORG",
        "DATE",
        "MONEY"
    ]
}