{
    "id": "djrllSbfrUA",
    "title": "Ticwatch 2 Review: Buy It Before Fitbit Does",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-01-27T04:06:56Z",
    "video_url": "https://www.youtube.com/watch?v=djrllSbfrUA",
    "category": "People & Blogs",
    "tags": [
        "ticwatch 2 review",
        "ticwatch 2 onyx",
        "ticwatch 2 vs apple watch",
        "best smartwatch 2017",
        "smartwatch 2017",
        "android watch",
        "michael fisher",
        "mrmobile"
    ],
    "views": 344724,
    "likes": 6231,
    "comments_count": 381,
    "description": "The Ticwatch 2 is the first smartwatch you can tickle. More importantly, the Ticwatch 2 is one of the best smartwatches you can buy if you're looking to spend less than $200. Integrated GPS; a special touch-sensitive scroll strip; a fully-round OLED display ... this Android Wear alternative has a lot of features. But does it pack enough smarts to make it your next connected wearable? Find out in MrMobile's Ticwatch 2 Review!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Ticwatch 2 Active:   Ticwatch 2 Classic:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"New Media \" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/k4",
        "http://mrmobile.tech/k5",
        "https://www.premiumbeat.com/royalty_free_music/songs/new-media",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] If you're still interested in a smart watch at this point. Bless your soul. Android Wear is on hold, pending it's next big update Pebble is dead. And the Apple watch is ... (glitch effect) Wait a minute. Didn't I just record this intro? I sure did other me. A few weeks back when Joshua Vergara and I were lining up our favorite wearables in the wake of the Pebble acquisition by Fitbit. But things have changed since then. My leading contender for a Pebble replacement got gobbled up by Fitbit of course. So I thought, well Josh and I often agree on things. Why don't I take a closer look at his choice. I'm Mr. Mobile, and I spend about a week with the Ticwatch 2. The smart watch you tickle. (upbeat music) Okay the tickling bit sounds like a gimmick and maybe it is a little bit, but its also really useful. Rather than a digital crown. Or a smart bezel. The Tick watch resurrects an old idea that I always found underrated. A touch sensitive strip that lets you control some of the interface without obstructing the display with your finger. It works well on the Ticwatch 2. Though the strip here isn't where you might expect. It's on the lower portion of the casing. Closer to your wrist. While we're here, lets make something else clear. This watch is pretty thick. You need to be ready for that. Looking at it head on though, it's pretty attractive. I have the more expensive Onyx trim for review. With Sapphire cover glass and metal band. And its minimalist restraint is refreshing. And Android is what's powering the on screen experience here. Specifically version 5.1 with a custom interface called ticwear, riding on top. It's almost a blend of Apple's watch OS and Android wear. I know that sounds like kind of a nightmare, But it's actually very usable. Notifications arrive with a buzz and a ding. And gather in a list, you swipe up to see. You swipe down for widget versions of settings, health, weather, and other apps. And swipe left for a very simple app launcher. This all comes up on a round OLED screen, that's plenty sharp and saturated. Though I wish it got brighter outdoors. Swipe right, and you open up the watches biggest stand out. Natural language search. Ask the watch to show you a local restaurant. And it gives you a few options. The highlights of which you can save to your widget list so you remember them later. Reminders, alarms, dictated replies. It's all here. And it works very well. This isn't surprising, when you consider that the maker of the Ticwatch isn't just another anonymous company. It has deep ties to Google. Having been founded by ex-googlers, and partially funded by Google as well. I should mention that I only used the Ticwatch 2 with Android phones. The iPhone does such a good job of crippling anything that is not an Apple watch, that I honestly didn't even bother. Other highlights range from the expected. Built in heart rate sensor and health tracking. To the delightful. Built in GPS. And a preloaded memo function for quick voice notes. Voice calls through Bluetooth are also supported through the somewhat thin and tiny speaker phone. And yeah, other low points exist too. Battery life is nothing special. About a day and a half between recharges. And the so called volcano charging pedestal looks and feels pretty chintzy. Also, the ecosystem is predictably thin. And the fact that you need to side load an APK to shop the app store, feels ... yuck. Finally the watch is rated for ip65 ingress protection, which means it's completely sealed against dust, but only splash proof. You can't take it swimming. The Tickwatch 2 starts at $199 for the active edition. And goes up to $249 or $299 for the classic oak and onyx versions. You can look at that pricing in two ways. If you are not sold on smart watches, this one isn't going to change your stance. You will probably want to wait for the next generation of wearables. Whenever that comes. If, on the other hand, you are already on board with the conveniences that smart watches bring. Now however minor they appear to skeptics, they do exist, and I like them quite a lot. Then honestly your options for an entry level device are slimming by the day. The Ticwatch 2, with it's minimalist looks, novel interface, and excellent voice commands. Brings a lot of bang and performance for the buck. Buy it. Before Fitbit does. The Samsung Gear S3, the Apple watch series 2, and two versions of Casio's monster smart watch. One thing they all have in common, is that I've worn every one of them. Check out the Mr. Mobile channel on YouTube for a closer look at these, and be sure to subscribe so you don't miss more mobile tech video landing every week. Until next time, thanks for watching. And stay mobile my friends.",
    "transcript_keywords": [
        "Apple watch",
        "watch",
        "smart watch",
        "Ticwatch",
        "smart",
        "Apple",
        "Android",
        "Android Wear",
        "Pebble",
        "Fitbit",
        "Mobile",
        "swipe",
        "big update Pebble",
        "Apple watch series",
        "smart watches",
        "Tick watch",
        "update Pebble",
        "Joshua Vergara",
        "versions",
        "closer"
    ],
    "transcript_entity_values": [
        "A few weeks",
        "Josh",
        "YouTube",
        "Casio",
        "Fitbit",
        "The Tickwatch 2",
        "about a week",
        "Apple",
        "299",
        "every week",
        "About a day and a",
        "199",
        "Mobile",
        "iPhone",
        "2",
        "One",
        "the Ticwatch 2",
        "Joshua Vergara",
        "up to $249",
        "Michael",
        "Google",
        "two",
        "the day",
        "The Ticwatch 2",
        "Onyx",
        "The Samsung Gear S3",
        "Ticwatch",
        "Pebble",
        "a minute",
        "Sapphire",
        "Pebble",
        "Android",
        "ip65"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "GPE",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}