{
    "id": "dKq_xfCz3Jk",
    "title": "ROG Phone 6 Pro Review: Daily Driver Material!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-07-05T12:30:45Z",
    "video_url": "https://www.youtube.com/watch?v=dKq_xfCz3Jk",
    "category": "Science & Technology",
    "tags": [
        "ROG phone",
        "Asus phone",
        "gaming phone",
        "MKBHD",
        "ROG Phone 6",
        "Asus ROG",
        "ROG Phone 6 Pro",
        "ROG Phone 6 review"
    ],
    "views": 2723577,
    "likes": 108968,
    "comments_count": 4661,
    "description": "The gaming phones are refining themselves into bona fide daily supercars. And it should, for 1,299  MKBHD Merch:   Tech I'm using right now:   Playlist of MKBHD Intro music:   Phone provided by Asus for review.  ~",
    "description_links": [
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(logo whooshing) - Hi, what's up? MKBHD here. So this is the ROG Phone 6 Pro. I just wanna start off just by reading you the specs of this phone that I'm holding in my hand right here. Okay, so it has a 6.8 inch 165 hertz AMOLED display. It's got a second OLED screen on the back too. Snapdragon 8+ Gen 1 chip, which has cores running at 3.2 gigahertz. 18 gigabytes of RAM. 6,000 milliampere battery with 65 watt fast charging. Dual front-facing stereo speakers, triple cameras, including a 50 megapixel main camera, and two USB-C ports, and a headphone jack. Thanks for watching. Now, this phone's specs are ridiculous, and they're ridiculous because it's a gaming phone. And with a lot of these gaming phones in the past few years, you could really say they were focused on one true goal: to just be as great for gaming as possible. But with the latest generations, you can kind of tell they actually have two goals now: to be incredible with gaming, and to also be really great to live with as a daily driver. Luckily, a lot of what makes a phone great for gaming also makes it great for using in everything else, but there are still definitely some challenges as you'll see in a second. It's kinda like how sports cars back in the day notoriously used to be super difficult to drive, tough manual gearbox, really harsh ride. Great for some high performance fun, but you wouldn't wanna drive it every single day like that. And so in that analogy, the ROG Phone is like a Porsche 911, where it's taking the high performance stuff but it's also easier to daily drive, at least it would like to be a Porsche 911. So as far as performance goes, as crazy as it sounds, there's really not that much to say here. This is now the fastest phone I've ever used, not even on paper, but just as far as pure responsiveness and feeling like my every touch and input is immediately responded to. This sets the benchmark now for me. I drag my finger across the display and everything moves about as perfectly one to one as I've ever seen: scrolling, animations, opening up apps, multitasking, all that stuff. It's just crazy fast. It's the new chip, of course, the Snapdragon 8+ Gen 1, but also this is now the fastest screen I've ever used, the 165 hertz display, and it's running with a 720 hertz touch sampling rate. That's double last year, which brings the touch latency down to 23 milliseconds. So you really notice things just follow your finger around the screen being super tight, and everything being real snappy across the board. If it's synthetic benchmarks you care about, here they are. They'll show you it is slightly more powerful and also slightly more power efficient than the Snapdragon 8 Gen 1, and technically still behind the iPhone 13. But I'm telling you right now, 9 times outta 10 the ROG feels faster than anything else. And then even with the little stuff, if someone goes all the way to the max for performance, it has UFS 3.1 storage, it has LPDDR5 RAM instead of DDR3. It even has Wi-Fi 6E. Any spec that you can think of at the very max, this phone has it. So I don't even have to be a hardcore gamer, or a PUBG enthusiast or anything to understand that if you throw a game at this phone, it's probably gonna be able to handle it. So I'm gonna leave the gaming testing to the gaming enthusiasts, but then what about all the time that you're not gaming? That's probably even more time than when you actually do play games on the phone. How does the sports car drive when it's not on the track? Spoiler alert, pretty good. There is 18 gigs of RAM in this phone. Like I said, do you really need 18 gigs of RAM to play a single game? No, I don't think so. I think that's for the headline. But lots of RAM does help with multitasking. So I find myself using the phone, flipping back and forth between five or six open apps easy. It keeps up no problem, keeps 'em all open. This is also the best display yet on a gaming phone, not just in refresh rate, but in brightness and overall quality, they keep getting better. This is a Samsung built MLED panel that they've tuned to be really, really fast, but it's still got improvements in color accuracy. It's HDR 10+ certified and it gets up to 800 nits. It's not quite flagship levels, but very usable outdoors and in most environments. The haptics are way better. This is one of the things that was bad in the last phone, but they turned the haptics all the way up. They've got a new motor in here. And so anytime you're scrolling or typing or bouncing back and forth on things, you really feel the clicky, it's a good haptic motor. And the under display fingerprint reader, which also was bad on the last phone, is much faster. So it seems like ASUS was at least listening about the stuff we were nitpicking about in the last ROG phone for daily use. You've probably also noticed triple cameras on the back just like the ROG5. These are passable cameras. So they have a new 50 megapixel primary camera, like I said, in here. It's given me decent images. To their credit, ASUS usually has pretty good software tuning from my experience, but I'm getting B- to B+ pictures in good lighting. It's just not very consistent with exposure or contrast. So some of 'em look fine, some of 'em just like flat and a little overexposed. To give you an idea, this is a Sony IMX766 sensor, the same one you see in phones like the OPPO Find X3 and the OnePlus Nord 2T, both of which are under 600 bucks. And you're probably not buying this gaming phone for the cameras, but at least for the money you'd like it to be able to keep up with the other premium-priced flagship phones out there. And it's just a level behind, it's nipping at their heels. Matter of fact, let's just get it all in one place now. So if you were thinking about getting a phone like this and these following things don't scare you off, then it might be a good phone for you. So the camera's definitely a weakness, especially the camera layout choice. Even if this primary camera is passable, I hate this camera layout. It's a primary camera, then a 13 megapixel ultrawide, which is a little softer and worse. Whatever, that's not a shock. But then, the third camera is a macro camera instead of an ultrawide. And it's not even a good macro camera. So the cherry on top is they bury the macro mode like deep in the settings and like alternate photo modes, so you'll almost never actually use it. But they do prominently have a 2X button right here in the normal view finder, which is just a 2X crop on the main camera. You don't have a telephoto camera, just put a telephoto camera there instead. Anyway, so that's one. Then, there's no wireless charging. So they reoriented the ROG vision display on the back of the phone. It still does light up and play animations when the screen is on and when it's charging. When you have an incoming call or any other notifications, it's still super customizable and very unique to this phone, but it does mean there's no room on the back for wireless charging so that's another thing. And then, there's just the sheer size of this phone. I say it every year, but it's like the biggest phone that I review, and it's not trying to be sleek at all. They've kept the huge bezels around on the top and the bottom, huge stereo front facing speakers in there. It's thick, but hey, you know what? It's a form factor where if you're gaming a lot, you spend a lot of time holding it in landscapes, so you're gonna need some spots for your thumbs so you don't block the screen when you're gaming. That's all good. It's got some extra thickness for extra cooling. You got that extra USB port on the side. That's good for charging the 6,000 milliampere battery at up to 65 watts with the included charger. So that's the double play of great battery life and very fast charging and a headphone jack. I mean, it's just ASUS and Sony keeping headphones jacks around their premium phones at this point. But just all this stuff takes up space. It's a big phone. So yeah, also there's little things like the IPX4 water resistance rating isn't quite up to flagships of this price. Might not matter to you unless you get really, really sweaty while gaming. But overall, ROG Phone 6 Pro at the top of the lineup is a great overall bump up from ROG 5 Ultimate. That's what they're calling it. So yeah, it's a great high-end super performance-oriented phone wrapped in a Cyberpunk package with text printed all over it. And it happens to be a pretty good daily phone too if those couple of things don't get to you. And there's gonna be people always out there who want the crazy exotic McLaren or hardcore Lamborghini, stiff suspension, real tight steering and handling. And that's fine, but I guess the difference is in the car world, people who get cars like that usually have a different car that they drive most of the time daily and they have the fun car. But for a phone, you typically just have one phone, so you need it to do double duty. So I do think the softening of this gamer phone into a more palatable daily phone and more well-rounded phone is a good thing. So yeah, props to ASUS for that, good looks. Either way, that's been it. Thanks for watching. Make sure you subscribe if you haven't already and I'll talk to you guys in the next one. Peace.",
    "transcript_keywords": [
        "Phone",
        "ROG Phone",
        "camera",
        "gaming",
        "gaming phone",
        "ROG",
        "good",
        "great",
        "phones",
        "RAM",
        "back",
        "daily phone",
        "things",
        "display",
        "cameras",
        "good daily phone",
        "daily",
        "charging",
        "ASUS",
        "drive"
    ],
    "transcript_entity_values": [
        "every single day",
        "13 megapixel",
        "3.2 gigahertz",
        "IPX4",
        "AMOLED",
        "MLED",
        "9",
        "Wi-Fi",
        "50 megapixel",
        "one",
        "6,000",
        "the ROG Phone",
        "ROG Phone 6 Pro",
        "the day",
        "ROG 5 Ultimate",
        "third",
        "ROG",
        "8",
        "Sony",
        "10",
        "between five or six",
        "18",
        "daily",
        "600 bucks",
        "USB-C",
        "18 gigabytes",
        "165",
        "ASUS",
        "Snapdragon 8",
        "23 milliseconds",
        "Porsche",
        "65 watt",
        "second",
        "3.1",
        "max",
        "911",
        "hertz",
        "RAM",
        "the past few years",
        "6.8 inch",
        "DDR3",
        "2X",
        "USB",
        "Lamborghini",
        "jack",
        "720",
        "PUBG",
        "ASUS",
        "two",
        "last year",
        "Samsung",
        "up to",
        "the OnePlus Nord 2T"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "LAW",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "LAW",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG"
    ]
}