{
    "id": "dl_RJ22hRIQ",
    "title": "How Fast is 5G on a Mountain?! - Lets find out...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-06-02T13:15:04Z",
    "video_url": "https://www.youtube.com/watch?v=dl_RJ22hRIQ",
    "category": "Howto & Style",
    "tags": [
        "Does 5G work in the mountains",
        "5G",
        "how does 5G work",
        "How fast is 5G",
        "mmwave 5g",
        "wideband 5g",
        "tmobile 5g",
        "verizon 5g",
        "best 5g",
        "5G: Explained",
        "how 5g works",
        "speed test",
        "5g network",
        "5g speed test",
        "5g explained",
        "5g vs 4g",
        "how to",
        "5G testing",
        "Truth about 5g"
    ],
    "views": 347883,
    "likes": 22502,
    "comments_count": 1524,
    "description": "I have never used 5G before... until now. Huge thanks to T-Mobile for letting me borrow a Samsung Galaxy S21 5G and sponsoring this video. Today we are going to find out if 5G works up here in the mountains!  T-Mobile has the largest 5G network in the USA covering over 80% of Americans. #ad   The camera I used to film this video:  Wide angle lens:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/2qiYM4u",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "So, little confession, I've never actually used 5G before. My current phone is about 2 years old and is not 5G capable. In order for a phone to be 5G it needs little 5G antennas inside it. Kind of like with a car, if you want to listen to the radio, it needs a radio antenna. No antenna, no radio. Well today T-Mobile's going to change that. They've loaned me a Samsung Galaxy S21 5G, you know, the one with the 120 hertz display and the three cameras on the back, that has the built in 5G antennas so I can test out 5G for myself. I have a video I need to upload and I'm going to do it entirely from this phone and it should be interesting because I live next to the mountains here in Utah. We'll see how 5G really works, see if it's the future, and huge thanks to T-Mobile for sponsoring this video. They have the largest 5G network in the USA, so it should be interesting. Let's get started. [Intro] So right now I'm in Park City, Utah, which is pretty high up in the mountains. About 7,000 feet above sea level. And I have a video on my phone that I need to upload onto YouTube. It's about 2 gigabytes worth of footage so it's a pretty big file, which means it would be helpful if I had data speeds that were as fast or faster than my home wi-fi, which is where 5G comes in. T-Mobile has 5G coverage in all 50 states. It covers 80% of Americans in over 9,000 towns. And includes 280 million people. [Random Guy] Dude, I love your videos! You helped me fix my iPhone 7 like forever ago. [Zack] I appreciate it! Thanks for saying hi. [Guy] Sorry for interrupting. [Zack] You're fine. Oh no, not a problem at all! Right now I'm in the center of town, so the download and upload speeds should be pretty good. Let's check it out. There are different types of 5G as well. The high band, or millimeter wave 5G found in large cities will be faster than the midrange 5G that's found out here in the mountains. But it's still 5G, and it's looking like on my Galaxy S21 5G we're getting downloads of 338 megabits per second and uploads of 60.4, which is about 150% faster than my personal home wi-fi which is pretty impressive. By comparison, I have a Verizon phone here on LTE and we're getting about 76, which is about a quarter of the speed, with an upload of 37. I was hoping Verizon had 5G here, but it didn't show up. But this is still an interesting comparison. 5G has really stepped it up over the last couple years, but that's here in the middle of town, so I think we should head out towards the mountains a little bit and see what the speeds are like over there. So now we're about 10 minutes outside of the city in a large hill nestled up a little bit more into the mountains. And let's test that 5G speed here. Also remember that 5G isn't all just about the speed either. Yeah, it could be up to 15 times faster than just regular 4G, but it also has more bandwidth. Do you remember back in the good old days when we were able to go to concerts, or movies, or anywhere with large groups of people? And a lot of the time when you're in that large group, your cellphone speed slows down. You're not able to use data as well. That's because the bandwidth of 4G isn't able to handle large groups of people in a small area, but 5G has a lot more bandwidth and will be able to handle more devices connecting in a small area. And it looks like here on my Samsung Galaxy S21 5G, we get a download megabit per senod of 258, as well as an upload of 46.7, which is still faster than my home wi-fi. Jumping over to the Verizon regular 4G, we get a download of 83.1 and an upload of 20.9, which is still good, but quite a bit slower than 5G which is what we're here to test. And when it comes time to upload my 2.5 gigabyte YouTube video, it looks like it's going to take about 7 minutes, which is pretty convenient considering that I'm outside in the mountains. Overall I think that was a pretty fun experiment. 5G has changed a lot since I got my phone 2 years ago. And I think I'm going to have to make sure that my next phone has those little 5G antennas inside of it. It's nice having data speeds as fast as wi-fi when I'm out on the go and not around my computer. As always, let me know what you think down in the comments below. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "upload",
        "phone",
        "pretty",
        "mountains",
        "Samsung Galaxy",
        "faster",
        "large",
        "Galaxy",
        "video",
        "speeds",
        "speed",
        "antennas",
        "Verizon",
        "wifi",
        "radio",
        "Utah",
        "antennas inside",
        "home wifi",
        "interesting",
        "TMobile"
    ],
    "transcript_entity_values": [
        "about 150%",
        "T-Mobile's",
        "Galaxy S21 5",
        "T-Mobile",
        "wi-fi",
        "15",
        "about 2 years old",
        "80%",
        "about 10 minutes",
        "20.9",
        "2.5",
        "120",
        "About 7,000 feet",
        "three",
        "Samsung Galaxy S21 5G",
        "83.1",
        "about 7 minutes",
        "280 million",
        "LTE",
        "4",
        "258",
        "Americans",
        "5",
        "USA",
        "Park City",
        "the last couple years",
        "millimeter",
        "Verizon",
        "2 years ago",
        "today",
        "46.7",
        "37",
        "over 9,000",
        "Zack",
        "60.4",
        "about 76",
        "YouTube",
        "50",
        "Utah",
        "338 megabits",
        "Verizon",
        "about 2 gigabytes",
        "about a quarter"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "ORG",
        "PRODUCT",
        "ORG",
        "LOC",
        "CARDINAL",
        "DATE",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "GPE",
        "GPE",
        "DATE",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}