{
    "id": "dM7hX-b3rTg",
    "title": "Can RGB be minimalist?  - Philips Evnia Peripherals Launch Event",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-11T21:01:58Z",
    "video_url": "https://www.youtube.com/watch?v=dM7hX-b3rTg",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "philips",
        "evnia",
        "new",
        "release",
        "launch",
        "event",
        "paris",
        "france",
        "minimal",
        "minimalist",
        "office",
        "work from home",
        "gear",
        "gamer",
        "mouse",
        "keyboard",
        "headset",
        "headphones",
        "rgb",
        "hotswap"
    ],
    "views": 182045,
    "likes": 6713,
    "comments_count": 468,
    "description": "Learn more about NexiGo's family of webcams here:   After checking out Philips' new monitors, Plouffe got to check out the new Evnia line of keyboards, mice, and headsets. Their minimalist in design but also in features. Does the price make sense, or should you stick to something more established?  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 We miss Plouffe... 0:07 SPK8708 Wireless keyboard and SPL7508 RGB mousepad 1:28 SPK9708 Wireless mouse 2:49 Sponsor - Nexigo 3:15 TAG7208 Wireless headset 4:30 The 5000 series 4:57 TAG5208 Wired headset 5:41 SPK8508 Wired keyboard 6:01 SPK9508 Wired mouse 6:57 Overall thoughts 7:30 Outro",
    "description_links": [
        "https://lmg.gg/NexiGo",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Plouffe is still in Paris. I wonder what he's doing right now, right now, right now. - The switches feel alright. Oh and it's got media keys. Oh, sick. I like the roller. I wish I could take a key cap off. I don't know if it's hot swap but- - [Man] I don't think it is. - No, keyboard itself could be a little heavier but for a full size that's not, you know CNC aluminum, it's actually reasonably hefty. Looks like this is probably two or three pounds or so. And you know what? It doesn't really move around all that much, which is great. The keyboard is okay. It's about what you can expect from a major brand like Corsair or Logitech. The wireless one is a little pricey at 180 and I wish it was hot-swappable. We were able to talk to a Phillips rep and they confirmed that they're at least looking into offering hot-swap in the future. I think my only complaint about the desk pad, 'cause I actually love that the cable is on the left side, because your mouse is usually over here and that's gonna get affected by the ridge. The cable rests on it and stuff. It just looks bad. So I like that it's on the left here. The only thing I'm not a big fan of, though, is the little Phillips logo here. It's not the end of the world and everyone's gonna brand their stuff. Look at Razer's stuff, you know but honestly you're not gonna notice that most of the time. I like that it's a long soft pad. It's nice and flexible, fits really well and I do love the diffusion around the edges. One thing I forgot to mention about all these is it's got a really decent magnetic wrist rest so it just kind of goes in, slots in, no problem. I personally like a cloth wrist rest but this is perfectly fine for most people. It's just a plastic material, so it's nice and lightweight. The mouse is okay. It's a little heavy so if you're a big fan of like the G502 HERO with all the weights in it, that might be more for you. For me personally, it's actually fine 'cause I do like a heftier mouse. It's wireless but it looks like you can play plugged in. Just charge it up and whatnot. The RGB I actually love, it's a really nice strip along here and I love how they've got it on the roller as well, on the mouse wheel, and then they've got a diffusion bar on the very bottom but it looks really good. I love a nice diffusion bar around stuff because it just glows nicely. I'm a big fan of like, neon and RGB, right? It's got this weird ridge structure and you think that might be uncomfortable but you don't even notice it when your palm is resting in it. It feels really good in the hands. I love the shape. I think my only complaint is the forward side button, is a little hard to hit because this one on the other, on the back, is a little longer than it, so it's hard to hit this one by itself without hitting the back one as well. I wish David were here 'cause he's a bigger mouse guy but you know what? At least for me, it's not bad. And I mean, I'm a gamer, but you never know. One thing I forgot to mention is the DPI swap button just behind the scroll wheel. Pretty standard in gaming mice these days, but I like how it's RGB and it matches the rest of the mouse. It's 99 for the wireless version. If you like the look and don't need the lightest mouse, it could be worth checking out. (upbeat music) - NexiGo. If you're working from home, and are in need of a new webcam, NexiGo has a wide variety to choose from to keep you looking sharp on your conference calls. Whether you're on a budget and need high quality video or you just want the best possible webcam, regardless of the price, their selection of webcams and webcam accessories will help you look and sound your best. Even if you're looking for something more in the middle. NexiGo has you covered. So take your webcam setup to the next level and get a NexiGo webcam using the link down below. - I like the cans, they're really comfortable. It's really like, open on-ear design. Sounds like it's closed back, not open, which is good for some people, not ideal for other people. As you can see, it looks like a really comfortable, soft, cloth material. They feel good and I love the way they look. I love the RGB on the side. They got some Doom Eternal going, it's a cut scene, so I got some good, like, dialogue and stuff. It's pretty clear. I'm not the biggest audio file, this is more Adam or someone else's role, but it sounds good to me. Really nice sound stage. Like I said, I wish they were open back, for me personally, but for someone who really wants to get into the game and not have distractions, close back is probably the way to go. As soon as I've got music playing, I can barely hear myself, I can barely hear the giant crowd that's around me right now. It's pretty good. I'm a really big fan of the dual band design. Personally, I find that it conforms to your head really well so you don't get that like, really hard, especially if you wear a hat like I often do, you don't get that like hard, kind of, band on the top of your head after gaming for like hours on end. And I've only worn these for, you know, 30 seconds, a minute but I don't think that they would get uncomfortable. I guess the one problem is, they are a little small on the in ear, so if you've got big ears, that might be something to think about. It might not fit your head super well or at least your ear anyway. Now we've got their 5,000 line, which is supposed to be the more budget oriented. There is a 3000 that's even more budget but this should be a bit more friendly for the kind of the mid-range gamers who can spend a little bit of money but not an arm and a leg for the more premium products. They've got a headset, a mouse and a keyboard all in the same line. One of the big differences, is that this is wired and me personally, I actually prefer wired. Call me crazy if you want, but whatever. It just always works, which is nice. The headphones, honestly, feel pretty similar to the more expensive ones except they're all black and like I said, they're wired. The one good thing about not having an amazing phone is, I still have a three and a half millimeter jack, so I'm gonna listen to whatever I want and check out the quality of the headphones with my own music, which will be great 'cause it gives me a good idea of like, you know, stuff I listen to and whether or not I like it or not. You gotta crank it. Hold on. It's not bad, the base isn't terrible but I think they sound okay. And the price we've heard earlier, it's not bad honestly. I like them. For someone who wants something with RGB and they want something decent, the mic is probably okay too and it still connects through 3.5 millimeter. If you're not a big fan of wireless, this might be the choice for you. The keyboard and mouse we've got for the 5,000 series are wired. That's the main difference. So they'll probably be a little bit cheaper but other than that the quality is basically the same. The model is almost the exact same. The roller bar, they've got the media keys, they've got the addressable RGB per key. The key caps are whatever, but they feel good. I actually really like it. As for the mouse, it's not white. They've gone black for the wired options and you can't unplug it, obviously, like it's just full wired. It feels a little bit lighter than the white one. I'm not sure. That's probably because of the battery I guess. So if you want a lighter mouse, this might be the one for you. I personally prefer wired anyway just because like, it just works. I hate dealing with wireless stuff. Otherwise it's essentially the same. You've got the same shape, a bunch of RGB on the top and on the side here. The big thing is that I can't remember what the exact numbers are for the each model, but one of them is like a 16,000 DPI and the other's a 20,000 DPI, so it's not quite a hero sensor from Logitech but 20,000 DPI, 16,000 DPI still pretty damn good. As for which one I prefer, between the black and the white, I'd probably go for the black one. It's probably gonna be cheaper. It feels a little lighter, like I said, probably because of the lack of a battery and I just prefer wired. This feels good. I like it, I like the way it feels in my hand. I like a bigger mouse so it's good for me. We're back. Wow, what a trip. I am exhausted but it was a lot of fun and we got some brief hands on experience with a few new products. Honestly, the pricing for the wired versions all seems pretty reasonable, particularly the headset. I just wish you could get either line in either white or black so that you're not price gated if you would, you know, strongly prefer the white peripherals but maybe you wanna stay wired or maybe you can't afford to shell out the extra money for the white stuff. Anyway, this stuff is all coming out June 2023 so keep your eyes peeled. If you wanna see more of our adventures around Paris, us traveling here or the event itself, make sure to check out the Float Plane exclusive. Oh, okay. That's Short Circuit. Thanks for watching. It was a fun Phillips event, and I'll see you guys when I see ya.",
    "transcript_keywords": [
        "good",
        "mouse",
        "RGB",
        "wired",
        "stuff",
        "love",
        "big fan",
        "big",
        "DPI",
        "nice",
        "personally",
        "feels",
        "Pretty",
        "back",
        "feel good",
        "white",
        "prefer wired",
        "fan",
        "webcam",
        "thing"
    ],
    "transcript_entity_values": [
        "Paris",
        "Phillips",
        "June 2023",
        "two or three pounds",
        "Adam",
        "One",
        "one",
        "Corsair",
        "20,000",
        "Logitech",
        "3000",
        "99",
        "G502",
        "David",
        "the Float Plane",
        "30 seconds",
        "three and a half millimeter",
        "these days",
        "webcam",
        "180",
        "Razer",
        "16,000",
        "like hours",
        "3.5 millimeter",
        "CNC",
        "RGB",
        "jack",
        "5,000"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}