{
    "id": "dNTwVB3C9io",
    "title": "OnePlus 8 Pro Durability Test - a 'bit' more than you might think...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-04-14T15:50:50Z",
    "video_url": "https://www.youtube.com/watch?v=dNTwVB3C9io",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 8 Pro",
        "OnePlus 8 pro durability test",
        "OnePlus 8 pro unboxing",
        "OnePlus 8 Pro 10bit",
        "OnePlus 8 pro display",
        "OnePlus 8 pro review",
        "OnePlus 8 Pro bend test",
        "OnePlus 8Pro",
        "One plus",
        "Flagship killer",
        "oneplus 8 pro specs",
        "oneplus 8 vs oneplus 8 pro"
    ],
    "views": 2910097,
    "likes": 100012,
    "comments_count": 6849,
    "description": "OnePlus is back again with the OnePlus 8 Pro. This time pulling out the stops with a killer wireless charger (That'll be fun to see the insides of) And a 10bit screen. Not every pixel is the same when it comes to smartphones. 8bit pixels dont show as much color as 10bit pixels. And this 'professional' phone is actually using a 'professional' grade screen that professionals actually use for their profession. I'm impressed.   The OnePlus 8 5G Giveaway from T-Mobile:   Check out the teardown here:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/Ol65mVa-Kuw",
        "https://youtu.be/HRBR8uAbvg8",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The OnePlus 8 Pro. I've been doing durability tests on OnePlus phones ever since the OnePlus 2 came out about 5 years ago, and they've all done a pretty good job of surviving. Inside the box we get a fun clear Never Settle case. Free protection is always the best protection. Along with a red charging cable and a 30 watt warp charging block. This OnePlus 8 Pro has some major improvements...changes that I'm actually pretty excited about. It's time to see if it can survive a durability test. Let's get started. [Intro] Right off the bat we can see that there's a new hole punch camera up there on the left side. This is the ultramarine blue version. The biggest difference between this smartphone and almost any other smartphone in existence is the display. I was extremely surprised when OnePlus announced that they added a 10 bit display to the OnePlus 8 Pro. I'll explain more in a minute, but the short of it is this phone can display over 1 billion colors. A normal smartphone like the iPhone 11 can only display 16 million colors. Kind of mind blowing. Even my Samsung Note 10 Plus can only display 16 million colors. So having a 1 billion color display on this OnePlus 8 Pro is pretty mind-boggling. Normally I'd always say that true beauty lies on the inside, but with 1 billion colors I'll make an exception for this screen. Still scratches at a level 6 with deeper grooves at a level 7 though. Up here at the top of the phone we have a small plastic earpiece slit which isn't coming out on it's own any time soon. We also have a 16 megapixel front facing hole punch camera which is also protected by the front glass screen. This vibrant frosty blue color is actually pretty cool. The sides are made from aluminum, along with the metal volume rocker. Up here at the top of the phone there's an interesting indention. Kind of reminds me of a fuller groove we usually see in knives or swords. Some people would call it a blood groove. A fuller actually gets rid of weight while making the shape of the metal stronger. The groove up here at the top though is probably more aesthetic than anything else. The right side of the phone has a power button and the triple slider, which is a feature I think every phone should have. They can physically change between a ring, vibrate, and silent. It makes it really easy not to disturb other people...you know, if we ever get to go out in public again. The OnePlus 8 Pro does have an official IP rating this time around. We'll have to see what most of that protection looks like when we get inside the phone, but from out here we can see the red rubber ring around the dual SIM card tray. The IP 68 rating is a nice peace of mind to have, even though we should never actually trust it. Hidden under the frosted blue back panel is a fast wireless charger. For comparison, this guy can wirelessly charge at 30 watts, while the iPhone 11 charges wirelessly at 7.5. And the Galaxy S20 goes wireless at 15. So 30 watts is rather impressive. The blue frosted glass panel does have that texture to it. And remember, glass is a level 6 on Mohs scale of hardness, so if it comes into contact with anything that you might randomly have in your pocket, like a copper cooling Black Shark 3 vapor chamber or a quarter, the metal will probably leave marks on the glass. The soft metal dust can be cleaned off relatively easy, but either way, a case or a skin is probably a good idea. There are 4 cameras on the back. A 5 megapixel color filter down here at the bottom, and a 48 megapixel main camera here in the center. Along with another 48 megapixel ultra-wide camera up top. And another 8 megapixel 3x telephoto zoom camera off here to the side. I'll protect it with glass. Having different camera perspectives is a game changer, and I'm glad OnePlus kept all 3. There is also an optical underscreen fingerprint scanner. I'll get my fingerprint set up and add some more scratches for good measure. And the phone can still recognize my fingerprint and unlock the phone every single time. Let's chat some more about this screen. It's a 6.7 inch 1440p fluid AMOLED display. A normal display, probably like the one you're watching this video on, would have 8 bits of color, meaning that the RGB pixels can show 256 different shades of themselves...which add up to over 16 million color combinations. 10 bit displays, like the one you see here on this OnePlus 8 Pro, can show 1,024 different shades of themselves, which adds up to over 1 billion color combinations. And not only can it display 1 billion colors, it also refreshes at 120 Hertz. This kind of tech is something we usually only see in high end video editing setups or photo editing studios. My lighter does leave a white burn mark on the center of the screen after about 30 seconds. But at least you didn't notice I tricked you into doing math. It doesn't matter how cool a phone is though if it can't handle the stress of every day life. It's time for the bend test. This brand new OnePlus 8 Pro costs $899, which of course is less than other major flagships right now, but it's still a substantial chunk of money. And it does flex a bit under pressure. But there are no kinks, cracks, or permanent damage done to the metal frame of the phone. The OnePlus 8 Pro survives my durability test. It turns out, T-Mobile is getting their own special color of the OnePlus 8. I'll be showing that off and giving away a few of those phones as soon as it's released. There will be a video here on my channel about that as soon as it comes out. Keep an eye out for that if you like giveaways. It should be fun. Hit that subscribe button so you don't miss it. And let me know down in the comments what phone you want to see tested next. Come hang out with me on Instagram and Twitter. Thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "OnePlus",
        "Pro",
        "phone",
        "display",
        "color",
        "billion colors",
        "colors",
        "camera",
        "billion color display",
        "billion",
        "megapixel",
        "time",
        "metal",
        "glass",
        "pretty",
        "OnePlus phones",
        "top",
        "blue",
        "color display",
        "screen"
    ],
    "transcript_entity_values": [
        "30 watts",
        "about 30 seconds",
        "OnePlus",
        "OnePlus 8 Pro",
        "7.5",
        "3x",
        "1,024",
        "T-Mobile",
        "6",
        "8",
        "15",
        "OnePlus 2",
        "Black Shark 3",
        "Instagram",
        "a quarter",
        "120",
        "256",
        "899",
        "6.7 inch",
        "RGB",
        "1 billion",
        "4",
        "16 million",
        "11",
        "10",
        "30 watt",
        "OnePlus",
        "5 megapixel",
        "Hertz",
        "Settle",
        "68",
        "Samsung",
        "about 5 years ago",
        "3",
        "16 megapixel",
        "48 megapixel",
        "7",
        "Twitter",
        "IP"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}