{
    "id": "dOFa-TsPoGk",
    "title": "OnePlus 5T Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-11-21T03:48:25Z",
    "video_url": "https://www.youtube.com/watch?v=dOFa-TsPoGk",
    "category": "Science & Technology",
    "tags": [
        "oneplus 5t review",
        "oneplus 5t face unlock",
        "oneplus 5t camera",
        "oneplus 5t unboxing",
        "mrmobile",
        "michael fisher",
        "oneplus 5 review",
        "oneplus 2017",
        "best affordable smartphone 2017",
        "best midrange smartphone 2017",
        "best smartphone 2017",
        "best smartphone 2018"
    ],
    "views": 618275,
    "likes": 14441,
    "comments_count": 1181,
    "description": "When someone asks me where to get a good deal on a smartphone, OnePlus is one of the first words out of my mouth. Since 2013 the company has made impressive phones and sold them at impressively low prices. The OnePlus 5T is the latest in that lineup -- and its also the most expensive one to date. Find out if it's worth it in MrMobile's OnePlus 5T Review, brought to you by Thrifter.   [SPONSOR]  This video was made possible by Thrifter, a new way to save money on everything from gadgets to home goods by shopping based on value, not hype. To get all the leaked ads and the best deals for Black Friday, check out Thrifter here:   And if you're mostly on the lookout for that OnePlus 5T student deal, check it out on Thrifter here:    [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  OnePlus 5T:    [ABOUT MRMOBILE'S ONEPLUS 5T REVIEW]  MrMobile's OnePlus 5T Review was produced following 10 days with a OnePlus 5T review device provided by OnePlus. The device was tested on T-Mobile US in rural New York, New York City, and Greater Boston. It received one software update during the test period and was paired to an LG Watch Sport for the duration.   [FURTHER READING]  OnePlus 5T Review [Android Central]:   OnePlus is collecting your private data without permission [Engadget]:   OnePlus responds to OxygenOS data collection concerns [Android Central]:   Official OnePlus Statement [1]:   Official OnePlus Statement [2]:     [MUSIC]  Robot Town by Phil Gardiner, available at Premium Beat:    First Thing by JAM Studio, available at Premium Beat:      [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.thrifter.com/",
        "https://www.thrifter.com/onepluss-student-program-offers-you-way-save-10-5t",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/3oe",
        "https://www.androidcentral.com/oneplus-5t-review",
        "https://www.engadget.com/2017/10/11/oneplus-oxygenos-data-anonymity/",
        "https://www.androidcentral.com/oneplus-responds-data-collection-concerns",
        "https://forums.oneplus.net/threads/what-is-engineermode.680377/",
        "https://forums.oneplus.net/threads/lets-talk-about-oxygenos-analytics.654820/",
        "https://www.premiumbeat.com/royalty_free_music/songs/robot-town",
        "https://www.premiumbeat.com/royalty_free_music/songs/first-thing",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] When someone asks me where to get a good deal on a smartphone, OnePlus is one of the first words out of my mouth. Since 2013 the company has made impressive phones and sold them at impressively low prices. The OnePlus 5T is the latest in that lineup, and it's also the most expensive one to date. I'm Mr. Mobile, now let's see if it's worth it. (upbeat music) The OnePlus 5T is a dead ringer for its predecessor, the OnePlus 5. And if you saw my review on that phone, you'll know that's not exactly a compliment. Not that this hardware is unattractive, it's sleek and it's slim, and all metal. Which those who don't like glass phones will appreciate, and it feels well-made, if super slippery. My objection to this design is that it's essentially a repackaged version of the R11s from Oppo, a company that shares a corporate parent with OnePlus. I talked about this in my OnePlus 5 reviews, so I won't belabor the point. I'll just say it would be nice to see this distinctive company return to distictive designs. The first area of the 5T that stands out from its forerunner is in the display. The screen has gotten a boost to six inches, and a new stretched aspect ratio. Though it maintains the same pixel density and AMOLED screen technology. Call me an oldtimer, but I really don't mind OnePlus' consistent refusal to upgrade its screens to Quad HD resolution. It helps keep the costs down I imagine. And I don't think most people really notice it. Presumably it also plays a part in this phone's solid battery life. More on this in a minute. To slim down the bezels enough to get a high screen to body ratio, OnePlus had to move the fingerprint sensor to the back. If you're one of the folks who hates a rear sensor, there is a consolation prize in the form of the fastest damn Face Unlock feature I've ever used. There are no fancy sensors here, just some custom software that uses the selfie camera to analyze your face. I have not been able to fool it a photograph, but OnePlus admits it's probably not as secure as Samsung's Iris Scanner or Apple's Face ID, so you can't use it to authenticate for, say Android Pay. But as a quick way to unlock your phone when you don't wanna fumble for that fingerprint sensor, I'm surprised how fast and reliable it is. The 5T's other big shakeup comes in the form of a slightly repackaged camera. The primary shooter around back is the same one as the OnePlus 5 from sensor to lens. But the secondary shooter has been swapped out for another 20 megapixel camera. It's telephoto lens exchanged for a standard lens, the aperture now as big as the primary. All this is meant to give the phone a dedicated low-light eyeball; a camera it can switch to in the dark. Now I love this idea, but the small pixel size and the lack of optical stabilization mean it really isn't good at what it's designed for. The phone's software seems to know this, as it almost never puts that second camera to use, preferring the primary shooter in all but the darkest settings. So I echo the sentiments of Andrew Martonik over at Android Central. I'd have preferred a better single camera to this somewhat mediocre dual shooter. True, that means we'd sacrifice the portrait photo feature, but I can't even begin to pretend to care. Just like every other portrait mode, this one is mediocre at best. My design complaints aside, this is a pretty good camera. It captures pretty quickly, and occasionally even has moments of greatness that transcend its troubles. That's also true of the front-facing camera, which is again, the same module from the last phone. And back around back, I was surprised at how well the electronic stabilization compensated for the lack of OIS. This sample was shot before the phone received an update refining that stabilization. I think it was pretty excellent to begin with. Here's a few more samples, before we hit the home stretch. (upbeat music) Let's bring it home with a tour of the fundamentals. Software performance is almost perfect, responsive to a fault. OxygenOS is one of my favorite versions of Android. It blends smart features from other phones with original enhancements to give you a device you can customize completely, from accent color to notification LED without sacrificing the speed that makes it feel so much more expensive than it is. Voice calls are good, and battery life is too. My screen-on time ranges from three hours to six hours per charge, depending on what I'm using the phone for. But the important takeaway is that this is an all-day 16 hour smartphone. And Dash charging continues to live up to its name. I forgot to charge my review unit one night and by the following afternoon I was down to 14%. A half hour on the Dash charger got me back up to 67%, more than enough to finish the day. And yes, this charger comes in the box, alongside an included case. Factor in the headphone jack and the OnePlus 5T is basically the perfect iPhone alternative, for those in search of more value on the Android side. But the lower price doesn't come without sacrifices. There's no dust or water resistance here, nor wireless charging. There's just one downward firing speaker. A strange software hiccup means that I can't run the stock Twitter app without it crashing for some reason. And OnePlus has made some big missteps in the privacy arena recently. Missteps it swiftly addressed, but which might still give buyers pause. I'll link the details in the description. And atop those pitfalls, this is the most expensive OnePlus yet, starting just a buck short of $500. In a world where you can get an LG G6, or last year's Google Pixel for less, it's increasingly tough to overlook OnePlus' ever climbing price tags, especially given its recent two phone a year release cycle. From where I'm sitting, this is the last time the company can hike its prices without a significant upgrade in design or camera performance. Until that sequel drops though, you'd be hard-pressed to find a phone with the potent mix of power, performance, and price that the OnePlus 5T brings to the table. So I say: buy it if you're in the market for a discount smartphone that doesn't feel like one. And that goes double if you can snag the 10% student discount sniffed out by today's sponsor: Thrifter. Thrifter is a new way to save money on everything from gadgets to home goods by shopping based on value, not hype. Click that link down in the description to get all the leaked ads and the best deals for Black Friday and beyond, including that student discount on the 5T at Thrifter.com Until next time, folks, thanks for watching. Please subscribe and stay mobile my friends. (upbeat music)",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "camera",
        "Android",
        "back",
        "phones",
        "company",
        "sensor",
        "good",
        "shooter",
        "software",
        "Face",
        "screen",
        "pixel",
        "pretty good camera",
        "design",
        "made impressive phones",
        "impressive phones",
        "price",
        "Android Pay"
    ],
    "transcript_entity_values": [
        "16 hour",
        "the OnePlus 5",
        "secondary",
        "three hours to six hours",
        "last year's",
        "A half hour",
        "20 megapixel",
        "Samsung",
        "Black Friday",
        "2013",
        "Apple",
        "Dash",
        "Android Central",
        "G6",
        "Thrifter.com",
        "14%",
        "10%",
        "500",
        "OnePlus",
        "Google Pixel",
        "Oppo",
        "Mobile",
        "the following afternoon",
        "today",
        "OnePlus",
        "iPhone",
        "first",
        "jack",
        "the day",
        "two",
        "second",
        "5",
        "OnePlus 5",
        "Iris Scanner",
        "LG",
        "Andrew Martonik",
        "six inches",
        "one night",
        "Twitter",
        "Quad HD",
        "one",
        "Android",
        "up to 67%"
    ],
    "transcript_entity_types": [
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "TIME",
        "DATE",
        "TIME",
        "QUANTITY",
        "ORG",
        "EVENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "PERCENT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT"
    ]
}