{
    "id": "Dq3PhCK7cn4",
    "title": "Don't Buy The Pixel 2 XL Just Yet.",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-10-13T20:12:28Z",
    "video_url": "https://www.youtube.com/watch?v=Dq3PhCK7cn4",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Lg",
        "v30",
        "v20",
        "best smartphone",
        "best android",
        "most powerful smartphone",
        "wireless charging",
        "wireless charger",
        "google",
        "pixel",
        "pixel XL",
        "pixel 2",
        "XL",
        "stock android",
        "oreo",
        "worth it",
        "value",
        "cheapest"
    ],
    "views": 715956,
    "likes": 20685,
    "comments_count": 2576,
    "description": "Quick review of one of the best phones on the market. The LG v30 is so under marketed and under hyped. LG V30 -  Charging Lamp -  Phone Skins from -   Phone Wallpapers from Stephanie Stutz  Music Credits: Fili - Closure  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2gi1S9C",
        "http://amzn.to/2wUc3Em",
        "https://www.dbrand.com",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here And there's a lot of hype on the market right now for the Pixel 2 XL Not so much for the Pixel 2 but the XL is pretty hot right now, but there's another phone on the market that I've always felt was under marketed Underappreciated and just more importantly under hyped especially on YouTube, and that's this phone, the LG V30 So this is made by the same company as the Pixel 2 XL. They're both made by LG This one in particular was the gray and silver one, but I've actually put a marble dbrand skin on it, because I didn't love the silver trim I wish I'd just gotten the black one The black trim looks way better than the silver trim in real life And a dbrand skin would look good on that one as well Well so the reason why I made this video is because the Pixel 2 XL and the LG V30 have a lot of similarities. Both are running Snapdragon 835 with 4 gigs of RAM, which is going to give you kick-ass performance. They both have a rear fingerprint sensor which I'm a big fan of. They both have big batteries. The one on the Pixel 2 XL is slightly bigger, haven't tested it fully but the V30 gives you a full day of use and I wouldn't be surprised if the Pixel 2 XL gives something very similar. They're both quite water-resistant. Now, the higher number on the V30 I would consider insignificant. It's IP68 instead of IP67 on the Pixel 2 XL, and it's probably because the Pixel 2 has larger speaker apertures upfront... So it's harder to keep water out is my guess. They both have awesome 1440p P-OLED displays Supposedly, they're both using the same panel. Beautiful colors, really inky blacks But there's one big difference. The V30 has significantly thinner bezels than the Pixel 2 XL. When you compare the two side-by-side, you can't just help but tunnel vision on the difference. Now the reason why the Pixel 2 XL has a bigger bezel I'm sure a big part of it is because it has the speakers, that's got two front-facing speakers I'm a big fan of those on smartphones, but the V30 just looks so much nicer to me And then the more I use it, the more I look at the hardware The more just feels like a much better phone in terms of its hardware. First, it has the microSD slot I mean that's something that I personally don't care too much about But I know a lot of you guys are really interested in expandable storage And then you look at the cameras. The V30 is obviously a very different looking camera setup than the Pixel 2 XL But it's also a really good camera. The Pixel 2 camera is gonna be amazing I took a few photos of the event and they just looked really really clean, but this camera is also fantastic It's one of the best on the market right now It's got a wide-angle lens which can be awesome So a lot of phone companies will use black-and-white lenses or a portrait lens as the secondary camera This one uses the wide-angle one and by far It's my favorite of all the secondary camera lenses It's just so much more useful for the photos that I take. And I know the Pixel 2 XL has the highest DxOMark right now Which may or may not be important to you, but numbers aside V30, awesome camera. And the video mode on this thing is surprisingly good The lenses and the sensor are obviously good But the software and the amount of control you have over the footage is unbelievable And it even has log footage so if you want to capture the most color data, I mean see log on a phone, is crazy The V30 still has a headphone jack, but more importantly, it has a really high-quality DAC But no amount of me explaining things, or me describing how the audio sounds is gonna do justice. It really is like looking at a 4K screen versus a 1080p screen except It's for your ears, and it's one of those things where you need to have good hardware, like a good set of headphones And I guess it'll depend on the hearing of each person But if you have a good quality source file and decent headphones even The difference in audio quality is phenomenal, so if you're into music or you think you'll get into music and you want good sound quality, a high-quality DAC on a phone is amazing, and they even include a very respectable set of earbuds in the box The V30 also supports wireless charging, which for some people might be a small detail But it is a nice feature to have. If you look at pricing, both of these phones are pretty expensive The V30 is going for around 800 bucks off-contract. The Pixel 2 XL starts at 850 I wouldn't call it like, a better value or anything just because you're getting a bunch of free stuff with the Pixel 2 right now You're getting like the Google Home Mini, plus some carriers give you discounts and stuff Currently I would consider them a wash in terms of their pricing The software though is gonna be the biggest difference between these two phones The Pixel 2 XL is going to run the latest stuff from Google, which is awesome. I love stock Android. The V30, it's running 7.1.1, which is good... It's not the newest stuff, but it's also running a skin, the LG UI and, I don't love it I personally think there are better-looking skins than this, there's significantly worse ones But I still don't love the LG skin. Now what I've done for my phone is that I just nuked the skin I'm running a Google launcher and It's close to stock because Google has enough apps in the Play Store to replace the LG apps if you want But it's never gonna be 100% stock Okay, if you're on the market for a phone for particularly, the Pixel 2 XL, take a look at this thing if you're interested in hardware because quite frankly, this has better hardware But if you're in it for the software and you want that smooth, buttery newest Google experience, sure, Pixel 2 XL is the way to go But I want to leave one last thing on your minds. This phone Not just the V30, but the flagship LG phone, so last year the V20, year before that the V10 They've always been great phones But they've always been kind of underrepresented, under marketed because just that's how LG does stuff. They don't have like crazy billboards They don't have the celebrities that just kind of rock these phones This is a fantastic phone. If you look at any publication, online or print And you see the reviews for this phone Everyone loves it, but it just gets buried by the hype of other phones which is unfortunate because, they nailed it this year. Okay. Hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it. See you guys next time!",
    "transcript_keywords": [
        "Pixel",
        "phone",
        "good",
        "camera",
        "phones",
        "Google",
        "big",
        "silver trim",
        "skin",
        "hardware",
        "stuff",
        "Google Home Mini",
        "lot",
        "made",
        "love",
        "market",
        "trim",
        "silver",
        "difference",
        "awesome"
    ],
    "transcript_entity_values": [
        "DxOMark",
        "the Google Home Mini",
        "2",
        "4",
        "850",
        "V20",
        "XL",
        "V30",
        "one",
        "this year",
        "the Play Store",
        "year",
        "First",
        "Snapdragon 835",
        "jack",
        "Google",
        "microSD",
        "YouTube",
        "last year",
        "Android",
        "IP67",
        "two",
        "100%",
        "Pixel 2 XL",
        "RAM",
        "a full day",
        "around 800 bucks",
        "LG",
        "The Pixel 2 XL",
        "V30",
        "Thumbs",
        "7.1.1",
        "1080p"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL"
    ]
}