{
    "id": "DQR5EqM1doQ",
    "title": "My career crashed! My story.",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2018-07-03T13:33:21Z",
    "video_url": "https://www.youtube.com/watch?v=DQR5EqM1doQ",
    "category": "Education",
    "tags": [
        "Cisco",
        "CCNA",
        "GNS3",
        "Motivation",
        "Motivational videos",
        "Network Videos",
        "Help CCNA",
        "CCNA Help",
        "Motivational Cisco",
        "Cisco Motivation",
        "CCNP",
        "CCIE",
        "Stuck in a rut",
        "Goals",
        "Goal setting",
        "Setting Goals",
        "Networking Goals",
        "goals",
        "goal",
        "set goals",
        "Recover",
        "Career advice",
        "Career planning"
    ],
    "views": 164995,
    "likes": 8033,
    "comments_count": 644,
    "description": "Here is my story of how my career crashed! Hardship can make you grow stronger. Sometimes you learn more through the pain. Has your career crashed and burned? Are you dejected? Are you down in the dumps? Time to stand up and make a difference in your life!    Don't let stumbles or failures stop you reaching your goals! We all fail at some point in our lives. It is not how many times you fail, but how many times you get up again that counts! Don't stop trying. Don't stop moving to your goals.",
    "description_links": [],
    "transcript": "(inspirational music) - Are you gonna turn your hardships into diamonds? Are you gonna change your life by learning new technologies? Networking is always changing. (escalating music) (inspirational music) Don't let your problems stop you. Don't let your insecurities stop you. Turn your life around and make the most of the time you have. There's always opportunities to learn. There's always opportunities to grow the network. So why dont you change your life? Turn your problems and your coal and your hardships into diamonds. (inspirational music) You need to learn technologies such as the Linux, Python, Ansible, Network Automation, learn the new things and change your life. (inspirational music) Find something that motivates you. What motivates you? Is it the rubbish situation that you're in? The pain that you're experiencing in your current job? The boss that gives you a hard time, find something that's gonna motivate you. As an example, my family motivates me. You've gotta find your inspiration and a reason to work and a reason to put the hours in. Here's one of the reasons that I have, and this is Lauren. So, Lauren, what do you always tell daddy to do? - Back to work! Back to work, Alex! - And then you go, so, I have to go back to work. Why must daddy got back to work? - I need toys! I need toys. I need sweets. 'Cause I need books and cakes. And hungry and sandwiches and toys! - Okay, so Daddy must work, because you want books, sandwiches, toys, and nice things, is that right? - Hmm-mm. - Good. - And make up and cameras! - Ah, you want cameras as well, do yo? - Hm-mm. - Good. - Back to work, Daddy. - Don't let your career crash and burn. Watch my video, which I've linked here. If you need some motivation, but there are many motivational videos on YouTube that you can watch if you need to get some motivation to change your life. But here's an example, from my personal experience. Now after school, I went to university, but unfortunately I was only able to go to university for one year and I had to drop out because of financial difficulties or financial issues. So there I was, 19 years old, and I had to drop out of university. It was a devastating blow for me. I had my whole life planned out. I assumed that I would become a mechanical engineer and have a great career, but there I was after one year and I couldn't continue with my university education. I had to go and take a job in retail. Now, if any of you have worked in retail, you know that retailing involves long working hours. I was working six days a week, long hours every day. Now here's a principle I think you need to remember. Make sure that your older self thanks your younger self for the decisions that your younger self has made. In other words, make good decisions today so that yourself in 10 years' time or 20 years' time or whatever, thanks you for the decisions that you made today. So I say thank you to my younger self for making the choice to study part time. So I was working these long hours, six days a week. And in the evening I was studying, fortunately I was 19 years old. So I was young and had a lot of energy. I didn't have a girlfriend at the time. I simply focused on doing my work during the day and studying at night. And what I managed to do was complete a three year degree in three years, part time, working like a crazy person. But that was a good decision that my younger self made. Fortunately, my younger self also made another good decision. I had heard about Microsoft and information technology. And I studied part time again in the evening for MCSE, so my Microsoft engineer certification. In those days, it was NT4, so quite a long time ago. But what I did is I spoke to my boss at the time and I arranged that I'd work longer hours on other days so that I could shorten one day and then I would drive two hours to go and attend a class. So I was fortunate enough to make the arrangement that I would put in extra hours on other days so that I could take off two or three hours on a Tuesday. And then I would drive two hours to go and attend a class. So I'd worked basically a normal day that most people would work, get off two or three hours early, drive two hours and go and attend a class and then drive two hours back home again. So that's how I managed to get my MCSE. I worked full time, got my degree part time, got my MCSE, my first IT certification part time. And then doors started opening for me. Now that wasn't the end of it. I was working in a information technology role, supporting windows, machines, and desktops when I heard about Cisco. Unfortunately, my younger self saw that Cisco was gonna be very important. So what did I do? I studied for my CCNA. I paid to attend Cisco classes. In those days there wasn't any online material. So I paid it to attend classes myself and I paid for the exam myself. So in other words, rather than spending money on drink or parties or other things, I took the little money I had, loaned some other money and attended classes and invested in myself. I made the decision to get certified in Cisco and that opened up even more doors. And I eventually became a CCIE. So why am I telling you this? I'm telling you that if you're stuck in a dead end job or what seems to be a dead end job, you can change your life just like I changed my life. Don't believe that you're stuck where you are. It's so much easier today to change your life. In those days, we didn't have the internet like we have today. We didn't have smart phones like we have today. The only thing that's stopping you is you and how you manage your time. You may say that you have no time. Look seriously at what you're doing with your time. Again, have a look at my other video where I talk about time management. If you want more time management tips, let me know. I'm telling you that today you can make a change in your life in a way that wasn't possible when I was younger, the Internet has opened up a world of learning and you have the chance to change your life through education. What's stopping you from studying something new every day and changing your life? Don't stagnate. Don't let your career come to a grinding halt. Don't let it crash and burn. Keep on studying, keep on learning, keep on adapting. (inspirational music)",
    "transcript_keywords": [
        "time",
        "life",
        "hours",
        "work",
        "change your life",
        "change",
        "days",
        "part time",
        "younger",
        "Back",
        "day",
        "make",
        "today",
        "Cisco",
        "Back to work",
        "daddy",
        "attend",
        "working",
        "part",
        "Good"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "CCIE",
        "19 years old",
        "Linux",
        "six days",
        "the day",
        "two or three hours",
        "MCSE",
        "20 years'",
        "those days",
        "NT4",
        "two hours",
        "night",
        "CCNA",
        "one day",
        "Network Automation",
        "today",
        "Ansible",
        "Python",
        "these long hours",
        "the hours",
        "10 years' time",
        "Tuesday",
        "hours",
        "Cisco",
        "three year",
        "three years",
        "Alex",
        "YouTube",
        "Lauren",
        "one year"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "TIME",
        "NORP",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "DATE",
        "TIME",
        "GPE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE"
    ]
}