{
    "id": "dRCY4cGoFVQ",
    "title": "OnePlus 7T Durability Test! - A Big Camera Hole is a Bad idea.",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-10-19T10:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=dRCY4cGoFVQ",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 7T",
        "oneplus",
        "oneplus 7",
        "one plus",
        "OnePlus 7t durability test",
        "oneplus 7 cracked glass",
        "broken oneplus",
        "OnePlus 7T scratch test",
        "OnePlus 7t Bend test",
        "bend test",
        "smartphone",
        "android",
        "oneplus 7t review",
        "oneplus 7t unboxing"
    ],
    "views": 2317557,
    "likes": 60029,
    "comments_count": 4044,
    "description": "Its time to durability test the new OnePlus 7T! Get your first audiobook plus two Audible originals free when you try Audible for 30 days, go to  or text jerryrig to 500 500. OnePlus has released a new phone called the OnePlus 7T, that fits right between the 7, and the 7pro. (There is also a 7T Pro version if you werent confused enough already.) Today we are going to find out how durable the new OnePlus 7T is. Normally during my smartphone durability tests, we find out what the phone is made from and what physical flaws it might contain. USUALLY phones survive my tests... but today, with the OnePlus 7T... something happens with the back glass.   OnePlus 7T Teardown!:  Current OnePlus 7 Price on Amazon:  Current OnePlus 7 Pro price:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.audible.com/jerryrig",
        "https://youtu.be/_PySmMrihWI",
        "https://amzn.to/2OZZfIp",
        "https://amzn.to/2BnwltF",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "OnePlus has gotten a little complex with their naming scheme lately. Just like everyone else who makes phones. But I'm pretty sure this OnePlus 7T lies right between the OnePlus 7 and the OnePlus 7 Pro. It' kind of the middle ground between the other two versions. It's good of course to have options, but only if they're durable. This video is sponsored by Audible. Let's get started. [Intro] You can tell if a phone manufacturer takes care of their customers or not by what they happen to include in their box. OnePlus has once again gone above and beyond the norm by including a pretty beefy clear plastic case in the box with a massive cutout in the center for what I assume is the rear camera. As well as a bright red USB-C charging cable, and the best thing, in my opinion, is this charging brick. This beast can supply 30 watts of fast charging warp power to the OnePlus 7T. Thumbs up for that. For comparison, Samsung includes a 25 watt charger with the Galaxy S10, and Apply includes a painfully antiquated 5 watt charger with the new iPhone 11. The higher the watts, the faster your phone will charge. This is the Glacier Blue OnePlus 7T. It has a massive circular camera cutout in the glass that reminds me of something, but I can't quite put my finger on it. That circular camera cutout is the most distinguishing feature of the OnePlus 7T, along with the teardrop notch in the top of the screen. If you remember, the 7 Pro managed to get rid of that notch by motorizing the front camera. OnePlus does include a plastic screen protector on the phone, which once again is very kind of them. It's time we start with the scratch test. Luckily, the large camera circle on the back is dead center on the phone so it's not rocking back and forth all over the place when we touch the screen. Screens can be made from a few different materials. Plastic, like we saw on the Galaxy Fold. Glass, which we normally see on most smartphones. Or super scratch resistant sapphire crystal which exists on some of the more premium phones we've tested in the past. This time around, OnePlus is using Gorilla Glass and we start seeing scratches at a level 6 with deeper grooves at a level 7. This means that the normal car keys, coins, and razor blades won't do any damage to the surface of the glass. The 16 megapixel front facing camera is also protected under the same piece of glass. And the long top stereo speaker is covered by a thin plastic grill that's pretty securely glued into place. The sides of the OnePlus 7T are made from anodized aluminum. You can see the glint of silver shining through under that anodizing. That volume rocker is also made from metal. Up at the top of the phone there is once again no headphone jack. OnePlus decided to sink that ship right about the same time they came out with their Bullets Wireless earbuds, which, you know, I'm sure was just a coincidence. Over on the right side of the phone, there's a feature that I wish every phone had this is a triple sliding mute switch. I know it sounds lame, but unlocking my phone just to put it on silent gets pretty annoying. Having a physical slider on the outside that can toggle between the different sound settings is super appealing. But I'm also a huge fan of features. So when the phone is missing important tools like the expandable memory card slot, it makes my decision to upgrade much harder. Everyone's different though, and there are plenty of phones out there to choose from. OnePlus is calling this back panel a matte frosted glass. And you can hear by the sound of my razor blade that the frosting, or the etching, is on the back side of the panel. But it's not near as aggressive as what we saw in the newer iPhones, or the older Pixel 3. The surface doesn't grind off much of my quarter. Nor does it take any metal off of this screw. It's a much more subtle texture that won't be sanding down other objects in your pocket or purse. Now one thing I really do like about the 7T is the triple camera set up. The more features a phone has, the more I'm going to like it. And the less features a phone has, well, the less I'm going to like it. It's a pretty simple philosophy. There is a 16 megapixel wide angle lens on the left, with a 48 megapixel main sensor in the center. And a 12 megapixel 2x optical zoom lens on the right, with the dual LED flash down at the bottom. The coolest part though is that this phone has the ability to take macro close up pictures of something that's just 2.5 centimeters away, which is impossible for most other phones on the market right now. OnePlus says it's done with some kind of specialized zooming hardware inside the camera unit. So it'll be interesting to see what that looks like from the inside? Technology is super amazing. Remember the show MythBusters with Adam Savage? Well he has a new Audible Original talking about the future of technology on earth and beyond that I think is pretty interesting. Huge thanks to Audible for sponsoring this video. His audio book is called What Happens Next Conversations from Mars. Adam Savage interviews scientists and astronauts about the future and their responses are pretty fascinating. You can get your first audio book for free, plus two free Audible Originals when you try Audible for 30 days. Visit Audible.com/jerryrig or text the word jerryrig to 500-500. The Audible Originals are exclusive audio titles created by storytellers or journalists and the feel more like an immersive production or a documentary instead of just a narration. The titles you download are yours to keep forever, even if you stop your subscription are in that free trial. I'll leave a link down in the description for you. Audible.com/jerryrig. Or you can always text jerryrig to 500-500. Audible is definitely one of my favorite apps. And Adam Savage's story is worth a listen. OnePlus is pushing the boundaries with that macro photography, but also with their display technology. This is a 6.5 inch 90 Hertz 1080p fluid AMOLED display. The 90 Hertz means that the screen can refresh or display images much faster than the average smartphone. The 7T does have a lot going for it, especially at this price. The thin OLED display even allows for an underscreen fingerprint scanner. It's also cheaper and has more features than the more expensive recently announces Pixel 4. The OnePlus 7T lasted about 25 seconds under the heat from my lighter, and then mostly recovered. There's still a faint burn mark, so starting your phone on fire probably isn't the best idea. OnePlus has never failed my durability test before. Usually they are a solid device for the price. But this time, with the first bend, something new happens. The back glass has cracked. Now obviously I subject my phones to more abuse than they would normally receive in every day life. That's kind of the point. The majority of phones I test though usually survive being bent. This OnePlus 7T cracked in the center of the phone along the edge and spread upwards towards the massive camera cutout. It's hard to say whether the flexible frame or the tight glass tolerance, or the large hole cut in the glass contributed more to the glass cracking. But we can tell that the glass phone back is definitely busted. The phone itself survived and the screen still works, so I won't write it off as a total fail. But still, the OnePlus 7T should definitely be wearing a case. The large hole in the back might very well be contributing to a more fragile glass panel overall. The more of a substance you remove, the more fragile it gets. We'll definitely have to see how the 7T holds up over time. But personally, I think removing that much of the rear glass panel for the camera lens was a bad idea. Let me know what you think down in the comments. And come hang out with me over on Instagram and Twitter. And grab your free audio book with the link in the description. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "glass",
        "camera",
        "phones",
        "Audible",
        "glass phone back",
        "pretty",
        "Audible Originals",
        "camera cutout",
        "naming scheme",
        "back",
        "Adam Savage",
        "Glacier Blue OnePlus",
        "glass phone",
        "screen",
        "time",
        "circular camera cutout",
        "free Audible Originals",
        "glass panel"
    ],
    "transcript_entity_values": [
        "30 watts",
        "Adam Savage",
        "every day",
        "OnePlus",
        "Audible Originals",
        "30 days",
        "6",
        "Twitter",
        "Instagram",
        "Audible Original",
        "two",
        "iPhone 11",
        "Glass",
        "MythBusters",
        "25 watt",
        "2x",
        "OnePlus 7T. Thumbs",
        "the Galaxy Fold",
        "the Glacier Blue OnePlus 7T.",
        "watts",
        "5 watt",
        "the Galaxy S10",
        "6.5 inch",
        "OnePlus 7",
        "Pixel 3",
        "OnePlus",
        "Hertz",
        "90",
        "The Audible Originals",
        "the OnePlus 7 Pro",
        "first",
        "OnePlus 7T",
        "500-500",
        "just 2.5 centimeters",
        "Samsung",
        "Pixel 4",
        "12",
        "Mars",
        "16 megapixel",
        "about 25 seconds",
        "48 megapixel",
        "iPhones",
        "Audible",
        "AMOLED",
        "one",
        "7",
        "Adam Savage's",
        "Bullets Wireless"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PERSON",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "LAW",
        "LOC",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "LAW",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}