{
    "id": "DRe2TCx-fao",
    "title": "Congress takes on TikTok, privacy, and AI | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-04-23T13:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=DRe2TCx-fao",
    "category": "Science & Technology",
    "tags": [
        "The Vergecast",
        "Vergecast",
        "The Verge",
        "Tech",
        "Technology",
        "podcast",
        "gadgets",
        "tech policy",
        "AI",
        "regulation",
        "TikTok",
        "ban",
        "privacy",
        "online",
        "bill",
        "legislation",
        "Congress",
        "US",
        "Senate",
        "House of Representatives",
        "Wonder Dynamics",
        "interview",
        "live",
        "Chicago Humanities Festival",
        "Tye Sheridan",
        "movie production",
        "Nikola Todorovic",
        "imessage",
        "game pigeon",
        "Future of AI Innovation Act",
        "American Privacy Rights Act"
    ],
    "views": 8893,
    "likes": 162,
    "comments_count": 10,
    "description": "Today on the flagship podcast of forced app divestiture:   The Verges David Pierce and Lauren Fiener discuss the latest tech policy bills floating through Congress, including a privacy bill, a generative AI bill, and the TikTok divest-or-ban bill.  David talks with Nikola Todorovic and Tye Sheridan about their company Wonder Dynamics, which is creating AI-powered production tools for filmmakers.   David answers a question from the Vergecast Hotline about messaging apps.  00:00 - Intro 02:17 - Tech policy w/Lauren Feiner 03:41 - A TikTok ban is very close  15:51 - The American Privacy Rights Act 31:35 - AI at the movies w/Tye Sheridan and Nikola Todorovic 41:42 - Democratizing filmmaking with AI 58:07 -  The business side of AI in filmmaking 01:00:47 - The Future of movie viewing experiences 01:02:01 - Global filmmaking with AI  1:05:29 - Bloated messaging apps (Vergecast Hotline)  Further reading:   TikTok ban passes in the House again:    TikTok divest-or-ban legislation could suddenly be fast-tracked in the Senate:    Lawmakers unveil new bipartisan digital privacy bill after years of impasse:     A real privacy law? House lawmakers are optimistic this time:     New bill would create public datasets to train AI and incentivize innovation.:     Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/2024/4/20/24135163/tiktok-ban-divest-bytedance-house-foreign-aid-package",
        "https://www.theverge.com/2024/4/18/24133975/tiktok-divest-ban-bill-foreign-aid-package-house-senate",
        "https://www.theverge.com/2024/4/8/24124143/lawmakers-unveil-bipartisan-comprehensive-digital-american-privacy-rights-act-bill",
        "https://www.theverge.com/2024/4/17/24133323/american-privacy-rights-act-house-lawmakers-legislative-hearing",
        "https://www.theverge.com/2024/4/18/24134178/new-bill-would-create-public-datasets-to-train-ai-and-incentivize-innovation",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://link.chtbl.com/vergecast",
        "https://link.chtbl.com/decoder",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3P4bJgz"
    ],
    "transcript": "- Welcome to \"The Vergecast,\" the flagship podcast of forced app divesture. I'm your friend, David Pierce, and I am stuck in my basement because this is the only camera and microphone that I have that works. So I bought this thing, the DJI Osmo Pocket 3, just to make these intros. I like being out in the world, I like telling you guys what I'm up to, I like doing fun stuff while we record \"The Vergecast,\" and then it broke. It was just sitting in my bag for reasons that I cannot figure out. Just something about the gimbal stopped working. So now, I turn it on, and it like sort of spins, but not really. And then I get this error that just says gimbal protection over, and over, and over again. And I don't know how to fix it. I think I know what's wrong. There's a spot that's a little sticky. But the thing about these gimbal cameras is that they're so delicate and so finicky. That's what makes them cool, it's what makes them work, but it basically seems to have broken just because I like put it in my bag and put a rolled-up sweater on top of it. Technology, man. Anyway, we have an awesome show coming up for you today. We're gonna do two things. First, we're gonna talk about this weird sort of run of bills and legislation that we've gotten in Congress recently. All of a sudden, there's tons of momentum again on the TikTok ban, on digital privacy legislation on AI. So we're gonna try to figure out if any of this actually means anything and if any of this is ever actually likely to become law. Then, we're gonna play you a bit of a conversation I had at the Chicago Humanities Festival. I talked to two filmmakers who are also the co-founders of an AI startup, which I just think is a fascinating tension. What does it mean to be a creative person in this world we live in right now while also trying to build AI tools that threaten to totally upend the way that we do all of this creative work? We had a really fun conversation. I wasn't planning on putting it on this show, but I really enjoyed it and I think you might as well. All of that is coming up in just a second. But I just watched a YouTube video where basically the way to fix this gimbal is to shove a bunch of Post-it notes in here, and I'll try anything at this point. This is \"The Vergecast,\" see you in a sec. (graphic thudding) Welcome back. All right, my camera's broken, I think forever, but my mic still works, so we soldier on. So we've learned over the last few years to be, let's say, skeptical, anytime there's a new tech related bill moving through Congress. We get all these hearings that turn out to be mostly just grandstanding and people trying to score points that they can post on TikTok. We get bills that don't make sense and go nowhere. We get bills that do make sense and go nowhere. And so it feels like, by and large, we're left with decades-old or even centuries-old laws and precedents trying to govern the internet. It's not great. But recently, there's a sense of momentum in Congress that feels new. There's a new privacy bill that some real steam, there's a new take on the TikTok ban that is moving really fast, and there's even some AI legislation that seems to have at least an outside shot of turning into something. But is any of this for real? And if so, what's different now? Why is this all kind of happening all at once? The Verge's Lauren Feiner has been covering all of these bills, and she is here to help us figure out what's next. Lauren Feiner, hello. - [Lauren] Hi. - [David] How are you? - [Lauren] Doing well. - [David] Just another chill week in Lauren's life. Everything- - [Lauren] Just a normal weekend. - [David] I like this for you. Yeah, it's really rude of Congress to continue to do things on weekends. - [Lauren] Seriously. - [David] This feels like they need to like go hang out with other people for a couple of days and like give you a break. - [Lauren] Go socialize. - [David] Yeah. So we have a bunch of stuff to talk about, but I feel like the place we should start is probably TikTok, because TikTok is like the thing happening right this minute. So where we left off, I would say on the show, is the bill sort of flew through the House subcommittee, flew through the House, hit the Senate, and kind of disappeared. There was a lot of momentum and that all the momentum died. And this was a few weeks ago. We have had a remomentum in, tell me what's been going on, catch me up. - [Lauren] Yeah, basically, like you said, we had this huge moment in the House where they overwhelmingly passed this bill that could ban TikTok, unless it is divested from its Chinese parent company, ByteDance, within six months. And then next, it's on the Senate to move. And we got a lot of kind of non-committal responses from Senators who were in key positions there. So it kind of looked like maybe this thing is just gonna like linger here until everyone kind of forgets about it and moves on. - [David] What was your read on that, by the way, before we even get to that, I found myself wondering a bunch over the last couple of weeks why the Senate seemed content to just let it go. I mean, you have President Biden saying he would sign the law if it hit his desk. Tons of momentum in the House, this thing was going crazy. Like, lots of people even in, the House Democrats were for it. Why was the Senate so happy to just sort of let it wither and disappear? - [Lauren] Yeah, I think there's two things, like one on just like the more political side, the House is a very different beast from the Senate. The Senate is kind of a more deliberative body in a lot of ways. the House is much larger, you can have a lot more like different personalities. - [David] It was a very kind way of putting it, by the way. - [Lauren] Yeah. (David and Lauren laughing) So I think like things that move in the House aren't necessarily the same that are gonna move in the Senate. So that's one thing. I think a second thing is that I think there were real concerns with the earlier version of the bill, particularly with the timeline for divestment. I think really... I don't think I really heard from many people at all who thought that six months was a reasonable timeline to have this giant-ass asset divested from this Chinese parent company. So I think there were real concerns about that and potential Constitutional concerns, free speech implications. So I think there were still things that Senators really wanted to ponder, and maybe hold hearings on, and go through the regular process there. So that's kind of how I think that was going down at the time. - [David] Okay, that makes sense. Okay, so I derailed you, so that all happens, brief pause, what happens next? - [Lauren] Yeah, so then the House is trying to pass these foreign aid bills basically directing military and humanitarian aid to places like Israel, Ukraine, Gaza. And so obviously, this is something that is high priority in Congress, and House Speaker Mike Johnson does something interesting and allows a new version of this TikTok bill to get into this foreign aid package. So I think anyone who follows Congress might understand that a lot of times, when we see bills pass into law, it's through like a larger package that has to pass, like the National Defense Authorization Act, or some sort of budget for the government, or things like that. So that's kind of what happened here is it got packaged in with these bills that are really high-priority for Congress to pass. And not only did they kind of bundle this all together, they also changed the bill a little bit so that the timeline for divestment was extended to basically up to a year. So it's really extended to nine months, initially. And then if the president sees that there's progress on a deal, he has discretion to extend it essentially another three months. So up to a year for this deal to be completed, which seemed to kind of assuage a lot of the concerns around it, in particular from Senate Commerce Committee Chair, Maria Cantwell, who'd previously kind of not said anything really definitive about how she felt on the bill, but afterwards said that she supported the updated text of the legislation, and that's significant because she leads the committee that, under like a normal process, would have been considering this bill before it hit the Senate floor. - [David] Got it. Okay. Talk me through the politics of the bundling of all of this a little bit. Because like you said, this is the kind of thing that happens relatively frequently that a bunch of bills that either have a little bit to do with each other or nothing to do with each other end up in kind of an all-or-nothing package. But what do you make of kind of the way this was packaged back together and the way it has sort of gone through this process again? - [Lauren] Yeah, so I think, like I said, there's kind of these two ways that a bill can pass through Congress. One is that it's packaged together with these other bills that Congress has to make a decision on one way or another. They can negotiate for certain bills to get out of that must-pass package. But there's a lot more politics there and like: What are you really gonna stake your ground on? And then the other way is to pass like standalone bills, like we saw the first time, with this TikTok bill, and that requires a lot of kind of resources from Congress in terms of floor time. There's a lot of bills, a lot of legislative priorities that are out there. And so for House leadership to make the time for the TikTok bill as a standalone to get a vote was a big deal in the first place. - [David] That's one thing, by the way, that I think I have underrated in the past with a lot of this stuff is just the sheer logistics of passing a law like this is so much weirder and more complicated than it gets credit for. And like you say floor time, and my brain just goes like, \"Oh, right, there's only like so many hours in the day to stand there and talk about these things and everybody...\" You have hundreds of people with wildly different priorities. So literally just to like go through the time of discussing this thing to get to a vote, you just can't do it with everything. - [Lauren] Totally, I mean think about like everything that's like most important to you politically and everything that's most important to like your parents politically and all these people around you. And like they could be, in theory, equally important, but how do you decide what gets the time to actually get a vote? So that's something that Congress is always juggling. So I think that's definitely right, it's a big deal. So then packaging this with the other bills, when it's a standalone bill, then it's on the Senate to decide when and how to move, and that's really up in the air. It's pretty easy to just like throw sand in the gears of Congress and just slow things down. But with this package, it kind of forces the Senate's hand in a certain way, where it makes them have to figure out like: Are we going to say like this is the issue that makes us not vote for this foreign aid package that a lot of Senators really want? And you have to think like this is a bill that passed overwhelmingly in the House. It's a pretty popular measure. So is that the thing that Senators are gonna kind of put their foot down on for why this like otherwise popular and wanted package is not going to pass? - [David] Right, yeah, I was looking at it in the... I think the bill, I wrote this down, passed 360 to 58 in the House, which for the House of Representatives in the country we live in right now is like pretty nuts to get that broad a vote for just about anything at this moment in time, right? - [Lauren] Yeah, exactly. And it was interesting. I think during the debate around the bill, New York Democrat, Gregory Meeks, who's the top Democrat on the House Foreign Affairs Committee, he was saying that he had opposed the earlier standalone TikTok bill. He said, quote, out of concern that it would be a broad authorization that could be misused far beyond what we in Washington are currently debating beyond just TikTok. But he was supporting this package of legislation and said, quote, \"The bill took a step in the right direction with a more realistic timeframe for a complex divestiture process.\" Let me say for the record that I believe this bill is about one company that additional authorities provided to the Executive Branch are to be interpreted narrowly. So he's saying, \"Look, I didn't really support this the first time around, but given that it's part of this larger package, I think it's a better bill than it was before. And if we interpret it narrowly, like, I'm fine with it.\" - [David] I feel like there are two ways to read that. And I'm curious which you read it as if either one or if there's something I'm missing. One is basically like the Senate saying, \"Oh, God, we've lost. Like, we're sort of forced to do this now. This foreign aid bill is important. We are going to have to vote on this and letting this foreign aid bill die at the hands of a TikTok ban is just not worth the fallout.\" Which, if that is the case, fairly brilliant political machinations by Mike Johnson and the House, like kudos to them for pulling off what seems like it might actually work. The other read is that we have now debated this out long enough, and we kind of know where it's going, and it seems increasingly clear that the end point is not a ban, it is a sale, which makes it specific, right? That that becomes a very unique thing because there just isn't anything else like that out there right now. So everybody is able to just say, \"You know what? Whatever the law actually says, it is basically only going to apply to TikTok. Let's just pass the thing and move on with our lives.\" Do you have a sense of which... Like, did the Senate get sort of outmaneuvered, or is there a sense that like we really can solve this problem the way that we want to now? - [Lauren] I would tend to think it's more that we really can solve this problem the way that we want to. Because I still go back to the initial vote on this bill in the House was so overwhelmingly in favor of this legislation, even with the six-month timeline. To have that kind of broad support for something like this really tells me that this is a popular measure and the people who are leading this legislation are saying, \"This is not a ban, we want divestment, that's our goal.\" So I think that this is something that a lot of lawmakers are really interested in, and we've seen support for this sort of thing from the Senate Intel Committee leaders, now you have the Senate Commerce Committee leader on board. There's a lot of support for doing something on TikTok in general. And it seems like this is a way to do it that more lawmakers are somewhat comfortable with. - [David] Okay, I would just point out again that still, it's been all this time, and we have yet to hear this unbelievably compelling evidence that supposedly exists for why we have to ban TikTok. But we will leave that aside. I think there really is the question of like: Should we ban TikTok and is it going to happen? And I think I assumed those two things were sort of gonna run together, but it really seems like at this point, it might happen. It feels like the odds of this bill becoming law are pretty high at this point. Like, this thing is moving fast and it seems like the momentum is gonna be pretty hard to slow down, right? - [Lauren] I would agree with that, yeah. I mean I would go back to like look at what this bill is situated within. It's this package for foreign aid that's very popular. Is TikTok going to be the thing that Senators say, \"We're gonna like put our foot down about getting this out of here.\" - [David] Right, yeah, we don't want to help Ukraine because we don't wanna ban TikTok. It's a strange political maneuver for anyone to pull at this moment in time. So what's next in this one? I think last time all this happened, tons of momentum and then it died in the Senate. We are now kind of back at that same spot again. Is it possible it's gonna die in the Senate again? - [Lauren] I think this one's really different because foreign aid is something that has some time urgency behind it. And the Senate was supposed to be off this week, but they're actually gonna come in on their vacation, and they're going to start doing some like process votes tomorrow. So from what I've read, it seems like they could vote as soon as tomorrow and as late as Wednesday on this measure. - [David] Fair enough, yeah. I should say we're talking on Monday morning, and it's like we have like a little less than 24 hours before this publishes, and Lord knows everything could change between now and then. But okay, let's talk about some of the privacy stuff because I think the other thing that you've been writing a bunch about is this new thing, the American Privacy Rights Act. I went into the first story that you wrote about this in which you were like, \"There's lots of momentum, people are excited, this might actually happen.\" Being like, \"Aw, Lauren, you've been scammed again into believing that the American government is gonna pass privacy legislation.\" But it seems like there is a sense that we're gonna actually maybe get a real privacy law here at some point in the near future. What is going on with this bill? Why is this the one so far? - [Lauren] Yeah, look, I mean when it comes to privacy, I'm never gonna say this is definitely probably gonna happen because I think I've just seen this so many times over years of covering tech policy, where you get a bipartisan bill that seems like a pretty great compromise, and everyone's like at least happy enough and then it goes nowhere. So I think this is one where we really gotta watch it till the end. But, there are some promising signs in this legislation, which to be clear, is still a discussion draft. It hasn't even been formally introduced yet. But I think the most significant part of it is just: Who's behind this bill? And that's the head of the House Energy and Commerce Committee, Cathy McMorris Rodgers, who's a Republican from Washington, and the head of the Senate Commerce Committee Chair, Maria Cantwell, who's a Democrat from Washington. - [David] Maria Cantwell, everywhere right now. - [Lauren] Yeah, exactly. - [David] Big month for Maria Cantwell. - [Lauren] It truly is. And I think her sponsorship is the most significant here because last time around when we had a Bipartisan Privacy Bill in 2022, she was not on board. And that seemed to be the thing that ultimately kind of like slowed down momentum behind this bill that had a lot of bipartisan supporters. It passed overwhelmingly out of the House Energy and Commerce Committee and then just kind of died off. So I think that's really what's most significant here and what's giving people the most hope that maybe we could see something this time around. - [David] Okay, so I feel like, I don't know... I don't know what the like least optimistic it is possible to be while still being optimistic, you know what I mean? You're like at a... We're at a sort of one out of 10 on the optimism scale, but we're at least somewhere, and I feel like there's possibility that this could happen. What about this bill jumps out to you? It seems like I was reading through it and there's a bunch of stuff that sounds a lot like what we have in the EU, this idea of transparency, and you should be able to control your own data, and you should know where it's going. Some of the stuff that's going on in California with the California Privacy Act that went in 2018, I think it was, and then again in 2020. What's in this bill that jumped out to you? Anything particularly interesting? - [Lauren] Yeah, I think the thing that stands out the most is the enforcement mechanisms behind the bill because that's something that Senator Cantwell said that... What's kind of a sticking point for her with the earlier privacy bill, the ADPPA, these all have really complicated acronyms, and so this bill basically would let individuals sue companies that they feel like have violated their privacy rights. But it would also give companies a chance to correct the things that they're being told they did wrong. So that's kind of a way to try and balance a really strong enforcement mechanism that also kicks in pretty quickly. Consumers can sue pretty quickly, but also gives companies a chance to correct any mistakes before getting bogged down with lawsuits. - [David] Yeah, that's really interesting 'cause in the past, a lot of the enforcement for this has been kind of hand-wavy and somebody-will-figure-it-out, we'll-set-up-an-agency kind of thing. And this seems like it was much more directed, like who will be in charge of this, and what they can do, and the penalties will be real. Like even just reading through, there's this like eight-page summary of it, I got the sense that like this felt like a real thing more than just sort of some ideas that somebody wrote down. - [Lauren] Yeah, I think that's right. I think enforcement was really a key issue for Senator Cantwell, so I think it's not too surprising to see that that was an area that they seemed to spend a lot of time on. - [David] Yeah, okay. Is there anything we've learned, do you think, from the EU and California? Like, those are the two that I just kept seeing inside of this bill and the... I went back and reread the California one and it even uses a lot of the same terms, right, about being able to correct info about you that's online that's wrong. Having the right to opt out, they can't discriminate against you if they opt out. There's also just like a weird thing, all of a sudden, in the middle that just says civil rights and algorithms, which felt like a total sort of random detour in the middle of a data privacy legislation. But I thought that was very interesting. I don't know, does it feel like the Congress is sort of learning from what has worked and passed elsewhere? I mean I use worked in a very kind of loose way because none of it seems to really be working, but at least what has actually been passed into law elsewhere? - [Lauren] Yeah, I think like at a high level, there's been a shift from this like notice and consent framework that's basically like, \"We're gonna tell consumers what sort of information we're collecting, and then you click Yes, and then we collect it.\" (Lauren laughing) - [David] Which accomplishes nothing, I really believe that. - [Lauren] Yeah, and shifted more to this idea of data minimization, which is like, \"Let's like limit how much data is collected in the first place, and you have to have a really compelling reason for why you need this information to run your service.\" And so I think that's something that's reflected in this bill. - [David] Yeah, that's really interesting. Who are they going after with this bill? Have we gotten a sense yet? I mean, they have some basic outlines here. I think it's like if you have more than 5 million users in the US or over $250 million in revenue, it's clearly a... This is pushed at big companies, especially, right? It talks a lot about data brokers, but it seems like the companies most affected by this are going to be like the handful of big tech platforms. Like, who do you think this is really aimed at? - [Lauren] I think that's right. I think there is concern in Congress about overly burdening small companies and startups, and that kind of feeds into these other questions about competition and concerns there. So I think there is an awareness that Congress doesn't want to overburden small businesses. So I think large companies are really ones that will be targeted here. And data brokers, it seems like there's this growing awareness in Congress about how data brokers can move information around. Around the time of the original TikTok legislation, we saw a separate bill in the House passed around data brokers and sales of US data to foreign adversaries. So I think that's something that is really on lawmakers' minds these days. - [David] Okay, so like you mentioned, we've seen this a few times. Bills come out that there is some enthusiasm about. What normally happens? Like, where in the process does a privacy bill usually die? - [Lauren] In the past, it's been with the ADPPA, which was the last time we had a comprehensive privacy bill that had bipartisan support. - [David] And that was two years ago, is that right? - [Lauren] Yeah. I believe that was in 2022. it passed pretty strongly out of the House Energy and Commerce Committee, and then that was it. (Lauren laughing) So that's the point where we see these things slow down. I think what's significant here is we have both of the chairs who are in power in their committees on the House and Senate side who are going to be able to move this bill if they want, assuming they can get the votes in their committee. So we could, at this point, see both the Senate Commerce Committee and the House Energy and Commerce Committee pass this bill once it's introduced, and then it'll be up to House and Senate leaders to determine, again: Do they give this bill time on the floor? Do they package it in some other legislation? So I think that will be kind of the next point to look out for. And of course, before all that happens, we have to make sure that there's support, enough support in the committees for these bills, but I think there really is widespread support in Congress for comprehensive privacy legislation overall. So I think there is some, at least a good amount of political will there. - [David] Do you make anything of the timing connection with all of the TikTok stuff? Like, are these two things that are happening simultaneously on purpose? - [Lauren] Yeah, I mean, it's a great question. I'm not sure if it's like on purpose in the sense that they were moved at this time because of the TikTok legislation. But I think all of this is kind of like percolating around Congress, and I think it makes sense in a way that we would start to see privacy legislation come out. When we saw the House vote on the standalone TikTok bill, reporters were asking House Committee leaders about: Well, what about privacy? Because that's something that kind of like underlies a lot of these conversations in the first place. And I think I remember McMorris Rodgers actually kind of saying like, \"We're still working on that.\" And at the time, I remember thinking like, \"Okay, sure. (Lauren laughing) Like, yeah, we're gonna go back. Maybe they're gonna reintroduce the ADPPA, something like that.\" But then we got this totally new bill with Senator Cantwell, and that was kind of a moment of, \"Well, okay. Maybe some of this has been really happening behind the scenes.\" So yeah, I think it is significant that privacy is something that kind of underpins a lot of the other conversations we have around tech policy. But I think things often in Congress just move when you can get the political will to do them. - [David] Well, and that's, I think, kind of the big open question still to me is: Is this moment different in that respect than we've had before, right? I think the privacy thing in general is so tricky because there is this sort of intellectual understanding that I think most people have come to where we all kind of know there's too much information about us out there, and it's bad that there is too much access to it and we kind of have no control over it, and it sort of feels intellectually weird. But knowing what that is and what to do about it and what the sort of downstream ramifications are is just complicated enough that it has never really felt like anyone's first priority. It's just kind of a thing that lingers at the back of everybody's mind. But then part of me wonders, A, with TikTok becoming this very visceral outpouring of what it looks like when a platform knows you very well, that is one thing that I think has like maybe made it more present to people what's really going on here. But then I also just wonder if this is yet another kind of lark from people who, there's just a kind of chorus of folks in Congress who are like, \"We need privacy legislation,\" and everybody goes, \"I agree,\" and then just kind of goes off to other priorities. But it sounds like even maybe just from like conversations you're having that at least it's moving up the priority list. It might not be the top thing, but at the very least, it is a thing people are willingly talking about instead of just sort of waving their hands at and saying, \"We'll get to that eventually.\" Is that how it feels just to talk to people right now? - [Lauren] I think basically, I think I didn't necessarily anticipate that we would get a real conversation around comprehensive privacy this year. It's an election year. - [David] I mean, there's a lot going on. - [Lauren] Yeah, so I think there is this sense that maybe this is the time? But I'm hesitant to say that because it's felt like that in the past. But I think there's a certain way you could look at this and say, \"Maybe it would be kind of a good look for Congress to pass a comprehensive privacy bill if they're also passing this TikTok legislation.\" Since I think when TikTok CEO came to testify, some people are talking about, \"Well, aren't all of these problems just like problems with privacy on platforms in general?\" And some of them are. So I think in a way, it would be kind of a good look for Congress to pass comprehensive privacy reform alongside something like that. Is that going to be enough to push them over the edge? I think that's anyone's guess, but at least it seems like these conversations are really happening in a real tangible way again around an actual piece of legislation. - [David] Yeah, I agree. I think my guess is we are a ways away from having an answer to that one, but I think it's gonna be fascinating. Especially in an election year when so many people are talking about tech, I think it's gonna come up maybe more than it has even at kind of hot moments in the past. It's gonna be really interesting. Before I let you go, the last one I just wanna touch on briefly is the future of AI Innovation Act, which is another thing that is sort of in the air everybody's talking about, but it's not necessarily exactly clear where we are headed with this. Tell me a little bit about the future of AI Innovation Act. What are we doing here? - [Lauren] Yeah, so this is a bill that was introduced by a bunch of Senators that have been involved in AI discussions. Again, we have Senator Cantwell. - [David] Cantwell, man. - [Lauren] Yeah, we have Senator Todd Young who has been involved in some of the bipartisan work with Senator Schumer around AI. So this bill would basically... It's basically about creating standards around AI and just spurring innovation. So it's not really dealing with some of these like nitty-gritty issues that we're thinking about with like copyright and things like that, but it's really about just trying to like create a framework for AI to be developed in a safe way and also for innovation to take place. - [David] Okay, so this is one of those bills that is like, \"Let's make a plan to make a plan,\" kind of thing. And you have to write that in a very... And that feels small when I say it, but there was that Executive Order from the White House, which was like a plan to make a plan to make a plan. This is at least like a plan to make a plan. So we're like inching towards a plan, it's something. - [Lauren] Yeah, yeah, I mean it's certainly a start. I mean, I think AI is such a huge issue that touches on so many different areas, that it's hard to imagine just like one piece of legislation being the be-all, end-all of this. So it's certainly, it's a reasonable place to start, I would say. - [David] Yeah, I still remember the Benedict Evans, who, back when he was a venture capitalist, always had this line that, \"We don't regulate cars, we regulate parts of cars,\" which I think is very smart. And I think AI is gonna end up being the same way. Like instead of if we try to regulate AI as a thing, it'll never work. And I feel like to some extent, we've run into this with privacy and the internet, like we try to regulate the whole internet all at once and it's just impossible. But it's like, \"Okay, we can regulate seat belts, and we can regulate steering wheels, and we can regulate carburetors, and we can regulate gas mileage.\" And it's like, that's maybe what we do with AI, and this feels like setting up the, what is it called, the Artificial Intelligence Safety Institute, I think, is like, \"Okay, you need a group that is like in charge of looking at this.\" And that's not anything, but it is a step towards something, and that I sort of appreciate as a way of saying like, \"Okay, AI is too big for one bill that we shove into a foreign aid package. Let's start somewhere else.\" - [Lauren] Yeah, also, I think there are certain things that the American people would probably rather see a specialized agency looking at, rather than Congress just going ahead and dictating a bunch of rules. So I think that is a significant step. - [David] Yeah, fair enough. All right, well, here's hoping that you at least get a weekend next weekend, but Lord only knows. This TikTok thing is just gonna keep happening, so I suspect we will be talking again sooner rather than later. - [Lauren] Yes, I'm sure. - [David] Awesome. Thanks, Lauren, appreciate it. - [Lauren] Thanks, David. - [David] All right, we gotta take a break, and then we're gonna come back and talk AI. (upbeat music) (jaunty music) All right, we're back. A couple of weeks ago, The Verge did a series of panels at the Chicago Humanities Festival all about AI and creativity. Our big question basically was: What does it mean to be a creative person in a world filled with AI, and how is AI changing the lives and livelihoods of creative people? We had three really fun conversations and I just wanna play you a chunk of mine. I got on stage with Tye Sheridan, who's an actor you might know as Wade Watts, the protagonist in \"Ready Player One,\" or from movies like \"X-Men: Apocalypse,\" and the show \"Wireless.\" Along with Nikola Todorovic, who is a writer and a visual effects artist. Tye and Nikola are friends, they're collaborators. And as of a few years ago, they're co-founders. They started a company called Wonder Dynamics that brings a bunch of really cool AI tools to the visual effects business. Basically imagine you film a real scene, and with like three button clicks, you can comp over a regular person and turn it into an animated character. Visual effects with essentially the touch of a button. It's pretty cool. So both Tye and Nikola are right in the center of this really complicated AI moment. So I wanted to talk to them about how they think about AI, how they're trying to build a company, how human creativity and AI can work together and lots more. We had a really good time chatting, actually, and I learned a lot, so I thought I'd just play you a bit of that conversation. Let's do it. (audience applauding) - [Tye] Hello, everybody. - [David] So I wanna start by telling the story of Wonder Dynamics. - [Tye] Well, we had originally started developing shows together. So Nikola and I were both dabbling writing, and Nikola had directed several films and they showed me, I thought he was really talented filmmaker and obviously a really smart guy. And we just became kind of pals through our mutual love of movies and storytelling. And we had started developing a series that had kind of a... It was like had an interactive element to it, and there wasn't really a technology that existed. So we just kind of built a prototype. And that was really the beginning of us getting into technology. - [Nikola] It's really the writing that started it. We wrote a project that we wouldn't say, and this is gonna sound super meta, but it was about robotics, right? So we're writing this sci-fi series that we wanted to make. And every time you write something, as an indie person especially, you have to think about: How do I cut my script to afford it? 'Cause you can't go out and write \"Dune\" and hope to get it funded, right, as a filmmaker that hasn't proven itself. Especially in visual effects, most indie filmmakers and visual effects, stay away from visual effects and CG 'cause it's so expensive, right? Every single scene or shot you add that has a visual effects element adds so much more to your budget and you can't really afford it. So Tye and I really started like that. We wrote this and we realized, \"Okay, this would cost about $150 million to make, and there's no way we can get that money.\" And so we started looking at technology, but funny enough, we were studying technology as we were writing, and this started from us going really deep in robotics and self-driving cars technology, which is all about understanding the world and space around you, right? That's movement of AGI, which is the computer vision. It's like understanding what a chair is, understanding how much distance I have from something. So that's how it started, then we started getting deeper and deeper into it, and then we started building the tech and realized, \"Okay, this is a bit bigger than just our movies. Let's turn it into a platform and let's really start a company to be focused towards that, and then we'll make our movies down the line.\" But we were lucky that we discovered it early before generative AI was even a thing. We internally called it visual AI. There was no term at the time and we knew it was gonna be, so we built in stealth mode for about close to four years. - [David] Just real quick, give me the like 15-second explanation of what Wonder Studio does right now, just for folks who haven't seen it before. - [Tye] Yeah, so essentially, if you have seen movies like \"Avatar,\" you always have these motion capture suits that people perform in. And then you have a lot of equipment you need to do on set to pick up that data, performance data, et cetera. So we essentially sped up that process and let you extract your scene in 3D space so you can get your performance, capture your camera move, capture your lighting, capture, and get your final VFX shot much, much quicker than traditional. - [David] Okay, yeah. the demo I've seen is basically it's like a person coming out of, I think it's a library or something, sort of coming down the stairs of the building, and then it wipes, and all of a sudden it's a cartoon character doing the same movements in the same place the same way as... And you're essentially like automating that out of having Tye wear a mocap suit, which I'm assuming is not a lot of fun, by the way. - [Tye] It depends on how sweaty you are. If you're a naturally sweaty person, no, it's not that much fun. - [David] Fair enough. - [Tye] Also, those volumes. They have all the infrared cameras and sensors in there, they're very warm, so yeah, and the... - [Nikola] Extremely expensive. - [Tye] Very expensive. - [Nikola] That's why you have a lot of... 99% of filmmakers cannot afford production side of things, but post-production is really where it gets extremely, extremely expensive, right? So that was our mission is like: How do we get indie filmmakers to have access to this, which traditionally has always been reserved to high budgets and big studios? - [David] Yeah, and I think the timing that you guys were dealing with is really interesting because on the one hand, you got this massive technical development, right? Like the state of the art and everything you're talking about has gone up exponentially over the last few years. On the other hand, we're now talking about this stuff in a cultural way, like we've been doing all day, in a very different way than we were before. You have access to mountains of data that comes from, in some cases, artists who would prefer that their data not be there. And so I'm really curious as you guys were thinking about like product building, especially coming from this sort of creative background, like what should we build? What can we build? Like, sort of where does the right answer for something like this begin and end? Like, are those conversations you're having? - [Nikola] Yeah, a lot. Yeah, a lot. And especially from beginning, I think we're in a different situation because obviously, we've been super fortunate to have some leaders in the space like Joe Russo, Steven Spielberg, the others who've been on our board. Obviously, Tye's an actor. So we spent a lot of time, and I was a visual effects artist and a supervisor. So we purposely, from day one, build it with, \"We're not gonna be generating art, we're is gonna extract information,\" we call it observing nature. So we're observing how the actor is moving and performing. It's still driven by a shot from a cinematographer. The character is still built by an artist. So we are very different in a lot of gen AI companies that you see, which are generating pixels by other art. For us, you mostly get information in that 3D space. So we're not really producing art, we're speeding you up and giving you that scene in 3D space so you can manipulate it. And also you'll never see us replace the actor with another human. We only are driving characters that don't exist in the real world. So that's a little bit of a thing we had to stop ourself a lot of time 'cause you get very driven with this innovation, and you can go that route and say, \"I'm just gonna build, I'm gonna build whatever I want, right, because I can with this technology.\" But I think for us it was really important to be ethical in that. It's one of those things in a tech company, we call ourself a story company first 'cause this is a technology help storytellers, right? A story will always come first for us. So it is a tough one. It's one of those things that we have a lot of our users that say like, \"You're one of the rare ethically-built company around this.\" But it's tough because you do have to pull back for innovation. There's a lot of stuff we've done research internally, right, that we had to pull back a little bit. We've been having this conversation for a long time. We've been telling people three years ago, \"AI and visual effects is coming, educate yourself. This change is gonna seem extremely drastic overnight.\" But it's not overnight. This research has been going on in academia, Ivy League schools for decades now, right? It's just that we are now seeing it extremely accelerated. And a lot of innovation you see that comes out, gets viral, it's not from yesterday. It's been built on top, on top, on top, right, on that side. So I think the conversation is getting more serious now about these moral issues for us. I don't think we should see the future where we don't have people on set, we don't have artists working on it, but just someone kind of typing away. I do think it will happen. We wanna be a part of the good side of that story, which is you always gonna have performance arts, you always gonna... I think a lot of people underestimate how hard this thing is. Not AI, I'm talking generally filmmaking. It's extremely hard. All of these artists have incredible high skillsets of that, right? It takes decades to learn some of these things and some of these tools, how to use them properly. So I think this kind of promise, it's one-click solution promise, it's one line away. We're not there yet. I'm talking AI in general, not us. So I don't think we're gonna replace artists, all of these actors overnight. I don't think us- - [Tye] I think people will try. - [Nikola] They will try, but I think us, as audience members, we love that human connection. I don't think all of a sudden, everybody's gonna be, \"I don't have a favorite actor anymore because all the actors I watch are AI, right?\" I don't think that's gonna happen, right? So I think that human connection is really important. Sometimes, we like art we watch because of the meaning put by a person behind it, not generate something. So I think if you ask me where the future's gonna go, I think it's gonna be a combination. There's gonna be some prompting that's gonna be a part of it. There's gonna be performance art that's gonna be a part of it, right? Because think of it this way, we always say this: How do you describe a performance with words? It's very hard. That's why we have directors that say, \"Cut,\" five times, or I joke with Tye, always 20 times with him, right? - [Tye] 30. (Nikola laughing) - [Nikola] But some things we cannot even... Even body movement, we don't have English word for some body movements, right? So I think the performance art will always be there, especially in these kind of cases. But let's see where we go is I always say, \"It's important that these tools are also built with people in industry.\" 'Cause if we just let it go on a tech side, it's a very different goal. It's a goal of let me build a tool that's used by TikTokers in billions in numbers so I can get higher value for my company, right? I say we need to build alongside artist community 'cause if you put an artist behind building something, they will think about it because they'll think about it from their perspective as well. - [David] Tye, one of the things you were saying when we were talking the other day that I've been thinking a lot about since is the question of basically the upside of these tools is that it gives access to the kind of creative process to more people who, for reasons of money, or accessibility, or literally where they live in the world, they just couldn't make Hollywood movies, right? Like, Hollywood was a small group of people in a small place that did this stuff. And now, we're getting to the point where these tools, and these platforms, and these audiences are available to many more people. And I think that's awesome. And I think like anything that gets us there is really great. Is there a flip side to that? Like, if we democratize all of this stuff and make it all so automated that anybody can use it, I think that's very cool and also just it feels like it changes what that stuff is, in a way that I haven't quite sorted out in my brain. - [Tye] Well, I think it increases our potential to find original voices. I think what happens when you have a group of people that are surrounded by like-minded individuals, they start to think the same things. It's the same with Hollywood, you have people... In one place, it's a very localized industry. And if you want to get a project green-lit, that's where you have to go. You have to go to the executives that are in Hollywood. And I think this is why we get 600 Marvel movies every day. - [Nikola] That's right. (Tye and Nikola laughing) - [Tye] Yeah, so I think for us, like that was the real exciting mission with our company and the exciting potential is that hey, a group of kids growing up in the middle of some small town in Norway or Kenya can go out and make a science fiction film that, today, it could only be made in Hollywood and do it on a budget. And that's super exciting for us because we don't know where the next James Cameron or Steven Spielberg's gonna come from, you know? And I think thinking even about us, not having a lot of tools growing up, I mean, we would die to have stuff like the tools like this. And I'm not even just saying what we're building, but I think the tools that are coming, this next generation of filmmakers, I do think the biggest potential there is really to discover original voices, and yeah, and to kind of pave a new path for storytelling. And I think Hollywood traditionally prides itself on stories of inclusivity and trying to recognize certain cultures or people that are maybe misunderstood or underrepresented. And I think the way to truly do that and the best and most authentic way is to really democratize the tools and allow people from all walks of life to go and make these films, regardless of their socioeconomical status. - [David] Yeah, it also makes me think that maybe rather than like your close personal friend, Steven Spielberg, making tons of movies with all of these new tools very soon, what actually might happen is that like YouTubers, and TikTokers, and the people who are making this stuff who have never had access to these kinds of tools at any cost might be able to do this kind of stuff. Like, one thing I've been thinking a lot about is dubbing, which is a thing that AI is all over, like text-to-speech is starting to get really good, speech-to-text is starting to get really good. And the idea that you could have something that you make that is actually localized successfully in two languages all over the world, I think is very cool and super exciting. And we're a long way from the tech of that being sort of perfect, but it's already... Like the stuff that \"Squid Game\" was a couple of years ago where you see their mouth moving and you hear the words and they're obviously different. Those two things are coming closer together. And I think that's very- - [Tye] Yeah, it's also from an actor's perspective- - [Nikola] Wait, wait, wait, you just revealed. You watched the US version, I think, so the \"Squid Game's...\" - [Tye] Come on, you have to watch. - [David] I did, I'm not proud. - [Nikola] Listen, you gotta watch original with the stuff that... (everyone laughing) - [Tye] Yeah, I mean from an actor's perspective, do you really want someone else in some other country dubbing your voice in a foreign language? I mean, I would rather- - [Nikola] It's a whole different panel now. We're getting in a whole different panel now. - [Tye] No, I think it's- - [David] No, I think it's good. - [Tye] It's a good example. I mean, I think we can recognize where AI is starting to be used to, in some ways, to stay true to the performance of the artist, the original artist. And I think that's awesome. I mean, obviously, I have a biased perspective probably being an actor, but... - [David] Well, and again, this is like, I've realized a lot of what I'm gonna do here is just like throw weird tensions at you and make you sort them out in front of me. But the thing that I struggle with on that one is like they're doing this a lot with podcasts too, right? And I host a podcast and we get a lot of people who are like, \"I don't speak English. I would like to listen to your stupid podcast. Can I do that?\" And there are companies out there that are like, \"We will automatically dub you into 60 languages.\" And on the one hand, super cool. On the other hand, I don't know if they're good or I'm gonna say what is... Right, like, so it sort of crosses this invisible line where I go from like, \"Oh, access is awesome,\" to like, \"This feels weird because you're now no longer getting the thing that I did.\" And that somewhere in there, it starts to feel odd. - [Nikola] There's definitely those lines, but I think what you were saying earlier is what I think is gonna happen, right? I don't think studios are gonna have issues. I think what the people don't realize, there's so much sacrifice in every project we see. Turning things from page to screen is really, really hard. There's always a lot of sacrifice that comes from it. So I think studios are just gonna keep pushing things higher. But I think indie filmmakers, as you mentioned, like YouTubers, if you remember the days when DSL Arts came out, right? And people are saying, \"Oh, my God, everybody's gonna be able to make a movie now, right, with it.\" But that doesn't mean those movies were necessarily great 'cause storytelling is still hard. Coming up with a good story is still extremely hard, right? So we're gonna open access with these innovations in AI, right, across the board, which is really exciting. I think what YouTube did, and I always say this, YouTube is a good example of distribution changing, right? So we had open distribution. I think what's happening now with generative AI is that we're changing production. So open production, right? So meaning these kids could come up and express themself, and put it on YouTube, and if they're good people like them, they will find it, right? There's billions of people watching it. I think now with production, we're gonna have these tools where it was gonna be easier, direct line for them to express themself. But again, there's no guarantee that's good, right? If you go into masses. On the flip side of that, which you were saying kinda mentioning with Marvel movies, it's a hard thing. I understand both sides. It's a really hard thing for studios 'cause if you spend $250 million, you need to make 500 to break even, right? And you're spending another 100 probably in marketing, right? So you can't really take a big risk. And I always say it would almost be impossible to get \"2001: A Space Odyssey\" green-lit today. It's too artsy, right? And I think that's what, for us, was really exciting. Once you get these tools and you bring the price down, you can take higher risks and you can make visually spectacular films that the young audience would wanna watch, but make a grounded story really about the character, push some narrative, push some subject matter that's extremely, extremely important. - [Tye] And if you're not spending $200 million, if you're spending 20 on each, you can make way more films and employ more artists. - [David] When we were talking before, one of you brought up Netflix as another sort of wrench in the engine of like what people think that we make and how it changes what things were like. We got different kinds of TV shows because Netflix existed and what that platform wanted. So to some extent, do you think AI is just sort of another in this like long series of changes that Hollywood has been going through forever? Or is there something different about AI? - [Nikola] I think it's different because of scale. I think it's different because it's gonna distribute it is much more, it's not gonna be as localized, but I don't know, I'm optimistic. I think the beauty of it, the positive side, is that democratization we're talking about. The negative side is like: How much is it gonna affect it? But if you look at through history, Hollywood kind of always found its way, right? It always found its way to survive. Early days of television, people said movies were over, right? And now that cycle went and kind of repeated itself now, 80 years later, with the streaming platform. And then it's coming in a slow recovery on that. So I think storytelling find its way on that. But I do think it's gonna be a big shift. A lot of people in production side, especially below the line, a lot of artists below the line. Tye and I talk a lot about like: What if shooting in person is gonna be like black-and-white movies today? You don't see many of them, but you see some, right? But if that happens and going around. So it's interesting. Nobody really has an answer of what that's gonna end up being. But yes, again, to repeat, like we've been telling people three, four years, start learning these things, start learning these tools, it's the only way to kind of survive through it. I think it's genie's out of the bottle. It's really hard to stop some of these research and some of these innovation. - [Tye] So I think... Yeah, I think that was the big thing during the strikes that didn't happen. People, there was a lot of controversy. People were saying, \"Oh, AI's either bad or good,\" and people were jumping on this spectrum on one extreme end or the other. And no one was really coming together to talk about it in an open way and say, \"Hey, let's educate ourselves on this.\" And I think that's truly what everyone needs to do. It's what the industry needs to do, it's what artists need to do. Artists need to understand exactly how it's gonna change the course of their careers, what benefits it poses, what threats it poses to their careers. I think we really, as creators, have to come together and really openly educate ourselves on what it means for the future. - [David] Do you think there's room to influence that as creatives? I think to some extent, there's a version of that conversation that basically sounds like, \"We're screwed. The old way is dead. All we can do is just sort of hunker down and try to move forward.\" But there's another way that says, and I think this is like talking to folks, especially during the writers' strike, there's this question of like: How can we make this better? Like we agree that there are things that ChatGPT can do for scripts that are useful, but we have to do that in a way that also works for us as people who have jobs and do creative work. Like, can we... My worry with a lot of things about AI is that the tech is getting better faster than we are at dealing with it. And so it's just gonna sort of leave us behind and we're gonna end up at this place of all we can do is just sort of give up and try to survive. - [Nikola] No, I think it's not getting as fast as you would read online. - [David] Okay. - [Nikola] It's flashy, but practically on film, it's still not completely usable. It'll get there. That's one of the reasons we built it that way 'cause we knew there's no way you can push every shot just with AI. You'll get 60% there, so you need to give this data to the artist to be able to manipulate it all the way there. So it's still a bit like flashiness and excitements. - [Tye] We're kind of seeing it now in a way with some films that I think are dominating the box office. I think audiences are seeing films that they're not enjoying. And yeah, sure, you can argue that that's happened always. But I think ultimately, people will... Good stories attract people, and people go, and they see a good story, and they tell someone about it, and then that person goes and then they see it, and they tell someone else. And so I don't think that will ever stop, you know? And so if you have, let's say, a studio, or a production company, or anyone that thinks, \"Oh, well, we can just use AI and replace everyone.\" Well, if they're not making good stories, it's not gonna matter. These stories won't be successful because they won't connect with people in an emotional and a real way. And that's what artists are good at, that's why we need artists, regardless of what tools they have. And that's always been true since the dawn of time, since we've been telling stories, since we've been telling stories through art. And I don't think that'll ever change. - [Nikola] Thinking about making a movie, like I don't know how many people in this room made $100 million movie or made a movie, right? How many people would like to make a movie? - [David] Tye should raise his hand, just then Tye should raise his hand. - [Nikola] Yeah, yeah. But I'm saying if you ask a really large group of people, \"How many would like to be able to make a movie?\" Most people say, \"Yeah, that'd be fine. I would like to do that, right? I would like to express my feeling and tell people my story.\" The amount of people that get to like make $150 million movie, it's handful. It's handful of these directors that you get to work. So I think our industry will just grow because of... It's not gonna shrink, it will grow 'cause it's gonna be very, very global. We're talking Hollywood, and I always say like storytelling is extremely important. It should not be dependent on your socioeconomical status. That's why we started this. And I think that's what's important about AI. But yes, you gotta build it responsibly. Otherwise, it can hurt us long way. - [David] Let's just talk about sort of Hollywood more broadly right now. And I'm curious, especially sort of specific AI stuff, you're starting to see work its way into how these things get made. We've talked about dubbing a little bit. We've talked about what you're doing at Wonder with the VFX stuff. Like, are there other things that are starting to sort of appear in the filmmaking process and be part of the conversation in Hollywood that are either cool or early versions of something cool? - [Tye] Yeah, I think Hollywood is, it's odd 'cause it's hypocritical, but Hollywood, I think, is notoriously standoffish to new technology even though it's an entire industry predicated on the advent of a camera. And then thereafter, new stories and the best movies were making technological advancements, and they wouldn't be possible without those technological advancements. But I think now, there are certain decision-makers in Hollywood, and I'm not saying it's everyone, but there are a lot of decision-makers in Hollywood who know nothing about technology. They know nothing about how visual effects work, really. At a very high level, maybe, but there are people who, who make a lot of decisions and I think they don't understand technology at a certain depth. So I think sometimes, it's also kind of a risk management business too. You have thousands of artists working in certain pipelines. You can't just decide to use an some AI tool and change that entire pipeline overnight. No one's ever gonna go for that. And that's one reason why we built Wonder Studio the way we did so that it plugged in directly to the pipeline that artists were used to that productions were using could actually utilize this tool. It's not a black box, right? So yeah, I think the industry's kinda been battered over the past few years. I mean I think it's fair to say we had COVID, which was a major dent in the global box office, and then we had the streaming wars and digital distribution has been... The landscape of digital distribution has been changing and distribution at large has been changing, and now the strikes, and AI, and so it's just... It's kind of, it's been a rumble-tumble past few years. I think people are really trying to understand like: How can we come out of this? And are we actually on stable ground now? And can we go and green-light films, and if so, how much risk can we take? What tools can we utilize? So I think it's really like we're in a discovery phase right now, and I think people are trying new things. I think people are really starting to test a lot of things behind closed doors. So I do think this will be the year where we really start to see a lot of new use cases, and we've seen a few, but I do think there'll be more significant examples that we'll see in the next year. - [Nikola] A lot of the tech is not there yet. A lot of tech is really good to push it to something that you can put on social media, but film's different. You gotta get it up to 8K, it needs to be crisp. And also, we said like this kind of age of generative AI has been last year, year and a half. But storytelling and film is all about collaboration and back and forth. Like you turn in your shot to a director or editor and they're gonna give you back notes, and sometimes you're gonna have, they're called passes, sometimes you're gonna have up to 20 of them, and the changes are gonna be so specific, right? And so these generative AI tools just haven't gotten there yet that you can edit the finest pixels of that. And that's the limitation of 2D space a little bit in that side because you can generate something that's really cool, but it's a little bit off: How do I fix it? I think it'll get better. Also, we haven't seen really performance so it hasn't been used. I mean, a lot of these text-to-video, they don't yet know how to generate performance completely on that side. So I think a lot of filmmakers are still kinda exploring it. So the promise is big, but we're not completely there yet. - [David] I read somewhere that actors are starting to put in their contracts that they have to use VFX to make them look however many years younger or remove the lines. (indistinct) There's a budget just for like wrinkle removal on Tom Cruise's face. - [Nikola] I can't confirm that. (Tye laughing) I did used to do that early in my career. - [David] There you go. - [Nikola] It was just... It was just removing people's under eyes and stuff like that, yeah. - [David] But not Tom Cruise, he's ageless. Tom Cruise, don't come after me. - [Nikola] Exactly, yeah, no, never. - [David] Okay, so- - [Tye] I thought Tom Cruise is AI. (everyone laughing) - [Nikola] There is an AI meta that's metaphysics, right? - [Tye] Yeah, yes, that is, that's true. - [David] All right, we're gonna run out of time here soon. So let's take some questions if folks have questions. - [Audience 1] Hi, can you quantify the access that you're talking about, the democratization? What is the pricing model of your product, and what are the price, the cost savings that you promise your clients when you go in for a pitch and across what tasks? I'm curious about- - [David] Good question. - [Audience 1] Kind of the material benefits of the product. - [Nikola] Yeah, no, that's a great question. When I say democratization, I mean AI in general where it's going. We're not saying we're the only player out there that's just gonna democratize the entire- - [David] You're just in it for the money. - [Nikola] Yeah, that's a very big promise. I'm talking in AI general. For us, we really see savings up to 60, 70% going in aspect. The thing that we're really saving people on production side, you need a lot of these hardware, not just the motion capture suit. You need to track your camera, which is additional hardware. You need all the sensors, which is more price on the hardware. And then in post-production, there's a lot of these monotone tasks that really take weeks sometimes that we brought down to hours on the side. So we've seen quite a bit of significant change. Again, it really depends and we just spoke earlier in visual effects. You have something called easy, medium, and hard shots. And usually when you bid a project you say, \"Okay, I have 2,000 shots, 500 is gonna be easy, about 1,000 is gonna be medium, and then 500 is gonna be hard. So what we did is kind of brought down some of those hard to be medium and medium to be easy. So that's really where the savings come on. And what we've seen also what's really interesting is a lot of our users are... Because our tool goes from $20 a month to $100 a month. So we really build this to be affordable. Traditionally if you use mocap, sometimes, you're gonna spend $30,000 a day to do that, right? So there's a drastic, drastic change there. But we were talking earlier, it's like our goal is to open it up free as well as a part of that. The only reason as a startup you can't do that because these computers, we made it as a web browser so everybody can... Accessibility was a big one for us. So everybody can access it, but that means you have the cloud cost. But I always say cloud's not a actual cloud up there, that's free. Amazon has a workstation somewhere that you have to pay by the hour, right? So that is a cost on us. Even ChatGPT, they're spending millions of dollars a second when someone's prompting. Someone's gotta pay for that. So for us as a startup, we picked it in a route where we're not gonna go out to raise hundreds of millions of dollars just to get higher numbers so we can claim we have hundreds of millions of users, right? We did end up close to a million of users on our platform, but the hard part there is like, \"Okay, we can't open it up yet until we bring the cost down for us, so we can make sure that this can run for a long time.\" - [Tye] Totally. - [David] All right, Let's do a couple more. - [Audience 2] Do you guys have any thoughts around the end game for materials being created these days? Like at the movie theater, for instance, are we gonna see changes in how we view these new products at some point? It seems like going to the movies has fundamentally changed. I don't know if it was the pandemic or what have you, but now we are at these inflection points with the AI, the new ways that we inhabit spaces. Do you have any thoughts around that? - [Tye] Yeah, I mean I think, yeah. We will continue to see that change. Will it ever go away entirely? I don't think so. I think people will go to the movies, and they may be sitting in a virtual cinema, but they might be watching movies still. I don't think that'll ever go away. I think that's a very special experience. But I do think with new advancements, we will see new mediums that are extremely compelling. I especially think interactive for games is gonna be huge, obviously. Yeah, we'll continue to see new mediums as technology continues to evolve. But I don't know if we'll ever lose. There's gonna be some form of nostalgia of like, \"Oh, I love going to see a movie in a theater surrounded by other people on a huge screen,\" and I hope we'll never lose that. - [Audience 3] I'm wondering if you have a POV on like other industries outside of Hollywood, whether it's like Nollywood, or Bollywood. Are they embracing AI more and like maybe seeing that as an opportunity to even like skyrocket closer to Hollywood? - [Nikola] Yeah, definitely. We've seen like one of our first users have been from Nollywood and different ones, and we've seen it definitely happen. To me, that's exciting, 'cause I think we'll get more chances 'cause especially in like CG and visual effects, a lot of these smaller markets really wanna do the same thing that Hollywood's doing, but they either didn't have the know-how or the budgets needed to do that, right? - [Tye] Or the production equipment. They just don't have the hardware. - [Nikola] Yeah, yeah, exactly. So that's where it's really exciting. We've seen it a lot, and I think there's a stat somewhere, Nollywood is making more films per month than something about like Hollywood than one more industry combined. - [David] Wow. - [Nikola] Yeah. Yeah. It's quite fascinating, and if you start looking into it, it's crazy quantity of it. But again, as you mentioned earlier, like if we have good dubbing and stuff that comes out, we might probably see more of those films, right? Because I always joke, my girlfriend doesn't like to watch films with subtitles, which is, again, terrible for me, right? Because I love to watch foreign films. - [David] I can't look at my phone and read subtitles at the same time. - [Nikola] Yeah, I know, I know. She says she doesn't like to read movies and I can hear her say that every time, but I do think like a lot of audience actually doesn't like to read subtitles. So if we figure out a way: How do we bring these foreign films more and make people comfortable to watch it? It will help on that side. - [Tye] But we have users all over the world, from Japan, to China, to England, Norway, US, Mexico, South America. Yeah, we have users kind of globally. - [Nikola] But I think general outside of our platform, yeah, we're seeing a lot more AI usage on that side. Everybody's trying to figure. What's exciting is sometimes you think you see things on YouTube that just some kid came up with a new pipeline, it's extremely promising. And I was like, \"Wow, that's very interesting.\" If this kid goes out, you could raise $10 million an idea on a startup because this is a really good pipeline, but it's one kid sitting at the computer and researching things. I think that's the exciting part and we said it's kinda like equal starting point for everyone. That's the fear of it. But that's also, to me, the exciting part of it is being like, \"Oh, everybody has a chance to figure out how to do this.\" And obviously, the traditional kind of gatekeepers will be worried about that. - [Tye] And maybe at some point, maybe those gatekeepers even get replaced by people who are telling better stories, who are coming up with more efficient ways to tell those, and it's better for the world maybe. - [David] Here's hoping. All right, I could talk to you guys about this for hours and I also didn't ask you a single question about \"Ready Player One,\" so you should be grateful. - [Tye] All right, Nikola, this one's great. - [David] We gotta go. Tye, Nikola, thank you so much for doing this with me. This is really fun. Thank you. - [Tye] Of course, thanks for having us. - [Nikola] Thank you for having us. Thanks, everyone. (audience applauding) (upbeat music) - [David] All right, we gotta take one more break and then we'll be back to do a question from \"The Vergecast\" hotline. We'll be right back. (upbeat music) (jaunty music) (dial tone trilling) We're back. Let's get to the hotline. As always, the number is 866-VERGE11 and the email is vergecast@verge.com. We love all your questions and we try to answer at least one on the show every week. Thank you, by the way, to everybody who keeps reaching out about the BOOX Palma. That is like the most intriguing device according to \"The Vergecast\" hotline in a long time. I'm getting one, and I'm going to have a lot to say with Alex on this show very soon. Get ready. This week, we have a question from Braden. (tone ringing) - [Braden] Hey, David, this is Braden from Utah. Why has iMessage not improved? I mean that like I remember when like iOS 10 happened and GamePigeon was a thing where you could play games through iMessage with your friends. It was the coolest thing. And I still play GamePigeon games with my friends and family to this day, but I remember in 2016, that's eight years ago, I was like, \"Dang, this is cool now, but think of the things people will make with this, how there will be other things to do in iMessage.\" And currently, like the list has not grown at all. It is GamePigeon, gifts, and then weird apps that want to be in your messages that don't belong there. And it's just like, don't you feel like iMessage held more promises and just hasn't fulfilled? Does \"The Vergecast\" play GamePigeon games together? What are your thoughts? I wanna hear them. - [David] This is actually something I've done a lot of reporting about over the last couple of years. Not necessarily with iMessage specifically, but with messaging apps in general. And I think you can look at the whole world of messaging apps to kind of answer the question. So the thing that turns out to be true about messaging apps is that, A, you can't really build a business on a messaging app. There's just no real evidence that lots of people will pay you lots of money for a way to talk to their friends, right? Like the idea of a texting app is so commoditized at this point that there's really no business to be had there. So if you are a messaging company, let's say Snapchat, or WhatsApp, or Telegram, or iMessage in this case, you have to figure out a way to be successful that isn't just messaging, right? If you and I messaging each other, it's never going to be a business, and I believe that it's not. You have to figure out something else to do. So you essentially have two options. You can either try to build stuff around messaging, which is like what Snapchat does with things like Snapchat Originals, and Spotlight, and all the creator stuff that they've been doing. And Stories, frankly, is a way around messaging stuff so that you come to the app to do messaging and you stay to do everything else, and that's where all the money is, right? That's essentially what WeChat is. WeChat's whole idea was to build an entire universe around the place that people go to communicate with their friends. That's a real business. You can do it, it's a tricky thing to get right from a UI perspective. I think Snap has been through this in a bunch of complicated ways trying to say, \"Okay, you came here for a messaging app. How do we get you into all of the things that we can do to make money?\" But that is one way to do it. That's also, I would say, what WhatsApp is doing with things like Business Messaging. WhatsApp is really interested in getting you to get menus, or business hours, or things like that through WhatsApp. That's a thing people are doing kind of informally anyway. And they would really, really, really like to bring that into the WhatsApp ecosystem. That's also a way they can make money, they can charge businesses for those services. They can take a portion of money that gets moved around inside of these things. But again, all of this is kind of ancillary to, \"This is where you message your friends.\" The other way to do it is to try to figure out a way to insert experiences into the place where you message with your friends. And this is where it gets really messy. I think about like Google Allo is probably the best example of this. If you remember that, this messaging app Google made from years ago, and its big idea was that you could bring an AI system, at that time Google Assistant, into your chat with your friends. So you could say we're planning to go to dinner or we're planning to go to the movies, let's buy movie tickets. And you could actually buy movie tickets inside of your chat with your friends. Cool idea in theory. I think this is also where things like games, like Braden was talking about, or this idea that we can have experiences together inside of our chat window seems cool. Emphasis on seems. In reality, this ends up being a pain. It's very hard for these apps to find a way to sort of insert themselves, or add these services, or even make you aware of these services without getting in the way of just you talking to your friends. And if you think about it, the idea of screwing up your chat interface with your friends is like totally untenable. People just won't do it, right? You get to the point where, \"I wanna have messages back and forth with my friends, and if you change that or screw it up, disaster.\" And I think in a funny way, Apple has been trying to almost do it without fully doing it for a really long time. There was the iMessage app store where you could send stuff, but that had an incredible discovery problem. Like most people, I don't think, knew the iMessage App Store existed. It was buried in a menu in the iOS keyboard when you were in iMessage. That didn't really work. Now, there's this new menu where you can send stuff that works a little bit better, but that menu is really slow and kind of awkward. But I think what Apple would really like to do is make messages a full-on internet platform in a very real way. You should be able to send somebody a link to tic-tac-toe and it just expands, and you can play tic-tac-toe inside of the iMessage window right there without ever leaving the app. If you think of it right now, a lot of this stuff is just links, right? Like if I wanna play a game with you, I send you a link, you tap on the link, and we go play the game. That's actually a pretty good user experience. So to bring that into the messaging system is a pretty tall order. And to do it in a way that doesn't disrupt anything else or threaten to take your data or break encryption in these encrypted messaging apps. It's just hard. People want private messaging, they want simple messaging, and they wanna be able to talk to their friends, and to add things to that is borderline impossible. That said, they're gonna keep trying. They are just going to keep trying. There are too many people spending too much time in messaging apps for these companies to not try and find ways to insert themselves. And so you'll see more stuff like this that inside of things like Slack and Discord, you're already starting to see these fuller web-like experiences you can have just inside of a chat window. I think that's where we're headed in certain ways, but I also think that's gonna make basic messaging apps like Signal and WhatsApp, and frankly iMessage all the more valuable to people. 'cause that's where you go to just talk and that is like the main thing we wanna do on the internet. Think about how annoying Gmail ads are. You're like, \"I just wanna look at my emails and you're showing me a bunch of ads at the top of my inbox for some reason.\" Add that to your text messages with friends and family, which are even more intimate and even more important. And that just sucks, people will run away from that. And if your Apple, again, iMessage is one of the core things that keeps people using iPhones. Being a blue bubble is a very important thing. And so if you make people hate iMessage to the point where they'll start using WhatsApp, that's a huge, huge risk for Apple. So Apple is in this tricky spot, just like everybody who makes a messaging app of saying, \"Messaging is so important. We want to build a business out of it. It's where people are, it's what people want to do. But if we do it even slightly wrong, people will run away.\" And that kills a huge amount of any kind of moat and advantage that we have to keep people in. That tension mostly means we get to keep our simple good messaging apps, but that tension may not last forever. And I think it's gonna be really interesting because it is abundantly clear to everyone who makes an app that if you can get people to message inside of it, they will live inside of your app and that becomes very powerful. You don't wanna screw it up, but it's a powerful thing to have going for you. So we'll see. I would bet we're gonna see a lot more experimentation inside of these apps, especially these kind of just outside of messaging things where like, \"I can send you a game in the way that I send you a GIF,\" or, \"I can send you an interactive poll inside of a group chat.\" That's the kind of stuff that's already coming to WhatsApp, and I think you'll start to see that in more places. But I sort of hope we never get these like massively interactive full-web experiences. I do not need a chatbot in my messaging system. I just don't. This thing where you can talk to an AI chatbot, like you talk to a person, fine. Do not put an AI bot in my group chats, Meta, Apple, Google, whoever else. I don't want that, I don't think anybody does, but they're probably gonna do it. We'll see. (upbeat music) All right, that is it for \"The Vergecast\" today. Thanks to everybody who came on the show, and thank you as always for listening. There's lots more on everything we talked about at theverge.com. We'll put a bunch of Lauren's stuff into the show notes. She's been covering all of these privacy bills really well. But also just read theverge.com. There's a lot going on right now and we are also running headlong into Developer Conference season with Google, and Microsoft, and Apple. Stuff's about to get nuts. As always, if you have thoughts, questions, feelings, or wanna ban TikTok, you can always email us at vergecast@theverge.com or call the hotline 866-VERGE11. We truly love hearing from you. Also, again, the BOOX Palma. If you wanna know about the BOOX Palma, send us questions. I think we're gonna have to do a whole big thing on it on this show because I'm getting the clear sense that y'all are interested. So if you have questions, keep them coming. This show is produced by Andrew Marino, Liam James, and Will Poor. \"The Vergecast\" is Verge Production and part of the Vox Media Podcast Network. Nilay, Alex, and I will be back on Friday to talk about the Rabbit R1, all the other news in tech and all of our feelings about everything. We'll see you then. Rock and roll. (jaunty music)",
    "transcript_keywords": [
        "people",
        "kind",
        "Yeah",
        "lot",
        "thing",
        "things",
        "bill",
        "Senate Commerce Committee",
        "House",
        "make",
        "Congress",
        "Senate",
        "time",
        "sort",
        "Commerce Committee",
        "bills",
        "stuff",
        "privacy",
        "privacy bill",
        "TikTok"
    ],
    "transcript_entity_values": [
        "American",
        "New York",
        "hours",
        "2D",
        "Biden",
        "WeChat",
        "Vox Media Podcast Network",
        "Andrew Marino",
        "past few years",
        "three",
        "yesterday",
        "the day",
        "morning",
        "15-second",
        "the next year",
        "the last few years",
        "decades-old",
        "about $150 million",
        "about 1,000",
        "millions of dollars",
        "Israel",
        "nine months",
        "this day",
        "2",
        "EU",
        "years ago",
        "Verge Production",
        "20",
        "the White House",
        "David] Cantwell",
        "TikTokers",
        "Steven Spielberg's",
        "$10 million",
        "Meta",
        "thousands",
        "UI",
        "a couple of years ago",
        "English",
        "One",
        "hundreds of millions",
        "four years",
        "Rodgers",
        "David] Big month",
        "iMessage",
        "Alex",
        "58",
        "a million",
        "TikTok",
        "This week",
        "YouTube",
        "Microsoft",
        "this minute",
        "Bollywood",
        "Tons",
        "Wonder Dynamics",
        "hundreds of millions of dollars",
        "a weekend",
        "David Pierce",
        "Mike Johnson",
        "six months",
        "Tye Sheridan",
        "Nikola Todorovic",
        "360",
        "hundreds",
        "this week",
        "the House of Representatives",
        "2001",
        "60%",
        "$150 million",
        "the American Privacy Rights Act",
        "eight years ago",
        "Verge",
        "overnight",
        "the Senate Commerce Committee",
        "Mexico",
        "Google",
        "Ukraine",
        "up to 20",
        "Norway",
        "2020",
        "England",
        "David] Awesome",
        "Gregory Meeks",
        "centuries-old",
        "every week",
        "VFX",
        "Senate",
        "70%",
        "six-month",
        "YouTube",
        "the hour",
        "Tom Cruise's",
        "100",
        "Nikola",
        "Joe Russo",
        "the \"Squid Game's",
        "ByteDance",
        "this year",
        "China",
        "Cantwell",
        "WhatsApp",
        "weeks",
        "the Chicago Humanities Festival",
        "Netflix",
        "decades",
        "Liam James",
        "first",
        "Friday",
        "House",
        "genie",
        "the Rabbit R1",
        "South America",
        "Chinese",
        "the National Defense Authorization Act",
        "the House Energy and Commerce Committee",
        "10",
        "a couple of days",
        "last year",
        "WeChat",
        "30",
        "30,000",
        "AI Innovation Act",
        "about one",
        "Republican",
        "Utah",
        "Democrats",
        "Washington",
        "Early days",
        "AI",
        "20",
        "Gmail",
        "less than 24 hours",
        "ADPPA",
        "Telegram",
        "Kenya",
        "the Executive Branch",
        "the Senate Commerce Committee Chair",
        "California",
        "US",
        "8",
        "Marvel",
        "Nikola",
        "Dune",
        "2016",
        "Congress",
        "Wade Watts",
        "YouTubers",
        "the House Foreign Affairs Committee",
        "the days",
        "Constitutional",
        "more than 5 million",
        "the iMessage App Store",
        "The Vergecast",
        "next weekend",
        "billions",
        "second",
        "2018",
        "Lauren Feiner",
        "the last couple of weeks",
        "these days",
        "five",
        "Tom Cruise",
        "2,000",
        "Monday",
        "$200 million",
        "866-VERGE11",
        "McMorris",
        "over $250 million",
        "tomorrow",
        "the year",
        "The Verge",
        "sec",
        "First",
        "A couple of weeks ago",
        "three years ago",
        "DSL Arts",
        "a few weeks ago",
        "one",
        "Democrat",
        "Apple",
        "500",
        "$100 million",
        "David] Tye",
        "iPhones",
        "99%",
        "Nollywood",
        "$250 million",
        "Cathy McMorris Rodgers",
        "David] Fair",
        "Snapchat",
        "today",
        "Braden",
        "Tye",
        "Gaza",
        "eight",
        "60",
        "Hollywood",
        "AGI",
        "80 years later",
        "Slack and Discord",
        "the Artificial Intelligence Safety Institute",
        "a few years ago",
        "YouTube",
        "as late as Wednesday",
        "another three months",
        "Ready Player One",
        "3",
        "day one",
        "at least one",
        "Senate Commerce Committee Chair",
        "Maria Cantwell",
        "the last couple of years",
        "Signal",
        "an election year",
        "two",
        "Lauren",
        "gen AI",
        "all day",
        "Steven Spielberg",
        "James Cameron",
        "Amazon",
        "David",
        "Todd Young",
        "the past few years",
        "up to a year",
        "Japan",
        "Schumer",
        "Google Allo",
        "the Senate Intel Committee",
        "600",
        "100",
        "GamePigeon",
        "Business Messaging",
        "two years ago",
        "House Committee",
        "2022"
    ],
    "transcript_entity_types": [
        "NORP",
        "GPE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "DATE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "GPE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "LANGUAGE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERCENT",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "CARDINAL",
        "GPE",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "PERSON",
        "TIME",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "LOC",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "EVENT",
        "CARDINAL",
        "NORP",
        "GPE",
        "NORP",
        "GPE",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "LAW",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "NORP",
        "PERCENT",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE"
    ]
}