{
    "id": "dSIsHHyTX48",
    "title": "Excel is an eSport Now.",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2023-11-10T22:14:33Z",
    "video_url": "https://www.youtube.com/watch?v=dSIsHHyTX48",
    "category": "Science & Technology",
    "tags": [],
    "views": 429714,
    "likes": 20732,
    "comments_count": 522,
    "description": "Play Enlisted for FREE on PC, Xbox Series X|S and PS5:  Follow the link to download the game and get your exclusive bonus now. See you in battle!  There is actually a fairly big competitive scene in...Microsoft Excel, of all things! But how the heck does that work?  Leave a reply with your requests for future episodes.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://enplay.link/techquickie.",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "It's fair to say most of us don't like spreadsheets, but the people who do like them, like them a lot. And while many of us use Microsoft Excel in our day-to-day work, an elite few have adapted the world's most popular spreadsheet software into an eSports phenomenon. In 2022, the Excel World Championship debuted as part of ESPN's The Ocho, an annual showcase of lower profile sports like axe throwing, corgi racing, and of course, the slippery stair climb. The vast majority of viewers had never even conceived of competitive Excel before, because there are some levels of nerdy that are simply beyond mere mortal ken. But the sport was popular enough that it was renewed for the 2023 Ocho and will be holding its finale in the Las Vegas HyperX eSports Arena this December with a prize pool of $10,000 across the competition. But Excel as an eSport didn't appear out of nowhere fully formed in 2022. It came out of an existing culture of financial modeling competitions. Basically, these are tournaments where participants must create a financial forecast for a fictional company based on a provided data set in, what else, Excel. The organizers of the Financial Modeling World Championship were looking for a way to turn these competitions into a spectator sport, because apparently the cultural mainstream is unenthusiastic about debt service coverage ratios, which is a real shame. They gradually adapted the format to make the contests more exciting and accessible, and in mid-2021, they went viral, because, you know, pandemic. Finally, ESPN expressed an interest, and the FMWC Open was streamed on ESPN3 in December 2021. The next year, Microsoft sponsored the competition, lending it their own name and making it the Microsoft Excel World Championship. But what does a round of competitive Excel actually look like? And how do you Excel enough to win? We'll tell you right after a message from our sponsor, Enlisted. If you're looking for a slightly more traditional type of game with immersive World War II combat, check out Enlisted. It's available on PC, the Series S and X, and PlayStation 4 and 5. With several iconic campaigns from history to play in, every game will feel fresh, and you have complete customization over your soldiers when you go head-to-head with other players. So hit up the link below and start playing Enlisted for free today, and score some additional bonuses just for signing up. Each round of an Excel tournament has a unique challenge, like tabulating the results of a series of hypothetical elections, or projecting the outcome of a game of Whack-A-Mole. Participants have to answer a series of 100 increasingly difficult questions about the puzzle in only 30 minutes. That's roughly one answer every 18 seconds, but that assumes that the players are answering them one at a time, which they aren't, unless time is short and they're desperate. Questions are typically organized into five batches of 20 questions, and the dominant strategy by experienced players is to create a single formula that will solve an entire batch. This means that a player's score can stagnate for long periods, then jump rapidly. It can even go down, which means it's time for a quick undo. But that might not save novice players who get stuck and wind up with a big fat zero out of 1,000. The winner is whoever answers all the questions correctly first, or whoever has the most points when the 30 minutes are up. The puzzles can vary a lot in terms of difficulty, so the points players receive are typically adjusted to normalize scores across games. An infamous 2021 case based on the game Civilization was so difficult that the winner managed to get just eight points total, narrowly edging out his opponent, who managed to accumulate a paltry six. Both of them were guessing, which can be executed quickly and efficiently using the formula RANDBETWEEN to cover large batches of unknown answers. Familiarity with keyboard shortcuts is obviously a necessary skill, to the point that player bios will list their favorite shortcut. And there's some hot controversy in the meta over whether competitive players should ever use a mouse to navigate. Advanced players with a fluency in visual basic might even code on the fly. Unsurprisingly, the game tends to be dominated by accountants, actuaries, mathematicians, and engineers. You know, the alpha nerds. The format of games can vary as well, with tournaments sometimes featuring one V one elimination matches, and other times eight player battle royales. It's brutal. A panel of commentators narrate the game, dissect the outcome, and introduce and interview the players before and after the fact. And at in-person events, there's often an electric crowd, excited to see their favorite Excel battler perform the spreadsheet equivalent of a mounted elbow drop off the top rope. And it's not a sport without merch. They've got shirts like this invalid formula, divide by zero design, or this one with all your favorite formulas. I'm partial to equal count ifs, open paren, closed paren myself. The Microsoft Excel World Championship isn't the only gaming arena where you'll find Excel. It's had a long if eccentric history in gaming, usually acting as an external supplementary tool for complex RPGs that require advanced data management. EVE Online, the game sometimes called Spreadsheets in Space, actually got an official Excel plugin earlier this year, much to the excitement of its player base. Not to mention that people have been programming games directly into Excel for decades, like Snake, Minesweeper, and even Battleship. If there's anything we can learn from a sweaty crowd cheering on their favorite Excel champion as they formulate their way to victory, it's that human beings can find joy in literally anything. And it brings me great joy to see you here at the end of the video. Welcome. Thanks for watching. Like the video if you like it, dislike it if you disliked it, check out our other videos, comment below with video suggestions, and don't forget to subscribe and follow and plug us into your spreadsheet of choice. Don't, I know you have it.",
    "transcript_keywords": [
        "Excel World Championship",
        "Microsoft Excel World",
        "Excel",
        "Excel World",
        "Microsoft Excel",
        "World Championship",
        "Modeling World Championship",
        "world",
        "competitive Excel",
        "favorite Excel",
        "World Championship debuted",
        "players",
        "Financial Modeling World",
        "game",
        "Championship",
        "Microsoft",
        "player",
        "Excel tournament",
        "financial modeling",
        "financial modeling competitions"
    ],
    "transcript_entity_values": [
        "eSports",
        "Excel",
        "Ocho",
        "eight",
        "zero",
        "one",
        "only 30 minutes",
        "PlayStation 4",
        "1,000",
        "earlier this year",
        "ESPN",
        "2023",
        "Minesweeper",
        "2021",
        "100",
        "Civilization",
        "mid-2021",
        "World War II",
        "the Series S and X",
        "EVE Online",
        "the 30 minutes",
        "the FMWC Open",
        "today",
        "The next year",
        "Microsoft",
        "Whack-A-Mole",
        "just eight",
        "annual",
        "roughly one",
        "ESPN3",
        "first",
        "10,000",
        "Space",
        "the Financial Modeling World Championship",
        "the Las Vegas HyperX eSports Arena",
        "2022",
        "every 18 seconds",
        "this December",
        "World Championship",
        "six",
        "five",
        "eSport",
        "decades",
        "20",
        "5",
        "December 2021"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "EVENT",
        "DATE",
        "EVENT",
        "ORG",
        "ORG",
        "TIME",
        "LAW",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ]
}