{
    "id": "dsPISdtvSgA",
    "title": "Is this the iPhone of the future?",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-04-19T15:48:06Z",
    "video_url": "https://www.youtube.com/watch?v=dsPISdtvSgA",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 60066,
    "likes": 2717,
    "comments_count": 165,
    "description": "Letting AI decide the future of the iPhone.. what will it predict?  Follow my AI instagram account:   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://instagram.com/ijustineai",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we are going to try to find the iPhone from the future. I love looking at rumors and leaks and seeing renders and phones that we might see in the future but today we're gonna get a little bit of assistance from AI. I've been obsessed with AI generative images so much that I started an Instagram account called @ijustineai to share some of those there and also some stories that are written by AI. So it's been really fun to kind of explore this whole new side of creation, but today we're gonna make it create us a futuristic iPhone. To get started, I actually have Midjourney installed on my Discord server and I'm just in here in a little private chat so that I'm not spamming my entire Discord server but we're gonna start by entering a prompt. So what Midjourney does is it allows you to take text prompts and it turns them into images. You can be as vague as you want or you can be super descriptive and each time, you will get something new. So right here, we're gonna do a prompt of iPhone from the year 2050. (dramatic music) Okay, here it is. It's happening. You can see it says 0%. So it'll start out giving you sort of a blurry image and then as it progresses, the image gets clear and you can see more detail. So here's our first attempt. These all kind of look pretty basic. I don't really think any, I mean, they definitely look futuristic but I'm not really a fan of any of these. So I'm gonna try to give it a more specific prompt. Ultra realistic. Okay, let's see what we get. Ooh, look at these. Okay, so now we're starting to get in the groove. Now, what's really cool about this is I can go in and if I like any of these, I can do an upscale. So I'm gonna upscale the first one. I also really like this fourth one, so I'm gonna upscale that one and I'm kind of into this fourth version, like this is kind of along the lines of what I'm thinking. So I'm gonna do a variation of number four and this will give you another output of variations of that fourth one. One day, this is all gonna happen so quickly, we're not gonna have to sit here and wait, but right now, the biggest complaints is this is taking so long. It's creating images out of nothing. Let's be patient. All right, here's the renders of that fourth one. The iPhone of the future freaking has touch ID. That's really cool. Not really sure how it works. This one looks kind of cool. It's like the water background just sort of expanded and it's like a mini fish tank. I think this one still might be my favorite. That looks cool. Okay, let's imagine cyberpunk iPhone that connects to the human body. Let's see what we get. Is this my future? So this is where things can get a little skewed. It took my prompt very literally. This made a body on the iPhone. I wanted a human body that's attached to the person. So this is not what I had in mind, but that's okay. Okay, how can I rephrase this? This is the hardest part about AI generative art is trying to get it to understand what you have in your mind. Imagine an iPhone that is connected to your brain. Let's see what we get here. Like I'm picturing you take the phone and then you just sort of put it in the side of your arm like a dock. So let's see. Okay, imagine an iPhone that docks into your, what is this? A forearm? Is this a bicep? Is that tricep? An iPhone that docks into your tricep, okay. iPhone that docks into your chest like Iron Man. Ah, this is an iPhone with a brain on top of it. Okay, so I need to rethink some things. Oh man. Okay, this also is not what I meant. This is my problem. Communication. This is not what I wanted. Imagine a human body, a human body that is hanging from an iPhone with wires. iPhone implanted in the shoulder. We're getting there. We're getting there. I might upscale the first one. So this is almost what I had in mind. Oh, this one's cool. Check this out. Wow. That's just an Iron Man iPhone. That's sick. That needs to happen. Okay, I think that I'm gonna go back to my original prompts and quit trying to implant the phone into a human body 'cause clearly they don't like it. Let's do imagine a cyberpunk iPhone with airplane wings. Wow, this is not what I had in mind, but these look so cool. Look how pretty. I love this third one. I love the fourth one. I'm actually super into this Iron Man iPhone. Like that's pretty great. Let's see, what should we imagine now? iPhone in the zombie apocalypse. Is this if zombies had iPhones and they were taking pictures and selfies? I think what we're gonna do now is I'm actually gonna ask AI, write me a prompt to get Midjourney to make a futuristic iPhone. I keep spelling futuristic and like all of these words wrong. Oh this is great. Okay, we're gonna use some of these. Like, these are way more in depth than than I was doing. This is a long prompt. So here it is. I'm not really sure what any of this stuff is to be honest with you. This is the new feature for the iPhone that will revolutionize the smartphone industry. Well, what is it? None of these words, nothing make nothing make sense. A huge iPhone that is the size of a person. While that's working, let's see. Imagine futuristic iPhone with transparent glass back, diamond cameras, no ports. We'll see what happens. So here's the huge iPhone that is the size of a person. That's interesting and strange and just weird. This one looks like she's in a gymnasium. This guy looks like he just walked out of the Apple Store and stole this phone with his massive hand. These are weird. Here's our futuristic iPhone with transparent glass back and diamond cameras. Oh, check this out. Discord is not correcting my spelling. I'm literally spelling every word wrong. - [Director] There's gotta be a bot for that. - An alien species that is made of 50% iPhone. - [Director] Yeah. And 50% human DNA. - Oh my God, our species is happening. What? Okay, I'm gonna have to say that this is... I don't see a single bit of human in this at all. Do you see a human in there? It's really cool. A human that is actually an iPhone. This is gonna be so bad. Okay, here it is. I'm really confused. I think we're all a little confused as to what's happening here. We just don't know. Okay, an iPhone made of diamonds. This looks hideous. This looks like one of those like $2 cases that I got off of Amazon. Dislike. Next prompt, transparent iPhone with rose gold trimmings, a camera that is the size of a telescope and has wheels. Okay, this is so exciting 'cause I think this might actually be my favorite one. Look at this. I was thinking of wheels as in like you could drive it like a vehicle but this took it and it has like wheels on the internals. This is pretty sick. All of these actually look incredible. I'm gonna upscale all four of these 'cause those are so good. And this last prompt that I just kind of randomly threw in there was an iPhone as a car. I mean it took it quite literally. This is actually really cool. I like that third one. That might actually be a future prompt on my AI Instagram account. Speaking of my AI accounts, now I need to choose one of these images and have AI write me a story about it. So let's go into Edge here. Write me a story about an iPhone from the future. It is transparent rose gold trimmings, huge telescopic camera and connects to your brain. Let's go. Oh, look at this. This is a whole story. She held the iPhone 14 in her hand, admiring its sleek design and rose gold trimmings. The phone was transparent except for the Apple logo and the huge telescopic camera that protruded from the back. She tapped the screen and felt a slight tingling in her brain. The phone connected to her neural network and displayed a holographic interface in front of her eyes. She smiled and swiped through her apps. This is great. Now I'm gonna work on an image of the girl getting a holographic image in front of her eyes. Okay, let's see, we'll see what we get. Okay, these are pretty cool. I'm definitely into number four. There we have it. Thank you so much for watching. Let me know what you guys think of some of these image renders. If you guys are Midjourney pros, I would love to hear from you what prompts you think I should try out. If you'd like to see me do this again, I would love to because this is actually so much fun and I'm obsessed with AI. So with that, my friends, I will see you guys in my next video. Don't forget to like, comment, and subscribe and I'll see you in the next one. Bye. (upbeat music)",
    "transcript_keywords": [
        "iPhone",
        "Iron Man iPhone",
        "futuristic iPhone",
        "prompt",
        "human",
        "cool",
        "Man iPhone",
        "human body",
        "Justine",
        "Iron Man",
        "imagine",
        "kind",
        "body",
        "future",
        "image",
        "Midjourney",
        "futuristic",
        "Man",
        "upscale",
        "fourth"
    ],
    "transcript_entity_values": [
        "2",
        "the Apple Store",
        "Midjourney",
        "Amazon",
        "one",
        "Apple",
        "Justine",
        "One day",
        "that fourth one",
        "Instagram",
        "iPhone",
        "AI Instagram",
        "Midjourney",
        "the year",
        "iPhones",
        "four",
        "Discord",
        "today",
        "third",
        "number four",
        "AI",
        "Edge",
        "50%",
        "first",
        "fourth",
        "0%",
        "2050"
    ],
    "transcript_entity_types": [
        "MONEY",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "ORDINAL",
        "ORDINAL",
        "PERCENT",
        "DATE"
    ]
}