{
    "id": "DTK4eRzcRyI",
    "title": "A Keyboard Made Of Glass?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-09T20:18:20Z",
    "video_url": "https://www.youtube.com/watch?v=DTK4eRzcRyI",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "glass",
        "glass keyboard",
        "cool keyboard",
        "computer",
        "pc",
        "mac",
        "apple",
        "tech",
        "technology",
        "bastron",
        "bastron glass keyboard",
        "gaming pc",
        "unboxtherapy",
        "unbox therapy",
        "review",
        "unboxing",
        "iphone",
        "best",
        "iphone 6s",
        "gaming",
        "apple inc. (publisher)",
        "apple iphone 6s",
        "iphone 7",
        "vs",
        "macbook",
        "imac",
        "case",
        "comparison",
        "trackpad",
        "magic trackpad",
        "gadgets",
        "bluetooth",
        "mouse",
        "2016",
        "laser",
        "wireless",
        "samsung",
        "future",
        "magic",
        "futuristic",
        "innovation",
        "invention",
        "things",
        "macbook air",
        "magic trackpad 2",
        "bluetooth keyboard",
        "setup",
        "durability"
    ],
    "views": 9950799,
    "likes": 154119,
    "comments_count": 7408,
    "description": "Bastron Glass Keyboard -  Wooden Keyboard Video -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/25uPiCm",
        "https://youtu.be/bjZE1fwAyJ4",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys, new here. Back with another video and today... I'm checking out yet another..obscure product? So to speak. You've seen me feature a number of computer keyboards here on Unbox Therapy. This one's been sitting in the office for quite a while. Today, Jack and I were looking around, we said \"That's the one!\". It is time to unveil this very unusual keyboard. Speaking of keyboards, I've done a wooden keyboard before You probably have seen it. If you haven't, go check that out. Honestly, I'm fairly skeptical about actually using this.. ..but that's what this video is for. To find out if the world actually needs.. ..a keyboard, made of glass. Alright! So, how do I...how do I do all this? Oh, there we go! kind of a fancy box, to be honest. Uh, the company is called... \"Bastron\", it looks like a little micro-fibre cloth here. A gesture guide... Aaahhhh... The keyboard itself is also a trackpad by the looks of it?! It's a touch situation, I did not know that. Whoa, there's the keyboard! Oh my.. That's kinda hard to believe, it is incredibly thin Also in the box... ..a stylish USB cable, that's it! I have a feeling anybody who's interested in this is doing it from... I don't know, maybe style point. Maybe they like to live in the \"weird-zone\"? It's probably you... It's definetly Jack. You've paid a premium for getting a flat-style micro USB cable. Let's hook this up and see what this is all about. Generally speaking, I'm looking for as much tactile feedback as possible.. ..that's why I like mechanical keyboards. In this particular case, there's zero. \"Unbox Therapy\" I mean, that's the trick. It kinda feels like I'm typing on.. ..a sheet of glass there, I say? *meh* You know what this is for? This is for people.. In search of the ultimate style points, maybe? Oh, maybe in an environment where.. ..you need a clean surface, like, something sterile. A computer in a kitchen or something like that? What about a hospital? Cause you know how filthy keyboards get in between the keys, YES! That might be it! This is for the clean-freaking-your-life. Your OCD cousin! The con-man. Because remember that movie \"Matchstick Men\"? Nicolas Cage.. Was he not a con-man? Was he also OCD? Nailed it! Let me try these gestures out... \"The Gesture Mode\", ahh here. Yes... you know what? That's kinda cool, that it turns into a track pad. You can just have this one device instead of having a mouse and a keyboard. Kind of interesting, I'm trying to imagine the perfect scenario in which you'd need something like this.. Ahh! You working in a retail store, one of these chic fashion joints, high-class, couture, and you want something that looks slick. Maybe this is for you. And the track pad is actually kind of satisfying.. look at me right now! Scrolling up and down.. switch back to keyboard.. 1, 2, 3.. Of course the appearance - look at that.. look how thin that thing is. Super slick, very clean. Those are my suggestions, I don't know... What did I have? Doctor, Chef.. Kanye West.. That was just a play on the whole couture thing.. sweater for uhm... 3000$. I'll take five! Sup, Kanye? Whoooh! Hoh! (x9)",
    "transcript_keywords": [
        "keyboard",
        "kind",
        "Unbox Therapy",
        "keyboards",
        "USB cable",
        "guys",
        "Therapy",
        "Unbox",
        "Jack",
        "USB",
        "today",
        "OCD",
        "gesture",
        "Kanye",
        "video",
        "box",
        "cable",
        "this.",
        "Speaking",
        "glass"
    ],
    "transcript_entity_values": [
        "Nicolas Cage",
        "Unbox Therapy",
        "Whoooh",
        "Matchstick Men",
        "Hoh",
        "Aaahhhh",
        "The Gesture Mode",
        "today",
        "USB",
        "Today",
        "Jack",
        "1",
        "zero",
        "3",
        "Kanye",
        "five",
        "2",
        "Bastron",
        "Kanye West",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL"
    ]
}