{
    "id": "DvIJb5qz6u4",
    "title": "The iPhone Spy Camera",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-04-14T21:42:57Z",
    "video_url": "https://www.youtube.com/watch?v=DvIJb5qz6u4",
    "category": "Science & Technology",
    "tags": [
        "iphone 6s",
        "iphone",
        "6s",
        "iphone 6",
        "iphone 5",
        "iphone se",
        "apple",
        "covr",
        "covr case",
        "case",
        "spy",
        "camera",
        "iphone spy case",
        "apple iphone 6",
        "smartphone",
        "iphone spy",
        "secret",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "review",
        "unboxing",
        "samsung",
        "best",
        "iphone covr",
        "phone",
        "apple iphone",
        "iphone 6s plus",
        "apple iphone 6s",
        "iphone 7",
        "smartphone (video game platform)",
        "apple inc. (publisher)",
        "android (operating system)",
        "galaxy s7",
        "crazy",
        "gadgets",
        "durability",
        "galaxy",
        "android",
        "s7 edge",
        "hacks",
        "video",
        "funny",
        "comparison",
        "test"
    ],
    "views": 3520549,
    "likes": 53514,
    "comments_count": 2084,
    "description": "iPhone 6s COVR Case -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1TTsKaE",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "what's up guys Lou here back with another video and today i'm continuing to bring the heat with stuff you probably never knew existed this is called cover photo A kinda like spy case i guess for your Iphone 6 Or as they say The best iPhone lens case For one-handed candid photography Now don't get any strange ideas people This was sent to me from somebody over at bitemyapple.co Chris Johnson was his name alright cool Could it be a gimmick quite possibly, does it make it any less interesting? probably not so lets go ahead and check this thing out They're using it in a pool seems like an odd choice for candid photography. if you know what I'm saying How does this work. Okay there you go It kind It uses a mirror to take the image reflected onto your camera lens little bit of a weird design here what else is in here, that's it! Looks like there is an app to go with it. Maybe they are just not allowed to show. Oh yea. JESUS! right there is a QR code for the app. Do I need it? let's find out maybe I don't so there's a little internal sleeve that fits on real easy and then it goes into this part of the case so obviously you're not gonna want to leave the secondary part of the case on all the time it got like this mirror jumping out of here probably gonna stab you in the pocket text you see what happens when I slide over it so now you see the lense in the mirror so it's obviously functioning at that point low that is weird it's also upside down so I guess when he did get the flip it after so I suppose in this moment nobody knows I'm snapping a spy photo and I'm guessing if you get at it automatically clips it back yes so that app actually does the flip for you boom spy photo and you never even knew I'm just kinda like I'm just chillin, I'm like yo hey how's it goin nice to meet you photo it's a fun novelty to be honest with you i think it's more like maybe catch a friend picking his nose or something he probably deserves it about like some hidden cameras are you getting really terrible customer service at a place someone is yelling at you video too there are a lot of Lou's you're seeing Lou then reflected Lou then monitor version of Lou. It's too much lou and you can also flip to your selfie camera because maybe during your spy camming you just need to I don't know you don't have to be a pervert do you? Like I said before maybe you're an investigative reporter there's a lot of reasons you might need to be sneaky even if you're doing the right thing so let's consider that you heard it here first Unbox therapy no pervert zone unless of course you're perverted for technology and gadgets then full pervert zone all the time. I don't know. Let's pour a little water in here.",
    "transcript_keywords": [
        "bitemyapple.co Chris Johnson",
        "Chris Johnson",
        "strange ideas people",
        "onehanded candid photography",
        "iPhone lens case",
        "bitemyapple.co Chris",
        "called cover photo",
        "candid photography",
        "iPhone lens",
        "gimmick quite possibly",
        "continuing to bring",
        "bring the heat",
        "heat with stuff",
        "called cover",
        "strange ideas",
        "ideas people",
        "alright cool",
        "Iphone",
        "onehanded candid",
        "Lou"
    ],
    "transcript_entity_values": [
        "JESUS",
        "today",
        "first",
        "Chris Johnson",
        "iPhone",
        "lou",
        "Unbox",
        "Lou",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}