{
    "id": "dVZKn6NSmNg",
    "title": "iPhone 11 Pro Max Teardown - Tiny Motherboard & BIG Battery!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-09-25T14:15:01Z",
    "video_url": "https://www.youtube.com/watch?v=dVZKn6NSmNg",
    "category": "Howto & Style",
    "tags": [
        "iPhone 11 Pro Max Teardown",
        "iPhone 11 Pro",
        "Take apart iphone",
        "Apple",
        "iPhone",
        "new iphone",
        "iphone 11 pro review",
        "best iphone",
        "best smartphone",
        "whats inside iPhone",
        "How to repair iphone 11 pro",
        "battery replacement",
        "iPhone repair guide",
        "iPhone 11 pro screen replacement",
        "iphone 11 pro disassembly"
    ],
    "views": 9655905,
    "likes": 196859,
    "comments_count": 11821,
    "description": "Lets take apart the new iPhone 11 Pro! Get your first audiobook and 2 Audible Originals free when you try Audible for 30 days. Visit  or text jerryrig to 500500 The new iPhone 11 Pro Max is ready to be taken apart. Today we will see whats inside the new iPhone, including the battery, how to take off the screen, and what makes the new iPhone 11 Pro Max water resistant. Apple is using a lot of recycled materials in their products now, which is awesome. The tin in the motherboard, along with the aluminum housing on some of their products, and the rare earth elements in their taptic vibration motors.   The iPhone 11 Pro Max durability test video:   Small Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   *Follow me for updates!* Instagram:  Facebook:  Twitter:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.audible.com/jerryrig",
        "https://youtu.be/7jD5Gkh4K34",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The iPhones have always been some of the most complicated phones to take apart. You'll see why over the course of this video, but there's no way we can let this iPhone 11 Pro Max flagship slip by without seeing the insides. This is the most water resistant mainstream smartphone money can buy right now. So it's time to see what helps keep water out and how repairable it really is. Let's get started. [Intro] Since basically day 1 of the first iPhone's existence, Apple has been in the business of trying to keep people out of their phones and this new iPhone appears to be no different. It has the same proprietary pentalobe screws holding the bottom of the screen to the stainless steel frame of the phone. It uses a screwdriver that's pretty easy to find online, but most people don't immediately have it on hand. I'll leave a link for a good tool kit in the description. Looking closely at the screw it has black threadlocker filling the gaps between the threads and the phone body. This helps keep the screw in place as well as helps keep water out. The biggest opening for water to get inside the phone though is the screen. There is adhesive surrounding the whole rectangle. In order to pull the screen off I'll need to use heat to soften that adhesive, and a strong suction cup to pull on the screen while adding some leverage with my pry tool between the plastic lip and the stainless steel frame. As I work my way around either side of the phone lifting off the display, you can see the substantial amount of stingy gooey black adhesive that holds the parts together. I'm taking special care to avoid the ribbon cables hiding along the edge of the right side. These cables are about as fragile as paper and can be torn very easily. You'll get a better look at them as the screen lifts off. They're down there through those gooey strands. At first glance things look pretty standard for the iPhone a ton of screws and the massive L-shaped battery. Thumbs up to Apple for adding battery life and thickness to their phones this year instead of trying to go thinner. I'm also glad that the ribbons are all off to the side. Last year had a random ribbon cable coming from the center that made the screen removal quite a bit harder. The front camera and face scanner are tucked up in the top of the phone. I'll remove the 6 y triple-zero screws holding the metal plate over the top of the screen ribbon connectors. One of those screws is easier to access from the other side of the screen if you close in and scooch it over a bit. And take a look at that motherboard. It's Lego connector central up in here. Happy birthday to myself. I'll remove another 4 y triple-zero screws that hold the top protective metal plate and side ribbon guide down over the camera units. Then there are two more screws holding down the tiny plate over the battery connector. Before I unplug that battery though, I want to make sure this whole thing still works and that nothing was damaged during the screen removal. Tapping the power button shows the Apple logo, and the phone turns on. Which app should I test to make sure the phone still works? Maybe I should use today's sponsor Audible. That was convenient. Audible is actually one of my favorite apps. The book I'm currently listening to is called The Man Who Knew the Way to the Moon, and is one of the Audible Originals It sounds more like a verbal documentary than a narration. I usually adjust the speed to be a tad faster than normal so I can get through more information quicker. It's a true story about the guy who convinced NASA to use space rendezvous points instead of one gigantically massive rocket. It's super interesting. You can get a free audio book plus two Audible Originals when you try Audible for 30 days with the link in the description: audible.com/jerryrig. Or text the word jerryrig to 500-500. The Audible Original titles come from diverse categories like theater, journalism, literature, and the documentary styles like the one I'm listening to now. Even if you decide to cancel Audible at some point in the future, you still get to keep your books. They're yours to own forever. Audible.com/jerryrig. Or text jerryrig to 500-500. And thanks to Audible for sponsoring this video. I'll unclip the battery connector like a little Lego from this smorgasbord of Lego connectors. The battery actually has two connectors, one is found down below by the charging port. So unclipping both of those is a good idea at this point. I just didn't know the second one existed until later. I'll unclip one of the charging port ribbons, and then I'll make my way down to the three main ribbons holding the screen to the body of the phone. The screen is significantly more simple this year than it has been for the previous years, which is definitely appreciated. It only has 3 screws holding the earpiece to the back of the display. Apple throws Phillips head screws randomly in here and there throughout the phone, so for those of you following along at home, this is the third type of screwdriver we've used so far. The earpiece folds down which lets us pry away the front sensors from the glass. Replacement parts will become more common and get cheaper as the phones get older. I'll try to link some in the video description as they become available. Screen replacements aren't super difficult on iPhones. And with the disappearance of 3D touch, the display is actually thinner and leaves more room for the larger battery. Speaking of which, I've had a few requests for a straight up clean video shot of the internals so feel free to screen shot this, crop it, and use it as your phone wallpaper if you want. Just make sure to tag me on Twitter if you do. Let's remove the front camera and the face ID depth scanner thingy. It's got two ribbon cables to unplug...wait, no, there's three. The last one kind of just snuck in there. This little unit has the front 12 megapixel selfie camera, the one that can film in 4K and do those slowfees, and also has the infrared dot projector and secondary camera for the face ID. It's a pretty cool set up, and I'm glad it's not attached to the screen. It makes repairs easier. The three rear cameras each have their own ribbon cable attached to the motherboard I can unclip each of those and then the whole contraption comes right out of the phone. Apple really has made their design much more modular this year and I'm a fan. Up at the top we get the normal 12 megapixel camera with optical image stabilizing. Down at the bottom we get another 12 megapixel 2x optical zoom camera which also has optical image stabilizing. And over here on the side we have a 12 megapixel wide angle camera with no physical stabilizing I feel like this is the perfect set up and the arrangement I would personally like to have someday when I upgrade from my Galaxy S8. I feel like Apple has finally brought way more features to the table with smartphones this year and are finally competing at the same level of other flagships. Let's get this motherboard out. I'll unplug the charging port ribbon, but before I can pull that out, once again I need to switch back to the y triple-zero screwdriver. There are 3 screws running down the right side, keeping this cable with the metal bracket tucked to the side of the phone. The next three screws are a bit trickier. These are called standoff screws and they hold the motherboard in place. If you don't have a standoff remover, I can usually take a flat screwdriver bit and just twist the screw around in the circle from one side. And as the screw comes out, you can see that a stand off screw is actually a screw that has a screw hole inside. A screw within a screw. They are annoying to work with but Apple uses them to save space and stack things on top of each other. Speaking of saving space, once those screws are out and the SIM card tray is removed, the whole motherboard is ready to come out of the phone. And this, my friends, is it. This is the whole thing the brains and brawn of the whole iPhone operation is sandwiched between these two stacked boards. One thing I'm pretty impressed with on the iPhones this time around is that all the solder connecting the circuits inside of this motherboard is made from 100% recycled tin. You might be thinking, Nice work Apple on recycling that tiny drop of tin. But because Apple is using recycled tin on not only their iPhones, but the MacBook Air, the iPad Air, and the iPad Mini, it adds up to over 29 thousand metric tons of tin ore that they don't need to mine from the earth. It's a pretty substantial achievement and I'm glad Apple's doing it. Let's keep going deeper. The taptic vibrator engine is down here below the battery near the charging port. It's got three little screws holding it in place and I'm going to set those off to the side to help keep things organized. A lot of phones you can take apart and just toss the screws helter-skelter, but since basically every screw in here is a different shape and size, it's very important to keep them organized. With the metal plate gone and the vibrator unclipped from the charging port, we get our first close up of the taptic engine. It's nice of Apple to include their logo in case we forgot what phone we're taking apart. This little guy is also using 100% recycled rare earth elements. Since we don't have an unlimited earthly supply of these magnets, I'm glad Apple is now going through the effort to reuse and recycle parts of their phones. I'll remove one more screw and pull off the metal plate over the microphone hole. And check out all that white adhesive over the hole to help keep water out of the microphone. It's time to remove the battery. Apple once again has added the magic pull tabs which I'm thankful for. Prying out permanently glued batteries is extremely dangerous. And even if a pried and bent battery doesn't spark and start on fire right away, it'll still be damaged internally and it'll start to puff up and expand over time. These pull tabs make battery removal much safer. [Stretching sounds] Yeah, they are still pretty fragile and break every now and then, but it's still much better than what Samsung's currently doing with the permanent adhesive and therbones. [Stretching sounds] Apple has three pull strips at the end of each side of the battery [stretching sounds], and I was successful enough with most of them [stretching sounds] that the rest of the battery can be lifted up unharmed. This is a 3,969 milliamp hour capacity. Which is quite an improvement over last year's 3,174 milliamp hours. For real, Apple has come out to play this time. The loudspeaker comes out next with it's two screws holding it in place. You might have noticed so far that while the iPhone seems complex, most components are still modular and come out relatively easily. You can see the substantial amount of black adhesive holding the loudspeaker to the frame of the phone. Like I said in my durability test video, this iPhone 11 Pro Max is the most water resistant smartphone on the market right now. While most manufacturers have water tested their phones to a depth of 1.5 or 2 meters deep for 30 minutes just to get that ip68 rating, Apple has gone above and beyond and tested the new iPhone 11 Pro's to 4 meters deep for 30 minutes. Double the depth of what everyone else is doing. Hold on for a second though. Check this out, the loudspeaker is full of a ton of those little white sound balls. I assume these white balls help fill the space inside of the tiny little cell phone speaker to keep it from sounding like a tiny little cell phone speaker. I'll take out the last 9 screws for the charging port and get back to that ip rating. Even though Apple went twice as deep as everyone else, they still only got the same ip68 rating. You're probably like, Why didn't they just go up a level to ip69? And that's because ip69 is a totally different test. Instead of submersion, it's a high pressure and temperature water jet test. And pretty irrelevant for cell phones. Cell phones get accidentally submerged all the time, but getting accidentally blasted by a firetruck is far less common. The charging port is finally out of the phone. That was definitely a nightmare I don't want to repeat. The iPhone has so many intricate components. It's not to much a difficult phone to repair, it's just a very complex phone to repair, and one wrong move or screw in the wrong place could wreck the phone. If you do end up breaking your back glass and don't have insurance, you can either pay Apple $599 to fix it, or just buy a replacement housing and swap over each component individually. Yeah it's going to be pretty extremely painful either way. Apple's still kind of being a big jerk where that's concerned. I think you should just get a case before it breaks. I'm pretty impressed with Apple for stepping up and going above and beyond the bare minimum that they usually do. This time Apple has given customers the specs and features they're paying for, and that always hasn't been true in the past. Of course in my opinion, Androids can still accomplish more. I'm not ready to switch sides just yet. But I am glad that Apple has stepped up with enough performance to match the price tag...and is doing it with recycled and recyclable materials. We can all appreciate and support that. I'll get the camera units put back into their slot. They are all housed in the same metal block so it's impossible to get them out of alignment. And the same thing goes for the front cameras. Finally, the front screen with it's three ribbon cables can plug into the tiny motherboard and I can start throwing down all those metal plates over the Lego style ribbon connectors. The last thing that gets plugged in is the battery and this little metal bracket that covers the top. Then we can turn the phone back on. And once again, I'm just as surprised as you are that this thing still works. I, for one, am glad that Apple has started participating again in the smartphone race. And even more so for using recycled components. Innovations in both areas are good for everyone. I'll be looking into the recycling efforts of other manufacturers in the future, so hit that subscribe button if you haven't already. It's free. And remember that the computer the astronauts used to land on the moon 50 years ago is less powerful than the cellphone in your pocket right now. Don't forget to check out the Audible link in the description for your free audio book, and come hang out with me on Instagram and Twitter. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "Apple",
        "phone",
        "screws",
        "screen",
        "screw",
        "screws holding",
        "phones",
        "battery",
        "Audible",
        "side",
        "ribbon",
        "iPhone",
        "camera",
        "charging port",
        "pretty",
        "glad Apple",
        "Audible Originals",
        "holding",
        "water",
        "metal"
    ],
    "transcript_entity_values": [
        "3,969 milliamp hour",
        "iPhone",
        "30 days",
        "9",
        "ip68",
        "6",
        "the previous years",
        "the MacBook Air",
        "Lego",
        "Instagram",
        "100%",
        "two",
        "NASA",
        "4 meters",
        "Pro Max",
        "three",
        "the moon",
        "2 meters",
        "Twitter",
        "2x",
        "the iPad Air",
        "ip69",
        "12 megapixel",
        "the Audible Originals",
        "Galaxy S8",
        "1.5",
        "30 minutes",
        "iPhone 11 Pro's",
        "4",
        "Phillips",
        "SIM",
        "the iPad Mini",
        "a ton",
        "599",
        "Androids",
        "11",
        "this year",
        "last year's",
        "iPhones",
        "Apple",
        "50 years ago",
        "The Man Who Knew the Way to the Moon",
        "Nice",
        "29 thousand metric tons",
        "Last year",
        "first",
        "500-500",
        "second",
        "Samsung",
        "today",
        "12",
        "third",
        "3",
        "One",
        "Pro Max",
        "iPhones",
        "Audible",
        "3,174 milliamp hours",
        "one",
        "Twitter"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ]
}