{
    "id": "dX649lnKAU0",
    "title": "How Analog Color TV Works:  The Beginnings",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2017-11-18T13:40:05Z",
    "video_url": "https://www.youtube.com/watch?v=dX649lnKAU0",
    "category": "Science & Technology",
    "tags": [
        "shadow mask",
        "crt",
        "picture tube",
        "television",
        "history of television",
        "aperture grille",
        "trinitron",
        "dlp",
        "cathode ray tube",
        "phosphor"
    ],
    "views": 443331,
    "likes": 13644,
    "comments_count": 668,
    "description": "In this video we explore how we added color to everyone's favorite passive entertainment medium.  Modern color broadcasting began in 1954 after years of experimentation, and this video will teach you the early history.  Technology Connections is a YouTube channel dedicated to exploring the history of technological innovation.  You can support this channel via a monetary contribution at   Thank you to all current patrons! Benjamin Kord, Tommi Hares, Dakota Williams, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, twiglet, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Max Burns, Sam Hodge, Matthew Rossi, Paul Craigie, Alex Smith, Paul Williams, Dane Peterson, Brent LaRowe, Quinton Wilson, Aerospyke, Kieran Cox, Hunter Schwisow, wsh, Logan Kriete, Rafa Wiosna, Adam D. Ruppe, Audin Malmin, Eric Hansen, Noah McCann, Jason R Scheuren, Rufo Sanchez, Aaron Herbst, Bjrn Vegar Torseth, Yaniv, Matt Falcon, Stewart Harvath, Kevin Landrigan, Evan Papp, Jason Weathered, Jolyan g shaba, Stephen Youndt, Stephen Bell, Steven First, Howard Longden, Gianluca D'Orazio, Martin Granestrand, Anthony Pettit, Paul Ziegler, Stephen Furness, Joseph, Marty Connor, Wesley Van Pelt, Lorenzo Novara, Lee Lemoine, John Trevick, Elliot King, Paul Anderson, Gustaf Lindblad, Carl Yazbek, Nicholas, Matthew, Gary Generous, Daniel Mann, Harald E. Westlie, Daniel Newton, urbanhusky, Henri Hyyrylinen, James Holmes, Dave Anderson, Neil Hopwood, Duncan Middleton, Aric Vogel, Conor Killeen, Tyler Knott, Slone Fallion, KrzysFR, seagull, Robert Stadtmller, Athanasios Kountouras, Gorka Alda, Jason Brammer, Sarah Symon, Francis Fisher, Tab Patterson, Philipp Thomasberger, Gustavo Carballeira, SkydiveWeee, Nolan Johnson, Samuel Kadolph, Robert Toth, Matthew Giraitis, Ellis M. Eisen, Tyler, Michael Shick, Thomas Jew, Eric Wood, Kasper Guldmann, Joe Bond, Eidorian, Cubase Academy, Nikolaj Srensen, Jesper Hansen, John Kesson, cpb, Anonymous49856739245764, Jason Ganiatsas",
    "description_links": [
        "https://patreon.com/technologyconnections"
    ],
    "transcript": "The year is 1954. After much deliberation, confusion, and fussing about, the FCC had, for the second time, settled on the way color TV would be transmitted in the United States, and Westinghouse would release the first commercially produced color television set using the new standard, the Westinghouse H840CK15. Ah, the H840CK15. Really rolls off the tongue. RCA would follow with the more famous CT-100 weeks later. The reason for the fussing about had to do with compatibility. Most experimental color televisions used complicated schemes to create a color image which would not be compatible with existing black and white televisions sets. It seemed like this was an inevitability, and the FCC did briefly approve simultaneous transmission of both color and black and white signals, creating a fragmented television landscape. But the National Television System Committee, NTSC, having backed the work of RCA, would save the day by introducing a new color system. Their compatible color managed to, in a sense, hide the color signal within the black-and-white transmission. The benefits of a single transmission for both color and black and white television sets were obvious, and though it took some convincing, the FCC would later decide that new NTSC color was the way to go. To understand this story, we need to look at how color images are made. Our eyes actually only see three colors of light--Red, green, and blue. Our brains interpret other colors by comparing the amount of each of the three colors we see, for example yellow light will stimulate both the red and green cells in your eyes in close to equal amounts as yellow lies between green and red on the color spectrum. We knew this for a long time before television was around, in fact this knowledge can be traced back to 1802 with Thomas Youngs pretty correct postulation. This was further refined in 1850 by Hermann von Helmholtz and thenceforth was known as the Young-Helmholtz theory. Experiments in color photography were done almost as soon as we figured out photography, and the three-color method, as suggested by Scottish physicist James Clerk Maxwell based on the Young-Helmholtz theory, worked perfectly. Plenty of very old color photographs exist, and this one is perhaps my favorite. The only clue that this photograph is from 1912 is the moustache. Anyway, with humans possessing the knowledge of how to recreate an image in color using an RGB system, it should be no surprise that we threw our hats into the ring for color television as soon as we figured out television. The first color television demonstration was done by none other than our friend John Logie Baird, who adapted his mechanical television system to produce color all the way back in 1928. But as we know, mechanical television was not meant for this world. CRT based electronic television was far superior. So, we got to work figuring on out how to adapt a CRT into a color display. The most obvious thing would be to simultaneously transmit three separate television images, with each representing one of the RGB channels. A special camera with a beam-splitting arrangement behind the lens could send the image to three separate iconoscope tubes, each with a colored filter in front of it. Later cameras would use dichroic glass to simultaneously split the beam and filter color. This would cause each tube to only detect light of that color. On the receiving end, three separate television picture tubes could receive each of these three signals. RCA experimented with just such a system. The three CRT displays were tinted either red, green, or blue, to match the colors detected by the tubes in the camera. The trick was combining the images together. An optical system similar to that of the camera could re-combine the output of the three CRTs, but this didnt work too well. Though CRT projection systems would use this approach years later, at the time it wasnt a great option. Besides the fact that each television set using this system would cost at least three times as much as an ordinary television, given the fact it essentially is three TVs, the resulting image had to be recombined onto a frosted screen, and with the comparatively dim tubes of the time, it just wasnt great. The real trick would be to figure out how to use just one picture tube. Once again, John Logie Baird appeared. In 1940, he demonstrated a sequential color system using CRT technology. But, Ive also found a source indicating this was in 1939. Also in 1940, CBS demonstrated their sequential color system. Regardless of who was first, both of these systems are similar. These work by placing a large disk in front of a black and white picture tube. This disc contained alternating sections tinted red, green, and blue. This disc was quite a bit larger than the tube, so that only one color was in front of the tube at one time. The disc would tint the apparent color of the picture tube, and by spinning the disc quickly in front of it, it would rapidly produce a red, then green, then blue image. If you do this fast enough, persistence of vision will kick in, and you wont notice it. A similar disc was placed in front of the camera tube in the studio, so that it would only see red, then green, the blue light. So long as you can synchronize the camera and TV, you could transmit a full color image. But now is where we run into problems of compatibility. You could in theory just slap one of these discs in front of both a conventional camera and conventional TV, and it would work, but it would be painful to view. With a framerate of 30 frames per second, each color would only appear in front of the tube 10 times per second. This would be obvious. In fact, avert your eyes if you suffer from epilepsy, it would look like this. This isnt great, now is it? Even if you spun the disc twice as fast and tinted each consecutive field and not frame, it would still be very visible. And now, I was pleasantly surprised to learn of Guillermo Gonzlez Camarena, a Mexican inventor who applied for a patent detailing a system much like weve just discussed in 1940. Thanks to multiple commenters for letting me know about him. Information about him is very spotty. For example, there is a Wikipedia entry on him, but its pretty paltry and also somewhat contradicts itself. The actual patent is easily accessible, though, and its worth taking a look at. Well explore Camarenas work in more detail in the next video, including his work on two-color TV, but first I need to address a small issue. His patent was to adapt an existing black-and-white set to color. This wouldnt look too good, as we just discussed, as the color wouldnt change fast enough. It would technically work, but its practical viewability would be questionable. He had the idea fundamentally correct, but the CBS system produced far and away better results. Also, CBSs demonstration to the press of their field-sequential color-system happened just 9 days after Guillermo filed his patent. So here we are again, with multiple people who could be given credit as the inventor of color TV. So well just say it was a group effort. CBS actually brought their system to commercial use. However, the CBS system radically altered the way television transmissions were done. To get around the high flicker caused by the color wheel, they elected to increase the field rate from 60 hz to 144 hz, but in order for each two-field frame to be completely colored, the wheel needed to cycle through the RGB pattern twice with each frame, reducing the effective frame rate to 24 frames per second. This was very effective at making the color wheel hard to notice since it changed colors 144 times per second, but it came at the huge expense of wiping out any compatibility with existing black and white televisions. But, the color wheel was simple. Aside from the extra circuitry required to synchronize the wheel with the correct fields, it was really a run-of-the-mill black and white TV and camera, both modified with a much higher scan frequency, and with a spinning color wheel in front of each of them. It was easy to produce and worked reasonably well, and so the FCC decided they would allow broadcasting of the CBS color system. On June 25th, 1951, the first network color television broadcast occurred. But this whole time, RCA was trying to convince the FCC of their compatible color system. They understood that if would be really great if you could broadcast a color transmission that could still be viewed with the black and white televisions already in service. And to make that possible, they needed a whole new type of picture tube. Enter the shadow mask. One simple way to make a color picture tube would be to create a pattern of alternating red, green, and blue dots on the inside surface. From far enough away these dots would blend into each other and wouldnt be noticeable. So, RCA used picture tubes which contained just an arrangement, with each dot being filled with either a red, green, or blue phosphor. This tube could be scanned at the same field and frame rate as an ordinary black and white tube, but could produce a full color image. But now you need a way to control which dots are lit up. If they all worked together, it would simply appear as black and white. You need a way to control where the electron beam lands. The shadow mask is just the solution. The 1938 invention of German man Werner Flechsig is a sheet of metal with a bunch of tiny holes punched through it. The shadow mask sits just behind the grid of phosphors. The holes work in conjunction with three separate electron guns, one for each color of phosphor, in the neck of the picture tube. These guns are arranged in a triangular pattern, and their beams converge right at the shadow mask. The mask prevents the beams from landing on the wrong color, as the beam can only pass through the mask at a certain angle, thus ensuring theres no accidental cross-over. This is why placing a magnet near the face of a color CRT makes such far-out patterns appear. The magnet bends the beam after the shadow mask, and thus the electron beams land where they shouldn't. Now comes the time to explain the thumbnail of this video. Its very important to understand that the individual groupings of red, green, and blue phosphors are NOT pixels. The TV set isnt even trying to line the beam up with these triads, if you will, and it has no way to address them individually. In fact, the pattern of triads in this picture tube doesnt even form a grid, as each adjacent column of triads is shifted up half way. But that makes sense when you keep in mind that the electron guns are arranged in a triangle--logically the targets they aim to hit would be, too. And before you bring up Trinitron, Ill be addressing that in another video. Hold your commenting horses. To form an image, the face of the tube is scanned in horizontal lines just like a black and white television set. Its these lines that make up the image, not the dots on the screen. This is the precise reason why I used a black and white TV in my video on how analog television works. The lines are obvious on a black and white set, but a color set makes them less so. Its tempting to imagine these groupings as pixels, but in reality they are simply a regular pattern of dots which, when combined with the shadow mask, force each individual electron beam into its respective color. This is most easily demonstrated with white text on a black background, so lets pull out the old PlayStation. The text here doesnt fall nicely in line with the individual phosphor groupings. All around the edges of the text, the phosphor groupings are only partially lit. Thats because the scan line isnt landing nicely within the center of the triads, and it just barely grazes the bottom of these triads. But it doesnt matter, as the position of the shadow mask and phosphor triads is irrelevant to the scanning beam--the beam can land anywhere it wants. But the shadow mask will always prevent each individual color component of the beam from hitting the incorrect phosphor. The shadow mask worked really well, but it required very powerful electron beams. About 85 percent of the beam energy is lost just in the shadow mask, so only 15 percent gets through the tiny holes. Without really powerful electron guns, a dim image would result. Even with suitable electron guns, early color CRT displays were often less bright than their black and white counterparts. Nevertheless, it meant that the picture tube could on its own produce a full color image. The real challenge then was to find a way to transmit color television in a way that a color set could interpret but that would still work for existing black and white TVs. You could simultaneously transmit three separate monochrome images and assign one to the green electron gun, another to the red, and the final to the blue. But which one would you have the black and white television receive? Picking just one color would produce a very unnatural image on the black and white set. Also, this would triple the bandwidth needed, which wasnt really gonna fly with the FCC. Stay tuned as in the next video, well explore how RCA managed the seemingly impossible task of sending three times the data without needing more bandwidth--by hiding the color in plain sight. Thanks so much for watching, I really hope you enjoyed the video! If youre new to this channel and like what you see, please consider subscribing. Id also like to thank all of my Patreon supporters, with a special thanks to these people who get their name in lights! Your can support me and this channel by visiting the link on your screen or in the description, and I thank you for your consideration. Ill see you next time!",
    "transcript_keywords": [
        "color",
        "black and white",
        "color television",
        "television",
        "color system",
        "tube",
        "black",
        "white",
        "color image",
        "System",
        "picture tube",
        "shadow mask",
        "color CRT",
        "CBS color system",
        "image",
        "full color image",
        "color television set",
        "white televisions",
        "color wheel",
        "mask"
    ],
    "transcript_entity_values": [
        "Mexican",
        "1954",
        "1850",
        "Guillermo Gonzlez Camarena",
        "half",
        "1912",
        "1939",
        "30",
        "The year",
        "June 25th, 1951",
        "only one",
        "24",
        "144",
        "just 9 days",
        "two",
        "CBS",
        "About 85 percent",
        "John Logie Baird",
        "RGB",
        "Scottish",
        "1940",
        "PlayStation",
        "at least three",
        "60 hz to 144 hz",
        "Patreon",
        "RCA",
        "1938",
        "Guillermo",
        "Hermann von Helmholtz",
        "Werner Flechsig",
        "1802",
        "first",
        "one",
        "NTSC",
        "10",
        "German",
        "Westinghouse",
        "FCC",
        "years later",
        "CRT",
        "Wikipedia",
        "One",
        "the National Television System Committee",
        "the United States",
        "James Clerk",
        "1928",
        "Trinitron",
        "second",
        "Thomas Youngs",
        "Maxwell",
        "three",
        "Camarenas",
        "only 15 percent",
        "the day"
    ],
    "transcript_entity_types": [
        "NORP",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE"
    ]
}