{
    "id": "Dx8J125s4cg",
    "title": "MacBook Pro 15 (2018) - Beware the Core i9",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-07-17T23:03:44Z",
    "video_url": "https://www.youtube.com/watch?v=Dx8J125s4cg",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Macbook Pro",
        "2018",
        "15",
        "MBP",
        "Apple",
        "XPS15",
        "XPS",
        "best laptop for designers",
        "best laptop for illustrators",
        "best laptop for college",
        "macbook gaming",
        "fornite on macbook pro",
        "Thermal throttling",
        "thermal throttle",
        "thermal issues"
    ],
    "views": 1399462,
    "likes": 53174,
    "comments_count": 6066,
    "description": "Dave2D review of the 2018 15\" Apple Macbook Pro. The Core i9 runs hot and throttles harder than any of the MacBooks I've ever used. MBP 15 -   The 8th gen CPU from Intel has 6 cores but the thermal design of the 15\" MacBook Pro isn't cut out for removing the heat. The true-tone screen is awesome. It's still one of the best screens on the market and is very bright. Third gen butterfly switch keyboard has the membrane to prevent dust from coming in. And the option for 32 gigs of ram is great but it's still a MacBook Pro and there will be thermal limitations on this design.  Music Credits: Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2LeK2Sd",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "I recently put out a video about how Apple was really late in updating their MacBook lineup. They were still running the 7th gen CPUs. It was bothering me, and then a few days later, they came out with the 8th gen CPUs on their MacBooks. And that's what we have here: an i9 and an i7. I purchased the i9; the i7 is my colleague's. This is a device that is very expensive. Not unexpectedly so; it is an Apple product. I'm used to paying their premiums, but it is an expensive product. Now a lot of people are looking at this thing with like the $10,000 price tag, it's become a meme I'm sure at this point. If you focus on the storage and you crank this thing up with 4 terabytes, then yeah, the price tag is absolutely insane. But the regular configurations are expensive but, just - they're not unexpectedly, so. OK. I'm gonna start off this video with what the big change for this year is: The CPU. The i9 in particular is a very powerful CPU. When it comes to multi-core applications, this thing's a beast. The problem though is that this chassis, the MacBook Pro, cannot cool the i9 properly. When you look at renders - and I'm using Adobe Premiere - after a few seconds, we're starting to see some very serious throttling on a properly cooled device. That spiky line for the clock frequency would be much flatter and would be a higher clock speed. So here's a Windows laptop. The temperatures are a little bit lower and it runs at a higher frequency. This i9, in this MacBook, can't even maintain the base clock speed; forget about turbos and all that stuff - it can't even maintain the 2.9 gigahertz base clock, which is absurd. This CPU is an unlocked, overclockable chip. But all of that CPU potential is wasted inside this chassis, or more the thermal solution that's inside here. If you look at the render times, it's really pronounced. The MacBook is gonna inherently be slower. That's normal; Adobe Premiere isn't as well optimized for macOS as it is for Windows, but that has nothing to do with Apple. The 2018 MacBook with the i9 is way slower than it should be. And when I ran the same render with the i9 in the freezer - look at the difference in render time - it's crazy. Power throttling and thermal throttling isn't anything new; we've seen them in Macbooks for years, and we've seen it in lots of devices, including Windows devices. But, like, this degree of thermal throttling is... It's not acceptable. This is something that Apple shouldn't put out on the market and just blindly sell to people because a lot of people that purchase this device will never know that their laptop is throttling to this degree. I value multi-core performance because a lot of the apps that I use for work and the apps that I used to make YouTube videos are - they benefit from high core count and from high clock speeds. And when you have throttling like this, it just doesn't make sense. See, a lot of professionals are looking at these laptops as an option. Like, they're looking at the i9 or maybe the i7. They're like - \"Hmm, maybe I'll get this.\" Maybe, you know, partially because of the brand; partially, because, you know they have a track record of making professional hardware. But this type of thermal throttling really affects the end-user. And doesn't matter what you're using it for - like if you're a Final Cut user or Adobe Premiere, or if you're using it for software development, or calculations like fluid dynamics, it doesn't matter what you're doing with your device - if you have any kind of like extended computational work that uses the CPU - and that's probably why you're looking at these devices in the first place - it's gonna throttle, and that's unacceptable to me. Because when you have options like 32 gigs of ram and up to 4 terabytes of super fast storage, that's not consumer-grade hardware. That's some really high level stuff that professionals are looking at, and they also need CPUs that don't throttle, or at least don't throttle to this degree. OK, enough about the CPUs, the GPUs they've included are a small upgrade from the previous generation. They're calling them the Radeon Pro 560X - it's still based on Polaris, like the Radeon Pro 460 and the 560, but clocked a little bit faster. In short, native gaming on the MacBook Pro still isn't great. You'll have to run Boot Camp or run an external GPU. The native Fortnight client runs OK on this - You can hit 60 frames per second if you lower the graphics quality a little bit, but the frame rates can get a little bit spiky. Alright, so other features they have this year - the screen has been updated to a True Tone display, so it uses ambient sensors to kind of see what your surrounding color temperature is like, and it'll adjust the temperature on the screen to make it easier on your eyes. It's not like a game-changing feature, but it is nice to have. Other changes - the keyboard. So this is now the third generation of the butterfly switches. It's not for everyone, but like most keyboards, I think you can get used to it if you type on it for long enough. There's now a membrane, like, a silicon membrane underneath each key, and I think it something that's gonna help with the durability issues that the butterfly switches have had over the past couple of years. I don't think it changes the typing experience very much. Like people are saying that it's quieter. Like, it is, but it's barely noticeable to me. So if you didn't like the keyboard from the previous generation, you probably won't like this one either. Now inside, the internals haven't changed very much. It now runs up to 32 gigs of ram, and this is DDR4 ram, so it's a little bit more power-hungry, and to compensate for that, they're actually using bigger batteries. Slightly bigger, but it is bigger. But battery life feels unchanged - I'm getting the same 8 hours from this device compared to the previous generation. So, I think it's seriously just to compensate for the higher voltage memory. The drive is crazy fast - it's literally the fastest drive I've seen in a laptop today. It's really impressive. But, the overall product, like the 15-inch 2018, MacBook Pro... My overall thoughts on it are that I'm disappointed. If it weren't for the thermal issues, this would be my laptop of choice. I don't mind the performance hit when I switch over to macOS, like, I just prefer that ecosystem. I like the way that the hardware looks, I like macOS, I enjoy Apple products. But, this year - the thermal throttling is just a little bit too severe. See, if they're gonna use the whole, like, MacBook \"Pro\" thing, it shouldn't just be a product that, you know, \"Let's charge the most amount of money we can because it's a 'pro' product.\" Like, it should be built around the needs of professionals, and I don't think it is. OK, hope you guys enjoyed this video. Thumbs if you liked it; subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "MacBook",
        "Adobe Premiere",
        "throttling",
        "CPU",
        "thermal throttling",
        "late in updating",
        "gen CPUs",
        "Apple",
        "CPUs",
        "Radeon Pro",
        "thermal",
        "MacBook lineup",
        "bit",
        "device",
        "clock",
        "thing",
        "lot",
        "Adobe"
    ],
    "transcript_entity_values": [
        "10,000",
        "Windows",
        "Fortnight",
        "the past couple of years",
        "up to",
        "8th",
        "60",
        "third",
        "MacBook",
        "CPU",
        "the MacBook Pro",
        "GPU",
        "years",
        "MacBook",
        "this year",
        "8 hours",
        "Apple",
        "4 terabytes",
        "Macbooks",
        "Radeon Pro 560X",
        "2.9 gigahertz",
        "second",
        "15-inch",
        "Polaris",
        "7th",
        "today",
        "YouTube",
        "MacBook Pro",
        "2018",
        "a few seconds",
        "Adobe Premiere",
        "Boot Camp",
        "560",
        "first",
        "Windows",
        "a few days later",
        "32",
        "MacBooks",
        "MacBook"
    ],
    "transcript_entity_types": [
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "DATE",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}