{
    "id": "dY5lAAkDX8M",
    "title": "Intel prepares to SLAM AMD!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-21T01:48:53Z",
    "video_url": "https://www.youtube.com/watch?v=dY5lAAkDX8M",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Intel",
        "Alder Lake-S",
        "hybrid CPU",
        "hybrid",
        "CPU",
        "design",
        "processor",
        "16 core",
        "hyperthreading",
        "12th gen",
        "desktop",
        "4GHz",
        "SiSoftware",
        "leaks",
        "performance",
        "benchmarks",
        "overclock"
    ],
    "views": 741550,
    "likes": 41670,
    "comments_count": 1802,
    "description": "Get 20% OFF + Free Shipping @manscaped this Valentine's Day with code TECH at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 We're Canadian 0:11 LG might ditch smartphones 1:11 Intel Alder Lake-S leaks 1:59 Nvidia resurrecting RTX 2060? 2:59 MANSCAPED 3:45 QUICK BITS 3:48 EC fines Valve + Steam publishers 4:23 Mac + Windows bugs 4:44 Virgin reaches Orbit 5:13 Facebook vibrating VR displays 5:34 2.5GHz superconducting processor  NEWS SOURCES  intro Whitehouse.gov site has dark mode    LIFE IS NOT SO GOOD GUYS LG might give up on smartphones   Rollable  Songbird   WORK SMARTER, NOT ALDER Alder Lake-S CPU with 16 cores, DDR5 memory spotted  but do we need efficiency on desktop?    higher clocked than we thought   DEEP SIXTYD RTX 2060 coming back right before RTX 3060?    No 3060 FE   QUICK BITS  SLAPS WRIST IN DUTCH EU fines Valve 7.8 million Euros     NEED A BUG CATCHER macOS Big Sur bug locks up Macbooks behind screensaver  Windows 10 bug crashes your PC when you open a certain file explorer path   ORBITAL V-CARD LOST Virgin finally makes Orbit    ITS A WHOLE VIBE Facebook Reality Labs tests reducing VR screen door by vibrating the display    LISTEN TO MY WORDS CAREFULLY Researchers develop 2.5GHz superconducting processor   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://manscaped.com/TECH",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://techcrunch.com/2021/01/20/white-house-dark-mode-biden-admin-refreshes-presidencys-website-vows-accessibility/",
        "https://www.whitehouse.gov/",
        "https://www.engadget.com/lg-ceo-kwon-bong-seok-mobile-division-exit-losses-094712722.html",
        "https://9to5google.com/2021/01/20/lg-smartphone-market-exit-report/",
        "https://www.cnet.com/news/the-lg-rollable-phone-with-expandable-display-is-real-and-coming-in-2021/",
        "https://youtu.be/_PkkFHoGTxY?t=13",
        "https://www.kitguru.net/components/cpu/joao-silva/alder-lake-s-16-core-processor-using-ddr5-memory-spotted-on-sisoftware-database/",
        "https://twitter.com/momomo_us/status/1351530112815042563",
        "https://ranker.sisoftware.co.uk/show_system.php?q=cea598ab92a198ac9abcdbe6cbfadcae93a284edd0e0c6ae93a385fdc0f0d6b3d6ebdbfd8eb38b",
        "https://www.tomshardware.com/news/alder-lake-s-cpu-hits-4-ghz-with-ddr5-memory",
        "https://linustechtips.com/topic/1296132-nvidia-to-reintroduce-the-rtx-2060-series-into-the-market/",
        "https://videocardz.com/newz/nvidia-to-reintroduce-geforce-rtx-2060-and-rtx-2060-super-to-the-market",
        "https://www.pcgamer.com/nvidias-rtx-2060-and-2060-super-gpus-rumoured-to-be-returning/",
        "https://www.cowcotland.com/news/74968/nvidia-geforce-rtx-3060-pas-de-version-fe-et-un-tarif-a-partir-de-335-euros-en-france.html",
        "https://linustechtips.com/topic/1296242-the-european-commission-fines-valve-78-million-euros-for-geo-blocking-steam-games/",
        "https://www.eurogamer.net/articles/2021-01-20-european-commission-fines-valve-and-five-publishers-7-8m-for-geo-blocking-steam-games",
        "https://ec.europa.eu/commission/presscorner/detail/en/ip_21_170",
        "https://www.theverge.com/2021/1/19/22238787/apple-m1-macbook-air-pro-mini-screensaver-bug",
        "https://gizmodo.com/this-new-windows-10-bug-could-brick-your-pc-1846086576",
        "https://arstechnica.com/science/2021/01/virgin-orbit-just-earned-the-orbit-part-of-its-name/",
        "https://www.cnn.com/videos/business/2021/01/18/virgin-orbit-rocket-launch-boeing-747-lc-orig.cnn/video/playlists/business-spacex/",
        "https://www.roadtovr.com/mechanical-display-shifting-sde-reduction-facebook-reality-labs-research/",
        "https://research.fb.com/publications/screen-door-effect-reduction-using-mechanical-shifting-for-virtual-reality-displays/",
        "https://hexus.net/tech/news/cpu/147313-researchers-test-25ghz-superconducting-microprocessor/",
        "https://spectrum.ieee.org/tech-talk/computing/hardware/new-superconductor-microprocessor-yields-a-substantial-boost-in-efficiency",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- This is driving me crazy. Cause I got this feeling something important happened today. And I just, I can't remember. It's like, it's a political thing. All right. The white house website got dark mode. Neat. LG is thinking about ditching the smartphone business, according to the Korean, according to CEO kwon Bong-Seok, The Korean Herald reported that the company's big cheese revealed in a message to staffers, that it is about time for LG to make a cold judgment regarding a sale, withdrawal and downsizing of the company smartphone business in response to fierce competition. But this news comes only a week after LG teased their rollable smartphone at CES. Now what are we supposed to do with that thing? Stick it at our pipes and smoke it. Kwon's considering the move because of his self-perceived failure to make LG's mobile division profitable by 2021. I mean, I don't know who made the decision to tie the wacky flip-up LG wing in with \"Songbird\", that horrible looking movie about COVID starring the guy from \"Riverdale\" but, that probably didn't help either, bad decisions, they haunt you forever, right? Fresh leaks of Intel's Alder Lake-S processors are haunting the internet, specifically a 16 core model with DDR5 memory, that does sound spooky. An entry in the SiSoftware database described a hybrid design processor that has shown up in leaks before. It's got eight high performance, hyper-threading capable cores, in addition to eight power efficient cores for a total of 24 threads. But the presence of DDR5 is a new detail as is the chips boost clock of 4 GHz, allowing this sample to perform substantially better than the one shown in previous leaks. Now, these are desktop processors and I'm not sure what use efficiency cores will have when, you know, battery life isn't really in the picture, but hey, maybe Intel knows something I don't, I certainly hope Intel knows something I don't. And a week after announcing the RTX 3060, NVIDIA may be planning to reintroduce the RTX 2060 and 2060 super into the market. French enthusiast site, overclocking.com claims that sources have told them NVIDIA has distributed new GPU stock to board partners as a way to have something, anything on shelves that gamers can actually freaking buy. If this is true, it's pretty ridiculous. I mean the GPU stock shortage has gotten apparently this bad to the point where we are re releasing old products so consumers have some way to spend their money. In case you were hoping for a deal, it looks like the RTX 3060 may not launch with a founder's edition which means that most cards will be priced above the 3060's, $329 MSRP. Maybe we were wrong. Maybe we all should have pre-ordered these cards when they launched. Now look at us, poor schmucks. Now it's time for the Graphics Bites, brought to you by MANSCAPED, the men's grooming company that doesn't want you to let Nixon cuts ruin your Valentine's day. MANSCAPED's perfect, (laughing) I'm trying to imagine that, it's like, oh, God heavens. MANSCAPED's perfect package 3.0 features, they're awesome lawnmower 3.0 waterproof body trimmer and a whole lot of other goodies, like their new refined cologne, it's hypoallergenic and has a super subtle yet enticing woodsy scent that's a perfect compliment to the scent in other MANSCAPED products. Because men, like do stuff in the woods, right? So you gotta like, yeah, you gotta smell like wood-- - [Man] Trees, et. Cetera. - She'll love your wood smell and use promo code tech for 20% off and free shipping at the link below. I think we've had enough here. All right, time for the graphics Bites, ever heard of them? The European commission has issued fines, totaling 7.8 million euros against Valve and five steam publishers, including ZeniMax, Capcom and Bandai Namco. The EC says that the company's restricted sales in some European regions, but not others, which is against EU antitrust rules. Valve plans to appeal of course, saying that geoblocking actually helps prevent publishers from raising prices in less affluent regions. But regardless, if the fines go through, it shouldn't be too much of a burden thanks to that sweet, sweet Dota money. - [Man] Only works in the game though. - [Presenter] And M1 Mac book users are complaining about a Macalester big server that activates the screen saver and renders laptop unusable. Huh, should have bought a windows laptop. They don't have any bugs, like, for instance, that crashes your whole PC when you open a certain path, and file Explorer, PCMR bro. Virgin orbit has finally managed to live up to their name with the successful launch of the LauncherOne rocket into orbit becoming the first company to do so with a liquid fueled rocket deployed from a 747. Looks like Richard Branson will finally get his access card to the super secret billionaire space station where Elon Musk and Jeff Bezos spend all their time probably, glaring at each other. But living longer, you know that right? - [Man] Thanks to relativity. - [Presenter] The company formerly known as Oculus, Facebook reality labs is apparently researching a way to reduce the screen door effect in VR headsets, involving rapidly and minutely shifting the entire display. So basically, they're gonna make a vibrator that goes right on your face. Sounds horrible or great, depending on what you want the headset for. And the Japanese researchers have developed a super conducting processor said to be 80 times more efficient than traditional seven nanometer alternatives. And if that doesn't get you excited enough this bad boy is made of super conducting niobium and built from adiabatik quantum-flux-parametrone. Is that a real word? What is this line? I mean there's more than 20,000 Joseph's injunction switches. Woo, woo, it's getting hot in here. I gotta take off my LTT store merch. Ah, this tech news, you know what, it's too much, it's too hot to continue. So come back on Friday for more tech news which will also be very hot because we have only the hottest news for you, the very hottest viewers, we can finally joke about it. - [Man] Oh, man, it's like nostalgic now.",
    "transcript_keywords": [
        "driving me crazy",
        "company",
        "MANSCAPED",
        "MANSCAPED perfect",
        "super",
        "important happened today",
        "Intel",
        "Graphics Bites",
        "time",
        "RTX",
        "Korean Herald reported",
        "company smartphone business",
        "smartphone business",
        "Korean Herald",
        "GPU stock",
        "smartphone",
        "cores",
        "Intel Alder",
        "make",
        "Intel Alder LakeS"
    ],
    "transcript_entity_values": [
        "CES",
        "24",
        "French",
        "Jeff Bezos",
        "Intel",
        "Songbird",
        "Kwon",
        "Valve",
        "20%",
        "ZeniMax",
        "Riverdale",
        "NVIDIA",
        "Valentine",
        "EU",
        "MANSCAPED",
        "only a week",
        "2021",
        "the Graphics Bites",
        "The European commission",
        "SiSoftware",
        "4 GHz",
        "747",
        "The Korean Herald",
        "LauncherOne",
        "Japanese",
        "LTT",
        "2060",
        "Alder Lake-S",
        "80",
        "Bandai Namco",
        "seven nanometer",
        "Friday",
        "The white house",
        "DDR5",
        "LG",
        "European",
        "more than 20,000",
        "kwon Bong-Seok",
        "first",
        "3.0",
        "Nixon",
        "16",
        "Explorer",
        "Korean",
        "Facebook",
        "Capcom",
        "7.8 million euros",
        "Elon Musk",
        "GPU",
        "Dota",
        "EC",
        "Macalester",
        "Oculus",
        "3060",
        "a week",
        "$329 MSRP",
        "M1 Mac",
        "five",
        "Joseph",
        "eight",
        "Richard Branson",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "NORP",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERCENT",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "NORP",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE"
    ]
}