{
    "id": "DzS29OoILo4",
    "title": "Apple Vlog from WWDC 2023! I SAW VISION PRO!!!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-06-07T17:40:04Z",
    "video_url": "https://www.youtube.com/watch?v=DzS29OoILo4",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Unboxing",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 260152,
    "likes": 8888,
    "comments_count": 427,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- Happy WWDC, 2023. I am here, I just checked in. I've got my little bag. And now I'm gonna head in, and hopefully find some of my other YouTuber tech friends. So, let's go. (upbeat music) (crew cheering) Yay. Thank you! So excited! Thank you so much. - Good morning. - [Kathy] Morning - Yes. (crew applauding) (upbeat music) (Kathy gasps) - Hi! - Kathy, oh my gosh. - [Kathy] What a surprise. - You caught me getting me some healthy food. - Okay, so we've got our little WWDC bag here. Let's see what's inside. Okay, we've got some pins. Like, check these out. (Kathy gasping) All right, we've also got a hat. Look at this. Love to see it. (Kathy gasps) A little tumbler. For coffee. Oh my gosh, this is so nice. We got our little WWDC logo. Okay. That's all that's in the bag. But you've also got this awesome little tote. Love it. (upbeat music) Sarah, Sarah, Sarah. - Hi. - I love your fit. Oh my gosh. I was like, hey, am I farming or am I reviewing tech today? - No, I mean, it's perfect. I didn't even recognize you walking up, but it is like, I think this is a new era for you. - Maybe, I don't know. I'm not sure. - I love it so much. - Thank you. Good to see you. Good to see you, too. Oh my gosh, I'm so excited. So- - It's official. - It's official. Sarah's in L.A. I saw you posting here like wait a minute, I told them two months ago. Yes. I told it on their podcast. - And I totally forgot. So the same brain fam got it first. - They did. Well I was so excited that you're in the area so, oh, we have to hang out. I have friends but that's new for me. - I also want to tell you that I bought a basketball pump so we are ready to play basketball. - Oh my gosh, I'm so excited. - I'm not good though. - I'll teach you. - Okay. Alright. (both laugh) (Kathy gasps) - Hi. - How's it going? - Happy birthday. - Thank you so much. - I mean, is this not the most exciting birthday ever? - This is the best 50th birthday I can imagine. I cannot imagine being anywhere else. This is crazy. (Kathy laughs) - So great. Everybody go tell Faruk happy birthday. - Thank you. (upbeat music) (crowd cheering) - Welcome to what's going to be the best WWDC ever. - [Audience Member] Woo. - The event just ended. I'm so overwhelmed, like it was one of the longest events. I feel like, everything happened so quickly, it was just like Rapid Fire. Vision Pro. Vision OS. Oh my God, are you guys like are you freaking out? - It's pretty sick. - [Kathy] Hi. - Hello. - Good to see you. I only saw you in passing earlier- - Yeah. - But yeah. - I love the outfit. - Thank you, thank you. - Twitter is like very different rhetoric. I was like Twitter's like the dystopian, like that's mad. what do you think? Like dystopian or excited? - A little of both, actually. - Yeah, me too. - [Kathy] Yeah. - It looks like Ready Player One, like that movie in real life. - I was telling Faruk, I was like, it kind of feels like Black Mirror but like I'm here for it, you know? - Oh totally. - What do you think? - It's gonna be amazing. - [Kathy] Yeah. - Yeah, so I guess we don't need our screens anymore, you know? - Well I was thinking how cool it would be because I have like a three monitor set up. How incredible would that be to edit? Like- - Yes- - Like you won't even need them. - You can put anything anywhere now. You can put the clips somewhere else and just look at the screen. - I'm just hoping that it's comfortable because if it's not comfortable you're not gonna wanna wear it. But I do feel like if Apple's gonna do something, they're gonna do it right. - But we question how they're gonna do FaceTime and then they show that they're gonna do FaceTime and it's... - Like a digital persona of yourself and it actually looks pretty good. So I hope it'll kind of pull through. - Yeah, I can't wait to see that. - Oh man. I've been having the absolute best day ever. Apple actually made a little creator studio so you could go in and record. So I just recorded my little video for my WDC recap and it was so much easier than having to go film that in my hotel room and also this granola mix that they have. It might be the best trail mix I've ever had. Good job Apple. Look, there's dates in there. Dates and white chocolate chips. So good. I just left my camera in there and panicked. Had to go back. (gasps) SuperSaf. - Hey, - Hi, good luck. Have fun. Good to see you. - Thank you. Thank you. - Seeing him from afar, you just keep seeing your friends from afar and you wave as they go off to their briefings. But man, it's so fun. Getting a chance to actually try the vision headset was pretty incredible. I keep calling it Vision Plus for some reason but it's Vision Pro and it's pretty freaking cool. Now Tyler and I have to go do a lot of editing. Tyler's up there. Look at your cool headphones, dude. Look at these. - Pretty cool dude. - [Kathy] What are they? - Koss Porta Pros. - They look vintage. I was like, okay, I don't know if these are like a new thing or it's some sort of like futuristic vintage, but I think that's yeah, they're new? - They look old, but they're new. (Kathy laughs) Yeah. Yeah. - It is snack time at the Steve Jobs theater adjacent to the Visitor Center. Look at all these treats. Oh my gosh. Hello Michael Josh. How are you? - Hey. Hi. Exciting day isn't it? - How is your dub dub going so far? - Ah you know, I was live tweeting and taking notes all the whole time, until they announced Vision Pro and then I was like, you know what? I think I just need to soak it in a little bit 'cause this is a historical moment. - Me, Sarah, and Julia had to go to the bathroom at the midway point. I was like, oh my God, we might miss the headset. But we ran. - Okay. - But we made it thankfully. - I just think we're gonna look back after a few years and I was there. And you know what, Apple, they always say you need Apple to do it well. - Exactly. - And then I think the whole world can follow. I've always believed that the future is having this layer above our real world. But I love that you can have that and then you can also just disappear. - Did you get a demo? - Not yet. Not yet. - Oh! - So I'm really excited. - Okay, no, no, no, just embrace it and it's so wild because it feels like you're looking at the real world but yet like your eyes know you're not. - Was it easy? 'Cause it's a new way of like doing things or you just know what to do. - You just knew what to do. Once they told you like to pinch and then you like pinch to zoom and drag and like it's just, it's so intuitive, it was honestly unbelievable. - I cannot believe like I will go out and buy it as soon as I can. - I can't wait. - Next year can come soon enough. - I know. (both laughing) - We still have to have a new iPhone out first. - I know. - The other thing that was really cool is they didn't really make a big deal about it but it's connected to a battery pack. So the battery pack lasts two hours but when you go and see how cool the battery pack is it's like this aluminum little pack. - [Michael] I would love that for my iPhone. (laughs) - That's what I said. I go can you guys make one of these so then we can use it as a charger. - Today you have people on planes with their big AirPods max, right? - Right. - And their cans to kind of cancel out the noise. Now like just imagine like if you're sitting in coach right? Flying spirit, (laughs) - Our whole spirit. - And you wanna just block out the real world. You have the noise cancellation and then you can have those that like, is it 180? - Yeah. - 180 degree. And just to feel like you're in somewhere more zen, right? - Which is super cool though 'cause they do have some like immersion experiences. - Yeah. - Where it's full 360. - 360. - Like you look around and you're just like I'm in it. - Yeah. And I like the mental health like the visualization so I can actually not have to necessarily close my eyes. - [Kathy] Right. - [Michael] But be disappear from the world a little bit. - [Kathy] It was so awesome. I can't wait for you to try it. - But on the flip side, I love the dad. Like he was working and then his son came over. - Yeah. - And then he was able to kick the ball and like be immersed but also be present. - Yeah. - Which I think is so important for something like this. - This is our future. - Yeah. - I'm here for it. - I'm here for it. I need it now. (laughs) - Now. So I actually can't believe it, but Vision Pro is right here. It is behind me. It's so cool cause we're actually getting a chance to see it. Now, I did get a chance to get hands on with it and really experiencing this in real life was by far way cooler than I really thought it was gonna be. Obviously I thought it was gonna be cool, but just seeing the way that this has the ability to really transport you from your living room into an entirely new universe was, it's... I'm speechless. (upbeat music) This is the battery pack that connects to the headset and this will give you about two hours but there is a USB-C port on it that will allow you to connect it to power so you can use it all day without worry. The actual headset material is very soft and it really does form to your head. The material is super lightweight but the actual headset does have some weight to it. So I'm not sure if this is something that I could wear all day long but a few hours here and there with some breaks, I definitely could see myself doing that. On top of the Vision Pro are two buttons and this is the Digital crown, which kind of looks like the digital crown on the Apple Watch. What sets this apart from other devices like it, is the eye tracking and the selection. There are no controllers, there's nothing attached to you because of these sensors here on the bottom, you could have your hands easily resting in your lap and with the slight pinch motion of your two fingers that's how you make a selection. The actual viewing experience when this is on your head is unbelievable. The way that this can seamlessly take you from one incredible fully immersed world back into an augmented reality of you sitting in your living room is pretty impressive. Sitting there and having my entire Apple ecosystem, appear before my eyes in my space in a virtual reality setting was unlike anything that I'd really ever experienced before. Going into messages, going through photos, watching 3D movies, and then getting up off of the couch and interacting with a dinosaur that just broke through my wall. It really felt like I was transported to another world. Now the price tag of this Vision Pro is $3,500, which is pretty expensive. It's not just a headset. Apple is calling it a spatial computer. It's not connected to anything separate. Everything is happening inside of the headset. It's powered by a dual chip design that combines an M2 chip with a brand new R1 chip. And the R1 is basically designed to handle all this real-time sensor processing. While I don't think that everyone in the world is gonna be going out and purchasing this headset right now, this is laying the groundwork for developers and content creators to start making content for this device. Having this be announced at WWDC is also giving developers the entire freedom to let their imaginations go wild. Having the support of Disney Plus on day one of launch is also really incredible. Disney has such an amazing catalog of content plus Star Wars, Marvel and more. All of this is leading to future devices that could be more cost effective, small, better battery life and who knows what else? This my friends is just the beginning. (upbeat music) We're in line right now to get some t-shirts. Now there is a Ted Lasso exclusive happening now at the Apple store and I'm kind of excited but I also haven't finished season one yet so I don't really get the reference but I'm still gonna get the t-shirt and a jersey and maybe a hoodie and then after I watch it I'm gonna be like, wow I'm so glad I bought this. Pretty cool. I'm gonna get this one and I'm also gonna get the blue. It's a nice hoodie. Like it's pretty nice. Sick. (upbeat music) Okay, so I'm gonna put the hoodie on now because I'm cold. Oh yeah. Oh my God, I love it. It's so, like the color's perfect. It's actually a perfect fit. I wanted a small but it really is nice. - [Tyler] Ooh, nice big hood. - Yeah, nice hood. Oh, this is my airport fit tomorrow. - [Tyler] Sick. - Oh man. Okay, so we had such a long day today and now I'm back at the hotel. I got a shower, I'm in my jammies and ordered some steaks from a nearby restaurant from DoorDash and the side dishes, like look how much food is here. This is ridiculous. Tyler's got his little meal here. This is going to be so freaking good and I just, I can't wait to eat and edit in bed. - [Tyler] I've never seen so much mac and cheese. - Look at this. And there's so much mashed potatoes. And wow. Okay. This is the buffet, welcome to it. Here you are. - Oh yeah. (both laughing) - Help yourself. Good morning. I barely slept, I think maybe three hours. Packed this morning, got up super early around 5:30. The fact that this suitcase has closed is an actual miracle. I couldn't have even filmed myself closing it because the things that I had to do felt illegal, but it's closed. And I wanna show you this little tip that I have for bringing a blanket. Normally I also bring a full bed pillow and I wrap it in a yoga matte strap so that it's easy to carry and because it's like a pillow and a blanket and it is kind of large they usually don't say anything because I'm like this is my bed, this is my sleep, I need this. Let me live my life. I also take a lot of overnight flights. So at that point they're just like, okay let's just let her be. She looks unwell. So today I have some more briefings at Apple and then I'm flying back to Los Angeles. So we're gonna get a little breakfast and head over to the campus. I've been loving this ally. My video should be posted soon if it's not already. I'm stepping on something. I've like Diablo four. I freaking love Diablo so much. So it's been awesome to be able to take this on the go. So as long as I have wifi, I'm able to connect. I do wish there was some more offline play for some of the games that I like, but it is what it is. Croissant tea time. So I had plans to make like a really cool montage of my last day at Apple and then my flight home that did not in fact happen. I fell asleep the second that I got on that plane. I did not wake up until that plane landed. It was like freaking time travel. I am so exhausted. This was my aura ring sleep score from last night. That's pretty high. And if you'll notice that little blue line is completely solid. That means I didn't move at all. This is what it looks like. A normal sleep. I move around a lot and the dog was even in my bed. No, there was, I was in an absolute coma. Anyway, I had so much fun at Apple, but I have got to film in a little bit, so I'm gonna just continue resting here for a little while until I have to be a person. Okay bye.",
    "transcript_keywords": [
        "Yeah",
        "Vision Pro",
        "Apple",
        "Good",
        "Vision",
        "cool",
        "Love",
        "pretty",
        "Pro",
        "WWDC",
        "world",
        "headset",
        "excited",
        "Sarah",
        "day",
        "gosh",
        "Good job Apple",
        "kind",
        "nice",
        "Pretty cool"
    ],
    "transcript_entity_values": [
        "WWDC",
        "a minute",
        "second",
        "WWDC",
        "Kathy",
        "M2",
        "about two hours",
        "maybe three hours",
        "Faruk",
        "Vision OS",
        "Apple",
        "Michael Josh",
        "Disney Plus",
        "a few hours",
        "this morning",
        "two months ago",
        "Ted Lasso",
        "iPhone",
        "50th",
        "three",
        "AirPods max",
        "Michael",
        "Twitter",
        "Vision Pro",
        "FaceTime",
        "this Vision Pro",
        "Los Angeles",
        "Julia",
        "the Vision Pro",
        "Sarah",
        "Digital",
        "four",
        "Rapid Fire",
        "Kathy] Hi",
        "WDC",
        "360",
        "two hours",
        "the Visitor Center",
        "L.A.",
        "DoorDash",
        "YouTuber",
        "today",
        "Steve Jobs",
        "day one",
        "two",
        "3,500",
        "2023",
        "overnight",
        "Tyler",
        "a few years",
        "first",
        "Kathy] Morning - Yes",
        "tomorrow",
        "last night",
        "USB",
        "Disney",
        "180",
        "Koss Porta Pros",
        "Black Mirror",
        "SuperSaf",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "EVENT",
        "TIME",
        "ORDINAL",
        "DATE",
        "PERSON",
        "PRODUCT",
        "TIME",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "FAC",
        "GPE",
        "ORG",
        "NORP",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}