{
    "id": "Dzsv7x0JcXE",
    "title": "So the PS5 IS better…",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-11-26T02:51:13Z",
    "video_url": "https://www.youtube.com/watch?v=Dzsv7x0JcXE",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Sony",
        "PS5",
        "performance",
        "teraflops",
        "frame rate",
        "fps",
        "resolution",
        "60fps",
        "120fps",
        "ray tracing",
        "benchmark",
        "PS5 vs. Xbox Series X",
        "games",
        "versus",
        "comparison",
        "best console",
        "best console 2020"
    ],
    "views": 669012,
    "likes": 41377,
    "comments_count": 1919,
    "description": "Remotely monitor and manage your server or PC with Pulseway at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 Can I get some Tech News in the chat 0:13 PS5 not so \"underpowered\" 1:26 Scalper's Paradise 2:31 Vulkan adds ray tracing 3:23 Pulseway 4:02 QUICK BITS 4:08 Amazon takes the internet down 4:36 Apple M1X chip rumors 5:02 LG rollable laptop patent 5:16 Hackers close Baltimore schools 5:34 The Utah Monolith  NEWS SOURCES  END THE CONSOLE WAR PS5 is outperforming Xbox Series X, despite being underpowered    Xbox Series X/S are emulation powerhouses   uses a loophole   LEGITIMATE BUSINESS OPPORTUNITIES Scalper group secured 3,500 PS5s between 12 people      CLOUDED BY EMOTION Vulkan releases Ray Tracing spec   Cyberpunk ray tracing Nvidia exclusive  Godfall AMD exclusive   QUICK BITS  SORRY, THE INTERNET ISNT HERE RIGHT NOW AWS was down and took a bunch of the web with it     PUT AN X ON IT Apple M1X on the way next year?    SCROLL UP LG patents rollable tube laptop    HACKERS HELP KIDS Ransomware attack shuts down Baltimore schools     WATCH OUT FOR APES Attempt no landings at the Utah monolith    ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/pulsewayteams",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.theverge.com/21718936/xbox-series-x-ps5-performance-game-comparison",
        "https://www.youtube.com/watch?v=GIIhJqTERls",
        "https://www.youtube.com/watch?v=RnZAN91pUiw",
        "https://www.youtube.com/watch?v=UGAjhjp8dnI",
        "https://www.xda-developers.com/xbox-series-s-series-x-developer-mode-retroarch-emulation/",
        "https://arstechnica.com/gaming/2020/11/how-one-developer-is-sneaking-emulators-through-a-hole-in-the-xbox-store/",
        "https://www.kitguru.net/tech-news/featured-tech-news/matthew-wilson/over-3000-launch-day-ps5-consoles-went-to-scalpers-in-the-uk/",
        "https://www.businessinsider.com/playstation-5-launch-day-us-europe-flooded-by-reseller-bots-2020-11?r=US",
        "https://crepchiefnotify.com/",
        "https://www.gamesindustry.biz/articles/2020-11-24-scalpers-and-bots-reportedly-driving-ps5-shortages",
        "https://www.techspot.com/news/87716-graphics-api-vulkan-now-features-full-ray-tracing.html",
        "https://www.khronos.org/blog/vulkan-ray-tracing-final-specification-release",
        "https://www.gamespot.com/articles/cyberpunk-2077-ray-tracing-will-be-exclusive-to-nvidia-at-launch/1100-6484778/",
        "https://www.pcgamer.com/ray-tracing-amd-nvidia-exclusivity/",
        "https://techcrunch.com/2020/11/25/amazon-web-services-outage-takes-a-portion-of-the-internet-down-with-it/",
        "https://status.aws.amazon.com/",
        "https://downdetector.com/",
        "https://linustechtips.com/topic/1273507-a-dodeca-like-no-other-apple-m1x-rumors/",
        "https://www.notebookcheck.net/Alleged-Apple-M1X-SoC-in-upcoming-MacBook-Pro-16-ready-to-outcore-and-outscore-its-M1-ARM-based-relative.506019.0.html",
        "https://hexus.net/tech/news/laptop/147029-lg-files-rollable-screen-laptop-patent/",
        "https://twitter.com/Gadgetsdata/status/1329630734097608706",
        "https://www.engadget.com/baltimore-public-school-system-ransomware-attack-160600564.html",
        "https://baltimore.cbslocal.com/2020/11/25/baltimore-county-public-schools-closed-cyber-attack-latest/",
        "https://twitter.com/DMDForward/status/1331568674285772800",
        "https://www.nytimes.com/2020/11/24/us/Utah-monolith-red-rock-country.html",
        "https://futurism.com/the-byte/metal-monolith-location-google-earth",
        "https://www.reddit.com/r/FindTheMonolith/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Welcome to the show. Can I get a tech news? - [Man] Tech news. - Come on, let's raise the roof. - [Man] Tech news! - Sony's PlayStation 5 is apparently outperforming the Xbox Series X in some cases, despite early speculation to the contrary, based on the Series X being rated for 12 teraflops compared to the PS5's measly 10.28 teraflops. Right? Digital Foundry's testing found that in Devil May Cry 5, Assassin's Creed Valhalla, Dirt 5, and Call of Duty: Black Ops Cold War, let's just add more post titles, anyway, Microsoft's new powerhouse takes a slight lead in 4K and ray tracing performance. But in the high frame rate mode, the PS5 achieves as much as 40 more frames per second than the Series X. Turns out there's more to life than flopping. Really? Is there more to life than flo- That's just what I do. But hey, you know what? Maybe that's just fine, because the new Xbox apparently are super good at emulating Retro games, as an app developer going by Tunip3 found out by exploiting a loophole in the Xbox app distribution system to download RetroArch. And when Halo Infinite comes up, well, the Xbox Series X will run that one way better than PS5. - [Man] Infinitely better. - So. (grand music) Gamers have had a real tough time getting their hands on the new releases lately, but it's hard to tell how much of our frustration to place on companies having low stock and buggy servers or scalpers buying up all the inventory. Well, an investigation by Business Insider has explored just how bad the scalping situation is. One UK-based group called Crep Chief Notify, heck of a name, managed to secure almost 3,500 PS5 consoles, holy crap, between its 12 staff members. This group also offers subscription services that help other people use bots to scalp in-demand products like consoles or Yeezys. Do people still use, do people still desire Yeezys? Is that a thing? - Yes. - I feel like I've outgrown the meme and the meme just came back and anyway. That's why I'm never able to cop the latest drop. Wow. If I knew actively making people's lives worse was so lucrative, I would've subscribed to Crep Chief Notify ages ago. Nah, I can't say that with a straight face. I don't like making people's lives worse. And Vulkan, the open source graphics API, has received full ray tracing support, according to the API's developer, Khronos Group. The addition makes Vulkan the first cross-vendor, cross-platform standard to support the feature, meaning games that use it could use ray tracing on basically any piece of hardware, whether it's from Nvidia, AMD, Intel, Sony. The reason this is cool is because now that Nvidia and AMD hardware support ray tracing, we're starting to see games that support ray tracing exclusively on team red or team green. Cyberpunk 2077's ray tracing will only work with Nvidia cards at launch. Will God fall, but only looks extra glorious on AMD. - [Man] This is so cool. - It's the coolest. Vulkan hasn't seen super widespread adoption yet, but maybe that'll change. Maybe it'll rain money tomorrow. There's a chance, guys. Now it's time for Cork Barks, brought to you by Pulseway. They're a real-time remote monitoring and management software that lets you manage systems and support users from anywhere, even if you're locked in the bathroom due to some crazy social situation. - [Man] They're out of toilet paper in here. - I wish that weren't actually true. Their app is compatible with Windows, Mac, and Linux, and lets you access real-time status, system resources, logged in users, network performance, Windows updates, and more. You can also create, deploy, and automate custom scripts for patching security, making backups, and generating reports. So generate some peace of mind by trying Pulseway for free today at pulseway.com or through the link below. Cork Barks make me lose my mind up in here, up in here. - [Man] Stop. - [Anthony] Amazon Web Services experienced an outage this morning, meaning that so did a large chunk of the internet, including services from Adobe, Roku and more. Amazon hasn't given an explanation for the outage other than that North America was experiencing increased error rates. - [Man] I blame Bill Gates. - Well, there are other people who would blame other things if you read the news. Oh, if you're listening, Amazon, I'm pretty good at tech tips. So let me know if you want me to come fix that up for you. Apple just launched their M1-powered Macs, but rumors are already starting to spread about the sequel. - [Man] Return of the Mac. - LeaksApplePro claims that Apple's next chip will be called M1X with eight performance cores, thank you, and four efficiency cores, and it'll launch in a 16-inch MacBook Pro next year. I'm sure that one will run iPad apps even better. I can't even make that joke, they're really good. LG has filed a patent for a laptop with a rollable display, much like it's rollable TVs. The laptop's keyboard would also be rollable, meaning that it would look less like a clamshell and more like a scroll. Perfect for watching videos on the go and reading imperial edicts. Hackers have again attacked the city of Baltimore with ransomware, which took internal networks for the Baltimore County Public Schools offline. That caused the city to close the schools, giving students a day off. Wait, that sounds like a cool modern day Ferris Bueller party. Piss off, hackers. And despite government warnings to stay away, the mysterious metal monolith found in the Utah desert this week has been located and physically visited by Redditors. Because of course it has. The monolith has apparently been there for years, but we're just finding it now, which means the aliens have already infected the planet and our minds. Well, it's been fun. How about you come back for more fun on Friday? We'll have a fresh batch of tech news if the reptilian metamorphosis hasn't completed by then.",
    "transcript_keywords": [
        "ray tracing",
        "Xbox Series",
        "Crep Chief Notify",
        "support ray tracing",
        "tech",
        "Series",
        "people",
        "Xbox",
        "tracing",
        "ray",
        "Assassin Creed Valhalla",
        "Black Ops Cold",
        "Ops Cold War",
        "Crep Chief",
        "Chief Notify",
        "support",
        "ray tracing support",
        "support ray",
        "making people lives",
        "Nvidia"
    ],
    "transcript_entity_values": [
        "Ferris Bueller",
        "iPad",
        "PlayStation 5",
        "Call of Duty: Black Ops Cold War",
        "Khronos Group",
        "Intel",
        "One",
        "as much as 40",
        "4",
        "one",
        "RetroArch",
        "the Baltimore County Public Schools",
        "12 teraflops",
        "Adobe",
        "Digital Foundry's",
        "Utah",
        "Windows",
        "Roku",
        "Amazon",
        "Dirt 5",
        "Apple",
        "second",
        "May Cry 5",
        "ages ago",
        "next year",
        "Windows, Mac",
        "2077",
        "the Series",
        "API",
        "Microsoft",
        "the Xbox Series X",
        "Linux",
        "years",
        "Friday",
        "North America",
        "LG",
        "Macs",
        "PS5",
        "Pulseway",
        "10.28 teraflops",
        "Business Insider",
        "first",
        "Sony",
        "almost 3,500",
        "Nvidia",
        "Crep",
        "AMD",
        "AMD",
        "Bill Gates",
        "M1",
        "Amazon Web Services",
        "four",
        "UK",
        "this week",
        "Vulkan",
        "Cork Barks",
        "MacBook Pro",
        "this morning",
        "12",
        "Xbox",
        "Mac",
        "Assassin",
        "16-inch",
        "eight",
        "tomorrow",
        "Yeezys",
        "today",
        "Baltimore",
        "Halo Infinite"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "LAW",
        "GPE",
        "DATE",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "NORP",
        "DATE",
        "GPE",
        "PERSON"
    ]
}