{
    "id": "e0RLWNVxfb0",
    "title": "Google Assistant’s interpreter mode translates 27 languages",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-01-08T19:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=e0RLWNVxfb0",
    "category": "Science & Technology",
    "tags": [
        "google",
        "interpreter mode",
        "google interpreter mode",
        "google assistant",
        "google translate",
        "google translation",
        "translate",
        "translation",
        "translator",
        "Chinese",
        "mandarin",
        "mandarin translation",
        "ces",
        "ces 2019",
        "event",
        "2019",
        "tech news",
        "home entertainment",
        "first look",
        "hands on",
        "is it worth it",
        "2018",
        "consumer electronics show",
        "ces 2018",
        "tv",
        "tablets",
        "desktops",
        "new tech",
        "gadgets",
        "technology",
        "review",
        "tech review",
        "tech",
        "top 10",
        "latest updates",
        "did you know",
        "apple",
        "android",
        "iphone",
        "verge",
        "the verge",
        "vox"
    ],
    "views": 169274,
    "likes": 2394,
    "comments_count": 220,
    "description": "Google Assistant will soon be able to act as your real-life translator in 27 different languages. Google announced today that the voice assistant is getting a new interpreter mode that can translate in real time so you can hold conversations with someone who doesnt share the same tongue. It works, but its not magic.  CORRECTION: Google Assistant's Chinese interpreter only includes Mandarin, not Cantonese.  Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TCfM4m",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Good evening, how may I assist you? (speaking foreign language) Oh, I apologize. Okay, Google. (device chiming) Chinese interpreter. (device chiming) - Ready when you are. (*music) - Hey, it's Shannon with The Verge, and we're here to check out Google Assistant's new Interpreter Mode which can translate 27 languages in real time. This could be a real game changer for concierges or anyone who wants to speak to somebody else who doesn't share the same language, if it works. Luckily we're here at the concierge desk, so let's check it out. - [Assistant] Okay, let's start. (device chiming) - How may I assist you? (device chiming) (speaking foreign language) (device chiming) (speaking foreign language) (device chiming) - [Assistant] Hello, I want to find the flow field and restaurant here. (device chiming) - Restaurant? (device chiming) (speaking foreign language) - Uh-- (device chiming) (speaking foreign language) (device chiming) (speaking foreign language) (device chiming) - I'm sorry, I don't understand. (speaking foreign language) (device chiming) - [Assistant] I want to find a restaurant here to eat some food. (device chiming) - What type of cuisine would you like to have? (device chiming) (speaking foreign language) (device chiming) (speaking foreign language) (device chiming) - [Assistant] I want to eat Western food with steak. I am a little allergic to sand. - We have a lot of great options here on property. What time would you like? (device chiming) (speaking foreign language) (device chiming) (speaking foreign language) (device chiming) - [Assistant] Thank you. (device chiming) - Great, you are confirmed. (device chiming) - So we just tried out the Google Assistant Interpreter Mode. It works pretty well. You do have to pause a lot to wait for the translation to happen, so if you partially understand the other language, you can't just interrupt somebody in the middle and say, hey, I do know what you're saying, let me just keep talking, because then the translation's interrupted. It doesn't work. - How may I assist you? (speaking foreign language) (device chiming) - It's waiting for it to translate. - Oh, sorry! (laughing) Sorry! - It does the boop, and there you go. - Sorry, let me do that again. Let me do that again. - Because you understand. - Sorry, sorry, I forgot to pause. And it actually works pretty well. At one point it thought I was allergic to sand and not shrimp, which might be problematic for tourists coming by, but for the most part, it's pretty fluid. I would say the translation has been pretty good. The new Interpreter Mode will be piloting today at hotel concierge desks in New York, San Francisco and here in Las Vegas. I thought it was pretty funny. Like, I was, like, I'm allergic to sand, and then I don't know (laughing) how he's gonna deal with that. - I love sand in my food. - Yeah, yeah, yeah. (Shannon laughing)",
    "transcript_keywords": [
        "Google Assistant Interpreter",
        "Interpreter Mode",
        "Google Assistant",
        "Assistant Interpreter Mode",
        "interpreter",
        "Google",
        "pretty",
        "Mode",
        "sand",
        "Assistant Interpreter",
        "Good evening",
        "assist",
        "Yeah",
        "works",
        "restaurant",
        "Assistant",
        "food",
        "allergic",
        "evening",
        "understand"
    ],
    "transcript_entity_values": [
        "today",
        "Shannon",
        "New York",
        "Google",
        "Interpreter Mode",
        "one",
        "Las Vegas",
        "San Francisco",
        "27",
        "Western",
        "The Verge",
        "Chinese",
        "evening"
    ],
    "transcript_entity_types": [
        "DATE",
        "FAC",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "GPE",
        "GPE",
        "CARDINAL",
        "NORP",
        "ORG",
        "NORP",
        "TIME"
    ]
}