{
    "id": "e1gO5Z9XxCk",
    "title": "How Does the MacBook Pro Notch Work? - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-11-01T15:58:27Z",
    "video_url": "https://www.youtube.com/watch?v=e1gO5Z9XxCk",
    "category": "Science & Technology",
    "tags": [
        "How Does the MacBook Pro Notch Work? - Krazy Ken's Tech Talk",
        "2021 MacBook Pro",
        "MacBook Pro",
        "M1 Pro",
        "M1 Max",
        "M1 MacBook Pro",
        "Apple",
        "Mac",
        "macOS",
        "macOS Monterey",
        "macOS 12",
        "Notch",
        "Mac Notch",
        "Menu bar",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Computer",
        "Tech",
        "Computer Clan",
        "Tutorial",
        "How-to"
    ],
    "views": 59161,
    "likes": 2811,
    "comments_count": 291,
    "description": "Apple's 2021 MacBook Pro has a notch, and LOTS of people are talking about it. Today, Krazy Ken will answer your questions and clear up some confusion about how it really works. Download our epic wallpapers   Check out our rare tech playlist   Watch our tech scam-busting episodes    Support our channel and get cool stuff   Follow us on Twitter   Like us on Facebook   Subscribe and listen to our podcast     Patrons get early access to episodes. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Download No(tch)    Update about the right-side menu bar icons: originally I said you can approximately fit 16 icons plus the clock day and time, but it turns out I was using a scaled resolution (which matched my previous Mac). So with the default scale setting, you can fit several more without running out of room!  Also, at the default scale setting, my Photoshop menus DO NOT collide with the notch after all! It only happens when I use my familiar setting. (The default resolution makes things too small for me oh gosh I sound old??)  Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://thecomputerclan.com/wallpapers",
        "https://bit.ly/clan3zlKXX9",
        "https://bit.ly/clan3o1EdZ2",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://applekeynotechronicles.transistor.fm",
        "https://Patreon.com/KrazyKen",
        "https://itecheverything.com/no-tch",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Guess what? (electronic note rings out) Apple's new MacBook Pro has a notch and I've received tons of questions about how the notch works with the software and the user interface, so that's what we'll explore today. (machine whirring) (upbeat electronic music) Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken and the new 2021 MacBook Pro is here in the lair, which means it's time to dive in, to that notch. Why does the notch exist in the first place? The notch is there to allow room for the camera, ambient light sensor, and TrueTone sensor, while giving the user more screen space and thinner bezels. Because the menu bar is using that space around the notch, the notch won't interfere with any of your windows or toolbars. And the reason the menu bar extends slightly below the notch is to provide a familiar 16:10 space below the menu bar, and that space below the menu bar is still more pixels than the entire 2019 16\" MacBook Pro display. Now, a frequent question I get is, how does the mouse cursor interact with the notch? The cursor simply hides underneath the notch, it doesn't acknowledge it as a physical border, and the cursor also follows the rounded corners at the top of the display. But what happens with full-screen apps? When an app goes full-screen, the top area of the screen is blacked out. The blacks are really black on this XDR display, so the top of the screen just looks like a physical bezel. Now, can you show the menu bar in full-screen mode? Yes, in System Preferences, you can click Dock & Menu Bar and uncheck \"Automatically hide and show menu bar in full-screen\", which is what I like to do. Now, what happens if you hide the menu bar on the desktop? If you hide the menu bar, it appears there's now extra free space around that notch. Although you can drag windows into this space, they will bounce back and to summon the menu bar, simply hover your cursor at the top edge of your screen. Now regarding the menu bar, what happens if you have too many menus? Extra menus will appear on the right side of the notch, and while you hover through them, your mouse cursor will jump from one side of the notch to the other. Most apps I've tested don't have that many menus, but I did notice it happens with Numbers and with Photoshop. However, there is a compatibility setting. If you select your application in the Finder and open Get Info, you can click the Scale check box. Now when the app is opened, the screen will scale down below the notch. Now I believe with time, software updates will optimize the menus to make them more consolidated on the left side of the notch, or maybe some other creative solution will arise, but, as of now, this is how it works. Now, what about the menu bar icons on the right side, like your settings and status items? As you add more icons, the space between them will shrink, but eventually you will run out of room on the right side, due to the notch, but bear in mind, you can still summon many settings in the consolidated Control Center. On the 16\" MacBook Pro, about 16 icons plus the clock and day, can fit in the space, which is personally more than I would ever need. And keep in mind, you can change your display's scale, which shrinks everything in the user interface and as a result, you can store more icons in the menu bar, if you wish. Now, is there a way to hide the notch completely? Well, it is a physical thing, so you really can't get rid of it, but you can kind of play an illusion that tricks your eye. There's a slew of applications and scripts which will black out the top part of your wallpaper, so it appears like the notch is completely gone. The first one I found is called (No)tch on iTechEverything.com and it works pretty well, and again, because this is an HDR display with mini-LEDs, the black pixels blend in really well with that notch, and it basically disappears. If you have any other questions about the notch or the new MacBook Pros in general, feel free to leave a comment and I will do my best to answer, and subscribe and stay tuned because I do have some other episodes planned about the new MacBook Pros, so those should be a lot of fun. And feel free to stick around for more tech episodes coming out all the time. I love doing episodes about rare and retro tech, new tech, and of course, scam tech. (upbeat electronic music) And hey, if you like this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on. (mouse clicking) (electronic note rings out)",
    "transcript_keywords": [
        "menu bar",
        "notch",
        "menu",
        "bar",
        "MacBook Pro",
        "space",
        "Pro",
        "MacBook Pro display",
        "menu bar icons",
        "menus",
        "MacBook",
        "show menu bar",
        "menu bar extends",
        "top",
        "screen",
        "cursor",
        "display",
        "side",
        "Pros",
        "Pro display"
    ],
    "transcript_entity_values": [
        "Numbers",
        "MacBook Pro",
        "Apple",
        "the entire 2019 16",
        "Dock & Menu Bar",
        "and day",
        "16:10",
        "MacBook Pros",
        "today",
        "Krazy Ken",
        "Control Center",
        "2021",
        "first",
        "one",
        "TrueTone",
        "XDR",
        "MacBook Pro",
        "MacBook Pro",
        "16",
        "Finder",
        "Scale",
        "about 16"
    ],
    "transcript_entity_types": [
        "ORG",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}