{
    "id": "E1rl3UhnTpc",
    "title": "I love this camera, but I’ll never use it",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-07-30T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=E1rl3UhnTpc",
    "category": "Science & Technology",
    "tags": [
        "insta360 one x",
        "insta360",
        "insta 360",
        "one x",
        "360",
        "360 camera",
        "insta 360 one x",
        "camera",
        "camera review",
        "camera hands on",
        "gopro",
        "theta",
        "hero 3",
        "insta video",
        "hero 4",
        "hero 5",
        "footage",
        "action camera",
        "photography",
        "photo",
        "hands on",
        "first look",
        "camera test",
        "video",
        "insta",
        "nikon",
        "fuji",
        "canon",
        "polaroid",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "mkbhd",
        "apple",
        "google",
        "iphone",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 168615,
    "likes": 5363,
    "comments_count": 332,
    "description": "Insta360s One X is a 360-degree action camera that uses dual 200-degree f/2 lenses to create really unique 18-megapixel photos or 5.7K spherical video that can then be exported in 1080, non-360, frames. As a tech optimist, I was ready to be a believer in 360 again, but sometimes more cameras just mean more work, and as a consumer you really have to know exactly what you want to do with this camera before you buy it.  Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2SP3syD",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "This little camera entered my life three weeks ago. It's Insta360's One X, and it's good. You know what? Actually, it's great. And I know what you're thinking: \"Becca, 360's dead.\" But hold on. Take a look at these clips. The One X uses dual 200-degree-angle f/2 lenses to create really unique 5.7k spherical video or 18-megapixel photos. So I set out to test it. And there was literally no better timing for me to do so. I was going to be leaving this crowded, hot, low-key gross city for a beautiful vacation upstate. I mean, I'm talking flowing waters, I'm talking hiking, I'm talking sunsets on the water. Mmm! And a week later, I came back with a whopping two clips off the One X. It's not because it's hard to use or it didn't work. It's actually very easy to use, and it works very well! But this has happened to me before, and I got to show you something. Come on! (upbeat music) And this one. And nice and easy. And watch your head. And then this last step is kind of broken. All right. Got camping stuff, blankets for when people come to visit, all the winter clothes, and here we are. Okay! Here we go. Back up. What is in here? (grunts) This is my tech bin, and it's filled with all of the things I thought were the latest, greatest, and best in tech, and I needed to have them. And then I used them for a few months and never touched them again, which is why they landed in this bucket in my basement. I'm talking about Thetas, I'm talking about a Hero 3. It's all the things I needed to have and then didn't really find them in my daily life. Which brings me back to the One X and those two shots that I took on vacation. Let's first break down the good stuff. The first clip was from the drive up there, and something I noticed right off the bat is that no matter which way the camera was oriented, the image was always oriented upright, which is really helpful when you're just blasting the camera out of a window. It's also really helpful that I can put the camera out in front of the car without having to mount it to the car. I can just hold it out there and bring it back in the car when I'm done. Therefore, I don't have to stop, take off a suction mount, or put a drone up into the air. The second shot I got was from the boat we had to take to get back to our car to go home. For this, I extended the selfie stick as far as I could and just held it off the side of the boat. And you got this amazing shot of the whole side of the boat. Also, the stabilization really impressed me. I mean, this was one of the bumpiest boat rides I have ever taken, and you would never know if you looked at the footage. Now, Insta360's whole goal with the One X is not necessarily to shoot 360 video for VR, which it can do if you want. It's more to get 360 degrees of angles. So take this clip on the boat. I could reframe here or here or here, or just a shot of the boat over here. I mean, you get the point: the possibilities are endless. And everything is super stable because of the internal stabilization, which Insta360 calls \"FlowState.\" Even the audio is passable. (city noise) Let's ride! Ugh, I hate puddles! In regards to those two clips from my vacation, do you notice what's missing? Maybe my entire vacation. You see, One X: it's not you; it's me. And the fact that you're created for a very specific use case and a niche audience, and you lose your novelty rapidly. (upbeat music) Camera manufacturers are getting really good at making products quick and easy to set up. And with the One X, that's no different. But now it's not just point, shoot, share like a phone. There are multiple steps and multiple pieces of equipment. Even after you do quickly shoot something, you're going to have to upload it to your phone, edit it, and then upload it to whatever platform you're sharing it on. They take time! Especially when there are 360 degrees of possible angles. But if you're committed to getting really, really unique, cool footage, the One X's mobile app is full of features. There's certainly a learning curve. But for a mobile app to be able to set key frames, aspect ratios, and export in decent quality with little lag, it's certainly impressive. (cheerful music) In 2016, I bought the Theta S for $300. It's very similar to the One X but obviously much more dated. And from August 2016 to February 2017, I posted 11 photos to Facebook from my Theta. And I did absolutely nothing else with any of the footage. The posts were super well-received, and they're really cool to look at to this day. But the point is: I stopped using this thing in 2017. And since then, it's sat in my camera graveyard. I know, comparing a product that came out in 2015 to the latest and greatest in consumer 360 tech is a stretch. But hear me out. The novelty will wear off. The first shot you get on the One X is going to blow people's minds, including your own. But by the fifth time you do it, not so much. Now, Insta360 has fixed a lot of problems that early-gen models of 360 cameras had. (sighs) But I think it's beyond that. I think it's that 360 was a niche market, and currently, it still is. So back to my vacation. I didn't use the One X because I didn't feel like taking time out of my already tech-involved life to use more tech. And honestly, I do a whole lot of this and not a lot of this in my actual life. I have seen some amazing uses of this tech. Most notably, in helicopters or for action sports. But as an average consumer that won't be so bold in her daily life, the money isn't worth that little use it'll get. There is a group of people watching this video that this camera is going to be perfect for. And for $400, I can't recommend it to you enough. So you see, One X: it's not you. It's just that, as a consumer, you have to know exactly what you're going to use this camera for. Otherwise, it's going to sit in your basement, in a box, under a bike, behind a whole set of latches. All right, now reset. (grunts) I'm sweating! This is my old tech bin. (laughs) It's actually getting heavier!",
    "transcript_keywords": [
        "camera",
        "boat",
        "back",
        "tech",
        "talking",
        "camera entered",
        "vacation",
        "life",
        "shot",
        "weeks ago",
        "car",
        "set",
        "clips",
        "easy",
        "footage",
        "good",
        "video",
        "Theta",
        "lot",
        "point"
    ],
    "transcript_entity_values": [
        "August 2016 to February 2017",
        "2015",
        "11",
        "360",
        "Hero 3",
        "18-megapixel",
        "this day",
        "360 degrees",
        "VR",
        "2017",
        "FlowState",
        "300",
        "Becca",
        "2016",
        "three weeks ago",
        "a few months",
        "two",
        "a week later",
        "5.7k",
        "One",
        "Facebook",
        "Thetas",
        "winter",
        "200-degree",
        "400",
        "second",
        "first",
        "fifth",
        "the Theta S"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "QUANTITY",
        "MONEY",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORG"
    ]
}