{
    "id": "e2PJRp_72UU",
    "title": "LG G6 - 48 Hours Later!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-03-01T04:28:21Z",
    "video_url": "https://www.youtube.com/watch?v=e2PJRp_72UU",
    "category": "Science & Technology",
    "tags": [
        "LG",
        "G6",
        "Smartphone",
        "Apple",
        "LG G6",
        "LG G6 Unboxing and Review",
        "LG G6 Hands on",
        "2017",
        "tech",
        "Unboxing",
        "Review",
        "lg g6",
        "lg g6 review",
        "lg g6 unboxing",
        "android",
        "g6",
        "lg g6 features",
        "best lg g6 features",
        "lg g6 vs",
        "lg g6 vs iphone 7 plus",
        "best android phone",
        "lg g6 vs lg g5",
        "technology",
        "gadgets",
        "lg g6 top features",
        "cool tech",
        "mwc",
        "lg g6 camera",
        "mwc 2017",
        "iphone 7",
        "lg g6 vs iphone 7",
        "lg smartphone",
        "lg g6 camera comparison",
        "krystal key",
        "jonathan morrison",
        "tld",
        "best camera phone",
        "apple",
        "galaxy s8"
    ],
    "views": 761833,
    "likes": 19595,
    "comments_count": 1263,
    "description": "Got my hands on the LG G6 and it's awesome. Enjoy!  The Best Desk Setup for $500!  Monkey Tablet Stand:   JET BLACK AIRPODS!   The LG G6 features a beautiful and completely different 18:9 2880 x1440 Display, Twin 13MP Cameras and Android 7.1 Nougat. Is it one of the best smartphones of 2017?   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/Z5tQrB3cJTw?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "http://amzn.to/2lUrlnP",
        "https://youtu.be/WcSRCuShEmw?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathon here, and over the weekend while I was busy talkin' about desks, you may have seen LG drop their brand new G6. Fortunately, I was able to get my hands on it, check it out, see what the hype is about, and these are my thoughts 48 hours later. Now, for starters with the G6, LG has thankfully ditched the modular design of its predecessor, the G5, and instead gone with a safer all-glass, all-metal body that is super pretty and while it may not be groundbreaking, I really like it. The one thing you do lose with the lack of modularity though, is the removable battery. For me that's never been a huge issue, with the abundance of battery banks and fast charging. For some people that may be a deal breaker, but honestly, I think it is a small price to pay in turn for what yields to be a much better overall phone. Now, as far as the battery goes, internally this is packing 3,300 milliamps, which isn't bad, but it's also not great. I kinda wish LG woulda pushed this a little further, maybe somewhere north of 4,000, but overall, you should still get some really solid battery life with the G6. And more importantly, like the Rock says, - Finally, - wireless charging is here. Now wireless charging is a game changing or revolutionary, and yes, we've seen it on a ton of other phones before, but it's 2017, which means it's about time every phone includes wireless charging. I am looking at you, Apple. So thumbs up to LG on this one. So, while the removable battery may be gone, the one thing power users can still rejoice and hold onto dearly, is expandable storage, via micro SD. You're probably gonna hear some fancy tech talk flowin' around, like, expandable up to two terabytes of storage. Roping people back to reality for a second, the biggest current micro SD card available is one eighth that capacity. Even that is a around 200 bucks, so you can imagine, even if a two terabyte micro SD card does come out, you're gonna have to sell some blue sky to afford it. Beyond that the LG G6 features a USB-C port, which is a thumbs up, because everything should be USB-C. We also still see the classic LG power button and a fingerprint reader on the back, which is a little weird if you've never used it, but once you spend some time with it, it feels really natural. Now, beyond the design changes, I think maybe what stood out most to me with the G6 has gotta be the display, because it's really different than anything you're normally used to seeing. This has a 5.7 inch IPS LCD display with a resolution of 2880 by 1440. And if you're thinkin' to yourself, that math sounds a little off, you, sir, are correct. That's because this isn't your traditional 16 by 9 aspect ratio, it's actually 18 by 9. So what this means is it's gonna be a little longer when you're holding it upright and a little wider when you're holdin' it landscape. It is gonna be a little bit weird when you're watching movies and videos that aren't 18 by 9, and honestly, that is the majority of them out there, but if you can get past the black bars on the side, which really aren't that big of a deal, it's actually kinda cool what you can do with the extra space. For starters, multitasking works really, really well, because essentially, you're getting two perfect squares, one on the top, one on the bottom, which results with more room for activities. Actually, what I found really useful though, is once you're in the camera app, with that extra space up top, you can actually see all your recent photos that you've taken, and again, much like a lot of things you'll start to notice with the G6, it's not game-changing or revolutionary, but it's actually really useful. On top of that, one of the coolest things with the G6 is the fact that you're getting more screen real estate in a smaller overall package. So, for example, here is the iPhone 7 Plus. This is a 5.5 inch phone and side-by-side next to the G6, you can see that it's physically smaller, but has more screen real estate. So that right there, honestly, is kind of a big deal. I've always thought the iPhone 7 Plus was kinda bulky and too big for one-handed use. So the fact that you can fit a bigger screen in a smaller package that feels better in your hand is kind of a win. Beyond that, the bezels, or rather lack thereof on the G6 are a beautiful, beautiful thing. The curved elements are a super-nice touch, and you kinda just wanna stare at it and appreciate the display. So, day two is when I got to spend some time with the camera, or cameras, I should say, on the G6. I gotta admit, though, every time I stare at this thing I cannot unsee the monkey tablet stand. Regardless, though, with this guy you're getting twin 13-mega pixel shooters. The first of which being your standard portrait lens, and the second being an ultra-wide, get-everything-in-the-shot lens. What I particularly like about this in the G6 is the fact that you don't lose any quality jumping back and forth from lenses. Here are a couple pictures, the first of which being the standard lens, I'ma then hop over to the ultra-wide lens, and you can see, for it being really gloomy, overcast, and nasty outside, nearing sunset, both of these do a fantastic job. And you don't really notice any quality difference at all. Overall for the past couple of years, I've really liked what LG's done in terms of smartphone cameras, and with the G6, it is no different here. I definitely do wanna still put it through its paces a little more, but overall so far, I am super impressed with the camera. Now, another bright note with the G6 is the fact that it is now water-resistant. Just doin' some basic things, like tossin' it in water, taking some video, everything worked perfectly. And while those tests weren't crazy by any means, I do have some plans for some more extreme water tests featuring the G6. If that's something you wanna see, make sure you guys drop a like down below. Now, this is a pre-production model, so I'm not gonna dive too deep into the software or the OS. You do get Android 7.1 Nougat, which is definitely a plus, but in terms of really diving deep in there with the software, I'm definitely gonna wait till I get my hands on the final retail model. But I will say, I definitely don't mind LG's skin, it's pretty light and for the most part stays outta your way and there are some things that I actually kinda enjoy, like when you swipe across the screen, the text kind of bounces with you, which is strangely satisfying, but overall, gone is the bastard child G5, here is the G6. And I think it's safe to say LG is back in the smartphone game. Aside from that, thank you guys very much for watching. If you haven't yet, definitely feel free to subscribe. You're probably not gonna wanna miss that water test, and if you're thinkin' to yourself, what is that beautiful setup? You can check out that video here. This is Jonathon, and I will catch you guys later. So day two is when... Oh, come on man, my mouth is frozen shut. I'm like Elsa.",
    "transcript_keywords": [
        "busy talkin",
        "kind",
        "battery",
        "wireless charging",
        "thing",
        "things",
        "charging",
        "removable battery",
        "guys",
        "fact",
        "time",
        "lens",
        "screen",
        "back",
        "phone",
        "camera",
        "wireless",
        "micro",
        "honestly",
        "display"
    ],
    "transcript_entity_values": [
        "two",
        "2017",
        "9",
        "LG",
        "one eighth",
        "5.7 inch",
        "around 200 bucks",
        "the iPhone 7",
        "G5",
        "18",
        "13",
        "48 hours",
        "USB",
        "Apple",
        "the weekend",
        "a ton",
        "micro SD",
        "16",
        "3,300 milliamps",
        "4,000",
        "via micro SD",
        "G6",
        "second",
        "1440",
        "first",
        "one",
        "5.5 inch",
        "Jonathon",
        "the iPhone 7 Plus",
        "the past couple of years",
        "2880",
        "Elsa",
        "Android 7.1 Nougat",
        "USB-C."
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "MONEY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG"
    ]
}