{
    "id": "e50028LAtAo",
    "title": "My Hopes Were Dashed - Kia Niro EV",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-11-01T19:44:10Z",
    "video_url": "https://www.youtube.com/watch?v=e50028LAtAo",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Kia",
        "Kia Niro",
        "Kia Niro EV",
        "Electric Car",
        "EV Car",
        "Hybrid",
        "Car",
        "Auto",
        "Automobile",
        "Auto EV",
        "Hyundai",
        "Hyundai/Kia"
    ],
    "views": 194258,
    "likes": 7357,
    "comments_count": 567,
    "description": "Purchase a Seasonic GX Power Supply at   The Kia Niro EV is based on the hybrid Kia Niro of the same name. Is that a good thing? In some areas, yes, and in others, no. Alex is here to walk you through what's good and not so good.  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:10 Exterior impressions 2:26 Interior impressions 5:01 Seasonic! 5:31 Driving impressions 8:30 Speaker impressions 9:10 C'mon Kia 10:17 Pricing 10:49 Outro",
    "description_links": [
        "https://lmg.gg/seasonicpsu",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "You guys keep on asking us to cover less expensive EVs, so here it is, the new Kia Niro EV, and it is, it's, it's, uh, it doesn't look too bad. With the limited edition, you get this gray C-pillar here that has actual venting, I don't know if it's functional, and I've had so many people coming up to me on the street being like, is that the new R8? Jokes aside, though, I do think it looks good, kind of like a rally car from the 80s that's just gotten a little bit bigger. I particularly like the DRLs that they have here, it sort of looks like a little heartbeat. Let's see if it has a little bit of a frunk here. Oh, okay, that's not too bad. In here, we have enough space to store like a couple valuables, maybe your drugs, but not a whole lot. Coppers can't get my Advil now. Down under the car, we have a 64.8 kilowatt-hour battery that Kia says is good for 407 kilometers of range, and if you want to charge it up, you can do so right here. Here, we've got up to 350 kilowatt fast charging, which will take you from 10 to 80% in 43 minutes, which I have no clue what the charging curve this looks like, but you can go from 10 to 80% in 45 minutes with 100 kilowatt charging, so the math doesn't really math. That said, though, I've had very little trouble. This is a much smaller battery than we see in a lot of EVs, and it is just an efficient little car, so even with level two, I have not had much trouble taking this all the way to 100% daily. Around the side, we've got 17-inch Aero rims that are diamond-cut that look like every single other diamond-cut rim that you can buy in 2023, as well as winter tires. Kia Canada, what were you thinking? Like, I know there's snow on the top of that mountain, but that doesn't mean that we're gonna go there. These poor things, geez. This video was filmed back in July when winter tires weren't necessary. We've also just got normal everyday door handles. Very nice. The design of this makes me just really think that your cool gym teacher is the person that would want it, and the space back here means they will want it even more. So many EVs and hybrids will just give you so little trunk space as they try and just cram batteries wherever. Here, that is not a problem. You can throw your volleyballs, your pylons, your baseball bats, whatever you want back here. It is excellent for this segment. Hopping into the rear seat, it's really quite good back here. There's enough room for real adults. I'm six feet and can easily fit behind myself. There's plenty of headroom. This armrest here feels excellent. We've also got heated seats on this trim, USB-C charging, and a little spot to rest your other arm too. Hopping into the driver's seat, this is sadly where things start to fall apart. The materials in here, like guys, Kia, what were you thinking? There is piano black all up along the door, all along the front. There's just so much piano black in here and all of it is in places that you're going to touch. It's frankly unforgivable. Speaking of unforgivable, these seats, they're, I don't like them at all. I've had a couple of people try them out and they've rated them from fine to absolutely horrendous. And I'm sadly in the later of those. I have a lot of trouble getting comfortable because it feels like they're made for kind of being like up in that SUV sort of seating position, but then your arms don't hit the armrest. So instead you kind of have to go down and the lumbar support feels weird. And there is adjustment for that, but even all the way in, it feels like there's too much. I just don't like them at all. That doesn't say that everything in here is bad. There's lots that's great, actually. These seats are heated and ventilated. The arm rests are nice and squishy and very comfortable, even if I wish this one did come out a bit. The steering wheel is really good. And even though the buttons are piano black, they're at least real buttons and we have nice little toggle switches for volume and such. There's also plenty of stuff that's pretty medium tier in here. Like we do have actual climate controls. They're just hidden behind the media controls. So you can only see one at a time. This touch screen's a little bit of a reach, but at the same time, it's Kia and Hyundai's basic system and it works well enough. You're not gonna complain. And we do have Android Auto and Apple CarPlay, but you do need to plug in no wireless available. Rounding out the medium-ish quality stuff in here is the storage. And here's the only spot that you can put your glasses. There's no like dedicated spot for them. The cup holders are kind of weird, kind of fun. They can fit a water bottle from ltdstore.com. Only the little one. And that's about it. You have a glove box, I guess. Can't take that for granted. Really the only thing these days that you can guarantee does not have piano black is this segue to our sponsor. Seasonic. Thanks to Seasonic for sponsoring this video. Seasonic's Focus GX750W Gold Power Supply is a good choice for mid range systems at a great price. Featuring a fully modular interface paired with a hybrid fan control, which limits fan noise, the Focus GX achieves an 80 plus gold rating, so you know it's reliable and energy efficient. It's backed by a 10 year warranty, and you can learn more about Seasonic at seasonic.com or using the links down below. All right, let's torture someone's tires. We have traction control all the way off and it is clearly still intervening, because good God, this thing drags ass. I realize that it will be improved if you have actual summer tires on this instead of the winters that we have for some reason. But God, it is slow. We have 200 horsepower, 188 foot pounds of torque, which should be pretty reasonable in a 3,800 pound car, but it can just not put any of that down whatsoever. It is disgusting. Now I wasn't able to find an official zero to 60 time from Kia. It seems to range from about six and a half to 7.8 seconds. But what I do know is that I was at a red light yesterday beside a last gen Kona EV, and that thing destroyed me. I could not keep up at all. Also getting destroyed, these poor tires in any corner. Oh, there is no limited slip differential in this thing, and you go into a corner, you hit the gas, and that inside tire is just getting punished. Oh my God, this thing does not handle very well. There are three versions of this car, gas, hybrid, and electric, and it really feels like that the suspension was tuned around the gas version. The electric one, you're gonna have those batteries going all the way back, adding weight to the rear of the car and it kind of just bounces around, like you go over bumps and you can feel the rear of the car bouncing up and down, sort of like the rear dampers are shot. It's strange and disconcerting. Actually, the steering overall is just kind of disconcerting. You don't really get a whole lot of feel through the steering wheel, even though like, if you go over some sort of like uneven spots in the road, it'll sort of want to pull to one side or the other. Once you're above about 80 kilometers per hour, if there's any sort of large undulations or bumps, it sort of just does whatever it wants and the suspension cannot handle the weight at all. It is not a satisfying car to drive. All of that said though, this is not intended to be a driver's car, and it is, if nothing else, pretty quiet in here and relatively simple to drive even if, yeah, kind of sucks. Of course, this being a Korean car, we do have Hyundai slash Pia's safety systems and they are fantastic. This is some of the best adaptive cruise on the market and the lane centering is okay-ish, but really quite good if you're into that sort of a thing. Also, you're able to fully disable the safety systems that you don't want to be there. So if any of them start annoying you, just give them the chomp. Play Crab Rave. Crab Rave by Noise Storm, sure. One thing they did get right though is the sound system. In here, we have the seven speaker system from Harman Kardon. So woofer, tweeter, center, and two in the back. And it is really quite good. It goes down to about 30 Hertz, which is really quite good for a system that doesn't have a subwoofer. And there isn't really anything that is exceptionally strange about it. Like there's a bit of a peak around 40, 50. Yeah, that's fine. Bit of a dip around a hundred. Who cares? Overall, I think it's really quite great. Well, that was fun, but this final bit will not be for you at least Kia. Oh, Kia, why did you give us winter tires in the summer? And why did you not think through who actually wants to buy this thing? Like this is an excellent car for someone that just wants a not very expensive EV that they can cheaply take to and from work that just simply gets the job done. But what it seems like Kia's gone for here is just trying to make it cool in the same sort of way as when your band teacher's like, today we can play Beverly Hills. And you're like, this is cringe. If they had just very simply pulled it back a bit and made the materials in here less fancy looking and more so just kid resistant and taken the time to have these seats be actually comfortable, then I think this could be a real winner compared to like the Bolt EUV or the Toyota Prius. It has way more room in the back and the boot. Just it's not comfortable. Oh, with a starting price that's a bit below 50 grand Canadian and with the heat pump a bit above 50 grand Canadian, it's a pretty tough sell. Depending on your province or state, you will have EV rebates that will bring that down, but it is getting dangerously close to the Tesla Model 3, especially this 55 grand limited trim that we have. And like, I just want the Prius. That really achieves what this car is going for, but just so much better. And this right here, I don't know guys, it needs better seats. Oh, huge thanks for watching. Hit like, get subscribed and just have a great old day and maybe treat yourself to a little bit of a stretch.",
    "transcript_keywords": [
        "Kia Niro",
        "Kia",
        "car",
        "bit",
        "good",
        "sort",
        "thing",
        "back",
        "kind",
        "Niro",
        "tires",
        "seats",
        "feels",
        "piano black",
        "Seasonic",
        "winter tires",
        "gray Cpillar",
        "system",
        "lot",
        "charging"
    ],
    "transcript_entity_values": [
        "Kia Canada",
        "seven",
        "yesterday",
        "Hyundai",
        "EV",
        "100 kilowatt",
        "100%",
        "Hertz",
        "three",
        "One",
        "43 minutes",
        "Play Crab Rave.",
        "407 kilometers",
        "six feet",
        "60",
        "Harman Kardon",
        "Advil",
        "2023",
        "Seasonic",
        "gen Kona EV",
        "the summer",
        "Focus GX750W Gold Power Supply",
        "Pia",
        "188 foot pounds",
        "Toyota",
        "about 30",
        "up to 350 kilowatt",
        "200",
        "summer",
        "winters",
        "about 80 kilometers per hour",
        "80",
        "Apple CarPlay",
        "Beverly Hills",
        "64.8 kilowatt-hour",
        "daily",
        "50",
        "winter",
        "these days",
        "the 80s",
        "Prius",
        "two",
        "Korean",
        "Prius",
        "Canadian",
        "55",
        "10 to 80%",
        "3,800 pound",
        "the Bolt EUV",
        "10 year",
        "17-inch",
        "Kia",
        "Kia Niro EV",
        "45 minutes",
        "about six and a half to",
        "Android Auto",
        "Focus GX",
        "today",
        "zero",
        "July",
        "Aero"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "WORK_OF_ART",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "FAC",
        "GPE",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "FAC",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT"
    ]
}