{
    "id": "E5A7B3WJV5g",
    "title": "Star Trek's Combadge Is Finally Real, But It's Got Some Bugs",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-12-16T00:12:22Z",
    "video_url": "https://www.youtube.com/watch?v=E5A7B3WJV5g",
    "category": "People & Blogs",
    "tags": [
        "star trek combadge",
        "star trek communicator bluetooth",
        "star trek combadge bluetooth",
        "star trek communicator",
        "star trek communicator badge",
        "commbadge",
        "combadge",
        "bluetooth combadge",
        "bluetooth commbadge",
        "bluetooth communicator",
        "review",
        "mrmobile",
        "michael fisher",
        "star trek the next generation",
        "star trek",
        "starfleet communicator",
        "starfleet badge",
        "starfleet insignia",
        "com badge"
    ],
    "views": 391633,
    "likes": 10791,
    "comments_count": 652,
    "description": "To a Star Trek-obsessed kid growing up in the 90s, there was nothing cooler than the combadge, a communicator so small it fit into a Starfleet logo worn on the chest. I amassed quite a collection of combadge prop replicas over the years, but this isnt just another hunk of chrome-plated potmetal: this is a communicator pin that actually works. (Well ... sometimes. And only with the help of your phone.) Join me for the MrMobile review of the Star Trek Bluetooth Combadge by Fametek!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Star Trek Bluetooth ComBadge:   Star Trek Bluetooth Communicator by Wand (TOS Edition):   Star Trek The Next Generation Uniform Hoodie:   Star Trek USS Enterprise backlit schematic:   Star Trek Isolinear Chip Coasters:   Star Trek TNG Communicator Badge (QMX Edition):   Star Trek Combadge (Resin replica):   Star Trek TNG Uniform by Anovos:   Star Trek Voyager/DS9 Uniform by Anovos:   Star Trek TR-590 Mark X Tricorder:     [ABOUT THIS VIDEO]  MrMobile's Star Trek Bluetooth Combadge review was produced following 2.5 days with a retail Star Trek Bluetooth Combadge review unit on loan from ThinkGeek. The device was tested with a Google Pixel, Huawei Mate 9 Porsche Design, Apple iPhone 7 Plus and Microsoft Lumia 950XL. [ThinkGeek also loaned the backlit Enterprise schematic featured in this video.]  Thanks to TrekCore for some of the audio assets used herein:    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Groove Science\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [IMAGE CREDIT]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/c3",
        "http://mrmobile.tech/c4",
        "http://mrmobile.tech/c5",
        "http://mrmobile.tech/br",
        "http://mrmobile.tech/c6",
        "http://mrmobile.tech/c7",
        "http://mrmobile.tech/c8",
        "http://mrmobile.tech/c9",
        "http://mrmobile.tech/ca",
        "http://mrmobile.tech/cb",
        "http://www.trekcore.com/audio/",
        "https://www.premiumbeat.com/royalty_free_music/songs/groove-science",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] A communications device so small that it fits inside a badge you stick on your chest. To a Star Trek kid growing up in the 90s, there was nothing cooler than the ComBadge. And I amassed quite a collection of replicas over the years. But this isn't just another hunk of chrome-plated pot metal or painted resin, this is a communicator pin that actually works. Well, sometimes. I'm Michael Fisher, and this is the Star Trek Blue Tooth ComBadge by FameTek. (cosmic electronic music) (upbeat electronic music) Physically, the ComBadge is a pretty good approximation of the one Picard and crew wore on Star Trek: The Next Generation. The biggest differences are in thickness and in the casing penetrations. You've got one for the speaker, the microphone, the status LED, and the charging jack. It's a shame FameTek couldn't include wireless charging, which would've been much more futuristic. And I also wish the touch action was capacitive instead of a physical switch. That said, there's already a ton of tech packed into this tiny package. And I'm happy to see that this model avoids the gaudy mirror finish that plagues so many of its static contemporaries. It attaches to your clothes with a magnetic backing strong enough for shirts, if not jackets. And it's lightweight enough that I sometimes forget I'm wearing it, which leads to some funny looks in public. When it comes to functionality, the badge has two modes of operation. Cosplay mode keeps the radio turned off, so it just chirps when you tap it. The sound effect is loud, clear, and perfect. (ComBadge chirps) Bluetooth mode is where the communicator does its communicating. As long as your phone or tablet has Bluetooth, which it does, you can pair the devices wirelessly, and the badge will then serve as your speakerphone. A single tap answers or ends calls. A double tap triggers Siri or Google Now, or Cortana, if you're Windows. And if your phone isn't ringing, a single tap will fire up your media player. Given the quality of the onboard speaker, I wish that music feature wasn't there. Even in a quiet room, the speaker sound is pretty thin and raspy. I'd blame the small footprint, but I've heard better sound from smartwatches of similar size. - [Picard] My culture is based on freedom and self-determination. - [The Borg] Freedom is irrelevant. Self-determination is irrelevant. You must comply. - [Picard] We would rather die. - [The Borg] Death is irrelevant. - It's worse on phone calls. Callers said I was understandable, but distorted and peaky. That said, I was able to get the automated system at my bank to understand me without repeating myself, and I was able to hear turn-by-turn directions from Google Maps, while strolling city sidewalks. Lemme tell ya, this kind of practical use out in the real world is just intoxicating if you grew up wishing ComBadges were real. (upbeat electronic music) Sadly, living with that wish means putting up with a bad user interface. Of the nine different commands the ComBadge can execute, seven use the same confirmation sound. That means it's very difficult to know what the ComBadge is doing when you tap it without looking at the LED. That'd be forgivable if the badge only ever made one sound on the show, but there were all kinds of chirps that came outta these things. (badges chirrup with different pitches) And then, there are the bugs. No matter what phone I connected to, the badge regularly dropped the connection on all of them. So, I had to constantly reconnect to keep using it. Oh, and when it is connected? (badge chirps) The badge chirps on its own. (badge chirps) Often, for no reason. (badge chirps) Oh! (man chuckles) Maybe that has something to do with the fact that the battery on mine ran itself dry in less than a fifth of its rated 10-hour uptime. If this were a phone review, this is the part where I'd say, \"Hopefully, these issues can be fixed \"with software updates.\" But there's no apparent mechanism for that. At this point, my biggest hope is that later production batches will perform better. My review unit is one of the first off the line. I really wanted to love this thing. Part of me, the ComBadge-captivated kid from 1991, still does. And he might even spend 80 bucks on it, despite the flaws. But he's dumb with money. And my job is trying to help you spend yours wisely. If you want a badge that looks like this one, there are significantly less expensive options out there. And if you want a Star Trek Bluetooth communicator that works well, there's one of those, too. Sure, it's from 100 years earlier in future history, and it costs a bit more, but it earns its price tag. (upbeat electronic music) To see my review of that communicator, as well as tons of other tech from Trek to today, visit MrMobile on YouTube, and subscribe while you're there. Until next time, thanks for watching, keep your hailing frequencies open, and stay mobile, my friends. (upbeat electronic music) (static crackles) (cheerful music plays in restaurant) (man laughs) One more time. A little less like you want to kill me. (laughs) A little more like, what, you're a weird dude. (laughs)",
    "transcript_keywords": [
        "Star Trek",
        "Star Trek Blue",
        "Star Trek Bluetooth",
        "Trek Blue Tooth",
        "Star Trek kid",
        "fits inside",
        "Trek",
        "Trek Bluetooth communicator",
        "Star",
        "Blue Tooth ComBadge",
        "badge",
        "Trek Blue",
        "Trek kid growing",
        "ComBadge",
        "tap",
        "sound",
        "phone",
        "communications device",
        "Michael Fisher",
        "Blue Tooth"
    ],
    "transcript_entity_values": [
        "a ton",
        "1991",
        "Michael Fisher",
        "Picard",
        "the Star Trek Blue Tooth ComBadge",
        "100 years earlier",
        "the years",
        "10-hour",
        "YouTube",
        "Bluetooth",
        "Trek",
        "the 90s",
        "FameTek",
        "Google Maps",
        "first",
        "One",
        "jack",
        "Star Trek",
        "Michael",
        "ComBadges",
        "two",
        "Siri",
        "nine",
        "ComBadge",
        "Star Trek: The Next Generation",
        "80 bucks",
        "MrMobile",
        "less than a fifth",
        "seven",
        "Cortana",
        "FameTek",
        "Google Now",
        "one"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "DATE",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL"
    ]
}