{
    "id": "E5DlpONIW5M",
    "title": "Samsung Galaxy Watch 4 review: gone Google",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-08-18T14:30:02Z",
    "video_url": "https://www.youtube.com/watch?v=E5DlpONIW5M",
    "category": "Science & Technology",
    "tags": [
        "galaxy watch 4",
        "galaxy watch",
        "samsung galaxy watch 4",
        "galaxy watch 4 review",
        "samsung galaxy watch 4 review",
        "watch 4 review",
        "smartwatch",
        "specs",
        "price",
        "battery",
        "android",
        "fitness",
        "gadget",
        "unpacked",
        "verge",
        "the verge",
        "dieter bohn",
        "technology",
        "tech",
        "smartwatch review",
        "galaxy watch 4 classic",
        "galaxy watch 4 vs",
        "galaxy watch 4 vs classic",
        "wear os 3",
        "android smartwatch",
        "samsung watch 4",
        "samsung watch 4 classic",
        "new samsung watch",
        "galaxy watch 4 features",
        "samsung watch"
    ],
    "views": 2000747,
    "likes": 25268,
    "comments_count": 1812,
    "description": "Samsung has released the Galaxy Watch 4 and Watch 4 Classic. They run Google's Wear OS 3 platform, but they're Samsung watches through and through. Dieter Bohn reviews the watches and explains what's it's like to finally have a good smartwatch for Android users with Bixby.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   You can get the Galaxy Watch 4 here:   Shop The Verge's merch here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://shop-links.co/1749444477664951566",
        "https://shop.theverge.com/",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat electronic music) - Listen up Android users. For years, there has not been a truly great smartwatch for you. But now, Samsung and Google have combined forces to make Wear OS 3 and the Galaxy Watch 4. The thing hopefully we've all been waiting for is finally here. Plus, it has a huge set of new health features. We might finally have a smartwatch that I can recommend to any Android user. Nah. I'm just kidding. This might be Google's OS, but it is Samsung's watch, through and through. It's good, but only if you are living a Samsung life. Anyway, let's review this thing. Actually, these things, 'cause there's two models, the Galaxy Watch 4 and the Galaxy Watch 4 Classic. (upbeat electronic music) Let's just get the basics out of the way. If you haven't heard, Samsung has agreed to ditch Tizen OS for its smartwatches and switch to Wear OS. But, Samsung is contributing stuff to Wear OS now, including watch faces and, you know, actually good hardware with actually fast processors. What that means is that this is a Wear OS watch, but without as many of the problems that either Wear OS or Tizen have had. So, it's faster than any Wear OS watch has ever been, and it has better app support than any Tizen watch has ever had. So, for example, it has Google maps. Plus, now that Google and Samsung seem to actually be, I don't know, trying to make watches happen for Android users, there's more third-party app support coming. In terms of prices and sizing, there is a lot to keep track of. The basic Galaxy Watch 4 starts at $249 for this little 40-millimeter model. You can pay more for a 44-millimeter model. The Watch 4 Classic starts at $349 for slightly nicer hardware, and that's a 42-millimeter model, or you can get a 46-millimeter model, and you can also get LTE on either one. Bottom line, they're really not overpriced for what they offer. The hardware is good. It's not quite to Apple Watch levels of fit and finish, but I like having round watch faces, and I like that you can use any 20-millimeter strap. The regular Galaxy Watch 4 has a touch-sensitive bezel that you can use to scroll around and it's, fine. But the Galaxy Watch Classic has a physical rotating bezel with little clicks on it. That's just so much nicer than swiping around on the watch face. Google and Samsung have also figured out a pretty good core user interface. You swipe up for apps, right for notifications, down for quick settings, and left for tiles. And you can customize all these tiles for the stuff that you care about, which means that you don't have to cram every single complication you want onto the main watch face. Oh, and watch faces. The defaults available on the Galaxy Watch are way better than what you can get on say, Fossil smartwatches. I love this fun bear buddy one. You can also get a bunch of custom watch faces too, if you want. Battery life is good enough. I decided to test the hardest one, so I used the smallest watch, and I've been able to turn on the always-on screen, do some GPS track workouts, receive a ton of notifications 'cause everybody does, and still have just enough to track my sleep that night and then have to charge it in the morning. If you use it more lightly, you could maybe get two days out of it. It's not amazing battery life, but again, it's enough. Bottom line, for the first time in forever, we finally have a solid foundation upon which to build a credible smartwatch for Android users, and only Android, by the way. Unlike older watches, this is not gonna work with an iPhone. But a foundation isn't a whole house, and the software on the Galaxy Watch 4, well, it's the house that Samsung built. (slow electronic music) Most of the default apps on this watch are Samsung apps. And just like on Samsung phones, some of them you can replace with Google stuff, and some of them you really just can't. or you're going to need to wait for hacky solutions. The buttons on this watch are hard-coded to Samsung Pay and Samsung Bixby. And you know, Bixby is improving to the point where it's almost as good as Siri was like, three years ago. So, not great. I mean, look. It can't set multiple alarms yet, if that's any indication. Now, you can use this watch with any Android phone, not just Galaxy phones. But to do so, you need to install Samsung's wearable app on your phone to use it, and then install the Galaxy Watch plugin. And then if you want to use Bixby, you've got to sign in to a Samsung account. And then if you want to use Samsung Pay to pay for stuff, you have to install Samsung Pay on your phone. And then if you want to use the advanced health features, you're gonna need to install Samsung Health. (sighs) I just don't think it's a good choice for anybody that isn't already using a Samsung Galaxy phone. But, if you do live in Samsung's house, you're gonna find that the home gym has gotten a huge upgrade. The Galaxy Watch 4 has all of the standard health stuff. It can do step counting, exercise tracking for 95 different kinds of workouts, GPS, and so on. There's also ECG for checking for Afib, and it can do blood oxygen, just like the Apple watch. Samsung uses that to assist with its sleep tracking feature, which also can use a phone to listen for snoring and then sync all of that data up. It has a bioelectric impedance sensor, which lets you measure body composition stats like body fat percentage, or skeletal muscle mass, and so on. (slow electronic music) So it's a lot. And I think in a proper context, all of these health features are useful, but that context is very complicated. Like other wrist-mounted health sensors, this thing has given me troubling readings that I know aren't accurate. Like it said I had atrial fibrillation once when I didn't. And similarly, it's done a similar thing that the Apple watch does, which is provide low blood oxygen readings, when really it's fine. As long as you fully understand what's happening when you turn these sensors on, you can get some use out of all of this quantified health stuff, but the context matters, and these are not diagnostic tools. Don't use them that way. That also goes for the new body composition tool that works like some smart scales do. It sends an electrical signal through your body to measure the impedance and use that to determine the percentage of body fat and water that you've got in here. But as Nicole Wetsman has written on the verge.com, that accuracy can be all over the place. Now, what could be useful for all of these metrics is trendlines over time. But if you're gonna do that, that means you're committing yourself to using Samsung Health. Now, if you're a Samsung user and intend to stay one, that'll be fine, but you should know that Samsung Health's privacy policy is not very reassuring. It says that Samsung can obtain data like heart rate, body fat, glucose, blood pressure, oxygen saturation, information related to your menstrual cycle, sleep-related information, and more. Yikes. I asked Samsung and a spokesperson assured me that all of this information is end-to-end encrypted and protected by Samsung knox, and that Samsung will only be able to access it if you choose to share it, but it's a lot. And if you accidentally do opt-in, Samsung could use it for anything from creating customized workouts for you to improving the app, to marketing promotions. Apple does a better job of explaining that it cannot access your health data. It just doesn't have the keys. And I do trust Samsung way more than I trust a lot of other companies that make, you know, fly by night wearables, but, wow, they need to do a much better job explaining their privacy and encryption policies. Now if you are willing to give Samsung Health a go, its features and functionality are surprisingly robust. Its workout tracking for biking, for example, has as much detail as I could probably ask for. It has all sorts of stats and geo-tracking and heart zones and whatever. It also can track your sleep, it can do stress level stuff, and it has social features to let you compete with your friends and family if they also happen to be Samsung Health users. Now in terms of accuracy, I compared it to an Apple Watch and a Garmin bike computer with a little, you know, chest-mounted heart rate monitor, and the Galaxy Watch 4 was basically the same for heart rate and speed, pretty good. But it was consistently off for distance by about 5%. Really my biggest complaint is that Samsung Health's third-party app integration is weak. It's pretty much just Strava and then nothing else that I would want. And again, there's just the fact that you are committing to using Samsung Health for a long time, and trusting Samsung to keep your data private. Just like with Apple health or Fitbit or Google Fit or whatever, committing to a health-tracking platform means a little bit of lock-in. Okay. After all that, here's my take on the Galaxy Watch 4 and the Galaxy Watch 4 Classic. I like them. It's the first time in forever that I have actually enjoyed using a smartwatch with an Android phone, but only because the Android phone that I was using them with was a Samsung phone, and for that time I lived entirely in Samsung's house. If you don't want to walk through that door, this isn't the watch for you. We have been waiting for a long time and unfortunately, I have no idea when there's going to be a Wear OS watch that doesn't lock you in to Samsung's house. If you're a Samsung user, go for it. If you're not, keep waiting. Hey everybody, thanks so much for watching. I wanted to get the watch review out as soon as I could 'cause its the new platform, but I am also reviewing the Galaxy Z Fold 3. So if you've got questions about that folding phone, let me know down in the comments and ill try and answer them in the next review",
    "transcript_keywords": [
        "Galaxy Watch",
        "Samsung",
        "Watch",
        "Samsung Health",
        "Galaxy",
        "Galaxy Watch Classic",
        "Samsung Galaxy phone",
        "Apple Watch",
        "health",
        "Samsung Pay",
        "Samsung Galaxy",
        "watch faces",
        "Samsung watch",
        "Android",
        "Wear",
        "Samsung Health users",
        "basic Galaxy Watch",
        "Samsung house",
        "install Samsung",
        "Google"
    ],
    "transcript_entity_values": [
        "this little",
        "42-millimeter",
        "three years ago",
        "Fossil smartwatches",
        "Android",
        "third",
        "the Galaxy Watch 4",
        "Apple",
        "Samsung knox",
        "the Galaxy Z Fold 3",
        "ECG",
        "40-millimeter",
        "249",
        "Garmin",
        "LTE",
        "Bixby",
        "the Galaxy Watch Classic",
        "20-millimeter",
        "Google",
        "the Galaxy Watch 4",
        "Galaxy Watch 4",
        "Strava",
        "Wear",
        "Samsung Galaxy",
        "Tizen",
        "years",
        "Wear OS",
        "95",
        "an Apple Watch",
        "the Galaxy Watch",
        "Samsung",
        "349",
        "The Galaxy Watch 4",
        "Samsung Health's",
        "Siri",
        "two",
        "Galaxy",
        "Galaxy Watch 4",
        "46-millimeter",
        "Afib",
        "Nicole Wetsman",
        "Apple Watch",
        "Galaxy Watch",
        "that night",
        "Fitbit",
        "a ton",
        "Samsung Health",
        "the Galaxy Watch 4 Classic",
        "first",
        "iPhone",
        "44-millimeter",
        "Samsung Bixby",
        "about 5%",
        "Wear OS 3",
        "two days"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE"
    ]
}