{
    "id": "E6umTIBZub8",
    "title": "How a superhero movie was finally nominated for Best Picture",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-02-21T15:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=E6umTIBZub8",
    "category": "Science & Technology",
    "tags": [
        "black panther",
        "black panther oscars",
        "oscars",
        "black panther best picture",
        "marvel",
        "chadwick boseman",
        "black panther oscar",
        "oscars 2019 nominations",
        "best picture",
        "marvel studios",
        "dark knight",
        "the dark knight",
        "academy awards",
        "oscars 2019",
        "2019",
        "the oscars",
        "oscar nominations",
        "awards",
        "golden globes",
        "actor",
        "actress",
        "movies",
        "film",
        "entertainment",
        "movie",
        "superhero",
        "superheroes",
        "superhero movie",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "did you know",
        "need to know",
        "verge",
        "the verge"
    ],
    "views": 127505,
    "likes": 1954,
    "comments_count": 294,
    "description": "Black Panther was nominated for Best Picture and that's a big deal. 10 years ago, The Dark Knight was snubbed for a Best Picture nomination. It was a huge blow to superhero fans, highlighting the gap between popular films and award-winning prestige films in a way that mobilized movie-goers. So what happened between 2009 and this years Black Panther nomination? To understand, we have to look at The Big Picture.    Read more here:   Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Listen to our podcasts:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2SQuvg1",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Black Panther just got nominated for a Best Picture Oscar, and that's a really big deal. Just 10 years ago, The Dark Knight was snubbed for a Best Picture nomination. It was a huge blow to superhero fans, highlighting the gap between popular films and award-winning prestige films. The public outcry led the Academy of Motion Pictures to expand its Best Picture nomination category from five films to 10. Still, it took 10 years before a superhero movie found its way into the Best Picture arena. - I am not dead. - So what happened between 2009 and this year's Black Panther nomination? To understand, we have to look at The Big Picture. The term \"blockbuster\" as a reference to a hit movie dates back to the 1940s, but Steven Spielberg's 1975 thriller Jaws gave it a whole new definition. The summer it was released, people lined up around city blocks trying to get tickets. It dominated the box office all summer. In May 1977, Star Wars: A New Hope was a similarly huge hit. The era of the summer blockbuster had arrived. Every major studio wanted a piece of the summer action. The new breed of blockbusters didn't often compete for Best Picture at the Oscars, but they would win things like Best Visual Effects or Costume Design. But summer blockbuster season is starting to disappear. Now, big-budget escapist spectacles come out all year round. 2019 is poised to be one of the biggest blockbuster years, with an adventure-packed calendar that spans all 12 months a lot of which are superhero films. But it wasn't always this way. Since the 1980s, superhero titles have increased exponentially, and they only first started appearing en masse in the early 2000s. X-Men, The Hulk, and Sam Raimi's three Spider-Man films all skyrocketed to the top of the box office, breaking records and setting a new tone for what blockbuster films could do for studios. Disney, seemingly realizing what was happening to the calendar year, made some major investments. It acquired Pixar, Marvel Studios, and Lucasfilm over the course of six years. Warner Brothers also shifted its focus toward grittier, more openly adult-focused superhero movies. By the time The Dark Knight rolled around in 2008, superhero movies were reaching a wider and more dedicated audience. It was the first time the Academy was forced to take notice of superhero movies as Best Picture contenders. People largely consider the Dark Knight conundrum as a snub because of the intense fan backlash that arose. The Dark Knight was hailed as one of the most provocative films of 2008, by both critics and fans, who were used to cutesier, more colorful movies. - Why so serious? - The Dark Knight turned the genre on its head, and kick-started a conversation about what a superhero movie could achieve. Marvel Studios has released 20 movies since then, and its immense financial success has pushed Warner Brothers, Sony, and Fox to compete. Superhero movies now own every calendar spot, meaning studios have to book openings during the offseason as well as the summer. Black Panther, the first superhero movie with a majority black cast, opened in February 2018 and immediately started breaking box-office records. As superhero movies overtook film culture, it became a wake-up call for the Academy, which was already being criticized as ignorant. Conversations around promoting diversity in mainstream films has become a talking point around the Oscars in recent years. Movements like \"Oscars So White\" in 2016 when no black actor, writer, or director was nominated in major categories forced the Academy to radically change its own makeup. The organization added a wave of new members, and looked outside its usual nomination patterns. But Black panther wasn't a shoo-in. With the Oscars' steady and dramatic decline in viewership and anti-Oscar social media campaigns, the Academy knew it was time for another change. It tried launching a \"Popular Film\" category to acknowledge fan favorite movies, without having to place them in the Best Picture category. It was similar to when the Best Animated Feature category was introduced. But the Popular Film announcement didn't go as planned. The backlash was so immediate that the Academy backed down almost instantaneously. People considered Black Panther one of the best movies of the year, not just the most popular. They wanted to see it celebrated as such. It took 10 years, but the Academy realized that if they continued to ignore superhero movies, they'd be ignoring modern movie culture as a whole. They were celebrating a version of Hollywood that average moviegoers weren't participating in. They risked looking elitist. Black Panther, which was a monumental success and one of the most culturally groundbreaking movies of the year, became the ideal movie for the Academy to regain its relevance. But superhero movies aren't the only new competition for Best Picture. Netflix also just got its first Best Picture nomination with Roma. And actually, the streaming service released Bright with Will Smith, trying to make a streaming version of a summer blockbuster. Disney plans to launch its own streaming service later in 2019, and will be investing in more big-budget content, and so will competing services like Amazon, Hulu, and Netflix. Prepare for a whole lot more superhero buzz at the box office, and on your laptop, and at awards shows. Black Panther is just the start. It took decades of superhero movies to get here, but this may be the beginning of something much bigger. Thanks for watching. And if you like this video, you'll probably like our other Big Picture video on how Disney is actually forcing Netflix to change. And as always, like and subscribe.",
    "transcript_keywords": [
        "Black Panther",
        "Picture",
        "superhero movies",
        "Dark Knight",
        "superhero",
        "movies",
        "Picture nomination",
        "Big Picture",
        "Academy",
        "Black",
        "Panther",
        "films",
        "year Black Panther",
        "Black Panther nomination",
        "movie",
        "summer",
        "Dark",
        "Knight",
        "Motion Pictures",
        "Picture Oscar"
    ],
    "transcript_entity_values": [
        "Jaws",
        "the 1940s",
        "the calendar year",
        "Best Visual Effects or Costume Design",
        "May 1977",
        "one",
        "February 2018",
        "summer",
        "Best Picture",
        "all 12 months",
        "Oscars So White",
        "Will Smith",
        "three",
        "the summer",
        "between 2009 and this year's",
        "Disney",
        "Black Panther",
        "the Academy of Motion Pictures",
        "the early 2000s",
        "Fox",
        "Hollywood",
        "Academy",
        "Oscars",
        "Hulk",
        "years",
        "Spider-Man",
        "Hulu",
        "20",
        "The Dark Knight",
        "Sam Raimi's",
        "The Big Picture",
        "Steven Spielberg's",
        "2016",
        "Popular Film",
        "Pixar",
        "Lucasfilm",
        "2008",
        "Amazon",
        "six years",
        "Oscars",
        "Just 10 years ago",
        "2019",
        "Warner Brothers",
        "Sony",
        "five",
        "The era of the summer",
        "Netflix",
        "10 years",
        "decades",
        "first",
        "all summer",
        "recent years",
        "Best Picture",
        "the 1980s",
        "1975",
        "Marvel Studios",
        "the year",
        "the Best Animated Feature",
        "Black Panther",
        "Roma",
        "10"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "FAC",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL"
    ]
}