{
    "id": "e7fe_LXK93E",
    "title": "Why Is EVERYONE Buying This Soundbar??? - Bose TV Speaker",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-02-21T17:59:47Z",
    "video_url": "https://www.youtube.com/watch?v=e7fe_LXK93E",
    "category": "Science & Technology",
    "tags": [
        "Bose",
        "TV Speaker",
        "Soundbar",
        "Vizio",
        "Sony",
        "5.1 Surround",
        "Hi-Fi",
        "Audio",
        "Dialogue",
        "Hollywood",
        "Movie",
        "Home Theater"
    ],
    "views": 2257502,
    "likes": 57022,
    "comments_count": 4562,
    "description": "Check out the Logitech G502 X Plus at Best Buy:   Save 10% and Free Worldwide Shipping at Ridge by using offer code LINUS at   Hollywood keeps delivering high-end audio to your living room, but it's useless unless you have the right sound system to drive it. Can this $280 soundbar from Bose give you the clarity you crave when it comes to indecipherable dialogue? Or is it overpriced and not worth your money?  Discuss on the forum:   Buy a Bose TV Speaker:   Buy a Bose Bass Module 500:   Buy a VIZIO 2.0 Sound Bar:   Buy a LG S40Q Sound Bar & Wireless Subwoofer:   Buy a Polk Audio Sigma S2 Sound Bar & Wireless Subwoofer:   Buy a Sony HT-S400 Sound Bar & Wireless Subwoofer:   Buy a Samsung HW-B550 Sound Bar & Wireless Subwoofer:   Buy a VIZIO V-Series 5.1 Sound Bar & Wireless Subwoofer:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:21 Modern TVs 2:20 Fire TV vs Bose TV Speaker 5:00 Bass Module 6:30 Amazon Reviews 9:00 Other Options 10:15 Conclusion 11:42 Outro",
    "description_links": [
        "https://lmg.gg/JpT7q",
        "https://www.ridge.com/LINUS",
        "https://linustechtips.com/topic/1489678-why-is-everyone-buying-this-soundbar/",
        "https://geni.us/kbqOl",
        "https://geni.us/954tAxl",
        "https://geni.us/FMMfWSI",
        "https://geni.us/0s4wBI3",
        "https://geni.us/WSFfh",
        "https://geni.us/B12sUq",
        "https://geni.us/jxo9",
        "https://geni.us/852Rny",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- I wouldn't describe myself as a conspiracy theorist, but when almost three-quarters of people report difficulty understanding dialogue in their favorite TV shows and movies, and the entertainment industry's response is basically, \"Watch it in the theater or get your own theater.\" Red flag. - I think you've lost touch. Everyone uses subtitles now, old man. - No, I reject that. It's the mixers who are wrong, and I've got the solution. While sound bars may have a reputation for being either outlandishly expensive or garbage or often some combination of the two, a goldilocks zone does appear to exist where you can get better dialogue quality and a wider sound stage without breaking the bank. And surprisingly, the most popular one on Amazon at the time of writing is from Bose. Bose and affordable aren't words I would normally put together. So, then why the (pop dance music) are you all buying this soundbar? - Ah, the better to hear this segue to our sponsor, deary. - The Ridge. The Ridge wallets are high quality, compact, minimalist wallets designed for convenience and practicality. Follow the link below and use code Linus on checkout to save 10% off your purchase and get free shipping. (upbeat electronic dance music) - You might think that anyone spending a thousand dollars on a TV would have some kind of budget set aside for an audio system but speaking from experience, it's quite the opposite. They're expecting that for that kind of money the built-in speakers should be decent already. Unfortunately, the industry trend towards thinner and thinner displays means there's simply not anywhere to put speakers. Like where would these speakers go in this TV? Now, at the very high end, there are creative solutions to this that involve vibrating the entire surface of the display and whatnot, but most people aren't buying those kinds of solutions and the ones that are really especially ought to be using external speakers and soapbox. So, let's focus on the mainstream then, we're gonna be pairing our top selling sound bar, the Bose TV speaker, with another best seller that we're gonna get to in another video, this 43 inch Amazon Fire TV. (wheels screeching) If I didn't know how good this movie is supposed to sound I might consider this - You'd think it sounds okay - Acceptable. Yeah. - It's fine. I can barely hear his dad. - There isn't even any background music right now. I can barely make anything out. - Yeah. - The sound quality is not great, but that's okay. We can fix that. Surprisingly, the box for the Bose TV speaker contains only an optical cable to connect to your TV. So, we saw some complaints from people who were upset that they couldn't use E Arc without a trip to the local Walmart. Fortunately for us, we have some HDMI cables lying around and we would definitely recommend going this route since E Arc should allow us to use our TV remote for soundbar volume control and allow our devices to automatically power up and power down together. As for the rest of the IO, we've got auxiliary in, a service port, a base port, we'll talk more about this later, and power. Now, this unit doesn't have wifi, meaning that you can't connect to the Bose app, but it does have Bluetooth if you want to use it with a mobile device like your phone. It's Bluetooth 4.2 though, which means limited range compared to more modern implementations. I'm pretty sure there's supposed to be bass here. - [David] It's gonna come in. - No, but like there's supposed to be like subbass. Now here they're supposed to be bass. Bose, yes. Bass, no - [David] Oh. (pop dance music) - Oh, and that is not the mark of a good speaker. When the bass finally manages to hit the rest of the sound ducks or kind of sounds like it's being suppressed. We also found that there was a lot of compression at high volume on bass heavy songs. Pretty good for music at low or medium volumes, bad at high volumes. It's kind of like a giant Bluetooth speaker. (train horn blows) It really struggles with the rumble of the train. It's way better. On the built-in speaker on this TV, I couldn't tell she spoke a different language there. (David laughs) It was just all unintelligible to me, and I get it, if you're looking to understand dialogue better I could see people bringing this thing home and compared to their onboard thinking, man, this is what I've been missing out on, this thing's flipping amazing. And if you're still having trouble hearing, the dialogue enhancer definitely works doing even more to, well, enhanced dialogue. But it does cost you in other areas, particularly the little bit of bass that there already was gets suppressed even further. It's not a home theater in a box, but absolutely good enough for someone who just wants to hear what people are freaking saying. The solution to most of my problems seems to be a Bose Bass Module. - Bass Module? You mean a subwoofer? - Ah, no. Remember that bass port we saw before? Well as it turns out, Bose locks down their soundbars to prevent you from using a third party powered sub. I mean, I'm sure they have some kind of brand BS ensuring a consistent experience justification for this, but we need only look as far as the price of Bose's proprietary base modules to find out that this just comes down to milking you for more money once you're locked into their ecosystem. So, you can eat a Bose. At least it's stylish though. Like the all new ltt tracksuit from lttstore.com. It's Polycotton blended. God, it looks good. Bose has a pretty established look at this point. Black, mesh, with the Bose logo on top. If you've seen one, you've kind of seen most of them. The finish on the plastic feels nice though. The whole device is small and sleek and at just over two point two by four by 23.4 inches and four point three pounds, while mounting it should be a breeze. Though I suspect most people are just gonna set it down on their console like we did, especially since the paid mounting service costs almost as much as the soundbar itself. I'm not gonna lie, this is about the least impressed that I have ever been by a why are you all buying this thing product? We're gonna talk about some better options in a bit here. But first, let's take a break from what I think and talk about why you guys keep buying these. With over 7,500 ratings on Amazon this soundbar averages 4.5 stars with a whopping 74% of you giving it a full five stars. In spite of my complaints, y'all are pretty happy with it. Let's start with the positive then. Our five star crowd loves how easy it is to set up, how well the dialogue enhancer works, especially for seniors or those who are hard of hearing, and they love how much of an upgrade it is over their TV speakers. Moving on to the four star gang, they mostly agreed, actually, saying that it bumps up the perceived volume, that having both arc and optical connections is nice, and that the sound quality is good. However, even in the four star crowd almost every review comes with a caveat of some sort. There's an included optical cable, but not HDMI, it's easy to set up, but the sound is mediocre. It's an improvement over my last soundbar or my TV but it's not as good as I was expecting considering that it's nearly $300 and it comes from Bose, a well-known company. And as we keep moving down we find some pretty reasonable complaints from, in my humble opinion, the people who probably know home audio a little bit better than the wow, it's better than nothing, five stars, crowd. For example, we saw criticisms about the lack of EQ settings other than dialogue, criticisms about the poor performance at high volumes and the lack of bass. We saw critiques of the lackluster remote. That is all stuff that we experienced and I think people were pretty fair about it. What we didn't experience though was overheating. Whatever our experience with our unit, though, it's frankly alarming when this many reviews mention it being too hot to touch, smelling like burnt plastic and leaving marks on things. Some units even broke seemingly prematurely with the customer suspecting heat to be the culprit. But then even if that wasn't a problem should you buy this thing? Well, if Bose was doing more than just making dialogue more intelligible I'd have no problem with it. I'd in fact love to see a version of this product that works with third party accessories or that can be expanded in the future using it as a center channel and a surround config or something like that. But as it is, it's a dead end entry level solution at a price that just doesn't make any sense. I'm not even trying to be one of those home theater setups are better than a soundbar at any price bros. But for $280, come on, you could pick up almost literally anything and get equally simple setup and dialogue enhancement. I mean, Amazon knows this Vizio 2.0 is a better basic option and it costs only $69. Nice. Not that I would necessarily even recommend the cheapest solution. A good sound bar is still going to sound better than whatever your next TV and your one after that is gonna be and costs only a little bit more. The LG S40Q for example, or the Polk Signa S2 are only about $130 and $160 respectively, and both of them come with a base module in the box for that price. - So, subwoofer. - Exactly. And if you were gonna drink the Bose Kool-Aid anyway, you could spend the same amount and get something much better. (camera bleep) And get something much better. I mean, we haven't gotten a chance to try all these yet. Stay tuned because the Labs home theater testing room is gonna be coming online later this year. But on paper, the Sony HT-S400, Samsung HW-B550, and Vizio V-Series are all name brand products that are on sale right now and match or beat our Bose soundbar while also including a base module. (camera bleep) - Subwoofer - Right. Bose The reality is then if you buy the Bose TV speaker there's a good chance, about 74%, or whatever it works out to, that you are going to be happy with it. But our job isn't to tell you what might make you happy. It's to help you spend your money wisely. And I just don't think the Bose TV speaker holds up especially if you spent more than fire TV money on your display. We tried it, for example, on an S95B, and while the dialogue enhancer did improve over the stock speakers, it was not a massive improvement and it came at the cost of everything but the dialogue. Unusual conclusion today, but do yourself a favor and don't follow the crowd when it comes to sound bars. Make sure to get something with a sub if you want to feel your favorite content. Kind of like how you're gonna feel this segue to our sponsor. - Best Buy and today's featured product the Logitech G502 X Plus, the newest version of the Logitech G502 now has the feature everybody wants, RGB. Logitech's Light Sync Technology allows the fully customizable eight LED array to adapt to your play style with startup and power down effects and active battery optimization by detecting when you're using the mouse. The mouse itself features 13 programmable buttons along with a DPI shift button, which offers a maximum resolution of 25,000 DPI thanks to Logitech's Hero 25K sensor. Looking to take your mouse on the go? The G502 X Plus has up to five memory profiles that will remember your settings no matter what device you connected to. So, check out the Logitech G502 X Plus at the link down below. - Thanks for watching. We've got a whole series of these. Why are you guys buying this stuff thing? So, maybe check them out if you like this one or maybe check out the last time we did a soundbar. The Vizio SB2920 C6. It fared a lot better.",
    "transcript_keywords": [
        "Bose",
        "report difficulty understanding",
        "sound",
        "difficulty understanding dialogue",
        "people report difficulty",
        "dialogue",
        "bass",
        "Bose Bass Module",
        "good",
        "speaker",
        "entertainment industry response",
        "people",
        "soundbar",
        "speakers",
        "kind",
        "conspiracy theorist",
        "response is basically",
        "report difficulty",
        "difficulty understanding",
        "Watch"
    ],
    "transcript_entity_values": [
        "Sony",
        "Bass",
        "four point three pounds",
        "only about $130 and $160",
        "43 inch",
        "Bose",
        "four",
        "7,500",
        "Ridge",
        "first",
        "LG",
        "13",
        "23.4 inches",
        "Bose",
        "S95B",
        "just over two point two",
        "eight",
        "Amazon Fire TV",
        "Vizio",
        "RGB",
        "Bose",
        "HT-S400",
        "10%",
        "4.2",
        "C6",
        "4.5",
        "a thousand dollars",
        "David",
        "today",
        "up to five",
        "five",
        "25",
        "74%",
        "almost three-quarters",
        "Amazon",
        "only $69",
        "Labs",
        "Samsung",
        "Bose Kool-Aid",
        "Polycotton",
        "nearly $300",
        "Walmart",
        "Logitech",
        "Light Sync Technology",
        "Bose TV",
        "280",
        "later this year",
        "third",
        "Linus",
        "about 74%",
        "25,000",
        "two",
        "IO"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "GPE"
    ]
}