{
    "id": "e8jbLgXLz4Q",
    "title": "Sony Aibo Review: How Much Is That Robot In The Window?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-07-12T12:09:07Z",
    "video_url": "https://www.youtube.com/watch?v=e8jbLgXLz4Q",
    "category": "Science & Technology",
    "tags": [
        "sony aibo review",
        "sony aibo ers-1000",
        "sony aibo review 2019",
        "robot dog review",
        "social robot 2019",
        "mrmobile",
        "michael fisher",
        "jibo",
        "vector",
        "sony"
    ],
    "views": 154936,
    "likes": 5237,
    "comments_count": 286,
    "description": "In July of 1999, Sony gave tech lovers the perfect pet to kick off life in the new millennium: the first robot dog for the home. AIBO stood for Artificial Intelligence roBOt, but when pronounced in Japanese the word also means buddy, pal or accomplice. And even though it cost $2100 and was only sold on the internet  again, back in 1999  Sony sold 5000 Aibos in its first week.  Flash forward exactly 20 years  and the newest Aibo, model ERS-1000, just clomped his way into my home. Hes sophisticated, smart, and so lifelike hell wag his way right into your heart which is exactly why those who buy him should be careful. After all, the last time we talked about social robots, I told you that you shouldnt buy them. See if Aibo is any different  in the Sony Aibo Review from MrMobile!   [SPONSOR]  This video contains a sponsored advertisement from BMW USA. Be sure to follow @theMrMobile on Instagram so you dont miss live coverage of the Drone Racing League event in Brooklyn, NY on July 12, 2019!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SONY AIBO REVIEW]  MrMobile's Sony Aibo Review for the model ERS-1000 Aibo was produced following three weeks with an Aibo ERS-1000 review unit on loan from Sony. Sony was not provided an advance copy of this video, and no compensation was requested or provided.   [PRODUCTS IN THIS VIDEO]  Sony Aibo ERS-1000 [USA]:    [LINKS: PRINT]  Why did Sony kill off its robot dog? (The Guardian)   Sony New York Preview (reviewsonline)   There is one man, and only one man, who can still repair your robot dog (Vice)   Sony puts Aibo to sleep (Cnet)   Sonys Robot Dogs Are Dying A Slow And Heartbreaking Death (Gizmodo)   A Smart Dog with Megabytes (New York Times)   Aibo (IEEE Guide to Robotics)    [LINKS: VIDEO]  Second Generation Aibo Commercial (JODYN)   Aibo - the original commercial from 1998 (Nao and Cozmo Adventures)   Sony Aibo Robot Dog commercials mashup (gigatoob)   New story with aibo (aibo Japan)   Inside the mind of a vintage Sony Aibo robot (Janus Cycle)    Sony AIBO ERS-110 Silver (Preown Aibo)    [SOCIALIZE]        [MUSIC]  Jello Shot by Wolves, available at Premium Beat:    Tangerine Daydream by GG Riggs, available at Premium Beat:    True Persistence by Cymatix, available at Premium Beat:     [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #sonyaibo #aibo #robots #socialrobots #robotdog #ers1000",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "https://us.aibo.com/",
        "https://www.theguardian.com/technology/2006/feb/02/sony.gadgets",
        "http://www.reviewsonline.com/sony9901.htm",
        "https://www.vice.com/en_us/article/8qxk3g/there-is-one-man-and-only-one-man-who-can-still-repair-your-robot-dog",
        "https://www.cnet.com/news/sony-puts-aibo-to-sleep/",
        "https://gizmodo.com/sonys-robotic-dogs-are-dying-a-slow-and-heartbreaking-d-1712160637",
        "https://www.nytimes.com/1999/05/13/technology/a-smart-dog-with-megabytes.html",
        "https://robots.ieee.org/robots/aibo/",
        "https://youtu.be/uA7HrZX2ViE",
        "https://youtu.be/DGacg1zuB00",
        "https://youtu.be/iu8OycliyIU",
        "https://www.youtube.com/watch?v=sJciRIZQTg4",
        "https://www.youtube.com/watch?v=I0_ZJbT2OwA",
        "https://www.youtube.com/watch?v=y6gYvwU_o1g",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.premiumbeat.com/royalty_free_music/songs/jello-shot",
        "https://www.premiumbeat.com/royalty-free-tracks/tangerine-daydream",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://www.mobilenations.com/external..."
    ],
    "transcript": "- In July of 1999, Sony gave tech lovers the perfect gift to kick off life in the new millennium, the first robot dog for the home. AIBO stood for Artificial Intelligence Robot. But when pronounced in Sony's native Japanese, the word also means buddy, pal, or more sinisterely, accomplice. And even though it cost $2100 and was only sold on the internet, again, back in 1999, Sony sold 5000 AIBOs in its first week. Flash forward 20 years and the newest AIBO just clomped his way into my home. Hi. He's sophisticated, smart and so lifelike, he'll wag his way right into your heart. Which is exactly why those who buy him should be careful. (mid tempo synth music) What do you think? My AIBO review sample came from Sony with an unexpected treat. The previous reviewer's profile hadn't been cleared, so he already had a sex, male, a name, Trotter, and a glimmer of personality. See AIBO's designed to learn, over time, over a period of months, even years to complete the illusion of a puppy that gradually grows into a dog. Trotter is still young, with what seems to me like only a few weeks of cumulative experiences. So his behaviors are unpredictable. It's clear he hears and understands the commands I give to him, but sometimes he disobeys. What are you growling for? No growling! (yapping) Bad! OK, sit down. (yapping) Sit down! (yapping) If this sounds frustrating, (laughing) yeah it can be. But that's by design. Like a real puppy, Trotter is difficult because he hasn't been trained yet. It's a different kind of frustration than when Jibo can't understand a verbal cue, or Vector constantly drives himself off a table. Keep those robots in mind folks because I will be coming back to them. AIBO is in some ways a more pure form of social robot than I've used because he hasn't had any practical skills grafted on, at least not yet. This is a robot made purely to be your pal, not to tell you the weather, or wake you up in the morning, at least not when you want him to. (yapping) He barks, he wags, he trots, oh I just got that! When his two hours of battery charge are exhausted, he's designed to walk back to his charging pad on his own which he accomplishes about half the time. The wide angle camera in his nose and the time of flight sensor in his mouth give him vision and depth perception so he can play with his bone and ball and avoid falling off high places most of the time. Nice! When I said this robot is sophisticated, I mean it. You see this camera at the root of his tail? That will eventually help AIBO map the ceiling of your home to help him navigate using a technology called SLAM popularized by robot vacuum cleaners. AIBO's eyes are OLED displays, expressive and playful. And they don't really flicker like this, that's a trick of the camera. AIBO has capacitive and pressure sensors in paws, head, and back so Trotter can tell the difference between a pat and a whack. And four microphones too, so he can discern between vocal praise and vocal scolding. (yapping) Hi! (yapping) Hi! (laughing) All this input from you he feeds to his servers in Sony's cloud to apply those lessons and grow his personality. And therein lies a problem. Folks I just published a video titled \"It's time to stop buying social robots.\" The reason I took that stand is because they're just too good at convincing us softie humans to welcome them into our hearts which means they're almost guaranteed to break our hearts when the companies behind them go out of business. Take Jibo Incorporated, when it went under, its eponymous robot became a shell of its former self. And I was affected enough by that to make a funereal, almost reverential video about it. With Anki Robotics now out of business, its robot Vector, struggling to avoid the same fate. I don't expect Sony will go out of business anytime soon but you know, corporations are fickle. At some point the company might start to wonder how much money it could save by shuttering its robot dog division. What's that? Oh! This just in. That exact thing already happened once. Yep, back in 2006, Sony cited poor sales for its decision to discontinue AIBO breaking the hearts of a generation of owners. A lot of the old message boards are still up from those times. And mining them is actually a fascinating bit of web archeology, fancy bitmap wallpapers and all. When Sony formally halted support for AIBOs, the ones that were already purchased in 2014, a cottage industry of AIBO repair shops sprung up to keep repairing the aging pups. Now look, you may find it difficult to understand or even absurd, that people from real emotional bonds with robots, but it does happen. And when they stop working, the grief is real too. Now that said, we have to give Sony the credit it deserves. Continuing support for a terminated product for seven years shows rare compassion for the users. And in that same spirit, Sony's trying to turn the cloud to its advantage, by, get this, letting you back up your AIBO's entire personality to the servers. It'd be like if you had a USB port in your sternum and could back up your soul. That way if something happens to your puppy, well, you could buy a new one and download your old AIBO's personality into it. That connection to the cloud is via wifi or LTE with three years of connectivity baked into the cost of AIBO. Expensive? Sure. But the kind of person willing to drop almost three Gs on a robot companion is the same person willing to do that more than once. If it means they don't have to lose their friend. I asked Sony what happens if AIBO loses touch with its servers, like if, say it was discontinued again? And the company said AIBO relies on the servers to remember tricks and to learn over time, but not to function on the day-to-day. So no sudden doggy death. AIBO certainly has his problems. Trotter is a clumsy walker. His singing to himself can get on your nerves. Pees on things on occasion. And his companion app is truly terrible. Like if the adoption process for a real dog was as convoluted as AIBO's initial setup, no one would own a pet. But if, for whatever reason you can't or won't get a biological buddy, and you have $2900 to spend on an artificial one, AIBO is the only social robot I've used that I can still recommend. You're still at the mercy of a big company, but Sony's track record is better than anyone else's at this point. And even if the worst happens, servers get turned off, your dog won't die, it'll just stop learning. And at some point, don't we all? Give me a paw, hi! (laughing) Event alert, folks, if you like drones, you're in for a treat on Friday July 12th. I'm headed down to Brooklyn, New York to check out the BMW Formula E Drone Racing League Event live and in person. Don't miss it, follow me on Instagram @theMrMobile. Folks if you want to learn some more about social robots, check out my two videos on Jibo and one on Vector, RIP times two @theMrMobile on YouTube. And please subscribe if tech videos like this get your servo spinning. This video made possible by a three week AIBO review device loan from Sony. No copy approval was granted, and no compensation was provided. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "AIBO",
        "Sony",
        "robot",
        "gave tech lovers",
        "Sony native Japanese",
        "lovers the perfect",
        "perfect gift",
        "gift to kick",
        "kick off life",
        "Artificial Intelligence Robot",
        "Sony gave tech",
        "Sony gave",
        "time",
        "back",
        "Trotter",
        "Intelligence Robot",
        "robots",
        "AIBO review",
        "dog",
        "servers"
    ],
    "transcript_entity_values": [
        "its first week",
        "Jibo",
        "E Drone Racing League Event",
        "1999",
        "almost three",
        "a period of",
        "LTE",
        "5000",
        "Friday July 12th",
        "Brooklyn",
        "AIBO",
        "months",
        "seven years",
        "July of 1999",
        "Vector",
        "three week",
        "the new millennium",
        "Anki Robotics",
        "four",
        "three years",
        "USB",
        "AIBO",
        "Trotter",
        "2006",
        "2100",
        "first",
        "2014",
        "two",
        "Jibo",
        "Vector",
        "Jibo Incorporated",
        "years",
        "Japanese",
        "2900",
        "20 years",
        "Artificial Intelligence Robot",
        "New York",
        "two hours",
        "about half",
        "SLAM",
        "Gs",
        "Sony",
        "one",
        "Instagram @theMrMobile",
        "YouTube"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "MONEY",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "MONEY",
        "DATE",
        "ORG",
        "GPE",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE"
    ]
}