{
    "id": "E_Hx6yaBowM",
    "title": "It's Time To Switch to Edge",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2021-03-03T17:19:03Z",
    "video_url": "https://www.youtube.com/watch?v=E_Hx6yaBowM",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "browsers",
        "best browser",
        "chrome",
        "chromium",
        "google",
        "microsoft",
        "edge",
        "internet explorer",
        "firefox",
        "fire fox",
        "opera",
        "opera gx",
        "pc",
        "windows",
        "mac",
        "safari",
        "macOS",
        "apple",
        "ios",
        "iphone",
        "android",
        "tech",
        "technology"
    ],
    "views": 126132,
    "likes": 7696,
    "comments_count": 1292,
    "description": "Edge isn't your grandmother's browser anymore  iPhone 13: Apple Kills Their Best Product:  Why the PS5 is LOSING Money:  The USB Lie Detector:  I built a Laptop:   Check out Austin on Twitch:  Vibe with Matt on Twitch:  Chill with Ken on Twitch:    Subscribe!  Twitter:  Matt:  Instagram:",
    "description_links": [
        "https://youtu.be/n8gOIzWxdNo",
        "https://youtu.be/zjv0RHRfqvE",
        "https://youtu.be/apt0ciQyyuY",
        "https://youtu.be/zjv0RHRfqvE",
        "https://www.twitch.tv/austinevans",
        "https://www.twitch.tv/mattansini",
        "https://www.twitch.tv/kenbolido",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hello, and welcome to This Is. Ken, is it time to switch to Microsoft Edge? Toss Chrome in the garbage. - I think it's time to switch to Edge because it is literally everything I love about Chrome without the terrible, terrible parts of Chrome. - So, the thing is Edge is completely different than what it used to be, right? So, they had a period of time where Edge was like this kind of middle stage. Where it was almost like Internet Explorer 2.0, it was built on all their own rendering tech. It was okay, but not great. The current version of Microsoft Edge is basically a version of Chrome under the hood, but with a lot of nice stuff on top of it. Importantly, a lot of the stuff that has made Chrome slow and bloated and fully of googly bits striped out. - Yeah, I mean that includes a lot of I'm sure the tracking stuff, right? Like there's a huge emphasis on privacy which you can talk about a little more in length, but again, the main reason why I like it is because of the fact that it is built on Chrome. There's a lot of reasons why people would want to use Chrome, right. Like extensions, for example. - Absolutely, so a Chrome extension will work completely fine inside of Edge. Drops right in. But beyond that, I think one of the nice things about Edge, is like you were saying with the privacy bit, there's a lot of stuff that kind of gives it a little bit of an edge, personally. Now, before we go any farther, let us just disclaim, this is not a sponsored video. We are not talking about how Microsoft pays us a bunch of stuff. We actually both legitimately use Edge because, I'll say it I guess for both of us, I think its the best browser out there across the board. I do use other browsers sometimes, and we'll get into a little bit about why Edge might now be perfect for everyone. But I think its as a blanket statement, Edge is the best browser for most people. I can standby that, I think it makes sense. - I think there are a lot of things that Edge gets a bad rap about. I mean Microsoft definitely came under fire for when they forcibly installed it on people's computers, which was definitely not great. But, also at the same time, I was already using Edge at that point. You know while people were getting angry, I was like, \"but this thing is kind of better.\" - So if you could put your prejudice aside at that blue E logo, what you get with Edge is first of all, like we were saying with the Chrome-side of things, you're getting a completely compatible experience that's going to work across the board. But, importantly I think it does have the capability with a lot of the good bits of Chrome like everything. But, I think my favorite part of it is the fact that it just feels faster. It just feels more light weight. - And, when we're talking about Microsoft Edge being based on Chrome, it also has the ability to be just as bloated as Chrome if you make it out to be, right. - Sure, you could load it up with all kinds of stuff. - Yeah, but still despite that, with all the stuff that I have on my Chrome and on my Edge, Edge still is faster. There's definitely way better optimization and I think really the best part is, again it doesn't have all of those googly bits but you have the benefit of something that is backed by a major company. - I'm personally just a, this is an Austin Evans only opinion right. I personally like to spread my data around. I don't necessarily like to keep all my eggs in one basket. I certainly have a Google account, and use it for many things. But, also I like to have some things in my Apple ID or inside my Microsoft account or whatever the case is. There's some good tracking protections that are built inside of Edge, right. Now, this is not completely unique. Safari actually has some almost more aggressive things to help to kind of keep you from being tracked online. But, Edge has a lot of good stuff built in. Supposedly, Chrome is going to bring some of this stuff out at some point. But, as Google is an ad company and makes money by tracking you everywhere. - It's kind of sus, it's kind of sus! - A little bit. (laughing) - Now, Edge does support the vast majority of devices, so in addition to supporting the Mac and now supports N1MAX which we can talk a little bit about, it also works on iOS and Android and stuff. I do actually use it as my main browser on Android. Although, I will say, the only spot where Edge has maybe a little bit of a soft spot is on Apple devices. - Yes. - Safari is actually, especially on the phone, iPads, Safari is actually pretty good and has a lot of custom features built in that Edge has like some arguments against but that is one place where like on a iPhone or whatever, I still personally like Safari. - Yeah, I mean, I think it's just like any other modern day browser. If you do have all of your stuff tied into one account. Obviously, with Edge being a Microsoft thing it is tied to a Microsoft account. It lets you share all of your bookmarks across devices. As someone who uses a Mac and PC, as well as an iOS device and an Android device, much like you. Having that device synergy just makes everything infinitely easier. iOs and Safari, obviously, are very well integrated with everything that is in the Apple ecosystem. So, we're talking things like Apply Pay, and stuff like that. - On like the Mac for example, or obviously on iOS, when you have Safari you can use like the fingerprint and face ID to pay using Apple Pay, which is great. Like that's a feature I use all the time. - Safari is incredibly fast on iOS. - It is and that's the thing, like I feel like Chrome is the default. Obviously there's Chromebook and all these devices that run Chrome. There's nothing absolutely wrong with Chrome, right. I think if you made it to this part of the video, you're probably like writing your comment out about why Firefox is the best. We could talk about some of the other browsers. I think the basic position we're in, in 2021, I used to do browser tests all the time. And, there actually used to be meaningful differences between the this browser and that browser, there were all based in different technologies and different engines. These days, pretty much everything boils down to its Chrome or something that is based on Chrome, such as Edge, such as Opera, such as Gavaldi. Or it is something like Firefox, which has a very long history. Or is Safari, which obviously Apple does their own thing, right. The differences between the browsers are not as pronounced as they once were. Which means it really is more of a opinion of your own personal taste, right. If you're a gamer, you might want to use Opera GX which actually has some interesting features about how it will allow you limit how much memory and CPU usage and stuff. And, you have like themes built in. You may want to use Firefox because Firefox has been around forever. And, honestly still has some interesting features. - It is trusted and while I haven't used it in the past year, I've used newer versions of it versus when I used it in 2008/2009. And, it's come a long way. - They've done a lot of work on Firefox. I think it was when Quantum. That was like the first time they had really rebuilt a lot of the sort of underpinnings. But the thing is, when it comes to your browser, this is a place where we spend a lot of time. Sure we're in a lot of apps and what not, but our browser is very important. And, I think having something that protects your privacy, personally, that is something that I have a lot of emphasis on and Chrome, I just don't simply think does a good job of that. Now, I would never advocate for this particularly but Chrome also does not, well it has a very soft ad blocker built in. Which basically just blocks scummy ads or whatever. You could download whatever you want. But, Edge actually has this stuff built in, even on mobile, right. Its one tic to turn that on. And, of course you could turn on your privacy tracking protection. - I don't know, it's just like with Google owning literally every part of my life, on no matter what device I'm on, its like I want to at least step away a little. - You diversifying your data. Look, I think its one of those things. I've had this conversation with a lot of friends, specifically family. I'm like yeah, you should try Edge and everyone's like \"Edge? What's that?\" - No, no, my thing is whenever I show my screen like on Discord or something, usually a friend goes, \"You're using Edge?\" - \"Did you forget to install Chrome or something?\" - It's almost like the unofficial catchphrase. \"Microsoft Edge, oops.\" (laughing) But like, that's the thing is that I think people actually need to give it a chance. - I 100% agree. Now, if you want to try stuff like Opera, stuff like Gavaldi, stuff like Brave, Firefox, there's a lot of great browsers out there. - I know only like 3 of those. (chuckles) - The thing is there's nothing wrong with those browsers. And, in fact they all have their own individual strengths and what not, but generally speaking a lot of these Chromium-based browsers are very similar. It's just more like the features that are on top. And the thing is, Microsoft has actually done a really good job with Edge and constantly innovating and bringing new things out. So, now they have like the profiles which is a really helpful thing that I think Chrome was the first browser to bring out. But there's even like a kid's mode built in to Edge, where you can turn it on, it will kind of lock down certain sites if you want to give you computer to a kid or someone you don't want them messing all of your stuff up. Edge will no give you the option, and a lot of people say \"No\" to a notification prompt on a website, it won't even show it anymore. So, if you're using Edge, it would have skipped to the last 20 seconds of this video and you would have saved yourself some time. You're welcome. - I mean... - That's not how it works, its a metaphor for annoying pop-ups, you know, so you don't want to be bothered. So if you use Edge, it helps to be bothered and I'm bothering you right now by asking you, nay begging you to subscribe and to ring-a-ling the ding-a-ling bell. You've done it though right? You've actually ring-a-ling the ding-a-ling bell. I'm actually being serious. You've hit that button - It's like down there. - It's down there. - Down here. - Yeah, just press it and you'll be always notified with lots of annoying prompts of our click bait videos. - Matt is gone. You made him leave. - What do you think about using Microsoft Edge? Let us know in the comments below. Are you using Firefox, or Chrome or Safari? There's certainly elements to all these browsers but I say if anything, just maybe give something that's not Chrome a try. In any case, we need to go find Matt. - He is on the Edge of losing his head. - Wait the video can't end now. No ones there to press to the stop button. Matt, can you please press the stop button? This video is going to, people are going to be here forever waiting for this video to be over, because you didn't hit the stop button. We're burning people's time right now. Press stop, press stop. Matt, end the video! End the video, Matt! End the video!",
    "transcript_keywords": [
        "Edge",
        "Chrome",
        "Microsoft Edge",
        "lot",
        "Microsoft",
        "stuff",
        "thing",
        "Safari",
        "things",
        "browser",
        "Firefox",
        "time",
        "built",
        "video",
        "browsers",
        "people",
        "Apple",
        "kind",
        "bit",
        "Microsoft account"
    ],
    "transcript_entity_values": [
        "Firefox",
        "These days",
        "Android",
        "Austin Evans",
        "one",
        "Mac",
        "Apple",
        "Quantum",
        "Chromebook",
        "Safari",
        "Opera",
        "Discord",
        "Google",
        "Matt",
        "iPads",
        "CPU",
        "Safari",
        "100%",
        "Apple Pay",
        "3",
        "the last 20 seconds",
        "Edge",
        "the past year",
        "Chrome",
        "2008/2009",
        "Explorer 2.0",
        "Edge",
        "Gavaldi",
        "Microsoft",
        "first",
        "Ken",
        "Microsoft Edge",
        "iPhone",
        "Mac",
        "Edge",
        "2021",
        "N1MAX"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG"
    ]
}