{
    "id": "E_JFTDVgIQE",
    "title": "Unboxing Sony's Do All Camera! - Sony FX9",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-07-15T18:58:49Z",
    "video_url": "https://www.youtube.com/watch?v=E_JFTDVgIQE",
    "category": "Science & Technology",
    "tags": [
        "Sony",
        "Cinema",
        "Film Making",
        "Broadcast",
        "Camera",
        "6K",
        "4K",
        "Sensor",
        "ND Filter",
        "Built-In",
        "$10000",
        "Recording",
        "Battery",
        "Ergonomic",
        "Comfortable",
        "Documentary",
        "Run"
    ],
    "views": 288492,
    "likes": 13704,
    "comments_count": 542,
    "description": "Sign up for Private Internet Access VPN at    Red Cinema has been one of the most marketed cameras for film making for almost the past decade, but Sony is making waves across all platforms. The Sony FX9 should be something you eye if you're looking for an excellent all-around camera.  Buy Sony FX9 Camera On Amazon (PAID LINK):  On BHPhoto (PAID LINK):   Buy Sony FX9 Accessories On Amazon (PAID LINK):  On NewEgg (PAID LINK):  On BHPhoto (PAID Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://geni.us/v6ilpLP",
        "https://geni.us/XDlSFB",
        "https://geni.us/onm5",
        "https://geni.us/mML5Y",
        "https://geni.us/B1BSoB",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- So Sony has always been known for checking off an amazing amount of boxes when it comes to the specs on their cameras, and the camera we have today is no exception. (upbeat funky music) Today we have the Sony FX9. (chill jazzy music) Ooh, the layout's quite nice. Okay, so what do we have in here, let's see. We have the grip, which has been known on the FS7 and the FS7 Mark II. So it just goes on the side of the camera, we'll see the camera in a second. But they've also added the additional extension feature here, which is a little bit more robust than the previous one. Yeah, so they gave us a single charger and a dual charger for the single battery that they gave us. This is Sony's standard BPU90 battery, which is the battery that they use across the FS5, the FS7, and the FX9, so it's commonplace to use these. If you own an FS7 or an FS5 and you're thinking about having an FX9 as an upgrade or maybe a new A cam and then making your FS7 a B cam, it's nice because it uses the same battery so you don't have to buy a bunch of these, 'cause these are not cheap. We have an AC adapter here, and then here is the monitor and the EVF loupe. And this monitor is touchscreen. Now I haven't used the FS7 extensively in my career, but as far as I remember, it's not touchscreen on that camera. If I'm wrong about that, correct me in the comments. Now I remember using a similar EVF loupe with the FS700 back in the day when we still had that camera. Comparing it to that in my head, they seemed to have improved this quite a bit, but I will get the chance to test it on my shoulder in a second. Here is the standard monitor that comes with the FX9. It's on the tiny side, but that is honestly fairly commonplace for a camera that is both a medium to large size but also compact enough to still take on a long trip. So this is Sony's 28 to 135mm F4 lens, which is a very good complement to something like the FX9 or the FS7, because it's got such a long range. F4 is pretty standard for a lens in this range and still good enough for, especially if you're shooting primarily outdoors. And the nice thing about this is it has a built-in servo so that you can control the lens's zoom from this rocker right here and not have to have that standard ENG motor setup where you'd have the zoom rocker here on the lens, which is pretty cool. And then there's this push-pull, very satisfying push-pull for focus. So this will be AF and manual adjustment, and then this is a full manual adjustment, which feels quite a bit smoother, and I like it. PIA is the easy-to-use VPN which allows you to access services and websites as though you were in a different country. It encrypts all of your internet traffic and uses a safe, protective IP. Connect up to five devices at once, clients for Windows, Mac OS, Android, iOS, Linux. And if you buy a one-year plan for $39.95, you get two months for free at the link in the video description. This also has image stabilization, which is again why it's a great complement for an all-around lens, especially if you're shooting sports or something. Oh, look at that, they did send more batteries. This is the FX9 itself. It's about 4.41 pounds, based on what the specs on Sony's website say. Feels really good in the hand, like, it doesn't too feel heavy, feels like it might be fairly well-balanced. Because it would sit on your shoulder, it's designed to sit on your shoulder kind of on the front end, it's not the best balance, 'cause ideally you want the balance point to be level, and you want equal amounts distribution of weight from the front to the back, and that way you're not fighting the camera in any one direction. Let's take a look. (upbeat jazzy music) Look at that. Now it is unfortunate that it's a 6K sensor that you can't use at 6K, but it's also a full-frame sensor, so I'm not that surprised that you can't use it at 6K, and Sony's using the fact that it is 6K to allow you to downsample your footage down to 4K and make it that much more detailed and sharper and have more color information when you downsample. That's their approach for now. I don't know that there is going to be an ability to shoot 6K either externally or internally on Sony's end, but to be fair to Sony, this camera is not meant to be the highest-end thing that they make. On Sony's end, I sort of understand why they justified not making it so that you could record 6K internally. It probably was, on an engineering level, a difficult thing to do. But they also have the Venice, and the Venice is their highest end flagship that will shoot 6K internally and is made for movies. So that is the camera and that is the answer if you really need that resolution. On this side, we have two audio inputs which have phantom power, that's awesome. You have on the back the standard STI timecode, gen lock, all that kinda stuff. On the bottom, there's a very thin silicone adjustable shoulder pad, battery compartment, and then we have our dual media card slots. (piece hits floor) That came out too easily. These are Sony's XQD cards. This is the media that they've chose to use with the FX9 and the FS7. Any FS7 owners will probably have plenty of these. They're not that cheap, but, I mean, no media is really that cheap, because you wanna media that's reliable. It's just kind of unfortunate to this day to still see Sony going with their own proprietary media from the majority of their higher-end cameras. This records 10-bit, 4:2:2 internally, and that's at 6K with the full-frame sensors. That honestly is pretty good. This seems to be about the same as Sony's ENG-style, very similar to the FS7. So anyone who's used those cameras is gonna be very at home here. So I have used E-mount plenty, but this is just strange. You have to undo the lock so that these align, and then you just line up the lens with the pin, hold it there while you turn the lock. I didn't find that to be super intuitive, 'cause it feels weird to need to hold the lens there to make sure that it doesn't fall off until you've locked it. I mean, and the nice thing is when you unlock it, there's this little catch here, so that you can't just unlock it and then your lens'll fall off. But once you hit the release and you unlock it, the lens just comes off. Don't like that. This has gotten significantly heavier. Let's see how it feels on the shoulder. The cable tip for the handle is micro USB. What? Nice thing is that the grip is the way it always has been. It has this nice adjustable little trigger here. Wow, honestly, the old focus hand here. I definitely feel like, even with the extension and the right angle, you could very easily have this arm that holds the grip get quite tired throughout the day, but it is well-placed and the design is pretty good. But again, yeah, once you feel all of the weight is on the furthest part forward and you're not quite balanced, so you'd wanna be able to find the solution that allows you to get the camera a little bit further back on your shoulder, and you'll have a happier time for long shoots. So now that we have it built up, one of the features that I wanna talk about really quickly, and probably one of the biggest features on this camera besides the fact that it has a full-frame, 35mm sensor, is it's variable ND. And it's not just the variable ND that they put in the FS5. It has another feature, it has an auto feature. So that allows you to go from inside to outside without needing to change your aperture or your ISO, so not compromising on either of those things, but then still getting very seamless exposure from very large differences from inside to outside, which again, for people who shoot documentary or anything run-and-gun, and like the stuff that we would do, where we have to sometimes go from outside to inside, that would be a very, very useful feature. The other nice thing that they've added is the S-Cinetone, which is the same color profile that is derived from the Venice. So you'll get similar Venice colors out of this camera, which, for the price point, this camera is $11,000 US. Okay, now that that's over with, let's show you guys some footage. (upbeat chill music) (water glunking) (birds chirping) (truck engine running) (birds chirping) So overall, (upbeat jazzy music) Sony has a winner here. They took everything that was good about the FS7 and just made it into a full-frame camera at a relatively affordable price. Not cheap, but considering the performance and the image that you can get out of this thing and how easy it is to use, the dual native ISO, the auto ND, the fact that it has audio, the ergonomics of it, good job Sony. I would, if I shot documentaries, buy one of these. Unfortunately, I don't, but for all the people who do, let me know in the comments if this is the type of camera that you'd wanna use. Thanks for watching.",
    "transcript_keywords": [
        "Sony",
        "camera",
        "lens",
        "Sony end",
        "nice thing",
        "thing",
        "nice",
        "good",
        "shoulder",
        "battery",
        "feels",
        "cameras",
        "Venice",
        "Sony standard",
        "standard",
        "Sony XQD",
        "media",
        "Sony XQD cards",
        "feature",
        "bit"
    ],
    "transcript_entity_values": [
        "35mm",
        "the S-Cinetone",
        "6",
        "the day",
        "one-year",
        "FS7",
        "AF",
        "4",
        "one",
        "USB",
        "28",
        "this day",
        "Venice",
        "$11,000 US",
        "135mm F4 lens",
        "IP",
        "Today",
        "ISO",
        "second",
        "XQD",
        "PIA",
        "AC",
        "Linux",
        "EVF",
        "EVF",
        "Windows, Mac OS",
        "10",
        "the FS7 Mark II",
        "Sony",
        "STI",
        "two",
        "up to five",
        "FS700",
        "Android",
        "two months",
        "about 4.41 pounds",
        "VPN",
        "39.95",
        "today"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "DATE"
    ]
}