{
    "id": "e_U1BifzNRY",
    "title": "Apple eMac Cleaning and Test Boot (ft.  Hugh Jeffreys) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2019-12-05T21:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=e_U1BifzNRY",
    "category": "Science & Technology",
    "tags": [
        "Apple eMac Cleaning and Test Boot (ft. Hugh Jeffreys) - Krazy Ken's Tech Misadventures",
        "Apple",
        "Macintosh",
        "Mac",
        "Mac OS X",
        "eMac",
        "CRT",
        "Hugh Jeffreys",
        "Computer",
        "iPhoto",
        "iLife",
        "iTunes",
        "iFixit",
        "Old Mac",
        "Old Apple Computer",
        "Vintage Mac",
        "Tech",
        "Krazy Ken’s Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Funny",
        "Computer Clan"
    ],
    "views": 131088,
    "likes": 3636,
    "comments_count": 425,
    "description": "The eMac was Apples final CRT Macintosh. However, Krazy Ken accidentally recycled his, so Hugh Jeffreys swings in to save the day! Will it work? Will it have a spider in it?! Lets find out  Special thanks to Linode for sponsoring this video! Fulfill your cloud computing needs, and sign up now (plus save $20 with my code: COMPCLAN20)    Watch Hugh Jeffreys tech channel here!   THANK YOU, HUGH!  Support the show and get in the credits   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures - Apple eMac Cleaning and Test Boot (ft. Hugh Jeffreys)  Pledge on Patreon now to get your name in the show credits and gain access to Krazy Ken's VIP Discord channel!*   Thanks, Steve, for donating the eMac, and for donating so much more! Check out his eBay store here:   Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?    Amazon links are powered by the Amazon Associates Program.  *not all Patreon tiers qualify for all rewards  #KrazyKen #ComputerClan",
    "description_links": [
        "http://linode.com/computerclan",
        "http://bit.ly/clan2Ocqo8W",
        "http://Patreon.com/KrazyKen",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://Patreon.com/KrazyKen",
        "http://bit.ly/clan2k4UEHY",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- This episode of Krazy Ken's Tech Misadventures is sponsored by Linode. Hey guys, how you all doing? Really that's just great. You know I'm not doing too great right now because I wanted to show you something and I can't find it. You know how Apple always put i in front of everything like iMac, an iPod. Well one day they decided to change up things a little bit and put an e in front of something. The eMac, and I used to have one, but I just can't find it anywhere. So I'll be right back with you once I find it. (upbeat music) Okay, so bad news I still can't find it anywhere, but luckily I can ask my new virtual assistant Veo. Hey Veo where the frick is my eMac. - [Veo] One moment while I search for your eMac you dumb ass. You recycled your eMac five years ago. - No all the humanity. Anyway, can you find me a new one? - [Veo] Searching for eMacs in your area. I found two eMacs owned by \"Hug\" Jeffreys. Would you like me to call him? - Yeah, yeah, yeah, just call him. It's pronounced \"Hugh\" by the way. - [Veo] Calling Hugh Jeffreys. - Hey Krazy Ken, what's up man? - Hey Hugh this is kind of random question out of nowhere, but do you have any eMacs lying around? - I don't think so. Let me have a look. - Thanks I appreciate it. - I don't see an eMac, but I have this iMac. Does that work? No no no I already did episodes on that, plus I want a different letter. I'm looking for an e not an i. What else do you have? I have this 12-inch PowerBook. - That's pretty cool, but I'm looking for something that's more of a desktop. - Well that's a shame 'cuz I saved the best to last and it's also a laptop. Now whatever, show it to me. - This here. This real beauty. - All right. - [Hugh] Oh, I have an eMac, two actually. - Oh, sweet, yeah, I mean I figured you had one because you did a video on it recently. - Yeah, I'll give you the one I didn't restore. I don't know if it works 'cuz I haven't tested it, but. - Thanks I'll take it. - I'll send it through. Do you want a two day air shipping or Yesterday Shipping. - How does Yesterday Shipping work? - Well, you order it now and I'll deliver it yesterday. - Okay, let's do that. - And sent. - Well, I don't see how that's gonna, That was fast. Wow, thanks Hugh. All right, I'll let you know how it goes. - Have a good one mate. I'll catch you next time. So now that we have an eMac back again here's the situation. We're gonna bust this thing open because I've never opened one of these before, and we're gonna explore the inside, hopefully nothing is broken and then we'll boot it up. There's probably something on the hard drive, we'll explore it within reasonable privacy boundaries. So let's bust out our handy dandy, that was smooth. Handy-dandy iFixit kit and open this bad boy up. Huh warranty void if removed. Guess that's it. We've been stopped. Or we appeal it off, I mean the warranty is probably already way past expired. Wait a minute, Hugh is there a giant spider in this one too like there was in the other one you cleaned because like you and your Australian creatures like holy crap. How do you survive down there? And of course part of it peeled off and a lot of gunk is still on there. We'll probably need to clean it. So we'll do a good dust cleaning on here. I don't have any compressed air anymore, I ran out and also we're in an enclosed space 10 stories underground with limited ventilation and the air is mostly poisoned. So I'm not gonna be blowing it everywhere. So we'll start with the bottom panel here. And you may have figured this out by now, I'm not sure, but the e stood for education. This was essentially like a budget iMac G4. Oh yeah, there's cobwebs, that's nice. So the eMac was like targeted for education. We have two things, oh hey, hey little spider. There's a spider in there, but he's way smaller than the one that Hugh had to deal with. And we'll dust all that out soon. But it looks like we have full RAM in there, that's great. PRAM battery, we can test it out later. I don't have any other batteries I can use. I should really buy more. And Before we do all the cleaning let's just get all the screws out. So that should be it for the Philips, now we just got all these hex screws around the perimeter. Also one thing I'm excited about is the speakers on this thing. Several people have told me that the speakers on this thing are the best speakers ever built into a Mac. So I'm really excited to hear how good they are. Oh you know what, there's a power button on this thing. So we should probably turn it this way, so I can disconnect it. It's a really tiny wire, trying to grab it. There we go. Just had to get a better grip on it. It looks like this thing was singed by like a rocket-ship. Just burned to a crisp that's all dust. You're gonna need a cleaning, so just sit on the floor for now, and yeah we can clean the inside. That fan, that's looking nice. I really don't feel like touching the CRT. I don't have the tools to discharge it properly. Now it's been off for several days, probably weeks. I still don't really wanna touch it though. Now if ElectroBOOM was here I'd let him touch it all he freakin' wants. Let's get some of this stuff wiped out. Well, my poor cloth there suffered pretty much already. So since I don't feel like washing it a million times. I guess we'll resort to some disposable ones. I'm sorry Mother Earth. Oh yeah, that fan is pretty, oh I just made like a dust vortex right there. That's a pretty gnarly fan. The burning sensation from the chemicals is already kicking in. But we don't wear gloves here. I advise that you maybe should, but you know, do as I say they don't say as I do. All right, I'm calling that good enough for government work. Let's just nip a few more spots in the bud, and that should be good enough for the inside. It's still gonna run even if there's a few specks of dust in there. So we should be good there. The shell though needs a lot of work. So let's switch to that. Oh yeah. This is your lungs on smoke, any questions? I'd say we're almost there. It's looking pretty good backside. Yeah, not looking too bad. That is good enough for me. Let's get the case back on. Fan is looking good too, I just touched it up a bit more. And that happens a lot. And we're done. So on the front we have a CRT, 17 inches, 16 inch viewable. On the side here we have audio in and out, three USBs, FireWire 400, modem, Ethernet and mini VGA it looks like. Yep, it is mini VGA, go me. On the front we have a disk drive hiding in there as well as these bad-ass speakers which again everyone says are really really good. So I can't wait to test them out. Now design-wise, you know, they had to go with the CRT design to keep it cheaper, but it is kind of like a combination of the iMac G3 and the iMac G4 squish together. All right, first boot in the lair. Will it work? Well, it freaking better Hugh or it's your ass. Just kidding, I wouldn't do that to you. Where's the button? There it is. Here we go. Sounds pretty good on those speakers. Not too loud, pretty quiet fan. There goes the hard drive, still pretty quiet. Its booting into a version of Mac OS that has that startup screen so that would be Jaguar or later. And I'm sorry about the strobing right now. I'll see what I can do about that later. Looks like we're running tiger, all right. Well, that's CRT looks beautiful. I don't know there's something about CRTs especially flat CRTs, they're just look really nice. Okay, the clock got reset. So that pram battery is dead. I don't have a replacement part right now, but I can put one in later. We have a little bit of magnetic damage, not quite sure how to degauss one of these things. And that refresh rate is smooth. That's the other cool thing with CRTs. All right, let's look at the specs and see if there's any fun software on here. The old Aqua Interface with the pinstripes and everything. Let's take a look at that brushed metal, oh yeah, check that out. But I don't think we need to make a new user account really because there's, it looks like there's no personal information on here. It looks like everything was nuked. Software-wise we have Microsoft Office, Firefox and everything else looks stock. Okay, what I wanna do for fun is put some of my own content on here, some photos to take a look at how they look on this beautiful CRT and we're gonna put some music on here as well because I wanna listen to these speakers. But first, I did promise we would look at the specs. Okay, we have one gigabyte of RAM, not too bad, and a 1.42 gigahertz PowerPC G4 processor, pretty sweet. And hard drive capacity, let's take a look at that. I'm guessing 40, place your bets. Oh, 148, okay. This is, did the hard drive get upgraded? I don't remember you being able to buy such a high capacity hard drive for this thing's stock. Well, that's pretty sweet. All right, let's load some content on here. - [Veo] And now a word from our sponsor. - [Ken] Hey Linode provides virtual servers that make it easy and affordable to host your own app, site, service or whatever the heck you want in the cloud. Whether you're a Linux junkie not like me or just want to tinker with code. You can use Linode for either of those. It's a do-it-yourself solution if you like to get into the nitty-gritty of hosting your own professional service. But if you want easy which pretty much I would do there's plenty of One-Click apps to deploy, WordPress, a personal VPN, heck, even Minecraft. We used to play Minecraft on this channel way back when, it's fast all-in-one and easy to configure cloud computing. So whether you're hosting your own website, an app, a coding project or you just need a place to keep something cool live on the Internet Linode is here for you. Oh, and because you're here and because we're all best friends, I'm gonna give you $20 free on your new account. Just use my code COMPCLAN20, or if you don't like typing in codes click the link in the description you'll be glad you did. So while all that stuff goes I also just wanna point out, this is the instrument of your liberation, just kidding. Yeah, this is the blackness, this is the dirt from inside the eMac. I was thinking, you know, maybe I can sell these used wipes. I mean people have sold other used things for higher prices, but yeah, I don't know maybe I can make this like a Patreon reward if anyone would be interested in that. Okay, the copy is complete. Let's enjoy this beautiful CRT. It looks pretty good, nice colors. I shot all these myself by the way. We actually have some of them available on our website as wallpapers if you want them. They are kind of, you know, high-res photos so that's probably why it's taking a while. But yeah, the color looks great dude. You know, in the non-magnetic damaged part of the screen and actually it looks pretty good. Nice, this is one of my favorite photos of Chicago. I was really high up when I took that one, very nice. And the beam you gotta go by Cloud Gate man when you're in Chicago. Look at that. Before we move on to the other stuff let's do an Internet test. We'll Plug it in and get this thing online. There could be an airport card in it, I don't know if there is though. Hey, hey look at that. It looks like apples website is kind of loading. Our website the computerclan.comm is much more primitive, so this one should load I'd say 90% of the way. Yep, our logo got turned into a pancake, but now yep, and some of our shapes aren't rendering. But yeah, it's mostly loaded. Again, it's not a super modern website, but okay let's test some movie playback. This is our channel trailer for YouTube. So scrubbing is kind of stuttery as you can see, but let's play it, turn the volume down. Yeah, it's dropping a few frames, but it looks okay. Playing at 24 Fps, it's dropping down there like 23.6 a little bit, so it's mostly okay. Actually it's kind of holding up. Alright let's crank it up. (bright music) Yeah, not too bad. Let's play some music here. So some of this music I wrote myself, so hey hey, I own all the copyrights. Suck it, Content ID system, just kidding. Don't kill me. Okay, what do we do? What do we do here? Soft reboot, people like this one. Okay, it is like shaking. I don't know if you can see this, but it's like shaking the CRT and it's like rippling. I don't think I had these songs professionally mastered, so they're probably not gonna leverage the speakers too well, but we will try. (bright music) Dude it's shaking the CRT. (bright music) You're probably seeing a little bit of that, that is weird. (bright music) I don't know man. I always liked the iMac G3 speakers, but people were saying the eMacs speakers are better. Maybe one day I'll have to do a side-by-side comparison because from memory these don't sound better than those iMac ones. I guess I was expecting more after how people were talking about them in the comments. But they're still pretty good. I don't know maybe they're worn down a little bit and they're not as loud as they should be, yeah. I thought they'd be louder than that. But also that's not really a professionally mixed song. This however, we have some awesome Blue Man Group music, but I can only play like a second of it so, (bright music) yeah, I mean that sounds pretty good. We got xbench this thing. Now the downloads show a few former files, but yeah, it looks like things were cleaned because I don't see any personal files on here anymore. Okay, CPU test courts, everything, do it all and benchmark. And heads up, slight warning the graphics test is kind of flickering colorful so if that CRT, all right. So if that hurts your eyes or causes other problems don't look. This is the part I'm talking about. It's so colorful, yeah. Doing disc test right now. Looks like we're getting 55 megabytes a second on uncashed right, for 4K blocks, 26 to 86K blocks 49, and I think that's it, 56.88 CPU test score to 74.66, memory score to 36.63, OpenGL graphics test 80.67. So yeah, works well and it's nice and clean now. Fan-freakin'-tastic. Thank you Hugh for teleporting this to me with here Yesterday Shipping, however the heck that worked. Guys do check out Hugh's channel as well. He has some good stuff on there and he's a better repairman than me. I think I have some stuff to learn from him. And also I have other fun tech video logs coming up including a Windows 7 installation commemoration. Yes we're gonna have a windows 7 house party. Just like what Microsoft used to do. When Windows 7 goes end-of-life we're gonna celebrate it and go out with a bang. You've been great, you've been great, everybody's great. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "Misadventures is sponsored",
        "Ken Tech Misadventures",
        "good",
        "pretty good",
        "pretty",
        "Hugh",
        "CRT",
        "Hey",
        "eMac",
        "thing",
        "Tech Misadventures",
        "speakers",
        "test",
        "Yesterday Shipping",
        "great",
        "Misadventures",
        "Sounds pretty good",
        "kind",
        "iMac"
    ],
    "transcript_entity_values": [
        "one day",
        "YouTube",
        "Hugh",
        "a minute",
        "two",
        "Cloud Gate",
        "148",
        "86",
        "Krazy Ken's",
        "eMacs",
        "one",
        "Hug\" Jeffreys",
        "16 inch",
        "74.66",
        "Philips",
        "two day",
        "Blue Man Group",
        "Yesterday",
        "Firefox",
        "26",
        "Apple",
        "iMac G4",
        "80.67",
        "weeks",
        "Tech Misadventures",
        "Mac",
        "56.88",
        "first",
        "4",
        "several days",
        "Microsoft",
        "Ethernet",
        "iMac",
        "90%",
        "CRT",
        "1.42 gigahertz",
        "55 megabytes",
        "Linux",
        "Linode",
        "eMac",
        "three",
        "49",
        "one gigabyte",
        "400",
        "24",
        "17 inches",
        "Chicago",
        "Mother Earth",
        "36.63",
        "PowerBook",
        "iPod",
        "Windows 7",
        "12-inch",
        "40",
        "Patreon",
        "Krazy Ken",
        "Minecraft",
        "CPU",
        "10",
        "Jaguar",
        "Minecraft",
        "five years ago",
        "Aqua Interface",
        "Hugh",
        "WordPress",
        "VPN",
        "Hugh Jeffreys",
        "Australian",
        "Veo",
        "23.6",
        "iFixit",
        "RAM",
        "G4",
        "iMac G3",
        "OpenGL",
        "One",
        "7 house party",
        "Microsoft Office",
        "VGA",
        "yesterday",
        "second",
        "Linode",
        "20"
    ],
    "transcript_entity_types": [
        "DATE",
        "GPE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "MONEY",
        "QUANTITY",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "PERSON",
        "NORP",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "MONEY"
    ]
}