{
    "id": "EaBXd-96uNg",
    "title": "Google Pixel 5 Event in 6 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-09-30T18:58:02Z",
    "video_url": "https://www.youtube.com/watch?v=EaBXd-96uNg",
    "category": "Science & Technology",
    "tags": [
        "google pixel 5",
        "pixel 5",
        "google",
        "pixel",
        "google pixel",
        "pixel 5 event",
        "google pixel event",
        "event",
        "google event",
        "google 2020",
        "2020",
        "event recap",
        "recap",
        "supercut",
        "verge supercut",
        "announcements",
        "updates",
        "chrome cast",
        "pixel 4a 5g",
        "5g",
        "pixel 4a",
        "nest speaker",
        "nest",
        "google tv",
        "google tv new",
        "google play tv",
        "android tv",
        "stadia news",
        "google stadia",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 905810,
    "likes": 16474,
    "comments_count": 1342,
    "description": "The Google Pixel 5 event wasn't long at just 30 minutes, but it was packed with product announcements. The company debuted the Pixel 5, the Pixel 4A 5G, a new Chromecast with the Google TV interface, and the Nest Audio speaker. If you didn't have time to watch or want to watch it again, check out our supercut of the biggest moments.  Read more:   Subscribe:  Subscribe to Verge Science:   Read More:  Community guidelines:  Wallpapers from The Verge:  More about our podcasts:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:",
    "description_links": [
        "https://bit.ly/3kYUtaU",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://www.theverge.com/podcasts",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX"
    ],
    "transcript": "- Hi, everyone, thanks for tuning in today. Given what's going on today, Google's north star of being helpful to people feels more important than ever. - Today, I am really excited to introduce Google TV. I see a row of tailored recommendations from across all my favorite streaming subscriptions, all in one place. Another great feature that we bought to Google TV is a watch list, which gives you one easy place to bookmark movies and shows that you want to save for later. You can even add to your watch list from your phone or your laptop, and it will be waiting for you on your TV when you get home. With YouTube TV fully integrated, you need never miss live events. You can record from your phone, as well as get unlimited DVR functionality. You can also play music from your favorite services, and in ambient mode, turn your TV into your large digital photo frame, showing all the favorite pictures you've taken. It even works with your Nest cameras and doorbells. Today, Google TV is making its debut on the all-new Chromecast. - The biggest news here is the addition of a remote to help you navigate with either your finger or your voice. And with this system button, it's so easy. You just press it, and you ask it what you want, and it just magically shows up. The new Chromecast remote has a floating stance that invites you to pick it up, and it comes in three distinct colors that live naturally in their surroundings; snow, sky and sunrise. We also have dedicated buttons for today's most popular streaming services like Netflix and YouTube to give even quicker access to the content that you love. And the new Chromecast with Google TV is available today for just 49.99 in the U S and it's coming to more countries by the end of this year. - Today, we're introducing a new product for our family. Meet Nest Audio for listening to music for only $99. What's really great with Nest Audio as well as Nest menu is that they all work together seamlessly. One that can easily connect with other Nest speakers in displays, and it can be the center of your whole home audio system. More bass, more volume and maintaining that natural clear sound. Nest Audio delivers 50% more base, 75% more value than the original Google home. We introduce a 19 millimeter tweeter for consistent high-frequency coverage and clear vocals and added a 75 millimeter mid-woofer, that really brings that base. And it's available for $99. - It's here. We launched the Pixel 4a. And it's selling even faster than the 3a. And today we're introducing the 5G version. Pixel 4a 5G. It has a larger edge to edge all a display and a more powerful battery. The Pixel 4a 5G starts at only $499. So we're introducing the new Pixel 5, which brings together the best of Google's 5g experiences with water resistance, 8 gigabytes of Ram and wireless and reverse wireless charging. So you can use it with your pixel stand or to charge your pixel buds on the go. - 5G and Google duo can make connecting with friends and family more engaging and entertaining. Not only can you connect with anyone on any phone, you can now share your screen and watch videos together. Pixel 5G and Stadia combine to create an instantaneous gaming experience. Today's biggest games, ready, whenever you are. - Pixel 5 and Pixel 4a 5G share the same front and rear camera system. Starting with the hardware, we've put a new ultra wide lens, the back and each year plus has received a serious upgrade like exposure bracketing to help you take even clearer sharper photos. The new ultra wide lens on the back, lets you capture more of the scene in both your photos and videos. So we've added night sight to our portrait mode for those evening strolls or backyard smores. This combination allows the subject in the foreground to stand out even in low light. We improve portrait mode with a new feature we call portrait light. With portrait light, you can illuminate your portraits. Even when you're back lit against a beautiful sunset or have a harsh shadow on your face from the bright sun above you. You can even apply this lighting effect in the newly redesigned Google Photos Editor to a portrait you took five years ago. We've added three new stabilization modes; locked active and cinematic pen. Cinematic pen lets you make the everyday look like a movie. It creates sweeping dramatic Hollywood effects through stabilizing and slowing down the motion by two X. - And we are also launching extreme battery saver that lets you decide what essential apps you want to keep on while everything else gets paused. It helps you increase your battery life for up to 48 hours. With these phones, you get three years of Android OS and security updates. And the Titan M Chip helps to keep your operating system, passwords and transactions safe. Our new feature Hold for Me, builds on the smarts of duplex and called screen to help save you time. Google assistant will wait on hold for you and alert you when someone comes on the line and is ready to speak to you. - And for those of you who will be purchasing one of our new 5G phones, you'll be getting even more. Three months of Stadia pro, YouTube premium, 100 gigabytes of storage with Google one and Play Pass and Play Points all on us. They start at only $499. (upbeat music) - Thanks for spending some time with us. We got ACC adults with animal planet and AMC. Oh you can watch BBC America, world news bet and Bravo. Why did we not show it? You have to look in salty, made your n***a little cheddar. We got to network cartoon network, CVS and cheddar. We got CMT, CNBC, CNN. I'm taking it to comedy central.",
    "transcript_keywords": [
        "Google",
        "Nest Audio",
        "Pixel",
        "today",
        "Nest",
        "Google north star",
        "Google Photos Editor",
        "Audio",
        "portrait",
        "Chromecast",
        "Google Photos",
        "Google north",
        "Meet Nest Audio",
        "Nest Audio delivers",
        "watch",
        "system",
        "Google home",
        "play",
        "introduce Google",
        "redesigned Google Photos"
    ],
    "transcript_entity_values": [
        "19 millimeter",
        "the Titan M Chip",
        "Pixel 5",
        "Today",
        "DVR",
        "Android",
        "100 gigabytes",
        "one",
        "75 millimeter",
        "8 gigabytes",
        "the U S",
        "Bravo",
        "up to 48 hours",
        "Chromecast",
        "three",
        "ACC",
        "today",
        "Google TV",
        "Ram",
        "five years ago",
        "Google",
        "Stadia",
        "YouTube TV",
        "Three months",
        "Nest",
        "5",
        "Hollywood",
        "three years",
        "CMT",
        "AMC",
        "evening",
        "the end of this year",
        "BBC America",
        "CNBC",
        "CNN",
        "two",
        "50%",
        "3a",
        "75%",
        "Google Photos",
        "49.99",
        "only $99",
        "Meet Nest Audio",
        "n***a",
        "Nest Audio",
        "Netflix",
        "YouTube",
        "99",
        "each year",
        "only $499"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "GPE",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY"
    ]
}