{
    "id": "EaFq1dWj1g8",
    "title": "Amazon Prime Exclusive: Should You Sell Your Lockscreen?",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-07-12T15:53:20Z",
    "video_url": "https://www.youtube.com/watch?v=EaFq1dWj1g8",
    "category": "Science & Technology",
    "tags": [
        "nokia 6 review",
        "amazon prime exclusive review",
        "idol 5 review",
        "moto e4 review",
        "amazon phones review",
        "mrmobile",
        "michael fisher",
        "nokia 6 usa",
        "nokia 6 hands on",
        "nokia 6",
        "idol 5 hands on",
        "nokia usa"
    ],
    "views": 208223,
    "likes": 6390,
    "comments_count": 571,
    "description": "How far would you go to save money on your smartphone? If you said \"far enough to sell space on my lockscreen for ads,\" then you probably don't care that Amazon Prime Exclusive lacks the flagship-grade smartphones your tech-geek friends always gush about. The Moto E4 and IDOL 5 are hardly the most exciting devices on the block, after all. That said, the Nokia 6 is a hotly anticipated piece of kit if all of your review requests are any indication, and its arrival on Amazon Prime Exclusive coincides with its official US debut! Couple that with a $50 savings off the retail price in exchange for a few ads, and Amazon Prime Exclusive might just tempt the affordable-smartphone crowd -- assuming they're already Amazon Prime members, of course. For all the other caveats (and cool bits), click on through to MrMobile's test drive of Amazon Prime Exclusive - featuring the Nokia 6!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  \"Stay Mobile, My Friends\" T-Shirt:   Amazon Prime Exclusive Phones:     Nokia 6 on Amazon:     Alcatel Idol 5 on Amazon:     Moto E4 on Amazon:    mStand by Rain Design:    [MUSIC]  Up Top by Tonemassif, available at Premium Beat:    Sensational by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://teespring.com/mrmobile-stay-mobile-pink",
        "http://mrmobile.tech/2yh",
        "http://mrmobile.tech/2yi",
        "http://mrmobile.tech/2yj",
        "http://mrmobile.tech/2yk",
        "https://www.raindesigninc.com/",
        "https://www.premiumbeat.com/royalty_free_music/songs/up-top",
        "https://www.premiumbeat.com/royalty_free_music/songs/sensational",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] Smartphones are too damn expensive. It's one of the little truths of modern life, a tagline up there with Think Different and Just Do It and Subscribe to my YouTube Channel. But how far would you go to make your smartphone cheaper? I'm Mr. Mobile, and these are Amazon Prime-exclusive phones. (smooth electronic music) This is one of those brand names that just makes sense. See, these phones are exclusive to Amazon Prime members. Prime is a membership plan that gives you free two-day or same-day shipping, access to Amazon's streaming video and photo storage, a restaurant delivery in some markets. Basically, it's a pass to Amazon's deluxe features. But it's not free. Membership costs about 100 bucks a year. So if you're not already a Prime member, these phones probably aren't a good deal for you. But if you are one of the estimated 80 million Prime users in the US, you can pick up one of these smartphones for a hefty discount. Not bleeding-edge smartphones with 4K displays or dual cameras, but mid-range selections that are at least solid. Amazon sent me a Moto E4, Idol 5, and a Nokia 6 for testing. Now, lots of you have been asking me about the Nokia, so I'll touch on that in a second. But first, I wanna talk about what you have to give up for that discount, which is your lockscreen. On Prime-exclusive phones, Amazon gets to use your lockscreen as a kind of billboard to try selling you stuff. Every time you wake up your phone, there's a new ad there for some product being sold on Amazon. Now when I hear myself say that, it sounds like the most terrible, dystopian future since Minority Report and its posters that read your eyeballs. But I've used Prime-exclusive phones for about the past four or five days, and being subjected to a little ad every time I wake up my phone actually isn't as annoying as I expected. There's no ding or buzz, and they're styled differently than a true notification, so they're always easy to spot. What did annoy me, though, was just how poorly-targeted they were. The deals are said to be personalized, and one of the first things you do when setting up the phone is to log into your Amazon account. To my mind, the phone should be just as good at recommending products as Amazon.com is when I browse it on a computer. But it's really not. A vinyl delivery service, an AM/FM radio, a plastic potato ricer. What is a ricer anyway? Organic protein? A novel called Beach Lawyer. I don't need or want any of this stuff. I even got an ad asking me if I was new to the Amazon App Store. I was like, no, and you should know that! Aside from that, the Amazon integration is nice. Prime video has a few movies I found worthy of free download. And Prime Now, which lets you order stuff which then appears at your door inside two hours, that's just incredible. True, you can download these apps on any Android phone, but it's nice that Prime-exclusive phones preload them with single sign-up, so you only have to put your password in once. Now, about the phones. Of the devices I used, the Moto E4 is an awfully good smartphone for 99 bucks. We covered it a few weeks back on the Mr. Mobile Facebook page. The E4 is also the only Prime-exclusive phone that'll work on Sprint or Verizon. The others are limited to T-Mobile or AT&T or other GSN carriers. On the other side of the price sheet is the Alcatel Idol 5, which uses the same processor that gave the Moto Z Play such outstanding battery life. So I'm hopeful that that one turns out to be a low-key winner. But easily, the most buzzworthy of the bunch is the Nokia 6, currently an Amazon exclusive here in the States. It's the first time in a while we Americans have seen the name Nokia on a phone. And you know, it's fine. Honestly, my biggest takeaway is that for its full price at 230 bucks there are better options out there. But the Nokia 6 comes down to $180 with Prime exclusive. So in that context, you're getting a lot. I mean, this thing is all metal and it feels like a tank, which does the old brand name proud. It ships with Android 7.1 and it's running the Google Launcher out of the box, so there's not a lot of crap to bog it down. And that Dolby speaker system packs a bigger punch than you'd expect from something in this class. At the same time, this phone is very much a product of that class. You can definitely feel that Snapdragon 430 chugging at times. The camera in particular is advertised as fast, but from launch to snap it's anything but. At the end of the day, the Nokia 6 is a good phone for the price. But it's not much more than that, unless you're buying it to rock that iconic brand again. I'll show you a couple more camera samples from the Nokia 6 while I tell you my favorite thing about all of the Prime-exclusive phones, you can buy your way out of the ads later on. So if you really want the Nokia 6 right now and you can only come up with 180 bucks, you can get the phone in its Prime version and then three months down the line, or however long it takes you, you can drop those extra 50 bucks and wipe out the commercials. I like knowing that escape hatch is there. You don't totally feel like you're selling your soul every time you unlock your phone to a Beach Lawyer lockscreen. Are Amazon Prime-exclusive phones the kind of things I'd shop for or ones I recommend to my tech-head friends? No, absolutely not. But I know an awful lot of people who just need a phone to be a phone, and the cheaper the better. If you're one of those folks, Amazon Prime-exclusive phones are available in the link in the description below. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Amazon Primeexclusive phones",
        "Primeexclusive phones",
        "Amazon",
        "Amazon Primeexclusive",
        "phone",
        "phones",
        "Primeexclusive",
        "Nokia",
        "Prime",
        "Amazon Prime members",
        "Amazon Prime",
        "damn expensive",
        "time",
        "Amazon App Store",
        "Primeexclusive phones preload",
        "bucks",
        "Amazon App",
        "YouTube Channel",
        "Beach Lawyer",
        "Moto"
    ],
    "transcript_entity_values": [
        "about 100 bucks",
        "50 bucks",
        "the Moto E4",
        "230 bucks",
        "Amazon.com",
        "the estimated 80 million",
        "E4",
        "Moto E4",
        "Verizon",
        "T-Mobile",
        "a few weeks",
        "AT&T",
        "States",
        "same-day",
        "Moto Z Play",
        "three months",
        "430",
        "Mobile",
        "my YouTube Channel",
        "US",
        "first",
        "Mobile Facebook",
        "Beach Lawyer",
        "the Nokia 6",
        "7.1",
        "180 bucks",
        "4",
        "Sprint",
        "two-day",
        "Dolby",
        "Nokia",
        "second",
        "two hours",
        "Alcatel Idol 5",
        "180",
        "Americans",
        "99 bucks",
        "one",
        "Android",
        "Amazon",
        "the end of the day"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "EVENT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "TIME",
        "PRODUCT",
        "MONEY",
        "NORP",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE"
    ]
}