{
    "id": "ebkD6DzZDlA",
    "title": "LED color experiments 2019; Beyond the Sharpie",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2019-11-17T14:15:51Z",
    "video_url": "https://www.youtube.com/watch?v=ebkD6DzZDlA",
    "category": "Science & Technology",
    "tags": [
        "technology connections",
        "holiday lights",
        "christmas lights",
        "led",
        "colored light",
        "rgb",
        "decorative lights",
        "holidays",
        "christmas",
        "displays"
    ],
    "views": 247068,
    "likes": 13447,
    "comments_count": 1546,
    "description": "You can support this channel on Patreon! Link below Yeah, so if you're new here, this is a thing that happens because I'm a curmudgeon about holiday lighting. Let's see what this year brings!  Here's a link to Technology Connextras. You should definitely subscribe there. Duh.   And here are some other links, too! Technology Connections on Twitter:  The TC Subreddit   You can support this channel on Patreon! Thanks to contributions from viewers like you, Technology Connections can continue being as weird and unpredictable as it is. If youd like to join the cool people who bring these totally rad videos to you (Im hip and with it!), you can find out how at the link below. Thank you for your consideration!  And thank you to the following patrons! Aaron Helton, Michael Holmes, John Piontkowski, Trey Harris, Peter Pfundstein, Wilhelm Screamer, Alan Boyd, Mat Stu, RYAN INGOGLIA, Charlycobra, Thomas Kolanus, William Kisley, Daniel Johnson, Potch, Reemt Rhmkorf, Robin Rattay, Bruce Justyn, Rae McIntosh, Justin D, Adam Zawisza, LordJakson, Triancia, Joshua Moncrieff, Max Barnash, Microfrost, Sinirlan, Mitch Schenk, Juan Olivares, Mike Bird, Emmett Ray, Michael Shaffer, Sputnik, Jason Spriggs, Danny S., Gregory Kumpula, Chris Zaremba, Tom Burns, Daniel Pf, Yung Kim, John W Campbell, Matthew Jones, Slappy826, Steven Ingles, Robert Howcroft, Troy King, Some Random, Jeremy Heiden, Vince Batchelor, Peter Sarossy, Tracy Cogsdill, Matt Allaire, Guy, Benjamin Gott, Zach Le, Sean Fyles-Duggan, Fredrik strem, Anil Dash, Simon Safar, Michael Wileczka, John Ehler, William Matthews, Fred Leckie, Kenneth Morenz, Andy, Adam Merolli, Greg Stearns, Robert L LaBelle, Chris Satterfield (Compgeke), Jerrod Putman, Cameron Benton, Samuli Suomi, Keith McCready, Jeffrey Glover, John Marshall, Hsin-Kuei Chen, HenryD, David Anez, Josiah Keller, M T Bono, Conall  Maiti, Struan Clark, Keeb, Alexander Karlsson, Tarrien, Jason Viterna, DrMoebyus, Biking With Panda, Chris Larsen, JH, Michael Romero, Aram Hvrneanu, Jonathon Mah, Jonathan Polirer, Derek Nickel, Marc Versailles, Mark Stone, Arthur Zalevsky, John Fruetel, Christopher Swenson, Andrew Diamond, Cole Campbell, Christopher Beattie, Paul Bryan, Samuel Kirzner, Gus Polly, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Jeremy Samuels, Malcolm Miles, Matthew Lloyd, David L Jones, Matthew Burket, Mike Burns, Noah Corwin, Andrew Roland, Luke Whiting, John Cockerill, Smith8154, David Groover, Michael Wehner, jacob kamphaus, Slysdexia, Alex Hurley, D.z, Tommy McCarthy, Andrew Bobulsky, Richard Sams, Andy Kettu, On Ice Perspectives, Brian Wright, TheGreatCO, Marcus, Petteri Hjort, Daniel DeLage, Nathan Obuchowski, Sam Tran, Shaun Puzon, Bret Holmes, Vlycop, Alexandra Stanovska, Lucas Beckmann, Tom Ebenhoe, Casey Blackburn, Matthew Jensen, Devon Hodgson, Paul Macejewski, Zimpan, Loc Esch, Filmmaker IQ, Jan Houben, Bren Ehnebuske, T.J. Zientek, AdamPlays, Vernon, Ton Brands, Scott Wright, Kory Howard, William Lahti, Thanasis Dimas, Marc Grondin, Lisa, Hex, Dan Davis, Erkin Alp Gney, Mark Stradling, Anton Mironov, Peter Sodke, joseph, Kristian Scheibe, McLargehuge 510, Andrew Liendo, Nick, Greg Tan, The Masterpiece, Seanvdv, Chris Cody, Jason Portwood, Chad Fertig, M Shrimptoast, Joseph Houghtaling, Ben Tucci, Dave Stares, Josh Braun, Lachy Bell, Joe Johnson, Daniel Dugger, Christopher Lowell, Oleg, Michael Sacchi, Ali Elam, Dan Allen, Trent Crawford, Zhenbang Xiao, Jason Watson, Maxime Aubaret, Markus Towara, Barky doggo, Ectra, Dylan Taylor, Reid Fishler, Daniel Meagher, Joel, Neil Forbes-Richardson, Clemens, Brian Kerber, Miranda Schwarck, Bill Bates, Centronias, Dennis Walsh, Alex Warren, marc lulkin, Christopher Moyer, Paul Robins, CanyonMID, Les, Keenan Finucan, funcrusher, Ian Clanton-Thuon, Ryan Pratt, Don Nguyen, Paul Newton, Greg Golds, Theo Keeler, Travis Hagen, Tyler Alberico, Benjamin Ratner, Doug Davenport, Paul Sharp, Craig Brickey, Zidy, Justin Trout, Brandon, John Galus, Karl Kornel, Danila Fediashchin, KD, Sound Board, Adam, Zach Rose, Arvin Prasetya Wiranata, Patryk Majewski, Chris & Brigette Rodriguez, Mattis Mlbakken, Dirk Lembens, WB, AmbientCyan, Sam Calandra, Wolfgang Gschwendtner, Jzef Sokoowski, William Preston, Dave Treadwell, Stuart Stanfield, Howard Longden, Christopher Olson, Kor Nielsen, Adrian Hunziker, Kori Fulgham, Jacob Ford, Stephen Amar, Bryce, Andy Holzhammer, Ethan Mears, Eli Rueda, Jon Clegg, David Jeroslow, Ian Hills, Charles MacDonald, Andrew, Tim Jones, Chris Burger, Paul, Phil E, AnsulFolf, c sporn, Zachary Kordenbrock, Roy Burns, Ian Spence, Mike A, Alex Dodge, hipp1eguy, Blake Kwasnicki, Mick Carroll, Justin Derleth, El Jefe, mrjoro, NEON725, Emily Eisenberg",
    "description_links": [
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "a jazz rendition of Jingle Bells \"Finally I had the answer. And the answer is Sharpies. Nope! Welcome to the second installment of No Effort November. I noticed that many of you thought, uh, that that moniker didnt apply to the last video, um so for this one Im going all in on not going in at all. Also, Im painfully aware of how my new audio setup sounds. Im still working on it. So. As has apparently become tradition, around this time I make a video about holiday lights. Yes, Im a sucker for Christmas lights, I just love how festive everything becomes when we waste just that extra bit of energy lighting up the neighborhood with frankly silly sums of small, shimmering string-suspended shiny sources of sparkling light. Since striving for savings seems sensible sometimes, scores of stores sell some super slick se... uh, ok thats thats enough of that! LED holiday lights have become kind of a thing lately, and generally Im all for them, but I still cannot find the multi-colored sets to be appealing at all. Im getting kinda used to them, Ill admit, but this blue is still WAY TOO BLUE and nobodys gonna change my mind about that. Honestly if it could just be toned down just a few notches I might not be as bothered by this as I am. But sadly, the Blue Lobby seems to have a firm grip on the industry. Anyway, because the Christmas light market seems to be at odds with my desires, and my nightly ritual of projecting intense mental energy towards the executives in this field doesnt seem to be working, last year I embarked on an exhaustive series of experiments to recreate the look of colored incandescent holiday lights using warm white LEDs strands. I had a few things I wanted to accomplish. One was to get a set in my preferred color scheme, which is simply red, yellow, green, and blue. This is now the third time Ive expressed this grievance. I want NONE OF THAT orange and NONE of that PURPLE, and ESPECIALLY none of the pink or teal. Eugh. Those are Easter colors. I also wanted to have a set of lights that looked more natural. And by that I mean, a set which didnt appear monochromatic in nature. Colored incandescent lights arent as pure as the single-wavelength emissions of our friends the diodes that emit light, and while Im sure many of you think Im a weirdo for not wanting color purity, thats just how its gonna be. Perhaps Im simply overly nostalgic for the lights of my childhood, or maybe Im just right about these things, you decide. Last year, I tried acrylic paints which didnt work well at all. The blue was simply too hard to control and was just bad. I also tried spray paint and again. Same result. But then I thought to myself, what if sharpies would work? So I tried sharpies. And they worked! Except, unsurprisingly, they werent super colorfast. This... [ silent struggling ] [ oh you thought he was gonna talk 'cause he looked up but you wrong ] is whats left after just 6 weeks outside. Not great. Happily exposure to rain and snow seemed to have no effect on their color at all. It was apparently just fading caused by ultraviolet radiation from that great ball of plasma in the sky. So maybe I could make them less prone to fading with a UV-protective coating of some sort. But the sharpie solution wasnt quite perfect, either. This blue, while certainly not as bright as the hideous blue found in the typical strands of LED Christmas lights, still had that rather pure look to it. This wasnt super surprising given that the LEDs are likely using blue emitters which activate a red and green phosphor to create white but it was still a little unexpected. Perhaps it also had something to do with the specific wavelengths the blue dye absorbs. Also, the yellow was a little bit too much like highlighter yellow. I wanted it to be just a bit toned down. Anywho, one of the things I said I wished existed was a sort of transparent paint base that I could mix the blue paint into to hopefully make it more controllable. Well, the \"fine\" people of the comments section told me that that does indeed exist, so on a trip to the craft store, I picked some of this up. This acrylic medium looks a bit like Elmers glue but supposedly dries clear, so if I mix this with the blue paint, it should produce not a lighter blue, but a thinner blue. If that makes sense. Another thing that yall suggested was to use transparent paints used in model making. So, I picked some of those up, too. Luckily they can be found in the four colors I wanted. And a third thing I thought I might try was to mix the acrylic paint with actual glue. That dries sorta clear and maybe it would be easier to control or something I dont know Im just spitballing here. So. I first tried the acrylic medium. I started with a very low paint-to-medium ratio, and ended up with a much paler blue than I started with. But again, that should be fine, it will dry clear and it will just thin out. Perfect! But, actually, no. Not perfect at all. Drat! The blue is still way too hard to control the thickness of, and with that in mind, I just abandoned this idea altogether. Poopsicles. I also then thought theres no use trying the glue with the blue, so I abandoned that, too. Boo-hoo. On to the transparent modelmaking paint I guess. And, as luck would have it, that totally works! I figured it would be easiest to dunk the bulbs into the bottle and let the excess paint drip off, but it turns out this was not only more difficult, but also produced worse results than just using a brush. A little backwards from what I thought was gonna be the case but cool. The result is definitely superior to the sharpies. The color is closer to what Im trying to emulate, especially the green and the blue, and on a positive note the blue doesnt have that weirdly pure look of the Sharpified set. Now its possible that the actual LEDs are just different on this strand, compared to the one I used Sharpies with. In fact Im certain they are, but I dont think thats the bigger difference when it comes to the difference in blue. But I have two slight quibbles here. First is that the red isnt quite transparent, and also its not quite as deep as Id like. I just picked up whatever paints the craft store had so it could be that this transparent paint is available online in a better assortment of colors, but honestly this is a rather minor nitpick. A second coat (or just a thicker first coat) made the red more strongerer, and I was pretty happy. A slightly more major nitpick is that my bottle of yellow paint appears to be really old, and it doesnt really want to mix together well it seems. Possibly a result of that, the color of this yellow is a bit too pale for my liking. I really like the pop of the yellow, thats why I prefer yellow to orange in a set of multicolored holiday lights, but this is just a tad too bright. I would have liked it to be a bit more towards amber, and stupid me was about to be all like oh well but then I remembered that you can mix paint together! So, I put just a tiny bit of the red in with the yellow, and... I got... a (I don't know why hes talking like this) much... more... pleasing... result. In fact, I think these two are a comparison right here. No red. Bit of red. Woo-hoo. However, it should be noted that the paints didnt mix super well, but Im gonna chalk that down to the weirdness of this particular yellow paint. In any case the end result was pretty good. One thing I learned was that there doesnt seem to be much of a point to removing all of the bulbs from the strand. I did this thinking that A) I was going to be dunking the bulbs in the bottles and B) that this would be easier, but it seems like it was actually a wash. Having them on the string itself means that I could paint them while the strand was lit, and this gave a better idea of how the coat was going on because, after all, the whole dang point of the exercise is to produce colored lights and if I cant see what the light looks like thatd be kinda dumb. It also is useful to paint the lights in situ (how pretentious) because you can make sure you space (but he said \"place\", the dingus) the colors correctly. In my case, paint one bulb, skip four three! Paint the next one. The fourth one. Thats what I meant. So you might be able to save a tiny bit of time pulling them out and separating them into groups of 25, then painting them all in one go, but I honestly dont know if that would be worth it. Fun fact! I wrote the previous line before I had put all the bulbs I took out back, and now I would highly advise against it. You see, I hadnt realized this, but not all of the bulbs are the same. There are a few sockets in this strand that have three wires going to them, and the bulbs that go in there have a wider base and cannot fit in the other sockets. However, the smaller bulbs will fit fine there. And this caused me some headaches. I figured it out, but this bulb is now dead (but luckily the strand is still OK). So maybe, just leave them in. If you are painting them on the strand, pro tip, use something like this portable heater to quickly dry each bulb. You can hold it in front of the heater for as little as 10 or 15 seconds and get enough of a dry film on the top that by the time the one you just painted reaches the floor (which is probably going to be something like three or four bulbs later), it should be plenty dry. An even better idea would be to bundle a bunch together that are going to be the same color, and paint them all at once. Just come up with some sort of thing to hold them with like a vice or something so you can quickly paint them, I dunno, eugh, just giving you ide- you figure it out! So. Wow. This went a lot more smoothly than I thought it was going to. So now lets talk about the weather. Because this is, after all, an experiment, I decided to buy a can of UV-protective clearcoat and see how that would interact not only with the paint, but also with the sharpies. What Ive done this year is make a completed strand - you cant see it but its fully done - mostly colored with the transparent paint but a few are done with sharpies on this strand, and Im going to clearcoat half of it. Then, well see how well it lasts through the season. When I take them down, Ill make an update on my second channel, Technology Connextras. Thats right, its now called Technology Connextras. * light drop * Deal with it. Theres a link in the description that will take you there so you can subscribe and not miss it. Im hoping that they do well, and if they do, I might set out to make a bunch of these sets. But, heres a better idea. Listen up, all of you people out there who are in charge of Christmas lights. Can you please make this a thing? I know, here, you can sell make-you-own-color sets! Sell the light strands without the little clear plastic tops, and sell those separately in different colors! You can just make a ton of the same white sets over and over and over again, and then weird pedants like me can skip the teals and the purples and the oranges and get our preferred colors! Just sell the colored caps in 50 packs for like $2 and you could be making a killing! Then, we just pop the tops on our sets of lights and boom! Custom sets! I bet this would even tap into some sort of Lite-Brite nostalgia! The little caps are kinda similar to Lite-Brite pegs, so you just know theres gonna be enough people who are like aww this reminds me of my Lite-Brite! and INSTANT PROFIT! And you could sell them all year! Now, I know youre probably not gonna do that, but hey, if the prospect of better sales makes you excited about giving the people what we want, Im gonna plant that in your mind! You could revolutionize the holiday light industry into the decorative light industry! Mmm! And use the same factories and everything! WHY ARE YOU NOT DOING THIS? Its a free idea, cmon, just like do it! DO IT!!!!!11!! But until you do, Ill just sit in my corner painting light bulbs like a madman. The end! drums kick in Wait a minute, this isn't the usual smooth jazz! What is this blasphemy? Well, it turns out it's a jazz rendition of We Wish You A Merry Christmas Hey! Thoughts from the Credits! I went through the comments again on last years videos and thats only one. [laughs] Heugh! Hey! Thoughts from the Credits! I went through the comments on last years video and there are a few things I forgot about! Someone suggested using nail polish clear coat and tinting that with whatever colors of other nail poilish that I might I like. I am totally gonna do that, but Ill save that for next year! That is, of course, unless the Christmas light manufacturers would fricken listen to me or my telepathic thoughts Ive been projecting for an hour each night before I go to bed for the last two years. One thing that I did try was using stained-glass paints. Now, I used one of those goofy little kits that are aimed for small children, and maybe I would have had a better result going with something a little more legit, but that didnt work at all. It was way too thin and didnt produce nearly enough color. I might try the real stuff next year, but my expectations arent super high based upon the appearance of the products I found in the bottles. At the store. That one time. And, there were other ideas, too! But Im not gonna spoil any more of next years video. To everyone out there, I hope you have a very happy holiday season spending time with loved ones. Ill be back with one more video for No Effort November, and then its on to the conclusion of the CED Saga. At least I hope its the conclusion. I dont wanna have to do a part 5. the jazz! It swells! Woah, that's some snazzy saxophoning! oh no! the jazz is fading again... Well, the fine folks of the comments section told me euuaghh! So if I mix this with the blue paint, it should produce not only a [ here he completely loses his train of thoughts, then shakes his head AT HIMSELF ] But hopefully this is a honestly. Not hopefully! We did it! We did it! Im caught up in the Christmas ha! Alright, those are off now so theyre not gonna start a fire. If they did this video would be lit! Did you catch at the beginning that he wasn't wearing socks? At least he was wearing pants...",
    "transcript_keywords": [
        "Jingle Bells",
        "blue",
        "paint",
        "lights",
        "blue paint",
        "light",
        "Christmas lights",
        "Christmas",
        "holiday lights",
        "make",
        "bit",
        "yellow",
        "LED Christmas lights",
        "bulbs",
        "color",
        "colors",
        "thing",
        "Sharpies",
        "paints",
        "rendition of Jingle"
    ],
    "transcript_entity_values": [
        "the last two years",
        "third",
        "Easter",
        "Elmers",
        "half",
        "Boo-hoo",
        "as little as 10",
        "polish",
        "next year",
        "Lite-Brite!",
        "a minute",
        "two",
        "last year",
        "November",
        "Christmas",
        "50",
        "the Blue Lobby",
        "Technology Connextras",
        "Lite-Brite",
        "all year!",
        "Last year",
        "each night",
        "15 seconds",
        "fourth",
        "just 6 weeks",
        "Drat",
        "Jingle Bells",
        "this year",
        "four",
        "one",
        "first",
        "last years",
        "5",
        "One",
        "next years",
        "25",
        "Sharpified",
        "four three",
        "a ton",
        "an hour",
        "First",
        "second",
        "cmon",
        "2",
        "three"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "NORP",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "TIME",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "CARDINAL"
    ]
}