{
    "id": "EdwdgT3xArE",
    "title": "Unboxing the NEW Nothing Ear(1) Headphones!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-07-29T14:55:28Z",
    "video_url": "https://www.youtube.com/watch?v=EdwdgT3xArE",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "nothing"
    ],
    "views": 201769,
    "likes": 9764,
    "comments_count": 788,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we have something very fun to unbox. These are some brand new headphones from a new company called Nothing. Now this is Carl Pei's new endeavor. And I love the whole concept behind the brand because they want it to feel like technology is sort of integrated into your life where it's invisible. Like it's nothing. It's there but it's not if that makes any sense. But I'm very excited to open these up because first of all, the box, the packaging, like everything about it looks really, really cool. We're also going to be doing a giveaway of some of these exclusive ones that will be ijustine edition. So basically it'll have like a little inscription that says that these are issued by me to you. So I'm gonna be holding that on Twitter and Instagram. So basically follow me and Nothing on Instagram and Twitter and leave us comments if you guys would like to win a pair. Let's just open these up (knife clicks) because I have been looking at these all day, so I can't wait to open it. (plastic crinkles) So here's the box. So it's kind of like their first product launch. So there's going to be more products in the future, but this is what they're starting with. There's our little pull tab. (cardboard ripping) Oh it's like a box inside of a box. I'm shook. And this is like a really pretty box. Like it's all silver, freaking fancy, hello. It's been a while since I've been like really excited about a product launch and I just really love everything that Carl has done previously. So it's really cool to see him kind of on this new adventure. Are you ready? Let's do it. Oh, hello. Oh this looks, like this just looks super mysterious. (Justine laughs) Come on out. Little case, like this is fancy. Look at that. Check this case out. I like that everything is really clear and transparent so you can actually like see the inner workings of these earbuds. Let's see if there's anything else in here. Oh yeah we've got, we've got more things guys. I'm actually keeping this box to put stuff in. Like, I don't know what I'm going to put in here, but this is a really cool box. Definitely keeping that. Look at this. Oh it's our little quick start guide. I love this font, too. Super cool. Oh, we got to get the app. Little welcome. Fast pairing. Android only. Okay, we've got our earbuds. So some extras here. You have some small and large extra earbud options, which must mean that medium comes pre-installed and we have our cable here. Oh even the cable is nice. It's like a transparent kind of like clear little like plasticky silicone feel. That's nice. I love a short USB-C cable. Like this is, this is nice, very nice. All right let's open these up for the first time. This case actually can be charged wirelessly, which is really cool. But of course, if you want to do a fast recharge, you would want to use the USB-C cable. Look at this. This looks good. That looks nice. I freaking love the look of these. Let's open them up. Oh, check that out. There's like a little light right there too. Oh these look, these look good. I don't know why I'm whispering. I feel like I have to be quiet for some reason. I feel like their attention to detail is also something to be noted. So it's really cool because they have two little dots on each side of these. So the red one is for your right ear and the white one is for your left. I'm always so nervous when it comes to headphones, because I have such a struggle of getting them to stay in my ear. So if these stay in my ear, it's going to be a fricking miracle and I'm going to be so happy. So I love the feel already. Like this is actually quite nice. Look, shake, shake, shake, shake, shake. These don't fall out of my head. Oh, I got dizzy. So far, so good. So I do have the mediums on right now. The smile test. So when I smile, usually headphones pop right out of my ear. Look at this, I'm smiling. I'm smiling and shaking my head. (Justine laughs) I'm really excited now. So with the charging case, I'm talking louder because these are now blocking the sound in my ear. So you can see the little charging connectors right there on each side. I love that the case also has the little red dot there so there'll be no confusion as to where to place your earbud. Right on there just like so. Let's get these all paired up to the app. Wow scanning, and there you are, buddy. There you are. Let's connect. Meet, okay let's meet you. Double tap, triple tap, tap and hold, so this gives you your battery levels. It has three modes. It's got the noise cancellation, the maximum, the light, and the transparency mode. And then this also shows you the touch control options. Okay, there's a new firmware update available. Let's do our update and then listen to some tunes. (upbeat music) So just let that happen. I'm gonna go have a snack. You might be able to hear me chewing, I'm having a banana. Oh wow I did so many things. All right they are all set up. Everything is updated. (upbeat techno music) So I've got them all set up, but I thought I should probably take them out to really test the noise cancellation. So I love that the stems of these are really flat, which makes gesture control very, very easy. So far I have been loving the fact that you can adjust the volume. So you just kind of swipe up and down to adjust volume, double tap to play, triple tap to switch songs. And if you tap and hold, this is how you can change the noise cancellation options. It's great because they do have a few different modes. They have light, maximum, and then they have a transparency. And then if you want to turn all of that off, you can easily just switch that off. I'm afraid. Am I talking too loud? I don't know. 'Cause I can't hear myself talking right now. So, I just dropped one of my earbuds and this actually has a feature called Find My Earbuds. So it'll make a noise to help me find it. (loud beep) Oh hold on a second. (loud beep) Here it is. (loud beep) (loud beep) (loud beep) Well thank you guys so much for watching. I'm so glad I could give you guys a first look at these new Nothing earbuds. They are awesome. I absolutely love the case and the fact that these are only $99 with an incredible case, great battery life. And they look amazing. Like I said at the beginning of the video, I am partnering with Nothing to do a giveaway. I'll put a link in the description where you can find all of the information. I'm so excited for you guys to get a pair of these and check them out. Until then don't forget to like, comment, and subscribe on this video and be sure to hit the bell so you'll be notified when I post new videos Check the link in the description for all of the information about the giveaway. I'll see you guys later. Bye, good luck. (upbeat techno music)",
    "transcript_keywords": [
        "Justine and today",
        "love",
        "fun to unbox",
        "box",
        "Justine",
        "case",
        "guys",
        "nice",
        "cool",
        "tap",
        "earbuds",
        "shake",
        "open",
        "ear",
        "feel",
        "Carl Pei",
        "Hey guys",
        "Check",
        "kind",
        "excited"
    ],
    "transcript_entity_values": [
        "Carl Pei's",
        "Instagram",
        "second",
        "three",
        "first",
        "USB-C",
        "only $99",
        "Twitter",
        "today",
        "Justine",
        "two",
        "Carl"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON"
    ]
}