{
    "id": "eEjUBjKeGBw",
    "title": "Goodbye iPhone",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2014-09-15T17:20:10Z",
    "video_url": "https://www.youtube.com/watch?v=eEjUBjKeGBw",
    "category": "Science & Technology",
    "tags": [
        "iphone 6",
        "iphone 6 plus",
        "iphone6",
        "iphone",
        "apple iphone",
        "apple",
        "apple iphone 6",
        "new iphone",
        "sell iphone",
        "unboxtherapy",
        "unbox therapy",
        "tech",
        "technology",
        "6+",
        "iphone 6+"
    ],
    "views": 1883086,
    "likes": 16082,
    "comments_count": 2157,
    "description": "The iPhone 6 / iPhone 6 Plus were recently announced with a release date of September 19. Now is a great time to sell your old model while it's still worth something!  - eBay -  - Craigslist -  - Verizon, AT&T, Apple Store -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/SellOnEbay",
        "http://craigslist.com",
        "http://apple.com",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys Lou here back with a brand new video and today we're going to be talking about this, the previous generation iPhone. Now, in this case it's a 5s but there were many versions before this and you might still be using one. So, this video really applies to you as well and it even applies to individuals aren't on an iPhone at all, Android users etc. I'm gonna go through a couple of different options for selling your previous generation device to prepare for the shipment of the brand new one and as you know in this particular case the iphone six was recently announced in two separate variations and they're set to hit the street on the 19th of September. That means that the value of your current generation device is set to plummet fairly significantly over the next week or so. So if you are interested at all of upgrading to the next gen iPhone now is a great time to think about selling your current generation device. or previous generation device. So there are a few different ways to sell your device both online and in person and in this video I'll going over 3 popular options, including my favorite. So we'll be looking at Craigslist, we'll be looking at the retailers, such as AT&T, Verizon, the Apple Store, etc, and then we'll also be looking at Ebay. We'll kick it off with Craigslist Which if you're unfamiliar is a site for posting classifieds, about pretty much anything. I mean anything. Even your old device, that you're looking to sell. There are benefits and drawbacks to Craigslist It's very easy to create a post and most of the sales are local, but then you need to meet somebody in person, who you don't know very much about, and there's no real reputation built into their account; So Craigslist is isn't perfect. Also, generally speaking, most listings lead to some kind of negotiation. Usually people on Craigslist wanna throw a few low-balls out there to figure out if they can get your device for less than you're asking. Next up we have the physical stores, places like Verizon, AT&T and the Apple store. Generally speaking they will give you a little bit of value for your previous generation device. But it's usually not very much money, because they realize they realize they've already got you in the store you already want the next generation device so they'll just, you know, throw you a few bucks. The drawback here is the fact that you're not gonna get very much money, I suppose it could be convenient for some to go to a physical location. Last up we got my personal favorite, the OG of online sales, I am of course speaking of Ebay. I've been using Ebay for as long as I've been using the Internet, at least it feels that way. I've been selling stuff there since long before I ever posted a video here on Youtube. And that just breaks down to the way that Ebay works, you're gonna reach a gigantic audience, you get to set your own price, you never need to meet anybody, you just ship out the product after the sale is finished, you can use an auction you can use the buy it now price, just really convenient, And there's a gigantic audience there, which generally means more cash for your current generation device. In fact, you could be looking at 200$ more based on some of the numbers that I've seen on Ebay compared to places like Verizon, AT&T and of course the Apple store, up to 400$ in fact for your previous generation device, which is gonna make the upgrade cost of that new iPhone 6 or other device that much easier to swallow, because we all know staying upgraded is a fairly expensive thing to do, so getting some value back for your current generation device makes it all that much easier, Ebay is even offering up a 100$ coupon in conjunction with the launch of the next generation iPhone, so if you list your old device and for some crazy reason it doesn't sell they'll give you a 100$ coupon, you can head over to the link in the description, its EbayFTW.com and all the details are over there, so you got a little bit of extra security as well. So the pros when it comes to selling something on Ebay are pretty obvious, you don't need to meet some creepy person through Craigslist, you don't need to go to Verizon, AT&T or the Apple store and get low-balled, then get angry, start and argument when then a video will end up on Youtube of you in that argument... Alright guys, that wraps up this video. Thanks as always for watching I hope that you found it useful if you did make sure to leave a thumbs-up down bellow, all of the details and things that I talked about are gonna be in the description of this video, so be sure to check it out That wraps this up... I already said that, I'll catch you guys on the next episode! later...",
    "transcript_keywords": [
        "previous generation device",
        "generation device",
        "current generation device",
        "previous generation",
        "device",
        "generation",
        "Apple Store",
        "current generation",
        "Ebay",
        "Craigslist",
        "guys Lou",
        "previous generation iPhone",
        "generation iPhone",
        "iPhone",
        "video",
        "Lou",
        "previous",
        "Verizon",
        "Apple",
        "Store"
    ],
    "transcript_entity_values": [
        "Ebay",
        "iPhone",
        "Youtube",
        "Verizon",
        "AT&T",
        "today",
        "the 19th of September",
        "OG",
        "Youtube",
        "Craigslist",
        "5s",
        "200$",
        "Apple",
        "Lou",
        "the next week",
        "Android",
        "two",
        "six",
        "6",
        "100",
        "over 3",
        "Craigslist",
        "100$",
        "classifieds",
        "the Apple Store"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "MONEY",
        "GPE",
        "ORG"
    ]
}