{
    "id": "EGHyDuPG1ks",
    "title": "Do You Need A New Power Supply? - ATX 3.0",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-03-25T17:05:30Z",
    "video_url": "https://www.youtube.com/watch?v=EGHyDuPG1ks",
    "category": "Science & Technology",
    "tags": [],
    "views": 634903,
    "likes": 31265,
    "comments_count": 1216,
    "description": "Purchase a Seasonic FOCUS Power Supply at   Learn about the new ATX 3.0 standard.  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://geni.us/F7w6w4g",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- Power supplies haven't changed that much over the years but there's a new specification that could force you to buy a new one the next time you upgrade your GPU. It's called ATX 3.0 and it was designed by Intel specifically with high performance GPUs in mind. But what's different about it. Let's start by talking about the most obvious part of the new spec, the power connector for your GPU. Instead the eight pin PCI express connector that we've been used to for a long time, ATX 3.0 uses a 16 pin connector called 12VHPWR which is a mouthful that stands for 12 volts, high power. Any power supply rated for more than 450 Watts is supposed to use this new connector which is meant to simplify the build process. Instead of having different graphics cards requiring different numbers of six or eight pin connectors or even custom ones, new cards would instead just need one of these new 16 pin connectors, even if a particular card is on the more power hungry side. Think of it kind of like USBC, and that it's one form factor to plug in but with different power delivery depending on the implementation. The spec recommends that the connector be labeled with how much power it supports 150, 300, 450 or 600 Watts though that 600 watt option is supposed to only be used for liquid cooled cards since that's just, wow a lot of power. And remember how I said it had 16 pins, well four of those pins are smaller than the rest and they're there so that the power supply and the GPU can actually talk to each other specifically, the power supply can tell the GPU what its capabilities are which means that if you have a beefy graphics card but a power supply that can't quite provide all the power it might ask for, the power supply can tell the GPU, Hey I'm not actually that powerful. And the GPU's power limit can be lowered to accommodate it. This should help prevent unexpected instability due to a card drawing too much power though, It also may that your GPS performance could be throttled if your power supply isn't up to scratch. So you'll need to make sure that your power supply is rated for the amount of power that your GPU requires. Oh, and also the rest of your system. However, the 16 pin plug, isn't the only thing they've changed, and we'll tell you about the other key features of ATX 3.0 after we thank our sponsors Seasonic how appropriate. Seasonic focus plus 750 watt gold power supply is a great choice for mid-range systems at a great price. It features an 80 plus gold efficiency rating, is fully modular comes with fluid dynamic fan bearings and has hybrid fan control to limit noise. It's all backed by their 10 year warranty, so why wait. learn more Seasonic.com or through the links down below. One of the other new ATX 3.0 features also aimed at GPU is better spike resistance. The thing is GPUs have a normal power draw when they're under load like playing a game. But they can also experience big momentary spikes in power draw. This is a notable issue with RTX 3000 series cards. Well ATX 3.0 is supposed to alleviate this by requiring any certified power supply to be capable of providing twice its maximum rated power for 10 straight microseconds. And it has to be able to do this for 10% of its total running time. That means that power supplies may become costlier due to the better electronics required. Don't have a high end GPU, Join the club. Well, there are other changes that still might affect you. ATX 3.0 should deliver better longevity with power supplies being able handle over 175,000 power cycles per year which is kind of like turning your computer off and back on 480 times a day over its lifetime. And speaking of which ATX 3.0 should provide, faster system wake up times, So I say go for it, turn it on and off as often as you want. Efficiency should also improve in your system isn't working too hard as power supplies have to be above 60% efficient at just 10 Watts or at 2% of their rated maximum power. The spec also mentions that there will be a new certification system from cybernetic labs. This is kind of like the 80 plus system that we're all used to, but cybernetics rates power supplies, for both noise and efficiency. So you should be able to get a quick ideas to how loud your new PSE will be just by looking at the box. So should you budget for a new power supply alongside your next GPU purchase? Ah, well remember that this is a recently published spec and it may be quite a while before ATX 3.0 power supplies hit the market. If we end up seeing them at all, Intel is pushing the spec but it could meet resistance for manufacturers if the changes end up being too costly to implement. So don't go throwing out your existing power supply just yet I mean, it works pretty hard for you and when's the last time you even told it, thank you. And when's the last time you hit the like button and subscribed? Hopefully just moments ago.",
    "transcript_keywords": [
        "Power",
        "power supply",
        "GPU",
        "ATX",
        "supply",
        "Power supplies",
        "connector",
        "GPU power",
        "GPU power limit",
        "pin",
        "supplies",
        "time",
        "GPUs",
        "system",
        "spec",
        "pin connectors",
        "cards",
        "Watts",
        "power supply rated",
        "rated"
    ],
    "transcript_entity_values": [
        "USBC",
        "PSE",
        "12VHPWR",
        "Intel",
        "One",
        "750 watt",
        "one",
        "12 volts",
        "Seasonic",
        "2%",
        "175,000",
        "60%",
        "3000",
        "150",
        "six or",
        "Watts",
        "600",
        "80",
        "300",
        "3.0",
        "just moments ago",
        "3.0",
        "16",
        "10%",
        "600 watt",
        "the years",
        "more than 450",
        "GPU",
        "four",
        "450",
        "10 year",
        "10 straight microseconds",
        "PCI",
        "Seasonic.com",
        "eight",
        "480",
        "ATX"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}