{
    "id": "EgyV_89ptI8",
    "title": "Samsung Galaxy Z Flip hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-02-11T23:23:43Z",
    "video_url": "https://www.youtube.com/watch?v=EgyV_89ptI8",
    "category": "Science & Technology",
    "tags": [
        "samsung galaxy z flip",
        "z flip",
        "galaxy z flip",
        "samsung galaxy",
        "z flip samsung",
        "new z flip",
        "samsung flip phone",
        "flip phone",
        "galaxy s20",
        "galaxy s20 ultra",
        "samsung galaxy s20",
        "samsung galaxy s20 ultra",
        "galaxy s20 plus",
        "samsung galaxy s20 plus",
        "samsung s20",
        "s20",
        "samsung",
        "galaxy",
        "s20 ultra",
        "samsung phones",
        "s20 samsung",
        "hands on",
        "first look",
        "review",
        "samsung event",
        "samsung unpacked 2020",
        "samsung event 2020",
        "samsung unpacked",
        "the verge",
        "verge",
        "tech",
        "technology",
        "tech news"
    ],
    "views": 682913,
    "likes": 7784,
    "comments_count": 776,
    "description": "Samsung unveiled the Galaxy Z Flip, its second folding phone. This phones big improvement over foldables to date is the use of a glass screen, and it definitely feels a whole lot nicer. It feels like glass, and it cant be easily marked up by a fingernail like the plastic screens used to date.   For more about the Galaxy Z Flip:  The biggest announcements from Samsungs Galaxy S20 event:  Samsungs Galaxy S20 and S20 Ultra hands-on:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/37oN0ed",
        "http://bit.ly/2ONKbN7",
        "http://bit.ly/2vnACxG",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This is the Galaxy Z-Flip. It is the folding flip phone that Samsung just announced here at Unpacked in San Francisco. There it is. It's a folding phone. And I have to tell you, I is actually one of the more impressive folding phones that I've tried. And I've only tried a few, but Samsung as really figured out and refined a bunch of things that were wrong with earlier folding phones, and that's starts with the screen. It is actually made out of an ultra thin flexible glass. And so, if I sort of run my fingernail over it, you worry about it scratching on a fold on a Motorola Razr. But here, it doesn't leave a mark, which is great. It does have a tiny, little crease that you can kind of see right there at the hinge, but it's very subtle, and you don't feel it as much. It's much more subtle than it was in the Galaxy Fold, and especially on the Motorola Razr when you feel it. Now, when you close it, it's got a pretty strong hinge. So it's kind of hard to open and close one-handed. That really does add to the feeling of overall build quality for the thing. And it's also there, because Samsung wants to do fancy little software features when you put it at an L here. I was able to try two of those things. I was able to watch a YouTube video on it, which meant that I could see all you lovely comments on the bottom half. I was also able to do a Google Duo call, which made a lot more sense. Just set it on there, and have it on the screen. That is the main thing that Samsung is doing in terms of software customization, but there is one other thing. There is this itty bitty, little screen on the front. You swipe on it, you can see your notifications. And if you double tap the power button, which doubles as a fingerprint sensor, you get a little tiny selfie camera, and you can see yourself, and you can take a selfie. It's adorable. In terms of specs, it's actually also impressive, because it's a Snapdragon 855 Plus processor. It has eight gigs of RAM, which is fine, 256 gigs of storage, and it has wireless charging, which is not a thing on most foldables. It has, I believe, a 3300 milliamp battery, but it's split in between two sides. So, hopefully that's enough to get you through an entire day. In terms of other specs, there are two 12 megapixel cameras on the back. One of them is an ultra wide. On the front, is a 10 megapixel camera, and it's one of Samsung's hole punch cameras, which I actually really like. It's a lot better than like a giant notch that we've seen on some other phones. (chill music) But I wanna go back to build quality for just a minute, because it really does feel way better that they made this hinge a little bit tighter. Samsung also says that they put these brushes on the hinge here to keep dust from getting into the hinge mechanism. I don't know, it's like cilia. It's very biological. I kind of love it. But it feels good. The crease isn't too bad here. And when you close it, there is a tiny little gap. You can definitely see it. It is not completely gapless like on the Motorola Razr. However, it's pretty small. It's way smaller than on the Galaxy Fold. There's no headphone jack. You knew there would be a headphone jack. It's totally fine. (laughs) It is gonna be available on February 14th. There's no pre-orders. It's just coming out. I don't think it's gonna be on Verizon right away, but it should be on AT&T and Sprint, at least, and it still should be available unlocked. It's gonna cost $1,380. Why does Samsung making its folding phones end at $80 instead of $99 or something else? I don't know. They say that it's because it divides more evenly into monthly payments, 'cause these are expensive phones. Sure. But look, I am really excited to review this phone. I really think that Samsung has figured out a lot of the things that they did not get right on their first folding phone, and so this has a lot of promise. I just don't know if it has $1,400 worth of promise. Hey everybody, (air screeches) thanks so much for watching. We, of course, have a hands on with the Galaxy S20 phone, so go take a look at that. And I got it here next to the Razr. We're gonna have a review of this Razr coming up pretty soon. We might even try and do a comparison with the Z-Flip.",
    "transcript_keywords": [
        "Samsung",
        "Motorola Razr",
        "San Francisco",
        "Unpacked in San",
        "folding phones",
        "folding",
        "Galaxy Fold",
        "Razr",
        "phone",
        "phones",
        "Galaxy",
        "folding flip phone",
        "hinge",
        "thing",
        "Motorola",
        "fold",
        "impressive folding phones",
        "things",
        "lot",
        "earlier folding phones"
    ],
    "transcript_entity_values": [
        "one",
        "AT&T",
        "Galaxy Z-Flip",
        "Verizon",
        "Sprint",
        "Google Duo",
        "1,400",
        "eight",
        "between two",
        "the Galaxy Fold",
        "a Motorola Razr",
        "two 12 megapixel",
        "the Motorola Razr",
        "monthly",
        "Samsung",
        "half",
        "3300 milliamp",
        "two",
        "256",
        "One",
        "just a minute",
        "10 megapixel",
        "YouTube",
        "first",
        "99",
        "80",
        "1,380",
        "the Z-Flip",
        "San Francisco",
        "RAM",
        "an entire day",
        "February 14th",
        "Galaxy S20"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "WORK_OF_ART",
        "QUANTITY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "MONEY",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT"
    ]
}