{
    "id": "EGZZbs9k91c",
    "title": "I broke half of them... - AYANEO 2 + Geek",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-15T19:20:41Z",
    "video_url": "https://www.youtube.com/watch?v=EGZZbs9k91c",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "ayaneo",
        "ayaneo 2",
        "geek",
        "handheld",
        "pc",
        "gpd",
        "steamdeck",
        "steam deck",
        "gaming",
        "gamer",
        "games",
        "game",
        "video"
    ],
    "views": 697300,
    "likes": 22042,
    "comments_count": 1115,
    "description": "Get a dbrand skin or grip for your devices today at   Linus loves handheld PCs and has been carrying around his AYANEO as a daily driver for months now, but with the new AYANEO 2 and Geeks' improved specs, they could take over as the king of handheld PCs... as long as they work..!  Check out the AYANEO Geek:  Check out the AYANEO 2:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 These look cool! 0:49 Unboxing the geek 2:33 Specs/features and screen impressions 5:58 Exterior tour 7:26 Playing Doom and trying to adjust joystick sensitivity 11:03 Sponsor - dbrand Taycan Wrap 13:01 Misc specs/features and playing Forza Horizon 5 16:57 Mouse input, vibration motor, and pricing 18:16 Outro",
    "description_links": [
        "http://shortlinus.com",
        "https://lmg.gg/x8w5W",
        "https://lmg.gg/xyynn",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- It's not very often I feel personally attacked by a product. And it's especially not often that I really, really like it. In front of me I have the AYANEO 2 in its Retro Power colorway, and, perhaps more interestingly, the AYANEO GEEK, a slightly downgraded (coughs) cost-optimized version that has pretty much the same performance, just at a lower price. And without some of the bells and whistles. Both of these have the new Ryzen 6,800U CPU from AMD, meaning that they are Zen 3 with RDNA graphics. And both of them have Hall Effect joysticks and triggers, meaning excellent precision, and theoretically, longevity. Ooh. Do we start with the 2 or do we start with the GEEK? Help me out. - [Bell] 2. - 2. Ha, I'm gonna do the other one. - [Bell] Oh! - That's what you get, Bellavance. Those of you who are familiar with this channel will probably be familiar with these handheld gaming consoles. But, for the uninitiated, the idea is simple. It's a whole PC, but the size of a game console. The Steam Deck is probably the most famous in this category, thanks in no small part to its aggressive pricing. But it is far from the first with companies like GPD and AyaNeo having hit the market first. Let's take a look at what we've got in terms of accessory package. This appears to be a cable? Yes. Oh, wow. Quite compact power brick, 65 watts. Not bad. What the devil is this? \"After you replace the SSD by yourself, or disassemble the handheld, the patch that comes with the handheld will be damaged. You can use this new one.\" Oh, that's super cool! One of the things I noticed on their talking points for the AYANEO 2 is that it has a no screws visible design. And I was thinking to myself, \"Gee, that's cool. But also kind of sucks from a repairability standpoint.\" But they apparently include a little patch so you can seal this bad boy back up if you wanna replace the SSD. That's awesome! Speaking of SSD's, they're both available with the 6,800U, 16 to 32 gigs of RAM, and anywhere from 512 gigs to 2 terabytes of solid state storage. Oh, that's great. Look at that. They include four of them. Where they go, I don't know, but they go somewhere, presumably. On the handle, oh, on the sides. Cool! So they include enough for you to take it apart and put it back together twice. I am liking this black colorway a lot more than I thought I would. I figured it would be boring. Instead it's just kind of stealthy. It's clean. Oh, no way! No way! RGB lit joysticks. This is the GEEK, and it's still got the RGB joysticks. Love it! I've talked a fair bit about the similarities between these devices, but I haven't yet talked about the differences. And the screen is a big one. First of all, its fingerprint sensor is a little bit more advanced in that you can just press it once, it'll cast your fingerprint and use it for Windows Hello login. Not the case on the AYANEO GEEK. the AYANEO2 will also store multiple fingerprints so you can use it for multi-user authentication. The other big one is the screen. While both of them have a peak brightness of 400 nits, the AYANEO2 runs at a resolution of 1920x1200, while the AYANEO GEEK runs at a mere, I believe it's 1280x800. Let me just double- Uh. Okay, I'm confused now. - [Bell] There are two different versions. - There's two versions of the GEEK. Okay, well, we evidently got the 1920x1200 version. This is also definitely not as bright, 'cause it says on the spec sheet that they're definitely as bright. It doesn't look that far off- Oh! I was off-axis. Yeah, it's probably about the same. I will say that white point is quite different between them. You can even tell on camera. This one's quite a bit warmer, and this is quite a bit cooler. That could just be a setting though. Let me see. They both use AYANEO's AYASpace Utility, so you can use this to configure the TDP of your processor, as well as calibrate your joysticks, monitor CPU and GPU usage. You can even use it as a game library, because you don't have Steam? Regardless of the screen resolution, the size is different between the two. The AYANEO2 has what they call a bezel-less display, and it's got this single surface sheet of glass across the entire front, with no seam at all. Oh, that actually looks really good. The GEEK has a more conventional bezeled and ridged top surface. Ooh. Okay, that's kind of attractive. No, the screen size is the same. It's just the bezel-less look. Man, that looks incredible. Doesn't it? No real differences in the back of the body, but the weight is slightly different. The AYANEO2 is about 20 grams heavier, and the AYANEO2 contains two gyroscopes, one in the body, one in the handle. While the regular GEEK only has a gyroscope in the body. So, if you like to fine tune your aim with the gyroscope, so you do your course adjustments with the joystick and then fine tuning with the gyroscope, you might find that the AYANEO2 will be slightly more accurate. The other thing is the vibration motor. Apparently, the AYANEO2 uses the same linear vibration motor as the Nintendo Switch. I am surprised they were able to actually market it this way. I'm sure Nintendo don't take kindly to that, especially given how many people have taken to pirating Nintendo Switch games on these handheld consoles. But, what are they gonna do about it, I guess? Ooh, now seems like a good time to take a bit of a tour of the outside. We've got our volume control here, which is too loud right now. Dual USB Type-C's at the top, and another at the bottom. I love this! One of the top ones and the bottom one, those are both full fledged USB4 with, apparently, support for eGPU, in spite of the fact that AMD I don't think has sought, or at least not achieved any sort of Thunderbolt Certification. So, your mileage may vary on that one. And then the third one is data only. You've also got your standard left and right triggers. These are quite deep. Those should give you a great degree of control. Shoulder buttons, and this is interesting, a total of three programmable buttons that can be configured with a total of five functions. So you've got your LC and your RC, nothing on the back. No paddles or anything like that like we've seen with the Xbox Elite Controller, SCUF Controllers and the like. But there is a third configurable controller. Ah yes, there it is. Right here next to the AYA button. You've also got your start and select, or whatever those are called on an Xbox controller. Ooh, microSD slot! Love to see it! That's a great way to add another terabyte of storage. Dual microphones on both. Stereo speakers on both. And I want to feel these sticks. Let me touch your sticks. What, it's not weird. - [Bell] No. - Overall quality, we're going medium. (controls clicking) Definitely some audible fan noise, though that's to be expected running the CPU at 22 watts. Oh, now seems like as good a time as any to say these things have 50 watt-hour batteries in them, both of them. They don't specify any kind of expected battery life, but I would expect them to be pretty close to the GPD WIN 4, which has a 46 watt-hour battery, if I recall correctly. So that's about two hours of heavy use, three to six hours of moderate use, and up to 10 hours of light use. I see no reason why they'd be too dissimilar to that. Those are nice vibration motors. Not bad. Go away! Go away, monster! I would configure them smaller, personally, but I believe that is something that I can do. Let's check that. Master controller, what does that mean? Oh, here we go. Joystick Zone. What does on and off mean? I'm not sure quite how it happened, but I swear to you, AYANEO's English translations have gotten worse over time. What is even happening right now? Hello? Okay. Yeah, Master Controller. What? Oh my God. Okay, I'm opening it on this one. Oh my God. Oh, that's cool. You can switch to a PlayStation/Nintendo style. I'm sorry, I just have no idea what's going on right now. I just want to reconfigure my dead zones. Is that this? What is reset? What just happened? Game running. Enjoy your game. Woo. Okay, I am finding these a little bit sensitive right now. Man, until you've used a Hall Effect joystick, you have no idea what you're missing, with the crap tier non Hall Effect joysticks. I am finding these a touch sensitive though. Okay, I'm setting Joystick Zone to off, and I'm gonna see if that helps. I don't know what that did, but I seem to be happier. Can we take a moment to talk about the fact that this is DOOM eternal running at greater than 1080p resolution, solid 60 FPS, medium settings. Like, AMD, could you be slightly less cool? 6,800U is an absolutely incredible SoC. Yeah, it's a lot more expensive than a Steam Deck, this thing. But, it also outperforms it. Wait, Joystick Zone is on again. There's no granularity. It's 100% or 50%. Pfft! I'm walking, but barely. 50% joystick, not so good. Can you even tell I'm moving? Fine, I'm turning the zone off. Ooh. Oh, I think the dead zones are gone. I think that was dead zone settings. Audio's not bad, eh? It's not the Steam Deck, but it's not bad. - [Bell] I tried multiple chargers, it's not doing anything. - Okay. Our GEEK apparently geeked out, and is not working right now. Again, reminder, these are pre-production. It happens. Oh right, our sponsor, dbrand. (bouncy upbeat music) It looks like my car is back from the wrap shop. But, unfortunately, it's not a typical wrap shop. Does anyone wanna see what dbrand did to my car? - [Colleague] Oh yeah, I saw it already. - You saw it already? That's not a good sign. (scoffs) Nevermind, I'm just gonna- Oh my God. Have you seen it yet? - No. Well I see it now. (bouncy upbeat music) - Oh my God. (bouncy upbeat music) - [Alex] That's so sick. (bouncy upbeat music) - I thought it was gonna be a lot darker. I haven't actually- - It's pretty dark, pretty dark. (bouncy upbeat music) - They did a pretty good job. - [Alex] They didn't get under the door handles. - Oh, so you're just reviewing the wrap job right now? I'm still just- - Inside of the door, would've liked to seen that. - I mean, I actually really liked the factory color on this. - Oh no, this is way better. - (laughs) Come on. Are you taking the piss? - No, this looks sick! Look at this. It's all rainbowy there. This would be so easy to find in a parking lot. You don't have to look for some stupid white car like every single other one. - Alex. Oh my God, have you seen it from this side? - Oh, that's so cool! - Oh, it's so shiny! This is gonna be a distraction. (Bell laughing) I am going to get no leeway from the cops, whatsoever. Gee, dbrand. Thanks. In small doses, to be clear, Warzone, kind of cool. This is a lot of Warzone. I mean, I'm happy to have my car back. Let's see if I can still lock it. (bouncy upbeat music) - [Alex] That's a problem. (laughs) - Nope. - Oh, man. - [Colleague] I don't have the purple. - But, I think it's kind of badass. It's kind of badass. Alright. I guess we're focused on the AYANEO2. \"FORZA Horizon 5\", let's go. Ooh, how fast is the Wi-Fi? Oh, it's Wi-Fi 6. Hey, I can mention some other stuff right now. There's a headphone jack. Yeah, we didn't mention that. Cool. The AYANEO2 comes with SoundTAPMagic, which uses speaker output to translate to vibration output in games that don't support vibration. I can't say I would ever use that, but hey, there you go. Apparently also includes AI subtitle translation, if you watch a lot of anime on your handheld. Small Strategy Window and FPS Thunder are also included. It includes the Type-C to USB-A adapter though. That's useful. You know what? I'm sure the audience in China is gonna be like, \"Whoa, that's the great software I use all the time.\", or something. It's all stuff I've never even heard of though. We definitely need to talk about the design though. Okay, the ergonomics were inspired by the baby sleeping position. So it's a baby sleeping position grip design. We would call that fetal position, you know, where you're kind of spooning around it. \"The state of the baby in the mother's body is natural and comfortable.\", says AYANEO. They draw \"original and pure inspiration from it.\" You know what? \"Forza's\" ready. Why don't we just play video games and stop talking about all this? The OS here says Windows 11 or AYANEO OS. Are they working on a Linux something, something? Ala SteamOS? I find it hard to believe that if they're having this much trouble with configuring the joysticks that they're gonna be building a whole OS. - [Bell] \"Deeply optimized, customized, and developed based on Linux systems.\" - Okay. Apparently they have a Linux OS coming. 22 watts. It's a lot of airflow, you know. She really pushes. It's a little bit warm in the very sort of recessed part of the baby sleeping position here. Overall, not bad, though. The warmest part is right along the back right here where you wouldn't really need to be touching. Also right at the exhaust. Oop, probably shouldn't do that. (upbeat music) (car engines revving) Those are loud speakers. Actually pretty impressed. Now, as someone who only really uses my triggers in racing games to push down all the way, I can't say I'd be the best judge of the fine control that a Hall Effect Sensor Trigger is gonna give you, but it definitely feels really good, actually. The steering too. Now that I've got those dead zones turned off, I think, that is extremely fine. Okay. I am liking this. Geez, can we just take a minute again to appreciate that this thing is running \"Forza Horizon 5\", 1920x1200 targeting 60 FPS. Okay, it's at low. Man, this is a good looking game, even at low. Good gravy. I mean, on a screen this size though, you don't need to crank the details. Man, it looks good. Not quiet though. Can you see it blowing on my hair? (Bell laughs) This fan fricking moves. I'd recommend low. Definitely seeing a little bit of stuttering there. By the way, the vibration is configurable. You can probably hear the vibration. (console vibrating) (Linus imitating console vibrating) It's on medium right now. You can turn it up to high, or you can turn it down to low, depending on what your preference is. Again, it's worth noting that the GEEK, assuming yours works, will also perform identically to the 2. It's just those bells and whistles and some of the included software that's different. The included joystick-to-mouse controls work. This is a problem I've had a lot. When you're interacting with certain elements in Windows, it has partial controller support. So you would click the Windows menu and you'd go up here, and then it would start using the joystick to move between these icons while also moving the cursor around. It looks like they've solved that. That is very good to see. Love to see that. Then, we jump in game. Oh, okay. Oh, cool. There's a shortcut to the proper onscreen keyboard now too. Really nice to see! (console vibrating) Wow, that was some loud vibration there. I think I would turn the vibration down a little. You know? - [Bell] It's pretty loud. - Yeah, that's very obnoxious, actually. Pricing wise, for the $150 difference, given the same performance, it's tough to say that the 2 is worth it over the GEEK. But then again, by the time you're spending almost a $1,000 on a handheld, should you go for the one with the bezel-less screen and the sort of overall nicer package? Ugh, that's tough. Geek 1200p would probably be the way that I would go. Whatever. \"Tower Fall\" is a good game. Check it out if you haven't played it. And this is a good channel. Check it out and subscribe if you haven't subscribed. Bye.",
    "transcript_keywords": [
        "AYANEO GEEK",
        "GEEK",
        "AYANEO",
        "good",
        "Hall Effect joysticks",
        "Hall Effect",
        "Joystick Zone",
        "joystick",
        "cool",
        "AYANEO GEEK runs",
        "vibration",
        "joysticks",
        "bit",
        "kind",
        "lot",
        "game",
        "Steam Deck",
        "Controller",
        "Effect joysticks",
        "God"
    ],
    "transcript_entity_values": [
        "three to six hours",
        "Joystick Zone",
        "4",
        "USB",
        "46 watt-hour",
        "60 FPS",
        "65 watts",
        "Bell",
        "RDNA",
        "AYA",
        "FORZA Horizon 5",
        "Windows",
        "AYASpace",
        "third",
        "AMD",
        "2. - 2",
        "22 watts",
        "50%",
        "Linus",
        "about two hours",
        "2",
        "Nintendo",
        "a minute",
        "AyaNeo",
        "100% or 50%",
        "The Steam Deck",
        "1920x1200",
        "AYANEO2",
        "Thunderbolt Certification",
        "Retro Power",
        "Linux",
        "Nintendo Switch",
        "Warzone",
        "first",
        "FPS Thunder",
        "two",
        "GPU",
        "Windows 11",
        "Xbox",
        "CPU",
        "up to 10 hours",
        "SSD",
        "6,800U",
        "Forza",
        "22",
        "32",
        "Geek 1200p",
        "the Wi-Fi",
        "RAM",
        "about 20 grams",
        "one",
        "Linux",
        "Ryzen",
        "the Nintendo Switch",
        "China",
        "the AYANEO 2",
        "Xbox Elite Controller",
        "AYANEO OS",
        "Audio",
        "GPD",
        "2 terabytes",
        "512",
        "Bellavance",
        "AYANEO",
        "First",
        "five",
        "Wi-Fi 6",
        "English",
        "Windows",
        "three",
        "One",
        "60",
        "RC",
        "Forza Horizon 5",
        "6,800U",
        "Windows",
        "AI",
        "AYANEO GEEK",
        "GEEK",
        "the Type-C",
        "1,000",
        "microSD",
        "16",
        "50 watt-hour",
        "PlayStation/Nintendo",
        "150",
        "four",
        "400",
        "Controller",
        "Love",
        "RGB",
        "AYANEO2",
        "AYANEO2"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "PERSON",
        "TIME",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "ORG",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "LOC",
        "LANGUAGE",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "LOC"
    ]
}