{
    "id": "EHbitD6or2w",
    "title": "I plug this into EVERYTHING! - Netool.io",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-15T20:38:48Z",
    "video_url": "https://www.youtube.com/watch?v=EHbitD6or2w",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "netool",
        "io",
        "network",
        "configure",
        "troubleshoot",
        "IT manager",
        "IT",
        "management",
        "ethernet",
        "port",
        "fix",
        "broken"
    ],
    "views": 1168547,
    "likes": 27617,
    "comments_count": 822,
    "description": "Thanks to Secretlab for sponsoring today's video! Check them out at   Jake is here to show off something a bit different -- Networking tools! With the ability to troubleshoot and diagnose connection issues in a small, battery-powered package, this could be the ultimate package for the IT manager on the go.   Check out the Netool.io Pro2:  Check out the Netool.io Lite:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 A more accessible way to troubleshoot 0:33 Unboxings and design impressions 2:30 Downloading the app(s) 3:19 Sponsor - Secretlab 3:37 App and feature walkthrough/testing 10:32 Netool Cloud features 13:01 Pro2 vs Lite differences, pricing, and overall thoughts 14:35 Outro",
    "description_links": [
        "https://lmg.gg/secretlab",
        "https://lmg.gg/NAKbv",
        "https://lmg.gg/JM8kG",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- When it comes (mellow music) to diagnosing networking problems, say you're an IT person, you're just at your house, whatever, there are lots of tools on the market. Except, so many of them cost $1,000 or $5,000 or $10,000. This one isn't specifically designed to help with hardware problems, but rather, I guess you would call it software problems, configuration problems, and also to make configuring your network faster. These are the Netool.io Pro2, and I think this one's called the Lite. It's called the Lite? I think it's the Lite. Basically, it's a little dongle, I guess let's begin in here, let's open this one there. Ah! What is this? Oh, this is the actual thing. Beautiful. Op, there's one. That's the Lite. Ooh, the green is nice. Look at that! We've got a little quick start guide, charger, patch cable, stickers. I'll be sure to find somewhere to stick that on crooked. I think the other one is gonna be the same. This one I opened already as the Lite. I like the green though. I have the Pro one here. I've been using it for a few days. This looks way cooler color-wise! (laughs) Why is it the cheaper, crappier one that looks cooler? Color-matched cables, that's cute. Wow, we got matched stickers. Oh, that makes a, (plastic crinkles) wonderful noise. Just gonna be a type C to A cable. Plugs in on the bottom there, just like that to charge. These things do have a battery in it, which is very helpful. You don't have to carry this thing around and, \"Ah is there a plug there?\" That would make this a very (chuckles) stupid tool. 2,500 million ampere battery in each of them. I played around with it for about a day, the Pro version and I maybe went down like 30% battery life, so. On the bottom of each of them you have a port for charging and then a port for USB connectivity. I'm not sure what other stuff you can do, but you can at the very least do PCAP capture to a USB stick, which is pretty helpful. On the top is the Ethernet jack, that's gonna plug into a network switch or I guess a wall jack, whatever you're trying to diagnose or get information from. Yeah, aside from that, it's just the little LEDs on the front and power buttons. The top is a port activity indicator. The second one probably status of some port. It's got a little like heartbeat sign, which makes me think it tells you what's going on currently. And then battery indicator. I never used the first generation of these tools. I know that these are the second generation ones. I don't know what the main differences are, but I do know that these ones have both Wi-Fi and Bluetooth, which is super cool. When I plugged this thing in and turned the Wi-Fi hotspot on and connected my phone, it actually acted as an access point to give my phone internet through the cable that it was plugged into, which is super cool. What app do we got here? netool. I think I have the Pro one already, yeah. Oh wait, what? Oh, Pro2. Ah, so the original one must have been called the netool.io and then the pro version was the netool.io Pro and then there's the Pro2 and the Lite, which is the two ones we have today. Kind of seems like it could be one app, I'm not gonna lie, but I know that they're a relatively small company, so if this makes it a lot easier, then cool. Hey, look at that! It's detected over Bluetooth and we'll check it out as soon as I tell you about our sponsor. Secretlab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their Titan Evo 2022 chair keeps you feeling comfortable for longer, with four-way lumbar support and ultra comfortable line of different seat materials and more. Not to mention, all chairs come with a five-year extended warranty and a 49 day return policy, so head to the link down below and check out Secretlab today. Whoa. (mellow music) so immediately it's got LAN, IPv4, IPv6. It shows us the gateway, the configured DNS servers, the subnet, the DHCP server IP, shows you the domain, shows you the public IP address, the port MAC address, the host name of the switch, the type of switch. Oh my god! To be clear, I've been using this for a few weeks just to try it out and one of the most useful things is being able to just go, \"Hey, someone's having weird issues with this port. They're not getting an IP address.\" \"Well, let's see if it maybe it's their device.\" I can just walk over there, plug into the port. \"Let's see if it gets an IP address. Boom, it gets an IP address. Clearly there's something wrong with the device not the switch or the port.\" It's so nice to be able to to carry this thing around and just plug into things. Let's see what else it can do. Of course, the most important setting at the top, dark mode, oh god! (phone screeches) This is supposed (mellow music) to be one of the big selling features of the Pro, is the switch configurator. I don't think it would work with this little Unifi switch, because it's managed through Ubiquiti's own interface, but if you have like a Dell switch or Cisco switch, you can go in here and configure a lot of different things. The IF is gonna be whatever the command line is currently outputting as kinda your start, so let's say that's the start, go SWITCH_PORT. This is a placeholder, as you can see, up here is a key to import the current switch port that you're plugged into. Now that we have a template filled out, we can go into the configuration queue. Oh, I showed you what the configuration capabilities are. That's really cool! Oh, I really wish I had something to try this part with. Man, I was trying to wrap my head around what this would be useful for in terms of configuring unless you just had to write out like a whole script even if you're using like a touch interface, it's still kind of annoying, but it all makes sense now. Say you're in an office building and you're actually at the client's computer. Say, there's a a row of desks, all with PCs plugged into the internet. You take your netool, you go, \"I want all of these computers to be on this VLAN.\" You plug into all the ports, it records the port on here, you make your configuration and you click it, bam! It applies the configuration to all of those ports that you plugged into. Otherwise, you would have to have a perfect map of what individual switch each client has plugged into and in a perfect world you should, but having to reference that, especially if you're talking in an environment with hundreds or thousands of clients, that can get pretty tricky, especially if you only wanna change one or two. You just walk in, you go plug plug, you set up your if then. If you just wanna apply VLAN, I guess you can probably just do that in here. So you configure untagged VLAN, let's say our untagged VLAN is 100, and we automatically could port VLAN things. I think if we plug it in here, in theory it should add it to the queue. Hey, it did! Look at that! Switch configuration queue. Sick! Again, this is really not meant for like a Unifi switch like this, but you can see it did grab the port, which I guess reports as the MAC address. It said, we want to flag it as port 100, and then you would just go and hit Run, assuming you set up the SSH credentials for the switch and whatnot, bam, it would apply it, we configure the switch exactly how you want, and then once that's done you can go, \"Well, did it work?\" I can scan it again and see if it applied the VLAN. I'm getting the right IP. Let's see if it picks up the tagged VLANs. Hey, look at that! What else can I do? (mellow music) I can blink the port. Flash the LAN port? That's very helpful. Tag history. Oh, let's add a tag. Jake computer. You tagged this discovery Jake computer. Ah, sick! It literally saved every single thing it read from it into like a little log file. This thing has so many features! To think that it's like a very small team that works on this thing. For instance, right now I can go in here and say, I want to connect to, let's say VLAN. In theory, rather than connecting to the native network, it would connect to that tagged VLAN that I provided, which is great if you need to troubleshoot if the VLAN is working. Sometimes it seems to get stuck. You can end up at the loading page pretty much infinitely, and you kinda have to go back and reconnect. Maybe I didn't hit Apply. No, it did. It did hit apply 'cause it restarted, right? Yeah. Hmm. It occurs to me that we didn't check if there was a firmware update. When he sent me the first one, he was like, \"Make sure you update the firmware.\" Oh, there's no updates available. Nevermind. To be entirely clear, (mellow music) I have not tried the tagged VLAN mode. I also don't know if this port is working properly, because I tried to plug this one in and (laughs) it wasn't working, so. I'm gonna turn that off for now. (laughs) I'm sure it probably works, but it didn't for me, so your mileage may vary. (laughs) LMG27_2? What the (beep) is that? Wait, it showed up a couple weeks ago. You didn't tell anyone? Do I have internet? I'm pretty sure I do. It's pretty cool! - [Camera Operator] Oh! - That's so cool! - That's so sick! - It's not very fast. It's really, really not fast. (laughs) I don't think it's made for speed tests. It checks for a lot of things. It pings the gateway, which would be your router to see if that's working, which is great. It pings the internet in this instance, google.com, to check if your actual network has internet connection, and then it also did an HTTP, HTTPS request to make sure that it could load a website, which does seem to be working. What else can we do? Discovery timers. There's so many tools in this tool. (chuckles) Well, I'm connected over Bluetooth still. Connected over Wi-Fi. Wow, that's way faster over Wi-Fi! What have I been doing? You can configure timeouts for each of the different tests. If you think that your LACP should only take 10 seconds, and if it doesn't get it by then, then something's wrong, then you can set it to do that, which is really nice. Network time protocol. Yeah, okay, I guess it just syncs the device with NTP which is cool. Devices. That's the current devices. I noticed in the toggles that the STP option was disabled. That might be why that page doesn't work. Let's see. Grabbing toggle switch settings. STP discovery. Let's try that. I think because we just have a router, we're plugged into a Ubiquiti Dream Machine. There is no switches spanning tree two, so it's not outputting any information. What about discovery packet? Yeah, okay, that gives us all the info there. Interesting. You can set it to automatically save all of the discoveries, so if you're running around, trying to catalog a bunch of switches, you can turn that onto auto save. By default, you actually have to go in and click tag, but let's try turning the ARP thing on. Let's say you wanna find the IP of a Rasp Pi you just set up or the IPMI IP address of a new server. You would just plug into the same switch, and in theory with the ARP table, you should be able to find that device. I think there's only a couple on here. This is the router itself, some computer that's plugged into this for testing and then this is the netool itself and it also does a port scan of each of these devices. Especially for that IPMI one, it should be able to find the web port, for instance, to be able to connect to that and it'll give you that information to know that that probably is the one you're looking for. If it's running a web server versus a different device. None of these ones have a web server, right? I don't think so. Do any of these have a web server? This one I think, the router should have a web server, right? Did I not turn that on properly maybe? Now I get to show you the coolest part, netool cloud. Some of you have probably already thought that, \"Wow, this is a really cool tool. I should buy one for all my level one techs.\" Shout out Wendell. - Hey. - But you kind of need remote access. A lot of the time the people that are gonna be using a tool like this, say, like a level one technician that's trying to diagnose problems, they're not gonna have the kind of access needed to make changes and make fixes and whatnot. Something like this would be really powerful if it had that remote access. Well it does through netool.cloud, you can automatically sync any readings off of this device so you're trying to diagnose an issue with one of your lower level techs and trying to figure out what's going on. They can hook it up, scan the port, get all the information and it'll automatically sync to the cloud and you can have a bunch of these connected to the same accounts and say you have 10 technicians, they've all got one of these. You say, \"Oh, let me just label it Jake's tester.\" \"Well, Jake's tester's getting this information, was updated three minutes ago. I can look at the historical tag discoveries. I can look at the cloud specific history and add notes directly to it.\" What is emulator? Does that let me, oh, no way! Oh my god! Okay, so what happens if I unplug it? Oh, it doesn't have internet anymore. That makes sense, okay, well yeah, I could have, could have figured that one out myself. (laughs) We'll make a new network, we'll call it test. Let's make it 192.168.69.1. That one exists now. And if we go to our port number two, configure, protocol, test, save. Hey, look at that beautiful! 192.168.69.120. It hasn't updated on here though. The cloud feature is in beta, so it probably still has some kinks to be worked out. Wait, did it just update? I don't know. Oh, okay, it updated. Beautiful, there we go! 192.168.69.120! Again, this part of it is very, very beta. I would not be surprised if it is just this finicky. That's okay. Once it's working though, this is really sick. To be able to get all this information, I can imagine they're probably working on ways to get all of these configurations and settings and everything able to be directly interfaced through the cloud. So you would just have your remote hands and say, \"Hey idiot, plug this thing in and I'll do all the work for you.\" That would be fricking sweet. Right now, it's pretty read only, (laughs) but at least you can get that information in and yell at the person to fix it, or maybe you can just get that information from the client side and you're fixing it on the server side, bada bing bada boom, now it's fixed. Other than that, I mean I guess I didn't talk about what the differences are between the Lite and the main one. It looks like if all you're trying to do is kind of troubleshooting and testing sort of stuff, the Lite will fulfill most of those purposes. The Pro does add PCAP capture, which can be very helpful. It also adds all of the port configuration and switch configuration stuff and ARP scanning, but everything else, DHCP detection, IP detection, network detection, flashing ports, mapping the ports, all this sort of stuff is on the Lite. What's the pricing right now? Looks like 199 for the light version and the Pro is 299. Decent price difference. Overall, having a tool like this that can do this many network related things for 200 or 300 bucks. I asked them to send another one. Like I said, I've been using the one, wherever it is on the floor for like a couple weeks now, and on the first day I was like, \"Yo, can you send us more of these?\" (laughs) I kind of want to have one for my house even. It's just very flexible and it gives you so much information for not a lot of money and not a lot of time. I would highly recommend checking this thing out and I can imagine how far they've already come in such a short amount of time with these devices. I can't wait to see what they're gonna be capable of in a couple years or like version three. I mean if this thing also had like cable testing stuff, obviously that's way more expensive, kind of completely different device, but if that was all integrated into one, like a netool elite, that would be fricking sick. But for now, I like this thing a lot. If you like this video, get subscribed to ShortCircuit and if you wanna see more ShortCircuit videos, then go see more ShortCircuit videos. I can't think of one.",
    "transcript_keywords": [
        "port",
        "switch",
        "Lite",
        "VLAN",
        "thing",
        "port VLAN things",
        "Pro",
        "diagnosing networking problems",
        "plug",
        "make",
        "things",
        "Kind",
        "information",
        "configuration",
        "called the Lite",
        "Hey",
        "plugged",
        "problems",
        "cool",
        "network"
    ],
    "transcript_entity_values": [
        "49 day",
        "Pro2",
        "NTP",
        "Yo",
        "Jake",
        "Lite",
        "three",
        "a few days",
        "Lite",
        "long hours",
        "VLAN",
        "one",
        "the first day",
        "USB",
        "5,000",
        "a few weeks",
        "STP",
        "299",
        "Cisco",
        "100",
        "Wendell",
        "192.168.69.120",
        "IP",
        "second",
        "LACP",
        "DNS",
        "200",
        "30%",
        "HTTPS",
        "10 seconds",
        "300 bucks",
        "a couple weeks",
        "ARP",
        "LAN",
        "1,000",
        "MAC",
        "Wi-Fi",
        "a couple weeks ago",
        "10",
        "first",
        "hundreds or thousands",
        "10,000",
        "five-year",
        "Unifi",
        "two",
        "a couple years",
        "four",
        "about a day",
        "Ubiquiti",
        "DHCP",
        "199",
        "three minutes ago",
        "HTTP",
        "ShortCircuit",
        "2,500 million ampere",
        "Secretlab",
        "Discovery",
        "Dell",
        "SSH",
        "192.168.69.1",
        "today",
        "Wi-Fi"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "TIME",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}