{
    "id": "EHZqE7iwqv8",
    "title": "Cinematic iPhone Videos! Osmo Mobile 3!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-08-13T13:23:27Z",
    "video_url": "https://www.youtube.com/watch?v=EHZqE7iwqv8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "dji osmo mobile 3",
        "mobile video",
        "iphone video",
        "iphone photography",
        "iphone timelapse",
        "motionlapse",
        "gimble",
        "#DJI #OsmoMobile3 #TransformYourWorld"
    ],
    "views": 422686,
    "likes": 10805,
    "comments_count": 709,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today we're checking out the new DJI Osmo 3. I've always been such a huge fan of these because you can do really great shots with this. But what's really exciting about this is DJI now has this new software called Mimo. So if you're familiar with any of the previous things that they've released, it all uses this new DJI Mimo app. So now this Osmo 3 integrates really well with software. So to show you guys a little bit of the highlights of this, and then I'm actually on my way to Montana again, which I'm so excited about. So I will shoot a really fun little cinematic video using this and I'll show you guys that in a little bit. But first, let's check this out. Much like most of their other gimbals and things like that, if you're ever off balance or things aren't looking the way they should, double tap that trigger and it brings everything back into focus. You can triple click to switch from your front camera to the back camera. And then triple click again, that'll switch back to the front camera. What's great is a lot of these actions are super consistent between the Osmo 3, the Osmo Pocket, and everything kind of just seamlessly works together. Here is the app. One of the things that I love are these little auto Story modes. I got super into these with the Osmo Pocket. You can choose a theme. Let's do this one. So in the Story mode, it'll show you this little timeline. So this first shot is 5.3 seconds. So I'm gonna flip the camera around, and we are gonna record this for 5.3 seconds. Ready? You can do cool movements. Aw, look at that. Okay, I'm gonna hit next. This one is 5.403 seconds. (chill-out music) That was a really long few seconds. This is not my best work but it's so cool because it automatically makes these little Story movies for you. (upbeat music) This is the one that I wanted to share with you. This is one that I made when my dog was staying in a hotel with me in Pittsburgh. I made this using the Osmo Pocket but it's that same thing. It makes these really cool, fun little stories. (speaking foreign language) So this also includes ActiveTrack 3.0. So let's turn on ActiveTrack. It's in the settings. And now we're gonna track Tyler. Okay, Tyler. Hey, hey. We're gonna track you, okay? How do you feel about that? - [Tyler] Okay. - Okay, so I need to see your face. So okay. I'm gonna draw a little box around your face. Okay, it's tracking you. So I guess just, yeah, that's nice. Move around, that's nice. This is super quality content. It's still tracking you. It's still tracking you! (gasping) - Oh! - Whoa! - [Tyler] I'm trying to trick it. - Yeah, but I don't think you can. Go and go out the door and then just hide. Okay, now come back. Oh my gosh. - [Tyler] Did it follow me? - Yes, it did! - No! (laughing) - Wow wow wow! This is amazing. I will say, I was a little bit skeptical when I first got this because I'm so used to using my Ronin and I have a little Osmo Pocket, that I was like, \"What could this possibly do that I would need?\" And now that I'm using it, I see all of the incredible features because one of the things that I like is I like to just travel with the least amount of things as possible, which usually ends up I bring absolutely everything. But a lot of times I know as long as I have my phone, I'll be able to create content. So having this little guy just readily accessible and with me, I can create such great shots with this and it's so smooth. I mean this honestly does turn your phone into a freaking camera. Oh, it even has a glamor. Beautify is not supported in 4K. That's unfortunate. You could do timelapses, hyperlapses. Oh wow, hyperlapse. No way. I wonder, okay. This is exciting. One of the things that I love about the Osmo Pocket is the timelapses that you can do because you can set various points and you can have it slowly move throughout the timelapse. This also has that. It also has a place that you can mount a little tripod. It does come with one but I don't have it right now. So you'll have to check that out on their website but for the time being look at this. This is just any old tripod. It's now tracking me. Front-facing tracking. (chill-out music) This is cool! Oh wow, this is great. Oh my gosh. Okay, no I don't wanna try the gesture controls. So if you go into the settings and turn on the gesture control, you just show it your palm. Here it goes! And it's automatically starting the record process and it's tracking me. This is why I love DJI. I freaking love the integration of their software in their hardware. It just works so well. Oh, this is awesome. Oh, you can do panos? This is so close to my face. (laughing) This is cool 'cause you can pick from several different pano options. So you can do a 180 and you can do a 3x3. So it shoots three, three, three. So to make this massive square photo. So let's try that out of my room. This is where I shoot. Here it is. That's fast. That's super fast. Whoa, look at that. That's so cool. It looks like a fisheye effect. That's pretty awesome. Now I'm going to fold this thing up and I'm gonna take it on a trip. So there's these little notches and that's what you use to line this up and get everything folded down nicely. So this locks in place. And then this just foods down just like so. (loud thudding) Oh my god. My mom always told me that when I get older, she always has trouble holding onto things. And she said, \"One day you're gonna know what it's like.\" And I think that that day it's here. I always drop things and I think that I'm holding it and it just flies out of my hands. I don't know. Anyway, let's go to Montana. (upbeat electronic music) Let's do a nice walking shot here across the bridge. Look how cool. What has happened What did you find",
    "transcript_keywords": [
        "Osmo Pocket",
        "Justine and today",
        "Osmo",
        "DJI Mimo app",
        "DJI Osmo",
        "things",
        "DJI",
        "DJI Mimo",
        "Pocket",
        "cool",
        "Justine",
        "tracking",
        "camera",
        "Wow",
        "software called Mimo",
        "Story",
        "love DJI",
        "show",
        "back",
        "Mimo"
    ],
    "transcript_entity_values": [
        "Ronin",
        "DJI",
        "one",
        "Mimo",
        "Justine",
        "5.3 seconds",
        "Montana",
        "the Osmo Pocket",
        "One day",
        "three",
        "DJI Mimo",
        "DJI Osmo 3",
        "Osmo Pocket",
        "5.403 seconds",
        "ActiveTrack 3.0",
        "3",
        "Pittsburgh",
        "3x3",
        "today",
        "Tyler",
        "first",
        "180",
        "ActiveTrack",
        "One"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}