{
    "id": "EIc6v4C0_-w",
    "title": "Is Nvidia Max-Q A Scam?!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-07-15T19:03:49Z",
    "video_url": "https://www.youtube.com/watch?v=EIc6v4C0_-w",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Max Q",
        "Most Powerful Laptop",
        "Thinnest Laptop",
        "GTX 1080",
        "GTX 1070",
        "Max-Q",
        "Nvidia",
        "Best Laptop",
        "Laptop GPU"
    ],
    "views": 599212,
    "likes": 14173,
    "comments_count": 1061,
    "description": "Customized Laptop Skin from -  Asus Zephyrus -  Alienware 15 -  Aorus X5 -   Music Credits: Intro: Monkey Bars - Robotaki Background: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://dbrand.com/alienware-skins",
        "http://amzn.to/2u2ELlf",
        "http://amzn.to/2uumYqK",
        "http://amzn.to/2t1GEhp",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here. So a little while ago Nvidia announced Max Q, which was the new design approach to building laptops that would keep them thin and light and quiet, and on paper it seemed almost too good to be true, because these were GTX 1080s in a laptop, that was 19 millimeters thick and that were running at 40 decibels, which is incredibly quiet. And one of the ways they achieve this, was through reduced wattage to the GPU. The more power you give to a GPU the better performance, but you hits this point of diminishing returns. And once you hit that sweet spot, the extra wattage that you feed, it doesn't get used efficiently. So, Nvidia caps the power consumption right at that point. Now you get reduced performance right? You can't tap into that last 15 percent or whatever. But you use way less energy, and you get better thermals. So, my initial reaction was: \"Hey, that's kind of cool\", but there were a lot of enthusiasts that were like: \"Hmm, is Nvidia trying to pull a scam on us because these could just be underclocked GPUs and just relabeled as this whole Max-Q certification thing.\" And I understand where the concern comes from, because these are not cheap gaming laptops. These are two or three thousand dollars a pop and at that price point you want to make sure that you're doing the right thing with your money. So that's what this video explores: are these Max-Q laptops a scam? In front of me are three fairly different Max-Q laptops: the ASUS Zephyrus, the AORUS X5 MD and an Alienware 15 Max Q and these all have GTX 1080s inside them and they're all Max Q design laptops. The Aorus X5 MD is running some very early software but... whatever. So, all three of these are very strong performers, in Fire Strike they score less than a regular laptop with a GTX 1080, but better than a laptop with a regular GTX 1070 and the variants you see between these three Max Q laptops is mostly a difference in just the clock speeds of the GPUs. Okay, when you look at this graph, you might notice how close these three Max Q laptops are to the GTX 1070 laptop. We're talking like a seven to ten percent difference. And some GTX 1070 laptops can be overclocked and those will actually outperform these. Alienware put up a video, showcasing how their GTX 1070 laptop could be overclocked and could actually outperform at a cheaper price their GTX 1080 Max Q laptop. And so the question pops up: \"Why is Nvidia pushing these Max Q laptops when you can get a GTX 1070 that has very similar performance or even better performance if you overclock it?\" And the problem is actually that some companies don't take full advantage of the whole MaxQ design approach So, if you look at Alienware, they put a lot of effort into their designs and they're made really well. They bring out new laptop designs every three or four years. They're not going to design a whole new chassis just for some Max-Q stuff. On the other hand a company like Asus, they put out new laptop and PC designs every year, so for them, they can put out a brand new ultra thin Max Q laptop right away. They can take full advantage of the Max-Q design, because that's just how the company rolls. So, back to the Alienware 15, they're running their GPU the Max-Q GTX 1080 at 110 watts, which is the highest level you can run it at for a Max Q design laptop. And they're able to push their GPU hard like this, because this chassis was designed to handle an overclocked GTX 1070. It's got a ton of thermal headroom. So, is this laptop still good? I mean yeah, it's designed well, it's built well, and it's very powerful, but it's not impressive to me. This is the same chassis as was in their regular non Max-Q laptop and honestly I love Alienware, I think they make some of the best laptops in the market. But this feels like a me-too product, like they looked at everyone else making Max-Q laptops, and they thought: \"Hey, we should make one, too!\", but they just didn't put it into a new chassis. So you're stuck with this, so when people look at this product, Max Q does not look like a compelling thing. It's just... why would you buy this gimped GTX 1080 version when you can buy the cheaper GTX 1070 version that performs just as well if not better. And then you take a look at the opposite end of the spectrum, the Asus Zephyrus, this thing was built specifically for Max Q design. It's not as durable as an Alienware laptop, but it's still really well-made. It's thin, it's light and the fans are incredibly quiet. It's not a traditional look, the keyboard has shifted down, the trackpad is on the right and things are a little weird when you first use it, but to me this is impressive. This is a thin and powerful laptop that is super quiet. And I kind of want to touch on the whole thing about fan noise. Decibels are a logarithmic unit, right? So, an increase in 10 decibels is double the perceived volume, so if you're starting at 40 decibels, if you hit 50 decibels that's double the volume and then if you hit 60 decibels, that's double the volume again. Now, gaming laptops can easily hit 50 decibels on load. If you have a GTX 1070 or 1080 in there they can sometimes hit 60 decibels. This thing has a Max Q 1080 in there and hits 39 decibels when you're playing games, so yeah, you can get a 1070 laptop that has very similar performance to this. But it's going to be so much louder. I also want to talk about this thing: the Aorus X5 MD. They didn't change the chassis, it's their regular X5 chassis, not super thin, but to me, Max Q is perfect for this laptop. It still has great performance with the GTX 1080 and the Max Q design keeps it quiet, stays really close to 40 decibels when it's gaming and has a ton of expandability: there's 4 drives in there. Max Q design allowed this really great laptop to get even better. Three months ago the thinnest laptop with a GTX 1080 was this thing, the Razer Blade Pro. And everybody downclock their GPU a little bit just to kind of keep the thermals in check. It's a very good performing laptop, but it's super loud, 60 decibels when it's under load. Now, there's nothing wrong with this device, I mean, it's a very powerful machine. But if all you think they're doing is downclocking their GPUs to kind of make Max Q laptops. That's not the case. There's just so much more going on, like the hardware, the software. It's all combining together to be able to make something this thin, this light and this quiet. So in conclusion: no, I don't think Max Q is a scam. It's not a new GPU and like the technology isn't like the super crazy. But they're combining something that's in the software component and a hardware component to make something that, you know, is really impressive, as long as you're doing it right. Now, the other thing to keep in mind is Nvidia isn't forcing you to buy these Max-Q things, the regular GTX laptop still exists, if you want to buy those things, they have a little more power and a little more fan noise. You're more than welcome to. You don't have to buy these, but for people that want to spend a little more money, to get something that's like a little more elegant, you have that option as well.",
    "transcript_keywords": [
        "Max",
        "GTX",
        "laptop",
        "laptops",
        "Max Q design",
        "decibels",
        "MaxQ",
        "design",
        "GPU",
        "thing",
        "Nvidia",
        "Alienware",
        "Nvidia announced Max",
        "Max Q laptops",
        "regular GTX laptop",
        "regular GTX",
        "GTX laptop",
        "quiet",
        "performance",
        "chassis"
    ],
    "transcript_entity_values": [
        "Alienware",
        "Fire Strike",
        "40 decibels",
        "three",
        "MaxQ",
        "4",
        "Max Q",
        "60 decibels",
        "GPU",
        "Asus",
        "MD",
        "one",
        "GTX 1080",
        "AORUS",
        "seven to ten percent",
        "15 percent",
        "GTX 1070",
        "Three months ago",
        "GTX",
        "two or three thousand dollars",
        "a ton",
        "10 decibels",
        "first",
        "19 millimeters",
        "Aorus",
        "39 decibels",
        "the ASUS Zephyrus",
        "three or four years",
        "50 decibels",
        "the Asus Zephyrus",
        "110 watts",
        "1080",
        "Max",
        "15",
        "the Razer Blade Pro",
        "Nvidia"
    ],
    "transcript_entity_types": [
        "ORG",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "LOC",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG"
    ]
}