{
    "id": "EIjjpOJ0ghg",
    "title": "Galaxy Tab S8 Ultra - You think you know... but do you?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-04-09T13:45:01Z",
    "video_url": "https://www.youtube.com/watch?v=EIjjpOJ0ghg",
    "category": "Howto & Style",
    "tags": [
        "tab s8 ultra",
        "galaxy tab s8 ultra",
        "samsung galaxy tab s8 ultra",
        "samsung galaxy tab s8 ultra review",
        "s8 ultra tablet",
        "samsung tablet",
        "apple ipad pro",
        "ipad",
        "new ipad",
        "m1 ipad",
        "samaung",
        "apple",
        "tablet",
        "best tablet",
        "best ipad",
        "ipad air",
        "ipad vs samsung"
    ],
    "views": 1967458,
    "likes": 86660,
    "comments_count": 5257,
    "description": "It is time to durability test Samsung's most powerful 14 inch Tablet. Get a 4-week trial, free postage, and a digital scale at  Thanks to Stamps.com for sponsoring the show! Tablets have always been a 'Of course that will break' situation. But... the only way to find out for sure if the Tab S8 Ultra from Samsung is durable is to actually durability test it. Today we will be performing the normal Scratch, burn and of course  Bend tests on Samsungs Ultra tablet, so we can compare it to Apples iPad Pro. Should be very very interesting.   Get my Shirts and Razor Knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.Stamps.com/jerryrig.",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "This Galaxy Tab S8 Ultra is by far the largest tablet we have ever durability tested. And yeah, I think I know what's going to happen, and you think you know what's going to happen. But there's that small chance, like with the iPad Pro, that we get surprised. This is almost a full millimeter thinner than the iPad Pro though, so I have my doubts. The only way to find out for sure is by doing a durability test. I was, however, super surprised that the box was shipped out this thin. We can already tell that there's no charger inside of it. Speaking of shipping though, huge thanks to Stamps.com for sponsoring this video. I've been using Stamps.com for the last few years to ship out my JerryRig knives and Whisper Project t-shirts. It's been super helpful when comparing shipping rates and getting exclusive discounts from UPS and USPS all year long. And those discounts I can pass directly onto you guys. That way my stuff doesn't have to be expensive. Plus one of my favorite things is that I can do everything right here from my own house without standing in lines or taking unnecessary trips to the post office. Don't just take my word for it, Stamps.com has been helping over 1 million small businesses for the last 20 years save time and money. And you won't find these discounts anywhere else. Up to 40% off of USPS and 76% off of UPS. Time is money and Stamps.com helps you save both. Head to Stamps.com/JerryRig for a four week trial, free postage, and a free 5 pound digital scale, with no long term commitments or contracts. Stamps.com/JerryRig and you can be up and running in minutes with just a normal computer and a normal printer. And I'll get back to shipping out the knives and t-shirts as soon as we finish with this durability test. Let's get started. [Intro] This Galaxy Tab S8 Ultra tablet is huge. Far larger than anything Apple sells. The largest Apple iPad is 12.9 inches, and this bad boy is a solid 14.6. Inside the box we get the TV size gadget, along with the s-pen, a SIM card removal tool for the expandable memory, and some documents, as well as a very long USB-C cable. But no charging brick. As far as the price goes, this Tab S8 currently retails for about $1099, which does match Apple's price for the iPad Pro. However, Apple does not include the Apple pencil in the box, where Samsung does. This s-pen mounts and receives its charge through the glass panel near the camera lens. Samsung is still calling this guy an s-pen even though it's very different from the s-pen styluses we find inside of the phones. As you can see from the s-pen inside of my Note 10 Plus, it's very much smaller than the one included with the Galaxy Tab...at least that's how it appears on the outside. One the inside, however, once we snap it open it's a very different story. Tucked inside of the larger housing is the exact same hardware from the baby s-pen. It's like a nesting doll. It still has the copper coil, circuit board, as well as a little capacitor at the top that allows the pen to do its gestures and act as a remote for the camera. It does have a larger mounting magnet on the side, but the top half of the pen is just filled up with a large plastic spacer and one additional magnet to keep the pen secured to the glass. Very interesting. I imagine we'll be able to see how it all connects from the inside of the tablet here in just a few seconds. Let's continue with the scratch test. Samsung has made this tablet about the same size and shape as a normal piece of paper, just a tad longer in the hot dog direction. They've somehow managed to cram a whole screen, motherboard, 11,200 milliamp hour battery, and frame into a body that's just 5.5 millimeters thick. It's insanely thin. For Americans that's about 10 razor blades stacked on top of each other. And as we see from the scratch test, glass is indeed the top layer of this technological sandwich, with scratches at a level 6, with deeper grooves at a level 7. This means that up here at the top notch these two cameras are also protected by that same screen glass. Both of these cameras are 12 megapixels, one with a normal lens and one with a wide angle lens. It's kind of hard to get this whole thing in frame on my desk, but Samsung is still indeed using the microplastic protection all around the edges. It's the same clear clingy bits that we find on all Samsung cellphones. The right side is made from metal, with two of the 4 loudspeakers and a USB-C port. Flipping it over long-ways, we can check out the top real estate with its SD card slot, microphone hole, metal volume rocker, and metal power button. One of the perks of this tablet over the iPad is the external storage slot that allows for an additional one terabyte of removable memory in the form of an SD card. And I don't want to be keeping score or anything, but for the same price, this Tab S8 is bigger, comes with the stylus, and has expandable storage. As long as it doesn't snap in half it does seem like a pretty decent tablet. Personally, I'm more of a laptop guy, but I can see why tablet people do their thing. It also has attachment points at the bottom for a physical keyboard. One hobby or profession that appreciates a larger screen are digital artists. And I don't want to brag or anything but I'm somewhat of an artist myself, I just don't usually use the screen side. The back of the Tab S8 Ultra does have the Samsung logo inlaid onto the metal. Personally I think it looks kind of cool without the lettering in place a little more subtle. The s-pen docking and charging location is glass, along with the covering that's over the dual cameras. A 13 megapixel normal camera and 6 megapixel ultra wide camera. They're definitely not the best cameras Samsung has ever come out with, but like I said earlier, this tablet is probably more made for artists rather than photographers. Speaking of which, I'm a pretty big fan of dinosaurs. Like \"Jurassic Park sounds like a good time.\" Level enthusiast over here. However, I did attempt to draw a dinosaur back in 2017 on the back of the Pixel 2 XL. And like, I did an okay job, but let's see if there's been any improvement over the last five years. You know, I've had some time to perfect my craft. Let me know what you think down in the comments. Did I do good with this new dino buddy? Or should I buy a few more tablets and keep practicing? Feel free to be honest, I can take the heat. You know, who can't take the heat though? Dinosaurs. I'll position the lighter over here on the weather app icon since that seems to be increasingly relevant lately. Samsung has put a 14.6 inch AMOLED panel on this S8 Ultra, along with 120 hertz HDR 10 plus. And it lasts for about 25 seconds under the heat from my flame before going white and getting permanently damaged. And it actually looks super cool. The adhesive between the glass and pixels seems to have bubbled up and tye-dyed a portion of the pixels in different shades. Kind of like a burn gradient as heat moves away from the epicenter. Once again this task doesn't show us much, I just started doing it 6 years ago and can't seem to stop. The last thing I want to check though before we turn this tablet into a foldable is the fingerprint scanner. Everywhere online says this is an optical scanner, but judging by the minimal light and thinness of the display while setting my fingerprint, I'm curious if it's actually ultrasonic. We should find out soon enough. Luckily, even after adding my copious amounts of level 7 deeper grooves over the surface of the scanner, it still manages to read my fingerprint and unlock the screen every single time. Nice work, Samsung. Finally, the bend test. Remember, for 2 years in a row Apple's iPad crumbled like crackers up until last year when the new M1 iPad finally survived. The Microsoft Surface Pro 6 also survived, but none of them were as large or as thin as this Samsung Tab S8 Ultra. With the first bend from the back we actually get some hefty curvature, but no cracking. It did however fight back and pinch multiple of my fingers very solidly between the glass screen and metal housing. Now if it looks like this hurts, I can indeed confirm that that observation is correct. There are now parts of me inside this tablet in ways I never imagined. It is, however, still alive and functional, contrasting very much to the stolen portions of my epidermis. Flipping the tablet around and bending it from the screen side, we get a decent flex, but no creaking, cracking, or breaking. It's still frustratingly in one piece. Normally I try to stay objective during my durability test, but today I opened this box fully expecting carnage but instead it took a bite out of me while receiving no structural damage in return. And I am a decently large person, so according to the current laws of the universe, it should snap. I'm not sure what physics-defying black magic Samsung constructed this thing with, but the Galaxy Tab S8 Ultra has survived my durability test and I'm very impressed. My mind is blown, and I'm going to go rethink my life. As always, snag a JerryRig Knife for yourself with the link in the description. Come hang out with me on Instagram and Twitter. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Galaxy Tab",
        "Samsung",
        "Tab",
        "tablet",
        "Ultra",
        "iPad Pro",
        "Stamps.com",
        "Apple",
        "inside",
        "Samsung Tab",
        "Apple iPad",
        "durability test",
        "iPad",
        "spen",
        "test",
        "glass",
        "screen",
        "Pro",
        "top",
        "Galaxy"
    ],
    "transcript_entity_values": [
        "The Microsoft Surface Pro 6",
        "AMOLED",
        "14.6",
        "Jurassic Park",
        "an additional one terabyte",
        "2 years in a",
        "minutes",
        "Stamps.com",
        "about 10",
        "SD",
        "the iPad Pro",
        "6 megapixel",
        "2017",
        "two",
        "Instagram",
        "120",
        "Apple iPad",
        "12.9 inches",
        "the last few years",
        "the iPad Pro",
        "Up to 40%",
        "6",
        "JerryRig",
        "half",
        "UPS",
        "76%",
        "4",
        "M1 iPad",
        "just a few seconds",
        "the last five years",
        "Americans",
        "USPS",
        "about $1099",
        "just 5.5 millimeters",
        "iPad",
        "Whisper Project",
        "5",
        "Apple",
        "USB-C",
        "6 years ago",
        "this Tab S8",
        "last year",
        "over 1 million",
        "first",
        "12 megapixels",
        "Time",
        "Samsung",
        "four week",
        "11,200 milliamp hour",
        "13 megapixel",
        "today",
        "the Galaxy Tab S8 Ultra",
        "HDR 10",
        "One",
        "this S8 Ultra",
        "the Tab S8 Ultra",
        "USB",
        "about 25 seconds",
        "the last 20 years",
        "one",
        "7",
        "Twitter",
        "14.6 inch",
        "This Galaxy Tab S8 Ultra"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "LAW",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "DATE",
        "NORP",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG"
    ]
}