{
    "id": "EiK2aM2GNfs",
    "title": "It's So Oddly Satisfying...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-13T20:43:00Z",
    "video_url": "https://www.youtube.com/watch?v=EiK2aM2GNfs",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "fidget spinners",
        "fidget",
        "spinners",
        "spinning",
        "top",
        "cool gadget",
        "cool gadgets",
        "cool technology",
        "edc",
        "every day carry",
        "every",
        "day",
        "carry",
        "best",
        "2017",
        "new inventions",
        "cool",
        "invention",
        "video",
        "test",
        "futuristic",
        "awesome",
        "innovation",
        "new gadgets",
        "inventions",
        "products",
        "amazing",
        "oddly satisfying",
        "satisfying",
        "spinning top",
        "awesome inventions",
        "future",
        "things",
        "technology (industry)"
    ],
    "views": 4781461,
    "likes": 83940,
    "comments_count": 4855,
    "description": "(   ) --- Today's Mystery Video -   Figitz -   Why are these fidget spinners so satisfying and addictive?   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/cjFj6N-Dkaw?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://www.etsy.com/shop/figitz",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Alright, so I never know what's gonna show up here at Unbox Therapy. You guys know that there's an address that's published on the YouTube about page, and people, they just they go they see that and they're like \"you know what, I wanna send something' to lou. \" sometimes, It's something very expensive very High-tech other times it's a chocolate bar. You never know what you're gonna get I appreciate everything that comes through there Though seriously so does Jack,Jack even,Jack gets a lot of nice letters so if you feel like you need to say something to Jack you can send that to that address as well. But also, I get stuff I never knew about, I get stuff I never heard about these little things in front of me are apparently blowing up everybody loves them. I've never seen one before I've never tried one before they're called Fidget Spinners, I'm telling you. I'm just learning about this right now as we go. I got a note from a friend of mine He's actually not a friend and he knows me. I don't know him. I know him now the company is Fidgets Spinners from The Village of Wellington Small Village named Wellington which is apparently also in Ontario so he's not too too far away Apparently these things are super popular right now for people who like to fidget if you're one of these people i'm one of these people. I got my leg the leg is tapping all the time right uh You should see me. What does he say ADD? ADHD? one of these can apparently help. It's like a stress reliever now You've probably seen spinning tops before this is like a different take on a spinning top You don't need a platform to spin it on it spins in your hands You keep this in your pocket your fidgeting with the Fidgets Spinner and apparently it is a very Satisfying experience now they don't look like much they look kind of bizarre actually I believe you hold it there oh oh ho oh There's ball bearings in there you hold it there like that, and then you spin it and of course it spins way longer than you expect it to And it makes this very satisfying noise. listen. Wo ho ho ho ho and you and you know what you do. You keep looking for the perfect spin They're all the craze right now all right these things are blowing up. Here's a different style How do I hold this one, hold it right here? okay? Oh this one this one's more precise Oh, you gotta hold that one. Well that's like an unbalanced one there's nothing satisfying to me about this one ooooh You see now that... I got no ADD anymore. I'm cured. I'm probably doing wrong. People are going to tell me I'm doing it wrong. Why is this so satisfying The sound or the smoothness of it all right hold up. There's one more in here, and it looks the most elaborate Look at that one oooooooh Absolute champion right there The key is it has to be perfectly balanced weight-wise so each Peg has to be identical to the other side it has to be balanced and then on the inside you have a ball bearing you know something like you would normally have on a skateboard or something like that so if I spin it around, and then put my finger horizontal look at this it justs balances it right there like that. See that Jack. like that Boom. Oh, man Are you picking that up Jack how satisfying that i.. like how badly do you want to spend one of these right now? And and Meanwhile you're like, but I don't get it's just spinning I'm telling you got to try it you gotta spin the thing And then you realize that you put one of these on your desk at work I feel like you could deal with all the stress in the world give her a good swing Just like you know what it's Gonna be alright Just spinning like the universe right now it's deep man.... i fell like i'm understanding the craze now This is what I'm here to do I'm here to tell you when the new craze hits bring it to you first on unbox therapy i mean I'm pretty sure we're not first here But now you know. It's not going to solve real problems right get your life together you gotta wake up in the morning You can't like completely neglect your responsibility You can't not take the garbage out. Just cause you have a Fidget Spinner here, but when you need a little Pick-me-up, you take a sip of coffee Take your spinner *Fails at spinning*",
    "transcript_keywords": [
        "Wellington Small Village",
        "hold",
        "called Fidget Spinners",
        "apparently",
        "Fidget Spinners",
        "Fidgets Spinner",
        "people",
        "spin",
        "Satisfying",
        "Fidget",
        "Spinner",
        "spinning",
        "Jack",
        "Fidgets",
        "Spinners",
        "Unbox Therapy",
        "Village named Wellington",
        "things",
        "Wellington Small",
        "Small Village"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Ontario",
        "Peg",
        "Fidgets Spinners",
        "Absolute",
        "first",
        "Pick",
        "Unbox Therapy",
        "The Village of Wellington Small Village",
        "Wellington",
        "ho",
        "Fidget Spinners",
        "lou",
        "ho ho ho ho",
        "Jack",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORDINAL",
        "EVENT",
        "ORG",
        "GPE",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}