{
    "id": "EiTJBa8RpWI",
    "title": "Apple Fitness+ Studio Tour!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-05-03T14:00:59Z",
    "video_url": "https://www.youtube.com/watch?v=EiTJBa8RpWI",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Apple Fitness+ Studio",
        "Apple Watch",
        "iPhone",
        "Fitness"
    ],
    "views": 170870,
    "likes": 8381,
    "comments_count": 391,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and today I'm getting a chance to do something that I have wanted to do for a very long time. And that is visit the Apple Fitness+ Studio. I am absolutely just so excited because I have been such a huge fan of Apple Fitness+ and if you guys aren't familiar with what that is, it's a companion fitness app that goes with your Apple Watch. So you're able to do a ton of different workouts from hit, dance, meditation. They have yoga, they even have specialized classes that they just launched not too long ago for things like getting ready for ski season. And they also even have on the apple watch Time to Walk, Time to Run where you have guided walks, guided runs outdoor and it's just a really cool experience. And since it's launch, I was so blown away with the production value. The trainers that they have are all incredible. Every single class that I've ever taken on Fitness+, I never felt like I had my time wasted and I've tried a lot of fitness apps and I've tried a lot of fitness accessories. And as someone who has taken all of these fitness classes what I was so just blown away with with Apple Fitness is how thoughtful the classes were developed. And it didn't really seem like that was intentional until I actually visited the studio and realized how much goes into just producing one of those episodes. Like this studio is state of the art. They have over 27 trainers currently. They have like 13 cameras. And they have this one big fitness studio and the way that they have the camera set up is it's like this robotic system. They have a grid of lights. The cameras are controlled from a control room, they have those also mounted into the ceiling and they have some on the ground as well. The way that this studio is set up is you don't really need that many people in the actual studio, just the trainers. And actually getting a chance to go there at the studio and see how my much preparation actually goes into one episode, like they're all shot live but to get to that point, there's so much that goes into it behind the scenes. - Hi, I'm Jay Blahnik, welcome to the Fitness+ Studio in Santa Monica. I'm the vice president of fitness technologies for Apple. - I can't believe I'm here right now. - We are so excited to have you. It's really amazing that we've finally been able to bring in some special guests and we're thrilled that you are one of the very first. - I mean, this has been something I think that I've wanted to do since like the first class that I ever took. I was like, what are you guys doing here? This is so incredible. And the fact that you're in Santa Monica and it's so beautiful and it's just, it honestly is a dream come true. - Well, we're really glad you were able to make it today. - So what's it been like for you kinda seeing this all evolve? Has it been like a year and a half? - Yeah, it's been a little longer than a year and a half. We launched in December 2020. And you know, we launched with incredible workouts across a variety of workout disciplines and a beginner program to get started. But we have been innovating month after month during that year and a half timeframe to just try to bring as many experiences as we can to users. We know that different things motivate different people so we came up with a great audio walking program with Time to Walk and then we've offered guided meditation. We added Pilates, we've got a new program called Time to Run. Really just leaning into the idea that Fitness+ is a service to welcome everyone no matter where they are on their fitness journey and they can do it anywhere anytime. - So as an episode is being shot with a specific trainer they're also working on the one for the next week and that's something that's great, is there is new content every week on Apple Fitness+. And because they're turning out this high quality 4K content like there has to be an incredible workflow and getting to just sort of be there and experience it and get a chance to talk to the trainers and see the process in action was really, really cool. - Hi, I'm Jessica. Welcome to the Fitness+ Studio in LA. - I am so excited to be here. It's just so incredible like what you guys have created and what has this been like for you kind of just seeing through the process and creating these classes and helping so many people around the world? - Oh, well thank you for coming here, it's amazing. So my favorite part of the process is probably the rehearsal. That's where the real collaboration happens. So we get assigned our workouts, we create them and then the final step between that and coming on set is being able to rehearse with your teammates, where you start to bounce ideas and really dial into the detail. - The trainers all kind of work together on the specific episode and they run them by several different people to make sure that the actual workout that they are doing flows, that it works with different body types and it's just a comprehensive workout altogether. And that's what I love is I feel like you can always come back, there's new content and you guys are continuing to evolve this too with like the Time to Walk. I was so excited about the Time to Run too 'cause I was like is there gonna be some running classes outside but what can we expect? I think that's what's so fun is you're kind of surprising us with all of these new little goodies. - Well, we've had a really great time innovating and we're just gonna keep pushing, you know? We're really committed to this notion of trying to welcome as many people as possible, regardless of where they're at in their fitness journey. So it'll keep coming. - And in the classes, they always have other trainers from different disciplines. So you might have people in dance or hit kind of taking a tread workout. And it's really fun because those will be modifications. So most of the time you can find one of the trainers to follow that fits your fitness needs. So is there anything that you could give for anyone who has never kind of used this before or if they've never started working out like what's your best piece of advice? - My best piece of advice is just know that we all start this beginner so come as you are. And there really is something for everyone, whether you start with a five minute mindful cool down and that's how you end your workout and you build up from there. So every workout counts, every moment counts. And then yeah, our real aim is just to help you live a better day. - But to really be able to go there to the studio and actually kinda see it all happened was really awesome. And I being a huge editing and tech nerd to see this studio, it was absolutely beautiful. From the ground up everything was so just immaculate as you would expect from Apple. And it's so cool because the way that the studio was lit, everything was lit perfectly matter what set you were shooting on. And just being in the studio like you guys, it's mind blowing. And I've been in a lot of studios over the years in Los Angeles and this is like I've never experienced something like this. - It's a pretty amazing place, we took inspiration from our retail store. Some of our really amazing retail stores around the world. You know, one of the things we always notice is if you look in, it's not uncommon to see an eight year old next to an 80 year old and we thought that's the same kind of inspiration we want for this studio, a place that everyone will wanna work out in, a place that feels inviting and welcoming. But of course, to be able to release the amount of content that we release every week across so many different workout disciplines, guided meditation, our audio programs, it needed to be state of the art for us to be able to put out that much content each week. So there are things here in the studio that you wouldn't see anywhere else in the world. And we're pretty excited about the way it's all come together. - It's amazing and I feel like you guys launched at such a perfect time where people weren't able to go out. One the way that everything just works with the Apple Watch, it's all so thoughtful and I think even just visiting you guys here it's even more thoughtful than I ever thought. - Oh, that's amazing, we love to hear that. You know, we obviously been working on Fitness+ well before the pandemic but we were really thrilled that it was able to come out at a time when maybe people needed it the most. And now that people are sort of getting back to a slightly more normal life, we're also really thrilled that it's designed to be able to use anywhere anytime. And the trainers are incredible. They do feel like your best friends and you've got a chance to meet a lot of them today and you know some of them and I think one thing that's really clear when you meet them is they are exactly who they seem to be in the service. They're really inspired by the idea of helping people get fit no matter where they are starting and it's just awesome. - Unfortunately, I couldn't film a lot in the studio but I did get to see how everything works basically from start to finish. And it was very fascinating to just see this production up and running. And while we were there they were actually filming a live workout, so I'm excited to see that workout in a later launch down the road. When that one actually comes out, I'm gonna be like, I was there, I saw that happen. I also love that throughout a lot of these workouts, they do use a ESL and this was also very fascinating. They actually have the trainers take ASL classes every Friday, so that they're able to further improve their sign language when they're incorporating those into their workouts. And I thought that was such a great idea and I've been very fascinated by ASL and I've kind of actually wanted to take it myself. So I think I'm just gonna start going down to the studio and be like, hi guys, Justine here, I'm here for the trainers ASL classes, I'd like to, do we get report cards? I'm not sure. - Hey, what's up? I'm coach Bakari. - Thank you so much for joining me here. Like this is honestly a dream come true being here and like meeting you guys who I see all the time like on my iPad when I'm working out. So what is it like for you to know that like you've been impacting so many people around the world? - I would say that that is, that's the best part but that's also the inspiration and it's why we do it. It's why we hustle, it's why we take time with the workouts because the goal is to bring our best work and energy here and to give it and share it with the world. - I mean, I'm honestly speechless walking in here. Like it is a dream come true. So what's that like kind of being in this space and just really experiencing like the state of the art, the most high tech fitness classes in the world? To be honest, it makes you feel really good. And it definitely makes it really special like everything from the garden in the background to the ring wall when we're doing hit and things like that. So I think it just has its own special energy and we do feel like everything is top class 'cause we're here to do our best work. And again, to just give that to other people. - I can't actually believe right now what's happening, I'm inside of the Apple Fitness+ Studio and I have taken so many of their classes and it feels so strange to actually be here because this is something I wanted to do for so long. And the fact that I'm actually here inside of the studio, it is by far the most incredible thing that I have ever seen. Like the lighting, the cameras, it is so just, ugh, I'm speechless. Thank you guys so much for watching. I had the best time getting a chance to check out this studio. It is by far the most incredible thing that I have ever seen. So I look forward to taking some more classes and yeah, that's it, I'll see you guys in the next one, bye. (soft upbeat music)",
    "transcript_keywords": [
        "Apple Fitness",
        "Fitness",
        "Studio",
        "time",
        "Apple",
        "apple watch Time",
        "Apple Watch",
        "guys",
        "people",
        "classes",
        "trainers",
        "workout",
        "kind",
        "fitness classes",
        "incredible",
        "fitness studio",
        "workouts",
        "big fitness studio",
        "world",
        "excited"
    ],
    "transcript_entity_values": [
        "Time to Walk",
        "the Fitness+ Studio",
        "the Apple Watch",
        "an eight year old",
        "one",
        "iPad",
        "27",
        "the next one",
        "Apple",
        "Justine",
        "the Apple Fitness+ Studio",
        "every week",
        "4",
        "Time",
        "the Time to Walk",
        "a year and a half",
        "the years",
        "13",
        "Los Angeles",
        "LA",
        "December 2020",
        "each week",
        "80 year old",
        "that year and a half",
        "Pilates",
        "Jessica",
        "Apple Fitness",
        "today",
        "Jay Blahnik",
        "month",
        "first",
        "Santa Monica",
        "Apple Watch",
        "five minute",
        "Bakari",
        "the next week",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "GPE",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "GPE",
        "ORG",
        "TIME",
        "PERSON",
        "DATE",
        "CARDINAL"
    ]
}