{
    "id": "ejwlrroiVOM",
    "title": "The Xiaomi Mix Is A Slippery Slice Of Incredible",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-12-31T02:24:40Z",
    "video_url": "https://www.youtube.com/watch?v=ejwlrroiVOM",
    "category": "People & Blogs",
    "tags": [
        "xiaomi mix review",
        "xiaomi mi mix review",
        "xiaomi mi max",
        "bezel less phone",
        "bezel less",
        "bezel free",
        "all screen phone",
        "biggest screen",
        "xiaomi mix",
        "mi mix",
        "michael fisher",
        "mrmobile",
        "android central",
        "futuristic phone",
        "the expanse phone"
    ],
    "views": 556176,
    "likes": 12460,
    "comments_count": 935,
    "description": "Most smartphones are pretty cool, but only some make you feel like you're holding a little piece of the future. The Xiaomi Mi Mix is one of these: a nearly-bezel-free display nestled in a frame of slick ceramic, it looks like it was dropped by a visiting time traveler from a very opulent future. The price tag surely matches the fit and finish, so is it worth the effort and expenditure of importing one of these elusive overseas smartphones to the US? Find out in MrMobile's Xiaomi Mi Mix review!    [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Xiaomi Product Page at GearBest:   Xiaomi Mi Mix [4GB/128GB] at GearBest:   Xiaomi Mi Mix [6GB/256GB] at GearBest:   Star Trek USS Enterprise backlit schematic:   Star Trek Isolinear Chip Coasters:   ALL WALLPAPERS via Backdrops Pro and Wallrox, apps available in the Google Play Store.   [ABOUT THIS VIDEO]  MrMobile's Xiaomi Mi Mix review was produced following a week with a Xiaomi Mix review unit provided by GearBest [ The device was tested on T-Mobile US in Greater Boston and paired with both a Vector Luna smartwatch and Moto 360v2.    [GRAPHICS CREDIT]  \"Old TV set\" image by tomislav medak, presented unmodified and available here: [ Used under the CC Attribution 2.0 license: [   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Beach\" by JAM Studio, available at Premium Beat:   \"Mind in Motion\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [IMAGE CREDIT]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/gj",
        "http://mrmobile.tech/eh",
        "http://mrmobile.tech/ei",
        "http://mrmobile.tech/br",
        "http://mrmobile.tech/c6",
        "http://mrmobile.tech/em].",
        "https://www.flickr.com/photos/tomislavmedak/3804053850].",
        "https://creativecommons.org/licenses/by/2.0/]",
        "https://www.premiumbeat.com/royalty_free_music/songs/beach",
        "https://www.premiumbeat.com/royalty_free_music/songs/mind-in-motion",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mister Mobile] It defined the look of television sets for half a century, and it's a fun and functional part of wristwatches the world over but when it comes to smartphones, bezel is a bad word. Over the years, phone makers have shaved the frames around their displays millimeter by millimeter, and this year, someone finally decided to dump it almost entirely. I'm Mister Mobile, and this is the Mix, a ceramic slice of the smartphone future from Xiaomi. (light music) Right upfront, you need to know this. I like this phone a lot, and the reason I phrased that like a disclaimer is that I like it despite the disappointments and downfalls, despite the fact that I personally wouldn't choose it as my daily device. See, I'm pretty disposed to respect most things that challenge the status quo, even sometimes something that's different just for the sake of being different, and the Mix is made to impress. It isn't like Sharp's Aquos Crystal from 2014, which made liberal use of soft plastic. The Mix takes the idea of a future phone and runs with it, from the ceramic shell to the splendiferous spec sheet. Even my lower end model packs some tough shelf hardware, and the deluxe gold-accented version steps it up even further. Both trims are available globally from several retailers including Gear Best whom I thank for this review device. Links in the description below. If you miss the days when your latest smartphone would turn heads on the street, the Mix has your name all over it. The glossy body glistens and the massive IPS display gleams. The only concession to a bezel, the thin strip along the bottom containing the selfie camera and notification LED. Around back, the main camera and fingerprint sensor are identically proportioned and well-positioned. I seldom had trouble unlocking the phone by feel. Sitting there on a table, the Mix reminds me of the Sony Xperias of yesteryear but in hand, it completely stands on its own. I've never used a device like this. As with any mold-breaker, that comes with some caveat. First off, it's no coincidence that this is one of the few devices that comes with a case in the box. The mirror finish in addition to showcasing fingerprint also makes the Mix the slipperiest mobile I've ever held. Now lots of phones will slide off a table. That's nothing new but the Mix will literally slip out of my hands if I'm not gripping it tightly enough, and while this unit has survived a few falls onto hardwood, the combination of the brittle ceramic shell and various scratch-prone finish make me much more afraid of dropping this phone. Oh and it is a phone so let's talk about voice calls. The Mix is bad at them. See, to project sound without using a conventional earpiece, Xiaomi implemented some fancy components that basically vibrate the device's frame to make noise. It's loud but also raspy and omnidirectional. If you're talking a call in a quiet room, don't expect any privacy. Also the ultrasonic proximity sensor, which turns the screen off on calls, is less reliable than its IR analogs. All in all, this is the last modern phone I'd choose to put up to my ear for a call. Fortunately the built-in speaker phone is plenty loud, and of course there is Bluetooth if you want to bring your own speaker. Let's talk software. This is my first experience with Xiaomi's MIUI skin, and at first I was pleasantly surprised. Little touches like curved corners and understated animations go a long way toward making a phone feel special. There are practical improvements too. Moving icons between panels is a lot easier here than on other phones for example, and I always appreciate it when a manufacturer puts in that swipe down on the home screen to get to the notification shade shortcut, and if you're a fiddler, there are more customization options in this settings menu than I've ever seen. My favorite so far, converting the battery meter to a bar spanning the top of the display, and that battery is great. Over the course of my first week, I never saw the power meter dip into the red before bedtime. The combination of a large battery and aggressive background memory management makes the Mix a very long-lasting device, one that you can forget to charge overnight and probably still make it to the following evening. Here's a thing though, if you're using the Mix in the States, you need to remember that it wasn't designed to operate here. You don't even get an option for USA in the initial setup screen so it'll only work on some local 4G bands. Just as important, the software isn't optimized for the West either so while the international version ships with Play services, Google features don't always work right. - [Google] Actually I can't do that while the device is locked. To keep going, go ahead and unlock your device. - [Mister Mobile] Also the Android underpinnings here are built on the older Marshmallow. We're still waiting on Nougat, and as you can see, we're stuck on a three-month-old security update too. Yay. Oh and don't expect to get reliable Gmail notifications without jumping through some settings hoops. I shouldn't need to say this but not getting email alerts in 2017 is... Bad. Speaking of bad, let's check out the camera. If you mostly stick to Instagram, then the Mix will serve you fine just like pretty much every other high-end phone from the past few years but don't expect much more than that. Neither the sensor nor the post-processing are doing the Mix any favors especially in anything short of perfect lighting. In a vacuum, some of these samples are okay but put 'em up next to the Google Pixel's output, you start to see what you're missing. Color saturation, contrast, autofocus, the Mix is lacking for pretty much all of it. And video, which defaults to 720p for some reason, only magnifies these shortcomings. In other words, you shouldn't buy this phone for the camera, either back or front. So if you live in the US, should you buy this phone at all? Well if you've got the stamina to spend a few days calibrating the interface, and the tolerance for lackluster photos that often need filters to make 'em look good, then yes, go for it. Now I don't mean to be so flippantly backhanded. That would be a totally ridiculous set of compromises to make if you weren't getting so much in return on the hardware, namely one of the most futuristic designs in modern mobile tech. For some folks, the hardware itch can only be scratched by iconic luxury branding. For others who want to feel like they're living in the expanse maybe, the Mi Mix is kind of the ultimate embodiment of the nerd dream, a concept phone offered for sale. It's beautiful, it's unusual, and it's just what the space detective ordered. If you think you want to get mixed up with a phone like this, a reminder that the links to order are in the description. Be sure to subscribe to Mister Mobile on YouTube for more on mobile tech video coming at you more often in 2017. Until next time, thanks for watching. Happy new year, and stay mobile, my friends.",
    "transcript_keywords": [
        "Mix",
        "phone",
        "half a century",
        "fun and functional",
        "functional part",
        "part of wristwatches",
        "wristwatches the world",
        "device",
        "Mobile",
        "Sharp Aquos Crystal",
        "make",
        "makes the Mix",
        "Mister Mobile",
        "Xiaomi",
        "Mix reminds",
        "camera",
        "phones",
        "bad",
        "phone makers",
        "future phone"
    ],
    "transcript_entity_values": [
        "Mix",
        "Nougat",
        "the Mi Mix",
        "First",
        "IR",
        "2017",
        "Aquos Crystal",
        "half a century",
        "YouTube",
        "Instagram",
        "Xiaomi",
        "Xiaomi",
        "States",
        "the years",
        "millimeter",
        "a few days",
        "three-month-old",
        "Mobile",
        "this year",
        "new year",
        "US",
        "first",
        "the past few years",
        "Google",
        "MIUI",
        "2014",
        "Gmail",
        "4",
        "the Google Pixel's",
        "Sharp",
        "Gear Best",
        "West",
        "USA",
        "Android",
        "my first week"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "FAC",
        "ORDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "GPE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "GPE",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "GPE",
        "ORG",
        "DATE"
    ]
}