{
    "id": "eJX-SJx-kQo",
    "title": "4K or 480Hz? This OLED does BOTH… Sort of - LG 32GS95",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-07-06T18:23:50Z",
    "video_url": "https://www.youtube.com/watch?v=eJX-SJx-kQo",
    "category": "Science & Technology",
    "tags": [
        "LG",
        "Gaming Monitor",
        "OLED",
        "480Hz",
        "4K 240Hz",
        "Dual Mode",
        "Integer Scaling",
        "CRT",
        "Motion Clarity"
    ],
    "views": 959852,
    "likes": 32177,
    "comments_count": 1286,
    "description": "Get 20% off DeleteMe US consumer plans when you go to   and use promo code LTT at checkout.  DeleteMe International Plans:   Check out the UGREEN 2-in-1 Magnetic Foldable Charging Station and more below: UGREEN 2-in-1 Magnetic Foldable Charging Station:  More UGREEN:   LCDs have been a compromise for ages, but OLED promised something different. Now that OLED is this fast, perhaps it can finally take over from the legacy of the CRT, thanks to one little trick  Discuss on the forum:   Buy an LG UltraGear 32GS95UE 240Hz/480Hz 32\" OLED Gaming Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:07 Trying It 2:43 EDID 4:01 Test Results 5:50 Scaling 9:05 Why Bother With 1080p? 10:00 Conclusion 11:34 Outro",
    "description_links": [
        "http://joindeleteme.com/LinusTechTips",
        "https://international.joindeleteme.com/",
        "https://amzn.to/3Rr8MHT",
        "https://amzn.to/4aZ2Lck",
        "https://linustechtips.com/topic/1575786-my-computer-thinks-this-oled-is-two-monitors%E2%80%A6/",
        "https://bit.ly/3XN7Dyv",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This is part of a new generation of OLED displays that LG is calling dual mode. It allows you to switch between the native 4K resolution and 1080p resolution. Wait, you must be thinking, I can do that on my monitor right now. Is my monitor dual mode or novemdec mode? Yes, but also no. If you have a modern display, it may be capable of interpreting a signal in all of those different modes, but only one of them is native, that is, able to be displayed cleanly without any scaling. That is the trick here, or at least it would be if it worked as well as this segue to our sponsor. Ugreen, their super compact 2-in-1 magnetic foldable charging station, features a 15 watt Qi2 charger for your phone, a 5 watt wireless charger for earbuds, and a passthrough port for plugging in a USB-C cable. Check it out at the link below. Before we get into the details, let's just try the two different modes because there is more to this than just setting it to the ideal mode and then forgetting about it forever. In theory, a display like this can offer the best of both worlds. Right now, what we're looking at is 4K 240 Hertz. Obviously, there's outstanding picture clarity, amazing motion clarity, but because of how human vision works, OLED is still gonna have some drawbacks compared to a classic CRT monitor. That is, unless you use black frame insertion to artificially strobe the image. Though, to my eyes, this is pretty darn clear, even with fast on-screen movements. But, it can be better. We experimented with this before we started, and it turns out, mid-game, at least in this game, I can just press the mode toggle button, and... Now, we're looking at 1080p 480hz. We still get the same outstanding HDR and color performance, but at this size, I would say the image clarity is a bit of a drag. The upside is that by running at a lower resolution, we overcome the limitations of our DisplayPort link, and we can run at a whopping 480 refreshes per second. Now, I already spoke about this in detail when I took my first look at Alienware's new 500Hz display, but in a nutshell... It makes more of a difference than you would probably imagine for reasons that we'll get into later. In terms of the subjective experience, it's great. Like, I just can't miss heads with this thing, you know? Got 'em! Which is really cool, but why can't I just go into the advanced Windows menu and change my refresh rate here? There, dual-load, right? Well, no. Since the days of this connector... Monitors have included a bit of metadata called an EDID. The EDID's purpose is to report the display's capabilities to any connected device, be it a computer or a game console or what have you. This monitor has two EDIDs, which can be toggled through the OSD or this little button right here. We extracted them, we ran them through an interpreter, and we had a look at the output and surprisingly... The only major difference is that the 4K mode will not allow the display to be driven past 240Hz, regardless of the configured resolution in the window settings, and the 1080p EDID doesn't list as many resolutions and maxes out at 1080p 480Hz. If you try to force feed it 4K resolution in 1080p mode, it will actually scale that input down to 1080p, and then back up again to the native 4K of the panel. Why did they feel the need to do this? Well, we have some theories, but let's come back to them after we've talked about the performance of the display and determined whether this thing is even worth jumping through all these hoops for. Starting with color accuracy, sRGB mode is solidly okay. The color temperature is a little cool, but if you don't know what that means, you're unlikely to notice it, and if you do, you can simply calibrate your troubles away. At least, unless you want to use gamer mode. Unfortunately, it is tuned for colors that are pretty, but not accurate. No problem, just ignore it then, right? I guess, but unless you're using one of the first four listed display modes, an extra frame of processing latency gets added. At 480Hz or 240Hz for that matter, it's not such a big deal. But if you use adaptive sync for smoother animations and your GPU doesn't happen to be god tier, it could be a problem for you. In HDR, we measured both low peak brightness mode and high peak brightness mode. Low is best viewed in a dim room, while high managed over 1200 nits in a 1% window for dazzling highlights. Now let's talk about responsiveness. This is a gaming monitor first and foremost, and both of the modes are great, but they have some small differences. Because it refreshes at half the rate, the 4K mode has inherently worse input latency. Of course, we're talking about a difference of about one millisecond, so who cares, right? Well, hold on. We've said for years that there's a point of diminishing returns past about 240 Hertz. But the reason that faster matters for OLED displays is because of how our eyes perceive motion. By switching more frequently, we will see fast-moving objects with better clarity. The 1080p mode has a curious trait of its own though. If you run it at a lower refresh rate, the latency goes up more faster than you would expect. Perhaps it has something to do with scaling those inputs. It is a 4K native panel, regardless of whether it's running in a 1080p mode. And scaling is impossible to avoid on a modern display, because these panels are made up of a fixed array of pixels that can't change in size or shape. By contrast, classic CRTs had no concept of physical pixels. They could adjust the beams to draw tighter lines for higher resolution, even if it came at the cost of brightness or refresh rate. Now, sometimes scaling can be simple. 4K happens to be exactly four times the number of pixels as 1080p, so that's fine. You just double in each dimension, and voila, perfect clarity just with bigger blocks. This is called integer scaling because the higher resolution can cleanly be divided by the lower one. 4K also happens to be divisible by 720p and for you retro gamers, 240p as well. So you would think that we would use that kind of scaling as often as possible. But as it turns out, most displays just throw a blurry and beginning filter on it and call it a day. Of course, this isn't most displays, is it? If LG expects you to use 1080p mode, it had better be clean, so how does it hold up? As it turns out, pretty okay. Even in 4K mode, it seems like it's trying to do integer scaling. It's sharper than you'd expect, but if you look closer, each 1080p pixel is offset down and to the right by half of a 4K pixel. Okay, hold on a second, half a pixel? You just told me they couldn't change size and shape. Okay, yes, but check this out. We've established that integer scaling converts four physical pixels into a single virtual 1080p pixel. If you offset that by half a pixel in each dimension, now that one pixel takes up nine at 4K, one in the middle and eight half pixels on each side. At first, we thought this must be some kind of intentional scaling thing, but after looking at how it affects the corner pixels. We think it's actually just an off-by-one error somewhere in the display logic that maps the scaled image to the panel. We get to see how well it actually scales if we try any other resolution, including 720p, and it gets blurred. This is unfortunate because they could have integer scaled 720p as well. That would mean that the lion's share of common resolutions over the past two decades would look perfect on this display at 480 Hertz. That would be awesome! If LG could rectify it in the future, but if not, it's a pitfall that hopefully at least other manufacturers who use a similar technology can avoid in the future. And in LG's defense, it's not really a deal breaker. In 4K mode, you can still use integer scaling on your GPU driver, or you can use upscaling methods like DLSS and FSR to render your games at a lower resolution for better performance, and then output 4K native from your GPU, which is obviously going to look perfect. The question then becomes, \"Why does the 1080p mode exist, and should you bother to use it?\" Well, our best educated guess for why the mode switch even has to happen is that the timing controller or the T-Con needs to be reset to change its behavior. Even though 1080p at 480Hz requires half of the bandwidth of 4K at 240Hz, 480Hz is fast in terms of time. So the timing controller probably can't directly address the- full 4K pixel grid at that crazy speed. So instead, it appears to use a technique called line doubling, scanning out each line of the image twice to reduce the processing load. We can verify that this is happening by looking at the pixels. Rather than being offset in both directions, as 1080p looked in the 4K mode, now the image is only offset to the right. In summary then, intriguing product. Hopefully it's a solution that we just won't need a few years from now, but... If you want tomorrow's technology today, and you don't mind pressing this switch, depending on what mode you want to run in and what game you're running, and also if you don't mind spending 1400 US dollars, you're getting a genuinely impressive piece of technology, even if there are a few limitations. It also makes me even more excited for the day after tomorrow. No, not that one. When we see updated T-Cons that can push even greater than 480 Hz, because with pixel response times that are in the point... Zero three millisecond range OLED has a lot more headroom to be pushed and while 600 Hertz or heck Even this 480 Hertz display is going to be endgame territory for most people Perfect to the eye motion clarity could require closer to a thousand Hertz or even more just So fast that if you blink you'll miss it like this segue to our sponsor. Delete Me! Privacy isn't just about individuals it's about families that's why Delete Me is expanding to cover everyone you care about. Their new family plans make sharing and caring as simple as it can get with their family account management you can easily add family members ensuring personalized protection for each person their privacy first design means every family member gets their own data sheet keeping their online footprint secure. From kids to adults everyone's covered reducing the risk of exposure spam and scams, and with simplified management overseeing your family's privacy has never been easier. Choose Delete Me for peace of mind for your entire family in the digital world. Check them out at the link below today and use the code LTT at checkout for 20% off. Thanks for watching guys go check out that time we pitted an OLED against an HD CRT for a little bit more on the importance of motion clarity. Let's go, finished the match!",
    "transcript_keywords": [
        "mode",
        "display",
        "scaling",
        "resolution",
        "calling dual mode",
        "pixel",
        "Hertz",
        "pixels",
        "OLED displays",
        "OLED",
        "clarity",
        "modes",
        "dual mode",
        "integer scaling",
        "half",
        "displays",
        "family",
        "monitor",
        "monitor dual mode",
        "native"
    ],
    "transcript_entity_values": [
        "1200",
        "nine",
        "DisplayPort",
        "one",
        "second",
        "1080p",
        "480hz",
        "four",
        "LG",
        "CRT",
        "first",
        "600",
        "Hertz",
        "5 watt",
        "USB-C",
        "DLSS",
        "integer",
        "T-Cons",
        "the middle and eight",
        "K 240 Hertz",
        "15 watt",
        "GPU",
        "Delete Me",
        "today",
        "the days",
        "1%",
        "the past two decades",
        "a thousand",
        "about one millisecond",
        "Ugreen",
        "FSR",
        "a few years from now",
        "OLED",
        "4",
        "20%",
        "half",
        "480",
        "the day after tomorrow",
        "about 240",
        "2",
        "500Hz",
        "Alienware",
        "EDID",
        "1400 US dollars",
        "240Hz",
        "only one",
        "two",
        "OSD",
        "1080p 480Hz",
        "tomorrow",
        "Zero",
        "480Hz",
        "years",
        "Windows"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "LAW",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}