{
    "id": "eL3fBhttgS0",
    "title": "OnePlus 7 Pro Review: Settle In",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-05-14T16:00:45Z",
    "video_url": "https://www.youtube.com/watch?v=eL3fBhttgS0",
    "category": "Science & Technology",
    "tags": [
        "oneplus 7 pro review",
        "oneplus 7 review",
        "oneplus 7 pro vs pixel",
        "oneplus 7 pro vs s10",
        "oneplus vs galaxy",
        "oneplus 2019",
        "best smartphone 2019"
    ],
    "views": 533932,
    "likes": 15722,
    "comments_count": 1612,
    "description": "Sponsored by dbrand. Get your OnePlus 7 Pro skins here:    [ONEPLUS 7 PRO REVIEW]  For years, Ive been recommending OnePlus phones as the best value you can get, period. Well, I've just spent a week and a half with the all-new OnePlus 7 Pro, and its the best value you can get  comma  in a certain buyer segment. Lets see what it means when OnePlus goes Pro in the OnePlus 7 Pro Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT THIS VIDEO]  MrMobile's OnePlus 7 Pro Review was produced following eleven days with a OnePlus 7 Pro review sample provided by OnePlus. Preproduction device running prerelease software.  Disclosure: OnePlus provided travel and lodging reimbursement to some members of the media to attend the OnePlus 7 Pro launch event in NYC, including MrMobile. No other compensation requested or provided; no copy approval requested or granted.   [LINKS]  OnePlus 7 Pro Review [Android Central]:    [MUSIC]  Lets Get It by Eternity Bro, available at Premium Beat:   Up Top by Tonemassif, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #oneplus7pro #oneplus7 #oneplus #smartphones #tech",
    "description_links": [
        "https://dbrand.com/mrmobile-op7",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://androidcentral.com/oneplus-7-pro-review",
        "https://www.premiumbeat.com/royalty-free-tracks/let-s-get-it",
        "https://www.premiumbeat.com/royalty_free_music/songs/up-top",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- For years I've been recommending OnePlus phones as the best value you can get. Period. Well, I've been using the all new OnePlus 7 Pro for a little over a week, and it's the best value you can get, comma, in a certain buyers segment. I'm Mr Mobile. Let's see what it means when OnePlus goes Pro. Folks, the most important thing to understand about this phone is that it's not competing in the same space OnePlus has dominated for the past couple of years. From the curved display to the triple cameras, this is aimed at people who are considering premium phones, like Samsung's Galaxy S10 family. Some dollar figures for context, those phones can had for between $749 and $999 depending on size and features. The OnePlus 7 Pro starts at $669. Putting itself within spitting distance of the Galaxy S10E says a lot about OnePlus' confidence. And the specs back it up. From the top shelf processor, to the optional 12 gigs of ram. It's also the first phone to hit the market with UFS3.0 storage. Twice as fast as the previous generation. When I said the OnePlus of this kind it seems like overkill the company said it goes hard on the specs so the phones will still run smoothly five years down the road. Speaking of smoothness, the 7 Pro is even slicker than past models. Oxygen OS is still the fastest form of Android I've used with a higher refresh rate the display is more buttery too and it's positively huge. OnePlus used two tricks to get a high screen to body ratio here. The first is an under display finger print scanner. Yeah, it looks like that pokey old scanner from last year on the 6T, this one has an optical sensor 36% larger. So instead of one of the slowest around, it's now one of the fastest. The other screen maximizing trick is a lot of fun. OnePlus moved the selfie camera to it's own little periscope that pops up when you need it and retracts when you don't. It also automatically stows itself if you drop the phone. I tested it with a few three foot falls and it always tucked quickly enough to save itself. As you can see from the sample photos this feature is a real crowd pleaser. People love it. As you subscribers know, I also love a camera with a lot of versatility. And with high resolution standard, ultra wide, and three x-tele photo options, this gives you lots of framing options. I've used the 7 Pro to photograph my step-dad's surprise birthday party, my adventures at Google IO, my collage professors retirement party in Virginia, and all the spaces in-between. And you know, it did fine. Which is to say it didn't ruin any of those memories for me with terrible photos, but you can already hear it in my voice, I definitely had to do more work than I would've liked to get those photos. The one thing there's a frustrating lag that makes the ShutterFire a quarter to a half a second after you press the button. So you get a lot of photos of people blinking in that moment when they think the photos already been taken. The 7 Pro also overexposes by quite a bit. More than other phones. So you need to manually crank it down so you don't blow out your highlights. And there's a softness to details on a whole. Especially when you're using the wide angle. Now to be fair, the ultra light cameras usually the most disappointing one on any smartphone, and OnePlus does some amazing black magic with distortion correction. Watch how the corners go from bent to squared up (boop) just like that. But, you know, tricks asides, every time I started to feel this is a camera I could use on a daily, another limitation would pop up. I was let down by the night scape low light mode. Which seems just as good at introducing noise into the shot as it is at brightening things up. It certainly can't hold a candle to night sight on the pixel phones. Then there's the fact that you can't use the wide angle camera in video mode. And videos themselves, they're fine, you know, I like being able to shoot in 4K60 and super slow-mo, and the stabilization is also good. But colors are just comically over saturated. Flesh tones like mine cook out to red, and the waters of Boston Harbor take on a look of the Caribbean. I'll shut up for a few so you can take in a few more samples judge for yourself. - And to be fair, a lot of phones have similar issues with their video camera. Many of which cost more than this one does. But it just seems like for years we've been asking OnePlus for a great camera, along with wireless charging, water resistance. And with the 7 Pro, it just feels like we haven't gotten any of that. - Camera aside, the company has a good answer for my other complaint. A proper IP certification would raise the price of each phone by $30 and most warranties don't cover water damage, even if the phone is IP certified. As for wireless charging, OnePlus points to two advantages. One: it's big battery really does last all day. In my experience it was more like a day and a half. And two: even if it doesn't, you can use the warp charger adapter in the box to juice up the phone from zero to 50% in 30 minutes. That's fantastic. And OnePlus also gets a golf clap for addressing long standing complaints. The new stereo speakers are loud and clear. The improved vibration motor makes haptic feedback much more pleasant. And the option to toggle DC dimming so the screen doesn't flicker on film, makes it easier for me to show all of you how it really looks in person. And bonus points for this nebular blue paint job. Probably the most beautiful OnePlus has ever come up with. Sponsor time: if you disagree, or you had to settle for the gray one, you wanna gussy it up, hit the link in the description to pick up a premium vinyl skin from my sponsor, Dbrand. Dbrand skins protect the phone, and they look great doing it. At the end of the day can I recommend the OnePlus 7 Pro? Yeah. But I do so with less than my usual enthusiasm. The simple fact is that a lot of folks buy phones based on the camera these days and less than a week ago Google started offering almost the best phone camera you can buy for $399. And for less than a hundred bucks more that the 7 Pro costs, you can get a Galaxy S10E with more features. If you know what a OnePlus is in the first place you'll probably be happy with it, and word is that T-mobile will have an even better deal on it than OnePlus.com. Also in the US the older 6T will drop to $549 to keep the budget shoppers happy. But in a world as turbulent as the mobile landscape currently is, the 7 Pro is not an amazing smartphone. Nor is it a particularly amazing value. It's just very good. And given the competition, very good feels more like the settling that OnePlus has historically encouraged us never to do. A big thank you to Alex Doubet for letting me use his footage to pair this one out. Be sure to check out Android's central review linked here and at Androidcentral.com. Disclosure for you folks, OnePlus covered travel and lodging costs to host some members of the media at the NYC launch event, including Mr Mobile. No other compensation was requested. No copy approval was provided. This review was produced thanks to a loner device from OnePlus. Until next time. Thank for watching. And stay mobile my friends.",
    "transcript_keywords": [
        "OnePlus",
        "Pro",
        "recommending OnePlus phones",
        "phones",
        "phone",
        "camera",
        "lot",
        "recommending OnePlus",
        "photos",
        "OnePlus phones",
        "Galaxy",
        "good",
        "years",
        "Mobile",
        "phone camera",
        "Samsung Galaxy",
        "Pro costs",
        "Pro starts",
        "cameras",
        "display"
    ],
    "transcript_entity_values": [
        "OnePlus 7 Pro",
        "4K60",
        "12",
        "the end of the day",
        "30",
        "7",
        "36%",
        "S10",
        "Samsung",
        "night",
        "6",
        "549",
        "IP",
        "the Galaxy S10E",
        "Alex Doubet",
        "last year",
        "Mr Mobile",
        "a few three foot",
        "the past couple of years",
        "NYC",
        "Google IO",
        "Boston Harbor",
        "Dbrand",
        "UFS3.0",
        "OnePlus",
        "US",
        "669",
        "first",
        "scape low",
        "One",
        "Androidcentral.com",
        "these days",
        "Google",
        "the 7 Pro",
        "two",
        "399",
        "years",
        "less than a hundred bucks",
        "the OnePlus 7 Pro",
        "five years",
        "Virginia",
        "DC",
        "between $749",
        "less than a week ago",
        "zero to 50%",
        "Caribbean",
        "999",
        "three",
        "one",
        "Android",
        "30 minutes"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "FAC",
        "PERSON",
        "DATE",
        "PERSON",
        "QUANTITY",
        "DATE",
        "LOC",
        "ORG",
        "LOC",
        "NORP",
        "ORG",
        "PRODUCT",
        "GPE",
        "MONEY",
        "ORDINAL",
        "LAW",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "MONEY",
        "DATE",
        "PERCENT",
        "LOC",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME"
    ]
}