{
    "id": "eL52H3mnHpI",
    "title": "Game Boy Advance Backlit Screen Mod",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2014-03-18T02:19:33Z",
    "video_url": "https://www.youtube.com/watch?v=eL52H3mnHpI",
    "category": "Gaming",
    "tags": [
        "Game Boy Advance",
        "GBA",
        "mod",
        "modification",
        "backlight",
        "backlit screen",
        "Nintendo",
        "Nintendo GBA",
        "Game Boy",
        "solder",
        "soldering iron",
        "hack",
        "hacks",
        "electronics engineering",
        "video games",
        "games",
        "Video Game (Industry)"
    ],
    "views": 409069,
    "likes": 4809,
    "comments_count": 667,
    "description": "I was getting nostalgic for GBA games, but hated the reflective screen on my original GBA. What to do? Mod it, of course!  Be sure to check out the follow up videos to watch my setbacks and ultimate success with this mod:  Follow up:  Tweak and final results:   -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Leandro Pulmones ( and Jason Shaw (",
    "description_links": [
        "https://www.youtube.com/watch?v=sVEV5MMeVPc",
        "https://www.youtube.com/watch?v=IsA5_TfnvGA",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "https://soundcloud.com/leandropulmones)",
        "http://www.audionautix.com)"
    ],
    "transcript": "Hey, everyone. It's Colin. Yeah. I'm goofing with game boys yet again today I'm going to be installing a backlit screen into an original [Gameboy] advance. If you've ever had one of these consoles You'll know that they shipped with just this really lame Reflective non backlit non front lit non lit at all screen That was pretty difficult to see under most conditions and always looked kind of washed out Well some genius out there on the [internet] figured out a way to swap out [that] boring lame screen For the backlit screen from a Gameboy Advance Sp Specifically you need the screen from an [ag] s 101 model You'll also need a special adapter cable And these are available at various places on the internet and all in all you'll only need a few tools and some really basic Soldering experience in order to put the whole project [together] so let's get going The first thing we'll need to do is get the GBa taken apart this is actually one of the easiest game boys to work on because there's relatively few screws, and they're in fairly obvious locations of Course you'll [need] to take the battery cover off first don't lose this There are seven screws holding the back of the GBA on Six of them around the perimeter are try wing and then there's a seventh Phillips head screw hiding inside that battery compartment The side pieces and shoulder buttons simply lift off Now we need to remove the circuit board from the front housing part of that involves disconnecting the display Ribbon cable here at the top Disconnecting the Ribbon cable from the socket that it's in is pretty straightforward [I] like to use a spudger for this, but if you've got longer fingernails that can work, too You just want to get the flat edge of the spudger underneath each side of this brown piece It's called a bail it applies Friction to that Ribbon cable to keep it inside the socket just work it from one side to the other and Sometimes you'll have to go back [and] forth because as one side releases the other side kind of gets tightened again Get them both loosened up the [bail] won't come out completely if it does you totally gooch tit With the pointed end of the spudger simply wiggle the cable free notice that the gold contacts are on the top There's nothing on the back Then get your Phillips head screwdriver out and remove the two or three screws holding the motherboard in if any of these rubber pads [stick] to it peel them off, and you know I'm going to take everything out here so I can clean this whole casing up It's pretty gross Yeah, yuck To pry the screen out carefully stick the flat edge of your spudger in Between the screen and the casing through this little notch pretty convenient of Nintendo to put that there don't you think? You may hear a little bit of snapping and popping sounds as the adhesive releases But if your general the screen will come out intact and undamaged like that So let's get this replacement screen kits stabbed open I bought it from a fellow in China who sold me both the special Ribbon cable and a replacement ags 101 screen. Oh Look at that. That's kind of nice you put my name on it inside the bag includes Both the screen and the Ribbon cable all preassembled for me plus Is you see that little red wire he was nice enough [to] solder that on there for me that means I only have one solder connection to make inside the Gameboy A Little bit of modification to the game boys front housing has to be done Because if you drop the new screen in there And look carefully you'll notice it doesn't quite sit flush in the back. See it's kind of tilted backward at an angle We need to shave out some of the plastic that's holding the screen away from the front bezel Specifically this portion right along here that all has to get trimmed down flush There's a few different ways you can do this some people use dremel --Zz I'm going to start off with these nippers and remove the biggest chunks of plastic Those nippers are still too big to reach some areas So then I got out a crap knife to shave down the rest of it This can be kind of long and tedious and a little bit messy, but you get the best can trol this way if You peel away the black adhesive gasket You'll also find a couple more nubby Plastic bits that need to get shaved down there on [the] right side over here, and then also on [the] bottom I've taken a break to clean up all the [plastic] bits it's all nice and [shiny] clean not gross anymore see the buttonholes are all cleaned out and We need to do a little bit more modification to this front bezel specifically We need to shave down this bit on this side as well as this bit on the bottom [I] will also be taking the opportunity to clean up along here where I cut previously just a little bit Our plastic bits are all cleaned and trimmed down sufficiently, so let's get this new screen dropped in there It comes with a protective piece of plastic on the front of it that Needs to get removed now be careful not to touch the screen with your fingers after this because the fingerprints will become quite [obvious] When you drop the screen in you'll notice that it kind of rattles around a little bit That's okay the pressure from the motherboard holding it in will keep it from going anywhere. You'll need to [adjust] this ribbon cable as well Because it's a little bit too long where it is and in isn't in the right place simply fold it into this z shape then drop all of your buttons and rubber Membranes back into place these have been cleaned up quite thoroughly as well and Then your motherboard goes on top Once you've got it in there. Go ahead and re insert your video cable and lock it down Then reinstall your screws Now's the [time] [to] deal with that red wire it supplies power to the screens backlight Over on the right side of the board here, you'll find a couple of components one [is] Da one the other one is labeled Da to That wire needs to get soldered to the upper left leg of Da one Simply tack the wire down with your soldering iron, and be careful not to short it against any other components once it's down I decided to route that wire above and below these two capacitors to keep it out of the way At this point. You simply need to reassemble the Gameboy and here's the finished product Backlit screen is really something that the GBa should have had from the start which could possibly explain why the GBa Sp Came out so relatively quickly. You may be wondering why I would want to do this mod at all Why not just go out [and] buy a GBa Sp Well the fact of the matter is I think the GBa Sp is Slightly too small the buttons are a little cramped and too close together [got] a little bit of a fail here yep, there it is that [Moa] and add to [that] the fact that Gba Sp is at least the [ags] 101 models tend to hold a decent value on eBay And I ended up breaking about Even between the cost of the kit which was 45 bucks with shipping from China and the cost of a used original [Gameboy] Advance about 20 bucks was shipping from wherever in the United States Generally, you're going to find at good ags 101 for about 60 to 65 bucks unless you want one That's all beat to hell, which you know I don't Now it's not all roses though either Because there is something I [think] wrong with this particular kit You can't really tell too well on video, but there's a reason why I'm shooting it in a dark room That's because with any sort of light in the room. It's really rather Dim I don't think the screen is quite getting all the power that it needs I did a whole bunch of research after getting this kit installed trying to figure out why the screen was so Relatively Dark, and I checked all the different solder points I checked all the different connections making sure I was connecting that wire to the correct component and everything looks okay? It doesn't look like I screwed anything up. [I] think it has something to do with that particular replacement flat flex cable because in some of my troubleshooting [I] Kept the Gameboy Advance taken apart turn to and wiggled some of the cables around and I found one particular [position] between that flat flex cable and the Motherboard that got the display looking Significantly better there was a lot more brightness and there was also a lack of this weird kind of Interference or graininess that you may notice in the screen here? It's very prevalent in real life, and I'm going to work with the seller to see if he has any ideas I wasn't able to try and get that cable positioned just right with that bail locked down [every] time I locked the bail down it kind of snapped the cable into position and made it look bad again [if] I do manage to get the whole thing straightened out. I will of course give you an update Ultimately, I think this was a worthwhile project not the least of the fact that I got a youtube video out of it I have the handheld that I really wanted from the beginning I remember getting my first game boy advance back when they came out in 2001 Firing it up and going this is really cool Oh except I can't see the screen and ideas one of those stupid Led Dongle lights that hangs over the front produces a ton of glare Having a backlit screen is really the way the console should have shipped to begin with and it's a bit unfortunate that it took over [10] years for [us] to finally get a solution, but as they say better late than never So with this mod out of the way what's next well? Here's a hint. Thanks for watching",
    "transcript_keywords": [
        "Ribbon cable",
        "screen",
        "backlit screen",
        "cable",
        "bit",
        "special Ribbon cable",
        "Ribbon",
        "display Ribbon cable",
        "kind",
        "Gameboy Advance",
        "side",
        "Plastic bits",
        "GBa",
        "front",
        "front bezel Specifically",
        "flat flex cable",
        "boy advance back",
        "advance",
        "back",
        "game boys"
    ],
    "transcript_entity_values": [
        "Gameboy Advance Sp",
        "Gba Sp",
        "Backlit",
        "45 bucks",
        "Nintendo",
        "seventh",
        "about 60 to 65 bucks",
        "two",
        "eBay",
        "China",
        "101",
        "z",
        "Phillips",
        "Ribbon",
        "Led Dongle",
        "about 20 bucks",
        "Motherboard",
        "GBA",
        "seven",
        "10] years",
        "first",
        "one",
        "gooch",
        "2001",
        "the United States",
        "Colin",
        "a ton",
        "Gameboy",
        "Relatively Dark",
        "Six",
        "three"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}