{
    "id": "eLBuUV6yEgI",
    "title": "I HAVE to use Bing now!?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-02-04T02:12:40Z",
    "video_url": "https://www.youtube.com/watch?v=eLBuUV6yEgI",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Bing",
        "Australia",
        "Google",
        "legislation",
        "link tax",
        "Google vs Australia",
        "Microsoft",
        "news outlets",
        "pay"
    ],
    "views": 699875,
    "likes": 58888,
    "comments_count": 2956,
    "description": "Learn through Problem Solving and the first 200 people can save 20% off today on Brilliant at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 omg thank uuuu 0:16 Microsoft backs Australia vs Google 1:15 Spot gets an Arm + more 2:04 HarmonyOS is just Android 3:01 Brilliant 3:45 QUICK BITS 3:49 Geforce Now on M1 Macs 4:20 SpaceX crashes another Starship 4:46 Cyberpunk mods are dangerous 5:08 Mass Effect Legendary Edition 5:37 Spinach emails or something  NEWS SOURCES  MICRO AGGRESSION Microsoft sides with Australia against Google      SEE SPOT LIFT, BRO Spot gets arm, cameras, self-charging     HARMONY THROUGH DUPLICATION Huawei HarmonyOS is just Android      QUICK BITS  GAMING MACBOOK Geforce Now supports M1 Macs in Chrome    A ROCKET CALLED GAMESTOP SpaceX crash lands another Starship prototype   civilian flight   DONT GET CYBERPUNKED Cyberpunk mods could make your PC vulnerable to hackers. Thats so cyberpunk    REMEMBER KOTOR? EA is confident in BioWare because remember they DID make good games at one point  Mass Effect Legendary Edition    FWD: RE: EAT ME Spinach is sending emails now   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/TechLinked/",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.reuters.com/article/us-australia-media-microsoft/microsoft-backs-australias-proposed-media-laws-eyes-expansion-idUSKBN2A307W",
        "https://www.ft.com/content/c8c73ed4-7869-4376-b591-d18a7a55bf5b",
        "https://www.theguardian.com/technology/2021/feb/01/microsofts-bing-ready-to-step-in-if-google-pulls-search-from-australia-minister-says",
        "https://ca.finance.yahoo.com/news/microsoft-backs-australian-plan-google-045805102.html",
        "https://linustechtips.com/topic/1301802-boston-dynamics-updates-spot-robot-lineup/",
        "https://www.youtube.com/watch?v=6Zbhvaac68Y",
        "https://www.youtube.com/watch?v=F843AqfNsaA",
        "https://arstechnica.com/gadgets/2021/02/harmonyos-hands-on-huaweis-android-killer-is-just-android/",
        "https://www.theverge.com/2021/2/2/22262527/harmonyos-huawei-us-ban-android-google-ars-technica",
        "https://www.androidauthority.com/harmony-os-ars-technica-1197580/",
        "https://www.slashgear.com/huawei-harmony-os-2-0-revealed-to-be-an-android-fork-with-many-hurdles-02657810/",
        "https://appleinsider.com/articles/21/01/31/nvidia-geforce-now-client-adds-apple-silicon-support",
        "https://gizmodo.com/nvidia-geforce-now-game-streaming-just-got-support-for-1846172598",
        "https://www.theguardian.com/science/2021/feb/02/spacex-starship-rocket-test-flight-explodes-elon-musk",
        "https://youtu.be/_zZ7fIkpBgs?t=706",
        "https://mashable.com/article/spacex-civilian-mission/",
        "https://www.engadget.com/cyberpunk-2077-mods-exploit-warning-185732570.html",
        "https://twitter.com/CDPRED_Support/status/1356604047671898112",
        "https://www.kitguru.net/gaming/mustafa-mahmoud/ea-is-very-very-confident-about-biowares-future/",
        "https://www.youtube.com/watch?v=T7K7gMYLp2E",
        "https://linustechtips.com/topic/1301350-can-my-spinach-send-me-love-letters/",
        "https://www.euronews.com/living/2021/02/01/scientists-have-taught-spinach-to-send-emails-and-it-could-warn-us-about-climate-change",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(upbeat music) - Oh! They clicked it! Guys! Guys! (snaps fingers) They actually clicked on it! - Yeah! They clicked it! Yeah! - Whoo! - Let's go! - Yeah! Oh, I love you so much! - Thank you. God bless you. (crew laughs) - [Riley] Thanks. Thanks, guys. - Microsoft has sided with Australia in their feud with Google. You see, last week the Australian government proposed new laws that would force Google to pay local news outlets for the privilege of indexing their content. Google's obviously not a fan of the idea so they threatened to leave the country altogether. Well, Microsoft was more than happy to step in with their own little search engine, Bing. - What one's that? - You know the one. The one that opens every time you start an Edge browser. You know, every time you mistype something in a Windows search, even if your default browser is set to something else... It's super annoying, but apparently the Australian government would rather deal with that instead of working with Google on this, especially after Microsoft says the proposed legislation reasonably attempts to address the bargaining power imbalance between digital platforms and Australian news businesses. - [Riley] Reasonable? - Honestly, I'm starting to think Microsoft actually has it out for Australia. They wanna unload Bing onto the island like a cargo ship that the front fell of. - [Riley] That's a reference. - You'll never be able to get the Bing out! Boston Dynamics is continuing its slow replacement of human life with the announcement of some fancy accessories for its dog-like robot Spot. The company had shown a prototype arm attachment for the unfeeling creature before, but there's now an official ready-to-ship version that Spot can use to do, well, things that arms can do, like turning handles, pulling levers, and jabbing through multiple layers of human flesh. - [Riley] They didn't demo that. - There's also a camera package with 30-times zoom and thermal imaging, as well as a charging dock Spot can park its ass on. For now, human operators can control the robot (chuckles) through the new Scout browser-based system. But who knows how long it'll be content to just follow orders? - I mean- - You know? \"I can't let you do that, Riley.\" - [Riley] Ha! (James and Riley laugh) - \"Ow! My nipples!\" (laughs) And Huawei's Harmony OS, the operating system meant to replace Android on the company's phones, has been tested out by the folks at Ars Technica, who found that... Yeah, uh, it's Android. Literally, it's Android. Huawei's brand-new OS appears to be a fork of Google's with the word Android removed and replaced with Harmony OS. It was a bit of a disappointing result after the guys at Ars went through a two-day background check that included sending copies of their passports to the Chinese government. - [Riley] No! - [James] Also, they weren't actually allowed to install the OS on their phones. Huawei's developer program involves streaming from a phone running Harmony OS back in China. So go read the Ars Technica piece and feel a less FOMO around the normal, boring Android version you're currently running. - Aw, I wanna run- - Because no iPhone people watch this show. - [Riley] Aw, that's true. I'm sorry, guys. - Could you imagine someone with an iPhone having FOMO over Harmony OS? (James and Riley laugh) \"I want my phones built in China, not designed there.\" Now it's time for Quick Bits, brought to you by Brilliant, the website and app that makes learning accessible fun, and most important, 100% pretty cool. Instead of making you memorize facts, Brilliant's approach is based on problem solving and active learning with courses laid out like bite-sized pieces of a story you can interact with. But wait: \"Are there, like, tests? 'Cause tests are lame!\" Or, \"How 'bout grades? Those suck too!\" LOL, no, bruh. Just pick a course that you're into and get started, whether you wanna learn programming, brush up on your algebra, or find out what the heck a neural network is anyway. Are they inside me? Who knows? The first 200 people (chuckles) who head to Brilliant.org/TechLinked will get 20% off their annual premium subscription. So click the link below and get smart! Quick Bits, baby (Riley laughs) If you're a gamer, it's never made much sense to get a MacBook. Until now. Nvidia's GeForce Now cloud gaming service has been updated to work with Apple's M1 Macs, so can finally join your PC gaming brethren online, albeit with a bit of latency. But honestly, that's what you get. (laughs) That's what you get for wanting the best of both worlds, because there's only one world. Yeah, I said it. Narnia isn't real. Okay? - Oh, but Middle Earth is? - Yeah, but it's- - Yeah. - We're the bread. - Right. - Then there's Middle Earth. - Then there's the butter. And then there's the turtle, all the way down. - Turtle toast. - Gotcha. - SpaceX has launched and crashed another starship prototype in almost the exact same way as before. Don't you ever learn, Elon? After a successful belly flop maneuver, one of the rocket's engines failed to ignite, causing it to fall to the ground and explode. Look, it happens to the best of us, okay? (cackles) We all fall off countless times when we learn to ride a bike. Let's just hope SpaceX learns to balance before their civilian manned flight currently scheduled for the end of the year. CD Projekt RED has warned \"Cyberpunk 2077\" players against playing mods for the game right now because doing so could allow hackers to exploit a vulnerability which can be used to execute code on PCs. And this is a week after the game first received support for mods. Quite embarrassing, although I have to say it's also super cyberpunk. - [Riley] Don't run that mod! - \"My vision is augmented.\" Following the announcement of \"Mass Effect: Legendary Edition,\" which contains all three remastered original trilogy games and their 40 DLC packs, EA has said in an earnings call that they're very, very confident about BioWare's future. The timing seems to make sense since the OG \"Mass Effect\" games were the last time anyone remembers playing a good BioWare game. - Hey! - Oh! (snaps) Wa-bow! - Do you disagree, David? - Right in the kisser! - [David] \"Inquisition\" was okay. - [Riley] \"Dragon Age: Inquisition\" was okay. - But who doesn't love a good inquisition? And you've always been told to eat your spinach, but it's 2021, baby. Not baby spinach. Now we use spinach for sending emails! - [Riley] Ah! - Scientists from MIT have genetically engineered spinach with carbon nanotubes built into its leaves which emit a fluorescent signal when the plant detects certain chemical compounds in the ground. The signals are read by an infrared camera which can trigger a small computer to send an email. Okay, so the spinach plants aren't actually sending the emails. Also the study was done in 2016 but it went viral thanks to an article on Euronews... (Riley grunts) Just now. I'm bored. - [Riley] But carbon nanotubes! - Carbon spinach tubes? - [Riley] Yah! - Better end this episode now so you can go and get swoll like Popeye. Come back on Friday for more tech news. And you're gonna click that one too, right? We're gonna be waitin'.",
    "transcript_keywords": [
        "Yeah",
        "Google",
        "Android",
        "spinach",
        "Harmony",
        "Guys",
        "Ars Technica",
        "Microsoft",
        "Australian government",
        "Australian",
        "Mass Effect",
        "Bing",
        "time",
        "Spot",
        "Middle Earth",
        "clicked",
        "Ars",
        "Quick Bits",
        "Inquisition",
        "Huawei"
    ],
    "transcript_entity_values": [
        "SpaceX",
        "Ars Technica",
        "two-day",
        "100%",
        "three",
        "40",
        "Mass Effect: Legendary Edition",
        "Riley",
        "one",
        "20%",
        "iPhone",
        "MIT",
        "Google",
        "2021",
        "God",
        "Huawei",
        "EA",
        "FOMO",
        "last week",
        "200",
        "OG",
        "Bing",
        "GeForce Now",
        "SpaceX",
        "2077",
        "Microsoft",
        "Edge",
        "Windows",
        "Quick Bits",
        "Narnia",
        "the end of the year",
        "Projekt RED",
        "David",
        "China",
        "annual",
        "Friday",
        "Australian",
        "Popeye",
        "first",
        "Chinese",
        "Nvidia",
        "Elon",
        "Australia",
        "Android",
        "Ars",
        "BioWare",
        "30",
        "Harmony",
        "Euronews",
        "Boston Dynamics",
        "only one",
        "a week",
        "2016",
        "James",
        "MacBook",
        "M1 Macs",
        "Inquisition",
        "Quick Bits",
        "Apple",
        "Middle Earth"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "NORP",
        "PERSON",
        "ORDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "FAC",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "LOC"
    ]
}