{
    "id": "elGZzKm_ELw",
    "title": "Apple Watch Series 8 Review!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-09-15T13:00:33Z",
    "video_url": "https://www.youtube.com/watch?v=elGZzKm_ELw",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 935906,
    "likes": 25507,
    "comments_count": 1055,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey, guys. It's Justine. And today we are checking out the brand new Apple Watch Series 8. I am so excited about this because I have been using the Apple Watch since the first version. And I strongly believe that because I have been wearing an Apple Watch and I know what is normal for my body, that this has actually helped save my life this year. So if you guys haven't seen that video, I did post it on my channel. But long story short, I got a blood clot in my shoulder, and then I ended up getting a pulmonary embolism, which that clot then traveled to my lungs, which could be incredibly dangerous. If you're not familiar with blood clots, I'm actually the World Thrombosis patient advocate this year. And I'm so excited to be able to help spread this information and hopefully save lives because I am active, I'm healthy, I'm... Well, I'm not the youngest that I've ever been, but for me, it was kind of crazy because I never thought that something like this could ever affect me. And when it did, I realized how common it is. And if I could help bring this information to someone, it could potentially save your life. So come join me as we test this out, but first, we have to unbox it. Rewind! (tape rewinding) Today, we have the brand new Apple Watches in the studio. We have the new Apple Watch Series 8 and the new Apple Watch SE. Let's unbox. So we're gonna open up the Aluminum Starlight Series 8 first. Now, these are both Starlight, so they're gonna look very similar, but they're not. (gasps) The Apple Watch unboxing, it's so exciting. I love their packaging. I love the design. It's such a fun opening. Oh! Surprise. Oh, boy. Here you are. My little Apple Watch. I'm so excited because last year during my Apple Watch review, I had an injury. Oh, no. I'm not even a mile in, and sometimes hills bother my knee. And it almost gave out running down this hill. But I'm really excited this year because I feel like I'm all healed up, so I'll hopefully be able to get you guys some good content, as far as fitness is concerned. So this is the 45-millimeter Apple Watch Series 8. My old Apple Watch is the 41-millimeter, which I did pre-order the gold 41-millimeter, so I basically just did a simple upgrade that's pretty much gonna look exactly the same. But this is the 45-millimeter Starlight version. I love the Starlight. It's so pretty. I'm just gonna set my other Apple Watch aside. I'm sorry. You've been replaced. No hard feelings, though. All right, what do we have in here? We've got our Apple Watch charger. So I don't really ever use these ones anymore, but this is kind of cool because now you'll be able to charge the new AirPods Pro 2 case with an Apple Watch charger. Okay, here is our sport band. We also have some Apple Watch bands, as well, to check out. These colors look so good together. (gasps) Look at that. Beautiful. So here's the size difference between the 45 and the 41. Okay, we're gonna set this up really quick, and then we're gonna unbox the SE. (upbeat music) So while that's setting up, let's check out some of our Apple Watch bands. This is the Sequoia Pure Platinum Nike Sport Loop. This is the Elderberry Sport Loop. And this one is the Midnight Sport Loop. Oh! Are you done? It's done! Oh my goodness. Look at you. Look at you. Oh, you're so beautiful. Oh, wow. It's been a while since I've had the larger watch face. Oh, my sister's texting me. So the main difference with the Series 8, as opposed to the Series 7, is it now has a temperature sensor. And for me, I'm very excited about this because temperature sensing is such a huge part of ovulation and cycle tracking. So for everyone with a period, this is gonna be really cool. Now, the thing that was also kind of interesting is the only way that it will be able to do the temperature sensing is if you do wear your Apple Watch to sleep. Now, I definitely am not a huge fan of wearing watches to sleep, and I do have the Oura Ring, which I have been wearing for over a year, almost a year and a half at this point. And this also does temperature sensing, and it does your heart rate. It tracks all sorts of different types of things with sleep. So I really love wearing the ring as opposed to the watch, but I am definitely gonna try this out. And it'll be really cool to kind of compare the two and see how they differentiate. Now, what's interesting about the Apple Watch Series 8, as opposed to the Oura Ring, is this has two temperature sensors. There's one that's actually on your skin, and then there's another that's inside of the glass. So with that, it's able to get the temperature of the outside surrounding area, as well as the temperature on your wrist. So using AI and various different types of algorithms, it's able to determine a way more precise body temperature because it's able to see what the outside temperature is and your body temperature and then kind of configure that to get you the most accurate details. And it is going to take five nights of sleep to be able to start that prediction and get that in motion. So, unfortunately in this review, it may not be a full five days, so I might not be able to demo that feature, but I definitely will do a follow-up either on social or a whole separate video and show you how that's working. Now, when I do sleep with my Apple Watch, I like using one of these soft bands because they're so much more comfortable. So now, let's unbox some of these Apple Watch bands. So this is the 45-millimeter Midnight Sport Loop. So we're gonna open this one up. And this is gonna be the one that I'm probably gonna be putting on to wear. Look at that. Very nice. Although this looks so pretty. These Sport Loop ones are so much more comfortable. Oh, yeah. This looks great. This 45 millimeter is actually nice because this is gonna be a great transition into the 49-millimeter Apple Watch Ultra. Can't wait to get my hands on that one. Okay, let's check out these other two bands, and then we'll open up the Apple Watch SE. Oh, this one's really pretty. I like the elderberry a lot. This one's so nice, too. (upbeat music) So this is the 40-millimeter Apple Watch SE. Look at this one! Oh, I love it. It's like a little baby. Such a size difference. Definitely for my wrist, I do prefer the smaller Apple Watches, but looking at the 45-millimeter, it really does look so good. I'm so used to seeing the smaller one. So I can see so much more of this watch face. The one thing that I like, though, about the new SE is look what they did. They color-matched the back of the watch face to match the Apple Watch that you've chosen. So this is the Starlight, and it has a beautiful light Starlight back. So here's the size comparison. This is the Starlight 40-millimeter SE, and this is the Starlight 45-millimeter Series 8. You can also see the differences in the sensors because, obviously, this does have your temperature, your blood oxygen, your ECG, and this, of course, does not have it. So you can see the differences in the backs of the sensors. So those are a completely different sensor look. I do like how the SE color-matched the edge of the Apple Watch with the back now, so that looks really nice. So now everything is all set up. I'm gonna put this on and start testing. (calm music) So you might notice that I am wearing two Apple Watches. This is my Series 7, and this is my Series 8. I do have this hooked up to a demo account because I didn't wanna get any conflicting data and mix it in with my new account until I actually get my own personal watch. So this is my review device. Now, if you guys aren't familiar with the Apple Watch, it's pretty powerful. It can take your blood oxygen levels. It can track your heart rate. It can take an ECG. And now on the Series 8, it has temperature sensing. This is so useful for anyone who has a period. This will help us not only track our cycle, but it will also help you predict ovulation. And this is critical if you're trying to get pregnant or trying to not get pregnant. Thank you, Apple Watch. So one of the big differences with this new Apple Watch in comparison to the Oura Ring is this actually has two temperature sensors. So there's one that's actually inside of the glass, and then there's another that is close to your skin. So not only is it reading the temperature of your skin, it's also getting the outside temperature of your surroundings. So that'll be able to give you a more accurate prediction of what your actual skin temperature is. Now, because I've been tracking my workouts for so long, I'm able to go back in time and see my progress. Unfortunately, since I had that little health scare this year, my progress has declined. But I'm able to go back over a year ago, see where I was, and work my way back up. And to help with that, Apple Fitness has been such a game changer. With your Apple Watch, when you get one brand new, you get three months free to test it out. And there's so many different classes. There's yoga, there's HIIT classes, there's bugs all over here. There's dance classes, there's running. There's so many different activities that Apple has provided these super high-quality classes to help you get in the best shape ever. I actually got a chance to visit the Apple Fitness+ studios in Los Angeles, and it's so cool. The way that Fitness+ integrates with the Apple Watch is so incredible because you're able to do these classes, the Apple Watch connects to the class, and as the trainers are interacting and saying things like, \"Check your heart rate,\" those will flash up on the screen, and you'll be able to see that not only on your device, but also on your Apple Watch. This works on your iPhone, your iPad. They even have an Apple TV app. So pretty much wherever you go, you'll have access to fitness classes. I'm gonna start my yoga class now. Okay, here we go. - [Instructor] Also help to keep you feeling calm and super energized by the end... (upbeat music) - So this is my demo watch. I just got an award for my first yoga workout. It's also cool because when you do the classes, it'll give you a little update that says, \"You did yoga with Jessica.\" (upbeat music continues) So now not only are we testing out the Apple Watch, but this is also a little demo of Action Mode on the new iPhone 14. Now, I'm excited about some of the new features that they've added for runners. You can do this really cool thing called Dynamic Pacing, which to me kind of feels like when you're racing your shadow in Mario Kart. So even if I'm running the same route every single day, I'll be able to see if I'm getting any better. So in OS 9, this update is actually available to all Apple Watches dating back to Series 4. This will give runners access to their vertical oscillation, their ground contact time, and their stride length. So this is gonna be really awesome for people to be able to see how they're improving and things that they may need to do to actually become a better runner. Something else I'm excited about is you're gonna be able to have heart rate zones that are generated automatically, based on your past performance. This is gonna be so great for being able to track how well you're doing or what you might need to do to step it up. The heart rate never lies. (upbeat music) The Apple Watch plus Apple TV and Apple Fitness+ is such an incredible combination. Behind me, I have an entire fitness studio, right here on my TV, and I'm using my iPhone as the Apple TV remote. And I'm gonna be connecting this to my old Apple Watch. It'll look exactly the same on the Series 8. I'm only demoing this here because I already have it connected. And since this is my review unit, I don't have this connected to my TV right now. So I think this class is good. We're gonna do this HIIT with Jamie-Ray. It's a 10-minute pure dance. Get ready to see some moves. So we're gonna select this. And it's so great because this automatically will connect to my Apple Watch. It starts not only on the watch, but also on your TV. - Yes, yes. What's up in here, fam? - And you can see up here all my Apple Watch data. And here's my rings. (upbeat music) I just filled my exercise goal! Exercise ring has been closed! And here's the after workout summary. It's cool because not only do they show you this here on your Apple TV, you can get all of the important data, but of course, this will sync directly to your Apple Fitness app, and this goes directly to your HealthKit data. I also love when you finish your workout, if you have friends that you're sharing your activity data with, they'll actually get a little summary of your workout, and they'll show you which workout you took. So if they wanna take the same, they can just click into it directly from their Apple Watch, and they can take the same class. (upbeat music) Even though there are bike classes on the Apple Fitness+, it's really cool because a lot of the gym equipment will actually connect with your Apple Watch. So Peloton, for example, allows you to connect to your Apple Watch, and you'll be able to have all of your heart rate data show up on the device. Matt Wilpers, let's get it. So let me show you guys how this works. Just hold your Apple Watch up here. It asks to connect. I click Okay. - So stoked that you're here. Let's get the pedals moving. - Start class. Also, I put a link in the description. This little bike adapter, so key. - [Matt] We're gonna go one minute. (upbeat music) - There's so many different workouts that you can do on your Apple Watch. And when you click into the workout section, you could just choose the workout that you're doing. I'm gonna be doing an indoor run. Here we go. - What is up, Peloton? Matt Wilpers here. It's time for a five-minute warm-up run. - So since I do have a Peloton Tread, I do like taking these classes, but it's really cool because if I decide that I wanna take one of the Apple Fitness+ classes, I can just put this on manual, and I can take the classes on my phone in Apple Fitness+. So even if you don't have a tread that has classes, you can do running classes on Apple Fitness+. (upbeat music) So the Apple Watch SE is really interesting, especially from a price point, because the starting price for GPS is 249 and with cellular it's 299. Now, I feel like that is still a pretty high price point, but if this is something that you wanna get for your child, this is the best way to go because you'll be able to set up the family account so they don't have to have an iPhone, or even if you have a friend or somebody who might want to have an Apple Watch but they don't have an iPhone, you're able to set this up in the family account. And it's really cool because they have a lot of parameters that you can set. If it is for a child, you can set school time. So you can have access to certain apps, or you can block access to certain apps so that if they are supposed to be doing school work or they're in school, they won't be able to get distracted. Of course, the SE, because of the cost cut, you are gonna be cutting some of the features. You won't have the blood oxygen sensing, you won't have the ECG, and you won't have the new temperature sensing in the Series 8, but you'll still have all of the core features. Plus, it does have the crash detect, which I think is one of the most important safety features that Apple has implemented into all of their devices this year. (upbeat music) So the only time that your temperature is being recorded is when you sleep. And that's because when you're out and about during the day, you're running around, you're doing different activities, so you don't really have a constant temperature. And when you sleep, that's when your body temperature is regulated, and you're able to get a really good read. You will have to sleep with this for at least five nights to get your baseline body temperature. And I would recommend that if you don't actually plan on ever using these temperature features and you do have the Apple Watch Series 7, I don't really think there's a huge need to upgrade because the Apple Watch Series 7 is still an incredible Apple Watch. But if you do plan on sleeping with this and you do want these new features, like the longer battery life with the new temperature sensor, then maybe it is worth an upgrade for you. So the main new feature in the Series 8 is the temperature sensor and cycle tracking. So I'm gonna set this up now. And I have it here on my home screen. And when I click this, it tells you to open up the Health app and set up your cycle tracking. Oh, boy. When was my last period? Hold on. Let me look. Is this gonna be too much information for the internet? Do you guys need to know this? You probably don't need to know this, but we're gonna... Great. Now everyone knows what my last period was. Oh, great. This is also reminding you to set up your sleep schedule. Now, this isn't new to the Series 8, so this has something that you have been able to do in the past few Apple Watches is take your ECG. And it's pretty amazing that you're able to do this complex task on your wrist. So here's the sinus rhythm. That's normal. And here are some of the abnormalities, like the Afib, low or high heart rate, inconclusive. This is also kind of interesting 'cause it does tell you that it cannot detect a heart attack and you know what also it can't detect? Blood clots or a stroke. Now, that's where it's kind of interesting because I did have a blood clot and my Apple Watch did not alert me of it. But the things that it did alert me was my heart rate was elevated. And because my heart rate was elevated when I was not doing anything, that for me was abnormal. And that was one of the signs that I kind of realized something is not right. So while it may not be able to alert you of what's wrong, those little triggers can definitely signify something is wrong and you should seek help. So let's take our ECG. Shall we? (ethereal music) Sinus rhythm. This ECG does not show any signs of Afib. I actually got a little worried there. I was like, \"What if I'm filming this, and then I find out something's not right?\" (sighs) That would literally be just my luck. Now, this also pops up on the Health app, so you get a notification, and you can cruise in and see your full report. And what's great about this is you can then take this and send it to your doctor or send it to a friend. If you just wanna be like, \"Hey, look at my heart. It's cool, dude.\" I don't know. Whatever you wanna do with it. Make it an NFT. That's up to you. So while I was in the hospital, I was constantly being monitored for my blood oxygen level. But when I went home, obviously, I don't have a machine there to do that 24/7, except, yes, you do. You have the Apple Watch, which can also test for blood oxygen levels. So it will alert you if you have a low blood oxygen level, and you could test your blood oxygen level anytime. (upbeat music) Ooh! 99%. I keep getting so worried every time I take a test. I'm like, \"Is something bad gonna happen?\" We good, fam. We good. There are some new Apple Watch faces for the Series 8, but this is my favorite one. And this is what I go back to because it has all of my data and everything that I need. I've got my workouts, I can get to my messages, my cycle, and this is my heart rate data. So if I click on that, I can see what my current heart rate is, I can see my resting heart rate, my walking average, and all of the workouts that I have done. And up here, I have my rings. I like to have easy access to those to see if I need to do any more activities for the day or if I'm good to go. I also like that I can change the colors of this, too. You fancy. Now, the number one thing that I use my Apple Watch for, yes, it's great for tracking health and your fitness. But I use it to find my iPhone, more times than I would ever like to admit. At least five times a day. When you swipe up, you'll get this little notification panel so you can hit... Found it. I walk around my house like this all day long. So this does have an upgraded battery, so you'll get about 18 hours of battery life. Now, if you turn on low power mode, that can get you up to 36 hours. You'll still be able to use all of the core features, but a lot of the background things, like the blood oxygen sensing and the heart rate detection, that will be turned off until you go back out of low power mode, although crash detection is something new in the Series 8 and in all of the iPhone 14s. So they have now made it so that if you happen to get yourself into a car crash and you're unresponsive, the Apple Watch and the iPhone will automatically call the emergency response team, and they'll hopefully be able to get to you. I will not be testing out and hopefully will never have to use. Now, this isn't new to just Series 8, but watchOS 9 is bringing a lot of new features to not only the new Apple Watch, but also the older generations dating back to the Series 4. They now have the capability to be able to do multiple workout activities. So for things like triathlons, you'll be able to switch from running to cycling to swimming without having to start an entirely new workout. And also, they now have true sleep tracking. So you'll be able to track your REM sleep, and it gives you some updated graphs. Now, I personally don't sleep with my Apple Watch, so I'm really excited to kind of test this out a little bit further. I have tested it out in the past on my last review. I did sleep with it last night for the first time, and it was really comfortable because this is the Sport Loop, and it's soft. And I didn't even feel like I had something on my wrist, which was actually pretty exciting. I hate to keep talking about this crazy health scare that I had, but it literally changed my life. And I'd never had to take daily medication before. And trying to remember if you took a medication or not, I think it was one of the most difficult things. And you think that you would remember taking the pill. Could not, for the life of me, ever remember. So one of the new updates that they have in watchOS 9 is medication tracking. So you can put in the medication that you're on, and it will not only remind you when you have to take it, but it'll also alert you of any drug interactions. So if you're taking multiple medications and one of those may interfere with each other, it'll alert you and say, \"Hey, hold on a second. Contact your doctor. Don't mix these medications.\" And I think that's so incredible. And I never, ever, in a million years, would've ever thought that that would've been something that I needed. And hopefully I will never have to use it again. But I feel like, you know, I'm nearing the retirement home at this point, so I might be using it way more often than I might like. There's so many other things that I love about the Apple Watch. Another is the Apple Fitness+ workouts that they have. They have audio workouts where you can go outside and do Time to Walk or Time to Run. And it's really fun because you don't have to be inside just doing workouts on your TV or on your iPhone or on your iPad. You can actually go out and enjoy and listen to some really great audio prompts that they have. Time to Walk is actually really fun because they have a bunch of celebrities and well-known people, and they do little interviews with them where these people take you for walks and listen to some of their favorite music. Another thing that I like is they have the Mindfulness app. So if I need just a few minutes of some mindful meditation, I have that right here on my wrist, which I'm actually gonna do right now because it's almost time for bed. So let's do a nice little mindful meditation to lead us out of this video. Thank you guys so much for watching. I hope you enjoyed this. And if you have any questions about the Apple Watch, please leave them in the comments below and be sure to check out all the other videos that I have that are Apple-related, like the iPhone, Apple Watch ultra. It will be somewhere here in this end card. I look forward to seeing you guys in my next video. Don't forget to subscribe, hit the bell to be notified when I post a new video, and I'll see you in the next one. (upbeat music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Series",
        "Apple",
        "Watch",
        "Apple Watch bands",
        "Apple Fitness",
        "Watch Series",
        "Apple Watch Ultra",
        "Apple Watch charger",
        "Apple Watch data",
        "Apple Watches",
        "Apple Watch review",
        "Apple Watch connects",
        "Apple Watch faces",
        "incredible Apple Watch",
        "Series",
        "Apple Watch unboxing",
        "temperature",
        "fitness",
        "Apple Fitness app"
    ],
    "transcript_entity_values": [
        "the Oura Ring",
        "At least five",
        "one",
        "41",
        "Jamie-Ray",
        "just a few minutes",
        "one minute",
        "SE",
        "up to 36 hours",
        "Fitness+",
        "the Apple Fitness+",
        "five-minute",
        "the Apple Watch SE",
        "last year",
        "the Aluminum Starlight Series",
        "Dynamic Pacing",
        "HIIT",
        "HealthKit",
        "45-millimeter Series",
        "Apple Fitness",
        "AI",
        "first",
        "a full five days",
        "SE",
        "Series 4",
        "This 45 millimeter",
        "Apple Watch SE",
        "iPad",
        "the Elderberry Sport Loop",
        "ECG",
        "Peloton",
        "299",
        "the Series 4",
        "AirPods Pro 2",
        "41-millimeter",
        "a million years",
        "today",
        "an Apple Watch",
        "last night",
        "a Peloton Tread",
        "Apple TV",
        "OS 9",
        "49-millimeter",
        "second",
        "10-minute",
        "Justine",
        "Sport Loop",
        "five nights",
        "iPhone",
        "NFT",
        "GPS",
        "the day",
        "Los Angeles",
        "249",
        "8",
        "9",
        "a year ago",
        "about 18 hours",
        "45",
        "Matt Wilpers",
        "99%",
        "Jessica",
        "this year",
        "ECG",
        "The Apple Watch",
        "Matt",
        "Apple Watch",
        "the Series 7",
        "ECG",
        "Starlight",
        "the Series",
        "every single day",
        "Action Mode",
        "the Apple Watch",
        "at least five nights",
        "40-millimeter",
        "45-millimeter",
        "Apple",
        "Apple Watch Ultra",
        "Mario Kart",
        "Today",
        "a mile",
        "the Apple Watch Series 7",
        "the Apple Watch SE",
        "Mindfulness",
        "40-millimeter SE",
        "45-millimeter Midnight",
        "daily",
        "almost a year and a half",
        "two",
        "45-millimeter",
        "Apple Watches",
        "the Sport Loop",
        "three months",
        "Health",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "TIME",
        "PERSON",
        "TIME",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "DATE",
        "EVENT",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "LAW",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "EVENT",
        "LOC",
        "ORG",
        "EVENT",
        "DATE",
        "WORK_OF_ART",
        "FAC",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "ORG",
        "FAC",
        "PERSON",
        "TIME",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG"
    ]
}