{
    "id": "Em1rtbZbJ3U",
    "title": "Driving A Hydrogen Car: Is This Really \"The Future?\"",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-09-24T17:08:47Z",
    "video_url": "https://www.youtube.com/watch?v=Em1rtbZbJ3U",
    "category": "Science & Technology",
    "tags": [
        "toyota mirai test drive",
        "hydrogen car",
        "fuel cell vehicle",
        "fuel cell car",
        "mirai review",
        "toyota mirai review",
        "mrmobile",
        "michael fisher",
        "fcv",
        "imore"
    ],
    "views": 262894,
    "likes": 7823,
    "comments_count": 1464,
    "description": "Every time I shoot a video featuring a battery-electric car, someone in the comments pops up to say you know, the REAL future is hydrogen cars. The thing is, to drive a hydrogen fuel cell car you need to live near hydrogen fueling stations  and the closest one to my home in Boston is 2,547 miles away. So when I was in San Francisco last week, I called up the fine folks at Toyota and asked them to put me behind the wheel of the Toyota Mirai (which is Japanese for \"future,\" by the by). Before I knew, it I was hurtling down the highway in Toyota's FCV, leaving nothing behind me but water. It's not the freshest news on the block, but still I thought it was a great opportunity to share some details on how hydrogen cars work, why theyre cool ... and why I also think theyre probably not the future.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S TOYOTA MIRAI TEST DRIVE]  MrMobile's Hydrogen Car Test Drive video was produced following four days behind the wheel of a Toyota Mirai Fuel Cell Vehicle on loan from Toyota. The car was driven in San Francisco, Petaluma and Marin County, California, and refilled twice at an H70-capable hydrogen refueling station.   [LINKS]  Toyota Mirai \"hands-on\" (first drive) by Myriam Joire:   Toyota Fuel Cell Vehicle info site:   Hydrogen Fuel Cell Vehicle Safety [FuelCellsWorks]:   Hydrogen Fuel Cell Vehicle Refueling Stations:   Close to 6,500 Hydrogen Fuel Cell Vehicles Have Been Sold Globally:    [MUSIC]  \"You Know U Iz\" by GG Riggs, available at Premium Beat:   Skyrocketing by Vincent Tone, available at Premium beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #hydrogencar #fuelcellvehicle #toyotamirai #fcv #electriccar #greenenergy #hydrogen",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://youtu.be/Mvaiau4gXzw",
        "https://www.toyota-global.com/innovation/environmental_technology/fuelcell_vehicle/",
        "https://fuelcellsworks.com/news/toyota-engineers-testing-limits-of-hydrogen-safety",
        "https://www.afdc.energy.gov/fuels/hydrogen_locations.html",
        "https://www.prnewswire.com/news-releases/close-to-6500-hydrogen-fuel-cell-vehicles-have-been-sold-globally-300594992.html",
        "https://www.premiumbeat.com/royalty-free-tracks/you-know-u-iz",
        "https://www.premiumbeat.com/royalty-free-tracks/skyrocketing",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] I'm MrMobile, and every time I do a video on an electric car, someone in the comments pops up to say yeah, but the real future is in hydrogen cars! Well maybe. But to drive a hydrogen car, you need to live near hydrogen fueling stations. And the closest one to my home in Boston is 2,547 miles away. So when I was in San Francisco last week, I thought hey why don't I call up Toyota and ask them to put me behind the wheel of the Mirai. The company's fuel cell vehicle which is named after the Japanese word for future. And before I knew it, I was hurdling down the highway leaving nothing behind me but water. Here's a look at how hydrogen cars work, why they're cool, and why I think they're probably not the future. (upbeat music) The first thing I was surprised to learn about hydrogen cars is that they're electric cars. The Mirai's wheels are turned by an electric motor just like a Tesla or a Bolt EV. The difference is in how the power is created. Where a battery electric car gets its juice from a charging station or a plug in your house. A hydrogen car, like the Mirai, generates power using something called a fuel cell. The engineering behind this is complicated but the concept is simple. See, the cars pulls in air upfront through, what in an older car would've been a radiator grill, and a filter separates the oxygen. Which is passed on to the fuel cells along with hydrogen from two tanks under the cabin. The hydrogen does not burn like gasoline does. Instead, it's chemically combined with the oxygen and that chemical reaction produces electricity. The electricity is then fit into the small battery and the drive motor to get you moving. As different as it is under the hood, driving a fuel cell car feels much like driving any other car. In fact, the Mirai feels like a slightly sportier version of the Prius Prime I reviewed last year. And, I do mean slightly sportier. When I toggle power mode I could get accelerations of zero to 60 in nine seconds. Hydrogen may be rocket fuel but the Mirai isn't gonna hit escape velocity anytime soon. Of course, it's not built for that. It's built for grocery runs and driving your kids to little league games. And while this isn't a review video, my three days with the car gave me the impression that it would do that job just fine. Are your kids safe in a fuel cell car? That's a good question. When you're in the Mirai, you're literally sitting on top of two tanks of hydrogen which are pressurized 10,000 pounds per square inch. It doesn't sound terribly safe to put those into a 4,000 pound car flying down the freeway at 55 miles an hour. But, Toyota has a good reputation for safety and the fuel system bears that out. In a crash, the car's chassis is designed to redirect impact forces around the fuel tanks. The tanks themselves are carbon fiber reinforced polymer and they were tested by an outside firm which filled them to operating pressure. And then, did things like drop 2 1/2 ton weights on them. They just bounced off. The lab was able to penetrate the tank but it had to shoot it with a .50 caliber bullet. In the case of a similar sized breach in a crash, the hydrogen would escape over the course of 15 to 30 seconds. So yeah, it would be an ignition hazard. But then, so would gasoline and gas sticks around a lot longer than hydrogen. We don't have a lot of data right now 'cause they're aren't a lot of these on the road and, thankfully, even fewer of them have been in crashes. But after looking into how these have built and tested, I didn't feel any less safe in a fuel cell car than in a conventional one. The best and worst of hydrogen cars can be found in the same place. The fueling station. On the positive side, you can top up your hydrogen tank in a fuel cell car just as quickly as you can gas up your old Buick. I went from 3/4 to full in under three minutes. Now that gave me enough time to press the H20 button on the dash and dump some of that nasty dihydrogen monoxide by product. For those not in on lame science jokes, dihydrogen monoxide is water. That's the only exhaust this car produces. Hoping back in and getting back on the road with a full set of tanks, I'm good to go again for about 250 to 300 miles. The negative? Remembered how I said the only place you can get one of these right now is in California. Well that small scale means hydrogen fuel is still quite expensive. That quarter tank I paid for cost me about 30 bucks. Extrapolating that, to fill up from empty at today's rates, you'd pay over $80. Toyota does take the sting out of it by giving you either $15,000 of free fuel or three years worth of it; whichever's cheaper. Plus, you do qualify for a $5,000 California state rebate and/or an HOV sticker. But with an MSRP of over $58,000 for the Mirai, you're still shelling out a ton of money to get a car that only works in a small part of the country. Looking down the road, it would be exciting to see a hydrogen fueling infrastructure develop across the United States. These cars would outperform battery electrics in very cold climates. And yes, definitely nice to be able to refuel in minutes instead of hours. Other countries that are more aggressively pursuing zero emissions targets will probably order more. Japan, in particular, is big into FCVs. Also, using hydrogen as a means of large scale energy storage, has some advocates. So a ways down the road, hydrogen may indeed be our collective energy future. But in the nearer term, here in the States, I think we'll continue to see battery electric cars maintain their momentum. They may refill more slowly but it's a lot easier to find a charging station than a hydrogen one. And in the worse case, with an EV, you can usually find a wall plug to plug into. Also, EVs let you wake up with a full battery every day if you charge them in your garage every night. That's a lot of easier than digging out a part of your yard to accommodate your own personal hydrogen fueling station. You get the idea. (light music) Still, I am fascinated by the technology that's driving fuel cell vehicles and I'd like to hear your thoughts on them. Drop a comment below. Especially if you own one of these things and be sure you don't miss my coverage of electric cars from Tesla, Mercedes, Audi, and GM among others. Subscribe to the MrMobile on YouTube. Until next time, thanks for watching and stay mobile my friends.",
    "transcript_keywords": [
        "fuel cell car",
        "hydrogen",
        "car",
        "fuel cell",
        "fuel",
        "hydrogen cars",
        "cars",
        "cell car",
        "Mirai",
        "electric cars",
        "cell",
        "electric",
        "hydrogen fueling",
        "tanks",
        "battery electric car",
        "lot",
        "battery",
        "hydrogen cars work",
        "future",
        "cell car feels"
    ],
    "transcript_entity_values": [
        "nine seconds",
        "Mirai",
        "3/4",
        "under three minutes",
        "HOV",
        "over $58,000",
        "a ton",
        "Tesla",
        "55 miles",
        "Mercedes",
        "GM",
        "California",
        "Mirai",
        "Mirai",
        "a 4,000 pound",
        "States",
        "San Francisco",
        "last year",
        "about 30 bucks",
        "60",
        "three years",
        "EV",
        ".50",
        "Toyota",
        "Japan",
        "last week",
        "over $80",
        "2,547 miles",
        "Buick",
        "today",
        "Boston",
        "first",
        "minutes",
        "Michael",
        "Prius",
        "two",
        "about 250 to 300 miles",
        "Japanese",
        "15,000",
        "zero",
        "the United States",
        "15 to 30 seconds",
        "Audi",
        "10,000 pounds",
        "H20",
        "MrMobile",
        "quarter",
        "every night",
        "2 1/2 ton",
        "three days",
        "one",
        "a Bolt EV",
        "YouTube"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "NORP",
        "QUANTITY",
        "GPE",
        "GPE",
        "DATE",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "GPE",
        "ORDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "MONEY",
        "CARDINAL",
        "GPE",
        "TIME",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "FAC",
        "GPE"
    ]
}