{
    "id": "EMenOHw6YNo",
    "title": "Come with me to Cozumel Mexico | Vlog",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-08-28T18:00:18Z",
    "video_url": "https://www.youtube.com/watch?v=EMenOHw6YNo",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 53697,
    "likes": 2280,
    "comments_count": 146,
    "description": "What do you guys think of this vlog style? I miss vlogging but also don't like to sometimes because it takes away from experiencing things IRL. Let me know! Can't wait to show you the full video we filmed here!   PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:  GET MY EDITING PLUGIN:    MUSIC I USE:    GET YOUR OURA RING:    FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "https://oura.link/ijustine",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ"
    ],
    "transcript": "- [Voice Over] Come with me to dive in Cozumel, Mexico. This is gonna be so much fun but first we have to get there. I always pack too much luggage. But the date that we were leaving was the day of the hurricane in Los Angeles. It was a little bit cloudy, but all things considered we got there with no problems at all. I flew JetBlue direct from LAX to Cancun and once we landed, of course we gotta wait for our bags. Packing for trips like this is always a struggle because you have to bring so much gear. Not only do you need to bring all of your dive gear but I have so much camera gear. We made it to the ferry to make our way to Cozumel and the ferry was actually quite nice. I was starving because I had an eaten since breakfast. So we had a snack and within no time we were back on the other side waiting for our bags. And here's everything. This is all of the things. So many things. I'm just glad that we made it all in one piece. I am tired and I'm hungry and can't wait to get to the hotel. We took a taxi to the Fiesta Americana where we were greeted with this incredible welcome drink. Ugh it was amazing. And then when I get to my room there's these tiny little chocolates and one was in the shape of a scuba diver. These just look so good. And in contrast, I got to dinner and there was some guacamole with worms in it. I know this is a thing, but I didn't try it. But everyone else at dinner said it was pretty delicious. I had these delicious fried cheese taco thingies and they were amazing. And then I got back to my room and I had to prep for the next day of diving. I'm still very new at scuba diving and I have a few masks to try out so I have to prep them so that they won't fog the next day. I love that Oceanic has so many pink accessories so obviously I have to have pink everything. Now that everything's ready. I went to bed and in the morning this was the most incredible view. I was greeted by a triple rainbow all the way across the sky. Ugh, I just couldn't believe it. What a sight. So I've got all of my gear packed and it's time to head down to breakfast. Everything is so heavy, it just feels like I'm gonna fall over with all of the stuff. Breakfast was tasty, got a carb load and then we also have to load in all of the gear. We took a taxi to appear where we'd be catching a boat. Everything here is so beautiful. The water is so clear. I just could not wait to dive in for the first time. Now that I've really gotten into diving having my own gear has been so awesome. So huge thank you to Oceanic for hooking me up with all of these goodies. When I first started it was great to have rental gear just to get familiar but now learning on my own gear has made it so much easier. This is Devin and his awesome red camera underwater setup. I can't wait to show you guys the video that we were filming. Although, spoiler alert, a lot of the videos that you're gonna see are actually coming right from my iPhone. Oceanic is coming out with a dive housing and I can't wait to show you the full review video. We did a few dives and then it was time for lunch. After being under the water for so long you definitely get hungry. So time to eat. We all did one more dive after that and of course it was so much fun. Also, along with me on this dive was Melody. She's super talented. You can check her out on Instagram at Water Melody we packed up all of our gear, headed back to shore and then of course went to the hotel for dinner. The food was so good. I love eating. I just, I really love food. After that, I went to bed and prepared for another two days of diving. I had so much fun. Thank you guys for coming along with me on this fun trip. Can't wait to share the full video with you.",
    "transcript_keywords": [
        "gear",
        "Mexico",
        "wait",
        "dive",
        "time",
        "Los Angeles",
        "diving",
        "fun",
        "Cozumel",
        "Oceanic",
        "LAX to Cancun",
        "things",
        "day",
        "water",
        "made",
        "video",
        "back",
        "dinner",
        "breakfast",
        "love"
    ],
    "transcript_entity_values": [
        "Mexico",
        "Devin",
        "the Fiesta Americana",
        "Instagram",
        "iPhone",
        "first",
        "one",
        "the day",
        "another two days",
        "Melody",
        "the next day",
        "Oceanic",
        "Los Angeles",
        "Cozumel",
        "Cancun",
        "JetBlue"
    ],
    "transcript_entity_types": [
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "GPE",
        "PRODUCT"
    ]
}