{
    "id": "emHyQNfQKaw",
    "title": "Microsoft Surface Go - $400?!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-07-10T19:56:46Z",
    "video_url": "https://www.youtube.com/watch?v=emHyQNfQKaw",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Surface Go",
        "Surface Pro",
        "best surface device",
        "best surface",
        "best 2 in 1",
        "best convertible",
        "best laptop for school",
        "best laptop for students",
        "microsoft",
        "eve",
        "miix",
        "intel",
        "HD615",
        "4415Y"
    ],
    "views": 770872,
    "likes": 20943,
    "comments_count": 1893,
    "description": "Before my review of the Microsoft Surface Go, here are some early thoughts on the new $400 Surface. Cheap Surface Pro 4 -   The base model at $400 is running a 4415Y Intel processor. with the integrated HD615 Graphics. But the 64 GB eMMC storage is slow, the 128GB upgraded model will give you a snappier feel to the device.  Music Credits: Background: Fili - Differences  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2ztOEPK",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "So Microsoft recently announced their new surface go it's this two in one device starts at 400 dollars And I think it's the cheapest or one of the cheapest computing devices that Microsoft has ever put out and it's actually, in my opinion One of the most interesting devices that they've put out in quite a while this isn't it. This is a surface pro 4 very similar in idea and design though. So what makes this thing special though is the price tag $400 is Very affordable and I think a lot of people are looking at it out of interest as am I so I just took a look At their launch video and I just had a couple thoughts on the device as a whole the first thing I noted Is that the CPU they can only get in one configuration. It's the 4415Y Pentium Gold came out middle of last year something like that Not a super new chip, but it's relatively power efficient and has very respectable performance for a fanless chip It's noticeably faster than some of the older Surface devices but its main strength is the onboard GPU. That HD 615 is quite a big step up from older devices Now if you look at the price point of $400, it's quite attractive there but I feel like that's a bit of a marketing ploy because that $400 version as Cool as it sounds is I don't think it's the one to get if you're gonna look at this I would look at the kind of mid tier model the $550 version. Here's why that $400 version has 4 gigs of RAM That's not like a deal-breaker to me four gigs is not great, but it's not the end of the world. It's the drive speed. So, they're using eMMC storage in the base model and that is really Really slow stuff if you step up to the mid tier model They're using nvme storage and that faster storage has a huge huge role in just how the device feels overall So if you're interested in this thing, I would highly recommend the 8 gig model. Again, It's not about the RAM It's the storage speed. It's just nvme is so much faster, that's the one to get. The bezels on this device are a little thick but since it's a tablet I'm less bothered by it. Like when you have a thicker bezel to hold on to it's just you know Kind of serves those like a grip so you don't have accidental swipes and touches like that The kickstand on the surface go it goes all the way back like the 2017 surface pro. So 165 degrees I think That type of functionality on a kickstand honestly makes this device so much more versatile to me it obviously depends on the user but if you're using it for like drawing or writing or anything like that that kickstand that folds all the way back is Money as for ports on the surface go you're getting a USB-C port this time, which is really nice You can charge with it. You can connect stuff to it display out all that good stuff. It's your standard USB-C It doesn't support Thunderbolt 3 not surprising given what the product is I don't even think it would've been all that useful considering the CPU Like what are you gonna do with that Thunderbolt 3 port now, the included charger still uses the surface connect port It's not a USB-C charger, but it's still nice that does support USB-C charging. The type cover goes for 100 bucks I think most users will want to pick this up with the device. They've made the touch pad bigger Nice to see that I've always found the touch covers to be kind of annoying that it comes as a separate thing like on some of these devices Especially on the base model a type cover is gonna be 20% the cost of your whole device like that's that's crazy a hundred bucks of a $500 kit is like that's very expensive for a keyboard. But it is what it is surface likes to do that now I took a look at some older models just to see what was out there to see if there's other stuff that you get instead of the Surface Go just to know I'm just kind of like a comparison of competitors and alternatives and I actually think that the Surface Go is a very It's kind of in a class of its own if you get anything, that's older like yeah You're gonna get similar processing power and sometimes larger screens and maybe some better functionality but the overall product of the Surface Go has a lot of features that are unique to it that just make it a very Respectable and reasonable purchase like the USB-C charging the Windows Hello the updated screen with good pen support It looks like a really cool device The unfortunate thing is that instead of that $400 price point that Microsoft is touting. It looks like it's gonna be like 650 to get a really kind of fully functional kit going for like the mid tier model and a keyboard so It's not super cheap, but I think it's respectable. I don't know. What do you guys think? Like is this something that you're interested in? because This can't be or this it's unlikely that most people can use this as their primary device certainly not for like the people that watch My channel you guys are enthusiasts. You care about Tech and you? usually have some thats a little more powerful in this but it's good as a secondary device I think and For me personally if I wasn't making YouTube videos I would actually try to pick up one of these things as my primary device just to see how far could get on it It's pretty cool. Okay. Hope you guys enjoyed this video.Thumbs if you liked it, subs if you loved it. See you guys next time.",
    "transcript_keywords": [
        "cheapest computing devices",
        "Microsoft recently announced",
        "surface",
        "device",
        "older Surface devices",
        "cheapest computing",
        "USBC",
        "mid tier model",
        "recently announced",
        "devices",
        "kind",
        "model",
        "Surface devices",
        "surface pro",
        "device starts",
        "computing devices",
        "interesting devices",
        "cheapest",
        "put",
        "Microsoft recently"
    ],
    "transcript_entity_values": [
        "Microsoft",
        "400 dollars",
        "650",
        "4",
        "615",
        "Pentium Gold",
        "CPU",
        "GPU",
        "USB",
        "one",
        "4415Y",
        "550",
        "the Surface Go",
        "eMMC",
        "100 bucks",
        "YouTube",
        "two",
        "165 degrees",
        "first",
        "2017",
        "500",
        "four",
        "Nice",
        "RAM",
        "400",
        "USB-C",
        "8",
        "20%",
        "Thunderbolt 3"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "PRODUCT"
    ]
}