{
    "id": "EMwrJjyKzR4",
    "title": "New iPad Air (2020) review",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-10-21T13:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=EMwrJjyKzR4",
    "category": "Science & Technology",
    "tags": [
        "ipad air review",
        "ipad air 2020",
        "new ipad air",
        "new ipad",
        "touchid",
        "ipad air vs ipad pro",
        "apple",
        "ipad air",
        "ipad air 4",
        "ipad",
        "apple ipad",
        "2020 ipad",
        "the verge",
        "gadget",
        "tech",
        "ipad pro",
        "a14 bionic chip",
        "tablet",
        "magic keyboard",
        "apple pencil",
        "ipad air 3",
        "ipad air 2019",
        "iphone 12",
        "iphone 12 pro",
        "dieter bohn",
        "verge",
        "which ipad pro should i buy",
        "apple event",
        "ipados 14"
    ],
    "views": 1015316,
    "likes": 17962,
    "comments_count": 867,
    "description": "The new iPad Air for 2020 borrows all the best design elements from the iPad Pro. It has a bigger screen, smaller bezels, and works with all the Pro accessories. It also has a wicked fast A14 Bionic processor and TouchID on the power button. It's the best iPad for most people, if you can afford the $599 price.  If you buy something from a Verge link, Vox Media may earn a commission. See our ethics policy:   Buy the iPad Air from Apple -   Read the review on The Verge:   Subscribe:  Subscribe to Verge Science:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/2TQsqjB",
        "https://bit.ly/37nblVe",
        "https://bit.ly/2HmMW7m",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- If you're thinking of getting an iPad right now because maybe you're staring down a long lockdown winter where you can't even go outside and so you need to binge even more Netflix than you have been. Then this is the iPad that I recommend for almost everybody who can afford it. It's the new $599 iPad Air. (upbeat music) See, one of the biggest trends in tech right now is a bunch of companies are trying to figure out which part should go into their mid-range devices. Should they just be extra nice versions of the basic model which is actually really what Google's done with Pixel 5 here? Or should they be toned down versions of the best model which is really what Apple has done here with the iPad Air. Either way, the result is usually a device that might be missing some high end features that are luxuries instead of necessities. But even without them, this iPad Air feels like a luxury. It is the nicest computing experience you can have for $600 or less. (upbeat music) The main thing that's new the iPad Air this year is this design. (upbeat music) It is almost identical to the iPad Pro models. And that is a very good thing. It has these rounded corners and thinner bezels and that's feature shared by the new iPhone 12s actually. But unlike the new iPhones this iPad Air, switches over from Lightning to USB-C. Yes. Good. Right? We're not gonna go down a USB-C rabbit hole here. Just know that your Lightning Cables won't charge this devices. That design switch over also means that this uses the new iPad Pro accessories. So there's the Apple Pencil that attaches and charges here via a magnet. And it's better than the old Lightning Pencil. It's pretty much every way but don't forget that it costs $129. You also have your choice of these standard smart keyboard for 179 bucks or this very nice Magic Keyboard with a track pad for $299. The iPad Air has a usual colors. There's gray, silver and rose gold but there's also new colors of light green or the sky blue color right here. Now I am going to get into the specs which includes an incredible new processor but in a minute they aren't the most important thing about the iPad Air. The most important thing is that this is just an incredibly nice computer to use. (upbeat music) I have a lot of computers. I'm a weirdo. And when I just want a computing experience that's chill and relaxing, I always return iPad. Now I know the base model iPad for $329 can do pretty much everything this iPad Air can do but it's just not as nice to use. There are these really big bezels and the least expensive model only has 32 gigs of storage. On the Air, you get a bigger 10.9 inch Liquid Retina Display and 64 gigs of storage. See for me one of the biggest reasons to use an iPad is to just get something that's more enjoyable to use than a boring old laptop. And so this iPad compared to the base iPad, it's just nicer. It's speed, design, accessories. Everything's just more enjoyable. There is one part that is enjoyable but takes a little bit of getting used to. It's the Touch ID Sensor right here on the power button. It works and it's accurate and it's fast but you have to operate it a little bit differently than I'm used to. You can't just tap it to turn on the iPad. You have to press it down and then let the button lift up and then leave your finger resting on the power button to unlock it. It's a little weird. If you press too long, you get Siri. And if you don't press long enough it won't be able to register your fingerprint and unlock the iPad. It just takes some getting used to. The other thing to point out here is that iPad OS is enjoyable to use but it still has the same old limitations. There is no support for multiple users and most video conferencing apps still turn the camera off when you multitask. (upbeat music) Okay. It is finally time to talk specs. The big deal with this iPad is that it has Apple's newest fastest processor, the A14 Bionic. (upbeat music) It is very fast. It's faster even than the most recent iPad Pro's processor in certain benchmark tests like single core speeds. It's a beast and it signals good things for the upcoming ARM-based Macs. But that comparison to the iPad Pro isn't that simple though. See the iPad Pro has more GPU oomph and the way that iPad iOS works means that a lot of the most intensive apps really do take advantage of the GPU. So if you care about things like processor speed on an iPad, I think the thing to do is wait for the iPad Pro to get updated with a 5-nanometer A14X or 14Z or whatever they're gonna call it. Now compared to the iPad Pro you lose out on a promotion high refresh rate display, LiDAR Face ID and ultra wide camera and quad speakers. I do miss a promotion display a little because I like high refresh rate screens but everything else, I really don't. The stereo speakers sound great in landscape mode. And by the way, battery life of course is excellent as always. So that's the iPad Air. I do wish there was a model in between the $599 64 gig version and the step up to the $749 256 gig version. But otherwise there's not a whole lot to knock here. It's an iPad. If the $599 price is in your budget, this is the one to get especially since you're probably gonna hanging on to this thing for very many years. Something that you have that long I think it is worth spending the extra money for a more enjoyable experience. Hey everybody, thanks so much for watching. If instead of the iPad Air you wanted to know about the new iPhone 12 or iPhone 12 Pro, we have of course reviewed those devices and you can click the link on your screen right now to watch them.",
    "transcript_keywords": [
        "iPad Air",
        "iPad",
        "iPad Pro",
        "Air",
        "Pro",
        "iPad Pro models",
        "iPad Air feels",
        "iPad Pro processor",
        "thing",
        "long lockdown winter",
        "Netflix",
        "iPad Pro accessories",
        "lockdown winter",
        "recent iPad Pro",
        "model",
        "enjoyable",
        "Lightning",
        "Apple",
        "model iPad",
        "nice"
    ],
    "transcript_entity_values": [
        "Lightning Pencil",
        "Pixel 5",
        "iPad Air",
        "one",
        "Apple",
        "the iPad Air",
        "599",
        "The iPad Air",
        "5-nanometer",
        "GPU",
        "iPhones",
        "iPad Air",
        "129",
        "Google",
        "Air",
        "Magic Keyboard",
        "the iPad Pro",
        "iPad Pro's",
        "iPad",
        "the Apple Pencil",
        "Siri",
        "iPad Pro",
        "600",
        "iPad",
        "10.9 inch",
        "329",
        "256",
        "12",
        "179 bucks",
        "299",
        "this year",
        "winter",
        "32",
        "64",
        "Bionic",
        "Macs",
        "iPad iOS",
        "14Z",
        "749",
        "Netflix",
        "iPhone",
        "a minute"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORG",
        "TIME"
    ]
}