{
    "id": "ENJwA9MVHz8",
    "title": "Lenovo Y540 - Pick the Right Gaming Laptop!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-08-03T15:45:22Z",
    "video_url": "https://www.youtube.com/watch?v=ENJwA9MVHz8",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "lenovo",
        "legion",
        "y540",
        "y545",
        "helios 300",
        "acer",
        "best gaming laptop",
        "cheapest gaming laptop",
        "best gaming laptop for students",
        "cheap gaming laptop",
        "budget gaming laptop",
        "RTX 2060",
        "RTX 2070",
        "GTX 1660"
    ],
    "views": 1743501,
    "likes": 39092,
    "comments_count": 2980,
    "description": "Dave2D review of the Lenovo Legion Y540 and Y545 gaming laptops. These are the best gaming laptops from Lenovo for inexpensive portable gaming, but only one of them is worth getting. Legion Y540 -   If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/338rPvV",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Ok. So these two laptops are some of the cheaper gaming laptops that Lenovo makes. This is the Legion Y540. This is the Y545. These are probably one of the more requested devices that have had on the channel. Uh, these are very popular, and the reason why they're popular is probably because of the price. They both start at 999 and they both have very similar hardware, but they are actually quite different from each other. Way more different than I thought they would be, just looking at the paper specs. So just right off the rip, in case you're interested in both of them. The Y540 is better than the Y545 and I'll explain why. I have a preference for the design aesthetic of the Y540. This is a much cleaner look. I mean this isn't the only reason why I prefer, but it's got a much simpler design, And I think in twenty nineteen, this kind of design aesthetic is something that a lot of people are looking for. Just kind of understated but powerful gaming laptop and that's what the Y540 delivers. The Y545 has a more kind of classic gamer look, It's got more angular design. It's got this light up Lenovo logo and the whole shape and design aesthetic of this device is much more reminiscent of their older gaming devices like the Y7000. Now the one advantage that the 540 has is it's got a metal top panel. So this is an aluminum surface while the Y540 is a plastic surface, but both of them are built well. I wouldn't say that the aluminum shell makes it's more durable or anything. If anything the hinge design on the 545 because the hinge is a kind of centered on the back area here. This is like it's a design we've seen on older Lenovo laptops and this has been an issue with some of the older devices where you would just every time you open and close the lid you would torque this like in a way that shouldn't and that can't be good for the lifespan of a hinge. Now, the main reason why I prefer the 540 over the 545 is because of the thermal performance. You would think that these have similar thermal designs, right? Because they have a similar design chassis and there's a lot of information or misinformation on the internet about how they had the same kind of thermal design. And they also I've seen thread talking about how the 740 the legion 740 also has the same kind of thermal design. They're all completely different from each other. They're similar, but they're very different. And the 540 is a lot better than the 545 when it comes to removing heat from the CPU and the GPU. And I'll just pop this open to explain why. If you look on the inside, you can see the heat pipes from the 540 and it's just a pair of heat pipes that run from the CPU and the GPU. And you can see that being vented off by the fan. On the 545, it's the same kind of design setup, but you'll see that the heat pipes only vent off at the back of the device. There is no ventilation that comes off the side like it does on the 540. And this difference in the configuration of the heat pipes and the fan makes a very big difference in the thermal performance of the device. The 545 can throttle pretty easily, if you push it hard enough. The 540 does not. It's a much better performer. Now inside you also have access to your RAM your SSD your 2.5-inch SATA as well as your WIFI card and your battery. Now the battery is small. It's a 57Wh battery. We've seen this exact same size and a bunch of the Lenovo devices this year. It's like a three-hour battery. It's not amazing, but at this price point I feel like a lot of the market is getting that same kind of battery life. So yeah, that's just what we have a 2.5 to 3-hour battery life. with the screen at 215 nits. Okay. Uh, let's go to the rest of the device. Oh, ports on this thing. It's got a pretty decent selection of ports and a lot of them are located in the back which I like including the AC adapter. So just everything is cleared away from the sides keep things a little bit tidier. But the USB-C port does not support Thunderbolt-3. If that's something you're interested in, it's lacking on this device. But that's kind of the standard when it comes to this kind of price range of device. Ok. Let's just close up these ones because I'm done talking about the Y545. It was a cool idea and I think for some people that like the design aesthetic. It's got that look. But for me, and I think for most of you guys, you should be picking up the 540 instead of the 545. Ok, inside we have a keyboard. The typing experience is a little strange because of the number pad included kind of squish everything tighter into this 15-inch frame. Uh, but once you get used to the layout of it, It's not bad. Like the actual key strokes are fine. It's just that it does take a little more time to get used to this layout at least for me compared to other devices. Even the legion Y740, which is a more premium version of this device that has a more traditional lay out because it doesn't have the number pad. But think a lot of people do like that number pad and think for everyone they can get used to this lay out given enough time. Uh, the track pads on the bottom, it's got dedicated hardware buttons which I like and it's using windows precision drivers. So, track pad overall solid, keyboard can be solid if you kind of get used to the lay out. The screen. This model has the 144Hz panel option and I would highly recommend if you're purchasing this device to get this panel and to upgrade from the 60Hz panel if you can afford it. It just a way better use of the hardware that these devices are coming with. And I realized that at this kind of price point at the 1000-dollar budget, it is a big bump up in price to get the 144Hz screen. It's like a $200 price bump which is like 20% of what you are originally planning to pay for. But it's just a way better game experience when you have a fast and smooth screen. Games look great on it. And the performance of this laptop is fantastic for the money. You can basically play any kind of AAA title with great frame rates and great graphic settings. The speakers are located on the bottom. They don't sound amazing but I'm not gonna knock it too hard at this price point. The webcam located at the bottom of the screen. I think a lot of people don't like that I personally don't either. But I don't think it's too big of a deal because I don't use the webcam that much on a gaming laptop. There is one thing I wanna talk about fan control and fan noise. So the fans are sufficient. They cool this laptop well. But the fan control is limited when you put this thing on high performance mode. There's no way to manually control the fans. Feel like with hardware of this caliber you should be able to just tweak the fans the way that you like. You're supposed to crank this thing if you're doing a render something but you can't. They really should implement that in the software like future updates of the software. But that's something that can add in the future. And if I'm not mistaken the older version of this the Y530 from last year, did have manual fan control if I remember correctly. So it's kind of strange that they removed it this year. But overall this device it's awesome. I expected it to be good and it really was The 545 was a bit of a disappointment like I would chirp on this harder. But because the 540 is available and I prefer the designs that I give it more. Like, I don't even care about this one. It's cool that it exists. It's great that the... Maybe this thing exist to make the 540 look that much better. Now I'm going to talk about one other thing. The Y740 is kind of like the premium version of this like I mentioned earlier. But when you look at the price difference between the two. This is around $1200 for like a good configuration with an RTX-2060 and a 9th Gen Intel CPU. This is around $1400, so about $200 more. It is a lot better though. Like there's just a lot more to it. If your budget can stretch to the $1400 mark I would definitely take a look at this. But if it can't, 540 for days, not a 545. Hope you guys enjoy this video Thumb up if you like it. Subs if you love it See you guys next time.",
    "transcript_keywords": [
        "kind",
        "design",
        "device",
        "lot",
        "design aesthetic",
        "devices",
        "price",
        "fan",
        "Lenovo",
        "thing",
        "battery",
        "thermal design",
        "thermal",
        "heat pipes",
        "heat",
        "Lenovo devices",
        "screen",
        "laptop",
        "fan control",
        "CPU"
    ],
    "transcript_entity_values": [
        "2.5-inch",
        "about $200",
        "999",
        "2.5 to",
        "Lenovo",
        "Y740",
        "9th",
        "CPU",
        "GPU",
        "one",
        "3-hour",
        "AC",
        "200",
        "this year",
        "144Hz",
        "15-inch",
        "Y530",
        "around $1400",
        "215",
        "1400",
        "CPU",
        "1000-dollar",
        "three-hour",
        "Y545",
        "two",
        "57Wh",
        "AAA",
        "twenty nineteen",
        "540",
        "740",
        "545",
        "Gen Intel",
        "Y540",
        "last year",
        "60Hz",
        "20%",
        "around $1200"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "MONEY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "MONEY"
    ]
}