{
    "id": "ENtxJcI5Ll4",
    "title": "Apple WWDC 2023 keynote in 26 minutes",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-06-05T23:51:10Z",
    "video_url": "https://www.youtube.com/watch?v=ENtxJcI5Ll4",
    "category": "Science & Technology",
    "tags": [
        "Apple wwdc",
        "apple",
        "apple headset",
        "apple wwdc 2023",
        "wwdc",
        "wwdc 2023",
        "Worldwide Developer Conference",
        "Worldwide Developer Conference keynote",
        "wwdc highlights",
        "wwdc news",
        "apple new headset",
        "apple reality pro",
        "apple mixed reality headset",
        "macbook air",
        "ios",
        "macos",
        "ipados",
        "ios 17",
        "ios 17 top features",
        "apple vr headset",
        "apple vr",
        "apple event",
        "ios 16",
        "ios 17 features",
        "ipados 17",
        "apple ar",
        "apple ar headset",
        "macos 14",
        "apple leaks",
        "apple watch",
        "apple news",
        "wwdc 23",
        "the verge",
        "verge"
    ],
    "views": 682933,
    "likes": 9107,
    "comments_count": 683,
    "description": "Apple just finished up its annual Worldwide Developers Conference keynote, where it made some of the biggest announcements its ever made at the event, including its Vision Pro mixed reality headset and a bigger 15-inch MacBook Air. Plus, the Mac Studio and Mac Pro get an upgrade with a more powerful M2 Ultra chip. We also got a look at new updates for iOS and iPadOS, including interactive widgets. Heres everything you missed. #Apple #WWDC #Technology  Read more:   00:00 Intro 02:04 15\" Macbook Air 01:10 Mac Studio M2 Max M2 Ultra 02:39 Mac Pro with Apple Silicon 03:19  Prices 03:30 IOS 17 04:36 Check In 05:04 Plus Button and Stickers 05:38 Airdrop 06:16 Autocorrect 06:50 Journal App 07:28 Standby 08:18 Siri 08:48 iPad OS 17 10:30 iPad PDF collaboration 11:01 MacOS Sonoma 12:02 Gaming (Death Stranding) 12:28 Video Conferencing 13:10 Safari WebKit 14:28 Adaptive Audio 14:52 AirPlay in Hotels 15:10 Shareplay to Cars 15:25 watchOS 10 16:08 Apple Vision Pro 17:40 Vision Pro EyeSight 18:31 VisionPro FaceTime 20:40 Vision Pro Hardware 23:46 VisionOS 24:51 Reality Composer Pro 25:14 Optic ID 25:38 Vision Pro Price and release  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://trib.al/6fqFRDg",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Welcome to WWDC. - Introducing the 15-inch MacBook Air. - It's only 11.5 millimeters thin, making it the world's thinnest 15-inch laptop and it's easy to carry around at just over three pounds. It features MagSafe charging, two Thunderbolt ports, and a headphone jack for versatile connectivity. And it comes in four gorgeous finishes, including Midnight and Starlight. It has a great 1080p camera for video calls, along with a three-mic array, so you come through loud and clear. And the new Air sounds awesome with six speakers, including force-canceling woofers, it delivers immersive Spatial Audio. All of this is enabled by the M2 chip, which delivers amazing performance and it gets an astonishing 18 hours of battery life. That's the new 15-inch MacBook Air. It has an expansive display, the incredible performance of M2, a six-speaker sound system, and tremendous battery life. - And it starts at just 1,299 and 1,199 for education. You can order it today and it'll be available next week. Today, we're excited to give Mac Studio it's first big update. - Mac Studio is getting the immensely capable M2 Max with up to 25% faster performance than M1 Max. We're adding one final chip to the M2 family. Introducing M2 Ultra, connecting two M2 Max die together. With our groundbreaking UltraFusion architecture, it doubles the performance of M2 Max. The 24-core CPU in M2 Ultra delivers 20% faster performance than M1 Ultra. And it's 76-core GPU is 30% faster than M1 Ultra. Finally, the 32-core Neural Engine is 40% faster, and M2 Ultra can't support an enormous 192 gigabytes of unified memory, which is 50% more than M1 Ultra. So that's M2 Ultra. We're bringing M2 Ultra to Mac Studio. Compared to Mac Studio, with M1 Ultra, colorists using DaVinci Resolve will see up to 50% faster video processing than before. 3D artists using Octane can now render up to three times faster. And with M2 Ultra's media engine, video editors can play back a mind-blowing 22 streams of 8K ProRes video. For connectivity, Mac Studio now has higher bandwidth HDMI, enabling up to 8K resolution and 240 Hertz frame rates. So that's the new Mac Studio. Introducing Mac Pro with Apple silicon. Every Mac Pro comes with the outrageous performance of M2 Ultra. Every Mac Pro has afterburner performance built in with eight built-in Thunderbolt ports: six on the back and two on the top. Finally, Mac Pro brings PCI expansion to Apple silicon. It features six open expansion slots that support Gen 4, so users can customize Mac Pro with essential cards, including audio and video I/O, networking, and storage. Finally, it's available in both Tower and Rack mount enclosures. So that's the new Mac Pro. - Mac Studio with M2 Max still starts at 1,999. Mac Pro starts at 6,999. You can order both products today and they'll be available next week. - Let's start with iOS 17, and we're making a big update to the phone app this year with personalized Contact Posters. Contact Posters feature beautiful treatments for both photos and Memoji, paired with eye-catching typography. And in Chinese and Japanese, the new layout with vertical text looks incredible. Live Voicemail. Now, when someone calls you and leaves a message, you'll see a live transcription in real-time as they speak. FaceTime. Now, when you call someone on FaceTime and they aren't available, you'll be able to leave a message. - Messages is the way we stay connected with the people who matter most. First, Search is more powerful and precise with the addition of search filters. Next, a new catch-up arrow in the top right of your conversation lets you jump to the first message you haven't seen. When you get an audio message but you aren't able to listen right away, they're now transcribed, so you can read them in the moment and listen later. Finally, Location Sharing now lets you keep track of your friend's location directly in the conversation. Check In. Whether you're walking home after dark or going for an early morning run, you can start Check In with a family member or friend to let them know when you get home safely. But if something unexpected were to happen while you're on your way, it can recognize that you're not making progress towards your destination and check in with you. And it can automatically share useful information, such as your current location and the route you took. And you'll also be able to see your battery level and cell service status, so they know if you might be able to take their call. With just a tap of this new plus button, you'll see all the things you send the most, like your photos, audio messages, and location. And when you swipe up, you'll see all your iMessage apps there, too. By tapping the plus button and then tapping Stickers, you'll see the brand-new drawer that brings all my stickers into one place. We've made all emoji into stickers. I can pick any one of these photos and turn it into a sticker. And check this out. When I tap on the Live Photos tab, I see all of the live photos that will make great animated stickers. - And this year, we're expanding how you can use AirDrop to share in all new ways. NameDrop. With NameDrop, you can just bring your phones close together. You'll see the same contact poster we talked about for phone calls, and you can easily choose the phone numbers and email addresses you wanna share along with it. And share them just like that. You can use NameDrop with an iPhone and an Apple Watch, too. You can also bring your devices together to instantly kick off a shared activity using SharePlay. And for developers, this will work automatically for apps that support SharePlay. Autocorrect is powered by on-device machine learning. The keyboard now leverages a transformer language model. iPhone can run this model every time you tap a key. Sentence-level autocorrections can fix more types of grammatical mistakes. If an autocorrection isn't quite what you wanted, tapping the underlying word shows what you originally typed with the option to quickly revert back to it. And now, you'll get predictions in line as you type. So finishing a word or even the whole sentence is as easy as tapping the Spacebar. - Journal, a brand-new app coming to iPhone later this year. Using on-device machine learning, your iPhone can create personalized Suggestions of moments to inspire your writing, and you control what to include when you enable Suggestions and which ones to save to your journal. And for developers, Suggestions will be available as an API. Let's look at this one of a trip. It includes where you went, the music you listened to, and photos you took there. You can add these to your journal in one tap. And when you do, there's even a writing prompt, like, \"What was the highlight of your visit?\" No one but you can access it, not even Apple. - We call it StandBy. StandBy is perfect for your nightstand, kitchen counter, or desk. When you wake up, it's easy to see the time with a clock and it's easy to personalize. StandBy automatically shuffles through your best shots, taking full advantage of the screen. It also embraces the power of widgets, which are more glanceable than ever. With a quick swipe on each widget stack, you can see the current weather, Home controls, or your favorite third-party widgets. Siri and StandBy works great, with rich visual results that are easy to view, and it's just as easy to ask to play music or set a timer hands-free. At night, when you're charging iPhone, StandBy adapts to low light, taking on a beautiful red tone to help you sleep. iOS 17 has many more features, including the ability to simply say, \"Siri,\" to activate Siri. And now, you can issue back-to-back commands without needing to say, \"Siri,\" again. In Maps, you can select an area and download a map to your device to use when you're offline. And in Photos, the People album is better than ever at spotting your favorite people, and now can even recognize the cats and dogs that are part of your family, too. And that's iOS 17. iPadOS 17 takes iPad even further with Widgets and the Lock Screen. We've made Widgets interactive, and I can take action directly in the widget without even opening an app. I can learn something new with flashcards from Quizlet and track it with Streaks right away. We wanna bring a greater level of customization and personalization to another space. The Lock Screen. There are so many wonderful wallpaper options, like photo shuffle, weather, an emoji. And when you select a live photo, we use an advanced machine learning model to synthesize additional frames to create a gorgeous, smooth, slow-motion effect whenever you wake iPad. The Lock Screen gets one other feature that makes it even more useful, Live Activities. So now, right from the Lock Screen, you can keep track of a food order with Uber Eats, travel plans with Flighty, the score with Major League Soccer, or a timer. And we're happy to report that now, you can even keep track of multiple timers. We truly live in an age of wonders. The Health app has been designed to take advantage of the larger screen on iPad, so you can see rich details at a glance. And because your health data is securely synced, you can see your health information from your iPad, iPhone, Apple Watch, as well as compatible third-party apps and devices all in one place. And for developers, HealthKit comes to iPad, opening up new ways to build innovative health and fitness experiences. - [Presenter 1] Thanks to new machine learning models, iPadOS can identify the fields in a PDF, so you can use Autofill to quickly fill them out with information like names, addresses, and emails from your contacts. PDFs in Notes are also fantastic for collaboration. When you're working together, you see each other's updates in real time. So as you scribble something down, the changes you make appear right away on your collaborator's iPad. - So that's a look at iPadOS 17. Introducing macOS Sonoma. Starting with stunning new screen savers that show beautiful slow-motion videos of places around the world. And when you log in, this imagery settles beautifully into your desktop. Sometimes, you wanna see information at a glance while you're using your Mac by simply bringing your widgets right into view here on the desktop. I love to catch a glimpse of my favorite photos throughout the day and weather, too. And I can put these anywhere. If I open up Mail, my widgets instantly fade into the background, so I can focus on the task at hand. But I also have some amazing widgets on my iPhone. And through the magic of Continuity, I can now access them all right here on my Mac. So I can see my Apollo for Reddit, HiCoffee, and even my car widget. My iPhone just needs to be nearby or on the same Wi-Fi network. - We are so excited to see developers bringing more games to the Mac. Here's legendary game creator, Kojima-san. (Kojima speaking Japanese) - This year, we have great new ways to help you present remotely. A new video effect called Presenter Overlay elevates your presence by including you on top of the content you're sharing. With Small Overlay, your face appears in a movable bubble, so it's easy to be seen while showcasing your work. With Large Overlay, you remain prominent while your shared screen is framed beautifully next to you. When you wanna let others know how you feel, you can add a reaction that seamlessly blends your video with balloons, confetti, hearts, and more. You can use these new video effects with any app, like FaceTime, Zoom, Teams, WebEx, and more. - Safari is powered by WebKit. In just the past few months, we've added even more features for developers. Another cornerstone of the Safari experience is privacy. Private Browsing now locks your Private Browsing windows when you're not using them, completely blocks known trackers from loading on Pages, and removes tracking from URLs as you browse in Private Browsing. We're now adding the ability to securely share passwords and passkeys with the people you're closest with. We have another exciting update to help you stay organized with Profiles. Profiles help you separate your cookies, history, extensions, tab groups, and favorites, so you can sign into the same site with your work account and personal account and quickly switch between them. With web apps, we're elevating the websites you use most often with some of the same great features as apps. From the File menu, I can click Add to Dock, and the title and icon load automatically. When I click Add, the icon instantly appears in the Dock. Now, I can close this window in Safari. When I launch my web app, I get an app-like experience with a simplified toolbar. On Mac, you can create a web app for any website, and developers don't have to do any extra work for their web app to look great. - [Announcer] And that's macOS Sonoma. - Adaptive Audio dynamically blends transparency and active noise cancellation to match the conditions of your surroundings. So you can stay present within your environment while distracting noises are automatically reduced. (machine whirring) Just start speaking, and Conversation Awareness will automatically lower your music, focus on the voices in front of you, and reduce background noise. - We're excited about launching AirPlay in hotels. With AirPlay support in hotels, it's easy to take advantage of the big screen in your room, to watch an episode of your favorite show, or practice tomorrow's presentation. AirPlay will be available in select hotels before the end of the year. We're thrilled to bring SharePlay to the car. Now, when the driver's iPhone is connected to CarPlay, any passenger's iPhone will automatically suggest joining their session. Just tap to connect. From there, it's easy to play your favorite music, control playback, and enjoy the ride together. - watchOS 10. Now, from any watch face, you can simply turn the Digital Crown to reveal widgets in a smart stack. I can start off my day with a glance of the forecast and headlines, and the Smart Stack uses machine learning to show you relevant information right when you need it. So later in the day, you'll see some upcoming meetings, tasks you need to complete, or medications to log. - So you'll now be able to log your momentary emotion and your daily mood in a discreet and convenient way from the Mindfulness app in watchOS 10. You can use the Digital Crown to scroll through the engaging, multi-dimensional shapes and choose how you're feeling. - All of these OS releases will be available to our users this fall. Introducing Apple Vision Pro. Vision Pro is a new kind of computer that augments reality by seamlessly blending the real world with a digital world. - When you first put on Vision Pro, you see your space and everything in it. The Home view lives right in front of you. It's where you find all of your apps. And you can place apps exactly where you want them. And launching new apps doesn't take space from existing ones. They simply occupy a new space centered around you. They can grow beyond the dimensions of your physical room with Environments. Environments extend and transform your space, so you can control how immersed you are by simply turning the Digital Crown. Whether extending a small portion of your room or being fully immersed within an environment, you browse the system simply by looking. It's effortless. App icons subtly come to life when you look at them. In fact, every graphical element has a sense of vitality and responds to your eyes. Simply tap your fingers together to select and gently flick to scroll. With Vision Pro, you can look at a search field and just start dictating. Voice input has never been this seamless. And with Siri, you can quickly open or close apps, play media, and more. So Vision Pro displays your eyes when someone is nearby. It's incredible. This breakthrough innovation is called EyeSight. This is how it looks when using apps, and this changes when you're fully immersed in an experience, sending a clear signal to those around you that you can't see them at the moment. When someone is nearby, they'll appear in your view. - Hey. - [Presenter 2] And Vision Pro will simultaneously reveal your eyes to them. - Vision Pro is always in sync with your iPhone, iPad, and Mac. All your notes, messages, photos, and documents stay up to date automatically with iCloud. You can receive a 3D object in Messages, pull it out, and look at it from every angle, just as if it was there in front of you. Vision Pro also works seamlessly with familiar Bluetooth accessories, like Magic Trackpad and Magic Keyboard, which are great when you're writing a long email or working on a spreadsheet in numbers. FaceTime now becomes spatial, taking advantage of the room around you. You can join a group call and see everyone life-size. As new people join, FaceTime simply expands. With Spatial Audio built right into Vision Pro, you hear each person's voice coming from the location of their tile, making group conversations easier and more natural. - Vision Pro is Apple's first 3D camera. It lets you capture and relive your memories in 3D with Spatial Audio. It's easy to capture a spatial photo or video with just the press of a button. And EyeSight makes it clear to those around you when you are capturing one. You can capture a spatial video of a fun moment with your kids to share it with your family or to experience all over again for years to come. Turn any room into your own personal movie theater. This environment lets you focus fully on the movie and is built to give you a fantastic viewing experience. You can watch 3D movies as well. In Vision Pro, 3D movies have incredible depth and crisp motion. You can play your favorite Apple Arcade games, like \"NBA 2K23\" on a screen as large as you want with incredible audio and game controller support. There will be over 100 Arcade titles available for you to play on Day One. - So I'm thrilled to introduce Bob Iger, CEO of Disney. - We're tremendously excited to give you a sneak peek of just some of the things that we've been dreaming up. - [Narrator] You could experience your favorite stories in unexpected ways. You could do more than just watch sports. - [Commentator] Touchdown! (uplifting music) - [Narrator] You could be at the game without leaving your home. (crowd cheering) Or be part of the action like never before. (dramatic music) - And I'm excited to announce that Disney+ will be available on Day One. - The entire front of the product is a singular piece of three-dimensionally formed and laminated glass. It's polished to an optical surface, allowing it to act as a lens for EyeSight and a wide array of cameras and sensors that need to have a view of the world. The glass flows seamlessly into a lightweight frame that houses a button to capture a spatial photos and video, and a Digital Crown that summons the Home view and rotates to control immersion levels of environments. We studied thousands of heads to get a detailed understanding of the huge variation in cheek width, face angle, and head shape. This led us to design a modular system that allows us to tailor the product to fit you perfectly. The Light Seal comes in a range of different shapes and sizes and flexes to conform to your face, delivering a really precise fit. Extending from the frame are flexible straps that conform to the head, ensuring the audio pods remain close to your ears. They deliver rich Spatial Audio while keeping you aware of your surroundings. The headband is 3D-knitted as a single piece to create a unique rib structure that provides cushioning, breathability, and stretch. The bander touches with a simple and secure mechanism, allowing you to change it for a different size or even a different kind of band. An easy-to-reach adjustment tile helps you secure the device comfortably and enables micro adjustments during use. Vision Pro supports all-day use when plugged in and up to two hours of use with the external high-performance battery. A separate battery means that you don't wear that weight on your head. The soft aluminum form slips easily into your pocket and connects via supple-woven cable. - [Presenter 3] A display where the pixels would disappear, creating a smooth, continuous image. They're just 7 1/2 microns wide. Combined, Vision Pro has 23 million pixels across two panels that are each just the size of a postage stamp. Personalized sound is delivered through the integrated dual-driver audio pods, allowing us to create ambient Spatial Audio, where your brain is totally convinced that sounds are coming from the environment around you. Using a technique called Audio Raytracing, the system also provides high-resolution video to the displays, enables precise head and hand tracking, performs real-time 3D mapping, and more. After a quick enrollment process using the front sensors on Vision Pro, the system uses an advanced encoder-decoder neural network to create your digital persona. This network was trained on a diverse group of thousands of individuals. It delivers a natural representation, which dynamically matches your facial and hand movement. - I'm doing well, thank you. - With your persona, you can communicate with over a billion FaceTime-capable devices. When viewed by someone in another Vision Pro, your persona has volume and depth not possible in traditional video. None of this advanced technology could come to life without a powerful operating system called visionOS. We added a host of new capabilities to support the low-latency requirements of spatial computing, such as a new real-time execution engine that guarantees performance-critical workloads, a dynamically foveated rendering pipeline that delivers maximum image quality to exactly where your eyes are looking for every single frame. A first-of-its-kind multi-app 3D engine that allows different apps to run simultaneously in the same simulation. And importantly, the existing application frameworks were extended to natively support spatial experiences. visionOS is the first operating system designed from the ground up for spatial computing. - Developers can use familiar tools and frameworks, like Xcode, SwiftUI, RealityKit, and ARKit to make new apps for Vision Pro. And to streamline the preparation of 3D content for spatial apps, we built Reality Composer Pro, which makes it easy to assemble complex scenes with realistic objects. We are excited to share that we've been working with Unity to bring those apps to Vision Pro. So popular Unity-based games and apps can gain full access to visionOS features, such as pass-through, high-resolution rendering, and native gestures. - Optic ID. This new system uses the uniqueness of your iris, which is distinct even with identical twins, to instantly unlock Vision Pro. In Apple Vision Pro, where you look stays private. Eye input is isolated to a separate background process, so apps and websites can't see where you are looking. Only when you tap your fingers do results get communicated. Apple Vision Pro starts at 3,499. It will be available early next year on apple.com and at Apple retail stores in the US, with more countries coming later next year. - Thank you so much for joining us. Have a great week and a great WWDC.",
    "transcript_keywords": [
        "Vision Pro",
        "Apple Vision Pro",
        "Mac Pro",
        "Pro",
        "Mac Studio",
        "Mac",
        "Vision",
        "Mac Pro starts",
        "Mac Pro brings",
        "Introducing Mac Pro",
        "Vision Pro starts",
        "Ultra",
        "Apple Vision",
        "Vision Pro supports",
        "apps",
        "Spatial Audio",
        "Audio",
        "Apple",
        "Vision Pro displays",
        "Spatial"
    ],
    "transcript_entity_values": [
        "iCloud",
        "EyeSight",
        "Mac Pro",
        "Spacebar",
        "Quizlet",
        "Uber Eats",
        "M1 Ultra",
        "all-day",
        "three",
        "the day",
        "The Lock Screen",
        "Reddit",
        "Every Mac Pro",
        "FaceTime",
        "NBA",
        "30%",
        "2",
        "CPU",
        "1,999",
        "Apple Arcade",
        "Safari",
        "6,999",
        "Live Voicemail",
        "thousands",
        "7 1/2 microns",
        "a great week",
        "3,499",
        "jack",
        "Location Sharing",
        "Tower",
        "Spatial Audio",
        "50%",
        "iPad",
        "AirPlay",
        "iMessage",
        "This year",
        "FaceTime,",
        "CarPlay",
        "1,199",
        "M2",
        "WWDC",
        "Day One",
        "Stickers",
        "third",
        "20%",
        "GPU",
        "The Light Seal",
        "M1 Max",
        "M2",
        "M2 Max",
        "Live Activities",
        "Flighty",
        "just 1,299",
        "Conversation Awareness",
        "Digital Crown",
        "NameDrop",
        "PCI",
        "iPad",
        "Major League Soccer",
        "daily",
        "18 hours",
        "Neural Engine",
        "Octane",
        "only 11.5 millimeters",
        "MacBook Air",
        "up to 50%",
        "Contact Posters",
        "- Journal",
        "40%",
        "Mail",
        "32",
        "this year",
        "just the past few months",
        "Japanese",
        "240",
        "first",
        "SharePlay",
        "76",
        "Health",
        "Adaptive Audio",
        "Chinese",
        "Memoji",
        "Starlight",
        "10",
        "Arcade",
        "Today",
        "Xcode",
        "SharePlay",
        "the Digital Crown",
        "M2",
        "M2 Ultra",
        "Mindfulness",
        "23 million",
        "AirDrop",
        "up to two hours",
        "Disney",
        "15-inch",
        "US",
        "22",
        "8",
        "Thunderbolt",
        "an early morning",
        "Apple Vision Pro",
        "Presenter Overlay",
        "Vision Pro",
        "Apollo",
        "K ProRes",
        "Ultra to Mac Studio",
        "early next year",
        "Reality Composer Pro",
        "Autofill",
        "Continuity",
        "Kojima",
        "the Live Photos",
        "later this year",
        "Wi-Fi",
        "Kojima-san",
        "tomorrow",
        "Magic Trackpad",
        "First",
        "RealityKit",
        "another Vision Pro",
        "ARKit",
        "192 gigabytes",
        "Mac Studio",
        "Gen 4",
        "one",
        "later next year",
        "Audio Raytracing",
        "Apple",
        "four",
        "over 100",
        "the Lock Screen",
        "today",
        "Bob Iger",
        "Mac Pro",
        "Widgets",
        "WebEx",
        "eight",
        "Magic Keyboard",
        "six",
        "HiCoffee",
        "API",
        "years",
        "17",
        "StandBy",
        "an Apple Watch",
        "Hertz",
        "night",
        "DaVinci",
        "the Smart Stack",
        "3",
        "the end of the year",
        "Siri",
        "two",
        "24",
        "MagSafe",
        "Apple Watch",
        "next week",
        "Notes",
        "WebKit",
        "just over three pounds",
        "this fall",
        "Sonoma",
        "M2 Max",
        "Introducing M2 Ultra",
        "Max",
        "iPhone",
        "Mac",
        "Midnight",
        "UltraFusion",
        "up to 25%"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "GPE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "PERSON",
        "EVENT",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "LAW",
        "PERSON",
        "ORG",
        "PERSON",
        "LOC",
        "DATE",
        "LOC",
        "LOC",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "ORG",
        "FAC",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "GPE",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "PERCENT"
    ]
}