{
    "id": "eOH33sWgds8",
    "title": "What Reviewers Aren’t Telling You About Apple Vision Pro",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2024-02-15T22:35:07Z",
    "video_url": "https://www.youtube.com/watch?v=eOH33sWgds8",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "apple vision pro",
        "VR headset",
        "Micro-OLED",
        "pixel density",
        "battery capacity",
        "voltage",
        "EyeSight display",
        "audio quality",
        "hardware review",
        "VR enthusiast",
        "spatial computing",
        "passthrough",
        "field of view",
        "straps",
        "battery life",
        "USB-C",
        "Lightning Max",
        "Lightning Ultra",
        "AirPods Pro",
        "latency",
        "display technology",
        "lenticular display",
        "VR immersion",
        "vision pro",
        "vision pro gaming",
        "apple vision",
        "vision pro vs meta quest 3",
        "apple vr review"
    ],
    "views": 366562,
    "likes": 14651,
    "comments_count": 1056,
    "description": "Ive been a VR-enthusiast for a decadeheres everything others missed about Apple Vision Pro. Get the iVANKY FusionDock Max 1 -  Use code SNAZZYLABS (valid until March 31, 2024) Note: iVANKY FusionDock Max 1 is designed for Apple Silicon Macs only - no compatibility with older Macs or PCs  Follow Snazzy Labs on Twitter -  Follow me on Instagram -   Join us as we answer *your* Apple Vision Pro questions: from the Micro OLED panels, to pancake flaring, passthrough quality, batteries, their voltages, etc., EyeSight, AirPods Pro 2 lossless support, and a whole lot more we didnt feel viewers fully touched on.   0:00 Not Your Average Vision Pro Video! 0:15 DISPLAYS 1:07 AVPs PPD is not quite retina 4:02 3D content is INCREDIBLE 5:12 Pancake glare is a real problem 6:03 FOV is bad, but kinda okay? 7:09 Passthrough is SUPER overrated 7:43 Technically amazing, yes 8:33 But just not good enough 9:47 I took an eye exam 11:04 Vision Pro is better at VR than AR 12:16 BATTERY 12:45 Lets learn about batteries, ok? 14:19 AVPs battery is real weird 16:01 Why not USB-C? Voltage and compromise! 17:22 Hot take: AVPs battery is a good design 18:20 No data is stupid, though 19:09 RIP 19:13 STRAPS 20:12 Counterbalancing is ill-informed. DISTRIBUTE instead! 20:55 Every single VR headset offers rigid straps 21:53 AUDIO 21:56 AirPods Max? 22:03 AVPs speakers are just fine 22:40 Lossless w/ AirPods Pro 2 USB-C 23:43 Latency w/ AirPods Pro 2 USB-C 24:21 EYESIGHT 25:05 It was made for erm, me 25:37 They seem afraid to show it 25:57 First thing to go? I dunno 26:52 Hardware? Done. Software? Oh boyyyy.",
    "description_links": [
        "https://snazzy.fm/gz",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "WAIT! I know you've seen a million Vision Pro videos, but this one's different! I'm going to tackle YOUR hardware questions that remain unanswered by othersand I'm going to do it as a decade-long VR enthusiast that's tried almost every headset on the market. Let's start with the best of the headset's hardware. More specifically, the Micro-OLEDs inside. I got a lot of questions about resolutionand that's likely because Apple itself is irresponsibly marketing \"4K per eye\" which is not true, really, but neither are \"4K TVs\". At 3,386 pixels squared, the Apple Vision Pro's displays ARE more pixel dense than a 4K TV and indeed a marvel given they're the size of a postage stamp, but pixels per inch which has been cited by reviewers everywhere doesn't mean anything for a head-mounted display because you're literally magnifying itand every headset varies in magnification. Human eyes use cones and rods to see a field of view measured in degrees. Pixels per degreethe metric used in VRbetter represents display resolution because it divides the pixel count by the field of view size within the headset giving you a pixel density per degree of vision. The Apple Vision Pro is one of highest density headsets on the market at a PPD of 34; however, it's a lot lower than an iPhone that's a foot away or a 65-inch 4K TV that's 7 feet awayboth of which measure over 90 pixels per degree of vision. The end result is displays that look really, really nice most of the time. The UI is set to \"large\" by default and when text is both large and nearby, it looks every bit as sharp as you'd expect a 4K display to look; however, once you push windows out with smaller text on them, you will start to see anti-aliasing and moire on textwhile I can't make out individual pixels, I can see pixelated clusters. It's still readable, but readable in the way a 27\" 1440p monitor is from 2 feet away. That said, compared to something like the Meta Quest 3 which also looks quite nice, it's no comparisonthe Vision Pro blows it out of the water. Even so, while broadcasting your Mac's display at 4K does look great, but it's not even as sharp as a Studio Displaymuch less the mini-LED screens found in MacBook Pros. Did you know the Vision Pro doesnt auto-share with desktop Macs? Youve gotta go through Control Center. Yet another reason to use a MacBook Pro as your primary machine and today's sponsor, the Ivanky FusionDock Max 1 is the most insane laptop dock enabling a desktop workflow in a laptop form factor. This thing is the first dock on the market with dual Thunderbolt 4 chips enabling quad-display supportthat's three 6K displays and one 4K display at 60Hz through a single dock. So, you plug two cables into your laptop which supply 96W of upstream power, you can run your displays, and then utilize TWENTY I/O ports. 20! From 40Gig USB-4 with power delivery, to full-speed USB-A, SD, microSD, headphone out, microphone in, line out for speakers, optical audio, and 2.5Gbps Ethernet. This isn't like most docks where maybe one or two ports are full speed and they're poorly labeled so you actually just use your laptop's spare Thunderbolt port, no, these are legit. Two cables into your laptop and you'll never unplug it againexcept for when you hop on a plane and connect your Vision Pro. The FusionDock Max 1 has a gorgeous floating design not only looks cool but helps with thermals. This thing is for pros and its priced accordingly (if you've looked at laptop docks you know there's seriously not a single offering on the market that beats it), so it ain't cheap, but right now using my link for a limited time, you can get it for $150 off. We've replaced our previous laptop dock with ita best-seller with the same price and specs half as nice. Get your Ivanky FusionDock Max 1 today using the links below. After a couple of hours staring at a script in Vision Pro, I do start to feel myself yearning for more pixels, but most of the time it doesn't really bother meespecially when playing games or consuming content. 3D movies in particular are incredible because there are no weird tricks required to simulate 3Dyou have two truly separate video feeds for each eye. Additionally, where most 3D movies at the theater are super hard to see because you've got to put on glasses that cut a ton of light from an already dim projector, Vision Pro is anything but. I don't have a way to measure luminance at the eye, but we know the displays themselves put out nearly 5,000 nits which means after the optics I bet it's around 1,000 nitsinside a dark headset its really friggin bright. I watched Pixar's Elemental in 3D and not only was it a cute movie that was the best 3D experience I've ever had, it was perhaps one of the best movie-watching experiences I've had EVER. Period. But bewaremove to a moody live-action like Logan, and you're in for a rough time. Scenes with a lot of high contrast or white text on a black screen, and it'll become glare city. It feels like someone is shining a flashlight into your eye through a smudged window and is so distracting it's almost a dealbreaker. This is unfortunately just a side-effect of pancake lenseswhere fresnels had godrays, pancakes have glare. This can be mitigated by watching a movie in a daytime environment so your eyes don't get adjusted to darkness and then blasted with light, but that does come at the expense of immersion. I got a lot of questions about field of view. If you don't understand field of view, look forward, take your hand and do this: see how you've got it in your periphery? Now go like this, take your other hand, and try that same motionyeah, you can't see it due to a lower FOV. It's the \"goggles\" effect. Frankly, the Vision Pro's field of view is pretty badworse than just about every modern VR headset including the $500 Meta Quest 3; however, while there's still edge distortion and chromatic aberrationApple can't beat physicsis way less noticeable than on my other headsets. So more of the FOV is usable even though the field of view itself is smaller. While of course I'd like it to be larger and expect Apple should improve it for a second gen, it's pretty far down my priority listat the top of that list? Improving passthrough. OK, passthrough has been hailed by many as true-to-lifenearly as good as the real worldlike you'd never know you were looking through cameras instead of glass. Those people are... and I mean no offense... potentially legally blind. Passthrough is fineyou can see what you're doing, but it's absolutely like looking through a camera feed of a smartphone that's a few years old. I mean, just compare it to my iPhone 15 Pro... Now, before I crap all over it, I don't think Apple has \"cheaped out\" here and I must acknowledge the things it does that are impressivestuff an iPhone camera simply cannot do: these cameras run at 90Hz all the timeno matter the lighting conditionsand they have much better low-light video performance than a smartphone camera. These sensors are special and specific to this type of application. There's an impressive amount of distortion correctionsomething the Quest really struggles with. It doesn't look like you're viewing the world through an ultra-wide smartphone camera objects don't wig out when you bring them close, your PERSPECTIVE looks like real lifejust with a smaller field of view. And this entire pipelinefrom camera lens to sensor to processing to distortion correction to display to lens to eye happens in 12ms. There's virtually no latency at allit's incredible, and will help a lot of people that have been made \"sick\" by VR feel completely comfortable. Having said that... it kinda looks like butt. There's very little dynamic range with highlights being blown or shadows being crushed and colors muted without realistic saturation. Frankly it looks like ungraded log footage White balance is almost always wrong shifting too warm, and no matter the lighting condition, there's TONS of noise. To combat that noise and stabalize micro adjustments that come from the headset moving on your face when you make any facial expression or speak, there's severe motion blur that translates when you move your head, creating visual artifacting. I'm not gonna get into itnerds know what's upbut no varifocal lenses or displays (while not unusual for a conumser VR headset) means it's really quite painful to focus on objects in the real world for any amount of time that are short of natural infinity focusso... like 15 feet or less. I tried to cook at night in my very bright kitchen with this thing on. I'm a good cook and don't need to look at my hands much when I'm... cutting, for example, but my eyes still got exhausted trying to see through all of the noise and focus on stuff less than 3 feet away from me. I had to take it off after 20 minutes and that's coming from a VR veteran who doesn't get eye strain easily. This bothered me and I wanted to ensure I wasn't the problem, so like any psychotic YouTuber, I took a self-administered eye-exam. I achieved 20/15 visionplacing me in the top 30% of 30-year-old adults. Then, I tried the exam again in ideal circumstances where passthrough looks the bestoutsideand with a lot of squinting and second-guessing, my acuity was measured at 20/30. Still pretty good and within the \"you can use glasses if you want but you're mostly fine\" range. Then, I tried it inside. Even with the best lighting I could achieve from my overhead lights and sun from the windows, I couldn't even get 20/50 which would prevent me from driving a car in all of Europe, India, Canada, Mexico, Japan, and only half of the United States. Boy, we need more stringent driving tests. In a dark room, that acuity pushed to beyond 20/70 preventing me from driving in every state but Maine, North Dakota, Wyoming, and Oklahoma. In fairness, only 184 people live in all of those states combined so what's the risk, eh? When all the stars are aligned by having lots of highly saturated colors around you, tons of natural light but not too much dynamic range by way of shadows, one might be fooledif only for less than a secondthat it was a pair of see-through goggles. But these instances are like a needle in a haystack and in real-world scenarios, you'll find yourself likely turning the knob to enable an environment because the real world through the headset is drab, depressing, and compromised. And I think Apple knows this: despite hyping AR for years on the iPhone, they aren't doing that with Vision Pro. It's all aobut mixed reality and spatial computing. When you're focused on generated content in a paned window and passthrough is in the periphery, it's great! And it even serves its purpose as a short-term substitute for real vision just fine, but AR content where the real-world becomes the focus results in the illusion falling apart rapidly and the experience comes away feeling highly compromised. I still believe dynamic AR content is the goal of visionOS eventually, but it's years away and several headset revisions down the line. Sick of screens yet? Yeah, me too. So let's talk about batteriesriveting! No seriously though, I got more questions about the battery than maybe anything. OK, so you've already heard the news, using a SIM eject tool, you can pop out the cable that's normally fixed in place and reveal Lightning Max. Use the same trick on the headband, and you reveal Lightning Ultra. Why the heck use a proprietary connector and not USB-C, you ask? I'm actually gonna throw Apple a bone here and explain why their choice kinda makes sense. Hear me out... so there were tons of articles that circulated about how the Vision Pro \"only\" has a 3,166 mAh battery and how that's less than a smartphone. Milliamp hours alone do not indicate battery capacitythey denote volume given a known pressureor voltage. So 3,000 mAh can provide 3,000 milliamps, or 3 amps at an unknown voltage for one hour. See where I'm going with this? Without the voltage, the mAh rating is meaningless. Now, most smartphones have just a single battery cell at or slightly above li-ion's nominal voltage of 3.6V. So, you kinda can usually compare smartphone batteries directly, but everything else, you can't. Watt-hours are a much more dependable measure of capacity because they state how much of a load can be applied over time. Let's use our smartphone battery as an example. Voltage * Amperage = Wattage That's the formula. So... 3,000 mAh which is 3Ah at 3.6V gives us 10.8 Wh. This means that we can power a constant 10.8W load for 1 hour before the battery dies. If we drew half thata constant 5.4W load, we'd get 2 hours of power. Make sense? Talk about battery capacity in watt hoursnot amp hours. So back to Vision Prothe battery states a 35.9Wh capacity. This is just basic algebra, baby. We plug in our 3,166 mAh value, do the maths, and boom11.33V. We round up and 12V is what the battery pack should be supplying to the Vision Pro. Here's the problem... batteries are liars sometimes. iFixit discovered upon opening the Vision Pro's battery that there are THREE 15.36Wh cells inside which suggests 46Wh of capacity or 14.5V of supplied power if that 3,166 mAh rating is accurate. What the frick? Batteries are not perfectly efficientthere's heat, degradation, standby loss, and a lot more that needs to be accounted for. But this number is wayyyy offlike by almost 20% capacity. What's going on? Well, when we charge up the Vision Pro's battery, despite only including a 30W charger in the box, it can draw up to 60W from the wall throughout the entire charge curve. To me, this means that the battery is only being charged to 80%. Undercharging cells can extend longevity especially since this battery pack only lasts 2 hours and is consistently being filled and drained every time you want to use the headset plugged into the wall. So then we return to the questionwhy not just let me use USB-C directly into the headset and give the poor battery a break? The answer is engraved in plain text. 13VDC. Apple is running 13V to this headset which is a very weird voltage. Why did they choose this? Ugh, there's a number of potential reasonsone could be to have a thinner tether cable because higher voltage means lower resistance and thinner wire, two could be efficiency curve optimizations, and three could be that this friggin' headset just draws a ton of wattage and that voltage makes the most sense for the selected battery chemistry, series arrangement, and capacity. I mean, think about it. There's an M2which is a laptop chip, an R1 which is almost the same size and likely draws similar power, there's two blower fans, tons of sensors, two small but extremely bright, pixel-dense displays, speakers, an outer screen, you get the idea. The Vision Pro draws a heck of a lot more than most of Apple's laptopsat 13V and 3A that's a possible 40W load all at once. The issue is that 13V is not a standard step voltage and is not supported by USB-C PD 3.0 unless the charger includes an optional \"PPS\" or programamble power supply not required by the official PD 3.0 spec. Basically, most chargers wouldn't workand if you did find one that worked, Apple would need to keep hot mosfets, filters, and more inside the headset itself which would add a little more weight and a lot more heat. Instead, they opted to throw all that crap inside a replaceable battery that accepts any incoming voltage you want to throw at it from any charger and it pulls double duty as a UPS when you want to move rooms away from the wall. Haters look out, it's well-designed. I said it. But that doesn't mean all is well. The type-C port on the battery is only for power-in. It can't supply power to any other USB-C device and does not permit data transfer. And given there isn't a USB-C port on the headset, if you ever bork the firmware, you need to go to the Apple Store unless you pay $99 a year to be a developerin which case Apple will begrudgingly sell you a replacement speaker-arm with a USB 2.0 type-c port on it for the low-low price of $300. Yikes. OK, let's rapid-fire a few smaller categories. Straps! Both of the included strapsin my humble opinionsuck rocks. The solo loop is gorgeous and comforable where IT touches you, but only gets the HEADSET to stay in place by putting extreme clamping pressure on your faceget ready to sport red goggle lines. The dual strap is more comfortablefor me, and mostand helps offload some of the pressure from your face but at least on my head, that top strap is placed too far forward to actually make contact with the crown of my head sending the headset's weight crashing into the bridge of my nose or, if I make it comfortable, by being positioned too highresulting in the headset yelling at me. I've gotten used to it, but I never forget its there and can only wear it for about 3 hours before I combust into flames. I've seen many suggest counter-balancing the headset's weight with the battery at the back of your head. If I may humbly suggest as someone who has a ton of experience with VR, this is ill-informed. Adding weight to your head is almost always the wrong answer. You do not need to counterbalance weightyou merely need to distribute it. Take this BoboVR strap for Oculus Quest... while they do support a battery at the back, it's the crown and forehead cradles that \"fix it\" to your head while these little butterfly tabs helping to distribute weight evenly leaving the headset itself barely making contact with your facejust enough to get the light sealed out. I REALLY think Apple should have developed a rigid strap and likely has multiple prototypes but decided they were too ugly to release. Every single VR headset offers a rigid strap as a premium option because it's almost always the right choice. Take the BigScreen Beyond for example... this headset is focused on weight reduction at all costs. It uses chintzy plastic, removes any adjustment knobs and dials permanently fixing it to your specific face preventing sharing with friends solely so that it can shave off every gram possible. And this thing is light. Unlike the Vision Pro, I truly forget I'm wearing it. But even BigScreen is adding a rigid audio strap as an option so that pressure can be removed from the face and the headset's weight can be distributed even further. Apple missed herehopefully 3rd party companies pick up the slack. Let's chat audio. First... like 12 people wanted to know if the AirPods Max work with the Vision Pro. (make wtf face) if have a chiropractor, sure. I've seen rave reviews about the speakers on the Vision Pro from almsot everyone. My friend, John Gruber, whom I respect a whole ton says that he has no desire to use AirPods over the built-in speakers. For me? That sentiment is not shared. I do find that the spatial effects are somewhat cool providing better soundstage than you'd get from AirPods Pro, but there's essentailly no sub-bass, they're very bright, distort above 80% volume and while fine for movies and TV shows are unacceptably bad for music. They are what they appear to besmall speakersand nothing more. AirPods Pro 2 (but only the new USB-C model) support 20-bit 40kHz lossless audio playback with Vision Pro and only with Vision Pro. Why just this device? Similar to Sony's LDAC, pushing more data through the same pipes just murders range so what better pairing than a device that's 3 inches away from your ears? It's still using Bluetooth as a backhaul but gets help from the H2 and an undisclosed wireless transmission protocol to make it all happen. So... is it bupkis? No. As the snobby audiophile I am, I was able to correctly guess 70% of the 20-songs I was quizzed on in a blind test, but that's not anywhere near what I normally guess and only marginally above the statistical average. What I'm trying to convey is that it's only slightly better and most people probably won't notice much of a difference if any at allwith fidelity. Now, with latency, I noticed a huge difference. I was never bothered by my Lightning AirPods Pro 2 because there was always a slight playback delay on iOS to compensate for Bluetooth latency, but with the USB-C AirPods Pro 2, everything is instant to play or resume and lip syncing is dead on 100% of the time in all apps which is really great. Should you go out and buy new AirPods Pro 2 if you've already got the new Lightning variant? No, but its nice. Why not close the hardware of Vision Pro out with its most controversial featurethe EyeSight display... When you look at someone from within the headset, eyes appear on the headset's face. Basically, if you can see people on the outside, they can see you on the inside. Theoretically. The display is lenticularthat's a fancy way of saying its like those cheapo bumpy plastic hologram things. The idea being that (a) it makes your eyes actually look insetrather than pasted on a screen 3 inches away from your face), and (b) that there's a 3D effect where the facial features follow youkinda like the Mona Lisa. When it works, it's actually really cool and rather convincing. The thing is... it really only works well for people that are really light-skinned with really colorful eyes in a really well-light room. Basically, it was made for me. People with darker skin tones or brown eyes will find that most of the time it's just too dim to really be noticeable. And even for me, it's only noticeable when I'm in a bright room but one without reflections. When I start to dim the lights, the effect basically disapears. It's cool that it matches ambient lightingwould be weird to have super bright eyes in a dark roombut on the other hand, it's almost like they're afraid of showing people how bad it really looks and their solution is to make it barely visible all the time. Which at that point, why do it at all? Here's the thing... my opinion has changed about Apple getting rid of it. Ilike many othersstated this would be the first thing to go on the next-gen, cheaper headset. That it adds too much weight, complexity, cost, and power draw to be worth keeping; however, what I've learned is that the Vision Pro is the least-isolating VR headset I've ever tried. Not because I can see the worldother headsets do thatbut because the world can see me. And even though it's kind of uncanny, holding a conversationif even for a few momentswith someone whose eyes and facial expressions you can see, feels more real. You feel less ignored. And I think it may just stick around until the headset is in a form factor small enough that we don't need to have pretend eyesthey can just be our real ones. And those are your questions about the Vision Pro hardware answered. Stay tuned for our upcoming video tackling all of the software oddities concerning Vision Pro. If you thought this video was a doozie, buckle up and get subscribed.",
    "transcript_keywords": [
        "Vision Pro",
        "Apple Vision Pro",
        "Vision Pro battery",
        "Pro",
        "Vision",
        "Vision Pro displays",
        "Vision Pro field",
        "headset",
        "Vision Pro videos",
        "million Vision Pro",
        "Vision Pro draws",
        "Vision Pro hardware",
        "AirPods Pro",
        "Apple Vision",
        "Apple",
        "comparisonthe Vision Pro",
        "Vision Pro blows",
        "battery",
        "Pro battery",
        "USBC AirPods Pro"
    ],
    "transcript_entity_values": [
        "60Hz",
        "3,386",
        "90Hz",
        "Control Center",
        "Mexico",
        "2 hours",
        "27",
        "Logan",
        "K",
        "only half",
        "10.8 Wh",
        "40Gig",
        "only 184",
        "Thunderbolt 4",
        "LDAC",
        "two",
        "a couple of hours",
        "Maine",
        "AirPods Pro 2",
        "3",
        "Micro",
        "20",
        "nearly 5,000",
        "YouTuber",
        "Ilike",
        "40W",
        "Oklahoma",
        "Milliamp hours",
        "one",
        "Canada",
        "3,000",
        "AirPods Pro",
        "1 hour",
        "M2which",
        "H2",
        "a few years old",
        "John Gruber",
        "2.5Gbps",
        "Ethernet",
        "the AirPods Max",
        "Two",
        "K TV",
        "North Dakota",
        "UI",
        "daytime",
        "the Apple Store",
        "500",
        "13VDC",
        "60W",
        "12V",
        "3.6V",
        "Sony",
        "years",
        "35.9Wh",
        "BigScreen",
        "Apple",
        "almost 20%",
        "13V",
        "a 65-inch",
        "20 minutes",
        "amp hours",
        "20/30",
        "3,166",
        "Mac",
        "Japan",
        "the Vision Pro",
        "100%",
        "first",
        "4",
        "14.5V",
        "3 inches",
        "70%",
        "20/50",
        "150",
        "three",
        "Ivanky",
        "Macs",
        "3A",
        "USB",
        "30%",
        "300",
        "30W",
        "20/70",
        "Quest",
        "3,000 milliamps",
        "Thunderbolt",
        "2 feet",
        "the Vision Pro's",
        "TWENTY",
        "EyeSight",
        "Vision Prothe",
        "MacBook Pros",
        "80%",
        "15 feet",
        "one hour",
        "3Dyou",
        "20/15",
        "today",
        "the Vision Pro",
        "the Apple Vision Pro's",
        "7 feet",
        "90",
        "Elemental",
        "the United States",
        "iPhone",
        "34",
        "a ton",
        "The Apple Vision Pro",
        "3.0",
        "99",
        "bork",
        "VR",
        "less than 3 feet",
        "India",
        "half",
        "40kHz",
        "Wyoming",
        "96W",
        "6",
        "THREE",
        "Europe",
        "AirPods",
        "Meta Quest 3",
        "10.8W",
        "FOV",
        "13V",
        "12",
        "30-year-old",
        "decade-long VR",
        "Vision Pro",
        "SD",
        "iFixit",
        "Watt-hours",
        "Lightning Max",
        "3Ah",
        "about 3 hours",
        "the Mona Lisa",
        "VRbetter",
        "USB-C",
        "around 1,000",
        "First",
        "second",
        "Lightning AirPods Pro 2",
        "night",
        "microSD",
        "3rd"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "GPE",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "TIME",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "QUANTITY",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERCENT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORDINAL"
    ]
}