{
    "id": "eP78wW2S3h0",
    "title": "New Drone, who dis? DJI Air 2S!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-16T18:47:01Z",
    "video_url": "https://www.youtube.com/watch?v=eP78wW2S3h0",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 145339,
    "likes": 6107,
    "comments_count": 351,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(upbeat pop music) - Hey guys, iJustine. And today, we have some more drone content for you. I'm so excited because last year when I was reviewing the Mavic Air we were still in the middle of the pandemic. No, actually it was the start. It was basically at the beginning of when the whole world shut down. And since then I have flown that drone quite a bit actually, and it has been one of my favorite drones. And now they have an update to that drone. This is the Mavic Air no, just Air 2S. Seems as though they are dropping the Mavic. But I'm incredibly excited about this one because this is basically a huge update to that. This now has a one inch sensor. So I'm sure many of you drone pilots are familiar with the Mavic 2 Pro which also has a one inch sensor and shoots 4k. This little guy actually has a one inch sensor as well but shoots 5.4k. (upbeat pop music) (box clinks) Ooh, look at this. Accessories. And this is the fly more combo which does come with batteries and a charger, and the controller. (upbeat pop music) It's in a accessories box. Let's take a little look, see. (paper rustles) (accessories clink) (upbeat pop music) What is this? Oh, ND filters. I love that this comes with ND filters already. This is cool. And it comes in this nice little case. Look at that. (case clinks) Extra little joysticks, extra adapters, USB-C cable to get the batteries charged, propellers on for a more update. I like that each of these bags is labeled, so it shows you where the props will go. (accessories clink) (upbeat music) (waves billow) (sea gulls squawk) (upbeat techno music) I really love this new MasterShots feature. This is kind of their next evolution of Quickshots which you basically press a button and the drone will automatically fly and get you some really cool shots. This one is a little different because it will do 10 different shots all in one sequence and then it will edit those together to create a short cinematic video after. I like this because a lot of times when I'm out flying, I might not have a lot of time, so if I can just quickly send the drone up, choose the subject, it will automatically shoot 10 different shots for me. I did trim these clips slightly just for the sake of this video, but the final edit is a little bit longer. (upbeat techno music) - [Man] What are you seeing, what are you seeing? - Okay, so there is dolphins. I'm filming dolphins. They are eating, playing and doing dolphin things. (upbeat piano music) (dolphins squeal) (upbeat piano music) (waves billow) (dolphins squeal) (upbeat piano music) (waves billow) So I've just flown my drone back. Jen and I are out flying right now. She is also doing a video so I'll put a link in the description if you wanna check out hers. And I was trying to get some cool surfer action but the waves are very tiny, so trying to get anybody doing anything was kind of impossible. But so far I have been loving this drone. I feel like every time that Jen and I have been trying to go out and record with it it's been cloudy or it's been rainy. So I'm definitely looking forward to testing this out more. Having this one inch sensor has also been amazing. I'm so used to flying the Pro version that does have the one inch sensor, and now having that again, you can definitely tell with low light situations that the image is so much clearer. Being able to quickly swap out those ND filters was amazing when earlier it was really bright outside, and overall, honestly having an upgraded obstacle avoidance is really amazing not only for new drone pilots, but even for experienced pilots as well to be able to just fly through with confidence because I have been flying a lot of FPV recently so kind of going back to the cinematic style drone flying is very, very different. Anyway, I will put a link in the description if you guys wanna check out more info about the DJI Air 2S. I am very excited about this and I love all the things that DJI has been coming out with recently. So I definitely look forward to seeing what you guys think of this. Stay tuned for more drone footage in all of my upcoming videos. I'll see you guys in the next one. Bye. (upbeat techno music)",
    "transcript_keywords": [
        "Mavic Air",
        "drone",
        "inch sensor",
        "Mavic",
        "Air",
        "inch",
        "sensor",
        "flying",
        "DJI Air",
        "guys",
        "Hey guys",
        "excited",
        "update",
        "basically",
        "reviewing the Mavic",
        "filters",
        "video",
        "drone pilots",
        "love",
        "lot"
    ],
    "transcript_entity_values": [
        "5.4k",
        "4k",
        "MasterShots",
        "Mavic",
        "10",
        "FPV",
        "Jen",
        "one",
        "iJustine",
        "Mavic 2 Pro",
        "USB-C",
        "DJI",
        "ND",
        "Air",
        "ND",
        "last year",
        "today",
        "Mavic Air"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "PRODUCT"
    ]
}