{
    "id": "ePG8jbjtyZY",
    "title": "NEW Mac Studio + Studio Display is UNBELIEVABLE! 🤯",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-03-17T13:01:09Z",
    "video_url": "https://www.youtube.com/watch?v=ePG8jbjtyZY",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 784025,
    "likes": 25483,
    "comments_count": 1418,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and look what we have today. We have the brand new Mac Studio and the Studio Display. I also have my little shop back here so I'm gonna go shopping. I'm gonna have the new magic mouse, the new magic track pad and the new magic keyboard with touch ID. (upbeat music) Oh my goodness. Here you are little friend, such an interesting little unboxing experience. Check this out. Do you wanna get a TikTok of that? (upbeat music) Look at this. Wow, okay, so I actually thought it was gonna be heavier than it is. The ultra version of the Mac Studio is actually two pounds heavier to accommodate for different cooling factors, which is kind of interesting. And because I read that, I actually thought this was gonna be heavier. So all things considered, it's not that heavy at all. We also have our charging cable which is a nice and braided black cable. We have some paperwork here, which I think that we have apple stickers. Oh, wow, look at this beautiful device. I just need a minute. I just need a minute. Oh, it smells so good. This is great. Oh my God, I can't wait to plug it in. We need a display. Well, good thing that we have won the new Studio Display. This is so exciting and this is something I think that people have been waiting for, a less expensive version of the pro display XDR. Granted, I think this might be a little bit out of some people's price ranges, just if they want a basic display. But when you're buying something obviously from apple you're not buying basic. (upbeat music) I know you guys watch my videos and you see my excitement but I'm so excited just in case I didn't tell you. Oh, it's upside down. Wait a minute. This is the bottom. Oh, you know why? 'Cause you're supposed to lay it down. This is how you're supposed to open it. (upbeat music) That makes so much more sense. Time to take you out of your box. This is very similar to the M1 iMac boxes that they have. You out, look at you, look at you. It's crazy. This in comparison to the pro display XCRS, that thing is so thick so heavy. Like this is such a more manageable weight and size. It looks like we've also got some paperwork. Oh, no, this is actually a thunderbolt cable. This is a prize possession. And it's the braided cable, this so nice. What a treat. Apple sticker, Apple sticker. Two apple stickers, oh my gosh and a bonus polishing cloth. Do you know how hard these are to get? All right, let's check out this display now. So it looks like back here we have a little surprise. It has like a little backpack. This is probably our power adapter, I would assume. Oh, look at that, nicely wrapped up. (upbeat music) Oh, it looks so good. Oh my goodness. Oh, another one. Are you ready for this? (upbeat music) Oh, this is the nano texture display as well. This looks so good. It smells good as well. This is awesome. Do you want a little spin for us, time to set him up? (upbeat music) So here it is the brand new Mac Studio and the Studio Display. It's all set up and I've been using it for the past couple of days. Now the Mac Studio is such an interesting little computer and I don't want you guys to be fooled by just looking at this small little tiny box because what's inside of this thing is actually really impressive. It's so impressive that I'm speechless and that's a lie because I actually have so much to say that I feel like I'm probably not gonna have enough room on the CF express card to say it all, especially 'cause we're shooting in 8K. Anyway, let's start out with what is M1 because I feel like a lot of people who might be watching this maybe for the first time, may have just heard of the M1 processor and you might be a little bit confused. Up until a few years ago, Apple was using all Intel processors in all of their computers until they surprised us with the announcement of the M1 Apple Silicon chip. And this is something that they are now taking in house which is kind of incredible because this is allowing apple to really take full ability of their software and hardware and making sure everything is working seamless. And why this is important is apple now has the ability to tailor their hardware and software for the most compatibility. So if they're working on not only the processor that they're putting inside of the hardware that also allows them to fine tune the software to work with everything and just really keep this Apple ecosystem going. And so far, I have been more than impressed by the performance of the M1 chips and not only the 13 inch, but the MacBook pro to the M1 iMac and even the M1 Mac mini. But now that kind of brings us to where we are currently where we have this little box right here that has an M1 ultra chip. Now, this is actually two M1 Max chips put together. So this was kind of a surprise in the latest announcement because they were like, \"Oh, hey, by the way there's something that we didn't tell you about that last M1 chip that we release.\" - We're adding one last chip to the M1 family and it's gonna blow your mind - The M1 Max? Oh, yeah, we can actually put those both together so that they can simultaneously act as one. There's actually two versions of the Mac Studio. The first one has the M1 max chip and that's starting at $1999 with 10 core CPU, 24 core GPU which you could upgrade to 32, 16 core neural engine, 400 gigabytes a second memory bandwidth and up to 64 gigs of Ram. And that brings us to the device that I've been testing out with the M1 ultra chip and this is starting at $3999. And with those M1 Max chips connected together they're calling that to the ultra fusion architecture. So this has a 20 core CPU, a 48 core GPU which could be upgraded to 64 core, a 32 core neural engine, 800 gigabytes a second memory bandwidth and up to 120 gigs of RAM and a media engine that is doubled by at of the M1 Max. You do have the ability to upgrade both versions to an eight terabyte solid state drive. And if you happen to have four pro display XDR laying around, you can connect them plus a 4K TV to your Mac Studio. The pro display XDR is such a beautiful display that if you do have the money to spend on it, I definitely recommend it. But let's not forget, we now have a less expensive version with more features in the pro display XDR which we'll get to that Studio Display. Don't worry. We're getting to your moment. One of the things that I've loved so much about the new M1 chip is the fact that this has allowed the cooling of all of these devices to run so much more efficiently that you really hardly ever hear fans at all. Not only does that improve the thermals but that also assists with battery life. Like I can go a whole day, maybe two days of just doing everyday normal tasks even editing full on YouTube videos. I don't even have to think about the battery at all. So testing out this Mac Studio, I just wanna tell you I'm upset because in my mind I thought that this wasn't something that I was gonna get. I didn't need this. I would get it purely for the sake of testing and I would go back to using my M1 Max MacBook. And that's where I was completely wrong because the amount of performance that this has while I've been editing all this 8K footage like now that I know how powerful this is, how this has given me the ability to really upgrade my footage to 8K seamlessly, like I'm editing 8K footage and it feels like it's seven 720P shot on a freaking potato, it doesn't even make sense. I don't understand. It is not computing in my mind how powerful this is. And before getting the M1 Max MacBook I was using an entirely spec out Mac Pro with 1.5 terabytes of RAM, that is so unnecessary for what I'm doing on a day to day basis. I realize that, but just knowing that I have tested out the best of the best computers and now this is sitting on my desk at a starting price of $3999. Obviously, a Mac Studio does have drawbacks because you do need a monitor, you do need a keyboard. So this is definitely something that is predominantly a stay at home device, but I do travel a lot back and forth visiting my family and you know what I can do. I can put that in my carry on, I can take that home with me. If I have a display back at my parents' house this is mobile. I mean, I might not be able to edit on the flight with this but I can take this with me. This also has support for wifi six and Bluetooth five. That was something that I was gonna mention earlier but then I got onto a rant and forgot to say it. So we're just inserting it here. And the Mac Studio has a unique thermal architecture. It pulls air in through the airflow channels on the bottom using double-sided blowers and then it back out through these holes in the back. Something that I read online that was actually kind of surprising is that the M1 ultra version of the Mac Studio weighs two pounds more than the M1 Max because it uses a heavier copper cooling system while the regular M1 Max version utilizes an aluminum heat sink. Now that does kind of make sense since you are like just doubling the power of this machine by up writing to the ultra and this is probably why we won't see an M1 ultra in a MacBook anytime soon or will we, hard to say. I think this might be where the new M2 chip will finally come into play. While we're here talking about airflow and ports. This has four thunderbolt ports, 10 gigabit ethernet, two USBA, HDMI, a 3.5 millimeter headphone jack that will also support high impedance's headphones. Now on the front, you have an SD card slot and depending on which model you choose the M1 max will have two USBC ports and the M1 ultra will have two thunderbolt ports. So we've been talking a lot about the Mac Studio. We need a display to go with it. And now connected to the Mac Studio is this beautiful Studio Display. This is a 27 inch 5K retina screen with a built in camera, speakers, and microphone. Now the time of recording this I've actually edited the last three videos, including the one that you're watching right now on the Mac Studio using only the Studio Display speakers as my main audio output. And I have even thought twice about needing headphones or any additional speakers. I'm super impressed. I have also done a bunch of conference calls and with supported conferencing platforms like WebEx, Zoom, and FaceTime you're able to take full advantage of center stage. This camera is the same one that is in the iPad Pros and the new iPad Air. This display actually has a 13 Pionic Chip which also allows for spatial audio, the center stage feature, and Hey, Siri. Now on the back, it has three USBC ports and one Thunderbolt that will also charge portable MacBooks and it'll even fast charge a 14 inch MacBook. There's three stand configurations. The one that I have is tilt adjustable at $15.99, the other is tilt and height adjustable for $19.99 and then there's an option for a best amount adapter. You can also choose a nano texture for your display which is an additional $300 to help reduce glare and I cannot stress enough how much I love the nano texture display. It is so much easier on the eyes and I've been using it on my pro display XDRs for the past of years and it has improved my quality of work life significantly. Speaking of pro display XDR, comparing these two displays is actually really difficult because of the huge price difference. The pro display XDR are obviously better since they are a 32 inch 6K display, up to 1600 nits of brightness whereas the studio is 27 inch 6K, 600 nits of brightness but the highest end XDR is $7,000. I know. So when you can almost get three of these Studio Displays for the price of one XDR, so to tie our entire machine together we also have one of the new keyboards. This keyboard actually has the touch ID right here integrated into the keyboard. And this was first introduced in the M1 iMax so I'm super excited to see it now available for order in full size with the number pad. Overall, I have been having such an incredible experience on this Mac Studio and this is the M1 ultra with 128 gigs of RAM with two terabyte solid state drive. Now I normally almost always edit off of external OWC drives and this is actually a 16 terabyte SSD raid. So this is the moment that I've been waiting for, I get to show you guys what I've been working on. So this is the iPad video, some of you may have seen it, some of you may have not but if you haven't already I'll put a link in the description so you can watch the full thing, all shot AK on the Sony A1s. I love looking at other people's final cut timelines. So here's mine. This is also running a beta version of final cut which is kind of exciting 'cause you might notice these little lines right here that is showing duplicate footage and final cut which is something that will be coming out out very soon. I'm just gonna drop in this multi cam timeline. And what I love about this is when you have one of these timelines you can actually see all of your angles over here. So we only have two angles and this is also kind of processor intensive, being able to play back two streams of 8K in Multicam and see them all at the same time. And why I love Multicam is I can just go one, two, one, two, one, two, one, two, one, two, one, two, one. Look at this, I mean, we are multi cam switching between these two 8K clips. I love it. Do you remember how many was it 18 or 16 streams of pro rec? 18, 18, the confirmation has been confirmed. 18 streams of 8K pro rec. (upbeat music) So I have the entire project done. It definitely took longer than I thought it should but this is all 8K footage and I have it all in this timeline right here so you can see everything is nicely lined up and I guess now we test it out. So this is all pro recs footage. Let's full screen this and see what happens. (upbeat music) This is also running off of that external raid drive as well, just for the record. (upbeat music) I can't believe this. Like, is this necessary? Do we need this? Maybe not, me personally, but I do feel like if you are doing really high end processor intensive projects with video, with 3D, if you're working with AK, if you're doing AR, VR, like this machine is you're too good for me. And I also like this display the fact that I don't need any other speakers, I don't need to plug anything else into what I have it built in Webcam, it's essentially everything that anyone would need to basically start an entire production. Like, this is it right here. (upbeat music) So as predominantly a final cut editor that has pretty much what I have been testing out on here nonstop. Now my friend Armando has been helping me shoot some videos recently and he's actually a premier editor. So I had him bring a premier project today so that we can get a chance to test that out. So Armando, let's see what you've got for us. - Hey guys, my name is Armando and I have a YouTube channel called Mondobytes. And sometimes I come here and help Justine shoot some videos and she actually asked me to come in and help her film some of the new Mac Studio and also Studio Display videos for her and at the same time, do a little test because I am an Adobe Premier Pro user. So typically whenever I get a brand new computer I test out Premier Pro running several projects that I've done in the past and I have a couple of benchmarks and this is one of my popular ones that I've actually done on multiple computers. For example, this project here on a Mac Pro will render it in 10 minutes and six seconds. Now this Mac Pro is upgraded and it'll run about $20,000. So what I wanna do is compare this to the Mac Pro and also my current PC. I'm a PC user and see how well it does. Now, I know this project will run really well because I do have a MacBook Pro M1 Max. When I run on my MacBook Pro and M1 Max it runs perfectly fine and I probably would expect it to do the same here. Very smooth playback. Now this particular project here is running Sony A7S3, Canon R5 and Canon C500, Mac 2 XABC. So these are very popular codex amongst creators and you know everything playback very smooth. We are using full playback, so none of this have playback order, everything full playback, very smooth, high quality, and I can't tell you this display is very beautiful, really digging it, but the question is, okay, we got this smooth playback, no complains there, and I will say Adobe and Apple have been doing really good optimizing this software to run really good on these M1 chip sets. So now what we're gonna do is see how fast this renders it. So I do have, like I just mentioned I have a MacBook Pro M1 max and this particular project finished in six minutes and 39 seconds so I'm very curious to see if this will cut it in half because essentially this is like having two processors kind of join together. So what I'm gonna do here is I'm gonna bring my stopwatch and then I'm gonna render this like I normally would for a YouTube video which I just go to export here and I just use the default YouTube preset which is just 2160 P. So I'm gonna go ahead and hit export and start and then here we go off to the races. It's begun. Now we're gonna see how fast this render time is. So I'm gonna have this little stopwatch here, I'm gonna leave it here. And right now I can tell you based on our current time and also the time that's estimated should essentially do it into under four minutes, which is crazy to think because apple stated that this isn't their Pro Machine. Wow, this is insane. Oh, my gosh. It's at minute 30, look at this is great. You're gonna make me spend some money here. My MacBook Pro did it in, which is already very fast. Now keep in mind, that's a laptop. This is more of a desktop, but I mean- - You're basically doubling the chip set. - Yes. - So it's like you're getting the M1 ultra, which is two M1 Maxs so in theory it should basically do it in half the time. - So far, we are currently at two minutes and 10 seconds and we already at 65%. - Oh, my God. - So this could even beat my current PC, which I love. This is crazy. - I'm nervous. I don't know why I'm nervous because it's already beat the time. - I think it will. Yeah, I think it'll definitely be under four minutes, which is very impressive. - Also you have, well I have Photoshop, Logic, and Final Cut open and, wait, music, I've got notes open. - Let's just show people this- - Oh, my God. - While it's rendering 'cause there's still time there, you have a Final Cut project that you're working on opened up. - [Justine] Yeah. - I'm gonna minimize this, there's Photoshop. So there's stuff happening in the background. We are at three minutes 30, about under 30 seconds left. - Oh my God. - So this could finish it in about three minutes and 30 seconds. Again, background projects still rendering and- - I'm sipping my tea. - Yeah, we're gonna go ahead and stop this very soon here. Oh, my gosh, it's even going faster. Yeah, there it goes five, four, three, two, one. Okay, and as soon is that thing clears which technically means it's done. Boom three minutes 31 seconds. - And you even swapped over to like Final Cut and brought that up too. - I did. - That's pretty impressive. Like the fact that that stuff is still open. - Bt the way this is an 11 minute 39 second project for those of you that think that Adobe Premier isn't optimized for Apple computers you're completely wrong. 11 minute 39 second project renders in three minutes 31 seconds and we're talking 4K. This is incredible. - I just love that you have... This is like your benchmark project. So this isn't something that you've just run once or twice. - No. - You've done this so many times and you have a ton of stats to back this up. This isn't even the pro. - Yeah. What is pro? This is probably- - Pro's gonna be one minute. - I can't even. I'm shocked, I'm shocked. - Thank you so much. If you're an Adobe Premier Pro user I will say you will have a blast editing because it is just buttery smooth and render times heart incredible. Good job, Apple you did an amazing job. - Well, thank you guys so much for watching. I had so much fun getting a chance to check out the new Mac Studio and the Studio Display. I will be posting some follow up videos. The one that I really wanna do is making an ultimate desk set up and as you can see, I've already started that process. So if you guys have anything else that you would like for me to test out, please leave it in the comments below. This Mac Studio so far has completely exceeded all of my expectations and I cannot wait to get editing on this video but you're already watching it so I've already edited and it's done. So with that, I'll see you guys in the next video. Make sure you guys subscribe and be sure to hit the bells so you'll be alerted when I post new videos and make sure you check out my TikTok, ijustine, Instagram, ijustine, Twitter, ijustine. Oh my goodness that's a lot. I'll see you somewhere else. Bye. - [Armando] And if you're watching this, don't forget the pigs - The pigs, that's true. They saw that yesterday. (upbeat music)",
    "transcript_keywords": [
        "Mac Studio",
        "pro display XDR",
        "Studio Display",
        "Studio",
        "pro display",
        "Mac",
        "Display",
        "pro",
        "Mac Pro",
        "display XDR",
        "Studio Display videos",
        "Max",
        "apple",
        "MacBook pro",
        "Adobe Premier Pro",
        "Mac Studio weighs",
        "beautiful Studio Display",
        "Studio Display speakers",
        "pro display XCRS",
        "Premier Pro"
    ],
    "transcript_entity_values": [
        "MacBook",
        "WebEx",
        "600",
        "one",
        "K pro rec",
        "six minutes and 39 seconds",
        "one minute",
        "32",
        "CPU",
        "65%",
        "Instagram",
        "16",
        "400 gigabytes",
        "about three minutes and 30 seconds",
        "Bluetooth",
        "Adobe",
        "FaceTime",
        "5",
        "Twitter",
        "three minutes 31 seconds",
        "18",
        "M1 Max MacBook I",
        "a day to day",
        "800 gigabytes",
        "Mondobytes",
        "five",
        "6",
        "Webcam",
        "six",
        "MacBooks",
        "seven",
        "15.99",
        "19.99",
        "3.5 millimeter",
        "HDMI",
        "first",
        "Pro Machine",
        "two days",
        "14 inch",
        "Armando",
        "1999",
        "iPad",
        "iPad Air",
        "the M1 iMac",
        "24",
        "USBA",
        "Two",
        "M1 Max MacBook",
        "30",
        "4",
        "USBC",
        "M1",
        "the M1 iMax",
        "YouTube",
        "CF express",
        "M1 Mac",
        "RAM",
        "Canon C500",
        "today",
        "16 terabyte",
        "This Mac Studio",
        "39 second",
        "M1 Maxs",
        "Multicam",
        "27 inch",
        "Ram",
        "120",
        "yesterday",
        "M1 max",
        "a minute",
        "Zoom",
        "1600",
        "second",
        "MacBook",
        "48",
        "M2",
        "this Mac Studio",
        "three minutes 30",
        "M1 Max",
        "Justine",
        "an additional $300",
        "My MacBook Pro",
        "32 inch",
        "Sony",
        "OWC",
        "Multicam",
        "20",
        "Mac Pro",
        "the Mac Studio",
        "three",
        "jack",
        "eight terabyte",
        "13 inch",
        "1.5 terabytes",
        "8",
        "Siri",
        "the Studio Display",
        "the M1 Apple Silicon",
        "the past of years",
        "Canon R5",
        "Mac Studio",
        "SD",
        "four minutes",
        "Studio Display",
        "128",
        "XABC",
        "two pounds",
        "10",
        "AK",
        "the Mac Pro",
        "XCRS",
        "Intel",
        "GPU",
        "7,000",
        "Thunderbolt",
        "the past couple of days",
        "K TV",
        "Apple",
        "Pionic Chip",
        "MacBook Pro M1 max",
        "XDR",
        "10 minutes and six seconds",
        "the Sony A1s",
        "MacBook Pro",
        "Boom three minutes 31 seconds",
        "two minutes and 10 seconds",
        "13",
        "11 minute",
        "under four minutes",
        "four",
        "18",
        "half",
        "about $20,000",
        "64",
        "two",
        "3999",
        "about under 30 seconds",
        "M1 iMac",
        "a few years ago",
        "Final Cut",
        "TikTok",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "DATE",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "ORG",
        "TIME",
        "PERSON",
        "GPE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "TIME",
        "PRODUCT",
        "PERSON",
        "MONEY",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "TIME",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL"
    ]
}