{
    "id": "ESgztPPPoiM",
    "title": "12 Speaker Headphones = MIND BLOWN",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-10-28T20:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=ESgztPPPoiM",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "headphones",
        "wireless haeadphones",
        "wireless",
        "bluetooth",
        "bluetooth headphones",
        "apple",
        "android",
        "surround",
        "surround headphones",
        "bluedio",
        "u plus",
        "bluedio u plus",
        "UFO",
        "bass",
        "bass headphones",
        "subwoofer",
        "best",
        "2016",
        "iphone 7",
        "iphone",
        "smartphone",
        "video",
        "samsung",
        "cool gadgets",
        "vs",
        "test",
        "inventions",
        "apple iphone",
        "galaxy",
        "cool",
        "s7",
        "phone",
        "plus",
        "futuristic",
        "invention",
        "innovation",
        "best headphones"
    ],
    "views": 2349569,
    "likes": 103586,
    "comments_count": 3393,
    "description": "Bluedio U Plus (UFO) (USA Link) -  Bluedio U Plus (UFO) (International) -   Had the chance to check out my first 12 speaker wireless headphones. This model from Bluedio also features enhanced bass. It's some of the most powerful bass I've ever heard on headphones.  From the manufacturer -  Innovation never stops.To provide the ultimate sound experience, our engineers have putted a lot of time and efforts into Bluedio U Plus and achieved new breakthrough.Our exclusive PPS12 technology, specially designed cavity and vents work in conjunction to provide vibrant bass and clear, vivid sound reproduction through the entire frequency range.  Bluedio advocates ultimate, fashion and simplicity, emphasizes music is most important spiritual enjoyment of mankind and provides professional audio and wireless communication solutions.Bluedio has been spread out to more than 150 countries, owned more than 30 patents.  With the constant pursuit for improvement, our engineers have spent three years to develop PPS12 technology.The combination of three drivers specially for trembles and another three drivers for mids and bass, makes sure that you will enjoy all range of frequency to the fullest extent.You can expect crisp, vivid highs from this headphone.  Cavity Design gives isolation from some ambient noises, enhances the bass response and pushes the airflow of both front and back cavity to achieve resonance.The cavities, along with specially designed vents, which adjust the ventilation, contribute to a full-bodied, vibrant and bouncy bass reproduction.  To protect your ears, Bluedio U Plus adopts over-ear earmuffs and stereo clipping craft. It not only brings you natural and comfortable wearing, but also reduce sound leakage.  The ear cups is designed to be rotated backward for 180 degrees, mainly considering the special requirements of DJ.It also works when you want to stay aware about what`s happening around you.  Built with premium materials, Al-Ti alloy. It owns sturdy, lightweight alloyed frames, yokes and sliders.So, the headphone will last for years.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2e5x6wC",
        "http://geni.us/CUbyA",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So you guys know I've covered a lot of different headphones here on Unbox Therapy. It might be the most popular product category in terms of like total uploads. Today though, we got something that's a little bit different from anything that's been featured previously - they got 12 drivers. Now if you aren't familiar with what a driver is, that's the actual speaker unit inside of your headphones. Now you can see they're not all the same size because each one is going to perform a different function. Maybe it'll be able to have better spatial awareness as far as where that sound is coming from. I'm thinking about during video games possibly while watching an action movie or something like that. But I was looking at the reviews for these online, and a lot of people were just saying they love them for music so I'm kind of curious about how those different functions are going to make the most out of six separate speaker units inside of each ear cup. These are wireless as well with Bluetooth range up to 32 ft, they say. My expectations are pretty high because they are inexpensive set of headphones. They're called the UFO Plus by the way. Ooh, so far unboxing experience's kind of nice. Got some magnets involved, you know. That's why I'm always looking for. On the side here, some paperwork, a nice carrying case for this, hard shell. Ooh, here are the headphones, they fold up. It's an over ear style. I like big ear cups, alright? I find it more comfortable, I find that it isolates better, for me. Ooh. They do spin up so if you want to get your DJ on. A port for the cable, I guess that just means you can pick whichever is more convenient for you. Controls appear to be over here on the right earcup that's an actual button there. If I had to guess probably volume up/down, next track, back play/pause, answer phone calls. A cool cable here, it's got a coiled portion to it so you can feel like a real DJ temporarily and then it also has a screw-on locking adapter. You've got the mini jack connector, screw that on though. That's if you want to interface with like a mixing board that uses the 1/4 inch adapter as opposed to the mini jack. Also in the box - a flat micro USB cable to charge those up. Ooh. Pull out my fancy new Pixel XL. Oh yes, enjoying it very much. Left ear cup, right ear cup. They're big! I'm pretty sure you're not going to win fashion points for these ones. \"What about the sound? They're headphones, Lewis. What we're here for.\" Alright. Whoa. [music playing] Whoa. Oh-ho-ho-ho-ho-ho. [music playing] That, did-- [clears throat] the-- That's the most low-end I have ever heard on any headphones ever. Brain-shattering base, it is THICK. When that bass kicks in, it's like BOOFF, it's like a subwoofer in there. It's gonna be a subjective thing but, my goodness. If you want base, these got it. I want to try some surround-sound style stuff. Surround.. sound test, yeah this would be good. Oh whoa. It's like a shotgun back here. It's over here. It's not like a test like this wouldn't be represented on a regular set of headphones. So for a surround sound test what you're looking for is that discrepancy between like sort of way back here. I can easily identify the location of that sound in this headset. I just noticed something else is cool here. You can actually connect this headset to two different mobile phones. Now the reason that's cool - you can have a couple of different audio sources feeding into it. Uhhm, there's a microphone, shall I do a phone call? Of course I'm gonna give Ryan a call. Yo, what's going on man? Well I'm just happy you finally picked up the phone, man. People here on Unbox Therapy, they miss you. They want to see more of you and more importantly, right now they want your feedback on how I sound. (RYAN) - Uhh, so I think it's about 9/10. Uhh, there's not much-- there's no distortion. (RYAN) - It's pretty clear, uhh and the volume is pretty good. I don't know on your end how loud it is. But I'd use it. (RYAN) - Whatever it is. (LEW) - Ryan, the people miss you. What do you have to say to them? (RYAN) - You took the only thing I had away from me. (RYAN) - I was the-- I thought I was the food guy. (RYAN) - Now.. now your boy off then you [uncomprehensible] (RYAN) - Maybe because, is it because I'm not available? Is that why? (LEW) - Name your price, how many likes do you need to come back? (RYAN) - Ah, geez. I don't want to put this on the people, you know... (LEW) - But it's gotta be on the people. (RYAN) - If you guys want me to come back, ya okay 50000 likes and I'll come back, there you go. (LEW) - THERE YOU GO, holy s*** I thought we're never going to hear it. Okay later Ryan, thank you. Why not pop these open and make sure there's actually six separate speaker units and what they look like. I popped this ear cup off. There you can see the unit itself. Okay. And then pop this out, and there you can see the biggest unit of all, on the back there. And you can see the separate wires going to the remaining speakers. These are the five smaller speaker units and then in the center here, that's the one that's on the back. They're not lying, six total speaker units in each ear cup. If you want to get energized, it's hard to find a version of energy as intense as that base though. You feel like you're getting kicked in the side of the skull by the thump. It's hard not to get motivated. You're a kid, there's a bully you're about to go after. Okay I don't recommend probably just tell your teachers or something right. No, DON'T TELL YOUR TEACHER, get some DMX, get these headphones and show that kid what's up!",
    "transcript_keywords": [
        "ear cup",
        "headphones",
        "back",
        "ear",
        "speaker units",
        "sound",
        "cup",
        "speaker",
        "Unbox Therapy",
        "people",
        "Ooh",
        "units",
        "covered a lot",
        "pretty",
        "separate speaker units",
        "unit",
        "Ryan",
        "phone",
        "Whoa",
        "cable"
    ],
    "transcript_entity_values": [
        "RYAN",
        "50000",
        "Yo",
        "Unbox Therapy",
        "12",
        "Ryan",
        "USB",
        "1/4 inch",
        "BOOFF",
        "Today",
        "32 ft",
        "two",
        "six",
        "five",
        "about 9/10",
        "Lewis",
        "Pixel XL",
        "LEW",
        "Uhhm"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON"
    ]
}