{
    "id": "eu6bfruyY8c",
    "title": "It’s expensive and I STILL want one! - Cooler Master Orb X",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-01-09T18:15:10Z",
    "video_url": "https://www.youtube.com/watch?v=eu6bfruyY8c",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "CES 2023",
        "cooler master",
        "office",
        "gaming",
        "wfh",
        "equipment",
        "pod",
        "focus",
        "cool",
        "immersive",
        "simulation",
        "sim"
    ],
    "views": 396625,
    "likes": 14596,
    "comments_count": 868,
    "description": "Get your overpriced stickers at   Cooler Master's new Orb X PC... case/desk/chair/whatever it is, wants to be either the ultimate gaming hub in your home or the zen workspace in your office. To see if this is actually worth the hefty price tag, Jake sat down to experience the egg pod lifestyle and now has some thoughts.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Finally. Egg PC 1:00 This is peak immersion 2:08 Built-in speaker impressions 3:09 Controls and seat adjustments 5:04 Sponsor - dbrand 5:56 Thoughts on the desk 7:23 Misc. features 7:48 Where does the PC go? 9:35 Overall thoughts 10:38 Outro",
    "description_links": [
        "http://shortlinus.com",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- It feels like every part of the average desk is stuck in its own universe with little thought put into how it all goes together. I mean, look, myself and many of you spend more time than we'd like to admit at a desk using a computer, yet the chair and desk with a monitor has been basically exactly the same for decades. That is, until I saw this and admittedly other similar products. The Cooler Master ORB X is a $15,000, 700 pound computer desk egg cockpit thing that's on a mission to perfect and enhance the computer user experience. And I kind of like it. The tagline for the ORB X is where luxury meets technology and on first glance I kind of think they nailed that. This thing looks like a captain's chair in a fricking spaceship and I mean that in a good way. Just look at all this addressable RGB. I got the remote here 'cause I'm ready, but right now this is in its closed form but with the push of a button, the motorized shuttle dome, as they're calling it, opens right up and we can get inside. As soon as you sit down and get the seat adjusted, more on that later, it feels very immersive but not like in a claustrophobic way. I mean it's tight but it's also very open air and kind of comfortable at the same time. You got a breeze going through, it feels pretty good and I don't feel like I'm trapped in this thing despite a large percentage of my field of view being occupied by both the top, the monitor, the desk, everything. I still feel like I could jump out if I had to. And as somebody with ADHD, the way that it does take up so much of your field of view and kind of prevents you from looking at what's behind you. In an office space or even at home when I was gaming, I feel like if I put noise canceling headphones on, I would get lost in this thing. In its current configuration here at CES 2023, they have a 34 inch high refresh rate Cooler Master ultra wide. But you can also configure it with three 27 inch monitors and surround if you want. And while they don't officially list it as supported, I talk to the people here and they said a 49 inch super ultra wide like the Samsung Odyssey can mount up to it. It's just maybe a little too close for that. At least when you have the discrete monitors, you can kind of put 'em at an angle. Above the monitors, you can see the stereo part of the 2.1 channel spatial audio setup they have in here. They're kind of up here angled to bounce off and kind of surround you in audio. It's not like technically true surround sound. There's also a sub underneath the seat. So the small drivers in here have a little bit of help giving you that extra oomph and bass and let's hear how they sound with everybody's favorite crab rave. (upbeat electronic music playing) It's truly the pinnacle of audio testing. Okay, don't get me wrong, it's not the pinnacle of audio listening experience. It's not the best speakers you can have on a PC, but the spatial effect really does make it feel like it belongs in this setup. They're definitely good enough. I'm not wanting more. Specifically with the speakers, there's three modes. There's a gaming mode, a theater mode which is like for movies and a music mode. Most of the sound difference I noticed between them is more to do with like how much bass there is. So you're probably just gonna pick one you like and stick to it. But maybe some people like choosing but there's also a lot of other buttons over here we should check out. In terms of audio control, there's an on and off button for the speakers. The mode selector for those three different modes I talked about earlier, a volume switch, and a toggle that switches between optical and Bluetooth audio. So if you had your phone and you wanted to connect it to this thing and have your computer connected with optical you can totally do that or even have your computer on Bluetooth if you're crazy and like latency. The last button other than the power button is a memory feature. So when you get your chair exactly how you like it, you hold the memory button. I didn't hold it long enough and now it's going back to the default. (Jake chuckles) Whatever you get the point. Just like in a car where you can save your seat's position, you can do it on this thing. I would like to see maybe the option to have like three saved modes, especially if they're pitching this as like a business device. You might have multiple people that use the desk and only being able to save one position seems a bit shortsighted. Speaking of the seat, there are a few things we can talk about there. The headrest is adjustable manually as well as the lumbar support down here, which goes again, up and down. In terms of the rest of the seat, the back moves forward and back with the fancy little remote here. Try that. Oh there we go. The seat slides forward and back. There we go. Pressing the wrong buttons, don't mind me. Wee. They did mention to me on this one they think the footrest is a little bit short, especially for tall people. I would concur, but they already are aware of that and are thinking about fixing it. And in terms of comfort, honestly aside from the footrest being a bit short, it's a pretty comfy chair. It's very firmly padded, but that's actually a good thing because people are gonna be sitting in something like this for a long time and you don't wanna be sitting in a chair and after an hour you start to feel the plywood under. I don't think that's gonna be a problem in this thing. I would maybe like to see adjustable armrests but it's hard to say how they would do that when you have a big desk that slides back and forth, might kind of get in the way. But realistically you're using this as a desk, your arms are gonna be up here anyways. - Our sponsor for CES 2023 actually dropped out but dbrand footed the bill. The only catch is they want me to come out onto the streets and offer tech tips to random people for free. I'm not optimistic for how this is gonna go. Is that an iPhone? - It is. It's an old one. - It's an old one? - Yeah. - [Interviewer] That's okay. Do you want a tech tip? - Give her. - Have you ever heard that when you get a new electronic product, you should let it drain completely before recharging it? - Yeah, I've heard that. - Well it's wrong. - Yeah, I figured. like my gimbal - Plug em' right in. - that I have. I plugged that right in when I got it new, it was about half charged. - Oh, nice. - Said not to do that and it's been working ever since, so. - Okay, can you do one more thing for me? - What do you need? - Go to www.shortlinus.com. - Short Linus? - You don't have to do it right now, but whatever. - Yeah, I'll give her. Yeah, no worries. - Nice. - Awesome. - We're just talking about the cup holder. Unfortunately a water bottle like this doesn't work just yet, but with a cup in there, look at that. Fits like a glove. Speaking of desk, let's talk about it, Now right off the bat, it's a great size. There's tons of room for peripherals and plenty of mousing real estate. Even enough that you can slide your keyboard all the way out of the way and kind of read a book or write something on paper. It's covered by a nice custom mouse pad that feels pretty good, but it is a specific size. So if you wanted to replace it a couple years down the road, you would need to source it from Cooler Master directly. They said they will have replacement parts available but your mileage may vary. You never know how long companies support things like this. It even has a wireless charger for your phone which when we're talking about trying to build an integrated device like this, is the perfect thing to include. Everybody has their phone on their desk. Why can't you just charge it in the desk? Now there is one little caveat I thought because the entire desk is on an adjustable arm that rests in a few different spots. You can see there's like a little ball bearing here. Now I thought initially that this movement was gonna be a problem but actually when you're using it, the pressure of your arms holds it in place and it does a pretty good job of that. So much so that I think honestly after using it for about 20 minutes, I kind of forgot that the desk moves, so I guess it's doing its job. I would say that part of me still wants some sort of locking mechanism. I don't know how they would do it. Maybe I'm not an engineer but I feel like there's gotta be a way. On the other side of the desk there is a few other things that are cool. Most notably, a reading light, which actually makes perfect sense if you're using your desk for you gotta sign a document or whatever, works perfect for that. There's also an integrated USB hub. One of the ports even does 60 watt USB power delivery which is actually plenty enough to charge a laptop which is what I imagine most people would use it for. And there's a headphone mic combo port. So if you wanna wear headphones instead of using the speakers, you can totally do that. Like I was, you might be wondering, \"Where's the bloody computer?\" It's not sitting right here, it's not behind it but it's actually stored inside the ORB X. Ah ha, here it is. Look at that, the lights, they got little contacts on there. That's so cool. Now despite the price tag, I mean it is an expensive thing. Think of it, it's kind of like luxury furniture. It doesn't come with a computer. You do have to provide your own or you can actually ask Cooler Master and they'll provide you a quote with one. This is their Q300L case. Fits in there pretty nicely. It's not the smallest compartment ever but it also isn't gonna fit a big case. So you kind of have to keep that in mind. The cables for the display are pre-run that that would be part of the delivery service. And there is as you'd guess from Cooler Master, there's cooling, there's three, it looks like 120 mil fans on the bottom here and they blow a lot of air. I actually, I didn't notice it when I was in the front. I didn't feel like, \"Oh it's this loud fan behind me.\" I didn't hear the computer but there's lots of cooling down here. There is also a vent at the top so some heat will come out of the top but most of it kind of is sucked out the bottom here. So you shouldn't really feel any heat. This system's equipped with a 4080 and a 13700K and I didn't feel any heat in the front. So I think that works pretty well. This is a great way to do this. A lot of solutions like this, they think, \"Oh you just throw the computer behind the thing. That's great.\" It's supposed to be an integrated solution. This is an integrated solution. Now there are some power restrictions because the power plugs in directly to the system down here along with the ethernet. You're only gonna be able to run 1200 watts on the computer and 750 watts on the monitor. Those are the two limitations that I saw on the website. I imagine there's probably some power used by the machine so that's kind of the limitation you're at there. But other than that, 1200 watts for a computer is lots. I'm gonna be honest, when I first saw this thing and some of the other similar style computer immersion things, I've always thought, \"Who would buy that thing? It's so huge, it's so much money.\" But now I kind of want one, like I want this in my house. This is like everything I want in a computer desk. And I didn't know I wanted it until I tried it, which is pretty cool. All of this might leave you with the question of why Cooler Master, the company known for PC hardware, cases, keyboards, and mice is venturing into a fairly boutique market of luxury furniture slash office equipment, I guess. Well it's part of a bigger move to turn Cooler Master into more of a tech lifestyle company and less of a PC hardware vendor. And it does also have me wondering, \"Who would shell out for something like this?\" I want it. It doesn't mean I would pay $15,000 for something like this. Well, I could definitely see employers who are trying to entice long-term work from home people back into the office. Or maybe it's just for a trust fund baby's gaming room. But regardless, I still want one. Can we have one? (Jake laughs) All right, if you like this video, you might also like the time we looked at a similar concept from Acer back at CES 2019. That was four years ago. And also the last time I was at CES.",
    "transcript_keywords": [
        "Cooler Master",
        "desk",
        "kind",
        "thing",
        "Cooler Master ORB",
        "computer",
        "feel",
        "Cooler",
        "Master",
        "people",
        "feels pretty good",
        "back",
        "pretty",
        "computer desk",
        "audio",
        "things",
        "Master ORB",
        "good",
        "seat",
        "feels"
    ],
    "transcript_entity_values": [
        "CES",
        "700 pound",
        "49 inch",
        "Cooler Master",
        "2023",
        "Jake",
        "three",
        "an hour",
        "One",
        "one",
        "USB",
        "decades",
        "three 27 inch",
        "iPhone",
        "2023",
        "2019",
        "1200 watts",
        "Cooler Master",
        "Acer",
        "Samsung",
        "60 watt",
        "first",
        "120 mil",
        "4080",
        "a couple years",
        "two",
        "Jake chuckles",
        "four years ago",
        "15,000",
        "about half",
        "about 20 minutes",
        "RGB",
        "Linus",
        "Cooler",
        "Cooler Master",
        "2.1",
        "750 watts",
        "13700",
        "34 inch"
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY"
    ]
}