{
    "id": "euUiIjXA-zc",
    "title": "I Drove 900 Miles In A Hydrogen Car: Hyundai NEXO Review",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2018-12-22T14:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=euUiIjXA-zc",
    "category": "Science & Technology",
    "tags": [
        "hyundai nexo review",
        "hyundai nexo vs mirai",
        "hydrogen car test drive",
        "hydrogen vs electric",
        "fuel cell vehicle",
        "best fcv 2018",
        "best fcv 2019",
        "best hydrogen car 2019",
        "hyundai hydrogen",
        "mrmobile",
        "jvtechtea",
        "joshua vergara",
        "michael fisher",
        "car tech"
    ],
    "views": 1157839,
    "likes": 23143,
    "comments_count": 2652,
    "description": "In some alternate reality, its not electric cars replacing gas-guzzlers on the nations highways, but hydrogen fuel cell vehicles. I recently got a glimpse of that alternate timeline, spending five days behind the wheel of Hyundais newest hydrogen car, the NEXO. My co-pilot: Joshua Vergara of JVTechTea. My mission? A 900-mile road trip from San Diego to Sacramento using nothing but hydrogen ... and leaving nothing but water behind. Spoiler alert: we accomplished our mission, but not exactly the way we'd planned. Join Joshua Vergara and MrMobile for the Hyundai NEXO Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S HYUNDAI NEXO REVIEW]  MrMobile's Hyundai NEXO Review was produced following five days in a Hyundai NEXO review vehicle provided by Hyundai Motors of America. The car was driven from San Diego to Sacramento with many intervening stops, for a trip length totaling approximately 900 miles. The vehicle was refueled four times during the test drive period.   Hyundai Motors of America covered travel and lodging costs during the NEXO review period, as well as a $300 gift card for hydrogen fuel. The entirety of that gift card was exhausted on hydrogen fuel for the NEXO during the drive period. No compensation or other consideration was requested or provided. Hyundai was not offered copy approval nor an advance screening of this video before publication.   [LINKS]  Hyundai NEXO Road Trip [JVTechTea]:   Hyundai NEXO [Official Site]:   \"Cars, Trucks, Buses and Air Pollution\" [UCS]:   \"So Just How Dangerous Is Hydrogen Fuel?\" [WSU]:   \"Can We Produce Enough Green Hydrogen To Save The World?\" [phys.org]:   Hydrogen Fuel Cell Vehicle Safety [FuelCellsWorks]:   Hydrogen Fuel Cell Vehicle Refueling Stations:    [MUSIC]  Renewable Energy by Aulx Atudio, available at Premium Beat:   As Science Progresses by Aulx Studio, available at Premium Beat:   Ultra Boost by Cymatix, available at Premium Beat:   True Persistence by Cymatix, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #hydrogencar #hyundainexo #nexo #fuelcellvehicle #fcv #electriccar #greenenergy #hydrogen",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://youtu.be/8cNhROauWrM",
        "https://www.hyundaiusa.com/nexo/index.aspx",
        "https://www.ucsusa.org/clean-vehicles/vehicles-air-pollution-and-human-health/cars-trucks-air-pollution#.XB2i089KjzJ",
        "https://hydrogen.wsu.edu/2017/03/17/so-just-how-dangerous-is-hydrogen-fuel/",
        "https://phys.org/news/2018-11-green-hydrogen-world.html#jCp",
        "https://fuelcellsworks.com/news/toyota-engineers-testing-limits-of-hydrogen-safety",
        "https://www.afdc.energy.gov/fuels/hydrogen_locations.html",
        "https://www.premiumbeat.com/royalty-free-tracks/renewable-energy",
        "https://www.premiumbeat.com/royalty-free-tracks/as-science-progresses",
        "https://www.premiumbeat.com/royalty-free-tracks/ultra-boost",
        "https://www.premiumbeat.com/royalty-free-tracks/true-persistence",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- In some alternate reality, it's not electric replacing gasoline on the nation's highways, but hydrogen. (bubbly music) I got a glimpse of that alternate timeline recently, as I spent five days behind the wheel of Hyundai's newest fuel cell vehicle. My co-pilot, Joshua Vergara of JV Tech Tea. My mission, a 900 mile road trip, from San Diego to Sacramento, using nothing but hydrogen. It's too cold to hold. I'm Mr. Mobile, and this is the Hyundai Nexo review. (happy music) Day one, after a quick drive up from San Diego, the trip officially kicks off at Hyundai's American headquarters in Los Angeles. I asked for a closer look at the Nexo, so Hyundai takes us under the hood, and then under the car for a crash course on how it all works. The disclosure, while I'm at it, Hyundai provided travel, lodging and some fuel reimbursement for Josh and me, but in accordance with my reviews policy, no compensation. Also, Hyundai did not receive copy approval or see this video before publication. Like I said in my video on the Toyota Mirai, my favorite fun fact about hydrogen cars is that technically they're also electric cars. The propulsion in the Nexo comes from an electric motor, driving the front wheels, drawing power from a battery. The difference is that instead of carrying around a huge 70 to 100 kilowatt hour power pack, like a Tesla, the Nexo settles for a small 1.5 kilowatt hour battery. It can get away with that, because the Nexo produces its own electricity. It does this by sucking air from the atmosphere, there's an intake behind the grill up front, separating the oxygen from that air, and compressing and injecting it into something called a fuel cell stack. There, it's combined with hydrogen in a chemical reaction that keeps the battery charged. The assembly is just as quiet as a typical electric car, so the Nexo has a noise maker to warn pedestrians of its presence. Kinda sounds like a friendly UFO. Back on the road with Josh, passing the oil pump jacks and ocean liner smoke stacks of Long Beach, let's talk about just how green the hydrogen car is. Just taken here on the street, the Nexo is much cleaner than your average gas burner. Which leaves behind a bunch of stuff that's either not healthy for you, or not healthy for the planet, or both. The Nexo's only exhaust is hot water, which tinkles out through twin tailpipes. In fact, the car actually leaves the air cleaner than it found it, thanks to the filtration necessary to feed oxygen to the fuel cell. But it's not 100% emissions free, because of how the hydrogen fuel is produced. More on that in a bit. (soft electronic music) Settling in, and driving toward our first fueling stop in Santa Barbara, I realize no one's really taking notice of us, the way they do when I drive something more highfalutin, like a Tesla, and that's because the Nexo keeps a low profile. Only its distinctive copper metallic paint job, and cascade grille setting it apart. And despite its unusual power plant, living with it for five days will come to make it feel like driving any well made SUV. The cargo space is ample. The cabin, spacious. I'm a sun starved, winter wimp this time of year, so I really appreciated the retractable sunroof. And both Josh and I liked that we could use Android Auto, instead of the built in NAV system. Navigate to Nava Coffee Post. (laughing) Let's wake up everybody. - [Navigation System] Sharing results for Napa Coffee. - [Michael] Oh well, huh, good enough, alright I'll take it. And this was my first exposure to ventilated seats. I'll let Josh speak to how those feel. - Well this is like walking in like snowy New York. It'd be like gotta sit down. - Yes, (laughing) but you're in a snowsuit, so the moisture doesn't come through, but you're sitting on cold snow. - Yeah, that's it. - That's exactly what it is, you're right. The Nexo was rated for 380 miles on a full load of hydrogen, but that's only for the Blue trim level. And because we're driving the heavier, Limited model, we can only expect about 350 miles, so that's why we decided to fill up in Santa Barbara, and this is where hydrogen cars have the biggest edge over battery electrics. See, even on a super charger, a Tesla needs 20 to 30 minutes to carry you another 150 to 200 miles. The Nexo can fill up its three hydrogen tanks in about five minutes. I'll take us back to the lift real quick, and you can actually see one of 'em peeking out from the under carriage here. Each of these tanks stores just under 14 gallons of hydrogen gas, at 10,000 psi. That's a lot of pressure, and listening to the spooky sounds of the fueling system, I'd be lying if I said I didn't think about all that potential energy, sitting under my back seat. It is disconcerting to be near this much pressure. So why did I drive the thing almost 1000 miles anyway? Well, the Nexo's hydrogen tanks are made from carbon fiber that the company says is about two inches thick. They've been crash tested, burn tested. When Toyota tested its tanks, it had to shoot one with a rifle to penetrate it. And if there is a rupture, the Nexo's computer system is designed to immediately seal off the fuel lines. Look, I'm not trying to say hydrogen isn't dangerous, it's very easy to ignite, and as this article says, any fuel is dangerous if mishandled. But I am saying is that I'm convinced Hyundai respects that risk, and handles hydrogen properly. I'll link to that article in the description. Please subscribe while you're there, if you're enjoying this video so far. (electronic music) Heading north from Santa Barbara, we try and stick close to the coast, resisting the urge to have a merlot at the Hitching Post, - I am not drinking any (beep) merlot. - [Michael] And detouring through the Denmark inspired streets of Solvang. And it's here that we realize our minor miscalculation. See, north of here the fuel stations thin out. There are only, after all, 36 of them across California. So Josh and I have to recalculate. We have to backtrack by a half an hour to top off our fuel, laying in a new inland course for San Jose. And we do make it there, with about 30 miles left in the tanks, but we couldn't take the route we wanted to, and those last few miles, I was getting a little nervous. After all, you can't just call AAA and ask for a gas can when your hydrogen runs out. The bright side, more fueling stations are planned for 2019, and that the Nexo is delivering on its range promises, and accurately forecasting between fill ups. The hills of our next stops, San Francisco and Sausalito, help us get even more mileage, because we can use regenerative braking to convert some of our downhill inertia to electricity. Which goes back into the battery. It's not as pronounced as on a Tesla, or Chevy Volt, you can't one pedal drive, but it helps us pad out our range estimates, and save on fuel costs. More on that later too. The weather takes a turn for the worse on the northbound drive though, so we're forced to cancel our planned excursion to Lake Tahoe. Instead we swing through Sacramento, and camp out at a coffee shop, where Josh takes some moody, vloggy video. Re-caffeinated, and re-energized by a trip to Atlas Obscura, Josh and I plot a course for a nerdy point of interest, and since that takes us back inside the cabin for awhile, I can tell you something else. The Nexo is a completely comfortable ride. These seats still feel great, even after days, and there's plenty of room to spread out. Three can fit in the back, and there's a proper outlet for laptops or other gear too power hungry for the USB ports up front. And I'm happy to report that those do kick out more current than most cars. Also up front, a Qi wireless charging pad, compatible with most modern phones. And above it, more buttons than an airliner cockpit. I'm torn on these, I love buttons in a car because there's nothing less tactile than a touch screen while you're driving, but there are just so many keys on this thing. And with the exception of the big selector knob, they're all too smooth to feel out while keeping your eyes on the road. A much better feature is this blind spot monitor that kicks on when you signal a lane change. No more craning your neck to check over your shoulder. You just flit your eyes down to the cluster. Also, the collision avoidance system will warn you if you're about to back out of a parking spot into oncoming traffic. That is cool. And I love the bird's eye view camera, when squeezing into a tight parking space. And there is an automated parking system too, but we never ran into a parking situation we couldn't handle ourselves. When talking about handling, the Nexo is predictable at every turn. From the zero to 60 in 10 seconds, to the responsive but not overly tight steering, there are no surprises here. It's not built to be fun to drive. It's built for comfort, cargo capacity, and its particular breed of fuel economy. And it achieves all of those, while maintaining a pretty quiet cabin to boot. Oh by the way, we're finally at the site Josh and I detoured to see, and if you used a windows computer from the years 2001 to hmm, 2012 or so, this might look familiar. (Computer chiming) (soft techno music) On the last night of our trip, Josh and I take the Nexo through Napa, where the restaurants have animal heads, and the coffee shops have cellists. (cello music) this is also around the time of our final fill up on our own dime this time, because we've finally blown through all of our Hyundai hydrogen bucks. You've probably noticed how quickly the pump gages shot up on our refills. Each time we took out a load of fuel, it cost north of 80 bucks. And in addition to the expense, the way that hydrogen is produced effects how green you can pat yourself on the back for being. While it is possible to make hydrogen by splitting water with electricity, right now, 96% of the world's hydrogen fuel is made my reforming methane, and that produces CO2 as a waste product. As we button up the car after 900 hydrogen fueled miles, it's time to talk pricing. The Nexo is priced between $58,000 and $63,000, depending on trim. While lease terms weren't finalized at press time, Hyundai tells us some free fuel will be included. I had a fantastic week in the Nexo. It's incredibly comfortable, it's got a ton of features that make driving it a pleasure, and it's much more spacious than the Toyota Mirai, which costs about the same. If I were buying a hydrogen fuel cell vehicle, which assumes I'd be moving to California, since that's the only state you can use one, the Nexo is absolutely the one I would go with. But I don't think I'd be buying a hydrogen car. Yes, you can refill one of these much faster than you can charge an electric one, but you can drive a battery electric car in all 50 states. You can also start every day in an electric car with a full battery, since you can charge it at home. And you can find places to fill it up a lot more easily than you can a hydrogen car. And that's a reality that I think is gonna persist into the foreseeable future. The Hyundai Nexo is the best fuel cell vehicle I've driven. But hydrogen has a long way to go to convince me that it's the future of driving. Thanks for coming with us on this ride folks, and don't forget Josh Vergara has his own take on our five day hydrogen journey. Check it out right here, subscribe to his channel over there, and until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Nexo",
        "hydrogen",
        "Hyundai Nexo",
        "Hyundai Nexo review",
        "Hyundai",
        "fuel",
        "Josh",
        "Nexo hydrogen tanks",
        "electric replacing gasoline",
        "hydrogen fuel",
        "hydrogen car",
        "fuel cell",
        "car",
        "Hyundai newest fuel",
        "Nexo hydrogen",
        "Hyundai hydrogen bucks",
        "Hyundai hydrogen",
        "electric car",
        "hydrogen fuel cell",
        "electric"
    ],
    "transcript_entity_values": [
        "Tesla",
        "Android Auto",
        "96%",
        "five days",
        "California",
        "10 seconds",
        "70 to 100 kilowatt hour",
        "another 150 to 200 miles",
        "Atlas Obscura",
        "Michael",
        "Napa",
        "days",
        "900",
        "Limited",
        "the years 2001",
        "zero",
        "NAV",
        "every day",
        "almost 1000 miles",
        "one",
        "Sacramento",
        "10,000 psi",
        "a fantastic week",
        "Long Beach",
        "AAA",
        "San Francisco",
        "Josh Vergara",
        "900 mile",
        "about 350 miles",
        "about two inches",
        "Napa Coffee",
        "between $58,000 and $63,000",
        "2019",
        "Nava Coffee Post",
        "a small",
        "Chevy Volt",
        "Santa Barbara",
        "Mirai",
        "the last night",
        "JV Tech Tea",
        "Mirai",
        "winter",
        "50",
        "36",
        "1.5 kilowatt hour",
        "Denmark",
        "2012",
        "Lake Tahoe",
        "our five day",
        "Solvang",
        "three",
        "a ton",
        "about 30 miles",
        "Josh",
        "a half an hour",
        "about five minutes",
        "Los Angeles",
        "American",
        "Nexo",
        "60",
        "Toyota",
        "USB",
        "Mobile",
        "San Diego",
        "Three",
        "first",
        "Joshua Vergara",
        "20 to 30 minutes",
        "Nexo",
        "CO2",
        "14 gallons",
        "100%",
        "Sausalito",
        "San Jose",
        "the Hitching Post",
        "380 miles",
        "80 bucks",
        "New York",
        "Hyundai"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "GPE",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "DATE",
        "LOC",
        "DATE",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "TIME",
        "TIME",
        "GPE",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "TIME",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "PERCENT",
        "GPE",
        "GPE",
        "ORG",
        "QUANTITY",
        "MONEY",
        "GPE",
        "ORG"
    ]
}