{
    "id": "evUnemODZBs",
    "title": "Tearing Down the Backlit Taobao Game Boy Color!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2018-01-23T16:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=evUnemODZBs",
    "category": "Science & Technology",
    "tags": [
        "Nintendo",
        "Game Boy Color",
        "backlit",
        "Taobao",
        "backlight",
        "Game Boy",
        "video games",
        "retro gaming",
        "handheld",
        "8-bit",
        "console",
        "game console",
        "teardown",
        "DIY",
        "screen",
        "LCD",
        "video",
        "IPS",
        "display",
        "CPLD",
        "FPGA",
        "This Does Not Compute"
    ],
    "views": 88710,
    "likes": 2822,
    "comments_count": 317,
    "description": "A custom backlit Game Boy Color was sold on Taobao in early 2017. Its screen looked amazing, but only a few were made. I managed to get my hands on one -- let's see what's inside!  -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Lakey Inspired ( and Epidemic Sound ( Intro music by BoxCat Games (",
    "description_links": [
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://www.soundcloud.com/lakeyinspired)",
        "http://www.epidemicsound.com).",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? I got one. Let's do this. [ Music - Intro ] Okay, the story so far: In February 2017, a custom backlit Game Boy Color showed up for sale on Chinese shopping site Taobao. The news spread and it quickly sold out. After a couple of months of waiting, all the the backorders were canceled, with only a few consoles having actually shipped. By May of that year, the listing reappeared, but again, not many orders were fulfilled. In all, it's believed that fewer than 75 consoles were made, with a small number ending up on eBay, and selling for high prices. These consoles were highly sought after because of the quality of the replacement screen. A bright, vivid IPS panel that uses pixel doubling to produce a really sharp image. It makes for a fantastic experience in an otherwise stock Game Boy Color. So when one showed up in my mailbox, I knew what needed to be done. The console comes apart like any normal Game Boy. Removing the rear housing revealed an unmodified original circuit board. But the display connector at the top caught my eye. Instead of a full 50-pin ribbon cable, a narrower 40-pin one is used instead. I carefully disconnected it, then unscrewed the board from the front housing. Underneath the board, I found a bit of a wiring mess. Really thin magnet wire connects the screen to the battery terminals as well as the Select, Up, and Down buttons. I had an idea what these were for, but we'll come back to that in a bit. The screen assembly simply lifted out, and when I flipped it over, I was surprised. It's a lot bigger than I anticipated, about three inches in diagonal. It's much taller than the screen cutout in the housing, with almost half of the display area above and below the image going unused. Since we know it's pixel doubled from the console's original 160x144 resolution, it seems like this screen is 320x480, which is fairly common for displays of this size and often seen in mobile devices. It took me a while to peel the foam off the backside of the screen to get a look at the circuitry. Unfortunately, there were *no* part numbers to be found anywhere on it. I looked between the LCD and the circuit board too. Nothing there, either. What's more, even the markings on the chips were removed. This is almost always done by those trying to prevent reverse-engineering. But it definitely looks like this chip has something to do with processing the video signal. In order to make the screen fit, the front housing has been milled down to make it thinner, though not a dramatic amount. A small piece of plastic is used as a shim to keep the display centered. I found that part of the D-pad area had to be trimmed to accommodate the screen's PCB, and a little bit was also removed from the top of the shell, as the ribbon cable doesn't bend sharply enough. It's actually this connector that keeps the top of the shell from closing completely. At this point, and with no part numbers to research, there was nothing left to do but button it back up. I applied some Kapton tape to the back of the PCB to replace the foam I removed, then taped the wires down to keep them out of the way of the button contacts. Then, it was reassembly as usual. Oh, and as for those extra wires. As I suspected, they're for controlling the brightness. Just hold down Select and use the D-pad. Overall, this teardown was pretty interesting. I wasn't expecting a larger LCD. I figured someone had simply found a 320x288 pixel display in the right size. I had suspected that some sort of video signal translation was going on, and that's certainly the case here. But the lack of part numbers on any of it really piqued my curiosity. So I reached out to a contact who's communicated with the maker of these modded consoles. The guy behind those eBay auctions who had managed to get a small number of 'em. He tells me the screen is indeed out of a smartphone, one from the mid 2000s, but only the original seller knows exactly which one. The reason only so many of these consoles were made is because supplies of that screen are scarce, and a suitable replacement hasn't been found. But the biggest revelation is that the PCB was custom-made, and the chip on it programmed specifically for this mod. That's how it's able to only use a portion of the display with the image perfectly positioned. But as surprised as I was by this console, I'm also left a bit disappointed. I think a lot of us were hoping for some kind of lucky part that just happens to work, that anyone could simply drop into their own console. The reality is... It's a lot more complicated than that. After all the hype and anticipation, learning that it's just an oversized LCD with a converter board that its creator went to lengths to keep people from figuring out how it works... ...well... ...it makes this console seem not quite so amazing. Especially since I'm stricken by how similar this console is fundamentally to the BennVenn 101 mod. That one also uses a chip to translate the video signals, but to a more common AGS-101 display. Yeah, it takes a lot of work to install, but you can still buy it. Ultimately, the Taobao Game Boy Color is a fascinating piece of handheld gaming history, not just because of its technical accomplishment, but also for the mystery that still remains. Just what device did the screen come out of? What specific chip is used on that PCB? And who exactly is the person behind this mod anyway? Perhaps we'll find out someday. I owe a huge thank you to a viewer who goes by Pokmon Professor for generously donating this console to the show. I wouldn't have been able to do this teardown otherwise, especially since both of my original orders got canceled, just like the rest. If you like the video, I'd appreciate a thumbs-up and be sure to subscribe. You can follow me on Twitter and Instagram at thisdoesnotcomp, and as always, thanks for watching.",
    "transcript_keywords": [
        "Game Boy Color",
        "Game Boy",
        "Boy Color",
        "screen",
        "Taobao Game Boy",
        "console",
        "Boy Color showed",
        "backlit Game Boy",
        "Boy",
        "consoles",
        "Game",
        "display",
        "Colin",
        "stock Game Boy",
        "normal Game Boy",
        "PCB",
        "board",
        "part numbers",
        "part",
        "found"
    ],
    "transcript_entity_values": [
        "Game Boy Color",
        "a couple of months",
        "eBay",
        "Chinese",
        "IPS",
        "Pokmon",
        "Instagram",
        "February 2017",
        "50",
        "101",
        "May of that year",
        "Taobao",
        "320x288",
        "PCB",
        "LCD",
        "the mid 2000s",
        "about three inches",
        "40",
        "160x144",
        "one",
        "Game Boy",
        "almost half",
        "Kapton",
        "AGS-101",
        "Colin",
        "Twitter",
        "Taobao",
        "Game Boy Color",
        "fewer than 75"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL"
    ]
}