{
    "id": "EWkDZ51yrUg",
    "title": "How Disney will force Netflix to change streaming",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-22T14:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=EWkDZ51yrUg",
    "category": "Science & Technology",
    "tags": [
        "disney",
        "streaming",
        "netflix",
        "video streaming",
        "streaming service",
        "pixar",
        "video",
        "movies",
        "tv shows",
        "tv",
        "marvel",
        "hulu",
        "amazon video",
        "amazon prime video",
        "shudder",
        "filmstruck",
        "irl streaming",
        "walt disney",
        "full movies",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "new tech",
        "future tech",
        "latest updates",
        "mkbhd",
        "android",
        "russell brandom",
        "verge",
        "the verge"
    ],
    "views": 1343136,
    "likes": 29290,
    "comments_count": 4373,
    "description": "By late 2019, Disney has promised to launch its own online streaming service, further complicating the options for viewers who just want to watch their favorite films and TV online. The competition between streaming services has been great for consumers, so far. Outlets like Netflix, Hulu, Amazon Prime Video, Shudder, and Filmstruck have been ramping up content and giving us a lot for very little money, but they have the power to take it away too (password lockdowns, pull content). As corporate consolidation heats up, that deal may get a lot worse -- and fast.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Right now, we're living in a golden age of streaming services. For $15 a month, one service can give you access to basically endless movies and shows, with new offerings coming in every week. But enjoy it while it lasts, because wheels are already in motion to make those services more profitable for companies, and worse for you. Someday soon, to get the same amount of content you're getting now, you're gonna have to pay for more streaming services. (introspective music) So think about all the content on a service like Netflix, and where all of it comes from. A lot of what you see is made by Netflix, but most of it's not, whether it's network TV shows, old movies, or movies that were just in theaters. A study last year found that licensed content makes up 80% of what people actually watch. Netflix pays to license that content from the studios, and it's a big part of their business. Access to the streaming market is important for studios, too, because streaming media is where the viewers are. Netflix added 30 million US subscribers in the past five years, and that's coming at a time when traditional cable and broadcast TVs have less viewers every year. But licensing to Netflix, Hulu, and the other services isn't the only way for studios to get their movies online. Next year, Disney plans to launch its own streaming service, a direct competitor to Netflix. Disney's a little late to the party, but the service will have so much popular content that it may not matter. Remember, Disney owns Pixar, Marvel, Star Wars, and 21st Century Fox, along with more than 90 years of beloved movies and TV. The bad news is, if it's on Disney's new service, it doesn't really make sense to put it on Netflix, too. Once Disney's current licensing deals expire, Coco, Guardians of the Galaxy, and Last Jedi are all probably gonna disappear from the other streaming services. It's a simple business move. Why would Disney put Last Jedi on Netflix when it can put it on Disneyflix and make you pay another $15 a month for it? Even if Netflix offered to pay more money in licensing, Disney would rather have you watch their movies on their service. Disney is actually really good at making money when distribution methods change. If you look at the history of the company, they've done it over and over again. When VHS and DVDs became popular, Disney pioneered a system called the Disney Vault, where movies would be locked away for years, and only made available for lucrative, limited-run sales. - [Narrator] All these magical Disney videos before they disappear. - Whether you love or hate the vault, it worked. A study in the year 2000 found that 55% of Disney fans replaced their VHS tapes with DVDs, compared to only 14% for other studios. Cable expanded the playing field even more. Initially, Disney licensed its content to HBO, but soon they realized that the real money was in running their own channel. So the Disney channel was born. Last year, Disney made 40% of its money from cable channels, including the ABC networks and ESPN. And as cord-cutters move away from cable, towards services like Netflix, Disney's trying to pull off the same trick with streaming video, using its massive content library to build a whole new service from the ground up. Now, Disney's not the only studio trying to do that. Comcast has its Xfinity streaming service, Time Warner has HBO Go. The only way to see the latest Star Trek series is by paying six dollars a month for CBS All Access. Everybody's vertically integrating, which means there'll be less and less third-party content available to license. If you wanna follow all the movies and shows, you'll have to pay for all the services, and there'll be more and more of them to pay for. If you've noticed a lot more Netflix Originals lately, that's why. If you can't find Star Wars or Iron Man on Netflix, executives are betting you'll stick around for Stranger Things and BoJack Horseman, just like you stuck with HBO for Game of Thrones. So if you follow a bunch of streaming services now, you might soften the blow by borrowing the password from your parents or friends, but that could be in danger, too. Streaming services can shut down account sharing anytime they want. Just look at Spotify, where sharing accounts is nearly impossible. Netflix is slowly cracking down on account sharing, too, adding distinct profiles, and stopping any profile that streams multiple shows at once. As the industry matures, those rules are gonna tighten, and it's gonna get harder and harder to dip into a service without paying for it. Now, for corporations, this is about the money. Disney paid four billion dollars for Star Wars, and they wanna make that money back as fast as they can. But all that leaves the general interest fan in a tough place. Do you stick with a single streaming service, and miss out on the next wave of Marvel movies? Is the new Star Trek really worth six dollars a month? We don't know what the future of streaming will look like, yet. The transition away from licensing could be jarring, or it could happen slowly, over years. Competition between the new services could inspire a new golden age of TV shows, or everyone could fall back on old tricks and familiar franchises, but whatever happens, the pipeline between the camera and your screen is gonna get a lot more controlled, and if you want the same amount of content you've been used to, you're gonna have to pay more. Thanks for watching, I hope you liked it. If you want more free video content, check us out at theverge.com, and like and subscribe to youtube.com/theverge.",
    "transcript_keywords": [
        "Disney",
        "Netflix",
        "streaming",
        "services",
        "service",
        "streaming services",
        "content",
        "movies",
        "Star Wars",
        "Star",
        "pay",
        "Star Trek",
        "money",
        "year",
        "years",
        "shows",
        "Netflix pays",
        "studios",
        "Xfinity streaming service",
        "Wars"
    ],
    "transcript_entity_values": [
        "HBO",
        "last year",
        "BoJack Horseman",
        "one",
        "ESPN",
        "third",
        "Fox",
        "the year 2000",
        "Comcast",
        "HBO Go",
        "only 14%",
        "more than 90 years",
        "15",
        "Netflix Originals",
        "55%",
        "Spotify",
        "Disney",
        "CBS",
        "US",
        "Marvel",
        "Star Trek",
        "six dollars",
        "VHS",
        "Last Jedi",
        "Hulu",
        "years",
        "ABC",
        "every week",
        "Disneyflix",
        "Pixar",
        "Xfinity",
        "Galaxy",
        "four billion dollars",
        "Last year",
        "40%",
        "Time Warner",
        "another $15",
        "21st Century",
        "Next year",
        "Coco",
        "the past five years",
        "Netflix",
        "80%",
        "30 million",
        "the Disney Vault"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "DATE",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "PERCENT",
        "ORG",
        "MONEY",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "FAC"
    ]
}