{
    "id": "Ewo8tt6bgZU",
    "title": "I THOUGHT I Wanted This - AW2524H 500Hz Review",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-03-22T16:59:25Z",
    "video_url": "https://www.youtube.com/watch?v=Ewo8tt6bgZU",
    "category": "Science & Technology",
    "tags": [
        "Alienware",
        "AW2524H",
        "500Hz",
        "High Refresh Rate",
        "IPS",
        "Monitor",
        "Display",
        "Gaming",
        "FPS",
        "CSGO",
        "Valorant",
        "Dell",
        "OLED",
        "TN",
        "Zowie"
    ],
    "views": 2983557,
    "likes": 83284,
    "comments_count": 5496,
    "description": "FlexiSpots Global Spring Sale is on now until March 26th. Head on to the links below and save up to 40% on their E7 desks: US:  UK:   Create your build at   Have monitors finally jumped the shark? The AW2524H from Alienware refreshes at an eye-watering 500Hz on a colorful IPS panel, but it's a 1080p 24.5\" display that comes with a HEFTY price tag. Is it any good?  Discuss on the forum:   Buy an Alienware 24.5 500HZ AW2524Hz Gaming Monitor:   Buy a LG 27 Ultragear 240Hz OLED QHD 27GR95QE-B Gaming Monitor:   Buy a BenQ 24.5 360Hz XL2566K Gaming Monitor:   Buy a Viotek 27 240Hz GFT27CXB2 Gaming Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:38 It's Pretty Good 2:30 Looking At It 3:30 CS:GO 4:30 Halo 6:55 240Hz OLED 8:20 Refresh Rate vs MPRT 11:30 360Hz vs 500Hz 12:55 BFI 15:00 Testing and IO 17:15 Conclusion 19:26 Outro",
    "description_links": [
        "https://bit.ly/3yXqSI5",
        "https://bit.ly/3mHekkX",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1495792-hard-truth-about-the-%E2%80%9Cfastest%E2%80%9D-gaming-monitor/",
        "https://geni.us/VRVW",
        "https://geni.us/wGbroU",
        "https://geni.us/bEWWMrm",
        "https://geni.us/Ng2n",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- 500 hertz, is this real? When it comes to competition, or even just the satisfaction of crushing bots, we've demonstrated beyond reasonable doubt that more is better when it comes to monitor refresh rates, and we've got more than ever. The AW2524 from Alienware is the first 500 hertz monitor to hit our lab and it is absolutely incredible. Sit up straight gamers 'cause it's ergonomic, color accurate, and boasts-- - [Narrator] Speed that's at the edge of human visual perception. - Finally, I can go from 2.78 milliseconds of latency to only , I'll be unstoppable. No one will see me coming with 0.78 milliseconds of time eliminated from my leg chain. At last, I've reached my final form, except for one small problem. We have also demonstrated beyond reasonable doubt that while 360 hertz is technically better than 240 hertz the difference is kind of like going from a super car to an even more super car. And making matters worse, ultra-high refresh rate monitors like this one are expensive. Do you even need one of these when there are less costly contenders that might actually even deliver a better gaming experience? Do you even need this message from our sponsor? - Build Redux, take the hassle out of building your own gaming PC with simple to navigate customization options and competitive pricing compared to building a PC yourself. Build Redux will help you dominate your favorite games with the perfect PC for you. Check them out in the link below. - I wanna make this clear, pun intended. The AW2524H is amazing. It's 24 and a half inches, 1080P so the eSport special, but it's IPS with accurate coverage of 99% of the SRGB color gamut, boasts 0.5 milliseconds greater gray pixel response times and has an NVIDIA G-SYNC module on top of, yes, you heard me right, a 500 freaking hertz panel. I cannot believe the lab wouldn't let me play with this ahead of time. - [Brandon] We are testing it. - This is smooth frog, like the UFO test on Blur Busters, it's a great way of evaluating the motion performance of a monitor or a television. But unlike the UFO test, it runs locally on the machine. Meaning that we can run this thing at 500 frames per second, which is exactly where we land after the recommended 20 hertz factory overclock. It's actually 480 hertz outta the box. I never thought I would live to see an IPS panel that performs like this. I'm definitely seeing a little bit of blur along the back of my white frog here. But looking at these numbers, I honestly I'm kind of blown away. I've reviewed the script for this already so I know that overall we're not hyper bullish on this display but I guess I'm gonna have to see the competition 'cause this looks really good to me. Even more remarkable is that there's no compromise with respect to vibrancy or viewing angles. I mean it's IPS, it looks fantastic. I don't know what to tell you man. I am damn impressed by this. I haven't even moved a mouse yet. - Oh, oh, wow. (chuckles) - Hold on one second-- - [Plouffe] Oh, no. - One second. - Oh, no. Oh my God. - [Andrew] Great, good stuff. - [Plouffe] Okay, sure. - Oh yeah. Look, if you're spending money on your chair when you don't already have the best computer, you're doing it wrong. - [Andrew] Until you lean back and turn it off. - But feel free to spend money on lttstore.com, okay? FPS is max 1000 like I don't know. Hey, there we go boys. Woo, 600 FPS let's go. This game is running at up to 900 frames per second. This feels like looking through a window into the real world, it's so smooth. Look at that clarity as I'm panning around though. You know, normally, particularly on things like these power lines, I usually look to darks or high contrast objects against the skyline. You'll see that blur or ghosting, but man that is clear. You can read the text Graham here. You see Bob Graham there, like what? Hold on, hold on, let's get right in here. (chuckles) - What? Even if we can't run at the same FPS, I wanna play something that has a bit of a longer time to kill because that's what we found where the biggest benefit of high refresh rate and high FPS for that matter comes in when you are tracking a moving target that is changing direction. It's not just about the smoothness of the animation and the clarity, though those things don't hurt. Something to note is you do need to use display port in order to hit that 500 hertz. Even though it's 1080P, that's still a fricking lot of bandwidth and the HDMI port on this thing is only HDMI 2.0 so you're gonna be locked at 240 hertz if you stick with HDMI. I mean, realistically, you're not spending this kind of money on a monitor and then not hooking up a display port cable to a top tier graphics card like it. That would be gross misallocation of funds. But just making sure you know. Why do I have a bazooka? What game mode is this? - [Andrew] Probably like Fiesta or something. - What the hell is Fiesta? - [Andrew] Fiesta's where you get random weapons. You're playing on medium, how many frames are you getting? - I don't know. - [Brandon] Sorry. Getting like 350 FPS. No. Okay, hold on a second. No, I need to leave this game and just play a different one because the whole point of this was I wanted to get in gunfights with people. - [Brandon I get it. - Brandon, our expert tells us that while it is definitely not as much of a benefit as outputting a higher, this is the same stupid thing. Why is this? Oh shoot, I just sat on the power button. - [Andrew] I knew it. - Oh my god. - [Andrew] ] told you. - Damn it. Well, it doesn't make you a better player. - [Brandon] But the monitor though, right? - But the monitor, yes, yes, yes, yes. - It's so good. - We'll get to that. Hold on. - [Brandon] It's so fast. - Got him. Look at this guy, he's hanging from the door. - This is how you know it's a really good display when all he does is just end up playing Halo the whole time. - Okay, this thing is pretty amazing. Just like tracking moving objects like this. Again, I don't compensate for spread so I suck but if you look back that crosshair was on him. Ah, I love this thing. Okay Whoops. Sorry. Now seems like as good a time as any need to point out that this display supports G-SYNC. What's cool about that is if we're running variable refresh rate there is technically a latency benefit to having this 500 hertz display, even if our game is not managing to hit 500 frames per second and Halo Infinite did not. We did that best around 350. That benefit is very small though, so small. There's just one problem, this 240 hertz OLED from LG is running at less than half the refresh rate but looks clearer to just about everyone we showed it to. - The vibes from this one feel a little better. - I'm gonna say this one, this I think has the best motion tracking. - It's a different kind of clarity. There is far, far less blur behind our frogs here but what I'm actually noticing is that relatively speaking the text is less visible. So these finer objects are still very legible but not quite the same. I can definitely see why people like this image more though. But if you look at readability of text, it's not even close. Part of it is probably the resolution. This is a 1440P display, so these elements are smaller but I should be able to compensate by just getting closer and I can, that could just as easily be 255 or 256, whereas here I can clearly see that is 255. - You can see ghosting on the back of basically every leg of the frog. It's just much more noticeable on the white guy, whereas that ghosting is just gone on the OLED. - However, you can also almost see the judder on the OLED. - Yeah, OLED judder is a problem. - So there's a doubling of the image even if it's not blurry. whatever our subjective opinions might be, there's no doubt that when captured in a still frame the clarity of the LG OLED is higher, and this is where things get a little technical. While the Alienware display might refresh at lightning speed processing the data needed to output a new frame once every two milliseconds the individual pixels that make up the panel here they still need a moment to catch up, right? I mean, don't get me wrong, it looks incredible and in most cases, it's almost imperceptible as we saw when I was playing actual games. But when we compare that to the microsecond response times of an OLED I mean take a look at this frog capture. It might be hard to see through our camera but in person the white frog has clear ghosting as it slides across our IPS panel, whereas on the OLED it is simply not there. Kind of like how you can see our behind the scenes content on floatplane.com, but on Utah-- - [Brandon] Utah. - But on YouTube, it's simply not there. Get subscribed so you can meet the team and check out how we shoot our merch photos. You can see a great example of why image clarity matters in addition to having a high refresh rate when you look at this video we did on a DIY 480 hertz monitor like five years ago. Sure, we've got the most up to date frame being streamed to us through the scaler but the actual image was a blurry mess anytime it was in motion. For the sake of thoroughness, we tried all the different response time settings that are available on the Alienware monitor. It has four; fast, super fast, extreme and eSports extreme. And while eSports extreme is 0.2 milliseconds faster than fast based on our testing, the amount of overshoot and therefore visual anomalies that are introduced just is not worth it at all, especially for such a tiny improvement. Can you tell the difference between 2.4 and 2.2 milliseconds? I know I can't, but back to our original question, what about 2.78 versus 2 milliseconds? That's the difference between a 360 hertz monitor and a 500 hertz one. Okay, here's the thing. As we make our displays refresh faster and faster, we get these shorter frame times meaning more frames displayed over the same period of time. I mean, I was an early advocate for the benefits of high refresh rate gaming. The jump from 60 hertz at 16.67 milliseconds per frame up to 120 hertz at only 8.33 milliseconds per frame, that was huge and just about everyone and their grand papi can feel the difference, even when you're simply browsing the web or chilling on the desktop. But as we've shown in the past, the faster you go the lesser of a difference you are bound to notice. And the math for why that is is pretty simple. Even if we were to take that 120 hertz and double our refresh rate again, look at that, we cut our benefit in half and by the time we land at 360 each frame is on the display for at most 2.78 milliseconds. Back then to Del Alienware's own marketing where they say that 500 hertz is reaching speed that's at the edge of human visual perception. Well, I think they kind of hit the nail on their own head here. Can anyone tell even now? We brought in ZOWIE'S new flagship, the 360 hertz TN gaming display, the XL 2566K to find out. Hell, look at that. It appeared. - [Brandon] I can't really feel a difference, I can't recognize a difference. - I don't think I could really tell which one's a 500 hertz monitor and which one's a 360. - I helped set up this test. I know this one's 500, I literally cannot see any difference at all in terms of frame times between these two. - I'm surprised how bright this is with black frame insertion. I'm impressed actually. It looks really good for a TN. - Ooh, well-- - As soon as you go off angle. - Until you're anywhere other than right in front of it. Okay, okay, okay. Andrew, yeah, yeah, shoot it straight on. Okay. Yeah, shoot it's good side, which is dot from the side. While you get the crispness that's associated with black frame insertion or backlight st strobing, and you can really see that on some of these bolder lines because these pixels are simply not switching as fast as on the DELL Alienware as far as I can tell, you're also getting a nice crisp ghost of an image on every fine line, every single color. While I don't see a blur behind the object, I see a clear shadow of the object behind it. And that's on every color transition, not just on the super high contrast ones. Like I'm really noticing, especially on these color circles here. - Yeah, we literally were just talking about this. - [Plouffe] Were just talking about it. There's a name for this artifact that you see. I forget the name of it though. - Anyway, the point is, See on this red one, I'm actually seeing an overshoot and I'm seeing an after image. - Yeah, so that's inherent with LCD BFI because the backlight can't turn in in sync with this scanner at every line so you're always gonna have that issue. - And people are saying they prefer this? - Well, this test is meant for it to find these things basically, but maybe it looks really good in T-score or something. - And what's really important in all of this is that all of us, other reviewers, Brandon, me, Plouffe, we are splitting hairs at this point. So yeah, it might be faster, it might be clearer but to my eye, imperceptibly so. And to put things into perspective, the average gaming mouse is gonna have anywhere from 1 1/2 to three milliseconds of processing latency on its own. I mean, your keyboard, if it has 1000 hertz pulling rate might manage one millisecond. But we are getting to the point where these numbers are so low and so fast that we're realistically gated by our weak human flesh, not by the gear that we're using. Regardless of which of these three monitors it is. when we're talking about an extra four or five milliseconds for your peripherals and the average person's reaction time is about 250, outside of the most extreme instances of eSports gaming, the bottom line is it just doesn't matter. which doesn't mean that gaming displays don't have any redeeming features. The ZOWIE model, for example, we've talked a lot about BFI or black frame insertion, that dramatically improves motion clarity. It's not for everyone. I personally don't like the generally reduced brightness or perceived flicker, but for some folks it's a must have. And I've gotta say, to their credit this one actually has very little perceptible flicker and is really bright so kudos to ZOWIE. This is my first time seeing this one, and compared to our OLED, it manages to refresh 120 hertz faster. I mean, this is an incredibly crisp LCD display, even for a TN one. And that feature, black frame insertion, is notably absent from the AW2524H, meaning that Alienware is counting on the lightning fast 500 hertz refresh rate in order to sell this thing. Can they then? Well, at $830, this is a very premium 1080P monitor, even compared to the $600 ZOWIE. But it's not entirely unjustified. It's the first, it looks much better, thanks to its IPS panel, and in its default standard picture mode we measured an average LTE of just 1.5, with a maximum of six on red in particular. It also seems to cover more of the advertised 99% of the SRGB color space, particularly red and purple. So those might look a touch more saturated but not of normally so. This thing looks great. It's also bright enough, hitting about 390 nits with local dimming disabled, 400 nits with it on and about 450 nets at all window sizes with HDR on. With that being said, there aren't many dimming zones on it, and the HDR color accuracy wasn't great so don't expect an amazing cinematic experience with movies or games with it enabled. As for the IO, it's all right. We get two HDMI 2.0 ports so that you can have I don't know, nice fast pixel response times on your Xbox or your PlayStation or whatever. A display port 1.4 with display stream compression which you will need in order to get to 500 hertz, though any GPU that could possibly drive a game at 500 frames per second is gonna have DSC. You get four USB A ports, one of which is for an NVIDIA reflex latency analyzer, a headphone jack, an audio line out, and this super secret port for NVIDIA to update the firmware. Ah, yes, if that sounds exciting to you you must have missed the memo. It has a G-SYNC module, so if you like updating your own firmware in the event that fixes or new features rollout, this model might not be for you, only NVIDIA can use that. It has height adjustment, swivel and tilt. And this is kind of cool. The stand itself takes up very little space on your desk, meaning that you can get as close as you could reasonably want to to your monitor when you're trying to get a free headshot in Counterstrike. Speaking of which, will it help you do that? Technically speaking, sure. I bet if you give this thing to a pro it could marginally improve their game because once you're at the top, that's all you're chasing. But if you are literally anyone else you're probably better off with just about anything else. I mean, on the premium side that LG OLED that we showed you earlier is almost $200 more but it's also a few inches larger, higher resolution and will give you a great HDR experience. And it's not even the only option, a 240 hertz monitor will get you almost the same real world experience as these and there is ample competition in that space, meaning that those can be had for about $200 these days. Literally a quarter of the cost of this, and a third the cost of this. Whichever route you go, we're gonna have links down below. I mean, who knows, maybe once we double up again and hit a thousand thousand hertz for one millisecond frame times I'll have a different outlook. With everything at a thousand hertz, the thousand hertz gaming pc. But for now, the only difference to my outlook is this, look at our sponsor - FlexiSpot. Sure, most people love sitting motionless at a desk all day, but for everyone else there's FlexiSpot's E7 standing desk. The E7 is super stable and moves smoothly so your monitors and other precious devices stay put as the desk moves up and down. Powered by its dual motors, The E7 is capable of easily holding up to 355 pounds with a unique embedded junction to increase stability and a rock solid carbon steel desk frame. It's LCD keypad panel lets you set four height presets or adjust the height manually within a wide range from 22.8 inches to 48.4 inches. Plus, there's a USB port to conveniently charge a device while you make your setup more ergonomic and active at the same time, wow. The E7 has its own cable management board under the desk as well as cable ties so you can keep your desk space extra neat and tidy. The best part, it comes with a 15 year warranty. Now is the best time to get the E7 with FlexiSpot's spring promotional discount. Save up to 40% using the link below. - If you guys enjoyed this video, you might enjoy the last time we tried to see if bigger number better when 360 hertz was all the rage, spoiler, it wasn't then either.",
    "transcript_keywords": [
        "hertz",
        "hertz monitor",
        "frame",
        "time",
        "refresh rate",
        "monitor",
        "display",
        "OLED",
        "milliseconds",
        "refresh",
        "frame times",
        "rate",
        "thing",
        "difference",
        "frames",
        "Alienware",
        "times",
        "IPS",
        "good",
        "yeah"
    ],
    "transcript_entity_values": [
        "one",
        "hertz",
        "20",
        "500",
        "LG",
        "Brandon",
        "2.78 milliseconds",
        "360",
        "microsecond",
        "about $200",
        "GPU",
        "Del Alienware's",
        "22.8 inches",
        "120",
        "0.2 milliseconds",
        "IPS",
        "Andrew] Great",
        "FPS",
        "Xbox",
        "AW2524",
        "about 2.78",
        "three",
        "YouTube",
        "DSC",
        "24 and a",
        "1000",
        "0.78 milliseconds",
        "256",
        "half",
        "400",
        "E7",
        "500 hertz",
        "first",
        "1440P",
        "240 hertz OLED",
        "Andrew",
        "ZOWIE",
        "Bob Graham",
        "16.67 milliseconds",
        "only 8.33 milliseconds",
        "SRGB",
        "almost $200",
        "eSport",
        "NVIDIA G-SYNC",
        "Halo",
        "480",
        "1080P",
        "six",
        "eSports",
        "two milliseconds",
        "third",
        "LCD",
        "60",
        "E7",
        "DIY",
        "around 350",
        "2.2 milliseconds",
        "2566",
        "three milliseconds",
        "Blur Busters",
        "about 450",
        "1080P",
        "240",
        "four",
        "Graham",
        "one millisecond",
        "about 390",
        "XL",
        "48.4 inches",
        "less than half",
        "five years ago",
        "Counterstrike",
        "all day",
        "1.5",
        "FlexiSpot",
        "240 hertz",
        "120 hertz",
        "jack",
        "TN",
        "Build Redux",
        "2.4",
        "Utah",
        "the DELL Alienware",
        "HDMI",
        "600",
        "1 1/2",
        "two",
        "830",
        "99%",
        "a thousand thousand hertz",
        "these days",
        "about 250",
        "second",
        "Halo Infinite",
        "the same period of time",
        "up to 40%",
        "600",
        "a quarter",
        "1.4",
        "Fiesta",
        "LCD BFI",
        "NVIDIA",
        "Fiesta",
        "Plouffe",
        "up to 355 pounds",
        "BFI",
        "2 milliseconds",
        "LTE",
        "0.5 milliseconds",
        "Alienware",
        "a few inches",
        "USB",
        "PlayStation",
        "15 year",
        "thousand",
        "IO",
        "255"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "MONEY",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "GPE",
        "FAC",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL"
    ]
}