{
    "id": "ewqCmmGyr_Q",
    "title": "How Durable is a Sliding Phone? - Xiaomi Mi Mix 3",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-01-16T14:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=ewqCmmGyr_Q",
    "category": "Howto & Style",
    "tags": [
        "Mi Mix 3",
        "Xiaomi Mi Mix",
        "slider phone",
        "xiaomi",
        "smartphone",
        "android",
        "mobile device",
        "iphone",
        "no notch",
        "notchless",
        "best smartphone",
        "best android",
        "motorized camera",
        "bezzelless",
        "spot the notch",
        "notchless smartphone",
        "slider",
        "concept ph one",
        "best phone design"
    ],
    "views": 1721124,
    "likes": 53578,
    "comments_count": 4223,
    "description": "Moving parts are a necessity with Xiaomis new Mi Mix 3 Design. The front facing cameras are hidden behind the display, until manually slid up into view. The magnetic slider on the Mi Mix 3 feels solid. Xiaomi has said they tested it 300,000 times with no damage done to the slider or the phone... But lets see how the new slideing  Mi Mix 3 holds up to my durability tests. Is this new slider phone the way of the future? Its interesting to see how far companies will go to hid the notch.   Mi Mix 3 Teardown video:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Sign up to race a Tesla Semi HERE:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/2mRXgZTUm8s",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Mi Mix 3 slid into the flagship playing field late last year. So I hope you don't mind me sliding it into your sub box right now. I'll slide my razor blade through the top plastic to commence the unboxing, and then slide the top half of the box off, revealing the Xiaomi Mi Mix 3. A non motorized sliding phone with hidden cameras between the two sliding halves. Can a sliding phone be durable? Let's get started. [Intro] This is one of the more interesting phones I've come across lately. Last year was full of surprising new ways to hide the front facing cameras and get rid of notches. My favorite being the motorized pop-up cameras, like on the Vivo Nex S. This non-motorized magnetic sliding phone is another pretty valid solution. Sliding leaves us with a wide open no-notch display. I'm a fan. Xiaomi has tested this slider over 300,000 times with no damage done to the mechanism. Being a Xiaomi professional phone slider has got to be a fun job. The Mi Mix 3 is one of the cheaper flagships these days. And interestingly enough, in the box, Xiaomi has still included a full-on wireless charging pad, which is super nice of them. An awesome example of a smartphone manufacturer making it easy to transition into a wireless ecosystem. Apple, on the other hand, announced their version of wireless charging almost two years ago, and we still haven't seen it yet. Maybe someday they'll catch up. Let's start with the scratch test. You know how it works. I have a set of Mohs mineral hardness picks with different tips on the ends. These tell us what the screen is made from. Plastic scratches at a level 3, while glass doesn't start scratching till level 6. And we should see ceramic and sapphire start scratching at level 8 or 9. Getting a close up look at the screen, we can see scratches appearing at level 6, with deeper grooves at level 7. This puts us on par with most of the other tempered glass screen flagships. Let's check out the front cameras on the sliding portion. Covered with glass, there should be no scratch marks from the constant sliding motions. There are two cameras: a 24 megapixel and a 2 megapixel, capable of doing that blurry portrait mode background thing, even while shooting video, which is interesting. There's a flash tucked in here on the right as well. The speaker grille is made from metal. The grille on the top display portion of the slider just allows the sound to pass through from the actual speaker. Below in the body of the phone, the lower grille is also very secure and won't be falling out on it's own. If we shine some light through the two halves of the phone, we can see there is some distance between the screen and the body. This is good, so that there's no direct rubbing on the camera lenses, but it does leave the gap more vulnerable to something like a grain of sand or dirt getting caught inside and jamming things up. It'll be interesting to see how this slider phone holds up over time, and in every day life with pocket lint and dirt. There are obviously two halves to a sliding phone. The top half containing the display is surrounded by plastic. The bottom half of the phone is made from aluminum leaving us with a shiny metal scratch mark underneath the black paint. This button up here on the left side is a metal customizable button. It can launch Google Assistant, turn on the camera, or start the flashlight. Thumbs up to Xiaomi for customizability. It also has a dual SIM card tray, but zero water resistance. A phone with this many openings and surfaces makes it basically impossible to keep water out. The top of the phone is made from metal, along with the right side, power button, and volume rocker. The bottom of the phone has no headphone jack, but does have a USB-C and one loud speaker. The Xiaomi Mix series has always had pretty solid build quality and materials. The original Mi Mix having an impressive full ceramic body. This time around, the fingerprint scanner is invincible. So we're off to a good start. And it looks like this rib texture on the under side is going to give the the Mate 20 Pro some competition for the Most Musical Phone Award. So ceramic and glass might feel the same, but they are actually totally different materials, ceramic being much harder and more scratch resistant. Even with my level 6, 7, and 8 picks, we don't see any major damage until level 8 with the faint marks at a level 7. Much better than a slab of glass at a level 6 hardness. For how inexpensive this phone is, the materials, accessories, and functionality are impressive. The camera lens is made from glass with dual 12 megapixel sensors: one normal, and one telephoto. So far this phone is checking all the right boxes. Let's see what the screen is made from. I always could just look it up on Xiaomi's website to see what they say, but lighters are just so much more fun. After about 20 seconds of flame on the 6.4 inch notchless display, the results are in. A white, non-recovering burn mark right in the center means AMOLED, which makes sense. LED displays are much thinner than LCD displays. And thinness is a factor with the two sliding halves. Speaking of thinness, discovering how well these two halves hold up under pressure is an integral part of my durability test. It's time for the bend. I was nervous about this one since there are more moving parts than a normal smartphone would have. I thought this might be weak. And while it does have some flex, it's still surprisingly sturdy. No creaks or cracks. And more importantly, no damaged parts. The Xiaomi Mi Mix is a well constructed solid device, with premium materials, and a wireless charger included in the box. Xiaomi is definitely looking out for their customers with this one, and it passes my durability test. The Xiaomi Mi Mix is a win. It'll be interesting to take it apart and see how that magnetic slider contraption looks on the inside. Hit subscribe if you haven't already. It's free. And come hang out with me on Instagram and Twitter. Let me know what phones you are excited to see tested this year down in the comments. Thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "playing field late",
        "phone",
        "sliding phone",
        "Xiaomi",
        "sliding",
        "Mix",
        "level",
        "flagship playing field",
        "playing field",
        "field late",
        "Xiaomi Mix",
        "motorized sliding phone",
        "Xiaomi Mi Mix",
        "made",
        "Xiaomi Mix series",
        "Xiaomi professional phone",
        "cameras",
        "glass",
        "sliding halves",
        "magnetic sliding phone"
    ],
    "transcript_entity_values": [
        "3",
        "Google",
        "6.4 inch",
        "9",
        "6",
        "8",
        "7",
        "Twitter",
        "Instagram",
        "the Vivo Nex S.",
        "two",
        "20",
        "jack",
        "6",
        "about 20 seconds",
        "one",
        "12 megapixel",
        "half",
        "zero",
        "Mi Mix",
        "this year",
        "Apple",
        "24 megapixel",
        "300,000",
        "Last year",
        "2 megapixel",
        "Xiaomi",
        "The Mi Mix 3",
        "LCD",
        "these days",
        "AMOLED",
        "almost two years ago",
        "every day",
        "late last year",
        "the Most Musical Phone Award"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "DATE",
        "DATE",
        "ORG"
    ]
}