{
    "id": "EWXZwFoL-Kw",
    "title": "🎁 Mystery Gift Unwrapping with Ro!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-12-24T18:59:09Z",
    "video_url": "https://www.youtube.com/watch?v=EWXZwFoL-Kw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "christmas",
        "gift",
        "harry potter",
        "wireless iphone charger",
        "wireless phone charger",
        "iphone stand",
        "backpack",
        "puppy"
    ],
    "views": 2705346,
    "likes": 35333,
    "comments_count": 2190,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, I'm here with Ro. - Hello, hi you guys. - Whoa, I'm so excited because I got you some Christmas presents. - [Ro] You are so sweet. - So these are all things that I think that you will enjoy but the whole appeal of this is we're gonna do this blindfolded so you can open them up blindfolded. So, you're gonna open them up blindfolded and you have to guess what's inside. - A question, if I guess them correctly, do I get to keep them, if I guess them wrong, do I not get to keep them? - No, you get to keep them regardless. - (laughs) Oh my god! - Just so you-- I'm not gonna like take back your gift. You got this new blindfold. I got a bunch of blindfolds on Amazon. - It is so cute - Look at this, it's a little unicorn. - Like are you kidding me? It's a unicorn? - Right?! I know. - I shoulda worn the unicorn holiday sweater! - Ahh, it's okay. - Oh my gosh, there's a unicorn holiday sweater that Justine got me and it's the cutest and I would have matched. - We did the Amazon sweater haul, so basically like, - Yeah. - holiday fashion so you guys can go and check that out as well, but-- - And you can see the back of this. - I can't wait so I know which one, there's one that we have to open first. - Okay do I put this on now? - Yes, you put that on I'm gonna move these aside. - Okay. - Okay so here we go this is the first one There you are. - Okay it's very long, feels soft. Okay lets open it up (paper tearing) let's see here. Well, I guess let's feel here. - Yeah, she's feeling, give it a nice feel. What does it feel like? Don't squeeze too hard. - What is this? (laughing) I was like is it a sweater round tight? Justine! - (laughing) Just give it-- - OK, my dog cookie over here, (laughing) she only gets this excited when there's food. Is this food? - It may be food. - Is this a loaf of bread?! (laughing) - Yes! - Cookie loves bread! (laughter) - Okay, you can take your blindfold off. - Let me see, ah! (laughing) Cookie you knew what it was too huh? - As a precursor to a future gift this has to deal with that, so I just wanted to make sure we go this one out of the way. - This is amazing! (laughing) I love it Bring em' on. I'm good at this game. - So, let's see. What was the thing that you said, what did you say you wanted most for Christmas? - A puppy? - Oh okay. - Or a Fortune 500 company? - [Justine] Well let's see what this one is - Okay. So far-- - I wrapped these this morning. I did not do a good job. - I love them, by the way. Oh this is soft, but it doesn't feel like food - It's not edible. (upbeat festive music) - It's not a shirt but it has sequins - [Justine] It does. - [Rosanna] Sparkles and it's- oh, this is a pillow. - It's a pillow! - Yeah this is a pillow - Ding ding ding ding ding! - Do I have to guess the design 'cause I don't even know - If you want to, go ahead try to guess. - Probably holiday, so probably like a reindeer? - Try again. - A snowman? - Try again. - Santa? - Try again. - An elf? - Nope. - Candy cane? - Not holiday, it is not holiday - Christmas tree. It's not? - It is absolutely not. - Its a dog. - Nope. - It's a computer. - No! - It's a chai tea latte. - [Justine] No (laughing) it's a pillow! - It's a coffee? - It's not a coffee! No, it's a pillow yes. - Yeah but what's the design? - Do you want one more guess? - Yeah. - Okay. - I'm trying to think of things I'd love that you know that I love. What about-- - Molly also loves this. - Ooh is this a unicorn? - Yes! - (laughing) - Woo! But I think it, I don't know it might flip. Oh yeah, it's one of the flip ones. - Oh its a flip one. Look, if you go this way, just total bling. So I've guessed two outta two - You have. - So Justine, give me a hard one. I'm totally ready. - Okay. - I've warmed warmed up now. - So you wanna hard one? - [Ro] I'm ready for a hard one - Okay, well this one I didn't wrap because I ran out of wrapping paper, so it's a bag. - So it's a bag. - Just kinda like reach in. - Okay. Okay gift number three. This feels like the 12 gifts of Christmas - It does but we only have five, or six, I think, I forgot. That's all. - Is this, it's one part? - [Justine] Here you go, there you go, you're ready. - [Rosanna] Can you eat out of it. - [Justine] You could. Theoretically you can eat out of anything. - Oh, so that's not a great-- - But would you want to? - That's not a great question. - You might not want to. - Okay, what is this? Oh, this is some type of techno techy stuff - (laughing) it is. - (gasp) This is a compute- no. This is, 'cause you know how they have the instructions in here with the little round-- this tech stuff has this. - Yeah, it's definitely something tech, I'll give you that. - There's a cord. - There's a cord. - It's definitely a technological device. Now I just gotta figure out which one. Nope that's instructions. - There's nothing else in-- - That's packaging, oh. - Here, yep, there it is. - This is it. - [Justine] That's it. - What could it be. What's this? - Oh, I don't know. - This is not part of it. - No that's-- - I thought it's just the packaging foam right? - Here you go, that's the device. - Oh wow, what is this? (laughing) What is this, it's round. - [Justine] It's round. - What the heck is round? Like, is it a magnifying mirror that you put on your car or your bike. - Nope. - So you can see better? - Is that something that you want? - Is this a new camera? - No. - That you stick like a GoPro but it's round and it's just the lens? - [Justine] Absolutely not. - This is the lens. - Nope. - No? This is a standing mirror. That you get like - [Justine] It's not a mirror. the beauty gurus. - It's not a mirror, but it is a, some sort of-- - But it plugs in and has lights? - There's no lights. So what would plug in, that's a stand, that has no lights? - I don't get this. I mean what is it? Why is it round? - [Justine] Do I give you a hint? - [Rosanna] Well, it's a speaker? - I think maybe if you took your blindfold off you probably wouldn't even know what it is so I'm not even sure. - Well it has to be-- there's a stand. - Yes. - It's a speaker. Alexa! - It's not plugged but it's not-- - It's the new Alexa. - It is not! - Google Play! - Nope. - Google, hello Google. Hey Siri! - We have activated every single person's possible device in this video. (laughing) - Is it one of those? - It is not, but if you wanna take your blindfold off you can look at it. - Okay. - And then try to guess. Yeah that's no help, is it? (laughing) - Okay, this looks different in my head. I was picturing something else. - She hates her gift. (laughing) - I don't know what it, so it plugs in back here. - [Justine] Do you want me to tell you? - Yeah you're gonna have to tell me girl, because this hard mode one, I did not guess it, I have no clue. - It is a wireless iPhone stand charger. So you can put it by your bed and-- - What? - Yeah so you don't need to plug it in, you just put your phone right there. - Just touching it? - Yes. - With a case on or off? - You can have a case on it. - (whispers) what? - (whispers) I know. - Christmas came early. - It did - Okay let me put this over here. By my Wonder bread. (both laughing) - Alright. - That was so funny, Cookie helped give it away. - She did. - That it was food. - Here you go. - Notice she did not get that excited. - No. - For the charger - She's like, there's food. Okay here we go, next one. - Okay I can already tell you it's soft. - Okay yes, it's not bread I'll give you that. - Okay let's see here. (festive music) It's a face. Oh my gosh, it's a stuffed animal. - It is. - It isn't, it's a puppet. - It is! - Oh my gosh I just stuck my hand in here and it's a puppet, oh I'm moving his face? - You are! - Now just which animal. - Okay. - That's what we've gotta figure out - Think about it. - Let me feel everything. Okay. - You should really get in there, give it a good feel. - There's four legs. - There are four legs. - So, it's an animal with four legs. - Yes. - It's a dog. - It's a dog. - It's a pig. - What type of dog? - It's a dog! - What type of dog? - It's a dog! Let me feel. Has two-- wrinkly fa-- (gasps) Is this a french bulldog? - Yes it is, ding ding ding ding! - Oh my gosh, (gasps) it looks just like Cookie! - (laughs) I love when you were like I wanna puppy I was like, well I you sorta have a puppy. - Justine. - It's so cute! - You did get me a puppy, look at it. - [Justine] Look at this, it's cute! - We gotta get a side by side here. Cookie! - Oh my gosh Justine, the colors are perfect. - They actually, it does match pretty well. - Oh Cookie loves this dog. - We've got one more, well actually we have two more gifts. - Oh my gosh, okay, oh, okay we've got a box. - [Justine] Mmhmm. - I know it's a box. Just hug the box and push down the wrapper. Okay now we've gotta open this. An Easy-Bake oven - It's not but here-- - It's an Easy-Bake oven! - I don't want you to hurt yourself let me just dump it out for you. (thud) Okay there we go. - It's a-- Oh! - Think about some things that have happened in this video. - This is a tech thing - It's a little, I mean I would, you plug it in. Flip it the other way. - What's this? - That's, that is nothing that you need to worry about. (laughs) - What's this? - This is how it goes. That's how it goes. - This is the right way? - That's the right way. - Like a speaker. - Not a speaker, feel the top, see what does that feel like? - Oh! - What's that? Think about what you opened first. - This is a toaster! - It's a toaster! - Oh my gosh I thought it was another tech gadget. - I mean, you know, it's not that techy it's a special toaster though which I don't think you'll be able to guess. - (gasps) Okay I can guess this. - OK. - Unicorns. - No. - Slime? - No. - Jojo Siwa. - No! - Is it Christmas related? - Not Christmas related. - Ohh, it's a pig. - It's something that we both like. - Hmmm. - A movie. A series of movies (gasps) - It's a series of movies, Lord of the Rings. - Well you know I haven't seen that. So something-- - Harry-- oh you haven't seen Harry Potter. - I have not seen Harry Potter - I love Harry Potter, what else is a series? Harry Potter-- - We have done things in this theme before - Lord of the Rings. (gasps) Star Wars! - Yes! - This is a Star Wars toaster? - Yes! - Shut up (laughs). - It burns in Darth Vader on the toast. - Are you kidding? - I mean. - We have to do it, we have to do it. I'll get an extension cord, let's test it out. This may have not been a test video but we have to do it before this video ends. I am so excited about this. - I did get you some bread so that we could try it out. - This is amazing. Oh my gosh I am so excited about this. - Me too I'm gonna turn it up all the way 'cause we wanna get the full -- - This is the best geeky gift ever like how frickin' cool is this? - They had so many different ones I was like oh my gosh which one do I get but I though Darth Vader is a pretty-- - I love Darth Vader. - good option. - Just so BA. - Yeah. - [Rosanna] If you hear gurgling it's not our tummies it's literally Cookie going to town on this dog. - I might even turn it down a little. - You can see they're over here. She's just like losing her mind. How long does it-- - While we toast would you-- - We can do one more. - Yeah, so we'll let this - Okay let's do it. - I'll set this aside. The last gift, here you go while we toast. - What is this? It's tall. - It's a size. - What is this? - Well-- I don't know, what is it? - It has a zipper a pouch, a bag? (gasps) A backpack? - It's a backpack. - Justine, I really wanted a backpack - What kind of backpack? - Oh God, gotta guess what kind? Is this a mini backpack? - It is a mini backpack. - Does it have Minnie Mouse on it? - Oh no, no, no-- - Does it have-- - Oh it's not a Minnie, I mean mini as in like, it's a small backpack. Okay, I'll give you a hint. - It's perfect size for me really. - It's something that I have not seen. - (gasps) Is it Harry Potter? - Yes but I-- - Which you still need to watch? - Yeah but I don't know what it is, I don't get it. - Oh my, I need to see this. - (laughs) I don't know if-- - Justine this is so cute! Oh my god, I'm wearing this everywhere. You guys! - Yeah I don't know-- - It's a Gryffindor little mini backpack. (gasps) OK, so Justine, Gryffindor is one of the houses. - Okay - At the School. So there's like Gryffindor, Slytherin, House Hufflepuff Ravenclaw, and I definitely would be Gryffindor. - That's great. - They're courageous, they're brave. - Then this is great 'cause I was like, I just was like hmm, Harry Potter backpack-- - This is so cute! Justine, I love this! - Yes, I'm so glad, yaaay! - You have a Star Wars one. - Oh I do! - And then I'm gonna have my Harry Potter one (laughs). - The problem is when I'm shopping for other people, that I get super hyped up 'cause I get the recommended thing so I got The Nightmare Before Christmas backpack. (both laugh) Look how cute! - [Rosanna] This is really cute. - I know. - Look at little Jack. - I was like, I wanna be festive for the holidays. - This is perfect. We need to wear these together. - I know, I love it. Wait until you see the toast. - Oh. - Oh. - Oh snap. - Stop everything. - Did it work? - Oh my goodness. - It puts the logo into-- - Here's your toast for you let me check this one out. Oh two toasts! - Oh my gosh. - This one got a little extra crispy, but this one looks perfect. - Yeah this side's a little hotter than the other one. This is the best day of my life ever. - (laughs) Well, Merry Christmas, enjoy your bread. - (laughing) Thank you, oh my gosh, I love it. Now I get it, they go together. - It does, I was like, it's a theme, it's a theme. - I love this. - Oh my goodness. Well, yeah this is definitely something. - Mmm. - I don't know if you should eat the first toast. - That's-- oh 'cause like we didn't wash it yet - I don't think you wash it but like there was some burning and stuff happening, so like. - I'm like okay with it. - Okay (laughing), you're real into poison - (laughing) I'm alright. It'll be good. Woohoo! - Well thank you guys so much for watching. Hope you enjoyed this video. I will see you guys in the next one. Make sure you go and check out Ro's channel, subscribe, go say hello. - Aww. - And Happy Holidays, from us to you. - Yes Happy Holidays! - Yay, bye - Bye. (upbeat festive music)",
    "transcript_keywords": [
        "Harry Potter",
        "Ding ding ding",
        "Yeah",
        "Ding ding",
        "Christmas",
        "Justine",
        "guess",
        "gosh",
        "Harry",
        "love",
        "Ding",
        "Potter",
        "dog",
        "cookie",
        "backpack",
        "give",
        "feel",
        "love Harry Potter",
        "holiday",
        "Harry Potter backpack"
    ],
    "transcript_entity_values": [
        "french",
        "500",
        "Justine, Gryffindor",
        "House",
        "Slytherin",
        "12",
        "Amazon",
        "Cookie",
        "one",
        "Santa",
        "Gryffindor",
        "The Nightmare Before Christmas backpack",
        "Justine",
        "about-- - Molly",
        "Hufflepuff Ravenclaw",
        "Ro",
        "BA",
        "iPhone",
        "three",
        "Justine] Mmhmm",
        "Darth Vader",
        "Google",
        "four",
        "Jack",
        "Merry Christmas",
        "Harry Potter",
        "Siri",
        "five",
        "Rosanna",
        "Minnie Mouse",
        "Justine] Look",
        "ding ding ding ding!",
        "six",
        "two",
        "Alexa",
        "Minnie",
        "Harry Potter-- -",
        "Alexa",
        "first",
        "Christmas",
        "Ro",
        "Rings",
        "GoPro"
    ],
    "transcript_entity_types": [
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT"
    ]
}