{
    "id": "exC7j6Bpef4",
    "title": "Snap Spectacles 3 review: here we go again",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-11-12T10:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=exC7j6Bpef4",
    "category": "Science & Technology",
    "tags": [
        "snap spectacles 3",
        "snap",
        "spectacles",
        "snap spectacles",
        "spectacles 3",
        "snapchat",
        "glasses",
        "social media",
        "google glass",
        "augmented reality",
        "ar",
        "ar glasses",
        "spectacles 2",
        "spectacles review",
        "review",
        "glasses review",
        "price",
        "specs",
        "features",
        "3d views",
        "lens studio",
        "spectacles lens",
        "design",
        "screen",
        "hololens",
        "casey newton",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 534434,
    "likes": 8688,
    "comments_count": 488,
    "description": "Snaps Spectacles 3 have arrived with a striking new design and a much higher price  $380, up from $150 to $200 for the previous edition. Snaps latest glasses are pricey but hint at where the world is going. They begin to integrate Snapchat software with the real world.  Learn more:   The Interface is a daily newsletter where Silicon Valley editor Casey Newton breaks down the days big news from Facebook, YouTube, Twitter, and Snap. Subscribe here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/34UBPcd",
        "http://bit.ly/33EUpF1",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- It's been three years since the first version of Snapchat Spectacles, and that first edition had a lot of buzz but it didn't sell too many units. Last year, a second version kind of came and went. Now Snap is back with Spectacles 3. It's a redesigned, more powerful and much pricier take on wearable computing. These things cost three hundred and eighty dollars, up from a hundred and fifty dollars for Spectacles 2. Snap says they're intended for a more fashion forward and creative audience, but what can these things actually do and who should really buy them? (funky music) So let's start with the design. Compared to Spectacles 2, which looked a lot like a toy, Spectacles 3 feels much more serious. They come in just two colors, black and a kind of tan that Snap calls mineral. And they have a new steel frame. I find that the steel frame isn't super comfortable, particularly over a long period of time. There's something that would just kind of dig into various parts of my head as I was walking around town with them. And as far as the design, it might just be a little too fashion forward, at least for me. There's something about this giant steel bar running across the top of my forehead that feels a little bit insect like or maybe even alien. Now let's talk abut the tech in Spectacles 3. The big marquee feature this year is a second camera, and what that second camera means is that Spectacles can sense depth for the first time. So Spectacles now have a bunch of filters that kind of integrate the real world with Snap's. For example, there's one filter that puts hearts everywhere and as you're walking through the video, those hearts will kind of bounce off you. There's another flower filter that projects flowers onto the ground and the shape kind of changes with the topography. When I talked with Snap's CEO, Evan Spiegel, about Spectacles recently, he told me he saw them as a breakthrough for the company because it's the first time that Snap has been able to integrate computing with the real world. Unfortunately, though, that integration is only happening after the fact. I can't put on my Spectacles and just see Snap filters over layed on top of the world. Instead, I have to open my phone, import Snaps from my glasses to the phone, and only then can I tap the edit button and start swiping through the filters. It's just a couple more steps than it feels like it should take. So there are gonna be about 10 of these filters available at launch that are exclusive to Spectacles 3, and I'd say that none of them has that immediate iconic appeal of past hit Snapchat filters, like the dancing hot dog or the gender swap. But Snap is gonna let independent developers build their own filters that incorporate depth perception, and it'll be interesting to see what they come up with. In the meantime, though, it feels mostly like a novelty. Spectacles 3 can use the second camera in another way, and it's by taking what Snap calls 3D photos. So you put on your Spectacles, you press and hold one of these camera buttons and it will capture a sort of three-dimensional image of the world around you. Once you've done that, you can build this cardboard viewer that is included with Spectacles 3, slide a phone in and then kind of click through all of the 3D photos that you've taken. It's sort of similar to one of those old View-Master gadgets, and it's based on previous things like Google Cardboard or Gear VR. It's a somewhat novel way of looking through images, but I don't know if, at this point, it's much more than a novelty. I think Spectacles 3 are a meaningful iteration of a product that is only going to get better over time. At the same time, they're definitely a product that most people shouldn't buy. So why does Snap keeping making these? I asked Evan Spiegel that, and he was up front with me. He said that he thinks that these kind of AR glasses aren't gonna hit mainstream adoption for 10 years. He says there are just too many constraints on the hardware that we have. But Snap thinks it's important to iterate in public. Every time it releases another generation of Spectacles, it's able to learn from its community, get feedback, and then incorporate that into the next edition. With Spectacles 3, for the first time Snap is integrating its computing into the real world. It's opening up that tool for developers, and it's going to learn a bunch. I don't think it's going to sell a lot Spectacles 3, but I do think that what it learns is gonna make Spectacles 4 a much more interesting product. If you enjoyed the video, don't forget to like and subscribe to more videos from theverge.com, and if you're interested in Snapchat, wanna know more about the business and everything to do with technology and democracy, how social networks are changing the world, I write a daily newsletter about it. You can find it at theverge.com/interface.",
    "transcript_keywords": [
        "Spectacles",
        "Snap",
        "kind",
        "time",
        "filters",
        "world",
        "Snapchat Spectacles",
        "Snap calls",
        "Evan Spiegel",
        "Snapchat",
        "Snap CEO",
        "Snap filters",
        "time Snap",
        "real world",
        "feels",
        "lot Spectacles",
        "camera",
        "version",
        "version kind",
        "things"
    ],
    "transcript_entity_values": [
        "Spectacles 3",
        "one",
        "about 10",
        "Spectacles 3",
        "three",
        "Snapchat",
        "Spectacles",
        "Snapchat Spectacles",
        "a hundred and fifty dollars",
        "Spectacles 2",
        "three years",
        "daily",
        "Spectacles",
        "Evan Spiegel",
        "Google Cardboard",
        "Spectacles 4",
        "two",
        "Last year",
        "this year",
        "second",
        "10 years",
        "first",
        "three hundred and eighty dollars",
        "Spectacles 3"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "PERSON",
        "ORG",
        "LAW",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "EVENT"
    ]
}