{
    "id": "EYEzhTLR9QY",
    "title": "How An NFL Team Disappeared In 24 Hours",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-01-28T18:16:24Z",
    "video_url": "https://www.youtube.com/watch?v=EYEzhTLR9QY",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "colts",
        "baltimore",
        "indianapolis",
        "maryland",
        "american football",
        "nfl",
        "football",
        "afc",
        "sports",
        "nfc",
        "ravens",
        "superbowl",
        "baltimore colts",
        "indianapolis colts",
        "baltimore ravens",
        "national football league",
        "super bowl",
        "championship",
        "robert irsay",
        "jim irsay",
        "baltimore orioles",
        "orioles",
        "memorial stadium",
        "hoosier dome",
        "rca dome",
        "eminent domaine",
        "Sigma Chi",
        "rams",
        "la rams",
        "los angeles rams",
        "la chargers",
        "raiders",
        "pass interference",
        "super bowl 2019",
        "super bowl liii",
        "super bowl 53"
    ],
    "views": 157997,
    "likes": 3765,
    "comments_count": 293,
    "description": "35 years before Super Bowl 2019, the Indianapolis Colts disappeared... That's How Mafia Works...In Vegas:  How Apple Doesn't Pay Taxes:  This Song Has Been Played More Than Despacito:   How the Bat Bomb Almost Won World War 2:  How Scooters Are Taking Over the World:   Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/PO3TiJvI0DA",
        "https://youtu.be/tSkCEyWCCPM",
        "https://youtu.be/bbTKxC4eveI",
        "https://youtu.be/UG5Sd0mWmfk",
        "https://www.youtube.com/watch?v=sQkPqPsik9o",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is the story of the NFL team that disappeared in 24 hours. With the Super Bowl right around the corner, these days it's just not all that uncommon to see major league teams move from city to city. Just in the last few years, the Rams, Chargers, and Raiders have all moved. Teams move for all kinds of reasons, whether it's dwindling ticket sales or a lack of funding for stadiums. Generally, these moves take place over years after being announced. However, what's not common is for an NFL team to move in 24 hours. In the '70s, the Baltimore Colts were sharing the same stadium as the Orioles baseball team. Not only did that mean sharing field space, but it also meant they had to share office space, locker rooms. I mean, there was barely enough space for one team, much less two. This was even worse for the fans. Because a baseball diamond is such a weird shape compared to a traditional football stadium, it meant that the vast majority of seats had terrible views. Also, there weren't enough bathrooms, so, you know. (feces plopping) With all this in mind, the new owner of the Colts, Robert Irsay, fought for a brand-new stadium that was actually good for football. You know, like everyone else had. Now this actually almost happened. Baltimore did have plans to build the BaltoDome, which might be the most '70s name of all time. However, the $78 million in funding to actually build it was vetoed by the governor. With that, Irsay started to shop for new cities for the Colts. The potential options included Memphis, Jacksonville, as well as Phoenix. Naturally, the city of Baltimore didn't exactly take too kindly to this, and then decided to steal the team. I'm actually not kidding, they tried to steal the team. On march 27, 1984, the city of Baltimore passed a bill that allowed them to take ownership of the Colts team through eminent domain. Eminent domain allows the government to seize private property for public use. This is not all that uncommon especially in sports. Pretty much any city that hosts the Olympics will use eminent domain to build the stadiums to host the games. What eminent domain isn't usually used for is to take control of a sports team as opposed to, say, building, like, some schools or something. Even though the bill had passed, it actually wouldn't take effect until the following day when the governor signed it, so that prompted Irsay to come up with a little bit of a crazy idea. By a little bit of a crazy idea, I mean a completely bat (bleep) insane one. Enter Operation: We Have To Find A New City To Move To And Move Our Entire NFL Team In Less Than 24 Hours. - [Matt] That's a long name. - They probably had a better code name. Irsay started by calling the list of cities that he'd been negotiating with and saying we need to make a deal, like, right now. The Colts were actually pretty close to a deal with Phoenix. However, because of the impending legislation, Phoenix pulled their offer off the table. However, Indianapolis had just finished completing their brand-new stadium known as the Hoosier Dome, and they were looking for an NFL team. Irsay called the mayor of Indianapolis, William Hudnut, and struck a deal to move the entire team in less than 24 hours over the phone. Lucky for everyone, the mayor had a friend who owned a large shipping company, and thus the operation was officially underway. 15 trucks were sent in the middle of night to collect everything that was necessary to run the Colts team. This included equipment, other stuff. I don't know, what do you need for an NFL team? It's just equipment, right? Because of the secrecy necessary to pull something like this off, most of the Colts staff had no idea what was going on. So instead, they hired a local frat house to load up all the trucks. (laughing) This is so stupid! Like, if this was a movie script, I'm like, that's unrealistic! As you might expect, this didn't exactly go perfectly, as frat guys (laughing) started immediately stealing all the memorabilia. Some guys were wearing, like, three or four jerseys. It's (laughing)-- - There was a report where they said, like, they put one jersey in a box, put one in their pocket. - That sounds exactly right! All 15 trucks drove through the night, each taking a different route in case the Maryland State Police were on their trail. As soon as they got to Indiana, their own state police escorted them into Indianapolis to make sure that no shenanigans or nefarious deeds happened to the goods. I got the nefarious in there. I got it in there, you can't take it out now! By the time the eminent domain bill was signed the next day, the entire Colts organization was already completely out of town. Well, besides the marching band. (sad trumpet music) (brass clanging) After losing the Colts in such spectacular fashion, this caused the city of Baltimore to really put a lot of effort into keeping their last remaining major league team, the Orioles, so a few years later, they built them a brand-new stadium, which would've solved the entire Colts issue to begin with.",
    "transcript_keywords": [
        "NFL team",
        "team",
        "Colts",
        "Colts team",
        "teams move",
        "move",
        "Super Bowl",
        "Entire NFL Team",
        "city",
        "entire Colts",
        "NFL",
        "Baltimore",
        "eminent domain",
        "league teams move",
        "Baltimore Colts",
        "Irsay",
        "stadium",
        "brandnew stadium",
        "eminent",
        "domain"
    ],
    "transcript_entity_values": [
        "Jacksonville",
        "24 hours",
        "the '70s",
        "one",
        "the next day",
        "four",
        "the Maryland State Police",
        "three",
        "Raiders",
        "70s",
        "Colts",
        "less than 24 hours",
        "the last few years",
        "the following day",
        "Indiana",
        "the night",
        "Matt",
        "the middle of night",
        "a few years later",
        "Indianapolis",
        "Olympics",
        "15",
        "Baltimore",
        "Phoenix",
        "$78 million",
        "Robert Irsay",
        "two",
        "the Hoosier Dome",
        "the Baltimore Colts",
        "Memphis",
        "Orioles",
        "the Super Bowl",
        "NFL",
        "over years",
        "Baltimore",
        "these days",
        "Chargers",
        "William Hudnut",
        "march 27, 1984",
        "Colts",
        "Irsay",
        "Less Than 24 Hours"
    ],
    "transcript_entity_types": [
        "GPE",
        "TIME",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "TIME",
        "DATE",
        "DATE",
        "GPE",
        "TIME",
        "PERSON",
        "TIME",
        "DATE",
        "GPE",
        "EVENT",
        "CARDINAL",
        "GPE",
        "GPE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "EVENT",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "NORP",
        "ORG",
        "TIME"
    ]
}