{
    "id": "eyIz36L0nTM",
    "title": "Polaroid's Moto Mod: Instant Photos, Amazing Science",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-12-14T19:49:00Z",
    "video_url": "https://www.youtube.com/watch?v=eyIz36L0nTM",
    "category": "Science & Technology",
    "tags": [
        "polaroid moto mod",
        "polaroid motorola",
        "polaroid moto mod review",
        "polaroid camera review",
        "polaroid review",
        "polaroid insta share printer",
        "mrmobile",
        "michael fisher",
        "android central"
    ],
    "views": 185137,
    "likes": 5983,
    "comments_count": 250,
    "description": "Eighty years ago, a company called Polaroid sprouted from a garage not far from the current location of the MrMobile studio. The companys founder soon developed a special polarization technology that was rapidly adopted across a slew of products ranging from desk lamps to sunglasses. That work later led to military contracts including pilot goggles, spy satellites, and a special synthetic quinine for treating malaria in troops serving in tropical regions. While that last bit sounds out of character for a company specializing in optical science, it isnt: quinine has photosensitive properties that make it useful for photography. Over the next 40 years thats where Polaroid built its empire: with instant cameras that didnt need a darkroom to develop their film.   Flash forward to 2017. The new Polaroid Moto Mod (or Polaroid Insta-Share Printer, to be precise) doesnt use any of the technology mentioned above. Whats more, the Polaroid brand on its backside has been bought and sold so many times its almost meaningless today. But two things tie this mobile printer to it roots: it still produces instant photos you can hold, and it uses technology that got its start inside Polaroid Corporation to do it. Join me for a look at the latest Moto Mod for Moto Z smartphones, a new take on the old instant camera, the Polaroid Insta-Share Printer!   [SPONSOR]  This video was made possible by Thrifter, a new way to save money on everything from gadgets to home goods by shopping based on value, not hype. Get the Moto Z2 Play deal mentioned in the video here:    [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Polaroid Insta-Share Printer:    [FURTHER READING]  Zink: Inkless printing with colorless color [IEEE]   Behind the scenes at Zink: where color magic happens [IEEE]    [LOCATION CREDIT]  Some footage for this video shot at the Baker Library at Harvard Business School. Polaroid exhibit running through December 21:    [ABOUT MRMOBILE'S POLAROID MOTO MOD REVIEW]  MrMobile's Polaroid Moto Mod Review was produced following three days with a Polaroid Insta-Share review device provided by Motorola. The device was used with a Moto Z2 Play and Moto Z2 Force smartphone, using Zink paper from both Zink and Prynt.   [MUSIC]  Live Up by Cymatix, available at Premium Beat:   Raiders by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "http://mrmobile.tech/4fs",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/4fr",
        "https://spectrum.ieee.org/consumer-electronics/gadgets/zink-inkless-printing-with-colorless-color",
        "https://spectrum.ieee.org/slideshow/consumer-electronics/gadgets/behind-the-scenes-at-zink-where-color-magic-happens",
        "https://www.library.hbs.edu/hc/polaroid/visit/",
        "https://www.premiumbeat.com/royalty_free_music/songs/live-up",
        "https://www.premiumbeat.com/royalty_free_music/songs/raiders",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] History lesson. 80 years ago, a company called Polaroid started right here in Cambridge, Mass, where its special polarization technology soon found its way into products across the country and across the globe. Everything from glare-free desk lamps, to sunglasses. That work later led to military contracts, including pilot goggles, spy satellites, and even a special synthetic quinine for treating malaria. Well it turns out that that chemical was useful in photography. And over the next 40 years, that's where Polaroid built its empire. With instant cameras that didn't need a darkroom to develop their film. Flash forward to 2017 and this accessory doesn't use any of the technology (chuckles) I just talked about. And what's more, the brand on it has been bought and sold so many times, it's basically meaningless. But, two things tie this moto mod to its roots. It still produces instant photos you can hold and it uses technology that got its start inside Polaroid to do it. I'm MrMobile and this is the Polaroid Insta-share Printer review. (techno music) By now you've probably seen a moto mod in action. It's an accessory that slaps onto the back of a Moto Z smartphone to charge it up or to give it a louder speaker or give it a 360 camera, there's tons of 'em. The Insta-Share Printer works just like most. It's powered by its own internal battery and it incorporates hidden magnets that stick it firmly to the phone's back plate. When the phone detects the mod for the first time, it prompts you to download the Polaroid app to control it. It tells you to load in the special ZINK paper, we'll come back to that, and then you get a quick run-down of how the app works. After you take a snapshot, you can add custom frames, dopey stickers and emoji, and play with the colors until it looks just the way you want it. Then, you hit print. And about 15 seconds later, you've got a little mini picture that you can stick to stuff. Now I'm mainly a digital photo guy, and that's probably true for most of you as well, otherwise (chuckles) the digital revolution that killed Polaroid never would've come about in the first place. But, the resurgence of physical photos is a real thing. For the past few years, I've seen more and more instant cameras at parties. And it's novel, you know, even if you didn't grow up with physical Polaroids, you can see how having an immediate paper copy of a picture is a lot of fun. Now, here's where it gets cool from a geeky perspective. This is a pretty incredible piece of technology. See the ZINK logo down here in the corner? That brand name comes from the fact that this printer uses zero ink. Instead, the magic happens inside the paper, which contains layers of amorpha chromic dyes that start out colorless. When a specific level of heat is applied for a specific length of time, the crystals inside those dyes melt into either cyan, magenta, or yellow. While the printing process might seem kind of pokey at about 15 seconds, it becomes a lot more impressive when you realize that a single 2x3 inch print takes 200 million distinct pulses of heat, arranging from 100 to 200 degrees Celsius. The resulting print is dry to the touch, and even water resistant assuming you'd wipe it off quickly. And the mod's battery lasts for about two packs of print paper before you need to recharge it. As I mentioned before, this technology was actually developed within Polaroid in the 1990s. And when the company's financial troubles started, it spun it off as a separate entity and some of the same folks who developed it, continue to work there today. It's oddly satisfying to see this technology, initially invented inside Polaroid, find itself back inside one of those products again. But, it's important not to expect the quality of the true Polaroid out of this product. The biggest downside I've experienced is reliability. Sometimes the app just doesn't think the mod is connected even when it is, and it takes a few tries to get everything working again. That could be a real pain at a party. The photos it produces don't have a lot of vibrance or contrast either, so right out of the printer, they kinda look like they've been sitting in the sun for a few weeks. Also, because the whole printing process relies on thermal reactions, the mod won't work in temperature extremes, like the 24 degree day we just had here in Cambridge. Some might consider the paper a little pricey. After you blow through the ten pack that comes in the box, you'll pay between 30 and 50 cents a sheet. And, the mod itself is expensive, I think. If you missed the holiday sale for $149, you'll pay $200. I cross-shopped the mod against similar products from Polaroid Print and Fuji Film and I found that prices varied a lot, from 60 bucks all the way up to $200. Now, the advantage to those other printers is that they're universal. You can use them with any Android or iPhone because they connect wirelessly. So, if you don't carry a Moto Z, well your decision (chuckles) is made for you, get one of those. If you do carry a Moto Z though, this is one of those accessories that really validates Motorola's approach to modular phones. It brings a feature you won't use often, but when you do, it saves you from having to buy a whole new camera. A camera that could be worse than what's in the Moto Z series. You don't have to fight with Bluetooth or wait for wireless transfers, you just slap the mod on there, shoot and print, most of the time. And, rather than confine you to new photos, like a stand alone camera would, the mod lets you print any photo you've ever taken or downloaded. Whether that's worth 200 or even 150 bucks, is dicey. Especially given the reliability problems. Once again, I feel like Motorola has missed the mark in pricing here. Frankly, I don't think I'd buy it for myself. But this being the holiday season, I have to admit that, if someone were to buy it for me, I'd end up spending more money on paper and sticking more photos on fridges than I have since college. If you don't have a Moto Z but think you might want one, today's sponsor has the perfect deal for you. That's a link to a Moto Z2 Play for 350 bucks and it was dug up by Thrifter, a new way to save money on everything from gadgets to home goods by shopping based on value, and not hype. Click the link in the description for that sweet deal on my preferred Moto Z, or just to see all the best deals dug up by the talented team at thrifter.com. Until next time folks, thanks for watching. Please subscribe and stay mobile, my friends.",
    "transcript_keywords": [
        "Polaroid",
        "moto",
        "mod",
        "Polaroid Instashare Printer",
        "History lesson",
        "moto mod",
        "inside Polaroid",
        "print",
        "technology",
        "paper",
        "Polaroid Print",
        "photos",
        "start inside Polaroid",
        "Printer",
        "Polaroid Instashare",
        "company called Polaroid",
        "called Polaroid started",
        "inside",
        "Instashare Printer",
        "called Polaroid"
    ],
    "transcript_entity_values": [
        "200",
        "2017",
        "ZINK",
        "up to $200",
        "80 years ago",
        "Mass",
        "60 bucks",
        "a few weeks",
        "150 bucks",
        "ten",
        "Moto",
        "Printer review",
        "Bluetooth",
        "200",
        "a single 2x3 inch",
        "between 30 and 50 cents",
        "Motorola",
        "today",
        "Moto Z",
        "one",
        "first",
        "the past few years",
        "100 to 200 degrees Celsius",
        "about two",
        "two",
        "the holiday season",
        "The Insta-Share Printer",
        "200 million",
        "about 15 seconds later",
        "Thrifter",
        "Polaroid Insta",
        "350 bucks",
        "Polaroid",
        "Cambridge",
        "zero",
        "the next 40 years",
        "24 degree day",
        "MrMobile",
        "the 1990s",
        "Polaroid Print",
        "Fuji Film",
        "about 15 seconds",
        "Android",
        "149"
    ],
    "transcript_entity_types": [
        "MONEY",
        "DATE",
        "ORG",
        "MONEY",
        "DATE",
        "GPE",
        "MONEY",
        "DATE",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "MONEY"
    ]
}