{
    "id": "eZt5DFgwt00",
    "title": "The Shocking Lie Detector",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-12-28T21:38:37Z",
    "video_url": "https://www.youtube.com/watch?v=eZt5DFgwt00",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "lie detector",
        "lie",
        "detector",
        "liar",
        "shock",
        "shocking liar",
        "cool gadgets",
        "game",
        "funny",
        "2017",
        "apple",
        "android",
        "smartphone",
        "iphone",
        "iphone 7",
        "best",
        "futuristic",
        "innovation",
        "new inventions",
        "inventions",
        "iphone 7 plus",
        "new gadgets",
        "invention",
        "amazing inventions",
        "cool technology",
        "crazy",
        "awesome",
        "7 plus",
        "top",
        "does it suck",
        "cool tech",
        "iphone 6",
        "best android",
        "galaxy",
        "google",
        "future technology"
    ],
    "views": 3216488,
    "likes": 62021,
    "comments_count": 3890,
    "description": "Shocking Liar Lie Detector (USA) -  Shocking Liar Lie Detector (International) -   Here's an interesting device... The Shocking Liar claims to be a lie detector. Does it work or is it a lie?  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2iFtz7M",
        "http://geni.us/RntihB",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "This is bad... *Claps hands* *Clears throat* WOOOOO! Ha! You guys can tell that today Is an unusual day and it's probably not gonna be too much fun..... Maybe for you, not for me Definitely not for Tom. 'The Shocking Liar' \"Electric Shock Lie Detector\" 14+ I do not know how this thing works but Apparently if you tell a lie When your hands are strapped down to it It will shock you And there's a number of variable shock controls From low all the way up to High This dude doesn't look happy about it I'm not happy about it I do have to take full responsibility I mean i ordered the thing What does it have here You can see there's a meter on the front Lie on one end and Truth on the other Now i don't know what is it doing Tracking your pulse, maybe? I mean your pulse is gonna be elevated None the less Just because you know the impending doom! It's sitting right there, I don't know.. This thing's creeping me out And why am i doing it? For your entertainment Oo...Alright *Throws box on the floor* So we have some packaging A little bit of paper This is where it says \"We assume no risk if you die\". \"Place your hand on the lie detector in the hand slot, make sure you're making contact with the sensors, strap your hand in place press the reset button, keeping your hands stationary\" Oh my goodness... \"Your questioner can now ask their own questions making sure to push the analyzer button after each question\" *Groans* *In despair* Man.... Look at these metallic- *Groans* ooooooh *Groans even more* *Groaning.......* Oh No.... And on the hand too, the hand is kinda sensitive isn't it? Oh god Is it too late to back out of this? Ya know? This is terrible It has suction cups so you can't get away *Taps* Triple AAA's *Inserts Triple AAA batteries* oooooo *chuckles* That baby booted up It's a cheap little thing, it can't be that sophisticated I'm sure it's pulse related, which means everybody's getting shocked for sure like, can you beat this machine? Will i be the first ever? I don't really-- Ohh Man! *Unwraps straps* *Contemplation* *Yells* WOO! WOOO! What is it about shocks ya know it just makes you You just... It's that weird kind of-- It's not even so much the pain it's the anticipation Also what level should i put it at for pain? or for shock? I'll start low *Calming yet frightful soothing* WOOOO! *Straps on Velcro strap* Okay \"Make sure you're making contact with all the sensors strap your hand in place and press the reset button keeping your hand stationary press the analyzer button the unit will take a reading of your vital statistics for comparison with when you're questioned\" *Anxiety building up* Oh my god the anticipation here. Alright so, 'Reset Analyzer' *Presses the button* *Vibration* *Sound effect* ... \"Your questioner can now ask their own questions Making sure to push the analyzer button after each question the more LEDs that light the more you're moving away from a truthful answer\" ... Woah o.O Okay go ahead... Question: \"Is your name Lewis Hilsenteger?\" Response: Yes, My name is Lewis Hilsenteger. *Presses button* *Sound effect* *Buzzer sound* What the?-- I'm not lying about my own name Did i just get shocked? Was it very subtle because i have it so low? I think i just got shocked but very subtlety because of my low setting. I'm boosting up, i'm boosting it up Going level 2, I'm going to hit it again. *Sound effects* My name is Lewis Hilsenteger *Buzzer Sound* *Pain commences* Woo! Yes! *In pain* AHH! *Inaudible sound* ... Does it just shock you everytime?! No matter what you say? Question: Is December the current month we are in? *Presses button* Response: Yes the month that we're in is December *Machine picking up on the response* *Buzzer sound* *In Pain* AHHH! *Buzzer sound continues* What is this?! This has nothing to do with lying it's just shocking me everytime! *Makes motions with his hand due to feeling* Eww. I better do three, I'm gonna do three next. Question: Do you play Hockey? *Presses button* Response: No i do not play Hockey, Jack ThankYou for asking, never have- *Buzzer sound* *In Pain* GAHHH! ... *Sounds stop* *Inaudible groans* This shocks you everytime! Alright. Do i go all the way to four? I'm gonna go to a four. Question: Is Jack real? *Presses button* Of course Jack is real I mean what would i be talking about if Jack wasn't real? I mean... Jack's gotta be real doesn't he? Who else am i talking to? It's gotta be Jack Why are they making me wait?! *In an immense amount of pain* AHHHH!! *Inaudible* *Groans* Tom, Your up bud. Okay Tom get in there bud. *Tom already feeling regret* *Lewis chuckles* Lewis: Now i can really get this strap on Tom: Man come on *Lewis giggles evilly* Tom: *Chuckles* Man F*ck this thing. *Lewis Laughs hysterically* Look at what Tom is doing for you guys out there Alright? He's doing this so you don't have to. Question: What's your Favorite Movie? *Presses Button* Tom: Uhh, My favorite movie is Dumb and Dumber Lewis: Is that a Truth or a Lie? *Tom get's shocked* AHH GOD! *Lewis laughs at Tom's reaction Tom: Jesus! Question: Are you still a virgin? *Presses button* Tom: No! I'm not a virgin. Lewis: *Sarcastically* Suuure your not. Lewis: Don't you move that hand- Tom: *Moves hand in pain* Tom: AH! God Tom: *Chuckles* Man! Lewis: I'm keeping my damn hand there. Lewis: If i keep it on you gotta keep it on. Tom: Alright Lewis: Deal? *Presses button* *Lewis holds on to the machine in agony* *Immense amount of pain* *Grunts loudly due to pain* *Lewis in a world of hurt*: I'm not moving! Lewis: *Holding it in* GRRRRRRRRRR *Grunts extremely* *Tom laughing at Lewis's reaction*. *Lewis proving that he is strong* Lewis: YEAAAAAAHHH! Tom: Haha Lewis: Get on there Tom. Lewis: Oh man my head feels electric--woah... Tom: F*ck that i don't want to do this Lewis: *Giggles* Go man! *Presses button* Lewis: Don't move that hand! *Lewis Chuckles* *Buzzer sound* *Tom in pain* Lewis: YEEEAAHH! Lewis: There it is Alright listen.. There you have it 'The shocking liar reloaded' It'll shock you everytime Doesn't your head feel a little bit rattled? Tom: Yeah i do feel a little bit of everything Lewis: I don't know--*gets cut off* Lewis: You do feel a little bit of everything *giggles* Tom: Yeah *Tom flaps his hands still having the feeling in his body* *Lewis Laughs* It'll shock you everytime Is it a good time? Definitely, i mean you saw it, this thing is certainly a bunch of laughs, So It did that but the whole lying, truth thing. Maybe my pulse was elevated because of the fact that it was gonna shock me in the first place So, None the less A fun little thing Get this for somebody you hate This is a perfect Christmas Gift right here. ya know? Question: Is this a sponsored video? *Presses button* *Sound effect* ... I guess we will never know...",
    "transcript_keywords": [
        "Lewis",
        "Tom",
        "Presses button",
        "Buzzer sound",
        "Presses",
        "Sound",
        "button",
        "pain",
        "hand",
        "Lewis Hilsenteger",
        "Buzzer",
        "question",
        "Lewis Laughs",
        "Man",
        "Shock",
        "Jack",
        "Lewis chuckles",
        "Alright",
        "Lie",
        "thing"
    ],
    "transcript_entity_values": [
        "Lewis Hilsenteger",
        "Jack",
        "today",
        "first",
        "December the current month",
        "the month",
        "three",
        "four",
        "The Shocking Liar' \"Electric Shock Lie Detector",
        "December",
        "Lewis",
        "Tracking your pulse",
        "a meter",
        "Tom",
        "Jesus",
        "Christmas Gift",
        "2",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL"
    ]
}