{
    "id": "F0UuMv1byJw",
    "title": "Flipper Zero: How far away can I be for it to still unlock the door?",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-09-05T15:00:16Z",
    "video_url": "https://www.youtube.com/watch?v=F0UuMv1byJw",
    "category": "People & Blogs",
    "tags": [
        "flipper zero",
        "flipperzero",
        "bluetooth",
        "nfc",
        "rfid",
        "flipper",
        "hack",
        "hacking",
        "infrared",
        "radio",
        "gpio",
        "tesla",
        "gate opening",
        "key",
        "key fob",
        "key card",
        "credit card nfc",
        "card clone",
        "infared",
        "wifi",
        "scanner",
        "wifi scanner",
        "hackers",
        "ethical hacker",
        "hacker",
        "learn hacking",
        "wifi cracking",
        "lock",
        "lock picking",
        "flipper car",
        "flipper zero cars",
        "lock hack",
        "lock hacking",
        "flipper zero locks",
        "flipper zero lock",
        "kali linux",
        "wifi hacking",
        "wi-fi",
        "wireless security",
        "door",
        "door lock",
        "door key",
        "cc1101",
        "flipper zero cc1101"
    ],
    "views": 559391,
    "likes": 26341,
    "comments_count": 465,
    "description": "To address some of the most common comments on this video:  1) No, this is not my house. It's a well known stately home in the UK. With a bit of OSINT work you'll probably find it.  2) A lot of people seem to have missed the distance mentioned in the video. I don't have exact distances, but safe to say it works at just over 60 meters based on Google measurements. I ran out of space at about 65 meters.  3) My test is definitely not scientific and as some people have pointed out, not perfectly done, but I hope you liked the lasers :)   4) Lots of comments about antenna direction - I know ... but what about the lasers! :)  I'll do some more testing with different antennas and arrangements to show differences and affects (however - some of the results of my tests to date may not be what you expect).  5) The lasers are of course not real, but hopefully made the video more fun.  6) I'm using Sub-GHz signals here. See my previous video for capture and replay at close range. Video here:   7) I'm using a CC1101 Flipper Zero Antenna Module in this demonstration.  Disclaimer: This video is for educational purposes only. I own all equipment used for this demonstration.   #shorts #flipperzero  #flipper",
    "description_links": [
        "https://youtube.com/shorts/uP3QeB9ie6Q?feature=share"
    ],
    "transcript": "I've had a number of people comment on my YouTube videos let's see if I can send unlock signals to a device when I'm very far away. So let's put the Flipper Zero to the test and see how far away I can get before it stops working and unlock signals or lock signals and the light are received by a lock that my daughter's holding over there in the distance. Okay so let's see if we can unlock it from this distance? Unlocked. Okay so that worked go back a bit okay send unlock signal. Unlocked. That worked again. Locked. Okay a few more steps back let's try again. Unlocked. Also unlocked okay a few more steps back okay try again. Unlocked. Again okay this is really really far away and there you go so working from this distance very very far away so I don't know I think that's really good from this distance I can send unlock signals to that lock and it works.",
    "transcript_keywords": [
        "number of people",
        "people comment",
        "YouTube videos",
        "unlock",
        "unlock signals",
        "send unlock",
        "distance",
        "send unlock signals",
        "signals",
        "Unlocked",
        "put the Flipper",
        "send",
        "back",
        "lock",
        "Flipper",
        "number",
        "people",
        "comment",
        "YouTube",
        "videos"
    ],
    "transcript_entity_values": [
        "YouTube",
        "the Flipper Zero"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PRODUCT"
    ]
}