{
    "id": "F1tkifKxFlw",
    "title": "First Unboxing in the NEW Studio! LG CordZero",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-11-08T18:31:06Z",
    "video_url": "https://www.youtube.com/watch?v=F1tkifKxFlw",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "LG CordZero",
        "Vacuum",
        "Best new Vacuums",
        "Vacuum Review"
    ],
    "views": 222817,
    "likes": 7170,
    "comments_count": 465,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I'm so excited because I haven't even told you guys officially yet, but I got a new studio and I'm currently in it. And to go with this new studio, we have a new vacuum. I am so excited about this. So a huge thank you to LG for sponsoring this video. This is LG's Cords Zero All-in-one. This is like a studio warming gift. I'm so excited to unbox this and LG so that they put some items in here in case I needed some extra mess. I think that some of the mess may have spilled out. So good thing, I'm unboxing something that can clean this all up. Let's do just that. God, I'm gonna hurt myself with this one of these days. Oh, there's all kinds of things in here. Oh, so yeah, here it is. The sprinkle container. It's already been emptied and it is everywhere. Oh boy. Oh goodness. We've got some coffee. We've got some cereal. Okay, and we have a T-shirt. We've got some of our messy items. I'm gonna put them over here. Oh, what is this? This is not a toy, and it's for adult use only when launching direct, upward from, oh, I think this is like one of those party poppers. Oh my goodness. (laughing) Let me get this unboxed so I can get this cleaned up. I'll tell you one thing, this sprinkle smell delicious. There's more sprinkles. (upbeat music) Look at this. Oh, this also has a little mop feature. Can't wait to try that out. Oh, I love this color. It's so fancy. Oh, we have a battery. Oh, we actually have two batteries. All right. This is the all-in-one face station. This is what really powers this thing. This will charge it, store it and even empties the bag. So you don't have to empty the vacuum bag yourself. This will do it for you. All right. So I have everything unboxed. Now it's time to set this up because I am starting to freak out a little bit about all these sprinkles everywhere. Oh my goodness. This place is a disaster. Okay. It's all set up. I'm about to clean up my mess, but I wanna walk you guys through some of the features of why this is so cool. This thing can get you up to 120 minutes of clean time. There's two rechargeable batteries. And the best thing is this will auto charge as soon as you dock it to the tower. And not only will it do that, but as soon as you dock it, it will automatically empty the bag. These batteries are removable, and this one is charging. These are easily swappable. And when you dock it, it charges and empties the container. There it goes. (vacuum cleaner beeping buzzing) Emptying! We haven't even cleaned anything yet. Up here is the display. You can start or stop emptying the bag. You can select various modes. This will also show you your battery life. And it'll let you know when you need to replace the bag. And I love it. This is all just a little touch screen. The storage of this thing is awesome because everything is all self-contained. I love that you can put them up right here on the side. We'll definitely go over more about the mopping, but I love that it has its own little home. So on this side, we have the attachment for pet hair and I have a pet, but I think I actually shed more than my pet. Maddie, this is for your hair. And on this side, we have two other attachments for various cleaning situations, and a little cleaning brush. And that's all the storage, easily hidden away. The maintenance is actually really easy, I love that they have removable and washable filters. This does come with an extra one, but I love that I can just wash this out and reuse it. And inside here, this is where all of the debris goes from the vacuum. These are disposable and you can get extra bags, and you won't have to worry about all of the extra mess you can just throw this away. And inside here, we have another air filter. This also can just be washed out and reused. And that's recommended to do once every three months. I think this means I finally get to clean my floors now. Oh, I hate it so much. I hate it so much. It's got to go. It's got to go. I can't wait to clean this up. I've already made quite a mess, but I feel like if I'm gonna do this, I might as well make more of a mess. Look at this. Look at, Maddie please don't eat the cereal. Oh wow. Oh, what we have here, a little bit of pillow stuffing. Basically what it looks like after I brushed my hair because all of my hair just falls out. I'm stressed. This is me stressed. Ready to clean. I also love this extendable handle. I can get an extra nine and a half inches of cleaning length. We've got all of the touch controls here, let's start cleaning. (vacuum cleaner buzzing) Whoa! Oh my. Look at that. We're going to turbo. Wow. (upbeat music) Can we just pause for a second and say, I've been vacuuming this carpet for the past three or four years and it has never looked so clean. Like I'm not even like, this is not even an exaggeration. Like it's, I don't even know, I'm speechless. So this is a compressor feature. This actually lets you double the storage of this tank. Let's keep cleaning. (upbeat music) (vacuum cleaner buzzing) At this point, I'm no longer cleaning for the video and I'm doing this for myself. So there's still like some little sprinkles that are kind of like wedged in between the crevasse here of the carpet. So I'm gonna swap accessories and just really get in there. I also have an ant problem. So I basically have just supplied a buffet for all of the ants that are around here. So I really got to get these cleaned up quickly. I like that I can just swap these accessories so quickly and so easily. We're gonna do some detail work now. (vacuum cleaner buzzing) Look at ant, you see him? Right there. Oh yeah. There's so many just in this little corner. This is really great for some hard to reach areas like behind here. Sprinkles everywhere. (upbeat music) Oh, this is nice. Oh, another ant. Like I'm not even joking, like this ant was carrying a sprinkle. He's taking a sprinkle back to his home. Oh, look at that. This one's cool. (vacuum cleaner buzzing) Oh my gosh. There's a bog up here. Bye-bye. Oh no spider. Oh, for vents. I'm not gonna lie, I've never cleaned a vent before. That's probably not something that I should admit. With this, like it's actually quite easy 'cause I can reach it. So I've done vacuuming, and now I wanna mop, so I'm gonna empty this out to show you guys how awesome this is. The fact that I can just dock it and it empties automatically. (vacuum cleaner buzzing) There it goes. Bye-bye. The bag is emptied now it's time to mop. This is so cool. Fill this up with water. You can choose your water level and you can attach the mops to the bottom. All right, let's fill this up with some water. This is actually the tank. It looks like it's the cover, but no, no, no, surprise, this is the water tank. Then after you get these wet, they just go right onto the bottom. And then you just attach it, like all of the other attachments. Something that happens very often when I'm drinking my drink I... oops. Oops. I think that needs to be mopped up. All right. I've never used a mop like this before. So let's go. Whoa, whoa! Look at this. Okay. Ready? Let's get cleaned up. Oh yeah mop that up. Mop. Clean that up. That's nice. Since I just moved into the studio, I, I also don't wanna admit I've not actually mopped or cleaned the floors yet so. This is the first cleaning. Wow. This is awesome. It like moves the mop for me, like I don't, I'm putting forth zero effort. This looks good. This is nice. I'm having a really good time. Wow. Wow. Now I kind of wanted to put the camera away and like, just really do these entire office. This is so great. I've actually never had an electric mop before. So this is so cool. When I pushed the button, it kind of just like takes off, it like self propels itself. So I don't really have to like put forth much effort to really push it, it just goes. I also liked that it doesn't use a lot of water too, so it's not making these floors like super soppy. So as I was about to end this video I realized I forgot about the party poppers. So I thought what better way to end this video than to celebrate by ruining all of the beautiful work that I just did by opening this thing up. Oh, okay. Hold the top section with your left hand. Hold the bottom section with your right hand, then rotate in the direction of the arrows. I just do it. Yeah, let's celebrate. (pop sound) Oh! Oh! What! Again, a huge thank you to LG for sponsoring this video. You guys are amazing. I will put a link in the description if you guys want to get more information about the LG Cord Zero. This thing is so fine and it's actually made me really happy and excited to clean. With that being said, we have more mess. See you guys in the next video. (upbeat music swelling)",
    "transcript_keywords": [
        "clean",
        "thing",
        "mop",
        "love",
        "mess",
        "Justine",
        "cleaning",
        "guys",
        "bag",
        "cleaned",
        "video",
        "put",
        "studio",
        "excited",
        "extra",
        "wow",
        "water",
        "sprinkle",
        "sprinkles",
        "Hey guys"
    ],
    "transcript_entity_values": [
        "zero",
        "Maddie",
        "up to",
        "Zero",
        "an extra nine and a half inches",
        "second",
        "one",
        "first",
        "LG",
        "the past three or four years",
        "120 minutes",
        "Justine",
        "two",
        "every three months"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "CARDINAL",
        "DATE"
    ]
}