{
    "id": "F27cw2sWHMk",
    "title": "Easy Mode For Modern Retro Gaming - RetroTINK-5X Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-09-10T18:12:48Z",
    "video_url": "https://www.youtube.com/watch?v=F27cw2sWHMk",
    "category": "Science & Technology",
    "tags": [
        "Retrothink",
        "RetroTINK-5X Pro",
        "5X Pro",
        "Retro",
        "Gaming",
        "Consoles",
        "SNES",
        "Genesis",
        "Controllers",
        "SCART",
        "CRT",
        "Television",
        "HDMI",
        "Composite Cable",
        "Audio",
        "Stereo",
        "Upscale",
        "4K",
        "1440p",
        "1080p",
        "Clarity",
        "Sonic",
        "Master Drive",
        "Commodore 64",
        "Performance"
    ],
    "views": 435913,
    "likes": 16712,
    "comments_count": 755,
    "description": "Check out how iFixit can help you restore your devices at:   Trying to hook up a retro console like a Sega Genesis on a modern TV can be tricky as you can't simply hook it up and expect it to work. The RetroTINK-5X Pro makes it extremely easy and it almost feels like you are cheating!  Check out the RetroTINK-5X Pro at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.iFixit.com/LTT",
        "https://lmg.gg/PUwo3",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- It's retro time! The OSSC, the open-source scan converter. This is an amazing device that we took a look at a little while ago. It lets you basically upscale any of your retro consoles, or even retro computers, with so much control that you can basically guarantee that you can get a good signal out of it, regardless as to what display you're looking at. The only problem is this thing gives you a lot of control, for one. That's not necessarily a good thing in all cases. And two, it's lacking some key features. So first of all, yes, it's got SCART, that peritel slash European connector that everybody is so familiar with, and it's got component, and it's got VGA. But that's all it's got. You might notice many consoles actually didn't come with either of those things. In fact, most of them only came with this. Now you can plug these in, but you're not going to get very far. So in order to expand this, you need one of these. It's a core you transcoder. This component here is output that goes into the OSSC and you can then plug in composite and S-Video. So, this is kind of what your OSSC stack has to look like. That's fine. I mean, I obviously went and got one. But there's another way. Enter the RetroTINK 5X-Pro by Mike Chi. This thing, it comes in a very unassuming package. The RetroTINK, for those of you who are not familiar, was a, or is, an upscaler that basically gives you very little control, but at the same time, provides a pretty good upscaler for most things you'd want to plug into it. So it's a very set it and forget it kind of thing. We actually have this here, it's a RAD2X, sent over by Retro Gaming Cables. It uses the same technology as the RetroTINK. So what's special about the 5X-Pro? Let's get into the box and we'll see for ourselves. All right, we've got, I guess this is a sticker and this is a postcard with some setup instructions on it. Yep. The full manual is available online and it is powered off of micro USB. Cool. So it comes in this nice little bag, the unit itself. Oh, let's set this aside for now though and continue our exploration. The controller is interesting. It's actually a standard controller that I think may be also used for stuff like the Roku. It reminds me of a Roku controller. - [Brandon] It's very similar to a Roku. - So let's whack a couple of batteries into that real quick. It's nice and clicky. The OSSC controller, by comparison, is significantly more in-depth, let's just say. We'll get back to that later. For now, we've got a nice braided micro USB cable that can be powered directly off of USB, as you probably can tell. As can these, but these are require two for the price of up-scaling one console. Finally, we've got one of these, it's a SKART to composite slash S-Video adapter. And what's pretty sweet about this is that it's actually got an input and output switcher. So this can be used as either an input or an output. It actually supports a mode where you can actually take a high definition bit of content, say from an Xbox 360 over component and downscale it to 240p. For now, let's get to the main event. And there it is. It's a strange design, actually. There are no feet here. I thought at first I thought these were like mounting points, but no, they're just there. So on the back, we've got micro USB for power, HDMI, left and right audio, component video. The green also acts as a composite in, and S-Video. And on the side here, we've got a SKART connector, just like the OSSC. So on the top here, we've got a menu button, nice and clicky, an option button, nice and clicky, and an input button. Very straightforward. And all of the inputs are labeled here actually, just in case you were wondering about that. So. - [Jono] But what about coaxial? - Do you want to talk about war crimes? (crew laughing) Because if you're talking RF, I mean, that was my childhood, but it was a war crime. With everything in the video, like, smashed into a single wire. It's also got audio. Yeah, it looked real bad. So I was going to take this thing apart. It just snaps together, but I don't really feel confident in snapping it apart. 'Cause I don't know where those snaps are and I don't want to actually snap it. So, I guess now would be a good time to turn it on. But first I need to turn you on to, iFixit and their right to repair movement. iFixit wants to help you join the right to repair movement. They make step-by-step guides that are easy to follow and help you replace integrated batteries and just generally repair your devices. With support for more than 30,000 devices, you can be certain, you'll find something you can give new life. Check out what iFixit can help you repair in the link in the description. All right, so this cable is pretty short. Do you have that thing? - [Crew Member] Yup. - Yeah. Hello? No signal. Is it because it's trying to output a high resolution? So what we just ended up discovering is that it doesn't automatically detect the display's capabilities, or at least if it does, it detected the capture box down there, which is 4K. It doesn't output 4K, but it can output 1440p, which is amazing, But this monitor is 1080p, so this monitor just thought there was no input. So this button up here on the remote, that is the resolution change button. So I can change that as I see fit. There we go. Now that we've got the resolution set, we can go through the rest of the settings. Okay, so this big button is exit OSD. This is scan line strength. This is interpolation mode, which is just sharp or soft. So this H sampling, horizontal sampling, this is something of the RetroTINK's special sauce. It is a little bit soft if you look at the hard edges around pixels. So if we go instead into these modes, we'll see this Genesis slash Saturn mode, which should be much better, but it's currently blurry. (crew laughing) There we go. So that currently blurry bit was the automatic algorithm, trying to figure out what the best settings are for that mode, and it thought that the blurry mode was good. But here we can see that the pixels are basically. It looks like an emulator, it is super sharp. And in order to get that with the OSSC, you need to enter in all the timings manually. Like, I'm talking video nerd stuff, like, analog timings, like, the front porch and back porch, and it's a thing, But you don't have to do it here. And in fact, you can't. Let's keep going through the menu here. So we've got sharp versus soft interpolation. - [Jono] How much of a difference? Like, how much in dollars, for instance? - This is sold for $300 US. - [Jono] Ugh! (both laughing) - This is a little cheaper, but not by a whole lot. We go through the list here. We've got Genesis and Saturn, PS1, N64, Neo Geo, Saturn again for a different resolution, PS1 again for a different resolution, and this NES slash PC engine slash PS1, again for a different resolution. It's got these built in, whereas the OSSC absolutely does not. You had to go and look at them. A guy by the name of FirebrandX has a pretty good repository of those, but you still have to enter it all in manually. - [Jono] Gimmie the RetroTINK! - Jono wants the RetroTINK. So interpolation, that mostly matters with this 1080p mode. So the problem with 1080p is that it doesn't divide equally evenly into 240p, so it needs interpolation. And in this case, what this is doing is the bilinear sharp, or bicubic sharp, that Taran likes to go on about with scaling retro graphics. And what that basically does is it scales up to as many multiples as it can to your monitor's resolution. And then it uses softer scaling for the rest of the way. So it looks sharp while still maintaining the right geometry. It has a slight blur to it compared to a just direct sharp upscale, which you can get with 1440p or 1200p. I prefer the sharp, but if you like soft, go you. For now we'll keep it on sharp. There are scan lines for so many different situations. We've got the standard 25% scan lines. We've got another 50% scan line. You've got a different type of scan line. Yup, those are scan lines. Then we have a slot mask. It doesn't quite look right at that 1080p. And then we have an aperture grill, which looks amazing at 1440p. It doesn't look quite right here, but I can show you that it can. But first there's also another PBM mode that kind of widens the color space a little bit and crushes it. And it's got an LCD filter as well, because I don't know. Oh, right. The LCD filter would be great for a GameCube with a Game Boy player. We'll come back to that. So this is a 1080p mode that basically just chops off a bit of the screen. The reason for that is that that bit of the screen is usually, but not always, the overscan area that may or may not have actually been shown on an original screen back in the day. So you're not losing too much by using this mode, but you do get that perfect scale. 'Cause you can actually get a one-to-one scale up. When you're in this zoomed in mode, you can actually use the up and down arrows on the remote to shift the screen up and down. If, for example, the gain used a little bit more one or the other dimension. So when we go through the scan lines now, the aperture grill looks pretty solid. In fact, I would actually argue, you should turn off the sharpening and go for something a little smoother because that, to my eye, looks pretty close to how old-school graphics looked on an old TV or monitor. It's the same kind of feel, which is interesting. And it's not something you can get with the OSSC. Now what's this triple buffer thing? What that does is it means that resolution changes in a game. Those are instantaneous. That's normally instantaneous on a CRT. And it's instantaneous here, but on an OSSC, it takes a second, which could mean the difference between life and death in the game. If you're like super low on resources. Now, you can use the OSSC's mode, which is just called, I think, what is it? Frame lock, yeah. So this is very similar to the OSSC. It is actually looking at exactly what the console is spitting out line by line. From what I've read, they claim a quarter of a frame of lag in frame lock mode and one and a quarter to one and a half, I think in triple buffer mode. But you get that instantaneous mode switch. Now this option is interesting. It's deinterlacing. The OSSC just had, I think just the straight up bob. So it would like flicker a little bit because the lines would be going up and down, showing each individual field. Whereas motion adaptive interlacing is almost like running at progressive scan. There are artifacts, but it is significantly better. And it of course requires that triple buffer. So having that option is actually amazing for people with pre-HD consoles. So like not 16 bit consoles is like this, but the Dreamcast, the PlayStation 2, the original Xbox. This kind of the interlacing makes it so that even if the game doesn't support progressive scan, it'll look pretty much like progressive scan in most scenarios. Of course, it also has weave, and it has blend, and it has bob. And I'm not sure what linear does, and CRT simulate just kind of, I don't know what that's all about. Oh yeah, it's got a comb filter as well as a notch filter for your composite input. It's not something you need to worry about with component or SKART, or even with, I think, S-Video as well, Colorspace lets you change between full or limited, depending on what your TV supports, which is nice I guess. Low pass filter. Depending on your console, you might want to turn this on at different levels. I feel like mine looks pretty decent with it off. Pre-emphasis filter is kind of interesting because you can actually make it a little bit sharper. And depending on how you do it, it kind of works in the scan line's favor. Oh yeah, and it supports a Sinden Lightgun, if you have one of those. It's got the border built in. This option here is interesting, too. It's 240p downscale. So this is actually just straight up, spitting out 240p to the display. It doesn't look amazing because the display's scaling isn't amazing. It's better than I thought it would be actually. So let's turn off the scan lines here and go for sharp pixels. Let's go ahead and load up Sonic or something. So you can see here, there's some of the picture that's kind of missing down there. Oh yeah, and there's the CRAM dots. That's fun. And there's not really much above that. That's what that's all about. So, to be clear, this clarity is definitely achievable with the OSSC, and in fact I have, but it takes some doing. This is basically fine out of the box. And I mean, even if we were to like pause the game here and change this sampling back to the generic, that still looks real good to me. It's a little soft, but it's actually still really good. So generic 4:3, I think looks pretty good on normal, like in most circumstances. And when you combine it with aperture grill scan lines, it looks pretty amazing. Actually, one thing we can do before we step away from Sega is we can try out what this looks like with good old composite video. What's it look like? Oh my God. So here is a situation, I think, where it might actually be very beneficial to choose that proper scaling. Oh no, that's just bad. So yeah, that's what composite video looks like. Some people might actually enjoy that. I'm not sure that's me. Let's switch over to the Commodore. This looks pretty decent, but it is, well, it's still a bit blurry, and unfortunately there's not a whole lot we can do about that. - [Brandon] Is that Mario? - No, actually, this is not Mario. But it was, you know, pushed against Mario and I think they got sued over it. Anyway, this is The Great Giana Sisters. But yeah, there's no way to get a Commodore 64 mode unless they were to make a Commodore 64 mode. That is not quite right. That's not quite right. Nope. Nope. That's the best you get. But notice how the text up at the top, especially the copyright 1987, it's soft. And unfortunately that's just kind of what you have to live with in this case. And you're kind of hoping that Mike Chi will come along and make something that'll work with your individual console, or computer, or what have you. The OSSC here doesn't have that kind of support, but it does have all of the knobs and dials you need to make your own profiles. For the people who actually care about visual quality, and for the people who actually, I mean, don't want to spend all their time dialing in settings so that they can play their old games. The RetroTINK 5X-Pro is, I would hazard to say, almost perfect. The only thing is if you've got a console or a computer that isn't supported by it directly, you're going to have a suboptimal experience. At least compared to the OSSC. It'll just be a lot easier. Just like it's easy for me to say hey, get subscribed to Short Circuit and make sure you check out where to buy these things, all of them, I guess, down below. Oh yeah, if you want to watch the OSSC video, that'll be linked below as well.",
    "transcript_keywords": [
        "OSSC",
        "mode",
        "scan",
        "scan lines",
        "kind",
        "bit",
        "thing",
        "pretty",
        "good",
        "scan line",
        "sharp",
        "Yeah",
        "lines",
        "resolution",
        "line",
        "RetroTINK",
        "basically",
        "amazing",
        "pretty good",
        "OSSC mode"
    ],
    "transcript_entity_values": [
        "NES",
        "S-Video",
        "the day",
        "SCART",
        "Dreamcast",
        "Mike Chi",
        "VGA",
        "4",
        "one",
        "Genesis",
        "USB",
        "The Great Giana Sisters",
        "the PlayStation 2",
        "Xbox 360",
        "iFixit",
        "CRT",
        "1200p",
        "Taran",
        "Retro Gaming Cables",
        "Roku",
        "64",
        "OSD",
        "second",
        "Commodore",
        "Sonic",
        "Neo Geo",
        "OSSC",
        "Mario",
        "European",
        "RetroTINK",
        "Brandon",
        "first",
        "Saturn",
        "Colorspace",
        "more than 30,000",
        "HDMI",
        "N64",
        "$300 US",
        "two",
        "16",
        "25%",
        "1080p",
        "another 50%",
        "LCD",
        "SKART",
        "a Sinden Lightgun",
        "Sega",
        "Short Circuit",
        "1987",
        "Xbox",
        "GameCube",
        "one and a quarter",
        "240p",
        "a quarter"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "NORP",
        "FAC",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "CARDINAL"
    ]
}