{
    "id": "f3xMRvnQXwk",
    "title": "Samsung Galaxy S8 Hands On: The Infinity Phone",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-03-29T15:01:16Z",
    "video_url": "https://www.youtube.com/watch?v=f3xMRvnQXwk",
    "category": "People & Blogs",
    "tags": [
        "samsung galaxy s8 review",
        "samsung galaxy s8 hands-on",
        "samsung galaxy s8 first impressions",
        "samsung galaxy s8+ review",
        "samsung galaxy s8+ hands-on",
        "samsung galaxy s8+ first impressions",
        "mrmobile",
        "michael fisher",
        "best smartphone 2017",
        "best android phone",
        "best android 2017"
    ],
    "views": 1004038,
    "likes": 17870,
    "comments_count": 2469,
    "description": "How do we leverage intelligence to do something productive and helpful? Thats the question Samsung put to itself when designing the Galaxy S8 and Galaxy S8+, and the result is a device that has the potential to become the best smartphone of 2017. Compared to its forerunners, the Galaxy S8 shows you more, listens better ... and even plays computer. Join MrMobile for more first impressions in the Samsung Galaxy S8 Hands-On / Galaxy S8+ Hands-On, and stay tuned for the Galaxy S8 Review coming soon!   [SUBSCRIBE]     [SPONSOR]   The Samsung Galaxy S8 Hands-On is brought to you by MintSIM, the new choice for high-speed LTE in the US. Head to  and use discount code MRMOBILE20 for 20% off a 6- or 12-month plan!    [ABOUT THE SAMSUNG GALAXY S8 HANDS-ON]  MrMobile's Samsung Galaxy S8 Hands-On/Galaxy S8+ Hands-On was produced following an hour-long hands-on session with a Galaxy S8 review device and a Galaxy S8+ review device at a media briefing hosted by Samsung. The devices were running preproduction software and the Galaxy S8 Hands-On contains no final purchase verdict (which will arrive with the full Galaxy S8 review later in the season).   [CORRECTION]  Testing on a newer review device shows the main sensor to be an IMX333, not the same sensor as last year's (as I was told it was by Samsung in the initial briefing). More on this in the full review. (Thanks to Sammobile for the initial reporting on this.)   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  Lifetime Travels by Cymatix, available at Premium Beat:   Mind in Motion by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mintsim.com",
        "https://www.premiumbeat.com/royalty_free_music/songs/lifetime-travels",
        "https://www.premiumbeat.com/royalty_free_music/songs/mind-in-motion",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Advertiser] How do we leverage intelligence to do something productive and helpful? That's the question Samsung put to itself when designing its next Halo Android Smartphone. And the result is a handheld that shows you more listens better and even plays computer. I'm Mr. Mobile and this is a first look at the Samsung Galaxy S8. Today's video is brought to you by MintSIM. Stick around until the end to learn how to get unlimited calls, text, and 10 gigs of LTE starting at 20 bucks a month. First, let's get physical. If you took last year's Galaxy S7 Edge and the ill-fated Galaxy Note 7 and threw them into a blender, the S8 is what you'd end up with. That's the best news ever if you care about the way your phone looks and feels. In both its sizes and all of its colors, the glass and metal S8 is gorgeous. In the hand, its fully symmetrical design makes it more comfortable to wield than the S7 Edge, and water and dust resistance has made the jump to the newer model too. The displays feature elegantly curved corners, spilling over the edges like an infinity pool, and they come packing the HDR technology that seems to be 2017's big thing. The screens are also bigger this year. 5.8 and 6.2 inches depending on whether you go for the S8 or S8 Plus. Where a six inch phone used to be a very unwieldy thing back in the days of the Nexus 6, Samsung has made it manageable by stretching the display vertically much like LG did with its G6. After several weeks using that phone, the S8 Plus feels pretty natural to me. But its still large by any measure so it's good that you've got the smaller option too. You'll sacrifice battery capacity in the move though. About 15% of it going from S8 Plus to S8. In that case, the wireless charging and fast charging will come in handy. Each of which returns this year. And while we're talking batteries, yes, Samsung made clear that the S8's power pack is subject to the new eight-point safety check devised in the wake of the Note 7. True to form, Samsung's bringing a bevy of new features, so let's hit the highlights. A wide angle front facing camera with auto-focus and face detection which should bump your selfie game. And improved software for blur reduction and low light performance on the main camera, which uses the same sensor as last year. The iris scanner makes a return on the S8, giving you another way to unlock your phone besides the fingerprint reader, which is now inconveniently located just where the leaks foretold immediately alongside the camera. Given that the S8 family represents a total redesign, it's disappointing that Samsung couldn't figure out a better implementation here. Get ready for a lot of smudged lenses and awkward fumbling. In brighter news, the software has gotten a sci-fi style paint job with a new wire frame aesthetic that I really like. The physical home button is gone but its click is not. Tapping the new software home key gets you a haptic buzz and the switch to soft keys mean that finally, finally, you can swap the buttons if you think that back should be on the left which it should, guys. It should. Why am I dwelling on the details? Because these are the things you're going to deal with everyday on the S8. And Samsung's big aspirational features well, it remains to be seen how well they fare. The biggest of these is Bixby, the virtual assistant that Samsung is so serious about that they gave it its own button. If you're wondering why an Android phone that comes with Google's assistant needs another assistant, that's a good question. And Samsung's answer is the same as it always is. This one can do more. In theory, Bixby should be able to field a wider range of commands all throughout the interface. So for example, in the gallery you can say, \"rotate this photo.\" Or, \"send the last picture I took to my mom.\" And it will do it! Samsung says anything you can do by touch, you should be able to do by voice, which is, like a huge promise. AI like this is hard, even for a company like Google, which has access to a much larger pool of user data. And frankly, Samsung's voice command efforts thus far don't give me reason to be optimistic here. Time will tell. And then there's DeX, which basically turns the Galaxy S8 into a faux desktop computer. Assuming you have a spare monitor, keyboard and mouse lying around, and you want to spring for the extra cost of a deck stock. So while it really gets my geek guts going, DeX has some of the same adoption obstacles as Microsoft Continuum. Samsung is a much bigger force in mobile, and it's signed deals with enterprises, Microsoft included to make DeX compatible software. Still, DeX is possibly most valuable as a demonstration of power. Think about it. Now, Samsung gets to say that it has a phone that can become a computer thanks in part to bleeding edge hardware that should satisfy those for home top numbers on a spec sheet are the ultimate validation. But look, Samsung's success with the Galaxy line has always hinged more on the millions of normals who will buy the phones. And the impressions I got from an hour spent with the S8 and the S8 Plus tell me that they're gonna be huge sellers. Sure, you may be able to get phones that do 80% of this for 70% less money, but the hat trick of carrier financing eye grabbing features, and aggressive Samsung advertising, will have these in a lot of pockets in a short amount of time. That's my prediction anyway. No word on exact pricing yet, but here in the US, pre-orders open March 30 for three of the five color options and a targeted April 21 release. I'll have much more on these phones in Mr. Mobile's full review. Please subscribe to the Mr. Mobile on YouTube so you don't miss it. And if you need to save some money ahead of the launch, hit the link in the description to go to my sponsor, MintSIM.com. You can pick a six or 12 month plan and use the discount code mrmobile20, you'll get unlimited talk and text and 10 gigs of LTE per month, for between 20 and 35 dollars per month. MintSIM. Premium quality service on a premium quality network for a fraction of the price. 'til next time, thanks for watching! And stay mobile my friends.",
    "transcript_keywords": [
        "Samsung",
        "Halo Android Smartphone",
        "productive and helpful",
        "leverage intelligence",
        "Samsung Galaxy",
        "Galaxy",
        "phone",
        "question Samsung put",
        "Mobile",
        "Android Smartphone",
        "Halo Android",
        "Samsung put",
        "Samsung made",
        "illfated Galaxy Note",
        "Edge",
        "Galaxy Note",
        "Samsung made clear",
        "year",
        "question Samsung",
        "phones"
    ],
    "transcript_entity_values": [
        "Today",
        "First",
        "2017",
        "eight",
        "LTE",
        "S8 Plus to S8",
        "last year's",
        "the Note 7",
        "between 20 and 35 dollars",
        "Bixby",
        "Time",
        "several weeks",
        "March 30",
        "Samsung",
        "Microsoft",
        "20 bucks",
        "millions",
        "last year",
        "G6",
        "an hour",
        "YouTube",
        "Galaxy Note 7",
        "10",
        "the Galaxy S8",
        "the days",
        "70%",
        "Mobile",
        "this year",
        "April 21",
        "DeX",
        "six or 12 month",
        "US",
        "Galaxy S7 Edge",
        "5.8",
        "six inch",
        "first",
        "About 15%",
        "five",
        "Google",
        "Galaxy",
        "Microsoft Continuum",
        "the S8 Plus",
        "Halo Android Smartphone",
        "Bixby",
        "the S7 Edge",
        "LG",
        "6.2 inches",
        "S8 Plus",
        "three",
        "S8",
        "Android",
        "80%"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "EVENT",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "ORDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "PERSON",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERCENT"
    ]
}