{
    "id": "f5fZ9sW_t-s",
    "title": "Nvidia CES 2022 keynote in 6 minutes: 3090 Ti and $249 RTX 3050",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-01-04T18:39:29Z",
    "video_url": "https://www.youtube.com/watch?v=f5fZ9sW_t-s",
    "category": "Science & Technology",
    "tags": [
        "nvidia",
        "3090 Ti",
        "nvidia stock",
        "nvidia geforce",
        "nvidia rtx",
        "ces",
        "ces 2022",
        "best of ces",
        "best of ces 2022",
        "RTX 3050",
        "GeForce RTX 3090 Ti",
        "g-sync",
        "RTX 3080 Ti",
        "3070 Ti laptop GPUs",
        "AI",
        "autonomous driving",
        "G-Sync monitors",
        "Nvidia GeForce Now cloud gaming",
        "laptops",
        "best laptops",
        "AT&T",
        "AT&T 5G",
        "AT&T Fiber",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 198539,
    "likes": 3728,
    "comments_count": 723,
    "description": "Nvidia just wrapped its address at CES 2022 where it announced a new flagship GPU: the GeForce RTX 3090 Ti. Plus, Nvidias mobile versions of the RTX 3070 Ti and RTX 3080 Ti will appear in laptops starting at $1,499 and $2,499, respectively. Nvidia announced a new $250 entry-level RTX 3050 GPU as well. And AT&T is giving away six months of free GeForce Now cloud gaming service.  Read more here -  Nvidias new $249 RTX 3050 GPU offers ray tracing and DLSS on a budget:   Nvidias new G-Sync monitors let you switch between 1440p and 1080pL:   AT&T is giving away six months of Nvidia GeForce Now cloud gaming service:   Nvidia announces 3080 Ti and 3070 Ti laptop GPUs, says they can control your CPU, too:   Nvidia announces RTX 3090 Ti with faster memory and performance:   Nvidias GeForce Now will be limited to 1080p on Samsung and LG TVs  for now:    Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/32HZwJt",
        "https://bit.ly/3mXAdK5",
        "https://bit.ly/32SLzbo",
        "https://bit.ly/3t2rbQ5",
        "https://bit.ly/3mQEpvh",
        "https://bit.ly/3eNDEP5",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hi, everyone. Happy New Year and welcome to our special event. With billions of devices, unable to play the latest games, it's no surprise that Cloud Gaming, is expected to grow to over 100 million subscribers by 2024. For these gamers, we've built GeForce Now. I'm excited to announce, that Battlefield IV and Battlefield V are available on GFN, starting today. Today we're pleased to announce a partnership with Samsung, to integrate GeForce Now, into their Smart TVs. So we've teamed with AT&T, and their fast reliable 5G network, to bring the power of PC gaming to mobile devices. We also have an exclusive offer to announce. Starting today, AT&T customers with a 5G device on a qualifying plan can get a 6-Month GeForce Now Priority Membership at no charge. Our new RTX 3080 tier of service, powered by the GeForce Now SuperPODS, is the first to support, 120 frames-per-second at 1440p on PCs, up to 1600p on MacBooks, and 4K with HDR on SHIELD TV, available today at just $99 for a 6-Month Membership. Today we are announcing, a new category of Esports displays. 1440p 27-inch G-SYNC, and up to 360 Hz. These displays are also Dual-Format, they can switch to 1080p 25-inch if that's preferred for certain games. - Today, NVIDIA's announcing a new class of 1440p 27-inch G-SYNC Esports displays. These displays feature industry-leading refresh rates, up to 360 Hz, for the smoothest, lowest-latency gaming. Esports-tuned vibrance color profiles, powered by mini-LED backlights and oxide transistors, make targets pop from the screen. And enhanced, easier-to-use reflex analyzer automatically measures system latency, so gamers can head into competition with full confidence in their PC's performance. And if gamers still want to play a match at 1080p, the monitor features a special Dual-Format 25-inch 1080p mode. The future of Esports monitors is here, with new displays available soon, from AOC, ASUS, MSI, and ViewSonic. - Today, we are announcing the RTX 3050. The GeForce RTX 3050, brings the performance and efficiency of the Ampere architecture, to more gamers than ever before. It powers the latest games at over 60 frames-per-second. Based on our Ampere architecture, the 3050 comes equipped with 2nd generation RT Cores, for ray tracing and 3rd generation Tensor Cores, for DLSS and AI. For the first time, you can play ray traced games on a 50-class GPU at over 60 frames-per-second. The RTX 3050, comes equipped with 8 Gigabytes of G6 memory. And starting at just $249, it will be available worldwide on January 27th from all of our partners. Today, we are announcing that NVIDIA Omniverse, is out of beta and generally available to GeForce RTX Studio Creators. Omniverse connects independent 3D design worlds together into a shared virtual space. The connecting language of Omniverse is USD, or Universal Scene Description, which you can think of as the HTML of 3D worlds. Once in Omniverse, an artist can draw on NVIDIA's superpowers, like Physics, which can let artists use true-to-reality simulations that obey the Laws of Physics. And RTX Renderer, to see the scene in real time, fully ray traced or path traced. Omniverse also lets you collaborate with another artist. Changes made by one designer, are reflected back to the other artist. Today, Omniverse is connected to leading applications, like 3DS Max, Maya, Blender, Unreal Engine, and many more to come. We are announcing over 160 new laptops, all built around our RTX 30 Series GPUs. Today we are announcing the RTX 3080 Ti Laptop GPU. Bringing the flagship 80 Ti class of GPUs to laptops for the first time. Featuring 16 Gigabytes, of the fastest GDR6 ever shipped in a laptop. The RTX 3080 Ti, delivers higher performance than the desktop TITAN RTX. RTX 3080 Ti Laptops start at $2499. The RTX 70 family, is our fastest growing class of laptop GPUs. Introducing the RTX 3070 Ti, it's 70% faster than the RTX 2070 Super laptops, and delivers a hundred frames-per-second at 1440p. RTX 3070 Ti laptops start at $1499. And laptops powered by both of these new GPUs, will be available starting February 1st. For creators looking for the best laptop for your work, we are also announcing new NVIDIA Studio Laptops, with the latest RTX GPUs. These laptops are seven times faster, than the newest MacBook Pro 16 in 3D Design. This includes the ultra portable 14 inch thin in light. Perfect for remote workers or students, like the New Razor Blade 14. Dual display laptops for video editors, like the New ASUS Zebook Pro Duo, and the most powerful laptops for creators, like the New MSI Creators Z17, featuring RTX 3080 Ti, but there's one more thing, the RTX 3090 Ti, a monster GPU, 40 shader teraflops, 78 RT teraflops, 320 tensor teraflops, 24 gigabytes of 21 gigabit-per-second, G6X memory, the fastest ever, the RTX 3090 Ti our next BFGPU. Tune in later this month for more details. (upbeat music) - [Announcer] Did you know that white rhinos and black rhinos are both gray?",
    "transcript_keywords": [
        "RTX",
        "today",
        "laptops",
        "GeForce RTX",
        "GeForce RTX Studio",
        "RTX Studio Creators",
        "Omniverse",
        "announcing",
        "latest RTX GPUs",
        "GeForce",
        "RTX GPUs",
        "GPUs",
        "NVIDIA Studio Laptops",
        "NVIDIA",
        "GSYNC Esports displays",
        "RTX Studio",
        "Laptop",
        "Esports displays",
        "displays",
        "RTX Renderer"
    ],
    "transcript_entity_values": [
        "Esports",
        "over 60",
        "5",
        "January 27th",
        "Smart",
        "6-Month",
        "over 160",
        "Maya",
        "the New",
        "3D Design",
        "just $249",
        "3050",
        "RT Cores",
        "3080",
        "MSI",
        "50",
        "2nd",
        "the Laws of Physics",
        "78",
        "24 gigabytes",
        "1600p",
        "1080p 25-inch",
        "GeForce Now SuperPODS",
        "2499",
        "Omniverse",
        "a hundred",
        "1440p 27-inch",
        "GPU",
        "25-inch 1080p",
        "ASUS",
        "G6",
        "GeForce",
        "MacBook Pro 16",
        "27-inch",
        "6-Month Membership",
        "DLSS and AI",
        "Samsung",
        "3050",
        "Blender",
        "70%",
        "2070",
        "ViewSonic",
        "USD",
        "Universal Scene Description",
        "70",
        "8 Gigabytes",
        "later this month",
        "SHIELD TV",
        "first",
        "Ampere",
        "Cloud Gaming",
        "40",
        "Today",
        "320",
        "the New MSI Creators Z17",
        "Tensor Cores",
        "MacBooks",
        "AT&T",
        "30",
        "AOC",
        "NVIDIA Omniverse",
        "1080p",
        "GeForce Now",
        "Battlefield IV",
        "G-SYNC Esports",
        "2024",
        "4",
        "3rd",
        "21",
        "billions",
        "GeForce Now Priority Membership",
        "over 100 million",
        "NVIDIA Studio Laptops",
        "one",
        "80",
        "Physics",
        "16 Gigabytes",
        "14",
        "today",
        "3080 Ti",
        "120",
        "up to 360 Hz",
        "3090",
        "1499",
        "New Year",
        "14 inch",
        "just $99",
        "February 1st",
        "NVIDIA",
        "Max",
        "seven"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "LAW",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "EVENT",
        "QUANTITY",
        "MONEY",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}