{
    "id": "F6Gi2LcXhxM",
    "title": "Mac Gaming Sucks...but that's CHANGING! - Apple Game Porting Toolkit",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-06-12T16:08:09Z",
    "video_url": "https://www.youtube.com/watch?v=F6Gi2LcXhxM",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "mac",
        "gaming",
        "games",
        "gamer",
        "game",
        "mac studio",
        "m1",
        "apple silicon",
        "m1 ultra",
        "porting",
        "port",
        "toolkit",
        "tool kit",
        "tool",
        "kit",
        "apple game porting toolkit",
        "gpt",
        "game porting toolkit",
        "performance",
        "fps",
        "speed",
        "frames per second",
        "proton",
        "valve",
        "wine",
        "crossover",
        "codeweavers",
        "linux",
        "macos",
        "sonoma",
        "beta",
        "developer",
        "developers"
    ],
    "views": 1448405,
    "likes": 58123,
    "comments_count": 9216,
    "description": "Thanks to Micro Center for sponsoring this video! Check out their New Customer Exclusive - $25 Off Your Purchase of $100 or More:   All Customers can sign up and receive a 128gb flash drive at the Indianapolis store opening event later this summer:   Create your build at   Mac gamers rejoice! Apples Game Porting Toolkit is here to bring mainstream games to the masses. How does it perform, whats its compatibility like, and what can we expect from developers?  Discuss on the forum:   Buy an Apple Mac Studio with M1 Ultra:   Purchases made through some store links may provide some compensation to Linus Media Group.    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:49 Setup and initial impressions 3:03 Wine under the hood, just like Proton 4:00 What else works? Compatibility is complicated... 5:46 Some games work surprisingly well, but... 6:59 Pros and cons of \"not emulation\" 7:50 Anti-cheat probably won't work if you try it 9:03 Wherein Linus does pot on screen 10:14 It's not as robust as Proton 11:40 Apple has historically ignored gaming 12:32 Mac Native vs Game Porting Toolkit 13:44 Conclusion - Apple NEEDS to support this",
    "description_links": [
        "https://micro.center/wvi",
        "https://micro.center/7b9",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1512599-apple%E2%80%99s-game-porting-toolkit-%E2%80%93-a-pc-gamer%E2%80%99s-perspective/",
        "https://geni.us/PB1pPjv",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- This is a gaming PC and I'm not talking about the slow trickle of afterthought releases that make PC ports look good by comparison, thanks to Apple's new Game Porting Toolkit not only will the process of porting games to Mac be much simpler for developers but gamers can play PC games today, right now on Apple Silicon Macs. Who'd have thought it, after all these years of giving zero cares whatsoever about gamers, is Apple finally bringing the fight to Microsoft and gaming? Is it any good? Am I about to make the switch to talking about our sponsor? Build Redux, is building a PC not in your wheelhouse? No problem, let the experts at Build Redux help you out. Just pick the parts and they'll do all the hard work. Check them out at the link down below. Our setup, which Emily is just putting the finishing touches on right now, is an M1 Ultra Mac Studio with 128 gigs of unified memory. We're running Mac OS Sonoma which works best with the Game Porting Toolkit right now. And we actually need to use two versions of Steam. The Mac native one and the Windows one, Mac version is easy. That's it, theoretically, this is working now but the Windows version of Steam must be run from the command line for reasons that we're gonna get into in a bit more detail later. Of course, there's no window snapping on Mac because why would there be? You can just pay for that if you want it. - You can, it's a nice app. - You know what? It doesn't matter. The point is we're gonna try some games. Cyberpunk-e. - Cyberpunk-y. - Yeah, Cyberpunk. - [Emily] Hey - Hey, whoa, okay. I know you did most of the work before I came here and obviously it's not that easy, but like it's working. - It would've been more easy if the gooey method worked but it should be much easier in the future. - Instructions say adjust graphic settings and resolution and see what happens to frame rate. I see. - [Emily] Looks like right now we're at about 20. - Let's go to something more reasonable, medium. Is this likely to actually complete or are you just trolling me? - Well, I mean there's only one way to find out. I mean, if you hit the space bar, it might proceed. - One way to find out is to ask you if you're just trolling me, oh, it's running on 11 FPS. It does not look great. - Well, I mean it looks okay as long as you only look at like still frames. - Uh-huh, yeah, the still frames don't look great. - Well, you're at 720P. You could boost the resolution. - I mean, I could, wait. It's not running any worse. The truth is I'm kind of speechless right now. It's not perfect. The performance obviously sucks and at times, Steam and or the game might crash or become unresponsive. But this is still amazing and there are workarounds. If you do experience a crash, just open the activity monitor, search for wine, select all processes, then click the arrows in the top right and click force quit. Wait a second, wine, how does a piece of Linux software that is not an emulator figure into all of this? Here's the thing. Game Porting Toolkit is essentially a distribution of code weavers crossover flavor of wine with what appears to be the DXVK translation layer for direct X9 through 11. And then Apple's own homespun D3D metal translation wrapper for direct X12, which isn't without controversy. The thing is, Apple has a history of using open source tools to enrich their own proprietary solutions, like CUPS for printing and the KHTML browser engine that became Safari's web kit and ultimately, Chrome. And like these other situations, Game Porting Toolkit is perfectly legal but is understandably rubbing some members of the open source community the wrong way, given both Apple's restrictive licensing agreement for the toolkit and their historically narrow contributions back to open source software. Now my notes here only say move on at your discretion. Of the nine games installed, five of them work - Correct. - I wanna play Civ, oh. Fine, how about Hollow Night? - [Emily] Let's go Hollow night. - What are the controls for this game on a keyboard and mouse? I truthfully have no idea. Holy crap, this is running at 60 FPS and actually feels, I mean I suck, but other than that, it feels fine. - [Emily] Input lag? - Hard to say. Even though this is a bit of a twitchy game, I find it kind of forgiving in terms of input lag. I didn't have trouble playing it on the Logitech G-Cloud for example, it seems pretty good. I would say it seems pretty darn good. - [Emily] I mean, it seems like from the sound to what I'm seeing on screen, it seems pretty decent. Like maybe there's a little bit, but- - It's definitely usable. Compatibility is a mixed bag then, which makes sense given the similarity to valve's proton compatibility layer for Linux and also makes sense considering the extra step that's going on here of running through the Rosetta translation layer, which handles running X86 code on Apple Silicon. And unlike Proton, very few support packages are installed by default, which can make things problematic if you're trying to use it like Proton. It's also worth noting that while D3D metal is closed source, Crossover is gaining support for Direct X12 this year too. So Game Porting Toolkit might not be the only option for gamers on Mac, but of course, it's not really intended to be. Let's go F1, let's go. Oh, your version of Windows is older than the minimum version required. Yes, I wish to continue. Oh. - We're sorry, but you can't - There is no freaking way that Halo Infinite runs. - I mean, you're not currently running Halo Infinite, you're running- - I'm not running Halo Infinite 'cause I don't think that's gonna run. I'm trying to find ones that will run. Hey, I think I found one. The last Total War game I played was Rome Total War. - The remake or the original? - The original. Hey, this is running. Oh my God. Oh my God. Okay, let's go Gamers. Oh crap, well, I suck. This overlay in the corner here shows us how much performance we're leaving on the table. Q2 translation layers and not emulation. It's a lot, we're using about 20% of our GPU right now and Apple knows that. But that's okay because the general idea behind this tool and Apple was very clear about it, is that a developer using a common framework like Unity or Unreal Engine can simply compile a Mac version of their software without having to rewrite the graphics, audio or input routines that they've already written for Windows. They're not supposed to just use it like this and all of that sounds great, but as we know, it's not always that simple in the real world. Before we talk about that though, let's discuss the advantages of this approach with the biggest one being the, it just works simplicity but unfortunately that's about it. I mean, in theory it does make it easier to create a native version of your game as well, but if the way things are going on Linux is anything to go by, the translation layer forever approach is the more likely outcome. So then let's talk about the drawbacks of that. The first is that performance should in theory be pretty close to Proton on Linux. So usually worse than Windows though, sometimes equal or even better. And the second is that if developers are not motivated to create true native ports, this compatibility and performance is always going to be behind. And by more than non-gamer Apple executives probably realize, the thing is, even a compatible game might have dependencies that are not created by the developer. Like say for example, anti cheat, the developers of which have very little incentive to port their software to these rando, not properly supported platforms. Let's see if we can find one like that. Like say Halo Infinite. Yeah, okay, that didn't take long. See you later buddy. I mean, I don't actually know that that's because of anti cheat but it almost certainly isn't helping. But you told me there was an anti cheat one that you did manage to get working and I assume it's this because this is all that's left. - Yes. Elden Ring is the only one that I got to work with anti cheat. So the idea behind it though is that instead of doing anything special, what you do is you rename the anti cheat executable 'cause it starts up and then scans things. - Yeah. - And then it launches the game. You rename that executable, then you rename the games executable to that executables name. So then Steam just launches the game. The problem is that from there, you don't have any online support whatsoever. - Does that matter in Elden Ring? - I mean it depends on how you play the game. - [David] In Elden Ring, you need online. - You do? - [David] There's actually quite a bit of multiplayer in Elden Ring. - Or you could just not do that. Wow. Oh wait. Oh, okay, no, no, that worked. I swear the first time I whacked one of those pots, there was a delayed reaction for it to crumble. - [Emily] It might have been shader compilation. - That makes sense. Okay, that wasn't on me. I had that lined up, I swear it. Do you see that? - I can't really see much. - Just, no, don't lie, you saw that - From this angle, all I see is just a bunch of gray blobs. - No, I, editor help me out here. I was lined up with the big one. - I have no idea what you're talking about. Oh, hey, did you notice the FPS rose? - No. - [Emily] It was at like 15 now it's like 37. - What? Shut up. That can't be running at 37 FPS. Ooh, no way. Elden Ring's actually running kind of okay. - [Emily] I guess it needed to warm up the shaders. - Interesting, 30 FPS Elden Ring. I mean at what resolution though? 1080p, maximum. And we got those results with the GPU at 20% and before even hydrating with this water bottle from lttstore.com, it's empty, whatever, doesn't matter. The point is, it's a very mixed bag and not everyone wants to just buy and try random games and there's no proton DB for Mac yet. But what there is is a community curated Google sheet that is full of lots of interesting nuggets. Here are some interesting ones. Halo Infinite crashed on the crossover wine that is used in GPT. And I don't mean ChatGPT, I mean Game Porting Toolkit, but it works with Proton. And given its anti cheat and Microsoft account dependencies, I suspect that that's only the case because Valve had to do some special sauce to get that working and I have to say, I wonder if Apple will be willing to put in the work, probably not, given that their stated purpose is for developers to be the one to do the work. How optimistic, more on that later. Also, any game that requires AVX or AVX two instructions will fail. Apple Silicon doesn't support it and neither does their Rosetta translation layer. VSync also appears to be enforced by the compositor regardless of the in-game settings. So you will only ever get your displays refresh rate in FPS. Also getting it to work is a pain, involving terminal commands and the X86 version of Homebrew. Isaac Marovitz, the person who posted the infamous video running Cyberpunk on a Mac, modified his Whisky app to support the Game Porting Toolkit. But the most recent version as of us recording this doesn't work, though, I suspect by the time we released this video, it will be patched, so keep an eye on that. Back to that developer conversation, though, Apple's gonna have to support and promote this tool heavily to overcome their reputation among game developers. They have a long history of ignoring the gaming industry, dating back to Steve Jobs, according to programming legend John Carmack and Gabe Newell of Valve claimed that Apple kept coming to them talking about supporting games but just nothing would ever come of it. And so far, no major developers that I could find have publicly expressed support besides Hideo Kojima, who Apple had present during their WWDC 2023 Keynote where the Game Porting Toolkit was announced. Some high profile releases have been coming to Mac recently like Resident Evil Village and No Man Sky. And there are some Mac native games. In fact, we've got a couple of them installed. So I guess the question that this raises now is, if all went according to plan, what kind of performance improvements might we see? We don't get an FPS counter but I'm expecting the performance to be markedly better than when we were running with the translation layer. - [Emily] And it looks like weird camera bug aside, it looks like it's a lot smoother. - [Emily] Oh, yeah, the performance is way better. - Like even if it's just 60 versus 60, the frame pacing is a lot better. - [Linus] Yeah. - [Emily] Right here, you can tell. - Much better and the latency is markedly better as well. Okay, I'm gonna win this fight this time though. - [Emily] Oh, come on, we have more stuff to shoot today. - That's true, okay, I don't have time to win this fight but I do have time to talk about the different kinds of native games that run on macOS. Total War is running on arm, but uses Rosetta for some of the multiplayer, whereas Shadow of the Tomb Raider actually uses Rosetta for the port. So from a CPU standpoint, it's actually using the same tools that is Rosetta as the Game Porting Toolkit. The difference then would be- - Basically this is running bare metal, ha ha. - Ha ha, using the metal API. - Whereas the Game Porting Toolkit version would be using D3D metal, the translation layer. - So that gives us some idea of how much we're losing to the translation layer. Yeah, it's a lot worse than running on metal API but that shouldn't matter because if Apple can stop paying lip service to gaming and actually throw their hat into the ring, the Game Porting Toolkit could be a game changer in the way that they're presenting it, as it is right now, though, it's a curiosity at best for end users and time will tell if this is actually a useful tool that will motivate developers to port their games natively, which is yeah, gonna be necessary for a good experience. Just like this good experience telling you about our sponsor - Micro Center, this summer., Micro Center's opening their first store in eight years in Indianapolis with two more stores set to open by 2025. They're so excited about the opening that you can receive a free 128 gig flash drive just for stopping by. And if you sign up for an account as a new customer, you can receive $25 off your next in-store purchase of any products totaling a hundred dollars or more. Christmas is starting way earlier this year. Not gonna make it to Indianapolis? June is all about Micro Center's laptop savings event with absolutely crazy deals all month long on all kinds of laptops. Whether it's your next gaming laptop or just something you need for traveling, you know, you just, you can even use their online PC builder tool to ensure compatibility and get your parts in store in just 18 minutes. And if you're proud of your build, submit it to their build show showcase to receive a coupon for your next in-store purchase. With over 25 stores across the us Micro Center offers the best selection and prices on laptops, computer components, monitors, TVs networking equipment and more. And if you need service and repairs, they have a dedicated department for that. So visit Micro Center today or click the link below to learn more. - If you guys enjoyed this video, why not check out our gaming on Linux challenge series? Maybe someday I'll be revisiting it with a Mac. I wouldn't hold my breath though.",
    "transcript_keywords": [
        "Game Porting Toolkit",
        "Game Porting",
        "Porting Toolkit",
        "Game",
        "Apple",
        "Mac",
        "Porting",
        "Toolkit",
        "games",
        "running",
        "Apple Silicon Macs",
        "Elden Ring",
        "Halo Infinite",
        "Porting Toolkit version",
        "Micro Center",
        "Apple Silicon",
        "running Halo Infinite",
        "Mac native games",
        "translation layer",
        "FPS"
    ],
    "transcript_entity_values": [
        "nine",
        "Resident Evil Village",
        "37",
        "Valve",
        "One",
        "zero",
        "a hundred dollars",
        "GPU",
        "37",
        "11",
        "X12",
        "Mac",
        "- Micro Center",
        "FPS",
        "the us Micro Center",
        "Game Porting Toolkit",
        "AVX",
        "Chrome",
        "Q2",
        "only one",
        "Linux",
        "Microsoft",
        "Mac OS Sonoma",
        "Elden Ring",
        "Cyberpunk on a Mac",
        "Hollow",
        "Homebrew",
        "Apple",
        "first",
        "25",
        "WWDC 2023",
        "Steve Jobs",
        "Christmas",
        "over 25",
        "John Carmack",
        "D3D",
        "DXVK",
        "about 20%",
        "Mac",
        "Apple Silicon Macs",
        "Direct X12",
        "Rosetta",
        "earlier this year",
        "CPU",
        "the Game Porting Toolkit",
        "2025",
        "Gabe Newell",
        "60",
        "Micro Center",
        "about 20",
        "Indianapolis",
        "Hideo Kojima",
        "Hollow Night",
        "Redux",
        "Windows",
        "Apple Silicon",
        "GPT",
        "Google",
        "Halo Infinite",
        "Emily",
        "X9",
        "KHTML",
        "just 18 minutes",
        "five",
        "Isaac Marovitz",
        "30",
        "this summer",
        "Rome Total War",
        "20%",
        "Safari",
        "Build Redux",
        "Micro Center's",
        "the Game Porting Toolkit",
        "60 FPS",
        "Linux",
        "Shadow",
        "two",
        "eight years",
        "API",
        "month",
        "Game Porting Toolkit",
        "VSync",
        "Elden Ring",
        "second",
        "128",
        "Halo Infinite",
        "Steam",
        "Cyberpunk-e. - Cyberpunk-y. - Yeah",
        "720P.",
        "June",
        "today",
        "Logitech G-Cloud",
        "Windows",
        "just 60",
        "Elden Ring's",
        "Linux",
        "Rosetta",
        "F1",
        "this year"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "MONEY",
        "EVENT",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "NORP",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "EVENT",
        "PERCENT",
        "ORG",
        "FAC",
        "ORG",
        "EVENT",
        "QUANTITY",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PRODUCT",
        "PERSON",
        "DATE"
    ]
}