{
    "id": "F8i8pnZmk50",
    "title": "iPhone 8 vs 8 Plus Unboxing & Comparison!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-09-19T11:00:10Z",
    "video_url": "https://www.youtube.com/watch?v=F8i8pnZmk50",
    "category": "Science & Technology",
    "tags": [
        "iPhone 8",
        "iPhone 8 Plus",
        "iPhone 8 Unboxing",
        "iPhone 8 Review",
        "iPhone 8 vs 8 Plus",
        "unboxing",
        "review",
        "apple",
        "2017",
        "iphone x",
        "iphone 8",
        "iphone",
        "iphone x review",
        "iphone x vs iphone 8",
        "iphone x hands on",
        "apple iphone x",
        "iphone 8 plus",
        "apple iphone 8",
        "iphone 8 hands on",
        "iphone 8 camera",
        "8 plus",
        "iphone 10",
        "iphone 8 release date",
        "iphone 2017",
        "iPhone 8 vs Galaxy S8",
        "ios 11",
        "tld",
        "jonathan morrison",
        "iphone x vs 8",
        "iphone x unboxing"
    ],
    "views": 3719084,
    "likes": 71209,
    "comments_count": 6680,
    "description": "iPhone 8 vs iPhone 8 Plus Unboxing, Hands on + Comparison! Review coming soon! Check out 23andme:    The iPhone 8 & 8 Plus feature Apple's A11 Bionic Chip, Wireless Charging, Improved cameras (dual camera + portrait mode on the 8 plus), iOS 11 and more!  Intro track - Stories by Sam Berson    iPhone X vs iPhone 8 / 8 Plus!  iPhone X Hands on!   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "http://www.23andme.com/JonathanMorrison",
        "https://open.spotify.com/track/4ie9jvxLckLPCgf6pRWn1C?si=a7UN9WjR",
        "https://youtu.be/qSIsMqSoRNs",
        "https://youtu.be/1L7JFN7tQLs",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- (Jonathan) Yo guys, Jonathan here, it is early morning here on the west coast, but I think it's only fitting because today is what I would call a good day. Not only am I checking out the brand new iPhone 8, but the 8 Plus as well, gonna see what's new and ultimately how they stack up side-by-side. (upbeat music) And before I hop in, what would an unboxing be without a giveaway, so if you're excited for that, let me know by droppin' a like down below, queue shout out to 23andMe, where you can discover more about yourself through DNA for sponsoring this unboxing and giveaway. Because of that, you have a chance to win either an iPhone 8 or 8 Plus, the choice is yours. Definitely make sure you're subscribed. For the complete details on how to win, check out the link below. Now I'm sure most of you out there have seen an iPhone unboxing or two, but if you haven't, and this is your first time, I'm gonna throw a virtual high five your way, and we're gonna experience this together. Inside the box you have the USB wall charger and Lightning cable, a wired pair of Lightning ear pods, not air pods, I am super used to sayin' that by now. And just in case Lightning ear pods aren't your thing, on the flip side, you do get a Lightning 3.5 mm audio adapter so you can use any pair of headphones. So now that we've got the accessories out of the way, we are here for what we all came for, the iPhone 8 and the 8 Plus. This here is the gold iPhone 8 Plus, along with the silver iPhone 8, and I gotta say, between all the colors across the board, including the iPhone 10, I think the gold is my favorite by far. Somethin' about it that just screams classy, and I think the word that comes to mind with the gold iPhone is creamy, and because of that, I can't help but think these would look perfect next to a pair of cream Yeezys. Now there's no denying design wise, this is very similar to the iPhone 6, the 6s and the 7, but once you stack them side-by-side, you can start to see the evolution of how things change, plus there's just something about that glass back that changes out the look and feel that has me excited again, and honestly excluding the iPhone 10, I think this is maybe the best looking iPhone since the iPhone 4 and 4s. Beyond that, the glass back isn't just for looks, it also brings for the first time ever, wireless charging to the iPhone. For you there, this is not me trying to say Apple revolutionized or invented wireless charging, in fact, Apple opted to go with the wireless Qi standard, and not some crazy, proprietary Apple nonsense, and that is absolutely a good thing for everybody. One, it is going to increase the number of wireless charging products out there, and two, definitely make it more widespread across the platform as a whole. Now stackin' up the 8 and 8 Plus side-by-side, regardless of the size difference, you are getting the exact same A11 bionic processor inside both these phones. In fact, that is the exact same chip found in the iPhone 10. So just in case the iPhone 8 or 8 Plus is more your thing, maybe you're not ready to give up that home button, it's nice to know you're not sacrificing performance across any of these. Now if those are simply just numbers to you, and it doesn't mean anything, to put things into perspective, that is on par with a 13\" MacBook Pro, which is nuts to think about. Because of that, I am definitely gonna see how it stacks up side-by-side against that MacBook Pro, a Galaxy S8, and if there's anything you wanna see it compared to side-by-side, let me know with a comment down below. Now as far as the displays go, while size or the resolution hasn't changed on these phones, what's new is True Tone Display. It's a little hard to show off through video, I think I have an idea of how to do it, it's just gonna take a little bit longer, so stay tuned for my full review. But essentially it is this realtime adaptive white balance for your display, so no matter what the lighting conditions are, you're gonna have a better representation of what those colors are. So again, while the screen size or resolution hasn't changed, the iPhone 8 features a 4.7\" display with a resolution of 1334 x 750, whereas the iPhone 8 Plus is a 5.5\" display with a 1920 x 1080p display. Now as far as what that extra screen real estate equates to, take a look at 23andMe.com. You can see on the iPhone 8 Plus, we see two entire sections, whereas on the iPhone 8, we would clearly have to scroll up. From there, jumpin' into their Neanderthal ancestry section, and yes, if you've ever wondered to yourself how much Neanderthal DNA is part of me, that is somethin' they offer. But regardless, on the iPhone 8 Plus, you can see every single paragraph, where on the iPhone 8, you would clearly have to scroll down. Also, for reference, we know Austin Evans is jacked as hell and seein' those biceps on a bigger 5.5\" display is a beautiful thing. Now from there, one big difference between the iPhone 8 Plus and 8 has got to be battery life. With the iPhone 8, you can pretty much expect that you're gonna have to plug in at least once throughout the day, whereas with the iPhone 8 Plus, that's gonna get you for sure a couple more hours, more than likely last you throughout the entire day. From there, both the iPhone 8 and 8 Plus feature improved cameras, clearly the biggest difference is going to be the dual camera setup on the iPhone 8 Plus, so I'm gonna start with something they both share, and it's video. Both of these phones will shoot video up to 4k resolution at 60 frames per second, which is actually kind of crazy, not many phones or even cameras out there do that right now. This video was shot in 24 frames per second, so I can't show off the 60 fps here, but if you wanna see a full 4k 60 fps demo on the iPhone, let me know and I will get that out for you guys. Speaking of 24 frames per second though, there is now an option to shoot 24 fps on the iPhones, you're not gonna have to download an additional app, you can do it straight from iOS. The other really impressive thing on both these phones is 240 fps slow motion video at 1080p. Here is a quick test of Rich doin' some majestic jumps, and the more impressive thing for me here is actually lighting here wasn't that optimal. It was getting closer to dark, so there wasn't a ton of light, but it still performed really well. I'm definitely gonna be doing some more tests both on the 4k 60 side, and the 240 fps slow motion, but regardless, initial impressions on the iPhone 8 and 8 Plus, this is one of the most underrated features. From there, jumpin' into picture quality, this was shot on the iPhone 8 Plus, but it's using the main wide angle lens, so it's something you can expect the exact same results on the iPhone 8 as well. Same thing here as well, and I love this picture here because of the dynamic range. Everything is sharp, we don't lose the dark areas, you can see how the color of those bike racks pop, and lastly, the sky. We can see the blue, we can see the clouds, and nothing is blown out. Now from there, jumpin' into more of a lower light situation, this was one of my favorite shots. Everything holds together really nicely, even though it was getting dark. I particularly like the roll off here, straight from the camera and no artificial depth added at all. From there, this is pretty much right after sunset, so it's getting pretty dark here, and yeah, you can definitely see a little bit of noise towards the street on the bottom side of the picture, but it's nice to retain both the shadows, the sky, you can really see that orange, and overall I really like this picture. Now as far as what advantage that dual camera on the iPhone 8 Plus get you over the 8, here is a shot on the wide angle lens on the iPhone 8 Plus, and then here is another shot using the telephoto lens at the exact same distance apart. We then of course have portrait mode, which is by far one of the best and most enticing features of the 7 Plus, and it is no different here with the 8 Plus. What's also cool with the iPhone 8 Plus beyond portrait mode is what Apple is calling portrait lighting, which is really kind of crazy. What it is essentially, is it allows you to manipulate different lighting environments through both hardware and software. I've talked about this before, but what's awesome is you can do this both while you're taking the photo, or even adjust it after if you didn't take it in the first place. So I think as good as portrait mode was on the iPhone 7 Plus, with the improved optics, and of course portrait lighting, not only is it more fun, not only do you have more flexibility, it's just a better experience overall. From there, jumping over to a front facing selfie test, this was shot on the iPhone 8 Plus, but again, because the front facing cameras are the same, you can expect the exact same shot on the iPhone 8 as well. Here we have one more selfie for good measure, and it's kind of perfect with 23andMe.com sponsoring this video, because I've often got asked what ethnicity I am. I know for sure I'm part Hispanic, part white, with a little bit of Irish, but beyond that, I have no idea. So with that I sent off the 23andMe kit, which should give me a full breakdown of everything I am. It's a little scary, but also really exciting to think about, so if that's something you wanna check out, or something you've been curious about, make sure you check out the link below for full details and also stay tuned for a future video where I find out exactly what I am. So nothing new here, but of course the iPhone 8 and 8 Plus are still IP67 and water resistant, and I think that means we gotta test that out. So into the water we go. (water gurgles on mic) (water gurgles on mic) Looks good, it's clean, it's still recording, and I'm also curious to see, this is also a pretty good low light test, it's about 7:15, the light is gettin' sucked away pretty quick, so let me know what you think of the quality with a comment down below. Next from there, kind of utilizing both the cameras and the processing power of the iPhone 8 and 8 Plus, this was really kind of my first time to truly play with AR. I got a chance to mess around with Sky Guide, which is kind of amazing. It utilizes a compass with the cameras and augmented reality to give you this realtime look into the sky. It is kind of crazy. I think by far the most impressive thing for me wasn't how fast, or how instant everything was, it was the fact that it could react and adapt to your environment in realtime. So if you notice, if you look behind the tree, the text is actually sitting behind there, which is bonkers. So all in all, while I think the iPhone 10 is definitely the phone most people are waitin' for, the iPhone 8 and 8 Plus still have a lot of really attractive features. You saw the power of the performance, the cameras, you have water resistance, wireless charging, and maybe you're not ready to give up that home button, that is something that is still here and readily available on the iPhone 8 and 8 Plus. Definitely gonna spend some more time with it, so if you have any questions, or other features you want covered more extensively, let me know with a comment down below. Aside from that, thank you guys very much for watching, this is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "iPhone",
        "thing",
        "gold iPhone",
        "Lightning",
        "Display",
        "video",
        "kind",
        "cameras",
        "shot",
        "iPhone unboxing",
        "Apple",
        "west coast",
        "early morning",
        "fitting because today",
        "good",
        "Lightning ear pods",
        "wireless charging",
        "sidebyside",
        "wireless",
        "Lightning ear"
    ],
    "transcript_entity_values": [
        "two",
        "True Tone Display",
        "4k",
        "iPhone",
        "Irish",
        "Sky Guide",
        "the west coast",
        "the 7 Plus",
        "a couple more hours",
        "five",
        "240",
        "the day",
        "1080p",
        "the entire day",
        "13",
        "iPhone 8 Plus",
        "750",
        "4k 60",
        "6s",
        "USB",
        "8 Plus",
        "23andMe.com",
        "Apple",
        "Hispanic",
        "iPhones",
        "a ton",
        "3.5 mm",
        "4.7",
        "4s",
        "about 7:15",
        "Neanderthal",
        "the 8 Plus",
        "early morning",
        "the iPhone 8 Plus",
        "second",
        "first",
        "Qi",
        "5.5",
        "one",
        "Austin Evans",
        "1334",
        "MacBook Pro",
        "23andMe",
        "Jonathan) Yo",
        "today",
        "1920",
        "the iPhone 7 Plus",
        "the iPhone 8 Plus",
        "IP67",
        "8",
        "Yeezys",
        "60",
        "24",
        "A11",
        "iPhone 8",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "LOC",
        "EVENT",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "NORP",
        "NORP",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "TIME",
        "NORP",
        "ORG",
        "TIME",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "EVENT",
        "ORG",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERSON"
    ]
}