{
    "id": "f91QitFI9uE",
    "title": "Top 5 New Tech & Gadgets of 2017!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-01-10T22:02:56Z",
    "video_url": "https://www.youtube.com/watch?v=f91QitFI9uE",
    "category": "Science & Technology",
    "tags": [
        "New Tech",
        "Best Tech",
        "Tech 2017",
        "New Tech 2017",
        "Best Tech 2017",
        "Upcoming Tech",
        "ces 2017",
        "tech",
        "gadgets",
        "ces",
        "2016",
        "best",
        "best tech under $100",
        "technology",
        "Razer",
        "Project Valerie",
        "Triple Monitor Laptop",
        "Razer Triple Monitor Laptop",
        "Gaming",
        "Gaming Laptop",
        "Dell",
        "8K",
        "8K Display",
        "project",
        "new technology 2016",
        "jonathan morrison",
        "tld",
        "jonathan morrison setup",
        "setup",
        "(つ▀¯▀)つ",
        "laptop",
        "top 5 tech",
        "tech under 50 dollars",
        "review",
        "2017",
        "cool tech"
    ],
    "views": 704975,
    "likes": 13755,
    "comments_count": 903,
    "description": "Top 5 New Tech & Gadgets at CES 2017. Enjoy!  The $9,000 Gaming Laptop -  Check out Samsung at CES 2017!   Some of the craziest tech at CES 2017 included Razer's Project Valerie Triple Monitor Gaming Laptop, Dell's 8K monitor and the Panasonic GH5. So. Many. Pixels!   VIDEO IS BAE -   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=YbE9lN_vDk0",
        "http://samsungces2017.com",
        "https://s2apparel.myshopify.com/products/video-is-bae",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- [Jonathan] From a crazy triple monitor gaming laptop. To a dancing Dr. Fuji. To an insane 8K display that packs as many pixels as four 4K monitors. This is some of the best tech at CES 2017. Yo guys, Jonathan here. Just got back from CES, which is giant, crazy, massive tech show. And what I want to do is break it down into five of the coolest pieces of tech and gadgets that I saw. And huge shout out to Samsung for sending me out there and sponsoring my 2017 CES coverage. Now speaking of Samsung, they were killing the home tech game and first up is their brand new family hub 2.0 refrigerator line up. So, if you're thinking to yourself, how much tech could actually be inside of a refrigerator, this is packing a massive 21 and a half inch touch LED display. No joke, this display is massive, but it works because it essentially becomes your central control panel. What's also rad is now integrated voice control. Which to be honest I really didn't get a chance to check out because of how loud it was on the floor. But the idea is you can use your voice to look up stock in your fridge, to order groceries, or even look up a recipe. Now speaking of recipes, what I found really cool, was the fact that not only will it display the recipe on the giant display, it will also read it back to you aloud. Hands down the coolest feature with this though, are the ninja cameras inside. Now, I feel like most of out there, at one point in our lives, have been yelled at for leaving that refrigerator door open. And not only, does this elevate that, but what it also does, is allow you to check on the inside of your refrigerator remotely at any given time. So in this case, if you're out at the store, and you're not sure if you bought eggs or milk, you can now check on your phone to see what's inside your fridge, which is awesome. Now runner's up for Samsung were their Flex Wash and Flex Dry washers and dryers. And these were especially cool because you have your main compartments up front and a second compartment up top, where you can actually do two separate loads, either separate or simultaneously. So the idea with this is you have your normal large wash that you can do in the main compartment and then up top, you can use that for smaller things, like delicates. Now in the instance where you don't need to run a large wash you can simply run the top. And what that's gonna do is save both energy and water. Now from there jumping from home tech to crazy tech, initially I thought the Acer $9,000 gaming laptop was the craziest thing I was gonna see at CES. But that was overtaken by Razer's Project Valerie, which is monstrous triple monitor gaming laptop. Now, unfortunately as of today, someone straight home aloned those laptops off the CES floor which is crazy, because one, if you sell it you're gonna get busted. And two, if you make a video, you're gonna get busted. So, really, the only thing I could think of, is someone looking for intel or secret information. But either way whoever took those laptops should probably give them back. Now as far as the tech inside Project Valerie, this is crazy. It is a single laptop that packs triple 4K, 17.3 inch displays. For those of you who love to crunch numbers out there, that is a massive total resolution of 11,520 x 2160. Which is bonkers! Now powering this laptop is a full fledged Nvidia GTX 1080, which seemed to do the job really well. I unfortunately, personally, did not get a hands on with it. Rather, simply, I got to admire it from a distance in a plexi-glass container. So because of that, I really didn't get a chance to see the displays open up like a Tesla Model X or really test gameplay. But from what I can see, it looks really impressive. Now initially on my latest video, I talked about a PC dream desk with that crazy Acer Predator laptop but after seeing this, I think I've changed my mind and if you agree, let me know by dropping a like down below. Now next jumping from triple monitor craziness to a single display, if you love pixels, take a deep breath. Because Dell unveiled their insane 32 inch 8K display. Now by itself, 8K sounds crazy but when you put it into perspective, it makes it all the more insane. Because that is equivalent to four 4K monitors. The total resolution is 7680 x 4320 and if the visual of four 4K monitors wasn't enough, that is equivalent to 16 1080p displays. The only thing more massive than the resolution on this monitor, is the price tag. Which is coming in at nearly 5000 bucks. Obviously this isn't really geared for your average consumer. The price tag is insane, you need two cables to drive this at 60 hertz and honestly I don't think the technology is quite there to use this on a day to day basis yet. But practicality aside, oh my god, seeing an 8K display up close is insane. The amount of detail you could see on this would blow your mind. Where you could really see that difference is where you would zoom in looking at a picture, and you're thinking to yourself, yeah that looks good, it's sharp. But then holy crap, they zoomed out, and you can see how massive that image was. Now personally, as much as I love pixels, I don't think this is something realistically I'm gonna use anytime soon. But if you had your choice, would you choose the crazy Razer triple monitor gaming laptop or this 8K display? Now next up at number 4 is something you might not expect. I've been talking about laptops, and 8K displays, but the gadget that I thought was really cool was the Polaroid Pop. If you haven't checked them out yet, Instant Prints, have really made their way back. But the problem is, especially with Polaroid, is those print outs were never really true 3x4 size, but with their 80th anniversary, they have made their way back. So with the Polaroid Pop, this shoots and prints, 3x4 instant photos using inkless paper. It's packing a 20 megapixel camera with dual LED flash. And while it's not 4K, this can also record 1080p video. Now the model I got to check out was a pre-production unit. So it did not power on. But the actual production model will also feature a 3.9inch touch screen. What I like about this especially, is the fact that it's multi-function. So obviously, you can take photos with the built in camera, you can transfer wirelessly from your phone to the pop. But on top of that, there is also an SD card slot, so you can transfer photos directly. So it's kind of funny, with all the crazy tech at CES, this is one of the things I was most excited for. So once it drops, I will definitely get my hands on it. Last up, at number five, brand new for CES 2017, is the Panasonic GH5. The follow up to the highly sought after and loved GH4. Now the big improvements with the GH5 is that it now shoots 4K video up to 60 FPS. Personally, I am team 24. But where I could see 60 FPS being really useful, is if you use that for slow motion. What's also cool is the fact that there is now internal image stabilization. Which is actually really important. We've seen that on Sony bodies. But the idea here is instead of image stabilization solely on the lens, it's actually happening inside the body. And where this is really useful is if you're using a lens that doesn't have image stabilization, that's gonna add the element to your shooting. There are now also dual SD card slots where you can record two separately or use as a backup. And potentially the two biggest selling points of the GH5, are one the fact that the crop factor is now removed and second that its supposed to perform better in low light. Personally, I really didn't get a chance to test it out much on the show floor. And CES really isn't the best place to do that. But the one thing I can attest to, regardless of testing or not is again the fact that the crop factor is gone, which is actually a really big deal. Personally when it comes to that market, I tend to lean towards the Sony side of things. But I'm really interested in seeing for the GH5 performs. Either way though, a ton of really cool tech to kick off 2017 already. Again, huge shout out to Samsung for making my coverage possible. And as far as your favorite tech, let me know what that was with a comment down below. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "CES",
        "tech",
        "display",
        "monitor gaming laptop",
        "crazy",
        "laptop",
        "gaming laptop",
        "triple monitor gaming",
        "triple monitor",
        "Samsung",
        "inside",
        "massive",
        "crazy tech",
        "monitor",
        "monitor gaming",
        "tech inside Project",
        "displays",
        "triple",
        "back",
        "Polaroid Pop"
    ],
    "transcript_entity_values": [
        "two",
        "2.0",
        "2017",
        "3x4",
        "Acer Predator",
        "Tesla Model X",
        "nearly 5000 bucks",
        "3.9inch",
        "Razer",
        "Nvidia GTX 1080",
        "9,000",
        "Project Valerie",
        "SD",
        "five",
        "17.3 inch",
        "4",
        "Dell",
        "CES",
        "2017",
        "Valerie",
        "11,520 x 2160",
        "80th",
        "a day to day",
        "20 megapixel",
        "Polaroid",
        "four",
        "a ton",
        "Instant Prints",
        "60 hertz",
        "Flex Wash",
        "number five",
        "1080p",
        "intel",
        "GH4",
        "second",
        "GH5",
        "first",
        "Flex Dry",
        "one",
        "Razer triple monitor",
        "Samsung",
        "today",
        "7680 x 4320",
        "21 and a half inch",
        "32 inch",
        "8",
        "60 FPS",
        "24",
        "Sony",
        "Yo",
        "Jonathan",
        "16 1080p"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}