{
    "id": "FAJwbluAxcg",
    "title": "Galaxy Note 8 - 5 Features I'm Excited For!",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2017-07-21T20:05:07Z",
    "video_url": "https://www.youtube.com/watch?v=FAJwbluAxcg",
    "category": "Science & Technology",
    "tags": [
        "Galaxy",
        "Note",
        "Galaxy Note 8",
        "Note 8",
        "Samsung",
        "Apple",
        "Smartphone",
        "2017",
        "iPhone 8 vs Galaxy Note 8",
        "GS8",
        "Galaxy S8",
        "Apple iPhone 8",
        "Best Smartphone",
        "Note 8 Unboxing",
        "Note 8 review",
        "Note 8 unboxing and review",
        "note 8 release date",
        "note 8 official",
        "official",
        "trailer",
        "tld",
        "jonathan morrison",
        "Google",
        "Google Pixel",
        "Google Pixel 2",
        "Android"
    ],
    "views": 340073,
    "likes": 8327,
    "comments_count": 1177,
    "description": "Get excited for the Google Pixel too!  The Galaxy Note 8 is announcement date is official. Here's 5 reasons I'm exited!  The Best Tech Under $500!   The Galaxy Note 8 is expected to sport dual 12-megapixel sensors, a larger 6.3 inch display with a more impressive infinity screen and more.   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=lWItcVcThjM",
        "https://youtu.be/rYbNu8ivZzo",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- So today or yesterday by the time you're watching this, Samsung announced that they are announcing the Galaxy Note 8 in just about a month from now on August 23rd. And that has me excited for a handful of reasons. One is simply the fact that there is a Galaxy Note 8. At this point, I think it's a little played out and a little bit of a cheap shot to insert explosion joke here, (explosion booms) because ultimately what happened with the Note 7 was unfortunate. It was an awesome phone that was insanely well received to the point where people did not want to give it up and were risking it catching fire because they loved their Note 7 that much. And honestly as far as the Note lineup goes, Samsung could have easily shut things down. They could have easily brushed that under the rug and acted like it didn't happen like a certain company we know, but they didn't. They faced that problem head-on, made it a point, and I would expect no less with the Galaxy Note 8. And next up on number two is the display and personally I think the Galaxy S8 and S8 Plus have the best displays of 2017, and on top of that, they might be the best looking smartphones of all time. The Galaxy S8 features a 5.8 inch display with the Galaxy S8 Plus being 6.2 inches, and with the Galaxy Note 7, we can expect a slightly larger display of 6.3 inches. Now you might be thinking that is not that big of a screen size jump, but what has me excited is as impressive as the Galaxy S8 infinity display was, based off leaks and rumors, the Galaxy Note 8 might be even crazier with a better body-to-screen ratio. So I am drooling over the idea of this giant display in my hand with essentially no bezels. And next up on number three is the camera or cameras I should say. The Galaxy S8 has an amazing camera, one of the best out there, but I think it's safe to say they took the safe route and opt in with a single lens. Apple dropped dual lenses on the iPhone 7 Plus last year, so it was a little surprising not to see it on the Galaxy S8. Obviously, the LG G6, the OnePlus 5, but it looks like we should finally see it with the Galaxy Note 8. There have been some conflicting reports on whether it's going to be dual 13 or dual 12 megapixel sensors, but based off the Galaxy S8 and what I've seen so far, I would bank on dual 12 mega-pickles. What's interesting to me though is whether Samsung's gonna go with a wide-angle or a telephoto lens for the secondary option. Both have their pros, both have their cons, and I would love to hear what you would prefer with a comment down below. But either way it is shaping out to be an awesome camera. And next up what has me excited is the S Pen, because ultimately that is what separates the Note series from the S series. You may not have realized it but one of the best features on the Galaxy S8 in that it can create a GIF actually stem from the Note 7 and the S Pen. Also, it's usually a given that any newer product is better than the older product so that is true with the Note 7 S Pen, but it was so much better than any prior S Pen that it has me excited to see what Samsung is doing this time around. So yeah, we're gonna see an improved S Pen, but the thought of using it on that giant, edge-to-edge, nearly bezel-less display sounds like an amazing experience. Now last up I'm going to step out of reality and jump into dreamland unicorn world for a second because everything I've talked about up to this point we can pretty much expect, but if I could wish for any one thing on the Galaxy Note 8, it would be that they could implement the fingerprint sensor underneath the display as opposed to the awkward position of the Galaxy S8. I fully realize this is more than likely not gonna happen, especially based off all the leaks, but what gives me hope is Qualcomm actually beat Apple to the punch with this technology so if Samsung can somehow steal that thunder, it would be amazing. So that is my wish with the Galaxy Note 8, and if you could wish for one feature, it could be anything, let me know what that is with a comment down below. Between the Galaxy Note 8, the iPhone 8, the Google Pixel 2, it is shaping up to be a crazy end to 2017. Speak of the Google Pixel 2, if you want to know more that, Ms Krystal Key has an awesome video which you can check out here. This is Jonathon and I will catch you guys later.",
    "transcript_keywords": [
        "Galaxy Note",
        "Galaxy",
        "Note",
        "announcing the Galaxy",
        "display",
        "Samsung",
        "Pen",
        "today or yesterday",
        "August",
        "Samsung announced",
        "Google Pixel",
        "point",
        "Note series",
        "Note lineup",
        "excited",
        "dual",
        "separates the Note",
        "camera",
        "time",
        "expect"
    ],
    "transcript_entity_values": [
        "The Galaxy S8",
        "2017",
        "6.3 inches",
        "the Galaxy S8",
        "LG",
        "One",
        "just about a month from now",
        "S8 Plus",
        "the Galaxy S8",
        "The Galaxy S8",
        "13",
        "Apple",
        "Qualcomm",
        "the Galaxy Note 7",
        "the Galaxy S8",
        "Galaxy Note 8",
        "Galaxy S8",
        "yesterday",
        "the S series",
        "August 23rd",
        "2",
        "5.8 inch",
        "G6",
        "second",
        "the S Pen",
        "number two",
        "one",
        "the S Pen",
        "number three",
        "S Pen",
        "6.2 inches",
        "12",
        "Samsung",
        "today",
        "the iPhone 7 Plus",
        "last year",
        "Jonathon",
        "12 megapixel",
        "the Galaxy S8 Plus",
        "the Note 7 S Pen",
        "Ms Krystal Key"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "EVENT",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "EVENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON"
    ]
}