{
    "id": "fBWRwGbedfA",
    "title": "Buy this laptop NOW! - HP Envy 14",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-02-13T21:52:22Z",
    "video_url": "https://www.youtube.com/watch?v=fBWRwGbedfA",
    "category": "Science & Technology",
    "tags": [
        "HP",
        "Hewett Packard",
        "Envy",
        "Laptop",
        "Notebook",
        "Intel",
        "Processor",
        "Workstation",
        "Gaming",
        "NVIDIA",
        "Geforce",
        "1650 Ti",
        "Mobile"
    ],
    "views": 750108,
    "likes": 26694,
    "comments_count": 1877,
    "description": "Get 20% OFF + Free Shipping @Manscaped at    When Alex gets overly excited about something, I get a bit worried, but I am interested when it's about a laptop, especially when it's an HP.  Check out the HP Envy 14 at   Buy HP Envy Laptops On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Buy Dell XPS Laptops On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):  On BestBuy (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://manscaped.com/CIRCUIT",
        "https://howl.me/chrOjjth6hu",
        "https://geni.us/0QcqPbI",
        "https://geni.us/wTgSwx",
        "https://geni.us/IuTaIVW",
        "https://geni.us/UMHB",
        "https://geni.us/QBgA08",
        "https://geni.us/hIskrZ",
        "https://geni.us/90FxT",
        "https://geni.us/aCYOot",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- We recently looked over the HP Spectre 14 and I was like, wow, they finally did it, they made their flagship line better than the one that's below it. It's kind of weird, HP, somehow, their Envy lineup has long been a better option than their Spectre lineup, despite of being lower in the order. But now, HP hasn't just shot their foot. They've taken a shotgun and just like, (sputters) blown off their whole leg with this thing right here. Like, jeez. The Envy 14 is freaking sweet. I'm talking like it's about the same size as that Spectre, it's about the same... It's cheaper, and it's got a dedicated GPU. It's freaking wicked. It's almost definitely the laptop that I'm going to tell people to just buy whenever they ask me. But let's actually get into it. We don't get one of those sleeves that HP sometimes gives you. Not that I'm really complaining. This is like, it's not a budget option, but it's like a budget option. This thing, I believe, is $1,250, thereabouts. So, I kinda know where we're coming from. We get a power brick which is, let's see, 135 watts. And the laptop itself. (upbeat music) It's a good-looking laptop in my opinion. So, the Spectre, I personally find, can be a bit on the polarizing side, whereas I think everyone can agree that this is just... It looks like a laptop and you can't complain. Maybe you want it to be a bit more ostentatious, but if you do, like, I don't know what you're doing. This looks great. The chassis on this is all aluminum. Now, unlike the Specter lineup, all of the bits in here would be CNC machined. So, that would be like solid block of aluminum, big old robot comes in, and gets rid of all of that. Whereas this right here is stamped. So, you got like a flat piece of aluminum, big old hydraulic press. And that's how this is all formed. It isn't quite as good. You don't have the same rigidity as you would from a CNC part. You can probably see here, she's... If you really press on it, it's not the same. Especially like this kind of squishy part right here. I'm not going to complain about the build quality. Like, I actually think it's fantastic. This stamped aluminum feels 90% as good as the stuff that's CNC machined, but it's just so much cheaper to do. I think it makes a whole lot of sense. You also get a rather generous trackpad. Right down here, a bunch of keys. And for IO, in this side you get microSD. I do wish that this was a full-size SD card reader but at the same time it's small, like, whatever. USB type A. Power input is right there. It's a barrel connector, you don't get charging over type C. So, that's another thing that you just have to live with. But, I don't know. I think it's fine. Over here, you get headphone, microphone combo, USB A, full-size HDMI and Thunderbolt 4. So, you can... That's like everything that you need, plus a little bit of extra sauce. Really for something in this size, I think it's a great choice now. Now, I can't wait to power it up. But before that, let's smoothly segue to silky smooth balls with Manscaped. Manscaped's performance package kit has everything you'll need to stay groomed from head to toe. It features their new Lawn Mower 3.0. It's waterproof, it has their skin safe technology, as well as their Weed Whacker ear and nose trimmer for those tricky areas. For a limited time you get the kit plus two free gifts, the shed travel bag and the Manscaped anti-chafing boxers. Go to manscaped.com for 20% off and free shipping. According to David, it doesn't quite come across on camera because it's a real reflective boy, but this screen is just so excellent. Like, it also has a Delta E of less than two. So, you can, you know, just chuck your photo straight into it and not worry about it coming out like all purply or something afterwards. And, oh, it's 16 by 10. Fantastic. There's all this space down here, is actually getting used. One thing that you don't get is Windows Hello facial recognition. You are giving that up compared to like a similarly equipped notebook that would be the same price. You do have a fingerprint reader right down here, which works pretty well in my experience. Although, the thing that's really excellent about this, is that it has a 1650 Ti. So, you can come in here, oh, the only game that I have downloaded is Stardew Valley but, (man laughs) sure, you can play that for sure. Definitely. So, this is the sort of thing that you would really struggle to do on anything without a GPU, whereas it's totally fine on this. So, we've got, you know, they get all 3D model. This one is just a simple heat sink that I set up for a flow sim. But as you can see, like you can just come around here, move the model around, just as much as you want. And it's totally fine. Does it. Now, this is obviously nowhere near as powerful as something like an XPS 15. Like, this thing has four cores, this guy has eight. This one's also $1,500 more expensive. So, yeah, you get what you pay for. Now, that does bring us to the biggest problem of the Envy 14, and kind of what keeps it from being an absolute 10 out of 10, the processor. So, what we're getting here is the Intel i5-1135G7. You can get an i7 if you feel like it. But you're getting four cores, eight threads with that. It's a pretty excellent little processor if, you know, AMD didn't exist, but unfortunately they do. So, I'm going to just download Cinebench real quick, and we're going to see how it does. But I can guarantee you, compared to the same laptop with an AMD processor, this thing gets absolutely destroyed. This trackpad is just awesome. It's pretty big. It's not massive. Like, they did use this space up here for speakers instead of bringing the keyboard up that tiny bit more so they could have the proper MacBook size trackpad, but you know, it still is a pretty good one. One problem that I have been having with the trackpad though, is that it does sometimes pick up my palm. I don't think it's so much a problem with the trackpad as the keyboard. So, if you look here, the home row is kind of like to the left because they add these keys over on the right here. It's not a big deal, you'll get used to it. But at the same time, I would like for these keys to just go away and be integrated into the top. If you look here on the XPS 15, just like Backspace, Enter, Shift, Tab, Caps Locks, all of that, they're just way more generous, easier to hit them, and then you just get more function keys up at the top. Do I care if there's a dedicated button to turn on and off the webcam, or enter HP's control center or disable the mic? Maybe not. I feel like a lot of those could be done either like HP has done in the past, on the side, or just through software and I would be happy. Because I think it would just be so much more comfortable if my hands were right here, then my right hand avoids the trackpad, you don't have to worry about hitting here and so on. As for the keyboard itself, it's freaking awesome. I don't know how exactly they did it, but it has like such a satisfying little snap to it. On Linus Tech Tips, I recently reviewed the Flow X13, so that had the Ryzen 9 5980HS, which is a 30-watt chip, same as this one, basically. That one also had a 1650. Now, that came out with a score in Cinebench of 4,803. This right here is not going to be anywhere close to that, it's going to get absolutely destroyed. Yeah, I don't even know what to say besides Intel is just getting dunked on right now in mobile. That's kind of why an AMD processor would be perfect for this, because you'd have more power than this XPS 15 right here in a much smaller form factor. Using an Intel processor, you just can't pull that off right now. In all of my time using this, I didn't once hear the fans ramp. And even now that they are, it's not very loud. You can probably barely hear it right now. 2084. So, compared to 4,800 for the equivalent AMD processor, well, I guess in fairness, that's kind of a step up. You might be able to get an i7 in this that's slightly better, but at the same time, from other reviews that I've read, the i5 in this is more powerful than most of Intel's i7s that are four cores. So like, good job, HP, but at the same time, wrong chip. Which I guess kind of brings us along to, what is your situation? If your laptop just died, get this thing right here. That's, I don't know. In my mind, this is like the easiest laptop to recommend that's came through for quite some time, simply because awesome screen, awesome keyboard, great trackpad, quite a bit of power. But maybe AMD is better, but maybe you don't get AMD for a year because supply issues. (electronic dance music) This could be a drop of disappointment. I can feel it. (electronic dance music) Oh, wow. That's better than I thought it would be, honestly. Damn! Good on you, HP. That has a lot more balls than I was expecting. Anyway, let's open it up and see what's inside. Wow. It actually only was four screws. Oh, you can like see the stamping lines in here. That's fun. Let's see where the tool came right down, pressed in to all of these little grooves. So, first of all, the battery is not a square, it's more of like, yeah, Tetris. I was gonna say it's kind of like a dick, but Tetris. I was expecting for there to be non-soldered RAM in here that you could replace, but it appears instead HP has just given you a whole bunch of cooling. So, we have these, you know, fancy fans here that have lots of fins. We also have two massive heat pipes given, you know, how big this thing is. I'm guessing our RAM chips are under this little copper heat spreader right here, but you're definitely not getting at them. The good news is that there is a replaceable M.2. So, you can upgrade the storage, no upgrade in the RAM. Definitely go for 16, at least that, if you're buying one of these. For the battery, it's 63.3 watt-hours. Though in my experience, how much battery life you get out of this thing is very dependent on what you're doing. So, if you're using, you know, the dedicated GPU, she's done. If you crank that screen up to 400 nits and just like watch Netflix, you're also not getting a whole lot. So, in my experience, full power screen just doing office stuff, you get like six hours maybe. But you just turn that brightness down and it's like 10. I'm very glad that HP made this laptop because it allows me to recommend a laptop to basically everyone, and not feel like a total (beep) because I'm like, oh yeah, I really liked this XPS 15, it's $3,000. Instead I can just be like, okay, you get this thing right here, it's like 1300 bucks. That's not cheap, but you're getting a whole bunch of laptop for that amount of money. Yeah, dedicated GPU and CPU is fine, but an awesome screen, awesome trackpad, great keyboard. You know, not much you can complain about with this thing. That's about it. If you guys wanna watch something else, I don't know, maybe go watch the Flow X13 video that we've done on Linus Tech Tips. It really shows you why HP should make one of these with an AMD processor. Have a good day, bye.",
    "transcript_keywords": [
        "thing",
        "AMD processor",
        "laptop",
        "AMD",
        "kind",
        "Spectre",
        "trackpad",
        "processor",
        "time",
        "good",
        "Envy",
        "power",
        "awesome",
        "dedicated GPU",
        "bit",
        "GPU",
        "XPS",
        "Intel",
        "Linus Tech Tips",
        "yeah"
    ],
    "transcript_entity_values": [
        "1,250",
        "Linus Tech Tips",
        "XPS 15",
        "Thunderbolt 4",
        "eight",
        "Caps Locks",
        "15",
        "Intel",
        "4,803",
        "Specter",
        "One",
        "HP",
        "chuck",
        "RAM",
        "one",
        "20%",
        "USB",
        "2084",
        "Tetris",
        "six hours",
        "Linus Tech Tips",
        "The Envy 14",
        "a year",
        "1650",
        "IO",
        "Stardew Valley",
        "up to 400",
        "63.3 watt-hours",
        "David",
        "Windows",
        "1,500",
        "3,000",
        "4,800",
        "less than two",
        "microSD",
        "10",
        "AMD",
        "first",
        "M.2",
        "90%",
        "3.0",
        "HDMI",
        "16",
        "AMD",
        "Lawn Mower",
        "Weed Whacker",
        "two",
        "the Flow X13",
        "Tetris",
        "Netflix",
        "135 watts",
        "four",
        "A. Power",
        "GPU",
        "Flow X13",
        "Manscaped",
        "Backspace, Enter",
        "CNC",
        "Cinebench",
        "a good day",
        "16",
        "SD",
        "CPU",
        "MacBook",
        "Tab",
        "Envy",
        "1300 bucks",
        "30-watt",
        "Spectre"
    ],
    "transcript_entity_types": [
        "MONEY",
        "WORK_OF_ART",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "DATE",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "GPE",
        "LOC",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "NORP",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "EVENT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON"
    ]
}