{
    "id": "FDbgTlr-tnw",
    "title": "EVE NG Installation",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-10-18T20:33:35Z",
    "video_url": "https://www.youtube.com/watch?v=FDbgTlr-tnw",
    "category": "Science & Technology",
    "tags": [
        "eve-ng",
        "eve-ng tutorial",
        "eve-ng setup",
        "eveng",
        "eve ng",
        "eve-ng installation guide",
        "eve",
        "eve-ng add images",
        "eve-ng vs gns3",
        "eve-ng lab eve-ng cisco images",
        "eve-ng cisco",
        "eve-ng pro",
        "eve-ng virtualbox",
        "eve-ng google cloud",
        "eve-ng lab",
        "eve-ng cisco switch",
        "eve-ng cisco images",
        "eve-ng cisco router",
        "eve-ng cisco images download",
        "ccna",
        "cisco",
        "ccnp",
        "ccna labs",
        "ccnp labs",
        "ine",
        "cbt nuggets",
        "david bombal eve-ng",
        "eve-ng gns3",
        "eve-ng vs virl",
        "eve-ng windows 10",
        "eve-ng windows install",
        "virl"
    ],
    "views": 376540,
    "likes": 5890,
    "comments_count": 420,
    "description": "Want to know how to setup EVE-NG? This EVE-NG tutorial shows you step by step. Full EVE-NG installation guide showing you how to add images to EVE-NG and get an EVE-NG lab set up. Learn how to download and install VMware Workstation Player, how to add EVE-NG to VMware, how to create a topology, how to add Cisco images to EVE-NG and much more.  Menu: EVE-NG versions: 1:58 Cookbooks: 2:44 Hardware Requirements and calculator: 3:00 Virtualization platforms: 4:00 Enable VT-x in BIOS: 5:51 Download EVE-Ng: 7:05 Download VMware Player: 8:00 Install VMware Player: 8:58 Import and configure EVE-NG in VMware Player: 10:27 Start EVE-NG and set initial EVE-NG config: 13:47 Build and test first topology: 16:17 NAT Adapters: 19:20 Add Cisco images to EVE-NG:   ========================== EVE-NG links:  ================================= EVE-NG Website:  Download EVE-NG Community:  Download EVE-NG Professional:  Community Cookbook:   10x Engineer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   #eveng #gns3 #virl",
    "description_links": [
        "https://youtu.be/YKYdq3Ww_C0",
        "https://www.eve-ng.net/",
        "https://www.eve-ng.net/downloads/eve-ng-2",
        "https://www.eve-ng.net/downloads/eve-ng",
        "https://www.eve-ng.net/images/EVE-COMM-COOK-BOOK-latest.pdf"
    ],
    "transcript": "- This is one of multiple videos where I'm going to show you how to download, install, configure and use EVE-NG. 'Cause we both deserve being young (energetic music) - Now, unlike other videos out there I'm gonna show you the full process to get EVE-NG working. I'm gonna show you hardware requirements, I'm gonna show you how to enable nested virtualization in the BIOS of your computer, I'm gonna show you how to download VMware Workstation Player, how to download EVE-NG, how to import that into VM Workstation Player, how to set various settings based on best practices, how to get EVE-NG booted and set up initially but also then how to upload Cisco IOS images to EVE-NG so how do you get Cisco IOS images I'll show you that process then I'll show you how to upload those images into EVE-NG. One of the confusing things when you first start EVE-NG is you think okay, it's working but you can't build topologies because you need to first, download images from Cisco's website and then you need to do some configuration inside EVE-NG to get it all working. Now, that means there is a lot of content so use this menu or the menu below to jump to the specific parts of the video that of interests to you. Now, this video make it too long so I may have to create additional videos but I'll link those below as well if you wanna watch something else so as an example if the video gets too long and I can't show you how to download and use Cisco IOS images in this specific video, you may need to jump to a separate video but again use the link below if you need to go look at other topics that are not covered in this specific video. I wanna make sure that you can get this software working properly on your laptop. Okay, so without further ado, let's get started. Now there is a lot of good documentation on the EVE-NG website. One of the things you need to be aware of is there are different versions of EVE-NG so if you go to Features, Compare Editions, you'll notice that there is a Community Edition, Professional Edition and Learning Center Edition. In this video I am gonna download the Community Edition which is free and I'll show you how to get that set up. It doesn't have as many features as the Professional Edition, the Professional Edition costs 99 Euros but it does give you many many more features, those are listed here, notice as an example the node limit for the Community Edition is 63 nodes where as for the Professional it is 1024 nodes. With regards to documentation, one of the first things I would suggest you download is either the Professional Cookbook or the Community Cookbook depending on which version you using. So, I'll get the Community Cookbook because that's what I'm gonna be demonstrating here. One of the first questions people typically ask with this kinda setup is what are the requirements and I don't wanna bore you reading through the requirements in a video, you can download this cookbook and have a look yourself. So, as an example, just in brief, you need at least eight gig of RAM, you need Intel i5 or i7 processor with Intel Virtualization in BIOS, that's really important especially if you wanna run Cisco appliances, you need to have VT-x or Intel Virtualization enabled and I'll show you how to enable that in this example on my laptop. You also need internet connectivity that's a requirement. You need 40 gig of disk space. Now, this applies to all platforms that you may use, whether it's VIRL, EVE-NG, GNS3 etc. The amount of hardware that you need is dependent on what type of topology you wanna run. If you wanna run just two basic Docker containers you don't need a lot of RAM and CPU to do that. But if you wanna run a very large Cisco typology of VIRL images you need more hardware. That kinda information is listed document again with regards to recommended, system requirements as well as dedicated server bare metal requirements. And what really nice here is they have nodes per lab calculator so have a look at this calculator if you wanna work out the sizing for your lab. Now, with regards to virtualization platforms and software notice VMware Workstation Pro supported Player supported ESXi supported from these releases,. Ubuntu Server 16.04 LTS for bare metal is supported as well as Google Cloud. On the website, if you go to Documentation, Installation, System Requirements, they essentially explain that including the fact that Virtual Box is not supported so you cannot use Virtual Box if you wanna use EVE-NG. You cannot use Ubuntu 18 or 19, those are not supported. So please be aware of the requirements, before you try and install EVE-NG. So in my example, I have got a Windows computer, I'm going to download VMware Workstation Player. I do need the minimum hardware requirements, I've got an i7 processor, eight gig of RAM, this laptop has got Nested Virtualization enabled in the BIOS but I'm gonna show you that right now so you can see how to enable that if you're not sure. It is dependent on your laptop so, the key sequence that you use will very depending on the vendor of the laptop but let me show you now how to enable VT-x or Nested Virtualization in the BIOS and then I'll show you how to download the software. Okay, so I need to enable Nested Virtualization or VT-x on my laptop so what I'm gonna do is shut it down, I'm gonna power it on and then this example for this laptop I'm gonna hold the F2 key down. So you can see here BIOS information, what I'm gonna do is go to the next menu and the important piece is Intel Virtualization Technology, that's currently enabled. There are some other options like Hyper-Threading, Intel AES-NI, VT-d but the one that I want is Intel Virtualization Technology, you need that to be enable to do Nested Virtualization in Virtual Box or VMware Workstation. So I'm gonna save those settings and say yes to save, the laptop will reboot. Okay, so now I can login and I have been able to login successfully. So if you have problems make sure that Intel Virtualization technology or VT-x, Intel VT-x is enabled on your laptop. So to download EVE-NG simply go to Downloads and select the version that you wanna download. I'm gonna download an OVA which makes it a lot easier to do the installation. You could do an ISO installation but I'm gonna download an OVA from Google and click download, click download anyway so the OVA is now being downloaded. Now once again in the Cookbook they show you how to do the installation, so we have VMware Workstation Pro or VMware Workstation Player and they show you how to do the installation using an ISO image. All the steps are shown here and they also show you how to do the installation using an OVA image which is what I'm showing you here. This makes things a lot simpler, when you're doing the installation but you can use an ISO image if you prefer. Now, on the downloads page, scrolling down, they give you a link to VMware Workstation Player so to download VMware Workstation Player simply click on this link and you are taken to the downloads page, you can also find that by simply going to vmware.com going to Downloads, Free Product Downloads, Workstation Player, selecting your operating system in this example I'm using Windows so I'm gonna download Windows VMware Workstation Player 15. Okay so this point my VMware Workstation Player Software has downloaded and I've also got EVE-NG downloaded. Now, the reason I've downloaded VMware Workstation Player is I need hypervisor software to run this OVA, I'm running Windows here EVE-NG uses Linux as the operating system so I need to have the hypervisor installed and I import the OVA into the hypervisor. First step is to double-click on the VMware player executable. I'm asked do I wanna allow this app to make changes to my device so I'm gonna say yes. VMware Workstation Player installation starts. The setup wizard displays and in this example I'm basically gonna take the defaults for the most options so I'm gonna click Next. You need to agree to the license, I'm gonna do that and click Next. I'm not gonna change the default installation directory, I'm gonna click Next. In this example, I'm not going to join the custom experience improvement program, I'm gonna click Next. Shortcuts, all leave at the defaults, click Next. Installation is now ready so I'm gonna click Install. And the software is now installed. Now, virtual network drivers are also installed so don't get worried if you suddenly see extra network adapters in Control Panel that's normal. Okay, so the installation is completed, I'm gonna click Finish. And, what I'll do now is startup VMware Workstation Player. Now, VMware Workstation Player is free for non-commercial use. If you are using this commercially, you need to enter a license, I'm not gonna do that, I'm gonna click Continue and I'm gonna click Finish. VMware Workstation Player has now started, I'm gonna click on Player, click File, Click Open. Browse to my Downloads directory, select the EVE-NG VM and click Open. I'm gonna leave everything at the defaults and click Import. The EVE-NG Virtual Machine is now imported and there you go. Now, before I start it up, there are some defaults here but I wanna edit those settings I'm gonna go to Edit Virtual Machine Settings. Now, this default is too high for my laptop. When I look at my PC, my PC only has eight gig RAM in it, I can't allocate a full eight gig to EVE-NG, so I'm gonna reduce this to 4,096. With regards to processes, I'm also gonna reduce this down to let's say two processors. Now, this one's again depends on the hardware that you have in your laptop or computer, have a look at the EVE-NG Cookbook for the calculator and details of how much RAM and CPU you need for specific types of topologies. Once again, the moral of the story is allocate as much RAM as you possibly can and as many CPU's as you can but that really depends on the hardware. Now, this is really important, Virtualize Intel VT-x or AMD V. This has to be enabled as an example if you wanna run Cisco VIRL images in your EVE-NG topologies so make sure that is also enabled, make sure that the BIOS has VT-x enabled, I showed you previously how to do that. Now, it's recommended that if you're using a laptop use NAT rather than Bridged adapters. You wanna use NAT as an example because if you're going from one wireless network to another your IP address could change and that could have affect the IP address allocated to EVE-NG so you probably wanna use NAT in most cases with a laptop but in my example because I'm gonna be using this in my home network and I wanna connect to EVE-NG remotely and I can statically set my IP address to my home network here so I'm gonna use Bridged. In most cases however, if you've got a laptop you gonna wanna use NAT, if you're using a PC that's physically connected to the network you gonna wanna use Bridged but that's fine for me so I'm gonna click OK. Once again, go to the documentation on Eve-NG's website, go to the Community Edition Workbook and in the installation portion of this workbook they show you step-by-step what I've just demonstrated and they show you here as an example that NAT is recommended for laptops to avoid the Eve-NG management interface IP address changing but for Desktop PC, you could use either NAT or Bridged. So just to reiterate, when you import this go to the Edit Virtual Machine Settings make sure that your RAM is set appropriately, make sure that your processes configured, that you have this enabled and that you either set this tuned NAT or Bridged. I'm gonna power on this Virtual Machine. Now, I'm told that the following software is available for download, VMware Tools for Linux, I'm gonna download and install the VMware Tools. I'm told that all updates are finished so I'm gonna click close. My VMware has now booted, I'm told that the default root password is eve so I'm going to login with username 'root' password 'eve'. Now I'm told to specify a new root password. Even though the password is not displayed it's actually accepting it so I'm gonna type my password in repeat it, I can change the host name if I want to, I'm not gonna do that. Can change the domain name if I want to, I'm not gonna do that, just press Enter. Now you can either use DHCP or Static IP Addresses here, in my example I'm gonna use Static Addresses because I know what IP Address I wanna allocate to this VM so that I can access it from my Mac or other devices in my network. So I'm gonna specify that IP address, I'm gonna specify the subnet mask, I'm gonna specify the default gateway, specify my DNS server and secondary DNS server, I could also specify NTP server I'm not gonna do that I'm just gonna press Enter and I'm not using a proxy server here so I'm gonna press Enter to complete the settings and EVE-NG is now rebooted. Now once EVE-NG reboots, I'll login and make sure that you can ping the internet, one of the requirements is that you have internet connectivity so make sure that you use ping to test that you have internet connectivity. You could also check the IP Address of your device by using ifconfig, I'll use more here, so IP Address of this device is 192.168.1.200 in my example but it's important that you have internet connectivity so test that you have internet connectivity by ping for instance google.com. Okay, now that we have done that we can open up a web browser and access EVE-NG. So, in my web browser 192.168.1.200. Now to login you use the username 'admin' password 'eve', you don't use 'root' in this case, I'm gonna select HTML5 console rather than the native console and click Sign In. And there you go I've now logged in to EVE-NG, what I'm gonna do is add a new lab and give it a name myfirstevenglab, I'll leave the Version at one and leave everything else as it is and click Save. What I'm gonna do here is add an object which is a node and I need to select the node to add to the typology. Notice how all of these devices are not available because I haven't added an operating system to EVE-NG. So ASAv is not available, CSRv is not available, Cisco IOSv is not available, L2 is not available, if I scroll down, all the way to the end, my virtual pc or VPCS device is available so I'll add two nodes to the typology and I'll click save. So now I have two nodes and I can connect the one node to the other and specify the interface, I'll just use ethernet zero and click save. I'll start these two nodes, as you can see they've started and I can click on the first node and I'm able to access the device using an HTML web interface. So this is through my browser I could set the IP Address of the first device with an IP Address of 10.1.1.1, subnet mask 255.255.255.0. Second device, I'll click on that, I can also access this device through a web browser console so once again this is running through my web browser. Specify the IP Address of the second device as that 10.1.1.2 and what I should be able to do is ping from the one device to to the other, which I can so PC 1 can ping PC 2 and PC2 can ping PC 1. Okay, so that how you download, install and configure EVE-NG using VMware Workstation Player and EVE-NG Community Edition. Now, you probably gonna wanna add a Cisco node to the typology so the next step is to add Cisco IOSv to the typology. Now that's, not possible without doing some additional steps and this video is getting too long now so I'll put them in a separate video. Now for completeness, I'm gonna show you a second EVE-NG VM and in this example I'm gonna use NAT. I'm gonna edit the Virtual Machine Settings, once again reduce the RAM to 4,092, set my processes to two, make sure that VT-x is enabled and I'm gonna change the adapters to use NAT rather than Bridged. This is once again the recommended setting if you're using a laptop and you're traveling as an example and your IP Addresses change. So I'm gonna start the Virtual Machine, notice the IP Address that's been allocated 192.168.179.128. If I open up at a cmd prompt and type ipconfig Ethernet Adapter 4 is using this IP Address 192.168.179.1. So I need to configure my EVE-NG host with an IP Address in that subnet. So I'll login in with my username of 'root' password of 'eve', I'll set a password of 'eve' again, set my hostname to 'eve-ng', I'll leave the domain name as it is. Now I'm going to specify a Static IP Address so use arrow key down press Spacebar to select Static, press Enter to specify okay, 192.168 once again 179 dot something so I'll say 179.200 subnet mask used here is 255.255.255.0 so I'll press Enter there and then specify my subnet mask. Now the default gateways gonna be .2 not of .1, this is the IP Address of my host, I'm gonna use .2 here so not of this but 192.168.179.2. Press Enter, I'll set my DNS Server the same, secondary DNS Server will be Google, I won't use NTP and I'm not using a proxy server, I'm just gonna use a direct connection so leave that at the default and press Enter. EVE-NG now reboots. So make sure you use .2 not .1, .2 is your default gateway .1 is the IP Address allocated to your PC. So I'm told I can access the EVE-NG server using 192.168.179.200 so 192.168.179.200 and I'll be able to login to the EVE-NG server. Now once it reboots I wanna log back in and make sure that I have internet connectivity so make sure that you can ping google.com as an example. So, again, ifconfig more, shows me that IP Address of this EVE-NG server is 192.168.179.200 and that's because on this server I've specified that I'm using NAT. So hopefully that's not confusing, I've set up two EVE-NG servers that I wanted to show you both, I've got one running NAT using 192.168.179.200 and then I have got an another one using IP Address 192.168.1.200. You obviously don't have to do that if you're using a physical PC connected in to a network using an Ethernet cable as an example you probably gonna wanna use Bridged, if you are using a laptop like this and you are roaming around and you wanna make sure that your IP Address doesn't conflict with another IP Address on the network uses NAT so that your laptop can access the Eve-NG device no matter whether you've got an internet connection or not. Now, if you enjoy this video, please subscribe to my YouTube channel, please like this video and please, click on the bell to get notifications. I'm David Bombal and I wanna wish you all the very best. 'Cause we both deserve being young (energetic music)",
    "transcript_keywords": [
        "VMware Workstation Player",
        "Workstation Player",
        "EVENG",
        "VMware Workstation",
        "download VMware Workstation",
        "EVENG Community Edition",
        "Community Edition",
        "Workstation",
        "address",
        "Player",
        "download",
        "click",
        "Cisco IOS images",
        "Intel Virtualization",
        "Intel Virtualization Technology",
        "EVENG Virtual Machine",
        "Workstation Player installation",
        "show",
        "download EVENG",
        "Virtual Machine"
    ],
    "transcript_entity_values": [
        "Hyper-Threading",
        "Linux",
        "4,092",
        "Eve-NG's",
        "Cisco",
        "GNS3",
        "two",
        "eight",
        "10.1.1.1",
        "second",
        "Edit Virtual Machine Settings",
        "YouTube",
        "Google",
        "Docker",
        "Linux",
        "ISO",
        "NTP",
        "Intel Virtualization",
        "Intel",
        "179",
        "David Bombal",
        "Intel AES-NI",
        "NAT",
        "the Virtual Machine Settings",
        "Cookbook",
        "VMware Workstation Pro",
        "F2",
        "Professional Edition and Learning Center Edition",
        "192.168.179.2",
        "Nested Virtualization",
        "192.168.179.1",
        "Google Cloud",
        "Nested Virtualization in the BIOS",
        "99 Euros",
        "the Professional Cookbook",
        "VT",
        "192.168.179.128",
        "PC2",
        "Downloads, Free Product Downloads",
        "VMware Workstation Player",
        "one",
        "HTML5",
        "Static",
        "Spacebar",
        "RAM",
        "Windows VMware Workstation Player",
        "VM Workstation Player",
        "VMware Tools",
        "HTML",
        "DNS",
        "Windows",
        "192.168",
        "first",
        "Virtual Box",
        "the Community Edition",
        "15",
        "Desktop PC",
        "40",
        "63",
        "the Community Cookbook",
        "NAT",
        "Downloads",
        "Workstation Player",
        "IP",
        "VMware Workstation Player Software",
        "VMware",
        "Static Addresses",
        "at least eight",
        "First",
        "Community Edition",
        "the VMware Tools",
        "Features, Compare Editions",
        "DHCP",
        "VM",
        "EVE-NG",
        "this Virtual Machine",
        "Next",
        "Cisco IOS",
        "L2",
        "192.168.179.200 so 192.168.179.200",
        "the Community Edition",
        "Ethernet Adapter 4",
        "the Professional Edition",
        "1024",
        "secondary",
        "Ethernet",
        "One",
        "VPCS",
        "EVE-NG Community Edition",
        "Control Panel",
        "CPU",
        "Second",
        "179.200",
        "Mac",
        "Intel Virtualization Technology",
        "4,096",
        "Cisco",
        "EVE-NG VM",
        "the Edit Virtual Machine Settings",
        "VMware Workstation"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "LAW",
        "ORG",
        "EVENT",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "ORG"
    ]
}