{
    "id": "fF2X6gcuZXU",
    "title": "HITLERS TERRIBLE TOWER - Giant World War 2 Anti Aircraft Flak Tower",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-01-31T14:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=fF2X6gcuZXU",
    "category": "Travel & Events",
    "tags": [
        "Hitler",
        "World War 2",
        "Abandoned Porn",
        "Ruins",
        "Flak Tower",
        "Anti Air Tower",
        "Flakturms",
        "Anti Aircraft gun",
        "History",
        "Medal of honor Airborne",
        "medal of honor",
        "World war two history",
        "Phantom 4",
        "DJI",
        "DJI mavic",
        "Dji mavic footage",
        "immigration",
        "trump",
        "president trump"
    ],
    "views": 1052752,
    "likes": 26243,
    "comments_count": 1840,
    "description": "World War 2 was a dark time for the planet. Racism was rampant, and people were being killed. This tower is one of the 8 complexes that Hitler had constructed to help protect major cities against and allied air attack during world war two.  The Flakturms were extremely effective. Watch as I fly my drone around the towers and you can see all of its history in 4K.  This is the drone I used for this video:  Here is the video game with the Tower in it:  (Medal of Honor: Airborne)  Some World War 2 History in the USA:   Here is some more reading material on the towers:  Wiki:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   MUSIC:  Buddha by Kontekst  Creative Commons  Attribution 3.0 Unported CC BY 3.0   Music provided by Audio Library   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/2joH00G",
        "http://amzn.to/2kM27KG",
        "https://youtu.be/Lm9M0YMuqRI",
        "https://jamescalbraith.com/2012/08/13/a-different-vienna-part-1-the-flakturms-or-dont-mention-ze-war/",
        "https://en.wikipedia.org/wiki/Flak_tower",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://soundcloud.com/kontekstmusic",
        "https://creativecommons.org/licenses/by/3.0/",
        "https://youtu.be/b6jK2t3lcRs"
    ],
    "transcript": "[Music Playing] I was in Europe weeks ago and one of the coolest things I saw was this Anti Aircraft Tower, or Flak Tower from World War II. All of this footage I captured in 4k with my DJI Mavic drone. [Music playing] Some of you guys might recognize this tower from the Medal of Honor video game where you get sucked out of a destroyed airplane and parachute down onto the top of the tower itself. The towers could fire 8,000 anti aircraft rounds per minute, and had an effective range of about 8 miles. This tower is legitimately a real place right here in Vienna, the largest city in Austria. Its a 54 meter tall anti aircraft tower that ironically is just about the same height as the Statue of Liberty herself. Hitler commissioned 8 of these complexes during the 2nd World War to help protect his cities against the allied air attacks. The one youre looking at right now was built just after 1940. If you remember, Hitler is that delusional lunatic who discriminated against people based purely on their religion. This particular complex in Augarten has 2 towers: a square tower that held the observation and radio equipment, and the round tower that held all of the anti air firepower. The sheer size of these towers is impressive. They also doubled as bunkers to help protect civilians during an attack. At one point during a battle in Berlin, the tower held an estimated 30,000 civilians inside. Some very terrible things happened during World War II. Contrary to the video game though, these two towers in Augarten never saw much action. The allied forces tended to avoid the areas where the towers were located, for obvious reasons. Im sure they wanted to keep their airplanes from looking like Swiss cheese. Today the towers are closed off and in serious need of repair. They are way too enormous to be cost effectively torn down since the walls are 3 meters thick. Thats 11 feet of solid concrete. So here they still stand today as a reminder of the past; a memorial for mistakes, or a physical monument that hopes current world leaders can learn from history and not build ginormous, unnecessary concrete structures. Id like to film more drone videos like this in the future and mix them in with my regular teardowns and durability tests. So hit that thumbs up button if you enjoyed seeing history or if you learned something new, and Ill keep the videos coming. Thanks for watching. Ill see you around.",
    "transcript_keywords": [
        "Europe weeks ago",
        "Europe weeks",
        "Anti Aircraft Tower",
        "Flak Tower",
        "World War",
        "DJI Mavic drone",
        "Tower",
        "Anti Aircraft",
        "DJI Mavic",
        "weeks ago",
        "towers",
        "Aircraft Tower",
        "Europe",
        "Flak",
        "World",
        "Medal of Honor",
        "Anti",
        "anti aircraft rounds",
        "War",
        "Aircraft"
    ],
    "transcript_entity_values": [
        "Austria",
        "the 2nd",
        "Flak Tower",
        "World War II",
        "about 8 miles",
        "8",
        "54 meter",
        "1940",
        "two",
        "Hitler",
        "3 meters",
        "World War",
        "11 feet",
        "Vienna",
        "an estimated 30,000",
        "Augarten",
        "DJI Mavic",
        "4k",
        "weeks ago",
        "Swiss",
        "Europe",
        "today",
        "8,000",
        "Today",
        "the Statue of Liberty",
        "Berlin",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "GPE",
        "DATE",
        "PERSON",
        "EVENT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "EVENT",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "NORP",
        "LOC",
        "DATE",
        "CARDINAL",
        "DATE",
        "FAC",
        "GPE",
        "CARDINAL",
        "CARDINAL"
    ]
}