{
    "id": "ffnK3junTBY",
    "title": "BlackBerry KEYone Hands On",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-02-25T19:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=ffnK3junTBY",
    "category": "People & Blogs",
    "tags": [
        "blackberry mercury",
        "blackberry keyone",
        "blackberry key1",
        "blackberry 2017",
        "blackberry mobile",
        "blackberry new",
        "blackberry phone",
        "blackberry android",
        "mrmobile",
        "mwc 2017"
    ],
    "views": 432003,
    "likes": 9081,
    "comments_count": 648,
    "description": "When I last laid hands on the BlackBerry KEYone, it didn't have a proper spec sheet, it didn't have finished software, and it went by the codename \"BlackBerry Mercury.\" At MWC 2017 in Barcelona, though, everything's gotten official. The new BlackBerry KEYone has a full set of specs, a proper software load  and even a price tag. Join Michael Fisher for a hands-on rundown of the newest phone in one of the oldest phone families: this is the BlackBerry KEYone first impressions video from MrMobile!   [SUBSCRIBE]     [SPONSOR]  MrMobile's MWC coverage is brought to you by Thrifter: a new way to save money from the people behind Mobile Nations. Use Thrifter to shop for everything from gadgets to home goods based on value  not hype. Sign up for the daily mailer at  to get thoughtfully selected tech deals daily from your favorite retailers like Amazon and Best Buy ... without the fluff.    [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Cutting Edge Technology\" by Olive Musique, available at Premium Beat:   \"Smart Ideas\" by Julian Bell, available at Premium Beat:    [SOCIALIZE]         [THUMBNAIL]  Custom thumbnail by Jose Negron, Mobile Nations   [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://thrifter.com",
        "https://www.premiumbeat.com/royalty_free_music/songs/cutting-edge-technology",
        "https://www.premiumbeat.com/royalty_free_music/songs/smart-ideas",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Mr. Mobile] When I last laid hands on the new Blackberry, it didn't have finished software, it didn't have a final spec sheet, it didn't even have a proper name. What a difference a couple of months make. From an echo chamber of a hotel room in Barcelona, I'm Mr. Mobile and this is a hands on with the Blackberry KeyOne, the smartphone formerly known as Mercury. Not much has changed on the hardware front here, it's still the same aluminum candy bar, built to be used with one hand. It's important, Blackberry's philosophy is that, if you have to put your coffee down to use your phone, then there's something wrong with your phone. I got to spend about two hours with the KeyOne this time, and I think Blackberry really nailed the hand feel. It's a very comfortable smartphone to use. The rounded lower corners mean it doesn't dig in to your palm, and the soft touch coating on the back plate make it easy to grip. As you can, these are still pre-production devices with some uneven button back lighting, but the keyboard is now much closer to the final product. While it's not as spacious as the bolds of old, these keys are much clickier than the mushy pad on 2015's Blackberry Priv. Now, some of you were concerned about the placement of those capacitive buttons above the keyboard, and now that I've used the phone a little longer, I see what you mean. If you're using the keyboard as a track pad or doing some swipes to autocomplete sentences, you're gonna accidentally hit those function buttons until you train yourself to avoid them. On the brighter side, the spacebar doubling as a fingerprint sensor totally works. There are two little LEDs to remind you it's there. The placement is top notch, and the sensor is very fast. Also fast, the software. None of the pokiness of the Priv is present here. The KeyOne is zippy, even on this early build. Of course, the real test will come during the full review period, when I've got three email accounts and 100 apps clogging up the works. But my initial impressions are good. The usual Blackberry benefits are here, too. The hub that gathers all your notifications into one list, the super bright LED that tells you about those notifications in the first place. The D-Teck security suite, and my favorite, the convenience key on the side. It opens any app you want with a click, or mutes the audio on a call. Like the millions of Blackberrys that came before, this is a smartphone very much aimed at corporate and government users. Those users aren't gonna care much about the spec sheet, but you do, so here it is. In the predictable category, expandable storage, scored for GSM and CDMA networks, and a full HD display. In the pleasant surprise department, the same camera sensor used by the Google Pixel, with a responsive view finder offering a fairly complete feature set. On the controversial side, a mid-range processor with three gigs of RAM. I'm disappointed with the latter, but I'm actually okay with the Snapdragon 625, and here's why. That's the same power efficient processor used by the Moto Z Play, a speedy phone with excellent battery life. It's such a long laster that it's actually my primary show phone for this Barcelona trip. And the battery in the Blackberry is just as big. That should make the KeyOne a real marathon runner, and when you do need to top it up, there's a quick charge 3.0 USB power delivery and an optional boost mode that shuts down power intensive features so the phone will charge even faster. Blackberry claims its zero to half charge in just 36 minutes. At a starting price at around 549 US dollars when it goes on sale in Q2, the KeyOne is gonna be a tough sell to any consumer who doesn't need a physical keyboard. I mean you can get better specs on the Dteck 60 for 100 bucks cheaper. But for me, it's tough to get excited about the Dteck 60, whereas it's tough to fight my excitement for the KeyOne, and anyway, consumers are secondary to Blackberrys quest to recapture its enterprise base. We'll see how likely the KeyOne is to help with that when it comes time for the full review. Subscribe to Mr. Mobile on YouTube, and pay a visit to my MWC sponsor. Thrifter is a new way to save money on everything from gadgets to home goods by shopping based on value and not hype. Sign up at Thrifter.com and get thoughtfully selected tech deals from places like Amazon and Best Buy daily, without all the fluff. Until next time, thanks for watching, and stay mobile my friends.",
    "transcript_keywords": [
        "Blackberry",
        "KeyOne",
        "laid hands",
        "Blackberry KeyOne",
        "phone",
        "Blackberry Priv",
        "finished software",
        "keyboard",
        "Blackberry philosophy",
        "DTeck",
        "Mobile",
        "hands",
        "hand",
        "smartphone",
        "make",
        "usual Blackberry",
        "Blackberry benefits",
        "Blackberry claims",
        "Blackberrys quest",
        "side"
    ],
    "transcript_entity_values": [
        "3.0",
        "just 36 minutes",
        "60",
        "half",
        "100",
        "GSM",
        "Priv",
        "CDMA",
        "Moto Z Play",
        "YouTube",
        "60",
        "Thrifter.com",
        "USB",
        "the Blackberry KeyOne",
        "Blackberry Priv",
        "Mobile",
        "Q2",
        "Amazon",
        "the Google Pixel",
        "about two hours",
        "RAM",
        "first",
        "KeyOne",
        "two",
        "Thrifter",
        "Best Buy daily",
        "around 549 US dollars",
        "the millions",
        "zero",
        "Barcelona",
        "Mercury",
        "Blackberry",
        "2015",
        "three",
        "one",
        "100 bucks",
        "MWC",
        "a couple of months"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE"
    ]
}