{
    "id": "fGWhskVyPus",
    "title": "Three Mechanical Keyboards but you can only pick ONE - Dareu Keyboards",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-03-21T18:00:57Z",
    "video_url": "https://www.youtube.com/watch?v=fGWhskVyPus",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "dareu",
        "keyboard",
        "swallow",
        "cool",
        "bird",
        "screen",
        "mic",
        "wfh",
        "setup"
    ],
    "views": 194370,
    "likes": 6150,
    "comments_count": 355,
    "description": "Get $5 off your Magic Spoon order with code shortcircuit5 at   Dareu sent over a few keyboards for Plouffe to check out, but we could decide which to make a video on, so we chose all three! Which of these crazy keyboards is best? Plouffe is here to find out!  Check out the Dareu A84 PRO:  Check out the Dareu Z82:  Check out the Dareu A87L Swallow:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 We've got LOTS of stuff to talk about 0:29 A84 Pro Unboxing, design impressions, and MX Cherry Nixie switches 4:38 Z82 Unboxing and design impressions 6:38 A87L Unboxing and design impressions 9:17 Sponsor - Magic Spoon 9:56 Trying out the A84 Pro's lightbar 10:29 Typing tests 13:04 Thoughts on the keyboards and pricing 16:33 Outro",
    "description_links": [
        "https://lmg.gg/magicspoon",
        "https://lmg.gg/1iraE",
        "https://lmg.gg/qIWhn",
        "https://lmg.gg/rN5fj",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- What's up guys? DAREU Sent us a bunch of keyboards. We're gonna look at all three of them real fast. We don't have a ton of time here. There's one that I'm especially excited about. That's the A84. This guy right here. Oh baby, that's pretty nice. We're gonna start with this. Also while we're here, Cherry sent us a lot of switches. I think there's 400 of each in here. And the big deal about these are, they're the new Nixies. They sent a couple other switches as well. We're not gonna talk about them so much as we will about the Nixies because what I've done, I have opened this box already. (people gasp) I'm sorry. I got real excited. This one's the really cool one and so I wanted to open it up, and while I haven't tried these Sky V3's too much, that's the switches that come with this, we really wanted to try these Nixies out. So I threw a bunch in here and we'll take a look at those. As for packaging, it's pretty simple, you know, we've got the keyboard down here. We got a little layout guide here, quick command stuff. It is all in what appears to be Chinese, so I can't read this, but you know what, they got some stuff on here like USB, Windows or Mac, function numbers. I can read those (laughs) so it's better than nothing. Before I open this keyboard, I'm gonna check out the accessories box, which I actually haven't looked in here yet. Oh, okay. We gotta switch and key cap puller, we have our cable. Yeah, we got some extra specialty keys. So if you don't like the gray key caps that come with this, you can change 'em up for a bit of yellow. We've got the dim gray one, which is great for me 'cause I'm not a big fan of red or pink. - [David] What do you got against pink? - Nothing. I got a pink hat on. You know, I don't hate it. It's just for my accessories on my desk. It's not really the color that jives with me too well. One cool thing that I love about this guy is that it's hot swap, it's Bluetooth, and it also has (flicks button) a roller bar, which also clicks. This is great. I wanna see more bars instead of knobs recently. Bars are, you know, they're pretty neat. (peeling plastic) We don't use 'em that much. One nice thing about being able to open this one a little bit, I didn't fully disassemble it, I just took the switches and key caps off, but I got a good look at the plate, and it's this really nice split poly carb plate. It's got a ton of flex. There's all these flex cuts in it. Super nice and gaskety, with not, you know, not too much play though. I like the feel of gasket but I don't like the really, really soft ones. It's just a bit too much extra play on when you're trying to bottom out. And you know what, while I really did like the Sky V3's that were in here before, I really like these Nixies. They come un-lubed. I'm pretty sure there's like some light factory lube on the springs, but that's about it. These were originally a Nix dwarf keyboards back in the 80s. I have never used them. I am not that old, so I don't have any kind of history with these. I've just heard that they're really good. I can see why. They're just a pretty decent linear overall. There's like zero wobble, a little bit in the stem wobble, like none. It's pretty tight. No, no, there's a tiny, tiny bit of play, but I don't think you need like films or anything to fix these up. Yeah, the light strip here is super cool. Apparently there's a little mic on here and it'll pick up noise and kind of like play, you know, a volume mixer based on how loud it is. That's super neat. But yeah, overall construction is very solid. This whole thing is aluminum. It's got a pretty decent typing angle on it, too. There's no feet though, so you're not gonna be able to change that. And it does 2.4G, as well as Bluetooth. We've got the dongle that sits really nicely in the little carrier here. It can still go wire. There's a USBC switch here. Couple buttons, I'm assuming one is power and one is light. It's got a little light there. I don't know if that's for the RGB. There's, I don't know if there's full RGB. I think there's just white back lighting. And then on top of that, we've got our little switch here that'll go between the three devices that this thing can connect to based on the connection that you're using, whether it's the 2.4G or the Bluetooth or the wired. I definitely like it with this big 75% layout with, you know, you get your full F-row, you get your arrow keys, Page Up, Page Down, Delete, all that good stuff, you know, like a full size Shift and Enter key. The stabilizers that came with it aren't bad either. It all came pre-installed and, while they could probably be lubed up a little more, they're not bad. Just for reference, these are the Sky Blues that it came with. V3, I do believe. And they're pretty nice. Like they're definitely not bad. We mostly just wanted to change them out because we wanted to put the Nixies in something to experience them because of how legendary they are. Something else that they sent us, along with these three keyboards, are these other switches that they've got. They're the DAREU A Violet Gold V2 tactile one. Come in a little 45 packs. (key cap clicking) Oh yeah, the bump is like mostly at the top here. I kinda like these. I actually really like the color, too, and just the visual aspect of them. I like this really clear kind of yellowy gold kinda look with the purple accents. It's really pretty. Only three pen, but whatever. I \"DAREU\" to keep watching this video 'cause we've got more keyboards. I got the Z82! This one's also pretty cute, actually. It only comes in I think two colors. Pink and moccasin? I dunno why they chose moccasin as a color, but it is what it is. I'm really excited for this guy 'cause it's got these really cute rounded key caps, but we gotta check out what else is in the box first. I got some instructions. - [David] The accessorize box. - Oh yeah, the accessorize box. Good catch, David. I didn't even (laughs) that's pretty good. This one comes with a decent little white cable here. Nothing too crazy. It's not sleeved or anything like that, but you know, I like it. It'll go with the keyboard itself, which is just white and pink. That's it. That's all we get in the box. Wait, no way. There's more accessories? Hey we get some more key caps if we want to change 'em out for a big pink one here or a nice Enter key here. That's cool. I actually really like the look of this guy. (typing on keyboard) Sounds okay. We'll get more into that later. It's super cute though! You got a paw print for the rotary knob. I love how well the switches fit in with the plastic molding on the case, too. There's these little like edges here that kind of curve in. It's like teeth. It's like looking at gums in a mouth with teeth. I know that that's creepy, (typing on keyboard) but there's something about it that I actually really like. I would buy this in pink every time for that exact reason and I actually wouldn't buy the moccasin one just because I want to keep this weird teeth kind of motif. What if we got teeth key caps, and you put 'em all up in like the F-row? Aw, that would look sick. That would look so cool. (Nick laughs) This one's also wireless, but it's got some feet so you can change the angle on it, which is great. And I think they're two stage. (keyboard clicks) Yeah, it looks like it. Oh nice. Always a plus. This one's got a smaller battery. It's only 2000 milliamp hour, and I don't think it's hot swap as well, or at least they don't mention it anywhere on the page. Let's try and take a look. Yeah that's definitely soldered on, so we'll leave it. That's fine. That's the Z82. Let's check out the other one. At long last, the A87L. I actually didn't see the \"L\" in the title anywhere on the website, so that's a surprise for me. I already like the box a lot. I'm a big fan. I like yellows and purples together. - You're a Lakers fan, huh? - Am I? This one's pretty cool. I like that the plastic that's keeping it safe has got little cutouts for the key caps. Not super necessary. It could have just been uniform. Let's see if there's anything else in the box underneath. And there is. We've got cable, looks like, as well as another key cap puller/switch puller. These are my favorite. I personally prefer these ones over the plastic ones. One, they're multi-purpose. You have a switch and a key cap puller in one thing, and also, I just find that with these wire clips, it's a lot easier to get in when the case is like right up against the key cap. Some extra key caps. These are just more blues to tie in with the rest of this guy. What do they got, little hearts or something? Is it the DAREU logo? Yeah, that's the DAREU logo on this key cap if you wanna really wreck the brand. And then we got a manual, user manual in English! My time to shine. Not a ton of info in here. Just like you know, how many keys it's got, cable length, stuff like that. Oh, this one's hot swap as well. Okay, so this one's a TKL 87 keys hot swap current? Oh, working current is 300 million amperes. Okay, that's fine. Yeah, NKRO. Yeah, all these have NKRO, by the way. That's like such a standard feature that I don't even see the point in mentioning it these days. Oh, what the (beep)? Okay. So it basically, it just kind of looks like a sort of a drop TKL kind of style without this top case, and you can see the switches and stuff, which I actually, I'm a big fan of this, personally, it doesn't usually quite sound as good. But I love the visual aspect of being able to see all your switches 'cause I mean, you spend a lot of time and money picking the right ones, and sometimes you know you wanna take a look at 'em. Anyways, this comes with a key cap set, (typing on keyboard) that looks pretty neat. It's got this like kind of, I don't know if that's a swallow or what kind of bird it is, but it's got cherry blossoms or something in its mouth. Yeah. Okay, neat. And then this is just held on by magnets, which was kind of cool. I guess the only problem is if you go- (drops keyboard) actually it wasn't too bad, but if you go to pick it up and move it, there's a chance that you know, this isn't gonna come with it, so be careful. Pick it up from the bottom. And even when you pick it up from the bottom like right there, I almost dropped it just 'cause of the sides. Oh and look! On the back. A87L Swallow. I was right! Those are swallows. Wow. I'm actually kind of amazed that I got the bird right. This one. The main difference is that this guy's wired only, so no wireless. But you know what, all my stuff is wired anyway, so whatever. (typing on keyboard) This one's not too bad. We'll do an actual typing test on the middle little bit here, but first, I dare you to listen to this segue to our sponsor, Magic Spoon! Magic Spoons healthy yet delicious cereals have 0 grams of sugar, 13 to 14 grams of protein, and only 4 to 5 net grams of carbs per serving. You can now build your own variety box with best selling flavors like cocoa, fruity, frosted, and peanut butter. And you can even add their cereal bars to your box, too. With 1 gram of sugar, 4 net grams of carbs, and only 130 calories per bar. Additionally, all of Magic Spoons' products are 100% satisfaction guaranteed. Don't like what you got? Magic Spoon will fully refund your first case of products. So click the link below to try out some of Magic Spoons tasty offerings. Build your own variety box. The link below and use code short circuit for $5 off. Oh! Whoa! This thing works! (typing on keyboard) It's a little too sensitive. Yeah, my only complaint is that like me talking, even if I talk kind of quieter, like this is me talking a little quieter and it's like, it picks me up still, but it feels like it tries to peak almost instantly. Like watch me type and it's gonna peak just off the typing. (typing on keyboard) Not quite fully, but like pretty close. Either way though, that's like, a super cool feature that I haven't seen anyone else do. So if you just want the novelty of this keyboard, I mean that's kind of cool. That's kind of worth it to me. The RGBs not bad, it's pretty sweet. Let's do our classic monkey type typing test. (typing on keyboard) Wow, 113, 98%! That's not bad. I think that's one of the better ones I've had on here, to be honest. I like the keyboard and I like the Nixies. I'm pretty sure that they only come with a bit of factory lube on the spring, and they feel and sound a little scratchy, so they can definitely benefit from some more dedicated lubing. It's not bad. Let's try the other one. Let's try this pink, this pink bad boy right here. One advantage to actually all of these boards is that none of them are like a 65% where you need a function layer to hit all of the F keys, which is a big plus for me personally. I just don't like having to layer stuff and I like having my like F5 just as a single key. (typing on keyboard) 121, 95. I actually really, really like this thing. I was really getting into a groove there and going pretty quick but then I stumbled on a couple words and that kind of dragged me down. But I actually am a huge fan of the spacing on all the keys. It means that your fingers are never getting stuck on anything even though they're cupped because the keys aren't like directly next to each other. With the spacing there, you can actually, yeah, type pretty easily without stumbling all over the place. Last but not least, we got the A87L, the Swallow. We're gonna try this guy out. (Nick scoffs) I did it, see? I went to pick it up and it came off right there. One thing that I never noticed. This is the cable that came specifically with the A87L, and it's got these cool little channels in here. The only way to plug it in is perfectly safe and like impossible to screw up. So that's actually kind of cool. I've never seen guided channels for a USBC connection before. And then another big bonus for people who like to keep things super neat and tidy, you can go either to the left for your cable or you can go to the right, depending on you know, where everything is in your setup and where you want the wire to go. You can also just go straight up if that's what you want to do. I also love the blue backlight on this. It's actually really bright and vibrant. It's strobing on camera, you guys. I'm sorry. I promise this thing looks steady and crisp in person. I actually really like the tone of this one. (bell dings) (typing on keyboard) 99, 93%. I think that's one of the slowest tests I've ever done on here. These switches that are in here are crazy light. I can't remember the ones that we got with it, so lemme just take a quick look. So these should be DAREU Aquas and, while I'm not crazy about them because I've been moving away from at least a lighter linear, I like- I'm moving back to linears, but I like heavier ones. This caused me to make a ton of mistakes because I would just go to, I don't know, move over and type a little lightly and then it would, I don't know, they're too light for me personally, but if you like a really light linear, that could be the switch for you. I \"DAREU\" to try these out. - Nope. - Overall, I definitely like the A84 Pro the most. That being said, it's easily the most premium out of all three of these, both in terms of price and in terms of materials. You're getting pour on foam, there's flexicut, poly carb plate, it's got another silicone layer on the bottom, I think. And like you've got this cool roller, you've got the cool LED strip, like it's honestly just a pretty decent keyboard. As for between these two, the less premium ones, honestly they're both fine. I think that they're okay picks. I lean towards the A87L Swallow, simply because it's still hot swap, and I personally don't need a wireless connection. I use wires basically on every peripheral I have, and I already have a bunch of fancy keyboard cables that I would like to use with this guy. I actually have like three blue cables that would actually match this quite well. That being said, in terms of just visual design, I think I'm really sold on the Z82. It might not be hot swap, and it might not sound the best, it might not, you know, have the most premium experience, but I just love this like molded finish with all the key caps kind of just hugged a little bit by the pink here. I still think it looks like teeth. I'm like super sold on someone making a bunch of like molar key caps and then filling up the entire F-row with it. Or even just the bottom special row. I think that'd be really cool. Now, as for price, all of these guys are on sale right now, and I think for the sale prices, they're all perfectly reasonable. It's $255 for the Pro, which is a little expensive, but honestly, considering the package that you're getting with this, that's not bad. These guys though, these are both on sale for $130 right now, which honestly at that price, that's worth it. You get the full keyboard, it's a pretty decent experience, especially with the hot swap. They're usually a little more expensive though. This guy is normally about $200, and then the Swallow is normally about $170, $180, somewhere around there. At the more premium prices, I am not a hundred percent sure how sold I am. They feel decent, but nothing like super standout. But at $130, you know, that's not bad. I think that $130 for a full keyboard with some pretty neat features and a cool aesthetic, wireless as well, really kind of pushes it over the line into the terms of like, perfectly fine. Which one would I buy? Honestly, you guys might hate me, but I'd buy this thing. (Nick laughs) I want the teeth, I want to make this a reality. I want to go buy molar key caps and then make the dream come true. As for the best value, it's really tough. I think that if this guy was a little bit cheaper, like in the $225 range, this is the best value. This is an actually pretty solidly put together keyboard. I think that it's a fair price for what they're asking right now at the $250, $400 is kind of steep, but it's not out of the realm of possibility when you're talking about wireless and some kind of niche features on a like more premium, fully aluminum custom keyboard. But I think if you want wireless, the best value is really with this guy. The Swallow is great, but unfortunately, one, I'm still kind of back and forth on the magnet thing. I think it's great, but also you're gonna eventually, you're gonna one day you're gonna lift this thing up and it's just gonna fall. And it's wired, so you know, for the same price, do you want wireless or do you want a TKL? It's really gonna come down to preference at the end of the day, and I personally am kind of digging this guy right now. So thanks for watching. That's Short Circuit. Like and subscribe. Oh yeah.",
    "transcript_keywords": [
        "key caps",
        "kind",
        "pretty",
        "key",
        "key cap",
        "cool",
        "Yeah",
        "guy",
        "thing",
        "caps",
        "keyboard",
        "box",
        "bad",
        "keys",
        "DAREU",
        "key cap puller",
        "Nixies",
        "pink",
        "bit",
        "key caps kind"
    ],
    "transcript_entity_values": [
        "USBC",
        "400",
        "14 grams",
        "Nick",
        "98%",
        "TKL",
        "Magic Spoon",
        "only 130",
        "100%",
        "Only three",
        "three",
        "a ton",
        "One",
        "0 grams",
        "93%",
        "about $200",
        "250",
        "one",
        "Magic Spoons",
        "USB",
        "Page Down",
        "5",
        "1 gram",
        "F-row",
        "only 2000 milliamp hour",
        "F5",
        "Nixies",
        "NKRO",
        "130",
        "the Sky Blues",
        "only 4 to 5",
        "99",
        "the Sky V3's",
        "all three",
        "2.4",
        "13",
        "Cherry",
        "David",
        "Windows or",
        "the F-row",
        "4 net grams",
        "75%",
        "USBC",
        "Bluetooth",
        "first",
        "Chinese",
        "113",
        "the 80s",
        "two",
        "255",
        "225",
        "the spring",
        "400",
        "F",
        "linear",
        "Nixies",
        "Page Up",
        "45",
        "Mac",
        "87",
        "121",
        "about $170",
        "the end of the day",
        "Lakers",
        "RGB",
        "95",
        "Short Circuit",
        "300 million amperes",
        "Magic Spoons'",
        "65%",
        "the \"L",
        "zero",
        "English",
        "180"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "QUANTITY",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "FAC",
        "QUANTITY",
        "PERCENT",
        "LOC",
        "PERSON",
        "ORDINAL",
        "NORP",
        "DATE",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "PERCENT",
        "EVENT",
        "CARDINAL",
        "LANGUAGE",
        "MONEY"
    ]
}