{
    "id": "Fi_eKs7uUzE",
    "title": "How FAST is the 18-Core iMac Pro?",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2018-02-01T17:12:22Z",
    "video_url": "https://www.youtube.com/watch?v=Fi_eKs7uUzE",
    "category": "Science & Technology",
    "tags": [
        "apple",
        "iMac",
        "iMac Pro",
        "imac",
        "imac pro",
        "review",
        "setup tour",
        "apple imac pro",
        "imac pro review",
        "18-Core",
        "18 Core iMac",
        "18-Core iMac Pro",
        "18 core iMac Pro",
        "2018",
        "imac pro setup",
        "imac pro vs imac",
        "imac pro benchmarks",
        "xeon",
        "pro imac",
        "imac pro benchmark",
        "most powerful mac",
        "18 core vs 10 core",
        "18 core vs 8 core",
        "8 core iMac pro",
        "10 Core iMac Pro",
        "18 core processor",
        "18 core build",
        "custom pc"
    ],
    "views": 522828,
    "likes": 12875,
    "comments_count": 944,
    "description": "The fastest, maxed out iMac Pro available - Apple's 18-Core iMac Pro stacked up vs the 10-Core & 8-Core with speedtests, benchmarks, 8K transcoding & more! The $200 iPhone X Wireless Charger:   iMac Pro Configurations featured/tested in this video! 18-Core 2.3 GHz. / AMD VEGA 64 16GB / 128GB RAM / 4TB SSD 10-Core 3.0 GHz. / AMD VEGA 64 16GB / 128GB RAM / 2TB SSD 8-Core 3.2 GHz. / AMD VEGA 56 8GB / 32GB RAM / 1TB SSD  Programs used! Geekbench 4:  AJA System Test:  RED Cine-X:  Cinema 4D:  Final Cut Pro X:  Adobe Media Encoder:  Adobe After Effects:   The Galaxy S9 Leak that will disappoint America -   My Audio Setup & Gear:   Add me on Snapchat!  My Gear:  Instagram:  Twitter:",
    "description_links": [
        "https://youtu.be/dpqyOtGS56A",
        "https://www.geekbench.com",
        "https://www.aja.com/products/aja-system-test",
        "http://www.red.com/products/redcine-x-pro",
        "https://www.maxon.net/en/products/cinema-4d/overview/",
        "https://www.apple.com/final-cut-pro/",
        "https://www.adobe.com/products/media-encoder.html",
        "https://www.adobe.com/products/aftereffects.html",
        "https://youtu.be/kG_wo1lM2Tg",
        "https://youtu.be/v9hu-Avj2oE?list=PLqcaiHQwxA9gWWz-l_C2Ai536Gxz3_cLJ",
        "https://www.snapchat.com/add/tldtoday",
        "https://www.youtube.com/watch?v=yIc0umpbLNE",
        "http://www.instagram.com/tldtoday",
        "http://www.twitter.com/tldtoday"
    ],
    "transcript": "- Yo guys, Jonathan here. 18-cores and iMac are probably two things you would never expect to say in the same sentence, but with the iMac Pro that is a thing. This is the fastest iMac Pro you can buy. 18-core AMD Vega 64 graphics, 128 gigabits of ram, and a four terabyte SSD. (upbeat music) so I've got a chance to spend the last couple of days with this monster of an iMac, and I really wanted to focus on performance. For reference I'll be showcasing it against a 10-core Vega 64 iMac Pro, as well as a 8-core Vega 56 model. So jumping into the obligatory Geekbench 4 score because honesty it's just kinda fun to see where these 18-core stacked up. This did no disappoint with a multicore score of over 48,000. Now what was a little surprising but also positive is you don't lose that much in terms of the singlecore score compared to the 10-core model especially considering that the base clock on this is 2.3 gigahertz. Also what was kinda interesting for me, this was the first time I've got a chance to stack up the one terabyte, two terabyte, and four terabyte as it's reconfigurations. The bad news is the four terabyte really isn't much faster than the two terabyte or one terabyte for the matter, but on the flip side of that the good news is no matter which route you go, you're gunna get pretty much the same performance across the board. Now as far as how that power translates into performance, the first thing I did was take 8K raw footage. It was about 100 gigabytes or just over 26 minutes of footage and trans-coded that into 8K ProRes. To do this I used REDCINE-X program which really puts those cores to work. Like it was maxing them out. With the 18-core especially when you factor in multiple threads, seeing 36 insistence's running at the same time is kind of a beautiful thing. As far as what those cores translate it to, the 18-core iMac pro took a little over 39 minutes, the 10-core was 46 minutes, and 8-core iMac pro did the job in just about 51 minutes. Now your initial reaction might be five, six minutes that's not that big of a deal, but where it counts is when you do that multiple times per day, multiply that everyday for a week, for a year, that's where that really makes a difference. So next up is Cinema 4D. This is a custom scene that was tweaked by my buddy Matt Workman. But essentially it is only using the CPU to render out the scene so it's a great way to showcase the performance between the processors. The 18-core rendered everything out in four minutes flat. The 10-core was four minutes and 48 seconds. While the 8-core finished everything up in six minutes and four seconds. Again, much like the Red Raw transcoding these numbers and this time save on a small scale might not seem like the biggest deal, but over time, it definitely adds up. From there jumping over to Final Cut Pro 10. Red Raw, the iMac Pro, and final cut pro have been amazing. To give you a little run down on this project I have 8K Red Raw footage at a 12 compression. This was shot in Reds IPP2 logs have a lot of applied a few layers of color correction and then I back he rendering off to really put iMac Pro's to work. So the raw time line which is unrendered is about three minutes and taking that next importing it into a ProRes 422 file the 18-core iMac pro did that in five minutes and 51 seconds, the 10-core six minutes and 34 seconds, and the 8-core seven minutes and 22 seconds. Even though the 10-core iMac Pro still has the fastest single two out of turbo clock speed. In this case you can see in terms of final cut, the extra cores do actually make a difference. In my continuing search of programs that really take advantage of the processing power, Screenflow 7 actually takes really big advantage of all those cores with the iMac Pro. What I did was take a 5K screen recording, had a three minute project and then exported that into 4K H.264 footage. The 18-core iMac pro did that in one minute 48 seconds. The 10-core two minutes and 24 seconds, and lastly the 8-core iMac Pro, two minutes and 46 seconds. Now I did mess a little bit with Adobe Media Encoder. Took A6500 footage is about ten minutes of 4K video. I tried to transcode that into 422 ProRes. The 18-core did that in six minutes 54 seconds, the 8-core was eight minutes and 36 seconds, but for some reason, the 10-core was actually slower than the 8-core at ten minutes and eight seconds. But from what I could tell, Adobe Media Encoder really wasn't taking advantage of all that hardware. I'm going to do a little more research and a little more investigating but I did want to share those preliminary Adobe results first. Now plot twist those motion graphics benchmarks featured throughout this video were created in After Effects so naturally I thought it would make sense to render then out on these iMac Pros. So for total of six independent renders the 18-core iMac Pro finished everything up in ten minutes and 36 seconds. The 10-core was actually the fastest here at nine minutes and 43 seconds, and then the 8-core iMac Pro did the job in 12 minutes and 19 seconds. So these numbers kinda tell me a couple different things. One, the clock speed on the 10-core iMac Pro here in this case definitely makes a difference and two based off those comparisons against Adobe Media Encoder, Adobe is clearly not taking full advantage of the hardware on these iMac Pros. Honestly I still think the 10-core iMac Pro is the best value in terms of bang for your buck with performance. But, if you need that sheer processing power, those 18-cores really come in handy. Now if you line the eight, the ten and 18-core in my case the only one I haven't checked out yet is the 14-core. In terms of price and what you gain performance wise it's a pretty even jump. So if you transcode a ton on a day to day basis, or potentially use really CPU intensive programs like Cinema 4D, that's maybe where those extra cores come into play. But if your asking me, I still think again the best bang for your buck is the 10-core iMac Pro. But nonetheless the 18-core iMac Pro is a super solid performer, it is very, very powerful. Hopefully you enjoyed this video, if you did and you're feeling like being awesome make sure you guys smash that like button. This is Jonathan and I will catch you guys later.",
    "transcript_keywords": [
        "iMac Pro",
        "Pro",
        "iMac",
        "minutes",
        "iMac Pros",
        "Adobe Media Encoder",
        "Final Cut Pro",
        "fastest iMac Pro",
        "Cut Pro",
        "put iMac Pro",
        "Adobe Media",
        "iMac Pro finished",
        "Red Raw",
        "terabyte",
        "Media Encoder",
        "Adobe",
        "raw",
        "ten minutes",
        "Pros",
        "performance"
    ],
    "transcript_entity_values": [
        "two",
        "CPU",
        "5",
        "ten",
        "Cinema 4D",
        "ProRes",
        "ten minutes and 36 seconds",
        "six minutes and 34 seconds",
        "One",
        "the iMac Pro",
        "10",
        "14",
        "4",
        "iMac Pro's",
        "Adobe",
        "18",
        "four minutes and 48 seconds",
        "the last couple of days",
        "five, six minutes",
        "six minutes 54 seconds",
        "iMac Pro",
        "Final Cut Pro 10",
        "Vega 64 iMac Pro",
        "Matt Workman",
        "the iMac Pro",
        "iMac pro",
        "2.3 gigahertz",
        "K ProRes",
        "422",
        "three minute",
        "a ton",
        "Vega",
        "four terabyte",
        "over 48,000",
        "about 100 gigabytes",
        "six minutes and four seconds",
        "Reds IPP2",
        "A6500",
        "AMD Vega 64",
        "ProRes 422",
        "ten minutes and eight seconds",
        "nine minutes and 43 seconds",
        "six",
        "two terabyte",
        "two minutes and 46 seconds",
        "iMac",
        "eight minutes and 36 seconds",
        "12 minutes and 19 seconds",
        "a year",
        "first",
        "five minutes and 51 seconds",
        "Cinema",
        "four minutes",
        "about ten minutes of",
        "these iMac Pros",
        "12",
        "eight",
        "Adobe Media Encoder",
        "36",
        "just about 51 minutes",
        "Screenflow 7",
        "seven minutes and 22 seconds",
        "about three minutes",
        "8",
        "two minutes and 24 seconds",
        "one minute 48 seconds",
        "56",
        "Red Raw",
        "Adobe Media",
        "128 gigabits",
        "just over 26 minutes",
        "one terabyte",
        "46 minutes",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "TIME",
        "TIME",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "PERSON",
        "LAW",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "TIME",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "ORG",
        "TIME",
        "TIME",
        "DATE",
        "ORDINAL",
        "TIME",
        "ORG",
        "TIME",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "TIME",
        "QUANTITY",
        "TIME",
        "PERSON"
    ]
}