{
    "id": "fiQ6ZEjwWmw",
    "title": "How Video Games Get Rushed Out",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-12-11T18:01:51Z",
    "video_url": "https://www.youtube.com/watch?v=fiQ6ZEjwWmw",
    "category": "Science & Technology",
    "tags": [
        "development",
        "crunch",
        "video game",
        "delay",
        "working conditions",
        "cyberpunk 2077",
        "programming",
        "game industry",
        "hours"
    ],
    "views": 373075,
    "likes": 21490,
    "comments_count": 1438,
    "description": "Learn more about the MSI Aegis TI5 today at    How does development crunch work?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://geni.us/BBwfqs",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- There are few things more exciting to gamers than the launch of a hotly anticipated new title, but even with on-sale dates announced far in advance, you'll hear tales of development studios having to delay their launches or forcing their employees into something called crunch time in order to hit a street date. But what does crunch time consist of and why does it even happen? Development crunch is when programmers and other employees have to put in extra hours at work in order to meet a deadline. If you're working in another field like law or sales, where time-sensitive projects are often the norm, then you know this isn't a new concept. But development crunch has made headlines lately in mainstream media as video games have exploded in popularity in general. But even in the gaming world, the modern history development crunch goes back at least to 2004, when the spouse of an EA employee famously wrote a letter detailing how crunch-time workers were on the job for 13 hours a day, seven days a week, without even being offered any additional compensation or time off. Even now, 100-hour work weeks are not uncommon in the development world during crunch time, with one infamous example being how Telltale Games laid off a couple hundred employees right after some of them were on the job until 3 in the morning to finish working on \"The Walking Dead.\" But why have crunches that demand so much from workers become so common? Well, the difficulties studios face from getting a game out on time comes in part from how many moving pieces there are, from the technical side of things, to art and design, to testing. Together, these mean that delays in any one part of the studio can have a ripple effect down the line. For example, a small bug in the game's code may not become evident until it causes problems for other departments that rely on that code, and oftentimes identifying and fixing a bug is a time-consuming process. And because game design is so collaborative, it becomes tricky for the folks who work on games to push back against crunch-time business practices. Unlike a traditional blue-collar field like manufacturing, where there are typically bright lines between workers and management, the fact that game studio employees are expected to be creative problem solvers blurs those lines, especially as game companies, much like other tech firms, tend to have go-getter cultures in which workers often feel like they have to keep up with the most dedicated employees lest they be seen as low-performing. Many folks who work in game development tend to be relatively young and have flexible schedules, so although crunch time is unpleasant, these employees might feel that their employers won't have much sympathy for them wanting to use their free time for non-work purposes if a deadline is looming. And obviously there's nothing wrong with working hard or expecting employees to do so. But many are concerned that the development industry has taken this concept to an extreme, especially as mistakes tend to pile up when workers don't have enough time to rest or pursue other activities, since coding requires a high degree of concentration that's harder to pull off when you're stressed or sleep-deprived. But development crunch can result in an on-time release instead of months after the promised date. So despite calls for change that include everything from a labor union for game developers to closing legal loopholes that allow companies to refuse paid overtime, crunch remains a common practice in the industry. Because the business model of many studios has shifted away from cranking out lots of separate titles and toward concentrating on a few popular franchises and profiting off continuous DLC releases, consumer demand for frequent game updates is quite high, meaning studios are always fighting deadlines. This pressure on devs to keep up with their competitors also means 11th hour requests for changes are common from management, which often require more crunch time. The good news, however, is that with more attention brought to the issue, a number of large studios have begun to explore ways to reduce the burden of crunch time. In the meantime though, if you happen to know someone who works in game development, a little emotional support can go a long way. This video was brought to you by MSI. Check out MSI's MEG Aegis Ti5 gaming PC, with up to a 10th gen Intel Core i5-10900K processor, DDR4 memory and up to an MSI GeForce RTX 3080 graphics card. It features a gaming knob, a Silent Storm Cooling 4 for excellent heat dissipation, and Thunderbolt 3 for transmitting data in the blink of an eye. There's even MSI Mystic Light RGB customization. So check it out today at the link below. Thanks for watching, guys, if you liked this video, hit Subscribe, give us the thumbs up, and be sure to hit up the comment section, where you can put your own ideas for topics that we should cover in the future.",
    "transcript_keywords": [
        "crunch time",
        "Development crunch",
        "crunch",
        "called crunch time",
        "onsale dates announced",
        "development",
        "time",
        "game",
        "exciting to gamers",
        "hotly anticipated",
        "hear tales",
        "launches or forcing",
        "employees",
        "game development",
        "called crunch",
        "game studio employees",
        "crunch time consist",
        "studios",
        "game development tend",
        "MSI"
    ],
    "transcript_entity_values": [
        "MEG Aegis",
        "weeks",
        "Telltale Games",
        "10th",
        "The Walking Dead",
        "seven days",
        "GeForce",
        "one",
        "at least to 2004",
        "Intel Core",
        "EA",
        "3 in the morning",
        "Thunderbolt 3",
        "months",
        "Subscribe",
        "3080",
        "a couple hundred",
        "13 hours",
        "MSI",
        "100-hour",
        "Mystic Light RGB",
        "11th hour",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "PRODUCT",
        "TIME",
        "DATE"
    ]
}