{
    "id": "fjSX1j4WBRo",
    "title": "Sony Xperia 1 Review: Kind Of A Stretch",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-07-19T04:01:12Z",
    "video_url": "https://www.youtube.com/watch?v=fjSX1j4WBRo",
    "category": "Science & Technology",
    "tags": [
        "xperia 1 review",
        "sony xperia 1 review",
        "sony xperia 1 camera",
        "sony xperia 1 vs oneplus 7 pro",
        "sony xperia 1 vs pixel 3",
        "sony xperia 1 vs galaxy s10",
        "mrmobile",
        "android central",
        "michael fisher"
    ],
    "views": 362218,
    "likes": 10241,
    "comments_count": 835,
    "description": "Sponsored by Upsie. Upsie gives you affordable, reliable warranties for all your electronic devices! Click here and use code MrMobile for 10% off your first purchase:   The Xperia 1 review unit in this video was provided by Clove Technology. To buy your own Xperia 1, visit Clove here:    [SONY XPERIA 1 REVIEW]  There are two reasons to buy a phone as tall as the Sony Xperia 1. One  you want to watch super-modern 21:9 video in crisp 4K HDR  or Two  you need to film that same kind of video and you dont want to buy a dedicated camera to do it. If youre in either of those camps, and you were let down by last years RED Hydrogen One, the Sony Xperia 1 might be the phone for you. Speaking as a YouTuber who would shoot every video on a smartphone if he could get away with it  that means the Xperia 1 has my attention right out the gate. And its unquestionably the best Sony phone Ive ever touched (which isnt the backhanded compliment it might seem). The thing is, though: if youre not a mobile videographer or a sucker for smartphones that stand out  you can get a phone that fits your needs for much less than the Xperia 1 costs.   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S SONY XPERIA 1 REVIEW]  MrMobile's Sony Xperia 1 Review was produced following two weeks using a Sony Xperia 1 review device on T-Mobile US. The device was a European J8110 model provided by Clove Technology. As this version of the Xperia 1 is not optimized for US networks, no tests on reception or throughput were performed. See Android Centrals review for additional information. In keeping with MrMobiles review policy, no compensation was requested or accepted, and neither Sony nor Clove Technology were given editorial input or copy approval rights on this video.    [PRODUCTS IN THIS VIDEO]  Sony Xperia 1 [Clove Technology]:    [SOCIALIZE]        [MUSIC]  Business Calling by Immersive Music, available at Premium Beat:   Chill Waves by Roommate, available at Premium Beat:    Road to San Francisco by Magnetize Music:     [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #sonyxperia1 #sonyxperia #xperia1 #smartphone #cinematography #videography #anamorphic",
    "description_links": [
        "http://mrmobile.tech/1JC",
        "https://www.clove.co.uk/products/sony-xperia-1",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.clove.co.uk/products/sony-xperia-1",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.premiumbeat.com/royalty-free-tracks/business-calling",
        "https://www.premiumbeat.com/royalty-free-tracks/chill-waves",
        "https://www.premiumbeat.com/royalty-free-tracks/road-to-san-francisco",
        "http://www.mobilenations.com/external..."
    ],
    "transcript": "- This video is sponsored by Upsie. (upbeat music) There are two reasons to buy a phone this long one you want to watch super modern 21:9 video, or two, you want to film super modern 21:9 video. If you're really into mobile cinematography and you were let down by last year's RED Hydrogen One, well the Sony Xperia 1 might be the phone for you. If you're basically anyone else though, you can get what you need for much less. (upbeat music) Sony built the Xperia 1 around this 4K OLED display, and folks, it's a grand slam. It's not just that it's one of the sharpest screens you can find on a phone. Sony also knows how to showcase it. Watch the tasteful animations here as you transition from always on display to the lock screen into Android 9 pie. This is one of the only phones I've kept the stock wallpaper on for the whole review period, because of just how it makes this screen sing. I'll be honest, I don't watch a lot of 21:9 videos, so the aspect ratio is wasted on me and as is the focus on delivering the most accurate HDR colors for cinema files, but stand the phone up in portrait mode, and I'm in heaven. Reddit, Twitter, Google Now, anything that presents information as a vertically stacked list. So most of what you look at on a phone, has so much more space to spread out. I've carried the Xperia 1 alongside a Pixel 3 and OnePlus 7 Pro for the past week. And whenever I've switched back to the Google phone, it's felt cramped, and the OnePlus has felt huge. The only time the screen has been a pain is in Instagram, which has always had trouble adapting to Android various aspect ratios, but we forgive them for that you know it's not like they're backed by the full weight and resources of a multi-billion dollar global conglomerate or anything. That display sits with refreshing notchlessness in a chassis that comes in your choice of boring black or princely purple. My review loaner from Clove Technology is the purple one and it's absolutely gorgeous in person. I'll drop a link to Clove in the description if you want to order one of these. Behind that pretty face you've got the brawn, a flagship should have in 2019. Day to day use is plenty snappy and games like World of Warships really shine on this screen. If you fill up the onboard storage, you can add more with a micro SD card and the stretched shape helps with the lower tech use case too. Talking on a long narrow phone is more comfortable and when you switch over to speakerphone. The bottom firing speaker works in concert with the earpiece to give you a semblance of stereo. (gentle music) To this solid foundation, Sony has added less chrome than in previous years, but it still tosses in more than it needs to. The dynamic vibration feature, is supposed to fool you into thinking the phone has more bass than it does by using judicious haptic bursts from the vibration motor but it mainly just comes off feeling like you're getting notifications while you're trying to watch your video. Side sense tries to add value in the form of shortcuts you can trigger using gestures at the edge of the screen, but I found it at once too hard to activate intentionally and too easy to activate by accident. Fortunately, you can disable the cruft while still enjoying useful features like Battery Care. See, fast charging is great, but too much of it will reduce the life of your battery in the long term. So if you're not in a rush to top up like say, when you're charging overnight, you can tell Battery Care to charge slowly instead, so it hits full right before you wake up. If you're buying a phone to last you a few years, this is an awesome feature and more manufacturers should adopt it. (upbeat music) Up till now this mix of standouts and stumbles has favored the former, but the phone starts to fall down on its camera. There's great potential here, you get the versatility I crave with three 12 megapixel cameras, a primary, a 2X telephoto and a third with 130 degree wide angle lens. From boiling cheese to Bow Market to a BMW. It lets you fit a lot more in the frame. And while sometimes that tends to distort the end result, well, sometimes that's exactly the look I'm going for. And when it's not, the fix is just a click away. And during the two weeks I've used this phone I've managed some respectable captures. Shooting side by side with the Pixel 3, Sony even edged out Google a few times. Feature wise, it's amazing. There's eye tracking to keep focused when humans are your subject. And if you're a filmmaker who loves shooting on mobile, the Cinema Pro app gives you tons of control over your video camera, more than any phones since the LG V20 I think. Also making its return super slow motion filming. Sony paved the way for this crazy 960 FPS mode two summers ago, and I just can't get enough of it. As you can tell, it really works best when water is involved. So it's fortunate that the Xperia 1 is IP 65 and IP 68 water and dust resistant. Now unfortunately, it's not all lilacs and lavender. That super slow motion, it's exactly the same as it was two years ago, a tiny three or six second buffer and none of the motion activated conveniences, Samsung brought along with its own Super Slow-Mo mode last year. As for that wide angle camera I love so much, it doesn't have variable focus, nor can it double as a super macro lens like the one on Huawei's P30 Pro. And as for just everyday casual shooting, well for every time where the Xperia outperformed the Pixel 3, every three or four where the Google phone came out on top. I found that the Xperia usually blew out the highlights. Look at the washed out details on hull and superstructure of the K panel open here, while the Pixel preserves them without crushing the shadows. Same deal with this swan I met on my way to dinner, which looks like a radioactive ghost bird on the Sony. Much more true to life on the Pixel 3. I was already used to this by the time we sat down to dinner. So it came as no surprise that the Xperia continued to fall behind the Pixel and even at times the OnePlus 7 Pro. Now, I don't mind having to do a little editing to pull out the good stuff if I love shooting with the phone. And you could make the argument that this phone is targeted people who expect they have to do that work. But Sony's camera software is too buggy to love at this point. Way too many times I toggled over to video mode and the whole camera would just freeze and crash. This has only been reported a handful of times that I can see, I asked Sony for a comment and we'll edit below if the company offers one. But other issues are widespread, like choppy 4K video with dropped frames, the phone heating up quickly when shooting said video and taking so long to switch between the three cameras that you stand a good chance of missing the shot you were trying to get. Then there's the little stuff like the dedicated camera key. One of the very greatest things about Sony phones, is that they've preserved this component, which lets you half press to get focus and full press to capture. But in his review, my friend Hayato Huseman reported that it wasn't a two-stage button. This is not because he's sloppy or negligent, it's because all the buttons on this phone are so mushy, you can barely tell the camera key has that halfway detect. Then if you pop open that SIM tray to swap SIMs or put in a memory card you'll notice that the plastic is so flimsy. That in league with the mushy buttons, make the phone field cheaper than it should. There's also no wireless charging which would be forgivable if the battery were larger, (buzzer blares) but it's not. The Xperia 1 always took me to the end of the day but not with the kind of charge to spare that I can get from comparable phones. And that Gorilla Glass 6 on front and back, well as these hairline scratches demonstrate, even Gorilla Glass 6 is still glass. And if you live in the US, today's sponsor can help you protect it. Upsie gives you affordable, reliable warranties for all your electronic devices. Sign up for a warranty within 60 days of purchase or 45 days for phones. Accidental protection starts day one and when the manufacturers warranty expires, Upsie takes over. When the worst happens, you just call Upsie's service center where a real person not a robot, will help you choose the best option for you from local and in-home repairs to total replacement. You'll know exactly what's covered before you buy, including the cost of your deductible. Now Upsie already saves you up to 70% off other warranties and if use the link in the description, you'll get an additional 10% off right now. Just use code MrMobile. Thanks to Upsie for sponsoring this video. (upbeat music) Folks, you might call my complaints about the Xperia 1 nitpicks, and if this were a cheaper phone, or if Sony were still offering that amazing pre-order deal of free XM3 headphones with purchase, you'd have a good point, this would be a no brainer in that case, if you jumped on that pre-order, good for you and it was smart. But for those buying now, $949 for just this phone, that's steep, you can get a more consistent camera on the Pixel 3 for $150 less or a more fully featured phone in the Galaxy S10 for $250 less, and you might be tired of hearing about it but that Pixel 3a just continues to throw a wrench into everybody's plans down at 399. It's great to see Sony's mobile division finally starting to leverage the imaging and display and audio expertise of Sony as a whole. And I hope that leads to a reinvigorated Sony as well as a renewed effort to keep its phones updated more often. But that hope needs to be backed up by evidence that it's not hoping in vain. Before I can recommend this phone to the average consumer at its current price point. I said it up top and I'll say it once again, the target customer for the Xperia 1 will probably be quite happy with it. But that target customer base, is almost as narrow as the phone itself. For another take on the Xperia 1, check out that aforementioned review from Hayato Huseman at Android Central. He had the variant designed for North America. So you'll want to go there for reception reporting and other network specific things. My device was a retail 8110 sample that's the European version from Clove Technology. Thanks again to them. If you want this Europe-specific version, hit them up at the link in the description. Until next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "phone",
        "Sony",
        "Xperia",
        "Pixel",
        "Google phone",
        "phones",
        "video",
        "modern 21:9 video",
        "Sony Xperia",
        "Sony phones",
        "camera",
        "year RED Hydrogen",
        "super modern 21:9",
        "Upsie",
        "super",
        "screen",
        "Google",
        "RED Hydrogen",
        "Pro",
        "Sony camera"
    ],
    "transcript_entity_values": [
        "K",
        "Huawei",
        "Europe",
        "Android 9",
        "3a",
        "BMW",
        "an additional 10%",
        "Clove Technology",
        "last year's",
        "150",
        "Instagram",
        "399",
        "the two weeks",
        "Xperia",
        "half",
        "Super Slow-Mo",
        "949",
        "three 12 megapixel",
        "Samsung",
        "Hayato Huseman",
        "Upsie",
        "RED Hydrogen One",
        "Xperia",
        "last year",
        "130 degree",
        "21:9",
        "the Cinema Pro",
        "European",
        "Xperia 1",
        "Battery Care",
        "the Galaxy S10",
        "70%",
        "Xperia",
        "Android Central",
        "3",
        "today",
        "OnePlus",
        "previous years",
        "US",
        "the Xperia 1",
        "One",
        "Pixel",
        "the past week",
        "P30 Pro",
        "overnight",
        "Xperia 1",
        "Google",
        "North America",
        "two",
        "4",
        "World of Warships",
        "the LG V20",
        "Upsie",
        "a few years",
        "45 days",
        "the Xperia 1",
        "the Xperia 1",
        "8110",
        "two summers ago",
        "two years ago",
        "second",
        "250",
        "2019",
        "a third",
        "60 days",
        "2X",
        "MrMobile",
        "Twitter",
        "SD",
        "Sony",
        "three",
        "Android",
        "up to",
        "the end of the day",
        "FPS"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "LOC",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "GPE",
        "PRODUCT",
        "FAC",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "NORP",
        "FAC",
        "WORK_OF_ART",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "GPE",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "TIME",
        "PRODUCT",
        "ORG",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "EVENT",
        "ORG",
        "DATE",
        "DATE",
        "EVENT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "DATE",
        "ORG"
    ]
}