{
    "id": "fkr1sKjr5is",
    "title": "Your iPhone could KILL YOU...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-26T02:38:39Z",
    "video_url": "https://www.youtube.com/watch?v=fkr1sKjr5is",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Apple",
        "iPhone 12",
        "magsafe",
        "not safe",
        "electric",
        "shock",
        "pacemaker",
        "defibrillator",
        "heart",
        "dangerous",
        "magsafe dangerous"
    ],
    "views": 501897,
    "likes": 31781,
    "comments_count": 1025,
    "description": "Get over 67% off the Kove Commuter 2 here:  Code TECH68 (Works site-wide!)  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 ARE U NOT ENTERTAINED 0:13 Nvidia's Arm acquisition is in trouble 1:06 Xbox Live Gold price increase reversed 2:02 Apple iPhone 12 warning 2:45 Kove Commuter 2  3:32 QUICK BITS 3:36 Alder Lake leak 4:01 Cyperpunk fix breaks game 4:25 Netflix mobile audio upgrade 5:02 UK gives kids infected laptops 5:33 FTC to fine scalpers  NEWS SOURCES  DIS-ARMED?     GOOD GUY MICROSOFT?     A HEARTY APPLE     GIMME FIVE, INTEL    YOUVE GOT TO BE KIDDING    SOUNDS GOOD, NETFLIX    SIXES AND SEVENS    WHAT ABOUT THE OTHER SCALPERS?   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://koveaudio.com/tech68",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://asia.nikkei.com/Business/Technology/SoftBank-s-plan-to-sell-Arm-to-NVIDIA-is-hitting-antitrust-wall-around-the-world",
        "https://www.extremetech.com/computing/318949-nvidias-purchase-of-arm-is-being-investigated-by-uk-watchdog",
        "https://hothardware.com/news/nvidia-arm-acquisition-anti-trust-fears",
        "https://www.engadget.com/xbox-live-price-free-fortnite-051641500.html",
        "https://www.ign.com/articles/microsoft-not-changing-xbox-live-gold-pricing-free-to-play-games-unlocked",
        "https://hypebeast.com/2021/1/microsoft-reverses-controversial-xbox-live-price-increase-announcement",
        "https://www.gsmarena.com/the_iphone_12_magnets_might_interfere_with_pacemakers_apple_says-news-47381.php",
        "https://9to5mac.com/2021/01/24/iphone-12-magsafe-pacemakers-support/",
        "https://www.techradar.com/news/iphone-12-can-interfere-with-pacemakers-apple-confirms",
        "https://www.kitguru.net/components/cpu/joao-silva/intel-alder-lake-skus-unveiled-in-sisoftware-sandra-launch-tipped-for-september-2021/",
        "https://www.notebookcheck.net/Intel-12th-gen-Alder-Lake-S-rumored-to-launch-in-September-expected-to-feature-GT0-5-and-GT1-Xe-LP-iGPUs.516755.0.html",
        "https://www.pcgamer.com/psa-cyberpunk-11-patch-introduces-save-killing-down-on-the-street-bug/",
        "https://www.vg247.com/2021/01/25/cyberpunk-2077-down-on-the-street-1-1-patch-bug-fix/",
        "https://www.tomsguide.com/news/netflix-just-got-a-killer-upgrade-for-android-users",
        "https://www.gsmarena.com/netflix_adopts_xheaac_variable_bitrate_audio_codec_on_android-news-47383.php",
        "https://hexus.net/tech/news/laptop/147326-malware-found-free-laptops-uks-vulnerable-children/",
        "https://www.theguardian.com/education/2021/jan/21/malware-reportedly-found-laptops-children-england",
        "https://www.wired.com/story/ftc-scalper-bots-biden-cybersecurity-security-roundup/",
        "https://variety.com/2021/digital/news/ticket-brokers-agree-to-pay-3-7-million-in-scalping-settlement-1234890585/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- The tech news can be intimidating, but today we're facing our fears and challenging the tech news in single combat. Show yourself, tech news! Fight me, you coward! - [Riley] Get 'em, James! Oh, wow, yes! (screams) - Nvidia's plan to buy Arm and become the world's most powerful mobile chip maker is starting to hit some mighty powerful snags. As it turns out, governments around the world aren't exactly eager to give that much market power to just one company. Can you imagine how smug Jensen would be? - [Riley] He'd wear like three leather jackets. - His kitchen would be so opulent. At the heart of the issue is the fact that Nvidia directly competes with many companies that have bought chip designs from Arm, raising serious concerns that Nvidia would effectively end up controlling the market if the deal went through, with the US, the UK, China, and European Union sure to take a very close look at the details. Because of that. (beep) that up, so I just went with it, whatever. I think one company dominating the market could also raise cyber security eyebrows as well. Not concerns, eyebrows. So I wouldn't be too shocked if the deal ultimately doesn't work out, even if NVIDIA's lawyers try to strong arm the issue. - There it is! - Wa-pow! - [Riley] Wow! - There was a huge amount of backlash after Microsoft announced that it was going to jack up the price of an Xbox Live subscription by a factor of two. Understandable, considering many people are in a tough financial circumstance this year due to the pandemic and the fact that more people are staying at home playing video games. I mean, okay, that kind of makes sense then. Well, it's like demand is going up, so. All right, the good news, though, is that Microsoft has changed its mind. It is not only keeping the existing pricing the same, but is even letting players play free to play games on multiplayer without a paid XBox Live subscription. Just a 180. - Hey! - Squeaky wheel gets the grease. Seeing as some very popular titles, like Apex Legends and Fortnite fall into this category, console gamers seem pretty happy with the whole deal. So I guess our parents were wrong. Complaining does work, especially regarding video games. (exhales) You couldn't have been more wrong about this whole video game thing, Mom. - [Riley] I get paid! - (laughs) And the screen is this close to my face by design. Are you the proud owner of a shiny new iPhone 12? Have you had heart surgery done in the past? Wow. Be extra careful, seriously, because the next time you snap a photo, you could be in danger for your health. (laughs) Apple has released a statement to consumers warning them to not have their gadgets sitting too close to their pacemakers. According to the company, you should keep your iPhone at least six inches away or a whole foot if the iPhone is in wireless charging state. The statement comes after another report that the iPhone 12 and other MagSafe products interfered with the defibrillator implant. So while Apple says the risk isn't larger than it has been with some of its earlier products, you may not want to keep the phone in your breast pocket. Also, if you bend over, it falls out. - [Riley] Wait, which earlier products were dangerous? - We'll never know. Today's quick bits are brought to you by the Commuter 2 portable Bluetooth speaker from Kove. (Riley yells) Good God! Apparently it can get pretty loud. Riley, hit it. - [Riley] Bam! (upbeat music) Oh my God, James, no! - That was a legit trip. It features up to seven hour battery life, is water resistant, and has a built-in microphone So you can hold it like that, like a Shake Weight and talk right into it. Plus 30 feet of range. But what really makes us different is check this out. (groans) - Whoa! - You can break it in half. You don't even have to do an Arnold impersonation to do it. When combined, they create a 360 degree sound, but when you separate them, they become a perfect left and right stereo speakers. That's 100% pretty cool. Use code TECH68 and get over 67% off because our codes can't have decimal places. You get that off of the Kove Commuter 2. What a great speaker, while the link is below. Quick Bits is my boyfriend. We have a few more details on Intel's upcoming chips. Although the release of Rocket Lake is just around the corner, its replacement, Alder Lake, is due out in September and will require a new LGA 1700 socket. Although at least it will also come with support for DDR five and PCI express 5.0. (Riley whoops) Okay. Team Blue beating Team Red to the market with a new feature? I feel like I've been transported back to 2013. (Riley whoops) You know, that big, hot fix for Cyberpunk 2077 that was supposed to make the game suck less? Maybe it did that in some respects, but it introduced a whole new problem that actually breaks the game. At one point, a conversation that's critical to the plot never happens, making it literally impossible to advance in the game. - [Riley] No! - It's like CD Projekt Red used dynamite to kill a spider. Like I did that one time back in 'Nam. I'm missing a baby toe. And if you often watch Netflix on an Android phone, you're in luck if you care at all about the audio experience as Netflix has just pushed out an update, enabling more advanced audio codex on its app. The company has said that this will deliver studio-quality sound that's not only better on headphones and external speakers but will also make things sound clearer on built-in phone speakers. So you might actually be able to tell what Queen Elizabeth is saying in Da Cwown. I cannot understand her accent. This was written by an American, obviously. Like, she's so easy to understand. - [Riley] I wrote that. - You wrote this. - [Riley] Yeah. - But you're not American. - [Riley] It's a joke. - Ah. - Ah, we do those. - Da Cwown. - [Riley] Da Cwown. - That's how we say it in my house. Although the UK government may have had good intentions when it bought over a million low-cost laptops to distribute to underprivileged students so that they could continue their studies from home during the pandemic, they may want to think twice about who they get them from as it's been reported that many of them are infected with a nearly decade-old piece of malware. - [Riley] Wow. - Does that actually say \"wot?\" - [Riley] Wot? - (laughs) I'm not doing that. Wot, did they drag these up from the bottom of the River Thames? Is it Thames? (Riley laughs) - [Riley] That was pretty good. - Themes? And the FTC has started to hand out fines to operators of scalper bots. But don't get too excited. We're not talking about the same ones buying up all the graphics cards lately. These fines are targeted at people who automatically sculpt movies, sports, and event tickets. So boomer stuff. (blows raspberry) Definitely a good idea, but I'd rather the FTC just find the bots themselves. More forward-thinking, you know? Then they can get actual, real jobs. - [Riley] Yeah, move out of your mom's basement! - Get embodied already and work at the till. I don't wanna interact with you through a screen. - [Riley] No sentient tease! - (laughs) That's our show. Come back Wednesday for more exciting tech news without the outrageous markup.",
    "transcript_keywords": [
        "single combat",
        "facing our fears",
        "fears and challenging",
        "tech",
        "challenging the tech",
        "Nvidia",
        "Xbox Live subscription",
        "game",
        "good",
        "wow",
        "Xbox Live",
        "market",
        "Arm",
        "video games",
        "company",
        "iPhone",
        "games",
        "Cwown",
        "pretty",
        "Live subscription"
    ],
    "transcript_entity_values": [
        "half",
        "the Kove Commuter 2",
        "Cyberpunk 2077",
        "at least six inches",
        "XBox Live",
        "three",
        "Commuter 2",
        "100%",
        "Intel",
        "Da Cwown",
        "5.0",
        "Riley",
        "one",
        "US",
        "67%",
        "Riley] Wot",
        "NVIDIA",
        "iPhone",
        "Projekt",
        "million",
        "up to seven hour",
        "this year",
        "LGA 1700",
        "2013",
        "Apex Legends",
        "FTC",
        "Today",
        "Riley] Bam",
        "Kove",
        "a whole foot",
        "American",
        "Microsoft",
        "Riley] Da Cwown",
        "China",
        "September",
        "Arnold",
        "a Shake Weight",
        "Jensen",
        "Nvidia",
        "Xbox Live",
        "180",
        "Netflix",
        "two",
        "Android",
        "DDR",
        "Wednesday",
        "UK",
        "iPhone 12",
        "Fortnite",
        "Nam",
        "Queen Elizabeth",
        "Team Red",
        "PCI",
        "12",
        "Rocket Lake",
        "Team Blue",
        "Alder Lake",
        "Thames",
        "jack",
        "James",
        "Plus 30 feet",
        "five",
        "the River Thames",
        "Apple",
        "today",
        "European Union"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "GPE",
        "PERCENT",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "NORP",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "ORG",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "GPE",
        "GPE",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "ORG",
        "DATE",
        "ORG"
    ]
}