{
    "id": "fkSBoL-Ujww",
    "title": "OnePlus 3 Review: Killer Flagship",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-06-22T17:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=fkSBoL-Ujww",
    "category": "People & Blogs",
    "tags": [
        "oneplus 3 review",
        "oneplus 3 vs oneplus 2",
        "oneplus 3",
        "oneplus",
        "review",
        "flagship",
        "mrmobile",
        "michael fisher",
        "captain2phones",
        "mobile nations",
        "androidcentral",
        "smartphone",
        "android",
        "oneplus3",
        "oxygenos",
        "pocketnow"
    ],
    "views": 419743,
    "likes": 12696,
    "comments_count": 1419,
    "description": "To break the OnePlus 3 review down succinctly: this is a very compelling Android smartphone. I wish OnePlus could have held on to the bold, rebellious industrial design that characterized its freshman effort, but my Android Central colleague Andrew Martonik is right to say in his own OnePlus 3 review that the phone is \"all grown up.\" This device is a combination of very compelling features and very few compromises, in a package thats substantially more affordable than the flagships it tries to topple. Best of all, you dont need to jump through a lot of hoops to buy one. Join me for the OnePlus 3 review by MrMobile!   [SUBSCRIBE]     (This review was based on nine days of usage on demo hardware provided by OnePlus.)  Follow MrMobile:          Read the Android Central review:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.androidcentral.com/oneplus-3"
    ],
    "transcript": "- [Narrator] Gorgeous or generic. Trailblazing or derivative. Hell-raising or ho-hum. The latest smartphone from OnePlus is as polarizing as its predecessors, and while this one may not be a flagship killer, it is indeed a killer flagship. I'm Michael Fisher, Mr. Mobile, and this is the OnePlus 3 review. (upbeat music) When I handed the OnePlus 3 to a friend the other day the first thing out of his mouth was, did HTC make this? And indeed this is a familiar design in slippery aluminum chassis cleaved in three by inset antenna channels, punctuated by a protruding camera up top and a bottom firing speaker down below. When I first saw the new design I was frankly let down. OnePlus burst onto the scene in 2014 with a phone that looked and felt like no other, and the two years since have seen that initial boldness eroded, while the price tags have climbed. The company tries to keep the fun alive with a variety of slap on covers for the OnePlus 3, sold separately, but while the materials are genuine and the designs pretty, at the end of the day these are just cases, and they look the part. So I carry the phone in the nude, as it were, and you know what? Everyday I like it a little more, but then construction gives it a better hand feel than, say, the Nexus 6P, and more importantly the OnePlus 3 checks all the usability boxes that its predecessors struggled with. A fast and accurate fingerprint sensor, quick charging, NFC for Android pay, top shelf silicon, and a colorful and spacious AMOLED display. You might say full HD resolution is too low in 2016, but I don't agree. At five and a half inches that makes for 400 pixels every inch. OnePlus could have chosen a better sub-pixel arrangement than the Pentile implementation it went with, but 95% of the target audience isn't going to notice. I sure didn't until it was pointed out. If people are going to complain about anything concerning the display, it's going to be nitpicking, literally. At about 400 nits, the screen doesn't get bright enough in direct sunlight. But, at the risk of calling a bug a feature, that also means the screen is kinder to the battery, and the result is a phone that usually lasts me all day and well into the night, even with heavy use and even while paired to three separate bluetooth devices. In fact, if I had to give the OnePlus 3 a nickname I'd call it the ball juggler. (laughs) No I wouldn't, that's not true. But, there are six gigs of RAM in this thing, so it multitasks like no Android phone-- No, like no phone I've used before. I can run multiple games at the same time and jump between them without waiting for any of them to reload. That's not something the average user is going to need, but that head space does make it possible, for example, to shoot a quick video while you're listening to a podcast without force-closing the audio app. That's a simple task that a staggering number of phones just straight-up fail at. Sometimes more power really is what you need for a better experience. And OnePlus isn't just about brute force. Oxygen OS, the company's version of Android Marshmallow, includes a ton of little conveniences. You can swipe down anywhere on your home screen to get your notifications, saving your thumb a stretch. You can set shortcuts on the capacitive buttons to launch specific apps or functions, or get rid of the capacitive buttons all together and use soft keys instead. Keep the ringer loud or shut it off, or only let priority alerts through with the three-way switch on the side. You can use the dark mode, like I'm doing, or stick to dress whites for the summer. Use the shelf on the left home screen to keep your widgets all in one place, or don't. And, if you're worried about OnePlus not delivering timely Android updates, which by the way is totally a valid concern, the bootloader is unlockable so you can throw it all out the door and do something special. And speaking of special, let's talk about the camera. It's the same Sony sensor from the Huawei Mate 8 and the Asus ZenFone 3, and while the aperture isn't the biggest, I almost never came away disappointed in the photos no matter what kind of lighting I found myself in. In 2016, flagship smartphone cameras have gotten so good that you almost need to be a pro photographer to tell the difference between them. Since I'm not, and odds are neither are most of you, I think it's enough to say that I didn't ever take a photo with the OnePlus 3 wishing I had pulled a different phone out to do it. Now, sadly that's not as true for video. While this camera does have optical and digital stabilization, you wouldn't necessarily know it from the shaky footage I often came away with. Shooting in 4K will get you a nicer picture, and this camera can do that, but you'll probably want to keep it to 1080p unless you want to completely decimate your storage. There's no micro SD slot on the phone, so the 64 gigs on board are all you get. Sad face. Talking about faces, the selfie cam is as sharp as you'd expect from an 8-megapixel sensor, but you do need perfect lighting. The picture is quick to blow out if you pour too much light on the scene, and there's almost always a bunch of digital noise in the shot, too, which is doubly true for video. Narcissists take heed. Let's wrap it up with the details. After a strange issue I had registering on T-Mobile's network on day one, reception and voice quality have been fine for the past 10 days in Boston. And, if you want to run the phone on two carriers at once, you can, thanks to the dual SIM slots. The speakerphone is nothing special and its bottom firing position makes it completely forgettable. The phone ships with a slippery, smudge prone screen protector on the Gorilla Glass 4, gross. But, it saved me twice this week from a shattered screen after a couple of bad drops, so we'll call that a win. There's a cool feature that lets the phone power itself on if it's turned off when it's supposed to be sounding your morning alarm. And, when it comes time to plug in, get ready to bust out your slack-jaw. The charger in the box is chunky for good reason. It kicks out a 5-volt, 4 amp combo that gets the phone to 64% in a half hour, and 90% after 45 minutes. So, what's the upshot? Well, while I wish OnePlus could have held onto the bold, rebellious industrial design that characterized its freshman effort, my Android Central colleague, Andrew Martonik, is right when he says the company has finally grown up. The OnePlus 3 is a combination of very compelling features and very few compromises in a package substantially more affordable than the flagships it tries to topple. And best of all, you don't need to jump through a lot of hoops or wait for an invitation to buy one. In the words of the company that built it, it's about time. Thumbs up for the OnePlus 3. (electronic music)",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "Gorgeous or generic",
        "Android",
        "screen",
        "Android phone",
        "day",
        "camera",
        "Michael Fisher",
        "company",
        "design",
        "Android Marshmallow",
        "home screen",
        "Android Central",
        "flagship",
        "OnePlus burst",
        "quick",
        "true",
        "HTC make",
        "video"
    ],
    "transcript_entity_values": [
        "the summer",
        "95%",
        "64%",
        "a ton",
        "the two years",
        "the night",
        "8-megapixel",
        "the past 10 days",
        "2016",
        "Huawei Mate 8",
        "all day",
        "SIM",
        "5-volt",
        "three",
        "45 minutes",
        "Nexus",
        "ho-hum",
        "Mobile",
        "Android Central",
        "64",
        "Android Marshmallow",
        "OnePlus",
        "the other day",
        "Boston",
        "Pentile",
        "first",
        "AMOLED",
        "RAM",
        "one",
        "five and a half inches",
        "2014",
        "two",
        "4",
        "400",
        "six",
        "about 400",
        "Andrew Martonik",
        "HTC",
        "day one",
        "90%",
        "the Gorilla Glass 4",
        "NFC",
        "this week",
        "Sony",
        "Michael Fisher",
        "T-Mobile's",
        "OnePlus 3",
        "Android",
        "the end of the day",
        "a half hour"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERCENT",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "TIME",
        "QUANTITY",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "TIME"
    ]
}