{
    "id": "FLG08-xJGyM",
    "title": "This WEIRD Japanese Laptop LOOKS 20 Years Old… - Panasonic SF-SV2",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-07-03T17:12:42Z",
    "video_url": "https://www.youtube.com/watch?v=FLG08-xJGyM",
    "category": "Science & Technology",
    "tags": [
        "panasonic",
        "laptop",
        "let's note",
        "japan",
        "japanese",
        "japan pc",
        "japanese pc",
        "panasonic sv2",
        "thunderbolt",
        "vga",
        "dvd drive",
        "optical drive",
        "bluray drive",
        "dvd",
        "optical",
        "bluray",
        "laptop io",
        "laptop features"
    ],
    "views": 2680244,
    "likes": 84944,
    "comments_count": 4233,
    "description": "Add a little fun and personality to your printed products! Check out VistaPrint at   Create your build at   Are you a sucker for good laptop IO? Do you need every single port? Well turns out there's still devices out there with things like optical drives, full sized SD card readers, and VGA, while also having modern comforts like Thunderbolt 4. But...they're only available in Japan. Why does this market still exist in one place while being completely forgotten everywhere else?  Discuss on the forum:   Check out Framework's Laptops:  Check out Panasonic Let's Note Laptops on eBay:  Check out VAIO Series S Laptops on eBay:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:40 Let's Note! 2:08 What is this thing? 3:04 Back in my day... 3:38 Our trackpads were circular 4:50 Japan: Florida of the East 6:42 Mourning our loss 7:43 What it lacks 8:40 Conclusion",
    "description_links": [
        "https://lmg.gg/vistaprint.",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1517135-this-weird-japanese-laptop-looks-20-years-old%E2%80%A6/",
        "https://lmg.gg/framework",
        "https://ebay.us/KiG3ia",
        "https://ebay.us/BChtcc",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "This laptop came out in 2022 and it's packed full of modern hardware. But just about everything else about it looks like it came straight out of 2002. And I'm not even exaggerating. From its matte screen to its delightful round track pad, Panasonic has used nearly the same design on its Let's Note lineup for the past 20 years. But for their customers, that's a feature, not a bug. And honestly, I can kind of see their point. I mean, sure, it's a little on the thick side, but on top of the usual suspects, USB-A, HDMI, Thunderbolt 4, we've got Ethernet, VGA, an SD card reader, and do my eyes deceive me? A DVD drive? Wait, a user-swappable battery. This raises so many questions for me. I mean, what did happen to laptops that actually have ports on them? Why are these ones exclusive to Japan? And with all of these features, does it have a place for me to plug in this message from our sponsor? Build Redux. Build Redux assembles fully customizable gaming PCs suitable for any budget. All you gotta do is pick your favorite games, see how they perform using their online PC builder, then relax and do your gaming stretches so you're ready when it arrives. Head to buildredux.com slash Linus and create your new rig today. As anyone who's been shoved into a police cruiser can probably tell you, Panasonic makes laptops. And much like Epson, they offer a far more varied selection in Japan compared to the West. The Let's Note line began production in 1996, and it would continue to receive periodic updates over the years. In 97, it got its first optical drive. In 98, it got a mobile phone. That's kind of weird. In 99, it got wifi. And in 2000, it got its signature circular trackpad. More on that a little bit later. First, by 2002, 2003, the Let's Note looks nearly identical to what's in my hands today. Speaking of, what do we have here today? We've got a 12 inch IPS display with the more traditional 16 by 10 aspect ratio. Love to see it. An 11th gen Core i5 processor, 16 gigs of DDR4 memory, and a 512 gig PCIe Gen 4 Samsung NVMe drive. Our machine could be configured at the time of ordering, but there were only a handful of options for CPU, RAM, and storage. The keyboard has minimal flex to it and nice long travel on the key switches, but the layout is kind of cramped and the keys are a touch on the mushy feeling side. I'd describe it as pretty okay for touch typing. That is at least ignoring the unfamiliar Japanese layout for me. But if you're hand packing, it's probably a great experience. And if the target demographic is on the older side, that makes a lot of sense. And it is. More on that later. First, did I mention that the battery is not the only thing you can replace on this thing? You can also swap out the entire keyboard with a US standard. I mean, can this thing get any cooler? Believe it or not, like many of the other advantages of the SV2, this sort of thing used to be common. Entire companies existed to import Japanese laptops and then replace the keyboards with localized layouts. But then with the wide breadth of choice in the laptop market these days, it seems like these services have failed the test of time. What hasn't is this track pad. For whatever reason, Panasonic decided 20 years ago that their track pad, theirs was gonna be circular. And that's a decision that they have stuck with to this day. While it does have modern features like support for multi-touch, it doesn't really have a lot of room on it for multiple fingers, but then it turns out that that's barely an issue. The left and the right click are both physical buttons. So you just use it two-handed and scrolling can be done with a single finger by just spinning around the outside like you're a DJ scratching a record. Wicky, wicky, wicky, okay. This is actually pretty cool. And as an extra bonus, you don't have to worry about palm rejection since it sits comfortably right in between your hands on the wrist rest. I wouldn't personally trade away my larger, more modern design though. I mean, you can't even move a cursor all the way across the screen without lifting your finger. So given the obviously ample internal room they have to work with, why is Panasonic still putting these archaic designs out specifically in Japan? Well, there are a couple of reasons for that. But the main one is that for one reason or another, Japanese companies tend to devote a lot of development resources to the domestic market. And the population of domestic Japan is old. How old are they? So old that according to the World Economic Forum, they have the oldest population of any country on earth. As you'd imagine then, this permeates many aspects of modern culture, including the decisions of IT departments for large companies. You see, when it's time to replace all your laptops company-wide, it is much easier in terms of training to transition over to something that is familiar for your users. And this is especially true for older users. Similarly, if you're making decisions for an IT department in an older company with lots of withering technology, you're gonna need machines that still work with those older devices, hence the VGA ports, for example. And this is not an issue that's exclusive to Japan, as we saw not that long ago when we discovered Nixys, a company that manufactures brand new Windows 98 PCs. That is a little different though. In that scenario, it's assumed that those systems are gonna be used for controlling industrial machinery that depends on legacy ISA cards or ancient software. With the Panasonic, it's much more about the day-to-day use. I can roll into a meeting room, and whether it's HDMI, Thunderbolt, or even VGA, I can output to the projector. And if I need to transfer a file from someone, I can use USB-A, USB-C, an SD card, or even, yeah, the included DVD drive with no dongles required. And it's all in a shockingly lightweight package, thanks to the magnesium alloy chassis. I gotta say, having gotten used to modern laptop designs, it does feel a bit more like a novelty at this point to me, but I still can't help feeling a bit sad about some of the things that we've lost along the way. I mean, sure, I can open up my modern machine and replace the battery if it fails, but what I can't do is swap in a new one to get me through the rest of the day or put an extended capacity one in if I don't mind having a bit of a caboose on my machine. And I mean, even the optical drive kind of hits me in the feels. This 11th gen model is likely to be the last laptop that Panasonic makes that is widely available with this feature. They've actually already sold this one out through their own website, and when we attempted to purchase one at a retailer, we were told they wouldn't be getting any more in stock. So we nabbed this one, new in box from Yahoo Auctions, which means the only manufacturer still offering opticals is Vaio. Now, a machine with so many features for usability that's also targeted at corporate IT departments should have easy maintenance and upgradeability, right? Well, that's not entirely incorrect, but it is certainly not the full story. Part of the story is that we might have a precision screwdriver coming with in-handle bit storage and a super cool bearing. Sorry, anyway, the point is, while the battery is obviously swappable, and this is really cool, there's a handy little access panel here that allows you to blow out the heat sink. There are some bigger issues that we would be remiss to not mention. The M2 drive is only accessible once the bottom cover has been removed, an endeavor that requires removing 21 screws, and RAM, it's soldered to the motherboard. Guys, you were so close to killing my framework investment, Panasonic. So close. So then, as long as framework keeps selling serviceable laptops with user-upgradable RAM, something that you can find a link to down below, by the way, Panasonic won't be showing up to eat their lunch anytime soon. But I will be showing up right now on your screen to segue to our sponsor, Vistaprint. They're the go-to company for all your personalized printing needs. Whether you're looking to design business cards, sports team t-shirts, or eye-catching tote bags, Vistaprint has everything you need to make a statement. Their online design tools make it easy to create custom looks, and their selection of high-quality materials and finishes ensures that your finished products will look professional and polished. Best of all, if you make an order and aren't happy with what you receive, send them an email and get a response back within 24 hours. All their offerings are satisfaction guaranteed. Go to lmg.gg.vistaprint today and start creating your own personalized products that are as fun and unique as you are. If you enjoyed this video, check out the one on the Epson Endeavor, a tank of a desktop PC from a company that usually makes printers and projectors.",
    "transcript_keywords": [
        "Panasonic",
        "Panasonic makes laptops",
        "Panasonic makes",
        "Japan",
        "drive",
        "laptops",
        "modern",
        "modern hardware",
        "laptop",
        "bit",
        "makes",
        "Note",
        "DVD drive",
        "modern laptop designs",
        "design",
        "thing",
        "kind",
        "machine",
        "today",
        "Japanese"
    ],
    "transcript_entity_values": [
        "Ethernet",
        "the years",
        "one",
        "Vistaprint",
        "first",
        "20 years ago",
        "2022",
        "Thunderbolt",
        "M2",
        "Vistaprint",
        "SD",
        "USB-C",
        "the World Economic Forum",
        "2003",
        "Panasonic",
        "First",
        "Japanese",
        "Epson",
        "Yahoo Auctions",
        "99",
        "VGA",
        "ISA",
        "Japan",
        "today",
        "Nixys",
        "16",
        "Windows 98",
        "slash Linus",
        "2002",
        "24 hours",
        "10",
        "USB-A",
        "RAM",
        "12 inch",
        "4",
        "US",
        "2000",
        "97",
        "Build Redux",
        "CPU",
        "the past 20 years",
        "HDMI",
        "11th",
        "this day",
        "the day",
        "98",
        "Vaio",
        "two",
        "SV2",
        "1996",
        "Samsung",
        "21",
        "these days",
        "512"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "EVENT",
        "DATE",
        "ORG",
        "ORDINAL",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}