{
    "id": "FMijFH1El0k",
    "title": "Will This Be Your First Smartwatch?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-12-14T23:43:14Z",
    "video_url": "https://www.youtube.com/watch?v=FMijFH1El0k",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "ticwatch",
        "smartwatch",
        "android",
        "android wear",
        "apple",
        "apple watch",
        "smart watch",
        "wear",
        "tic watch",
        "iphone",
        "iphone 7",
        "iphone 6s",
        "apple iphone",
        "iphone 7 plus",
        "plus",
        "7 plus",
        "watch",
        "smartphone",
        "best smartwatch",
        "samsung",
        "phone",
        "2016",
        "cheap",
        "smart",
        "smartwatches",
        "galaxy",
        "best",
        "series 2",
        "apple watch series 2",
        "apple watch 2",
        "iwatch",
        "edition",
        "features",
        "apple watch sport",
        "cool gadgets",
        "google",
        "cool"
    ],
    "views": 3088862,
    "likes": 55327,
    "comments_count": 3884,
    "description": "Ticwatch website:  Ticwatch is having a Christmas sale on their website, use whitechristmas to get 15% off on all watch purchases. Ticwatch Amazon:   Info from the manufacturer -  Introducing Ticwatch 2, an innovative, affordable and intuitive smart watch. With built-in GPS, a sharp screen and a unique new way to interact with your watch, the Ticwatch 2 is leading the way to affordable, yet functional wearables. After raising over 2 million dollars on Kickstarter, the Ticwatch 2 combines an intuitive operating system with a classic design, delivering the ultimate smart watch experience.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://bst.is/a/e8iO0WMvMlr",
        "https://bst.is/a/ameKWmIrIhn",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "I got a bunch of boxes on the table today four boxes of the hot new watch, smartwach called \"Ticwatch\". They were on Kickstarter, They raised a boatload of money for a more affordable smartwatch. Okay? That works on both android and IOS and it comes in a number of different variations They're around $200 depending on the variation. To kick it off, Onyx Black. That's a good start, what else we got? Oak, Charcoal and Black, and Snow White. Snow White and the Seven Dwarves. What happens in that story? It's bad news right? \"Mirror, mirror on the wall. Who's the fairest of them all?\" Ooh You can see you got a watch face illustrated on there with a sticker, so you can get an ide- oh. How about tha- Jack, it's been a while! Silica Gel! *Throws it at Jack* *Jack throws it back* *Lew chuckles like a kid on Christmas* That was fun. We haven't done that in a while. *Lew extends for fistbump* *Jack leaves him hanging* This is nice. Look at this, they got the little pillow in there! Kinda rubber-ish. It's a more sporty finish. There is also a heart rate monitor on the bottom. \"Water Resistant, Pedometer sensor,\" yes \"Proximity Sensor, Heart Rate\" \"Tickle Touch\" Tickle Touch is kinda like a main attraction here on the TicWatch. Micro USB Charger. Ah, a little charge base. Drops on top. It's got a little magnet so it finds the right spot and then over here, that's where your micro USB will connect. Nice little watch experience. We got other options here. A metallic top on it. Brown leather band as well. *much sniff, such leather, wow\" That smells like real leather man. This box is a little bit different. Oooooh, it's a little bit fancier this one! This one...has a metal band on it. *satisfying plastic peel* If you're like Jack, ya put the suit on every so often. You go out, you pretend you're on a date cos you can't get a real one. *shots fired* You're just slurping up your spaghetti, it's the single candle and the band. *makes music noises* You'll figure it out one day Jack. These bands are actually interchangeable as well. Pinch? Yea, look at that. Now obviously if this isn't the size of your wrist, you add or remove a couple of links. Little charge base. You got a little bed side clock. Is it time to get up yet? No, it's not noon yet. *you know you do it too* Get the eight hours okay? You need it to grow up big and strong. They might tell you you have school and homework, listen to me instead. You snooze you lose. That's the reverse of what I was saying. I think if you snooze you win! Extra links and a tiny, little screwdriver. This is black on black. What's it gonna be for you? Which style would you go for? Immediately, it tells you to tickle the side. I gotta admit, that makes me feel a little bit uncomfortable, but it's actually pretty cool. Over here, this is a touch sensitive area. You can see how I'm doing that? It's very reactive as well. Download the TicWear App.This is obviously gonna be for the fitness stuff as well. It's a litte QR Code there. What you wanna do is just line up. Paired up, set up new. You can see it's got a pretty classic looking face on there right now, but I mean there's a ton here. Whatever you want, I don't know. Weather, some flowers if you wanna get fancy. There's some modifications you can do right on the watch, but also within the app. If I click on watch face, you can see them in here. You can also download extra watch faces if you want something different than what's pre-included there. I think I'ma go with the sport one. Okay cool. So it's been swapped out now. You can set which notifications you wanna see on the watch and how often you want to see them. You can also block app notifications from certain apps that keep pestering you. Your battery indicator, for not just the watch, but also the phone. Also in here, network settings. It looks like this thing can directly connect to Wi-Fi as well. Jack, why don't you send me a text or something? *probably laughing at the emoji* Okay so scrolling over to the right is where your apps are gonna live. Dialer, Calendar. Health is the the one I wanna try right now. Click to start my test. Telling me to keep still right now. 48? I mean, I'm pretty relaxed right now. *phone starts to ring* Let me try this. *shakes watch to answer call* *person on phone* \"Hi.\" Your voice is coming through on the speaker of the smartwatch, so now the entire world is hearing you. *person on the phone* \"Oh, at least I can say hi to everybody.\" Go ahead say Hi. *she giggles and says* \"Hi everyone.\" *she says to somebody* \"Can you mount the T.V in our bedroom?\" Well, I mean that was a real world test. We had the phone call come through the speaker on the smartwatch. I answered that call and it worked. I'm getting dinged up! Oh it's got a voice recorder in it. Check check one two. This happens to me actually, I have an idea for a video or maybe some music or something like that. I have an idea. I think they've put a little package together here. Works on IOS, works on Android. Bunch of different designs to choose from and most importantly, affordable. More affordable, that's the game plan. Listen, does it have the prestige...the prestige of your Golden Apple watch, maybe not. But that's not the game plan. That's not the only game in town. And maybe you don't wanna spend that kinda dough. Do you deserve to get your notifications on your wrist still? Yes! According to TicWatch you do. Now whatever's in those notifications, I can't help you with that, alright? If your girlfriend is breaking up with you on your watch, I can't be held accountable. She's probably got a good reason though. Alright, step your game up kids.",
    "transcript_keywords": [
        "watch",
        "smartwach called",
        "Jack",
        "table today",
        "today four boxes",
        "boxes",
        "Snow White",
        "Black",
        "phone",
        "Onyx Black",
        "Tickle Touch",
        "watch face",
        "game",
        "Tickle",
        "Touch",
        "notifications",
        "Jack throws",
        "heart rate",
        "bunch of boxes",
        "Ticwatch"
    ],
    "transcript_entity_values": [
        "Golden Apple",
        "Micro USB Charger",
        "Lew",
        "Dialer",
        "Wi-Fi",
        "Snow White",
        "Proximity Sensor",
        "Jack*",
        "today",
        "Oak",
        "USB",
        "\"Water Resistant, Pedometer",
        "Jack",
        "Charcoal",
        "Android",
        "Calendar",
        "Kickstarter",
        "smartwach",
        "Ticwatch",
        "four",
        "T.V",
        "one two",
        "TicWatch",
        "Download the TicWear App",
        "a ton",
        "Onyx Black",
        "IOS",
        "the eight hours",
        "around $200",
        "one"
    ],
    "transcript_entity_types": [
        "FAC",
        "ORG",
        "PERSON",
        "NORP",
        "LOC",
        "PERSON",
        "WORK_OF_ART",
        "FAC",
        "DATE",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "MONEY",
        "CARDINAL"
    ]
}