{
    "id": "FmOw7lx86Yo",
    "title": "5 Crazy Things At CES 2016",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-01-12T19:43:45Z",
    "video_url": "https://www.youtube.com/watch?v=FmOw7lx86Yo",
    "category": "Science & Technology",
    "tags": [
        "ces 2016",
        "ces",
        "2016",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "lg",
        "oled",
        "8k",
        "8k tv",
        "iphone 6",
        "iphone",
        "iphone 6s",
        "apple",
        "beam",
        "review",
        "unboxing",
        "samsung",
        "android",
        "6s",
        "gaming",
        "gadgets",
        "galaxy",
        "smartphone",
        "4k",
        "suitabletech",
        "suitable tech",
        "best",
        "new",
        "s6",
        "giroptic",
        "i6 power",
        "lg 8k",
        "lg 4k",
        "lg oled",
        "iphone 6s plus",
        "gadget",
        "las vegas",
        "vs",
        "smart",
        "smartphone (video game platform)",
        "futuristic",
        "iphone (video game platform)"
    ],
    "views": 563833,
    "likes": 15822,
    "comments_count": 971,
    "description": "Saw some cool stuff at CES 2016...  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- When you're in the high fashion world, it's very difficult to.... So, I'm walking through, I'm seeing all these different booths. And to be honest with you, I'm thinking why not just shoot? After all, I'm trying to give you guys the experience of what it's like to be here on the floor. So, something caught my attention here at the Giroptic booth. Up, down, and all around. We have a GPS button, there's a wi-fi button in this location here, power switch, and this switch is the mode. Completely waterproof, more rugged I suppose than other 360 cameras that are out there. Yea. We've all heard about 360 video, we've seen 360 video. 360 video exists on youtube, I haven't personally experimented in a big way because one of the issues with 360 video, is how do you look at it? How do you display it? Unbelievable. I wish I was there right now. It's so hot in here, I could be in the snow, frolicking, in the French Alps. You could be on a phone, right, and scrolling around that way, but that's a really flat kind of experience. This is what I'm especially interested in, because this is something I haven't seen before. This is an actual 360 version, maybe, one day, in the future, all of those flat screens in your house won't exist anymore, maybe it'll be orbs in your living room. Anyway, pretty cool, Giroptic. I'm going to keep walking around, and I'm going to probably keep stopping at various places with cool things. Check one two, check one two, tell me when. What's up guys, Lou here, back with another video from CES 2016, and as you can tell you can hear me. But this microphone, it looks very strange, that's because this is a walkie talkie. You're listening right here. Now, you're listening right here. See what I'm saying here guys? So it's a case that also acts as a walkie talkie. I'm going to pick this up now. Check one two. That's not everything, it actually has a built in battery, too. Three thousand milliamp hours so it can recharge your phone. This display kind of tells you what's going on, you've got volume, as well as the channel that you're on. Essentially, what you've got is two way communication here, without the need to make a phone call. The network crashes, the EMP hits, the towers are down. Well, now you've got communication at least point to point with another individual. Maybe, we just get a couple of these in the office, more ways to yell at Jack. Another interesting thing is there's actually a blue tooth version of this. That's going to allow you to pair a blue tooth headset to the walkie talkie. Campers, hikers, climbers, outdoorsy type people I guess. The applications really up to you. Three kilometers, what did I say? - Just to clarify a few things, it's three kilometers, 1.6 miles. - This my friends, is a professional. I'd be nowhere without this man. - [Vioceover] Hi there. - [Voiceover] Hello. - What....are.... - It's just a barrel of excitement. - Oh yea, okay. (laughing) - Check, check, check What's up guys? This is Lou's cousin Thomas, and we're here at the 2016 CES, and here we have some lovely ladies. - Hi, I'm beaming you from Colorado, and it's snowy, and I'm glad that I don't have to leave my house today. - Not much, you know, just relaxing. Being able to be in Bermuda, and Las Vegas at the same time by a beam is pretty awesome. - I'm talking to two girls, from two different countries, in Las Vegas, this is pretty wild. - So beam the smart person system by Suitable Tech, and it basically allows you to connect remotely from anywhere in the world. So, if you cannot physically be present in Las Vegas right now, you can do like Kim and I are doing and using Beams to communicate, and look, and sound as great as we would if we were there in person. - Yea, how about just like the coolest dance moves? Do you think we could do something like that? I think we got it, we're twirling. - How did Tom do, everyone? - I'm going to put them on the spot, this is speed dating. We could.... - Did you hear that ladies? - Oh my god, really? - This stuff is pretty cool, I think I might.... maybe I should drive one of these. What do you think? I'm going to try this out. This is beam on beam action right here. I'm doing very well, I'm just enjoying.... - You're a little to close to me here. - I like to get close to people. - I know, holy cow. - I'm really enjoying going up and speaking to people. Hello, hello everyone. - You're a little close there. You're kind of on my foot, let me just move my foot. - Hello. - Where are you? - Well I'm still trying to figure that out. I'm in some other world, I've become a robot now. Yea, I know, it's a little bit sad, a little bit sad. - I might just run right in.... - Finn, where are you going? How's it going? Nice to meet you. - Where are you? - Well, I'm near by. - I will make you a friend. - I've seen videos on these things before, but until you actually use one, you don't really understand how cool that feeling is to be somewhere your not. As you guys can tell, LG has stepped up the set up game. 112 4K oled displays running this video in native, native resolution. This is some kind of challenge. Oh my goodness. So what do you guys think? Racing simulator in front of this? I could just have some different window open in each display. I actually want to show you guys one other thing. Follow me. 98 inch super UHDTV 8k in one display. You can spell the pixels. You're going to need some content for it. Not a lot of stuff in native 8K. So many Ks, eight of those Ks. Ks for days. Do people need this? No. This place, CES, this ain't a place of need. This is a place of want. The progress of technology, through mankind and Mike Monopoli. - It's been a pleasure, Lou. - Close it out here. There you have it. I think that wraps it up, had a lot of fun out here, CES. There it is, I'm going to go take a nap.",
    "transcript_keywords": [
        "high fashion world",
        "high fashion",
        "Las Vegas",
        "Check",
        "guys",
        "video",
        "CES",
        "beam",
        "Las",
        "Vegas",
        "Yea",
        "Lou",
        "walkie talkie",
        "display",
        "pretty",
        "fashion world",
        "cool",
        "kind",
        "close",
        "people"
    ],
    "transcript_entity_values": [
        "three kilometers",
        "Three thousand milliamp hours",
        "112",
        "2016",
        "98 inch",
        "1.6 miles",
        "today",
        "Ks",
        "Jack",
        "youtube",
        "Lou",
        "Beams",
        "eight",
        "Colorado",
        "two",
        "- Finn",
        "one day",
        "LG",
        "Suitable Tech",
        "EMP",
        "Giroptic",
        "Las Vegas",
        "4",
        "one two",
        "CES",
        "Kim",
        "Mike Monopoli",
        "360",
        "Bermuda",
        "Three kilometers",
        "Giroptic",
        "French",
        "Alps",
        "Thomas",
        "Tom",
        "one"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "EVENT",
        "NORP",
        "LOC",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}