{
    "id": "fMw1h4hKT_E",
    "title": "Sony WF-1000XM4 review: silence to my ears",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2021-06-08T16:00:30Z",
    "video_url": "https://www.youtube.com/watch?v=fMw1h4hKT_E",
    "category": "Science & Technology",
    "tags": [
        "sony wf-1000xm4",
        "sony wh-1000xm4",
        "sony wh-1000xm4 review",
        "sony wf-1000xm4 leaks",
        "sony wf-1000xm4 vs xm3",
        "sony wf-1000xm4 leak",
        "sony",
        "earbuds",
        "wireless earbuds",
        "best earbuds",
        "best wireless earbuds",
        "airpods",
        "airpods pro",
        "apple airpods",
        "airpods 2",
        "LDAC tech",
        "headphones",
        "best headphones",
        "wireless headphones",
        "best headphones 2021",
        "ipx4",
        "ipx4 waterproof",
        "ipx4 water test",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "verge",
        "the verge"
    ],
    "views": 939901,
    "likes": 19519,
    "comments_count": 1331,
    "description": "Sonys new WF-1000XM4 wireless earbuds have powerful noise cancellation that rivals over-ear headphones. They offer fantastic sound quality with support for the LDAC codec and beat competitors like the AirPods Pro and Bose QuietComfort Earbuds in battery life. Are these the new noise-canceling buds to get?  Read more:   Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://bit.ly/3x78Ksg",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So it's been almost two years since Sony released the excellent WF-1000XM3 earbuds, which had the best noise cancellation and sound quality of any true wireless earbuds at that time. But a lot has happened since. At the top end, We've seen products like the AirPods Pro and Bose's QuietComfort earbuds. And you can get a perfectly fine set of noise canceling earbuds for cheaper than ever before. But now, Sony's back. And let me tell you, it was worth the wait. The new WF-1000XM4 earbuds, we've still got these terrible names, cost $279, which is a lot of money. But if you're willing to part with it, you'll get the most impressive noise cancellation I've ever heard in earbuds like these, even better sound quality, longer battery life, I know. This time, they finally got water and sweat resistance. (case clicking) (upbeat music) So the new earbuds are 10% smaller than the 1000XM3s. And they come in the usual Sony colors of black with rose gold accents or a light gray option instead. But the case is where the real downsizing has happened. It's 40% smaller than before. And you can feel that difference when it's inside your pocket. There's only one LED on the outside now, though, which means there are no lights on the earbuds themselves to tell you how their charge is. But I guess, that's the trade-off for a more compact design. But I actually want to start off with the ear tips. This isn't something we often focus on, but Sony has come up with these stellar tips that feel like a mix of silicone and foam that sealed into my ears just perfectly. I guess that's why they're called the Noise Isolation Ear Tips. Sony is so confident in them that these new tips are now all you get and only in three sizes I would've liked to have seen more fit options for this much money, but the large pair were right on for me. The 1000XM4s never so much as budged, even though I took them on runs or for a hike outside. And since they're now rated IPX4 for water and sweat resistance, you can work out while you wear them, or wear them in the rain and be confident that they'll survive, just be careful to keep the case dry. Those snug ear tips combined with Sony's new V1 processor lead to the best noise cancellation I've ever experienced with a true wireless earbuds so far. Step aside, Bose. I'm not exaggerating when I say that it's now almost as good as Sony's over-ear 1000XM4 headphones. And those have the advantage of literally covering your entire ears. Working outside my local coffee shop on a busy Brooklyn street, everything around me just went poof. And the clatter of subway cars was quieter with these in my ears than with the AirPods or Bose's earbuds. Becca took the Sonys on a flight and they passed the plane test with flying colors. It's wildly good stuff and a real technical achievement on Sony's part. There's an ambient sound mode you can activate with the tap of the left earbud to hear what's happening around you. And Sony still has its old trick where you can hold down on the earbud to temporarily lower the volume of your music and boost ambient sound at the same time. (chill music) The 1000XM4s also get the Speak-to-Chat feature of the latest Sony headphones. When this setting's turned on, the earbuds automatically pause and activate transparency mode if they detect you speaking. If you talk to yourself, even semi-regularly, you should probably just leave this off. Now, let's talk sound quality. Sony tells me that it tunes it's earbuds and headphones based on what genres of music are popular at the time. And so while the 1000XM4s sound mostly similar to the 1000XM3s, there's this added layer of richer bass than there was before. You still get that superb sound signature that's just playing better than the AirPods Pro. And I prefer Sony's tuning to other high-end earbuds, like the Sennheiser Momentum True Wireless 2s. It's easy just to get lost in your tunes with these earbuds. For the first time on it's earbuds, Sony's also now supporting LDAC, so you can stream lossless audio from Amazon Music HD, and soon Spotify and Apple Music. And it'll come through at a higher quality on the buds. It's not quite CD quality. You see LDAC tops out around 900 kilobits per second. And it gets a little unstable if you set it at that maximum quality. So I usually stick with the middle setting. Is there any real difference though? Maybe I'm buying in a snake oil. But to me, these lossless tracks do feel like they've got more depth and clarity to them. Either way, you can only get LDAC on Android. And the 1000XM4s still sound just as good, when you listen to AAC files on an iPhone. And then, there's the battery life, which is one of the more impressive things Sony's pulled off. The 1000XM4 buds get eight hours of playback with noise canceling on, which crushes Apple, and Bose, and Jabra, and Amazon, Samsung, and well, pretty much everybody else. They all hover around five hours, and Sony just tacked on three more. That's progress. Battery life extends to 12 hours if you don't need noise canceling on. The case has enough juice for two full recharges. So we're talking 24 hours in noise-canceling mode and 36 hours if you leave it disabled. As we all start traveling again more often, these numbers really set Sony apart and help justify that $279 price. And the carrying case charges both wirelessly and over USB-C. As for voice calls, the 1000XM4s use both beamforming mics and bone conduction sensors that Sony claims help the earbuds know when you're speaking and when you're not. To hear how that comes across in practice, let's turn it over to Becca. - Rolling, rolling, rolling. Did someone say mic test? First up, we have the Galaxy Buds Pro. They were $200 when they were released, and they were known for their windshield technology. So you could have clear calls even in windy conditions. Okay, next up is the AirPods Pro. They have been the gold standard for a very long time when it comes to mic quality. And quite frankly, I'm getting tired of saying that line. Okay, now, we have Sony's WH-1000XM4s, which I agree with Chris is a horrible name, but they have bone-conduction sensors and beamforming mics. How do they sound? Okay, and this one's a bit of a wildcard buds. These are the Soundcore Liberty Air 2 Pros. I really dig these headphones and they're only $130. They have really good active noise cancellation. So just want to throw them into the mix. Run the sink Y'all love this test. I don't know why. I was more a fan of the wind test that we did for the Galaxy Buds Pro. But sink test is back by popular demand. The sink test runs the sink while I'm using the mics so that you can see how they sound with a lot of background noise. Is it canceling it out? Is it bringing it in? See, thing about the water test is that I feel like I'm wasting loads of water. And I usually collect it and water my plants with it, but I don't need to water any of my plants right now. So, and that was in background noise. So these $130 buds hold up to the other? Bummer. While you could hear me with these Sonys, it all just seemed kinda muffled. And with the sink running, it did take out that sound, but I wouldn't say they have great mic quality overall. You might blame it on the fact that they don't have a stem like the AirPod Pros or the Soundcore Liberty Air 2 Pros. But the Galaxy Buds Pro also don't have stems, and they have pretty good mics. I guess better luck next time. - So as you just heard, these are not flawless earbuds. And there are a few other frustrations you should be aware of. First, they can only pair to one device at a time. And look, I don't understand how it's 2021 and only Jabra has figured out how to support multipoint Bluetooth on earbuds. Sony knows how to make this happen on its headphones, but you don't get the same convenience here. At $280, that's a hard thing to see Sony leave out. So I have hit some bugs with my reviewing it so far. The earbuds have crashed a couple of times playing the kind of sound you hear when a video game freezes. And sometimes, only one earbud will pair to my phone at a time. So I've got to drop them both back in at the case to get everything sorted out again. Neither issue's been that frequent, and Sony usually does a pretty good job of fixing these early bugs with firmware updates. Here's my takeaway. Sony's WF-1000XM4 earbuds are the best noise canceling set you can get today. By combining its latest hardware with those fantastic ear tips, Sony has beaten Bose for the noise cancellation crown. And these are up there with the very best-sounding, true wireless earbuds you can buy. They can outlast the competition in battery life and now come with reassuring water and sweat resistance. There's no need to spend this much money for a good set of noise canceling earbuds. But if you do, you'll get a top-notch experience in exchange. Sony is back at the top of the mountain. The only question now is for how long. - [Becca] Spooky scary, spooky scary. - [Chris] You should find a subway grate and do it over there. - [Becca] Oh my God. I couldn't watch.",
    "transcript_keywords": [
        "Sony",
        "earbuds",
        "Galaxy Buds Pro",
        "noise",
        "sound",
        "Buds Pro",
        "Pro",
        "true wireless earbuds",
        "noise cancellation",
        "noise canceling earbuds",
        "noise canceling",
        "time",
        "ear tips",
        "buds",
        "AirPods Pro",
        "quality",
        "wireless earbuds",
        "Bose",
        "Galaxy Buds",
        "tips"
    ],
    "transcript_entity_values": [
        "LDAC",
        "24 hours",
        "Becca] Spooky",
        "130",
        "Chris",
        "Android",
        "only one",
        "one",
        "1000XM4s",
        "Apple",
        "three",
        "the Noise Isolation Ear Tips",
        "the AirPods Pro",
        "Amazon Music HD",
        "around five hours",
        "AAC",
        "10%",
        "USB-C.",
        "the Soundcore Liberty Air 2 Pros",
        "280",
        "almost two years",
        "the AirPods Pro",
        "today",
        "only $130",
        "Spotify",
        "Bose",
        "WH-1000XM4s",
        "the Sennheiser Momentum True Wireless 2s",
        "1000XM3s",
        "the Galaxy Buds Pro",
        "Becca",
        "Samsung",
        "Bose",
        "two",
        "279",
        "40%",
        "Amazon",
        "around 900 kilobits per second",
        "12 hours",
        "QuietComfort",
        "Jabra",
        "AirPods",
        "Brooklyn",
        "LDAC",
        "36 hours",
        "Bose",
        "eight hours",
        "Sony",
        "200",
        "first",
        "1000XM4",
        "iPhone",
        "Sonys",
        "2021",
        "First",
        "Apple Music"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "TIME",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "LAW",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "FAC",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "ORG",
        "TIME",
        "PRODUCT",
        "TIME",
        "ORG",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG"
    ]
}