{
    "id": "FmycxbJPzTg",
    "title": "The 16 inch MacBook Pro Concept (2019)",
    "channel": "Jonathan Morrison ",
    "channel_id": "UCDlQwv99CovKafGvxyaiNDA",
    "subscriber_count": 2540000,
    "upload_date": "2019-02-19T17:22:38Z",
    "video_url": "https://www.youtube.com/watch?v=FmycxbJPzTg",
    "category": "Science & Technology",
    "tags": [
        "2019",
        "macbook pro",
        "apple",
        "16 macbook pro",
        "16 inch macbook pro",
        "2019 macbook pro",
        "2018",
        "2018 macbook pro",
        "unboxing",
        "review",
        "jonathan morrison",
        "tld",
        "macbook pro concept",
        "macbook pro rumors",
        "2019 macbook pro review",
        "2019 macbook pro rumors",
        "rumors",
        "concept",
        "mac pro",
        "mac pro 2019",
        "apple display 2019",
        "14 inch macbook pro",
        "13 inch macbook pro",
        "15 inch macbook pro",
        "17 inch macbook pro"
    ],
    "views": 253539,
    "likes": 6361,
    "comments_count": 641,
    "description": "This 16 inch MacBook Pro Concept is Beautiful (via 9to5mac)  14 and 16 inch MacBook Pros, new 6K Apple Display? Yes. Please.  Subscribe to 9to5Mac!   5 Gadgets to Kick off 2019!   Additional Renders by Viktor Kadar:    17 inch MacBook Pro Keynote (RIP)   50 Gadgets Under $50   TLD Behind the Scenes!  Mobile users:   Music via Musicbed:   My Audio Setup & Gear:   Instagram:",
    "description_links": [
        "https://9to5mac.com/2019/02/19/macbook-pro-16-inch-concept-renders/",
        "http://www.youtube.com/9to5mac",
        "https://youtu.be/dDInqXLYS-o",
        "https://www.behance.net/gallery/68767665/MacBook-Pro-Concept",
        "https://www.instagram.com/kadarvik/",
        "https://www.youtube.com/watch?v=hVneba3BeJY",
        "https://youtu.be/PPg1Nvv7zTM",
        "http://bit.ly/TLDBreakdown",
        "https://www.youtube.com/channel/UCDlQwv99CovKafGvxyaiNDA/join",
        "http://share.mscbd.fm/tldtoday",
        "https://youtu.be/v9hu-Avj2oE?list=PLq...",
        "http://www.instagram.com/tldtoday"
    ],
    "transcript": "- You guys, there is a rumor of a 16-inch MacBook Pro and oh my God, yes please. (funky electronic music) So this week kicked off with a sandwich full of 2019 app rumors that kinda punched the internet in the face. Everything from new iPhones to a new iPad to a new Apple Watch but what got my attention and what is more interesting is the idea of a 31.5-inch 6K Apple display and even more exciting: a 16-inch MacBook Pro. (gurgle noise) This is really exciting news especially for that collective group of people who have been begging Tim Cook to please bring back that 17-inch MacBook Pro, which I'll say was awesome for its time but in terms of the current day MacBook design as it is now, didn't really make sense to bring back because if you go way back to 2012, when that MacBook Pro was discontinued, yeah, it had an awesome big 17-inch display but it was essentially AC resolution at 1920 x 1200 and weighed nearly 7 pounds which is cool if you wanna curl it but to bring that in a backpack sounds absolutely awful. - At 6.6 pounds, it's also the world's lightest 17-inch notebook. - So with that, and maybe one area where I think people are potentially getting a little mixed up, is I don't think the 16 or 6 and a half inch MacBook Pro is an addition to the 15-inch MacBook Pro, I actually think it's a replacement. There isn't one person on this planet that could argue that the current MacBook Pro design isn't outdated and those bezels stand out more than MJ's jeans. Especially when you compare it to the iPhone, the iPad Pro, it just doesn't feel as up to date as everything else. Taking a look at the current MacBook Pro on the right, and here is what the 16-inch MacBook Pro could look like on the left and as you can see, the actual form factor isn't much bigger. You're just getting more screen real estate. Shout-out to the brilliant team over at 9to5Mac who put these beautiful renders together. And even though it's not real, it's just a concept, just looking at what this could be is making me like my current MacBook Pro less and less. If you happen to read one of the 164 regurgitated articles on this MacBook Pro rumor, they essentially said, \"Hi, there might be a 16-inch MacBook Pro later this year. K, bye.\" That's cool but how about what does 16-inch MacBook Pro might actually feature? The current 15-inch MacBook Pro has a resolution of 2880 x 1800. And yeah, a 4K or a 5K display would be awesome but I would actually hope for a brighter display. When you stack that MacBook Pro side-by-side against an iMac Pro, it makes you want just a little bit more. What I think is absolutely necessary with these 2019 MacBook Pros, or at least this one if it's going to be kind of the MacBook of all MacBooks, is the implementation of Face ID. Yeah Touch ID is cool but once you get used to Face ID on the iPhone or even now the new iPad Pro, Touch ID seems a little archaic. After using Face ID on the iPad Pro, that is really what sold me on that concept on the MacBook Pro. So going forward, if that's not on the MacBook Pro, I think that's going to be a hit on Apple. As far as the internals go, more than likely we're gonna see Intel chips inside the MacBook Pro. We have a ways to go before we see ARM chips or at the very least, with a redesign hopefully Apple takes better advantage of the cooling so we can take better advantage of the power inside these machines. From there hopefully alongside the rumor 16-inch MacBook Pro that bumps up the 13-inch MacBook Pro to a 14-inch model. And that actually makes way more sense in terms of an entire lineup. You have the 16 and 14-inch MacBook Pros, you would then have a 13-inch MacBook Air, and potentially a 12-inch ARM-powered MacBook and that actually sounds like a lot of it makes sense unlike the current disaster that is out right now. Aside from that, what're you guys most excited for with this rumored 16-inch MacBook Pro? The display, the specs, the idea of using alongside that mammoth 31.5-inch 6K display that cannot get here soon enough. Take my money. Other than that, make sure you guys check out 9to5Mac for those beautiful renders. They also have an amazing YouTube channel, remember my guy, Jeff Benjamin, which is linked down below. This is Jonathan and I will catch you guys later. (chill music)",
    "transcript_keywords": [
        "MacBook Pro",
        "Pro",
        "current MacBook Pro",
        "MacBook",
        "iPad Pro",
        "MacBook Pro rumor",
        "MacBook Pro design",
        "current MacBook",
        "inch MacBook Pro",
        "God",
        "MacBook Pro sidebyside",
        "current",
        "Pros",
        "display",
        "Apple",
        "face",
        "Pro rumor",
        "Pro design",
        "Apple Watch",
        "Tim Cook"
    ],
    "transcript_entity_values": [
        "16-inch",
        "K Apple",
        "AC",
        "5",
        "iPhone",
        "Apple Watch",
        "2012",
        "Jeff Benjamin",
        "MacBook Pros",
        "the iPad Pro",
        "MJ",
        "4",
        "17-inch",
        "15-inch",
        "MacBook",
        "the iPad Pro",
        "iMac Pro",
        "14-inch",
        "Apple",
        "YouTube",
        "the MacBook Pro",
        "iPad",
        "16",
        "2019",
        "Intel",
        "164",
        "6.6 pounds",
        "31.5-inch",
        "6 and a half inch",
        "MacBook Pro",
        "9to5Mac",
        "iPad Pro",
        "13-inch",
        "6",
        "the MacBook Pro",
        "one",
        "Tim Cook",
        "nearly 7 pounds",
        "MacBook Pro",
        "MacBooks",
        "12-inch",
        "this week",
        "1920",
        "1200",
        "MacBook",
        "later this year",
        "2880",
        "MacBook Air",
        "Jonathan"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "FAC",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON"
    ]
}