{
    "id": "fnCeV7EoNo8",
    "title": "I tried living on Mars — in Hawaii",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-10T13:00:05Z",
    "video_url": "https://www.youtube.com/watch?v=fnCeV7EoNo8",
    "category": "Science & Technology",
    "tags": [
        "mars",
        "mars life",
        "nasa",
        "space",
        "mars rover",
        "life on mars",
        "life in mars",
        "mars surface",
        "solar system",
        "exploration",
        "rocket",
        "mars documentary",
        "engineering",
        "hawaii",
        "discovery",
        "loren grush",
        "spacecraft",
        "international space station",
        "spacesuit",
        "space suit",
        "nasa astronaut training",
        "space travel",
        "astronaut",
        "astronauts",
        "gravity",
        "space exploration",
        "earth",
        "planet",
        "in space",
        "nasa news",
        "universe",
        "science",
        "experiment",
        "education",
        "technology",
        "verge science",
        "the verge",
        "seeker",
        "life noggin",
        "Veritasium",
        "SciShow"
    ],
    "views": 128156,
    "likes": 3250,
    "comments_count": 133,
    "description": "In this season two premiere of Space Craft, Loren Grush takes us to a remote habitat on the island of Hawaii to simulate what life is like on the Red Planet.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- No one ever said space was graceful. - No, it really isn't. Okay, you're almost there. - Okay. - [Loren] A human mission to Mars, won't be quick. A full trip to the red planet could potentially last up to two and a half years. That means martian crew members will be spending a lot of time together, isolated from earth. So NASA wants to know what kinds of traits a person will need to be an ideal Mars astronaut. The best way to figure that out? Send people to Mars, before you send people to Mars. It's taken us about an hour to get to the meeting place. Where we are meeting the people from HI-SEAS, and then it's going to take us another hour to get to the HI-SEAS habitat, and our ear are definitely popping as we get higher and higher. - [Loren] We're on our way to HI-SEAS, an analog Mars habitat run by the University of Hawaii, and funded by NASA. It's located on the state's big island, and getting there does feel a bit like traveling to Mars. There are plenty of remote locations on earth, so why pick Hawaii? Well it has to do with the terrain. Not the beaches or the green valleys though. HI-SEAS is located on the side of an active volcano, Mauna Loa. - What's great about the geology out here, is it's actually pretty similar to what we might find on Mars, thanks to past volcanic activity on the planet. - This area, we're about 7000 feet on Mauna Loa right now. Is very, very similar to the surface of a young Mars. Since Mars has not had much in the way of erosion, over the years, it's not all that different from the surface of current Mars. - What are some of the things that you are specifically testing for, the data that you're collecting, and how are you giving that to NASA, and translating that for them? - One of the focuses, what NASA's funding has to do here, is to really look at crew dynamics. So, how do you pick a crew, how do you pick individuals, how do you put them together into a crew, so that they'll work really well over these long duration missions. 'Cause as I'm sure you've seen, maybe on a camping trip, there's some groups that work really well over a long weekend, but maybe you wouldn't want to spend two and half years with. - Not just even a camping trip, just on a weekend in my apartment, but I digress. (electronic music) - So, welcome to the habitat. - Home sweet home. - Yeah, so this area is the reconfigurable area, so they can move things around here. It's where they do most of their work, it's where they exercise, it's where they socialize. Really, a lot of stuff happens in this area. - [Loren] A typical day in the habitat can consist of analyzing samples, writing reports, field work, what Mars astronauts would probably do. Each person has their own bedroom, though it's not very big. There is also cooking with mostly non-perishable items, and just general free time to fill, like reading books, or watching movies. It didn't look like a very glamorous life, though, so I decided to ask someone who'd lived it. Meet Annie Meier. She's a Research Test Engineer at NASA, who spent four months at HI-SEAS, back in 2014. - The crew was an international crew from all over the world We were from all different upbringings, and we all met fundamental credentials to be on the mission, but I would say just like any family that's locked up in a house too long, you have some disagreements or different approaches of how you solve a problem, and so if things ever did become an issue, we were pretty good about trying to immediately extinguish an issues right away, and talking about it, because you can't just walk out the front door and go for a walk. It's like you're stuck here. - It would be bad for you. - Yeah, so we could only take showers, we had about 10 min of shower water, per crew member, per week, and we were working out, - I'm sorry per week? - So we were working out every day, simulating reduced gravity, so a couple hour of sweating, and working out. Or if you went, you put on that big space suit, and you got all sweaty. - [Loren] Right. - You can't take a very long shower, so I definitely missed modern plumbing, but you made it work. - [Loren] Speaking of modern plumbing, the toilets also don't have any. - Have you seen the movie The Martian? - I have. - You might remember that growing potatoes in compost was a fairly central part of the story. - [Loren] I do recall, yes. - Well our crews, too, have composting toilets. The microbial community lives in the toilet, turns your deposit into nice clean compost. - Oh, well that's lovely, so you're kind of living with it for a while. - You are, and you're highly motivated to keep that microbial community happy and healthy. - [Loren] Making matters worse, all electronic communication in and out of the habitat is delayed by 20 minutes each way. That's roughly how long it would take for a radio signal to travel the distance from Mars to Earth, though timing will vary, depending on the planet's orbits. So getting a reply from someone on Earth could take up to 40 minutes. - Yeah it was stressful. If things were going bad back home, and you got an email, you can't do anything about it. Everyone had their own personal lives continuing without them. Friends were celebrating milestones and you're here, doing the simulated Mars mission. - [Loren] If you want to go for a stroll? The only way to go outside the habitat is to suit up. Just like you would have to on Mars. The thing is, Martian astronauts won't be spending that much time roaming around the surface. Mars' atmosphere is much thinner than earth's, so it provides little protection from deep space radiation, either from incoming solar flares or cosmic rays stemming from outside the galaxy, so rather than leave the habitat all the time to get new samples, astronauts are going to want to send out recon missions first to study the landscape. The best way to do that? A radiation hardened rover. And we've got just the thing. - So you want to minimize the amount of time that human's spend outside a protected habitat. So what you do is, you send a rover out, to scout the location, see what's around. If you have a special area that you're interested in, send the rover, take images, take soil samples, bring it back and then once you've identified which are the key locations, you want to send human's there to follow up, then they are not going to be wasting time trying to find a location. It's already pre-identified by the rover. - [Loren] I had some fun cruising with the rover outside, but in reality, astronauts aren't going to be anywhere near the vehicle when they operate it. - Ah, that worked. - We got E.T. - Do five more degrees. - Okay. - Those elusive martians. (laughter) - [Loren] It's a tedious process operating the rover from the control center. It involved typing in commands to inch the rover forward, or tilt the cameras ever so slightly to get that perfect picture of a rock. - [Loren] I'm getting the hang of This. - [Rodrigo] Sounds like it, you are passing your driver's test. - Oh it's like being 16 all over again. So one thing I'm learning here is that, you really need a lot of patience to accomplish any task on Mars. - Yes, everything is done very slowly, there's certain time delays involved, the instrumentation you're carrying on board is delicate, it's expensive, so yeah you don't want to rush things. Even though right now, landing moves really slow, it's ten times faster than curiosity. - [Loren] It just goes to show that martian astronauts will be spending a lot of time inside. Cooped up, with not much room to roam around. And with the same people around you at all times. It's not going to be like a vacation. It's going to be an extreme environment, that most can't handle, but that's why HI-SEAS exists. So that NASA can find out what it will be like, and to find the people who can handle it. Hey everyone, thanks so much for watching. If you enjoyed this video and want more space content, you should check out our new YouTube channel, Verge Science. See you there.",
    "transcript_keywords": [
        "Mars",
        "HISEAS",
        "NASA",
        "time",
        "habitat",
        "crew",
        "rover",
        "Mars habitat",
        "Send",
        "earth",
        "things",
        "Mars astronaut",
        "Mauna Loa",
        "Mars habitat run",
        "analog Mars habitat",
        "Mars mission",
        "astronauts",
        "work",
        "area",
        "long"
    ],
    "transcript_entity_values": [
        "martian",
        "about 7000 feet",
        "Rodrigo",
        "one",
        "four months",
        "a long weekend",
        "another hour",
        "Earth",
        "five more degrees",
        "Martian",
        "Mars",
        "earth",
        "a couple hour",
        "two and half years",
        "the years",
        "Verge Science",
        "20 minutes",
        "NASA",
        "Mauna Loa",
        "2014",
        "two and a half years",
        "Loren",
        "Annie Meier",
        "the University of Hawaii",
        "up to 40 minutes",
        "YouTube",
        "first",
        "Hawaii",
        "Mauna Loa",
        "every day",
        "16",
        "a weekend",
        "about an hour",
        "ten"
    ],
    "transcript_entity_types": [
        "NORP",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "LOC",
        "QUANTITY",
        "NORP",
        "LOC",
        "LOC",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "ORDINAL",
        "GPE",
        "FAC",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL"
    ]
}