{
    "id": "fPauZYz5lNE",
    "title": "FINALE: How Many Skylake CPU Cores Do You Need for Gaming?",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2016-09-15T01:47:42Z",
    "video_url": "https://www.youtube.com/watch?v=fPauZYz5lNE",
    "category": "Education",
    "tags": [
        "Intel",
        "Core",
        "i7",
        "6700K",
        "6600K",
        "6500",
        "6100",
        "Pentium",
        "i3",
        "i5",
        "Quad",
        "Dual",
        "Hyper",
        "Threading",
        "Hyperthreading",
        "HT",
        "Processor",
        "CPU",
        "How",
        "Many",
        "Skylake",
        "Cores",
        "Do",
        "You",
        "Need",
        "For",
        "Gaming",
        "Science",
        "Studio",
        "Techquickie",
        "Benchmarks",
        "Fail",
        "Grand",
        "Theft",
        "Auto V",
        "GTAV",
        "PC",
        "Game",
        "Games",
        "Total",
        "War",
        "Cities",
        "Skylines",
        "CS:GO",
        "Counter",
        "Strike",
        "Ashes",
        "Singularity",
        "AotS",
        "DX11",
        "DX12",
        "API",
        "Benchmark",
        "FPS",
        "Frames",
        "Per",
        "Second",
        "Rate",
        "BF1",
        "Battlefield",
        "Testing",
        "1440p",
        "Resolution",
        "Computer",
        "Custom",
        "Rig",
        "Build",
        "Guide",
        "Tutorial"
    ],
    "views": 127637,
    "likes": 5802,
    "comments_count": 808,
    "description": "- Here's the finale! Check out Parts 1-3 if you haven't already, and prepare yourselves for a large sum of data. For every benchmark shown, an i7 6700K was used along with 16GB DDR4 and an ASUS Strix GTX 1070.  \"Hyper-Threading\" Explained by Techquickie:   FACEBOOK:  TWITTER: @GregSalazarYT INSTAGRAM: @GregSalazarYT  Subscribe to the channel!  MUSIC: 'Different Story' by Mickeen 'Tremsz' by Gunnar Olsen  DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our CJ account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://youtu.be/wnS50lJicXc"
    ],
    "transcript": "This is it, the final verdict. We've tested 1 core with 1 thread, 1 core with hyper threading, a triple core scenario... But this... this is gold. For those of you tuning in for the first time, welcome aboard. We've been disabling cores and hyperthreads in an effort to scrutinize CPU core scaling in modern and popular \"Triple A\" titles. The only Exception being CS:GO. You can start here if you're interested in watching from the beginning or stick around for everything to be thrown at you all at once. Although there are a few pretty funny parts in Part 1. Let's quickly review the test bench. It's that right there. It's my own personal rig. For every scenario you're about to see, 16 gigabytes of DDR 4, clocked at 3000 mHz, was used; not the RAM you're seeing now mind you. An ASUS Strix ROG GTX 1070 running at stock, and an Intel Core i7 6700k whose cores and hyper threading capabilities will be enabled and disabled, starting from 1 core and 1 thread, all the way up to 4 cores and 8 threads. The CPU has also been held at 4.4 GHz throughout for the sake of consistency. Remember, we're doing this purely from a scientific stand point. Manipulating any other variables in this experiment would be pointless, as the only thing we're trying to do here is determine the number of cores necessary to game at a fairly demanding resolution.. 1440p. In-game settings were liberally tuned as you'll see in the graphs; it's about that time actually. Here they are. First on the list, as usual, the well balanced PC port GTA 5. At max settings and no anti-aliasing, to spare the GPU of unwanted stress, we see a fairly odd trend. Yes, as core count increases the frame rate does as well, but... that's as far as it goes. Hyper threading really doesn't help out Grand Theft Auto. I first noticed this on my i3 vs i5 video, that you can check out right here. Long story short, it's the physical cores that matter in a game like this. By the way, the C stands for \"Core\", and the T stands for \"Threads\". So, if the thread count is double the core count, it means that hyper threading was enabled in that scenario. Now then. Jumping from say a Pentium to an i3 won't make much of a difference in a game like Grand Theft Auto 5; I've actually confirmed that with those physical processors as well. And yes, I know that level 3 cache varies, but it won't significantly impact over all frame rates in a well optimized game. Remember, in this case, it's constant. As is clock speed for that matter. But the CPU's these scenarios represent will vary slightly. CPU clock speed doesn't change very much in game either, believe it or not, and I've proven that in a series right here. On to Cities : Skylines, notably very CPU intensive. It definitely shows. And you know what else shows? The frame rate increase when hyper threading is enabled, hence the rather linear trend here. What's likely going on here is City : Skylines is pushing a large amount of parallel data to the CPU. In which case an adept scheduler, in a hyper threaded environment, would surely help. The more threads, the more data can be processed simultaneously. If GTA 5 isn't hyper threading optimized it won't know how to send more information to the dispatch and schedulers. Cities is doing quite the opposite : Simply pushing as much data as needed through the pipelines to be later processed and rendered by the GPU. Ashes of the Singularity is very bizarre in another way. Here, essentially, any core count above 2 is ideal. What you're seeing towards the top is something often referred to as \"the law of diminishing returns\". We discuss it extensively in economics. At some point adding another stimulant, in this case a physical core, changes almost nothing. And it shows up like a brick wall at the 3 core boundary. Another interesting note here is how much better the hyper threaded, triple core simulation performed over the quad core, non hyper threaded scenario. When a game is optimized in such a way that it benefits from hyper threads a CPU with more of them should, in theory, trump a CPU with less of them, past a certain point, regardless of how many physical cores there are. We didn't see this in Cities, but we do definitely see it here. Lets' throw it back for a second. CS:GO. How do you think this one will react when more cores are thrown at it? Well, believe it or not, a lot like GTA 5. In fact in a few instances, particularly above the 3 core boundary, hyper threading appears to hurt the overall frame rate. The reasons range far and wide, but one theory involves \"parallelism\". If CS:GO sends information to the CPU in a linear fashion then enabling hyper threading will only stress the decoder and instruction pipeline. At this point I really can't avoid it, let's use the Linus analogy. If hyper threading is a bit like eating with 2 hands, as he says in his Tech Quickie video, but you're chewing and swallowing at a rate slower than either hand is preparing food, you're just wasting energy using 2 hands instead of one, which might even be able to accomplish the task faster now that you're not using additional energy on the second hand . It's an over simplification, yes, but if scheduler has data ready to be processed before the core demands it without hyper threading then what good is hyper threading? We don't see this trend in too many modern games, but CS:GO is definitely a victim here. You could even make the case for GTA 5. Check out the full hyper threading video from Tech Quickie in this video's description. Let's move on. Total War : WARHAMMER, boy is this one strange. So it's a very CPU dependent game, pretty much like every Total War game in existence, but this one falls in to that category for a different reason. It doesn't need many cores, it just needs a few fast ones. Check this out. The difference between a single, hyper threaded core and a full fledged i7 6700k, in terms of averages, equates to just a couple of frames. Sure, minimums are significantly lower, we see these flatten out at the 3 core boundary. But the average frame rate trend is a testament to differing strategies when it comes to game coding. Total War took a different route than most that's for sure. Last up is Battlefield 1Beta. I had to test this one first chronologically because it recently closed for the upcoming official release. As it's a relatively new game, these score are subject to change and my bench marking methods were admittedly not the smoothest, but again, above the 3 core boundary there isn't much of a difference in terms of neither minimums nor averages. Stay tuned for revisited benchmarks once the full game does go on sale. So, what'd you think of the grand finale folks? Did anything catch you by surprise? Let me know in the comments below. Be sure to give this video a thumbs up if you thought it was cool. Give it a thumbs down if you feel the complete opposite, or, if you have no idea what you're doing here. Be sure to click the subscribe button, if you haven't already, and stay tuned for... I don't really know what I'm going to do next. Maybe something about the iPhone SE and the Apple watch, 'cause I've already done something about the Mac. I also have a few head to head mashups between the Macbook and things like the XPS 13 and the Razerblade stealth. If I can get my hands on either of those I'll definitely have those videos uploaded. This is Science Studio. Stay tuned. Thanks for learning with us.",
    "transcript_keywords": [
        "hyper threading",
        "core",
        "hyper",
        "CPU",
        "threading",
        "cores",
        "game",
        "core boundary",
        "Grand Theft Auto",
        "triple core",
        "core count",
        "hyper threaded",
        "CPU core",
        "final verdict",
        "scrutinize CPU core",
        "CPU core scaling",
        "GTA",
        "frame rate",
        "triple core scenario",
        "Total War"
    ],
    "transcript_entity_values": [
        "first",
        "4.4 GHz",
        "GTA",
        "Razerblade",
        "Apple",
        "XPS 13",
        "Science Studio",
        "Linus",
        "4",
        "CPU",
        "2",
        "second",
        "Macbook",
        "Core",
        "3",
        "Grand Theft Auto 5",
        "8",
        "3000",
        "Mac",
        "max",
        "one",
        "WARHAMMER",
        "GPU",
        "Pentium",
        "RAM",
        "Battlefield 1Beta",
        "Skylines",
        "ASUS",
        "Tech Quickie",
        "First",
        "Grand Theft Auto",
        "1",
        "5",
        "16 gigabytes",
        "Triple A",
        "Intel Core"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "NORP",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG"
    ]
}