{
    "id": "FqN7Ktkdfv0",
    "title": "World's Loudest Bluetooth Speaker!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-05T00:36:44Z",
    "video_url": "https://www.youtube.com/watch?v=FqN7Ktkdfv0",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "bluetooth",
        "speaker",
        "bluetooth speaker",
        "wireless",
        "wireless speaker",
        "best bluetooth speaker",
        "best bluetooth",
        "best",
        "2017",
        "beats",
        "beats pill",
        "bose",
        "iphone 7",
        "android",
        "apple",
        "iphone 7 plus",
        "ue boom",
        "ue megaboom",
        "ue",
        "megaboom",
        "loudest",
        "bass",
        "most bass",
        "speakers",
        "wireless speakers",
        "fluance",
        "fi70",
        "fluance fi70",
        "best wireless speaker",
        "best speaker",
        "iphone speaker",
        "cool gadgets",
        "cool"
    ],
    "views": 3496980,
    "likes": 62429,
    "comments_count": 3787,
    "description": "Fluance Fi70 Speaker (USA Link) -  Fluance Fi70 Speaker (International) -   This is the loudest bluetooth speaker I've ever tested. It might be the loudest bluetooth speaker in the world!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2lajsJy",
        "http://geni.us/BIRzodg",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So, you can probably tell that there's a very big box here, it's not even completely in the frame. It's got to be one of the biggest boxes that's ever been sitting here On the Unbox Therapy table. And definetely the biggest bluetooth speaker that I ever sat here. So my expectations for sound Are way up here, at the edge of the box. Generally speaking, if you have a bigger speaker cabinet you're gonna get bigger sound. So that's what I'm hoping for here. It's from a company called \"Fluance\" So it's got bluetooth and a couple of other ways to interface with it And you could connect it to a home theater, you could just use it as a fancy looking bluetooth speaker. It's completely up to you. So let's get it out of the box and then take a listen you can get it I believe in a wood finish, black finish, and think it might come in white as well. Some accessories, few cables, user guides look those look fancy woah, more accesories. Ooh, wow, mine is like a, it's like a dark wood color That's massive! Look at that With the wood finish! You kidding me Jack! That's a good look Oh, this whole piece comes out magnetically Look at that. So you can remove the grill if you prefer the look without. So I guess since the back is facing you I might as well talk about the inputs. A power input here, on and off switch, USB charging for USB device. See the bluetooth logo over there. Auxiliary in, optical digital in and then even a radio if you want to listen to Radio Look at the Canadian flag! When I spin it around here and look at this beauty. You can have the grill on like that if you like the more understated appearance, but then you can peel this off and you get the look like that. That might be more my style look at this. Whoa, I could be right through it. Do the video from in here this thing has a mount on the bottom and then a large pedestal elevates it up off the ground to a better listening height. They included the antenna for radio, power cable to get it juiced up, an auxiliary cable for wired connections, a remote control to control it. That's a nice touch Independent settings for treble and bass so you do at least have the ability to make some adjustments, that's a nice little touch. This thing's about to blow your mind. The microphone this is you, you're on this little microphone right over here, you here that scratching that's you you're about to get direct impact I think this guy going to be popular in home entertainment units as well and that's where the optical port comes in you can send the optical out from your flat panel TV and all of a sudden everything you're watching on that display through all those various HDMI inputs are going to come through here on that television optical audio out. I assume these are capacitive let's check it out let me try one. Oh yeah there you go this will change the input here's the Settings button play, pause, forward, back and then volume up and volume down let's hear this thing that's what you're here for *connected* ohhh ohhh Ok, so we get a little volume on here *MUSIC PLAYS* Is that the loudest one yet? that's the loudest one yet. *MUSIC PLAYS* It's the best bluetooth speaker I've ever heard period hands down new champion *MUSIC PLAYS* It's thick, the sound is thick! *MUSIC PLAYS* Gonna move around here to the other side *MUSIC PLAYS* You got bluetooth speaker because, you wanna get loose after a long day of work and then you got bluetooth speaker because you want to upset your neighbors got a bluetooth speaker where you can get a sound complaint and trust me that's the type of bluetooth speaker you want because if don't have a sound complaint chances are you don't know how to party not like Jack not like Ryan not like Tom not like me and on that note, GREATEST BLUETOOTH SPEAKER YOU EVER SAW ON Unbox Therapy This might be it... This probably it... Later",
    "transcript_keywords": [
        "bluetooth speaker",
        "MUSIC PLAYS",
        "speaker",
        "bluetooth",
        "biggest bluetooth speaker",
        "MUSIC",
        "PLAYS",
        "GREATEST BLUETOOTH SPEAKER",
        "Unbox Therapy",
        "big box",
        "sound",
        "Unbox Therapy table",
        "box",
        "optical",
        "biggest bluetooth",
        "bigger speaker",
        "bigger speaker cabinet",
        "wood finish",
        "finish",
        "radio"
    ],
    "transcript_entity_values": [
        "Fluance",
        "Radio Look",
        "Ryan",
        "USB",
        "a long day",
        "Canadian",
        "Tom",
        "Jack"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "NORP",
        "PERSON",
        "PERSON"
    ]
}