{
    "id": "fRcblisQBRM",
    "title": "Goodbye, Internet Explorer ☹",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-06-16T00:24:11Z",
    "video_url": "https://www.youtube.com/watch?v=fRcblisQBRM",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Microsoft",
        "Internet Explorer",
        "Internet Explorer 11",
        "IE 11",
        "IE",
        "Edge",
        "web browser",
        "support",
        "end of life",
        "Hertzbleed"
    ],
    "views": 498927,
    "likes": 27790,
    "comments_count": 1307,
    "description": "Check out the OnePlus 10 Pro 5G here:    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 you need it to live 0:09 Internet Explorer is over 1:02 Hertzbleed side-channel attack 2:01 Ethereum mining not profitable 2:49 OnePlus 10 Pro 5G 3:26 QUICK BITS 3:36 Intel Arc 380 launches in China 4:14 Microsoft patches \"Follina\" flaw 4:36 Nreal Air Steam game streaming 4:59 Kentucky shoplifter charged with 'hacking' 5:36 Floppotron 3.0  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.oneplus.com/ca_en/oneplus-10-pro",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/XGeyC",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Quick, you're about to die of thirst in the desert, and a genie appears. (magical music) What do you ask for? Tech news, of course. (drum riffs) - [Riley] Yes! - Or you're as good as dead. - [Riley] I mean, anything else would be dumb. - [James] Microsoft has finally ended official support for Internet Explorer, the web browser that would eventually become the primary way for millions of people to use the web because it was the only one that was included with Windows, and not because it was particularly good or innovative. You know, the way it's supposed to be. - [Riley] Tradition! - Nevertheless, IE persisted, even as the web was eventually taken over by Google Chrome, Apple Safari, and IE's own successor, Edge. Which we're still waiting for to be canceled. IE is still being used by a number of people who I'm sure have psychologically interesting, yet self-destructive tendencies. Sadly, Microsoft will continue to support IE for businesses paying to keep their Windows 7, 8.1, 10, and server infrastructure on life support. But for everyone else, you'll have to say your goodbyes. - [Riley] No! - Microsoft tried to prepare us for this day, but that don't fix the hurt. Can I get some frickin' F's in the chat? - [Riley] I'm crying right now. Very sad. (James groans) - Intel and AMD's CPUs are vulnerable yet again to side channel attack discovered by security researchers, and you know what that means. A cool name and logo. - [Riley] Yay! - The exploit is called Hertzbleed. (James laughs) It's called Hertzbleed because it involves monitoring a CPU's clock frequency adjustments as it executes a cryptographic workload and converting it into timing data that can be used to steal the processors cryptographic keys. Got it? So, the Hertz is \"bleeding\" into the- - [Riley] It's a stretch. - Environment. - [Riley] We should stop this. - [James] While Hertzbleed doesn't require physical access to the PC, Intel doesn't think the attack is practical outside of a lab environment, since collecting the required power data would take hours to days. These people got a lot of time at Intel. But just in case, you can also defend against the attack by disabling your CPU's boost functionality. You'll loose a lot of performance, but you might also feel like a ninja going in stealth-mode. - [Riley] Ooh. (swords clanking) - You know, sloth-life. There's pros and cons. - [Riley] No one can have me. - There's mold growing on me. (Riley chuckles) - [James] And the cryptocurrency world is not in a great place right now, as prices of everything from Bitcoin to Dogecoin are crashing. Which means for the firs time in years, it's actually less profitable to mine both Ethereum and Bitcoin than it is to just buy it directly. At least at the time of writing. - [Riley] That's not a instruction. Don't listen to us! - Diamond hands baby! (James blows raspberry) That's due to both the crash in crypto-prices, and rise in energy costs as inflation does number on the world economy. The crash has caused major crypto exchange Coinbase to lay off 18% of it's staff, or 1,100 workers. Four months after it paid $14 million to run a Superbowl ad- (Riley laughs) of a QR code bouncing around the screen, DVD player-style. (Riley sighs) Hey, it made people happy for a little while, okay? - [Riley] Yeah. - What else can we hope for? Hey, Riley! (Riley exclaims surprisingly) - Now it's time for Quick Bits, brought to you by the OnePlus 10 Pro 5G coming June 15th with 12 gigs of RAM, and 256 gigs of storage. That's plenty of space for photos, videos, apps, music, and really any type of digital file that people may want to keep on their mobile device. GIFs? The 10 Pro 5G features a 120 hertz display with LTPO technology, and OnePlus's hyper boost gaming engine for smooth gaming sessions. And it comes with a 65 watt wired charger that can get your device to 100% battery in just 34 minutes. Wow! Learn more about the OnePlus 10 Pro 5G at the link below. - If you're alphabet soup spontaneously spells out, \"Quick Bits\", don't freak out. You have experienced a visitation. Rejoice. (Riley scoffs) Praise him. Intel has, as promised, officially launched it's Arc 380 budget desktop graphics card in China. A day after MSI accidentally leaked some benchmarks in Chinese ads for its version of the GPU. The leaked numbers seemingly confirm that the A380, which I believe is also an airplane, is expected to perform about as well as a Nvidia GTX 1650 Super, or a Radeon RX 6400. - [Riley] Also airplanes. - So, no. It can't compete with the upcoming RTX 4090 TI, but, and here's the thing everyone forgets, neither can you. - [Riley] Yeah. - What have you done? - [Riley] Sit down. - Be humble. - [Riley] Yeah chill. - Elon's done a lot for us. Microsoft has released a patch for the Follina vulnerability that has pledged office apps since early May. So, you should probably update your Windows installation, especially if you have habit of opening every Word file that shows up in your email. I can't resist the FOMO. Sure, you don't know the sender. Don't you wanna know what's inside? What if it's a cute picture of a kitty? - [Riley] I love those! (James sighs) - Every one of them. Bless them. Augmented Realty glasses maker, Nreal, has announced the company's Nreal Air headset will be available to stream Steam games from a PC to a virtual screen. The beta will go live at the end of June, which is soon, providing another option for users looking for the most complicated way to enjoy games. The more work you put into setting up, the more you appreciate it. - [Riley] Yeah! - Worth it! - [Riley] Right, David? - Now we're gaming! A Kentucky woman has been charged with hacking after swapping the barcodes of two items at a Walmart, before running the cheaper code through the self-checkout scanner. - [Riley] Hacker! (James bows raspberry) - Black cat. She was initially found guilty of accessing a computer without permission, a Class C Felony, with a sentence of five to 10 years, before- - [Riley] What?! - Before a judge overturned the verdict because, yeah, she had permission to use the self-checkout. But now Kentucky's Attorney General wants to reinstate the guilty verdict. Turns out there are a ton of hackers in places where old people don't know anything about computers. - [Riley] That's where they're all hiding out. In Kentucky. - America's priorities. And you may remember the Floppotron, a patchwork of floppy drives and similar devices that were used to play music. Well, Pawel Zadrozniak, not trying that again, has unveiled the latest version. Floppotron 3.0 composed of 512 floppy disk drives, 16 hard drives, and 4 scanners, which frankly gives professionally performed John William's scores a run for their money. (Riley scoffs) - [Riley] Who needs it? - Go give a listen and bask in the floppiness. (Riley hums) I'm loose, baby. (Riley imitates zapping) And make sure you come back on Wednesday to bask in more floppy tech news goodness. (Riley giggles) I'm somewhat of a floppy-basker myself. - [Riley] What's the point in basking if you ain't gonna flop it? (Riley laughs) - We're going from six to midnight. Fast.",
    "transcript_keywords": [
        "die of thirst",
        "people",
        "Microsoft",
        "Yeah",
        "Intel",
        "Quick Bits",
        "Windows",
        "called Hertzbleed",
        "Hertzbleed",
        "time",
        "Pro",
        "Quick",
        "web",
        "support",
        "Internet Explorer",
        "desert",
        "die",
        "thirst",
        "genie",
        "attack"
    ],
    "transcript_entity_values": [
        "18%",
        "65 watt",
        "Nreal Air",
        "OnePlus",
        "America",
        "Nreal",
        "Intel",
        "Hertz",
        "Ethereum",
        "100%",
        "380",
        "RAM",
        "Elon",
        "a ton",
        "Riley",
        "4",
        "Four months",
        "Hertzbleed",
        "this day",
        "five to 10 years",
        "8.1",
        "Radeon RX 6400",
        "early May",
        "Pawel Zadrozniak",
        "A380",
        "LTPO technology",
        "$14 million",
        "Windows",
        "FOMO",
        "OnePlus 10 Pro 5G",
        "millions",
        "Walmart",
        "Hertzbleed",
        "Google Chrome",
        "David",
        "Microsoft",
        "Edge",
        "Apple Safari",
        "Quick Bits",
        "Kentucky",
        "Windows 7",
        "China",
        "John William's",
        "the end of June",
        "256",
        "10",
        "James] Microsoft",
        "Riley] Tradition",
        "AMD",
        "Chinese",
        "Nvidia",
        "six to midnight",
        "Explorer",
        "A day",
        "hours to days",
        "120",
        "MSI",
        "two",
        "16",
        "Wednesday",
        "Augmented Realty",
        "Coinbase",
        "GPU",
        "Floppotron",
        "Follina",
        "10",
        "1,100",
        "512",
        "Bitcoin",
        "12",
        "CPU",
        "just 34 minutes",
        "James",
        "Dogecoin",
        "years",
        "Pro 5G"
    ],
    "transcript_entity_types": [
        "PERCENT",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "PRODUCT",
        "GPE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "TIME",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "ORG",
        "TIME",
        "PERSON",
        "ORG",
        "DATE",
        "LAW"
    ]
}