{
    "id": "FRJpwTQdd2U",
    "title": "iPhone X DROP TEST - The most Expensive glass ever on a smartphone!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-11-07T17:00:32Z",
    "video_url": "https://www.youtube.com/watch?v=FRJpwTQdd2U",
    "category": "Howto & Style",
    "tags": [
        "iPhone X",
        "iPhone 10",
        "iphone x drop test",
        "iphone 8 plus drop test",
        "iphone durability test",
        "iphone",
        "apple",
        "smartphone",
        "tech",
        "iphone 8",
        "test",
        "expensive",
        "drop",
        "glass",
        "drop test",
        "iphone 8 drop test",
        "durability test",
        "technology",
        "unboxing",
        "durability",
        "destruction",
        "iphone x durability test",
        "bend"
    ],
    "views": 2657334,
    "likes": 47188,
    "comments_count": 7831,
    "description": "iPhone X vs iPhone 8 plus during a drop test. Apple has claimed that their glass is the 'most durable glass ever in a smartphone'... and well... my last two drop tests have proved that to be completely false. Glass is glass.  iPhone 8 drop test round one:  iPhone 8 drop test round two:  If you are curious about how durable the iPhone 8 plus is without a case, its time to watch the iPhone 8 plus drop test and see for yourself.   If the iPhone X is more your style, also known as the iPhone 10, Ill be dropping that alongside the iPhone 8 plus to see when one breaks sooner. The iPhone X does have the stainless steel sides, which will probably give it a durability advantage... But there is only one way to find out.   Fix your iPhone yourself with repair guides and parts from iFixit!:   Current iPhone X Pricing on Amazon:   Cell Phone Replacement Parts:  Awesome Smart Phone Tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/n2wJLnNJRHI",
        "https://youtu.be/3LqtO491Wzg",
        "https://ifix.gd/2zNvp1N",
        "https://amzn.to/2SiXfus",
        "https://goo.gl/8e9zgI",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "So I've been giving Apple a hard time lately over the construction of their recent iPhones because they are so expensive to replace. With the iPhone X, it's $549 to replace the back glass. With the iPhone 8 Plus it's a little bit cheaper, but still incredibly expensive. So today I'm going to put my money where my mouth is and I have two brand new phones, the iPhone X and the iPhone 8 Plus. Both of them have the glass backs with the new construction design, and we're going going to drop them both with realistic drops and see when they may or may not break. Remember that drop tests are never conclusive. With a larger sample size you can get a better idea of what's going to happen. I have done two drop tests in the past with regular sized iPhone 8's, but I have never dropped these two phones. So it'll be interesting to see what happens. Plus I'll be attempting my own back glass repairs on these broken phones, so I need broken phones in order to do that. So it's all for a good cause. Apple does claim to have the most durable glass ever on a smartphone, so it'll be interesting to see what happens with this iPhone X and the new iPhone 8 Plus. Let's get started. [Intro] So like always, we'll have two smartphones. This is the Galaxy S8 Plus, and over here we have the Google Pixel 2. Both of these will be recording in slow motion as we do the drop test. So I'll start with the iPhone 8 Plus. It also has an aluminum frame which is slightly softer than stainless steel and can be pushed into the glass a little more easily. Now, both the iPhone 8 Plus and the iPhone X have a small plastic layer between the glass and the metal, but since aluminum gets pressed in easier, I'm going to assume that this one breaks sooner. So I'm just going to set this on my leg. Right now it's about 3 feet up or 1 meter give or take. Both cameras are recording and I'll just stand up. [Music] So after the first drop it looks like the back is fine. We hit right up here on the corner next the the camera bump. But the back panel is fine and the front is fine. Set that down. And we'll start playing with the iPhone X or the iPhone 10 whatever you want to call it. This one does have the stainless steel rails on the side, which is a little bit harder than aluminum. So my assumption is that this is going to break after the 8 Plus, but there's only one way to find out. I'll go ahead and set this on my leg, and we will stand up. [Music] Looks like the back glass is totally fine. Front glass is still good. Let's try it again. We'll do sitting down one more time because this is the most common type of drop just forgetting it's on your lap and then standing up. [Music] And the back glass...this is amazing...the back glass is completely shattered. I'm impressed at how shattered that is from such a short drop. Wow. So this brand new iPhone 8 Plus took only two drops from about knee height as it slides off of my leg to completely shatter the back. And now we owe Apple a ton of money to replace this thing. That is mind blowing. This wouldn't be an issue if we could just remove the back without destroying the camera, and replace it with a third party. But what Apple does is they replace the whole housing of the phone, transferring over all the internal components because the back glass does not separate from the back housing. Alright, now that the iPhone 8 Plus is completely shattered, let's go back to the iPhone X. Once again, I think this one will last a little bit longer because of that stainless steel frame, but let's find out. It is on my leg. Standing up. [Music] It looks like the front is still fine. The back glass is still totally fine no damage. So hopefully that stainless steel side is absorbing the impact and not denting in to hit the glass. So the iPhone 8 Plus is completely shattered, but we're going to do another drop test anyway and see how long it takes the front to shatter. Now I'll be pulling it out of my pocket and dropping it from about waist high. [Music] That time around it did fall directly on the screen as I flopped it out of my pocket. From waist high, the front of the phone is completely damaged, whether it's from the glass slightly protruding above the edge of the aluminum right here, or just the aluminum getting pushed into the top edge of the glass and breaking it that way. Either way, the front and the back of this phone are completely damaged now from I think drops 2 and 3 of this drop test. So as far as most durable glass on a smartphone ever, glass is still glass, and gravity is still gravity. But we're not done with the X yet. Let's keep going. We'll pull it out of my pocket and let it hit the ground. [Music] Alright, still nothing wrong with the X. We have complete, solid glass on the back and no cracks on the front. We'll do one more waist high drop with the X since the 8 Plus has bit the dust. [Music] Yet again, waist-high. There is nothing wrong with the front of the phone. Still zero cracks on the whole front side of the device. But on the back side, right next to the camera hump, there's the smallest of nicks. So I'm going to assume that with the next drop or a drop soon after, the whole back is going to shatter from that point because once there's a weak point introduced into the glass, that's where all the damage happens. We'll do one more from about chest high. [Music] So I was wrong about where the glass was going to crack. It did not start from up by the camera hump, it actually emanates from the bottom corner all the way up to the top. But now the back glass is shattered and we owe Apple $549 to replace it. It's not because the components are expensive, this back glass portion probably only costs about $20, it's the construction of the phone that makes it expensive. It's is not removable and that's the bad part. With Samsungs, you pay that $20 and get the replacement part and you're good to go. So now the iPhone X/iPhone 10 has been damaged from chest high. We're going to do one more, like if it drops from your hand while it's up by you ear. I'm about 6 feet tall, about 2 meters give or take, so let's see what happens. [Music] So the front glass of the phone does have damage in that bottom left corner. Nothing too drastic, but it is damaged. And the back is not just shattered everywhere. So overall I would say I'm pretty disappointed in the construction of the Apple phone. I think they look fantastic. I love the glass, I love the metal. The stainless steel is probably one of my favorite phone materials of all time. But the way the back glass is adhered to the phone is incredibly stupid. It is not repairable and it is incredibly expensive to replace for us as the consumers, which means there will be a ton of these phones walking around in the wild with cracked backs from people who don't want to pay $500 to replace them. So now that we know how the phones are constructed and how fragile they are, it's time to make a decision. And to me, a case seems like a no-brainer. In my past videos I did have a case on one of the phones that I was dropping and it lasted significantly longer than the naked phone. And with the high price point cost of repair on these phones, the risk is not worth the reward. Yeah, the phones look good naked, but they don't last long naked. So yeah, I would say a case is mandatory on both of these phones because you're basically buying a new phone with the price it costs to repair it. Definitely a poor decision on Apple's part. Let me know what you think though, down in the comments. I'm curious, would you buy a phone like this? And if you would buy an extremely fragile phone that's expensive to repair, would you walk around with it naked or would you put a case on it? As always, thanks a ton for watching, and I'll see you around.",
    "transcript_keywords": [
        "back glass",
        "glass",
        "back",
        "iPhone",
        "phone",
        "drop",
        "phones",
        "Apple",
        "front",
        "replace",
        "Front glass",
        "fine",
        "drop test",
        "completely",
        "shattered",
        "drops",
        "expensive",
        "high",
        "glass backs",
        "back glass repairs"
    ],
    "transcript_entity_values": [
        "about $20",
        "about 2 meters",
        "two",
        "20",
        "about 6 feet",
        "the Galaxy S8 Plus",
        "only one",
        "Samsungs",
        "a ton",
        "zero",
        "Apple",
        "iPhones",
        "the 8 Plus",
        "first",
        "500",
        "today",
        "1 meter",
        "iPhone 8 Plus",
        "third",
        "only two",
        "3",
        "549",
        "iPhone 8 Plus",
        "about 3 feet",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "NORP",
        "EVENT",
        "ORDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ]
}