{
    "id": "fRw3mfdiMFU",
    "title": "This Face Will Eat Your Money...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-10-24T20:14:41Z",
    "video_url": "https://www.youtube.com/watch?v=fRw3mfdiMFU",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "facebank",
        "face bank",
        "bank",
        "face",
        "best",
        "2016",
        "smartphone",
        "iphone 7",
        "apple",
        "futuristic",
        "cool gadgets",
        "invention",
        "inventions",
        "new inventions",
        "awesome inventions",
        "things",
        "amazing inventions",
        "cool technology",
        "cool inventions",
        "new gadgets",
        "test",
        "innovation",
        "amazing",
        "awesome",
        "cool gadget",
        "apple iphone 7",
        "android (operating system)",
        "technology (industry)",
        "amazon",
        "weird",
        "electronic bank"
    ],
    "views": 4857297,
    "likes": 77225,
    "comments_count": 5770,
    "description": "Facebank (USA Link) -  Facebank (International) -   This is easily the creepiest product I've ever featured on Unbox Therapy.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/2dQaHDH",
        "http://geni.us/DroR9",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "It's not every day... You get to one box and try out a \"Facebank\". Excuse me Lou, please tell me what a \"Facebank\" is! Well, I'm trying to figure that all out as well. You guys know, I look at a lot of weird stuff here. Now this, this is on the far end of the scale. The \"Facebank\", the robotic coin-eating bank. You know you're in for a treat when the box shows up dented like this. Then you know it's something high caliber. Coin eating savings bank, ages 7 and up. (Laughing manically) Jack, does that make you feel uncomfortable? Cause if it doesn't, there's something wrong with you. What's the deal? Alright you turn it on, you feed him coins and you see what happens. Alright, let's, let's crack this open and take a look. It's also available in blue, and pink. That's it, that's all that's inside the... WOAH, that's creepy man. That is creepy! WHEW. Imagine this thing sitting on your Bedside table, there. Oh man, oh he...oh he even feels kinda weird. It is weird how, that looks like a life-form or something. OK, two AA batteries, do we have it? So it just takes two of these, in there like that. Now I notice on the back here, just before I turn him on there's a little... *snaps in place* Oh okay, I guess if you need to empty it out, this little door comes off when you go to actually get your money back from the... f-f-f-face-eating monster. *laughs* Urgh, okay, I'm going to turn him on. You ready for this? Okay he didn't do anything. I think he needs coins to come to life. I've a cup of coins over here. *shakes cup* *places cup on table* I got your favorite food buddy. Alright, here we go. *coin falls in* *face starts making noises* W-W-What? He always ends on a different expression. Excuse me? It's off, you place the coin on its lips. And then... It didn't even finish that one. Okay let's let it keep going. AHHHH Oh. Oh, he does better with the bigger coins. This is easily the creepiest thing I've ever featured here on the channel. If you visit someone's house, they have this thing sitting there You've got to-- you've got to wonder if you could trust them. Holy smokes. Maybe you could trust them more. He is having real trouble with this dime, but he is making progress though. So I'm not going to interfere, I'm going to let him keep working it. He got it! Look at that guy's face. It works as advertised, I don't know who's going to be into it. I mean... That's a tough face to love, but. Man there's something funny about it. It makes the idea of saving your money, your coins, I don't know, a little bit more interesting. If you have the guts to keep that thing in your bedroom, On your night stand, well you're a braver man than I, because I-- this guy... When he's finished eating all your money, God knows what's next.",
    "transcript_keywords": [
        "Facebank",
        "coins",
        "thing",
        "man",
        "Coin",
        "Alright",
        "Excuse me Lou",
        "day",
        "turn",
        "weird",
        "cup",
        "money",
        "face",
        "box",
        "Lou",
        "bank",
        "thing sitting",
        "Excuse",
        "place",
        "creepy"
    ],
    "transcript_entity_values": [
        "two",
        "one",
        "Facebank",
        "Jack",
        "Lou",
        "ages 7"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "DATE"
    ]
}