{
    "id": "fsGEkCw_B70",
    "title": "Razer Phone Review - Who Is This For?",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-11-22T20:24:51Z",
    "video_url": "https://www.youtube.com/watch?v=fsGEkCw_B70",
    "category": "Science & Technology",
    "tags": [
        "dave2d",
        "dave lee",
        "2017",
        "review",
        "phone review",
        "phone",
        "cellphone",
        "cellphone 2017",
        "smartphone",
        "razer",
        "razer phone",
        "dolby",
        "THX",
        "120 hz",
        "quad hd",
        "atmos speakers",
        "qualcomm",
        "snapdragon 835",
        "12mp camera",
        "telephoto",
        "gaming phone",
        "gaming",
        "best gaming phone",
        "big phone",
        "best speakers",
        "best phone speakers",
        "best android",
        "razer phone review",
        "one plus",
        "versus"
    ],
    "views": 317855,
    "likes": 10739,
    "comments_count": 995,
    "description": "Dave2D review of the new Razer Phone. With a 120Hz screen and amazing speakers. A phone built for gaming, but it can do so much more. Purchase Here -   The Razer Phone is the first of its kind and launched with some very impressive specs that will make any mobile gamer happy. Rocking a 120Hz Quad HD screen for a very vibrant, sharp and smooth viewing experience. The best smartphone audio with THX certified Dolby Atmos front-firing speakers. Powered by the latest Qualcomm Snapdragon 835 with 8GB RAM. 12MP dual telephoto cameras and a 4,000 mAh battery to keep you charged up for hours.  Music Credits: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2iJiLbo",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2D here So I've been using the Razer Phone for a couple of weeks at this point and I wanted to share my experiences of using this phone with you guys so a lot of people are interested in this phone because It's such a different looking phone from a lot of other Android offerings especially with that 120 Hertz screen But I feel like there's so much more to this phone that is actually really good for a lot of people not just Gamers or whatever you might think that the Razer brand is catering to so the first thing I want to talk about is build quality this thing is built like a tank. It's aluminum, It's not like special materials or anything But the design of it is just so boxy and so just industrial feeling and industrial looking It's a really solid phone if I had to drop phones thousands of times. It would be this one I feel like this is the one that's gonna last the longest The button placement takes a while to get used to, the power switch is good But the volume rockers are just, I don't know they're a little bit lower than I'm used to so even after using this thing for A couple of weeks, I'm still not used to their lowers position. I wish it was higher up I also don't like that this thing doesn't have a headphone jack now a lot of phones don't have headphone jacks in twenty-seventeen But this one in particular. I feel like it really should have had one. It's a gamer oriented phone I mean it can be for gamers, but even for regular people because this thing is so good for media consumption I feel like a lot of people could have really benefited from a headphone jack and It doesn't have one which is unfortunate. Okay, Let's talk about the screen. It's probably its most flagship feature It's the thing that they're marketing the most heavily It's a really nice looking screen 120 Hertz very fluid very color accurate my biggest complaint about it Though is the brightness. It's not super dim or anything like that don't get me wrong I think it measures at around 300 nits but because of how bright other smart phones can get at this $700 price point it just feels like it's dimmer than it could or should be now the screen is nice for games But I don't know if it makes me a better gamer so most of the games that I play in mobile are just pretty relaxed And chill games something like Altos landing looks really nice on the screen 120 Hertz But there's a lot of games that are like the competitive games that still don't run at 120 Hertz on the screen even if you Lower the resolution So it depends on the games you want to play? But keep in mind that that list of games that supports high frame is growing every day Now using the screen outside of gaming is also really nice Just browsing the web anything that has a UI just looks super smooth Just browsing Reddit, imgur, flicking and swiping around on this screen feels so smooth and after using this one for a couple of weeks Switching back to a regular phone feels so choppy the speakers are in a league of their own. They sound amazing It's not the volume and the bass I mean it does get loud and the bass is present But it's just the clarity if he sounds so clear when you're playing games listening to music just anything that has sound Sounds abnormally clean coming out of these speakers. It's weird hearing this kind of audio from a smartphone It is unfortunately one of those things that you have to experience in real life and same thing with the screen you can't like this video is not going to do is justice the screen and the speakers are something you have to experience in real life now if there's One complaint I had about the speakers It's that when you lower the volume the bass and the mids Disappear way quicker than the higher frequencies it had to install some EQ software Just to make it sound the way I want but really good speakers overall. The camera is disappointing There's no way to spin it It's not a good camera the default software the listen comes with takes particularly bad photos like the low-light photos are really grainy But if you download the Google camera app like the one that comes stock on pixel devices the image quality looks so much better But here's the thing people shouldn't have to do that I feel like a lot of people don't even know how to do that So it's unfortunate that this camera Delivers the photos that it does coming out of the box now a lot of reviews are going to focus on this I think a lot of people are going to tunnel vision on The whole bad camera thing because it's a really easily compared thing or it's a very objective metric that differentiates phones But does it really matter to you I mean if you're someone who spends a lot of time on Instagram and you have to post these like Curated photo collections, then yeah, don't get this camera Don't get this phone, but if you just use your phone for the average memory Just take a picture here their camera image quality is important But it's not the most important thing in the world so if the other things in this phone are kind of Good for you, then. I'd still keep this thing on the short list of options looking at performance Snapdragon 835, eight gigs of ram, and I gotta be honest I don't feel like this is any different from any other Snapdragon 835 phone, which is the majority of flagship phones? It's fast, but it's not Blazing fast the iPhone X is still faster in benchmarks But this thing feels really fluid and because it's running a pretty much stock version of Android 7.1.1. It's gonna stay fast for a long time, okay last thing battery life this thing has a four thousand milliamp hour battery and I I Thought or I kind of hoped it would last a really long time like a two day battery because it's relatively big But that's not the case I'm getting around six hours of screen on time It's basically a day and a half battery now. It does support quick charge four plus. Which is really fast It's as fast. If not faster than dash-charge from one plus I'm getting like sixty-five to seventy percent of battery off of a 30 minute charge It's really impressive now overall Great phone for the right person so if you're someone that again if you're if you're really big on photography Don't get this thing if you just use your phone like I feel like most people do for media consumption and stuff like that this Thing is awesome like do you know how much better browsing reddit is at 120 frames per second than a 60 frames per second screen? There's no comparison It's just better to look at better sounding than most phones out there for media consumption So if that's your jam check this phone out I think you guys will like it, but if you're not interested in that stuff if you're like mister no business and mister... Photographer Not the phone for you. Okay, Hope you guys enjoyed this video thumbs up if you liked it, sub if you loved it! See you guys next time",
    "transcript_keywords": [
        "Razer Phone",
        "Razer brand",
        "thing",
        "Phone",
        "lot",
        "screen",
        "Razer",
        "lot of people",
        "phones",
        "feel",
        "people",
        "games",
        "good",
        "couple of weeks",
        "Hertz",
        "camera",
        "Dave",
        "regular phone feels",
        "wanted to share",
        "brand is catering"
    ],
    "transcript_entity_values": [
        "sixty-five",
        "EQ",
        "two day",
        "60",
        "Dave",
        "Razer",
        "Hertz",
        "Android 7.1.1",
        "Great",
        "Altos",
        "twenty-seventeen",
        "Snapdragon 835",
        "700",
        "jack",
        "second",
        "eight",
        "Reddit",
        "Google",
        "Android",
        "A couple of weeks",
        "thousands",
        "30 minute",
        "120",
        "first",
        "four",
        "the Razer Phone",
        "UI",
        "a couple of weeks",
        "around six hours",
        "300",
        "One",
        "four thousand milliamp hour",
        "Instagram",
        "Photographer"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "NORP",
        "CARDINAL",
        "FAC",
        "MONEY",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON"
    ]
}