{
    "id": "FSUbHvAsxoQ",
    "title": "The 2017 Smartphone Starter Kit",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-10-28T17:46:18Z",
    "video_url": "https://www.youtube.com/watch?v=FSUbHvAsxoQ",
    "category": "Science & Technology",
    "tags": [
        "smartphone",
        "2017",
        "headphones",
        "accessories",
        "best headphones",
        "unboxing",
        "iphone",
        "pixel",
        "android",
        "apple",
        "google",
        "tech",
        "adapter",
        "wireless charging",
        "austin evans"
    ],
    "views": 642523,
    "likes": 15708,
    "comments_count": 1103,
    "description": "If you're buying an iPhone X or Pixel 2, this is your 2017 smartphone starter kit. Sennheiser HD 4.50 BTNC headphones on Amazon:  iPhone Lightning Headphone and Charging Adapter on Amazon:  Anker Fast Qi Wireless Charging Pad on Amazon:  MobilePal Wireless Qi Battery Bank on Amazon:   Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://austin.tech/hd450",
        "http://austin.tech/lightningadapter",
        "http://austin.tech/wirelesscharger",
        "http://austin.tech/qibattery",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is Austin. 2017 has been an interesting year for smartphones. Gone are the days of having a headphone jack on every device. Screens are getting bigger while the bezels are shrinking. Instead of having a removable battery, you're oftentimes getting something like fast charging or wireless charging. But if you are picking up a flagship this year, what do you actually need to get up and running? The first thing you're probably going to want to have is a pair of wireless headphones. And big shout out to Sennheiser for sponsoring this video and sending over their HD 4.50 to me to take a look at. What makes this really interesting is that not only are they going to be a wireless pair of headphones with Bluetooth support, but you're also getting active noise cancellation. Now in a pair of headphones that costs less than $200, this can actually be really helpful especially if you spend a lot of time on stuff like trains, buses, or planes. You should also expect a good battery life, anywhere between 20 to 25 hours depending on if you have active noise cancellation on. And they also do fold up if you wanna make them just a little more portable. And in addition to Bluetooth 4.0, they also have support for aptX which deliver even better sounding audio. And of course, it's the Sennheiser, you should expect quality. Man, it is always such a trippy feeling when you put on the active noise cancellation. Like, it just feels like the whole room just got super dead. What is that I hear actually? Oh it's a plane! I couldn't hear it 'cause I had my awesome active noise cancellation headphones on. It's crazy. I actually didn't realize that I had been listening to these on an iPhone before, and they sounded good. But actually being able to take advantage of aptX on something like the Pixel, there's actually a noticeable difference in audio quality. It really does sound like I'm listening to a wired pair of headphones. Okay so before Ken has to watch me dance any more, these sound good. These sound solid but one of the nice things is, in addition to being wireless, you actually do have the option of plugging in a standard 3 1/2 millimeter headphone jack or a headphone cable. Cable. To be fair both the iPhone and Pixel do come with a headphone adapter in the box, but the issue is is that if you want to plug the headphones in and also do something like charge your phone, you can't do that at the same time until now. Companies have started making adapters that not only allow you to listen to your music, but also to charge your phone at the same time. So let's start with the USB-C adapter which, \"special bear high temperature design? \"The superficial dent design, \"maintain the best conjunction.\" I mean you do need the best conjunction after all. Oh wow that's actually really terrible looking. Wow, first step, will this catch our phone on fire? Oh, that's not a good fit. It's time for me to plug it into the phone. It is not charging. Okay, so, in theory you can pick up a USB-C adapter that actually works, but in this case confirmed garbage town. Let's try the iPhone now. I do at least like the design of this one a little bit more. So you can plug it into the phone on the top, and then on one side you have a lightning, on the other you have a headphone jack. Plug it into the phone. Okay nothing's on fire yet, just saying. So it actually does show up as a USB 2.0 Device. So this actually might just work. It sounds about like a normal headphone adapter so you're not expecting any kinda like hi-fi DAC or anything, but the real test is can we actually plug this in and it not catch on fire? Alright here goes nothing. Oh hey charging and the light just turned on. Hey guys this is Austin and welcome to using a smartphone in 2017. Basically everything that supports wireless charging these days is using the Qi standard. Now thankfully this has actually been around for a few years. There are plenty of accessories to choose from. So the first is really straightforward. It's the PowerPort Qi 10 from Anker. Now it might not look too impressive. What you're getting here is something that not only supports standard wireless charging, but it also supports fast charging. It's also super thin. None of the iPhone 8 and 10 support wireless charging. Something like this could work not only for these devices but also for other phones that support up to 10 watts. But the idea is we just drop it on, and in theory it will start charging. In theory charging will happen. Oh! It helps when you plug the charger in, pro tip! So I'll drop the phone on and it immediately starts charging. So with this you can prepare for the 2018 future of having zero ports of any kind on your phone. There are also some cool options like the MobilePal wireless charging bank. The idea here is that not only is this a portable battery that will charge your phone via Qi wireless charging, but you can also use Qi to charge the battery bank. Meaning that in theory you could never plug this thing in. Oh interesting, so not only can you, if you want, use USB to charge it, but you also can use a lightning cable. That's actually really unique. I don't think I've ever seen that before. So the first step is to see if we drop our phone on, there we go, immediately starts wireless charging. That's actually kinda cool. One of the problems with carrying around the battery bank is that you have to keep all the cables, it becomes a mess, but this, this is pretty easy. But if you have a wireless charging pad, not only can we drop the charger on to start charging in it, then you'll pass current up to the phone. So essentially we have a Qi sandwich. This is cool though. This is really cool. I mean maybe not the most practical thing but I can actually imagine a scenario in which, so you have this by your bed, you leave the battery on it at all times. You just drop your phone on top. And when it comes time, you take your phone, but if you also wanna take the battery, take it too. Super simple. As always links to everything I talked about including those Dope Sennheiser headphones will be linked in the description. I'm curious, what would you guys put in your smartphone starter kit? Let me know in the comments below and I will catch you on the next one.",
    "transcript_keywords": [
        "charging",
        "wireless charging",
        "phone",
        "wireless",
        "headphones",
        "headphone",
        "plug",
        "battery",
        "active noise cancellation",
        "noise cancellation",
        "active noise",
        "time",
        "headphone jack",
        "charge",
        "Sennheiser",
        "drop",
        "Dope Sennheiser headphones",
        "pair",
        "cancellation",
        "support"
    ],
    "transcript_entity_values": [
        "2017",
        "10 watts",
        "this year",
        "between 20 to 25 hours",
        "iPhone",
        "2018",
        "USB-C",
        "first",
        "10",
        "Qi",
        "jack",
        "Ken",
        "Anker",
        "USB",
        "less than $200",
        "Sennheiser",
        "4.50",
        "a few years",
        "MobilePal",
        "Austin",
        "these days",
        "one",
        "Bluetooth 4.0",
        "Dope Sennheiser",
        "3 1/2 millimeter",
        "zero",
        "One"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ]
}