{
    "id": "FtgC3UYVxKM",
    "title": "MOST AMAZING HEADPHONES EVER!! NEW Dolby Dimension!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-11-14T16:18:39Z",
    "video_url": "https://www.youtube.com/watch?v=FtgC3UYVxKM",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "headphones",
        "review",
        "dolby dimension"
    ],
    "views": 459522,
    "likes": 15653,
    "comments_count": 1725,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "Justine - Hey guys it's Justine and today we're checking out these brand new headphones by Dolby. These are the Dolby Dimension headphones. These feature a few new things that I'm really excited to test out, most of which, there's this thing called LifeMix. You can put the headphones on and you can decide how much of the outside noise you wanna hear and how much of your content you wanna hear. That's gonna be really fun, because my sister and I do edit a lot side by side. She'll be editing a video, I don't wanna actually hear her video, but she wants to be able to hear me talking to her and vice versa. I'm also excited about the Cinematic Sound when you move your head, you'll be able to hear the change in whatever it is that you're watching so it's really like you are so immersed that you're actually there. A huge thank you to Dolby for partnering with me on this video. When they reached out about these headphones I was so excited, because I'm such a huge fan of Dolby. When you hear the name Dolby, you automatically know that it's going to be something that is incredible because they've been around for so long and it's one of those names that you just trust. So I just knew that this is something that I had to try out. (light electronic music) Look at these. They're on like a little pillow. These headphones look so comfortable, makes me wanna take a nap. So, nice weight, a really, really nice feel. They fit me perfectly, I didn't have to adjust anything. Am I yelling? I might be yelling. Anytime I put headphones on I automatically start yelling because I can't really hear myself. It's got a little L and the R inside there. This is so comfortable, it has like a nice padding up at the top and this is like a perfect fit over top of your ears. Sometimes I feel like these types of headphones can be a little bit overpowering, but they sit just perfectly, they're extremely comfortable. I wish that I could put these on your little head. Here, let's try them. (electronic music) Well how does that feel? I wish that you could experience it. It's the hardest part when I'm making videos it's how do I accurately describe what I'm feeling, and I try really hard. I'm sometimes not good ad describing my feelings but I'm feeling pretty excited about these. Let's see what else is inside here. I think that Dolby should also consider making bed sheets because this is something that I would like to take a nap in. You guys get in there. Well that is so soft. So what I think it's really cool about these is you can pair three separate devices to it at the same time, and you can switch between them. So a lot of times I'll be on my phone, I'll be on my iMac and I'll be on my laptop especially when I'm traveling I want to switch between my music or my editing, and really, it's just great to be able to have this one press of a button to switch between all of the things that are connected. This also acts as touch control, so if you tap twice, you can toggle between LifeMix and active noise cancellation and there's an accompanying app that goes with this so you're able to control just how that mix sounds. And you can control your headphones. So there's Virtualization and Head Tracking. This is where you can pair each one of your devices, that corresponds to each of the buttons that you have on the headset, so if I wanna connect my phone, it's the first one and when I connect my laptop and iMac, those will be the next two. So I guess now that I have this set up, I need to play something. Let's listen to the new Imagine Dragons album. (electronic music) - I wish so you could experience this. Okay, I wanna check out the LifeMix. So to do that I gotta tap twice to toggle. (volume of music decreases) Hello? Oh my God! This is so weird. What, is ha-- Woo! Oh my God. This is so silly. I do tend to overreact a lot but this is unlike anything that I feel like I've really experienced in headphones before. So when I double tap, right now I can't hear myself even talking. All I hear is the music. I double tap, that activates the LifeMix, so it's like microphones are now picking up what is around me. Like, I can hear myself inside of my head playing while my music is playing. That's the only way that I can explain it. This is so wild. So if you've ever had headphones on while you're recording something and the only way that I can kind of explain it is you put the headphones on you can also monitor yourself talking it's picking up my voice. Oh my gosh I can't wait to try this. I can't wait to get Jenna's reaction she has no idea. Like, I read about what this feature was. This is not. There's also a little charging dock. So I'm gonna try and give you guys an audio example of what I'm hearing. Picture right now that you have the headphones on. And this is what it sounds like if I was talking to you right now. (volume of music increases) So you can't really hear me, it's muffled, it's, you know, like Justine I can sort of hear you but I'm listening to music and I can't hear you. Now when I turn these on with that LifeMix this is what it sounds like. So it's kind of like, everything is at a perfect mix my voice is recorded into the song so everything is just, it's called LifeMix for a reason. What?! I need to go watch some content I need to connect the rest of my devices there's so many things that I wanna do now. I need a moment. Jenna! Dude, these are so freackin' cool. You're gonna see, you're gonna see soon. You're gonna see so, so soon. Hi Matty! I'm trying to film my video but we've got our little doggy. So you guys can see there's three different little sections right here. Excuse me. (laughs) I am so, so sorry. Okay, so the three buttons those correspond-- (laughs) whatever it is it's connected so as you can see right there the first one is lit up and that is the iPhone. So now I'm gonna connect my MacBook if I'm allowed. (whispers) So now let's connect the MacBook. (laughs) He's trying to nudge my computer off. Okay so Dolby Dimensions, we're gonna connect. There we go, the MacBook is now connected. Now that the MacBook is connected I have the Virtualization and the Head Tracking on so what this means is I'm going to be so fully immersed in my film. I've downloaded Ready Player One so let's hit play. No freaking way. So when I tilt my head, it's surrounding me. Okay, now watch this. - [Jenna] You're yelling. - What did you say? - [Jenna] You're yelling. - (screams of excitement) Okay. This has built-in microphones, so it's picking up the sound around me and completely mixing in what I-- Talk to me. - [Jenna] What do you want for dinner? - No way. Oh. I love dinner, okay wait. So I can turn it down with the touch controls, I can turn it up. So the cool thing about that is when I'm doing this it's turning down my movie and I can still-- Say something. - [Jenna] Dinner. - I can hear you, you're saying dinner. And when I double tap and turn it back up. I'm back in my movie. - [Jenna] No dinner. - This is so cool! You have to try this. You have to. Like, I can't even explain it. Jen, you gotta try it. Okay, you gotta get over here. It's so hard to explain to them what I'm experiencing so I'm gonna try to make you experience it. - Okay - So we're gonna put these on. - I could do it. - Oh. - Oh. - Put them on your ears. - I know, like I just watched you do it. - Okay, turn it up a little. - Oh. - Okay now double tap on it. Hello? Can you hear me? Can you hear me? - It's like you're in my head. - I know. - But I'm on my own head. - I know. - But now Imagine Dragons is also in my head. But it's like a perfect mix, so you can still hear me. Now turn down the music, because when you turn the music down, you still hear whatever is around you in your head. - So I turned the music down so now you're just in my head. - Yes. - I'm like, not reacting 'cause I'm trying to process what's happening. - It's the craziest thing, that's why I freaked out upstairs. Now this is something else I wanna show you. - (sings) It's so weird! - I know. - 'cause I sound loud. You-- You're-- Everyone is-- Wow. - They're in your head. - I like the volume control. That's very, very convenient. - I know. - Can I help you? - Are you enjoying them? - Yeah, you're ruining my speakers. (both laugh) - These are so cool. - Sounds really good to. - I know. - Ah, these are mine now. - Bring back my phones! (electronic music) So these are definitely the perfect headphones for me for editing, and if you also are like me and will binge watch an entire season of a show and don't even think twice about it, these are also perfect for it because you can still be immersed into your show but also now completely lose track of the outside world. Unless you want to, you just double tap. This reminds me of something from Black Mirror. Like this is, this is, I'm living in a Black Mirror episode right now. Like this is the future, this is-- Oh wow, I can hear everything. Can't hear anything. A huge thank you to Dolby, you guys, this is incredible and I'm so excited for people to be able to experience this. - [Jenna] I wish we would have these before because every time like you would watch a show and I didn't watch it yet, there would be like spoilers so I can't hangout with you. - I know. - I know. - [Jenna] 'Cause I will hear the spoilers. - Okay guys, if you want more information about these headphones, I will put a link in the description. And be sure to subscribe to our channel for more videos, and be sure to like this video if you enjoyed it. And that's it. I'll see you guys in the next video. (upbeat music)",
    "transcript_keywords": [
        "hear",
        "Justine Hey guys",
        "headphones",
        "Dolby",
        "head",
        "Justine Hey",
        "Dolby Dimension headphones",
        "Hey guys",
        "put",
        "tap",
        "Hey",
        "music",
        "guys",
        "turn",
        "video",
        "double tap",
        "LifeMix",
        "connect",
        "excited",
        "Dolby Dimension"
    ],
    "transcript_entity_values": [
        "MacBook",
        "Matty",
        "MacBook",
        "correspond--",
        "Justine",
        "Imagine Dragons",
        "Dolby",
        "iPhone",
        "an entire season",
        "three",
        "Virtualization and Head Tracking",
        "Jenna] Dinner",
        "the next two",
        "Justine - Hey",
        "Jen",
        "today",
        "iMac",
        "LifeMix",
        "first",
        "Jenna",
        "Dolby",
        "Black Mirror"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "FAC",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG"
    ]
}