{
    "id": "FtOgJm8ez68",
    "title": "My channel changes today",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2022-05-27T14:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=FtOgJm8ez68",
    "category": "Science & Technology",
    "tags": [
        "burpsuite",
        "ccie",
        "ccna",
        "ccnp",
        "ceh",
        "cisco",
        "cisco routers",
        "cyber",
        "cyber attack",
        "cyber security",
        "cyber warfare",
        "cybersec",
        "cyberwar",
        "ethical hacking",
        "golang",
        "hack",
        "hacked",
        "hacker",
        "hacking",
        "hacking cou",
        "hacking scada",
        "how to hack",
        "information security",
        "information security training",
        "infosec",
        "kali",
        "kali linux",
        "kali linux 2021",
        "kali linux 2022",
        "kali linux scapy",
        "linux",
        "networking",
        "nsa",
        "oscp",
        "pen testing",
        "pentest",
        "privacy",
        "python",
        "python hacking",
        "python scapy",
        "scada",
        "scapy",
        "scapy kali linux",
        "scapy python"
    ],
    "views": 47592,
    "likes": 4469,
    "comments_count": 715,
    "description": "The only constant is change. Today my channel changes.  // YouTube channels // YouTube Tech Channel:  YouTube Clips Channel:  YouTube Shorts Channel:  YouTube Kids Channel:   // Podcasts // Apple Podcast:  Spotify Podcast:   // MENU // 00:00  The Only Constant Is Change 00:57  The Hacking Videos 01:17  What I'm Going To Do 01:51  More Advanced Content 02:16  Short Form Content 02:39  Only the Beginning 03:06  But Why? 03:32  Comment! What Content Do You Want to See? 4:08  Thank You for Joining My Journey 4:20  Outro   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube Main Channel:   YouTube Tech Channel:  YouTube Clips Channel:  YouTube Shorts Channel:  Apple Podcast:  Spotify Podcast:   // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  cyber infosec python golang networking hacking pentest pen testing hack kali linux python cisco kali linux  scapy scapy python python scapy scapy in python scapy python3 kali linux scapy scapy kali linux python hacking ethical hacking kali kali linux python python scapy ccna ccnp ccie cisco routers cisco switches ccna 200-301 python scripts linux kali kali linux 2022 kali linux 2021 oscp ceh security+ postman burpsuite hacking hacking cars hacking connected cars hacking api cyber security information security sans institute cybersecurity training cyber security training information security training cyber hack privacy nsa oscp ceh   #hacking #infosec #kalilinux",
    "description_links": [
        "https://youtube.com/channel/UCZTIRrENWr_rjVoA7BcUE_A",
        "https://www.youtube.com/channel/UCbY5wGxQgIiAeMdNkW5wM6Q",
        "https://www.youtube.com/channel/UCEyCubIF0e8MYi1jkgVepKg",
        "https://www.youtube.com/channel/UC4VHwy0YE-ooSBKQw0s09RA",
        "https://davidbombal.wiki/applepodcast",
        "https://open.spotify.com/show/3f6k6gERfuriI96efWWLQQ",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://youtube.com/channel/UCZTIRrENWr_rjVoA7BcUE_A",
        "https://www.youtube.com/channel/UCbY5wGxQgIiAeMdNkW5wM6Q",
        "https://www.youtube.com/channel/UCEyCubIF0e8MYi1jkgVepKg",
        "https://davidbombal.wiki/applepodcast",
        "https://open.spotify.com/show/3f6k6gERfuriI96efWWLQQ",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "- The only constant in life is change. (upbeat music) In other words, things change all the time. The same applies to my YouTube channel. I have changed the content that I create on my YouTube channel over the years. I've changed the style, I've changed the way that I've created content. And I'm here to tell you that things are gonna change again. I've received a bunch of criticism over the years. I mean, there's always gonna be invalid criticism or haters but I've also received valid criticism from lots of you who have told me that you don't like the way that the channel is moving or the direction that I'm going. As an example, in the old days, I used to do a lot of networking type content, Cisco content. I didn't even have myself on the screen, I was simply recording voiceovers, as an example. A lot of people liked that content where I was creating Cisco related content or networking related content. And I've had pushback or criticism that I'm not doing that anymore, I'm just creating hacking content. But whenever I run a poll, most of you are telling me that you want hacking content and looking at the views on YouTube, the hacking content tends to get a lot more views than me talking about advanced BGP or advanced NPLs. But this is something that I've been thinking about for a long time. And I'm always trying to improve my content and always trying to bring you better value or better videos. So this is what I'm gonna do. I'm creating a second channel, David Bombal Tech. On that channel, I'll be talking about more in-depth topics or topics that perhaps won't do as well on the main channel. In other words, I won't get many views, but it's topics that some of you are interested in, more niche topics, more in depth topics. That's something else that I've received a lot of criticism about. David, you're only creating beginner content, you're not creating advanced content. There's a reason for that. Most people watch beginner content, they don't watch advanced content. But I don't want to ignore those valid criticisms or that feedback where some of you are late in your careers and you want more advanced content. So, I'm gonna be adding more advanced content or content that's perhaps more niche on my second channel. Please use the link below to subscribe to my second channel, David Bombal Tech. But that's not the only thing that I'm going to be doing. I've also received criticism that the interviews are very, very long. David, it's a podcast. The interviews are way too long. An hour is too long for a video. We want shorter videos. So, what I'm gonna be doing is launching a David Bombal Clips channel, we'll take snippets from the various interviews that I'm having and put those on the Clips channel for those of you who don't have much time. And some of you have even less time, you want like TikTok style videos. So what I've got is the David Bombal Shorts channel. This is TikTok style content. So, I'll be putting TikTok style content on the Shorts channel as well as on TikTok. Now, this is only the beginning. I wanna expand into more channels and do more, create more content. And some of you have asked for this. I'm thinking about creating a David Bombal Kids channel where I get my two daughters to react to tech, perhaps tech they've never seen before in their lives. Perhaps I'll also teach them. So if you want me, for example, to teach my children Linux and you'd like to follow along with your kids or you just want like, really basic content that might be a great place to put it. I want to cover beginner content, I want to cover intermediate content and more advanced content. That kind of content doesn't always work on a single channel. And hence, I want to create multiple channels to give you more options. So, please use the links below to subscribe to my various YouTube channels and also to my social media platforms. It's really important for me that I create the best possible content that I can to help you in your life and help you in your career. So please comment below, let me know the types of topics and sort of technologies that you'd like me to cover. Some of the things that I'm gonna be covering more of is hacking. A lot of you have asked for that. Obviously, I wanna talk about Linux, I wanna talk about Python, I wanna talk about Go. I don't just want cover networking, I don't just want to cover hacking, I wanna cover a broad range of technologies. It'd be great to get your feedback. I'm hoping very soon to launch Linux content. So, for instance, Linux for hackers, something I've been talking about doing for a long time, thinking about doing for a long time. I also want to cover other technologies that may be of interest to you. As always, I really appreciate it that you watch my content. I really appreciate it that you subscribe. Thanks for going on this journey with me. Many of you watch my content and not subscribe. So please consider subscribing to my YouTube channel. Please consider subscribing, clicking on the bell to get notifications, so, that you know when upload new content. I'm David Bombal and I want to wish you all the very best. (upbeat music)",
    "transcript_keywords": [
        "content",
        "David Bombal",
        "channel",
        "David Bombal Tech",
        "David",
        "Bombal",
        "advanced content",
        "David Bombal Clips",
        "David Bombal Shorts",
        "advanced",
        "cover",
        "Bombal Tech",
        "criticism",
        "David Bombal Kids",
        "creating",
        "time",
        "long",
        "topics",
        "Linux",
        "Bombal Clips channel"
    ],
    "transcript_entity_values": [
        "YouTube",
        "Linux",
        "David Bombal Clips",
        "the years",
        "Cisco",
        "a David Bombal Kids",
        "two",
        "Clips",
        "second",
        "YouTube",
        "the David Bombal Shorts",
        "David",
        "An hour",
        "Linux",
        "the old days",
        "David Bombal Tech",
        "Shorts",
        "TikTok",
        "BGP",
        "David Bombal"
    ],
    "transcript_entity_types": [
        "GPE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON"
    ]
}