{
    "id": "ftyWe6DVvO4",
    "title": "The alternative App Store for iPhones",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-10-04T14:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=ftyWe6DVvO4",
    "category": "Science & Technology",
    "tags": [
        "app store",
        "apple app store",
        "apps",
        "apple",
        "ios",
        "altstore",
        "alt app store",
        "app store download",
        "jailbreaking",
        "jailbreak",
        "delta",
        "how to jailbreak",
        "iPhone jailbreak",
        "alt store ios",
        "altstore delta",
        "app",
        "iOS 13",
        "alt store install",
        "iphone",
        "iphones",
        "Riley Testut",
        "nintendo delta",
        "install",
        "nintendo",
        "how to",
        "how",
        "how to download",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "google",
        "review",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 567013,
    "likes": 11519,
    "comments_count": 677,
    "description": "When it comes to the App Store, Apple's philosophy around apps on the iPhone has been consistent. You need to follow its rules, or you're not allowed on iOS. But app developer Riley Testut has a new strategy for distributing mobile apps outside the App Store, and it's called AltStore. It's an alternative app store for the iPhone that lets you install any app, without needing to jailbreak your phone or install an enterprise certificate. He built it initially as a way to distribute his Nintendo emulator Delta, but now he thinks it could support all kinds of software Apple doesn't allow on the App Store. And the best part: anyone can download it.  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2Olkcxg",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Since the rise of the modern smartphone 10 years ago, one thing has remained constant: Apple's approach to iPhone apps. The App Store launched in 2008 and, with it, Apple laid out how it was going to let third-party apps onto its platform. And not much has really changed. You still have to develop your app according to Apple's rules, submit it to the company for review, and then pray Apple lets it onto the App Store. Anything that crosses the line, especially around copyright or privacy, isn't allowed. And those rules are extensive. The guidelines document is more that 12,500 words long. But, if you've been following the world of mobile apps since the early days of the iPhone, you're probably well aware that there are holes in Apple's walled garden. On Android, Google typically lets you do a lot of stuff you can't do on the iPhone. But that doesn't mean people have stopped trying to find ways around Apple's restrictions. In fact, they've only gotten smarter about it. (bass heavy electronic music) This is AltStore. It's one of the latest attempts by independent developers to bypass the App Store, and it's made by a recent college graduate, Riley Testut. - AltStore basically lets you install apps outside the App Store by tricking the phone into thinking you developed the app yourself. Like, you programmed it and you installed it and you're testing it out on your device. So a few years ago, Apple had the ability for Xcode, Apple's developer tool, to allow anyone with an Apple ID to install their own apps on their phones so that Apple could encourage people to learn to program iPhone apps and test them out for schools and curriculums, stuff like that. But so basically, I'm using that same process, but just without Xcode. - Riley was inspired to make AltStore through a trick he discovered in the jailbreaking community. You probably remember jailbreaking. It used to be pretty much the only way to get unauthorized apps onto your iPhone or features Apple hadn't developed yet. Well, after jailbreaking started to fade out, some really savvy programmers started coming up with ways to get apps onto the iPhone without needing to jailbreak your phone. One of those methods was with a software called Cydia Impactor. Like AltStore, the Impactor exploits a loophole in how iTunes communicates and syncs files with the iPhone. But Cydia Impactor only lets you take app files and put them on your phone from your computer. AltStore is a fully functioning platform that can, in theory, support a whole ecosystem of apps that live outside of the App Store. It also lets you download apps and updates over Wi-Fi without needing to plug your phone into your computer all the time. Riley's even made one of those apps himself. It's a super polished version of his old Nintendo emulator that he's spent years fine-tuning. It used to be called GBA4iOS, but now he's calling this more powerful version Delta. It can let an iPhone play Super Nintendo, Game Boy Advance, and even N64 games. It's got a sleek, built-in controller scheme and some really nice save state features. But Riley knew he could never get Delta onto the App Store. Apple wouldn't allow it because there are strict rules around apps that might be used for copyright infringement. So, he started thinking up more clever ways to get around the restrictions on iOS, and that's what pushed him to come up with AltStore instead of just releasing his app on Android and calling it a day. - AltStore and everything just came from me wanting to get Delta out. It just made sense for me, if I'm building this whole process for Delta, just to build it out for anyone to use. So I'm kind of doing it 'cause I want to also improve the quality of apps that you won't find on the App Store but could still exist on the platform. - Okay, quick side note: we're not encouraging you go download video game files, which are known on the internet as ROMs. Sites hosting those ROMs have been shut down by game companies and it's generally not a good idea to share them. Now, Apple has a history of working hard to shut these things down. It's spent years patching iOS to block jailbreaking software. But before things like AltStore existed, there was one really popular way to get around IOS restrictions. It's been around for years and it involves using Apple's own tools against it. That method is the Enterprise program. It started up a few years after the iPhone really took off, when all sorts of companies were developing mobile apps. Apple lets you pay $300 a year for a special license that it controls that then lets you distribute apps to anyone over the internet, no App Store review required. It was intended for really big companies. So, like, say you work for Amazon or Microsoft. Those employees can then test apps early to weed out bugs. It turns out that Apple wasn't really paying too close attention to who was buying access to those Enterprise certificates. Some companies would sell them to you on the cheap and Riley even distributed his old Nintendo emulator, GBA4iOS, using an Enterprise certificate he bought on the internet. That is, before Apple got wind of that and shut him down pretty quickly. You may also remember that Facebook and Google were even abusing this program up until a few months ago when they got in trouble with Apple for installing these VPN apps onto teenager's iPhones to snoop on their data in exchange for $20 a month. There are tons of, let's say, creative uses of the Enterprise program. Just look at something like TutuApp. It's a popular alternative app store out of China that sells access to all sorts of pirated software. TutuApp occasionally goes down, probably because Apple is revoking its certificates, but it always seems to come right back. Riley theorizes that the makers of TutuApp are buying new certificates from other companies. He also raises a really good point, which is that Apple has let this go on for years without really doing much about it. - But so I've always been expecting that route to kind of go away, so that's why I've positioned this whole installation method completely separate from that. - After the Facebook and Google controversy, Apple has, in fact, gotten stricter about these Enterprise certificates. It announced some new restrictions to the program back in WWDC, and Riley tells me that the company is paying closer attention to who signs up for the program and what they do with it. So the Enterprise program is probably not the best way to try and bypass the App Store anymore and that's how we've arrived at something like AltStore. Riley thinks AltStore can survive for at least a little bit. Apple may come up with a way to disable his ability to distribute apps but it would end up affecting a lot of legitimate users on the platform. - They could completely shut down the whole service, but that would affect everyone doing this, including schools, anyone just using their free Apple ID on the side of their work or anything. So that would be a pretty heavy-handed solution there. Besides that, they could prevent syncing of our Wi-Fi; but even then, the worst case is you could still plug in the phone. Essentially, as long as iTunes can sync apps, AltStore can work. - So if it does survive, Riley hopes AltStore can become a destination for other app makers. And there's a lot of room for really interesting apps that don't abide by the iOS guidelines. - Or I know someone made a file managing app. So, it looked gorgeous and did everything, but Apple would never allow it because you can't replicate a desktop experience. - As for the future of the App Store, it's pretty unlikely Apple is ever going to budge when it comes to apps on the iPhone. But there is a small sliver of hope for the iPad. Back at WWDC, Apple announced iPadOS. It's a whole new operating system dedicated to its tablet. And while the iPad's capabilities as a computer have been pretty held back until now, we're starting to see Apple open it up way more. There's now Catalyst, so you can develop apps for both Mac and iPad at the same time, iPads will be getting the ability to read USB drives, and Apple is completely redesigning how the iPad home screen, window layout, and gesture support works so it's more like a real laptop. - What's a computer? - Remember that \"What's a computer?\" ad campaign? Well, Apple is actually now following through. At some point, Apple just might give the iPad something that could truly make it into a computer: the ability to run apps from the internet. - So, I think it's inevitable that at some point the iPad will gain some way of installing apps outside of the App Store. I don't know if that will ever happen for the iPhone because, essentially, the iPad is your computer and the phone is the convenience. - Unfortunately, I think I have to agree with Riley here. I don't see that ever happening for the iPhone. Thankfully, we have options like AltStore. That is, if Apple doesn't shut it down immediately. I only get to it pick my starter, which I feel like is going to anger the internet. Bulbasaur? No way. Charmander? Absolutely not. I'm definitely gonna get Squirtle. Hell yeah.",
    "transcript_keywords": [
        "App Store",
        "Apple",
        "apps",
        "App",
        "Store",
        "Riley",
        "AltStore",
        "iPhone",
        "App Store launched",
        "iPhone apps",
        "Enterprise",
        "App Store review",
        "Apple approach",
        "alternative app store",
        "App Store anymore",
        "Enterprise program",
        "years",
        "iPad",
        "program",
        "computer"
    ],
    "transcript_entity_values": [
        "Android",
        "Xcode",
        "one",
        "third",
        "AltStore",
        "Apple",
        "Cydia Impactor",
        "WWDC",
        "USB",
        "20",
        "TutuApp",
        "Google",
        "the App Store",
        "the early days",
        "Xcode",
        "the App Store",
        "GBA4iOS",
        "a few months ago",
        "a few years",
        "Super Nintendo",
        "iPads",
        "a few years ago",
        "years",
        "N64",
        "300",
        "iPhones",
        "iPad",
        "TutuApp",
        "2008",
        "Wi-Fi",
        "Riley",
        "Amazon",
        "Nintendo",
        "One",
        "Enterprise",
        "Facebook",
        "iTunes",
        "China",
        "12,500",
        "Delta",
        "VPN",
        "Microsoft",
        "iTunes",
        "iPhone",
        "Mac",
        "Wi-Fi",
        "Riley",
        "Catalyst",
        "Riley Testut",
        "Impactor",
        "10 years ago",
        "IOS"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "FAC",
        "DATE",
        "WORK_OF_ART",
        "LOC",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "LOC",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG"
    ]
}