{
    "id": "FVZCeQlNCoU",
    "title": "Should you make the switch? - Microsoft Surface Laptop 3",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-02-21T20:27:42Z",
    "video_url": "https://www.youtube.com/watch?v=FVZCeQlNCoU",
    "category": "People & Blogs",
    "tags": [
        "microsoft",
        "laptop",
        "surface 3",
        "surface 2",
        "unboxing",
        "impression",
        "battery",
        "performance",
        "notebook",
        "thin and light",
        "intel",
        "amd",
        "display",
        "micrphone"
    ],
    "views": 693073,
    "likes": 23395,
    "comments_count": 1273,
    "description": "The Microsoft Surface 3 Laptop came out months ago, but we didn't exactly jump at the chance to switch over. Should we make the switch? Find out!   Buy Surface Laptop 3 13.5\" On Amazon (Paid Link):  On NewEgg (Paid Link):  On Staples (Paid Link):   Buy Surface Laptop 3 15\" On Amazon (Paid Link):  On NewEgg (Paid Link):  On Best Buy (Paid Link):  On Staples (Paid Link):   Buy Surface Laptop 2 On Amazon (Paid Link):  On NewEgg (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/0aoy",
        "https://geni.us/sdePp",
        "https://shop-links.co/1725431998326564470",
        "https://geni.us/CQrIhu",
        "https://geni.us/887VR0",
        "https://shop-links.co/1725432000301348144",
        "https://shop-links.co/1725431999681095680",
        "https://geni.us/PupjW00",
        "https://geni.us/MTNYOL",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This right here is the Surface Laptop too. And I'd consider probably the best laptop on the market, which might make you think, why has this Surface Laptop 3, which should be better in every way not made it into my hands yet. Well, it has and we just didn't really bother to cover it. So let's take a look at why 'cause I actually do think this might be the best laptop out. Just it would have been a lot better if it came out two years ago, we just get to unbox it here, that's fun. There we go, it's a laptop, wow. Who would've thought? And just, I really liked the finish on this one. It's a bit, I don't know what you'd call it, a bit Applely for my taste almost, but overall I'd say I really like it. You do have other options of course. I really liked this one. Moving on, you get your typical power cord I actually really like this. it's basically just mag safe except not. So you get the classic, you put it in here, you go and you trip over it, laptop's not dead, perfect. Then what else do we have, a little box that says Surface Laptop, getting started, plugging the power cable press power button windows will guide you, sure. So here we have it, the Surface Laptop 3, really the most interesting thing that I can see from just right here is that it has USB-C. Who ever would have thought to include that on a laptop in 2019? Not Microsoft the first try around. I've had trouble working with like my TV and stuff, getting high quality dongles for it, It's just not that simple. Opening it up though and we'll see their main reason why I don't like this one too, oh, wow, it's already open. So Windows Hello is awesome. If you couldn't tell I've already installed stuff on this 'cause we don't wanna spend the next hour just updating windows that would be a pretty boring video, but Windows Hello is so quick on this thing. That's maybe my favorite feature of these because it's just so simple. You're just immediately in and you're able to get to your work, but the big problem that we have here, where did the Alcantara go? It is an option but I just don't know why it's something that you want to give up. This just feels so smooth and it feels so great on the hands when you're typing, this feels well, it feels great, but it feels like every single other laptop on the market. So I'm not totally sure why Microsoft would want to give you the option to have a not very surface Laptop feel, looking at the track pad. It's kind of the first thing that you can see. It's just bigger. They have a little bit of space here and they have just used it up. And as far as I can tell the rest is all preserved. This thing is great. The overall feel of the chassis is actually excellent. I think it's slightly stiffer than the old model. Although oddly enough, it doesn't feel quite as premium just going back to the whole Alcantara thing, I really like this stuff, and yeah we have the same 2256 by 1504 resolution display. It's four by three, which is freaking sweet. You can see so much on the screen that's right here. One thing that a lot of people say all the time, when I talk about how much I love high aspect ratio screens is, but then all that you get her more black bars on the top and the bottom, which is stupid because I would respond to that with, you get the same amount of screen for like your 16 by nine or two by one content here. And then you just get more on the top and the bottom. It still needs to be a certain height for it to be comfortable to use with their hands because otherwise your palms just kind of fall off the edge, moving on, what does it have for a processor in it? Let's see here, an i7-1065G7 which I don't know, that's pretty good. It seems pretty fast to me, that has the Intel Iris plus graphics. So we might actually be able to game a bit on this, that was definitely out of the question on the Surface Laptop 2. But speaking of gaming, there's another one right here. It's the 15 inch version, I guess we're here now or unboxing this one too. Same basic thing, I'm not really gonna get into this one too much because it's exactly the same unboxing experience as the last one, but it's a lot bigger. They have the Surface Book for when you want to have something that's larger and this just feels not quite as good when I press it. The chassis just leaves a tiny bit to be desired. I don't know, I don't really get the trade-off here because for me I don't need a screen that's slightly larger, maybe if you're, I don't know old, see how heavy they are. It's okay, it's actually not all that much heavier. Maybe the most interesting thing about this one though, is that it's not rocking an Intel processor. This one has the AMD Ryzen 5 3580U Microsoft Surface Edition. It also uses up two gigabytes of your memory, which isn't really a problem on this one because it has 16 gigabytes, but you definitely don't wanna be buying an eight gigabyte version of this if it's available, they probably don't even have that. Maybe my favorite part of the Surface Laptop too, is just that this keyboard is exceptional. There's something about it that I just really love. It almost feels like the actuation distance is just a little bit shorter, I can't entirely tell. It's like if this laptop here is a 10, then I'd have to give this one like a nine and a half. There's nothing that I can really complain about, about the keystrokes, it's just slightly different, and maybe not quite as far of an actuation. Moving over to the 15, it should have the same switches, but I guess I've been wrong before a couple of minutes ago. Oh, this is worse, okay, it's not very good compared to what are probably the two best laptop keyboards on the market, but why would you give that up when you could just buy the 13 inch model and not have this. It's just not quite as good. It might just be that the chassis isn't quite as stiff. I'm sure that you guys have already seen stuff about how the AMD version of this one isn't quite as good in a lot of ways, and one of the main reasons is just this wifi adapter. If we look at it. on the Intel one we get wifi six, on the AMD one we do not. Files just copy a bit faster on the Intel one, even when they're both on wifi five, I'm gonna just retire that one for now because I don't get why it needs to be bigger, and the keyboard worse, the biggest problems with the Surface Laptop 2 is that everything is glued together. There's no screws down here, if you want to get into it, you just use a heat gun and you absolutely destroy all of this, apparently the Surface Laptop 3 can be taken apart so let's see how that goes. I have a nice mat here so we don't scratch it up. I don't think this video is a sponsored by iFixit, but they are what we're using here today, this is easily the most difficulty I've ever had just getting feed off of a laptop. I'm like genuinely concerned for this thing even though I know it's just a little bit of rubber. There we go, we finally did it, that was really tough. - [David] Wow, you're so good at taking laptops apart, Alex. - Thank you, David, this is always my least favorite part of opening a laptop, you just kind of have to jam like a guitar pick in and hope you don't accidentally destroy something. Oh, seems to be coming apart just fine though. Wait a second, I know how this works. Flip it over, open it up, we should really turn this off. (both laughing) When it comes open here. Is the keyboard just kinda come off? It looks like it, oh, there's only one cable too. That's perfect. So this guy right here is what we have to be really careful of. Oh wait, oh my God, that was so easy. (both laughing) So we have three batteries here. I think that together they gave you a total of 48 watt hours which is a bit lower than what you'd find in the competition. Is that the SSD? That thing is tiny, look at this 256 gigabytes just right here, this is the first time that we've been able to upgrade the storage in a Surface Laptop, but I don't know how much you can upgrade it given the size of this thing, jeez, what else is under here? I'm just gonna take off the sealing, that one might not be going back on. So we've got heat pipes to here and also heat pipes over here, what's this one doing? It's bending heat pipe, let's not do that. Let's put that back together. Okay, as far as I can tell there's absolutely no way to upgrade the RAM. Not that that's really expected in thin and lights these days, it's just a nice to have. I'm going to say though this is such a huge improvement over the last generation. Like you spill a bunch of Coca-Cola on your keyboard and it gets all sticky and garbagy. You can replace it on this one, on this one right here, no beans. So I don't know, I guess we're done. I don't really feel like putting this back together, do you? - [David] No. - Yeah, I really like it, overall I'd say it's just an incremental improvement on what was already a fantastic laptop. They've come down in price since the first and second generation. So the value proposition is actually not horrific. It's not fantastic but I'm going to use it because you just have a bit more screen real estate. The area right here is just more comfortable to rest your palms on, I don't know. I just really like it as a daily laptop, I guess that kind of comes down to it. Elena says I'm a fun boy, but I don't know. Screw that guy. Thanks for watching, subscribe I guess. Do we have enough trial for this? Is that a thing? Oh, we should probably put it back together.",
    "transcript_keywords": [
        "Surface Laptop",
        "Laptop",
        "Surface",
        "surface Laptop feel",
        "thing",
        "bit",
        "feels",
        "Microsoft Surface Edition",
        "Laptop feel",
        "Microsoft Surface",
        "good",
        "Intel",
        "feel",
        "windows",
        "kind",
        "guess",
        "back",
        "Surface Book",
        "Surface Edition",
        "Microsoft"
    ],
    "transcript_entity_values": [
        "the next hour",
        "16 gigabytes",
        "Microsoft Surface Edition",
        "15",
        "Intel",
        "eight gigabyte",
        "three",
        "One",
        "USB-C.",
        "RAM",
        "15 inch",
        "one",
        "a couple of minutes ago",
        "iFixit",
        "the Surface Book",
        "2019",
        "Alex",
        "3580U",
        "nine",
        "Elena",
        "the Surface Laptop",
        "second",
        "256 gigabytes",
        "2256",
        "48 watt hours",
        "13 inch",
        "David",
        "Microsoft",
        "Coca-Cola",
        "daily",
        "10",
        "first",
        "AMD",
        "16",
        "two years ago",
        "two",
        "Surface Laptop",
        "four",
        "Surface Laptop 3",
        "two gigabytes",
        "1504",
        "only one",
        "six",
        "Alcantara",
        "today",
        "SSD"
    ],
    "transcript_entity_types": [
        "TIME",
        "QUANTITY",
        "EVENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG"
    ]
}