{
    "id": "FwM4ypi3at0",
    "title": "Galaxy Note 3 Bend Test (iPhone 6 Plus Follow-up)",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2014-09-23T23:35:57Z",
    "video_url": "https://www.youtube.com/watch?v=FwM4ypi3at0",
    "category": "Science & Technology",
    "tags": [
        "note 3 bend",
        "galaxy note 3 bend test",
        "galaxy note 3",
        "bend test",
        "iphone 6 plus",
        "iphone 6 plus bend",
        "bendable",
        "note 3 bend test",
        "unboxtherapy",
        "unbox therapy",
        "Samsung Galaxy Note 3",
        "samsung",
        "galaxy note vs iphone",
        "tech",
        "technology",
        "bend",
        "bent",
        "Samsung Galaxy (Brand)"
    ],
    "views": 8879986,
    "likes": 64933,
    "comments_count": 13154,
    "description": "How will the Note 3 hold up compared to the iPhone 6 Plus in a similar bend test?  Squarespace:  Offer Code: UNBOX  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://squarespace.com/unbox",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "Presented by SquareSpace Okay, so I'm back You probably have already watched the iPhone 6 Plus bend test, but I've got a huge number of requests to do another device, so I have Note 3 here, which is a similar formfactor and people just wanna know, I guess, is this bending something to be expected on any device this size? We're about to find out, but one more thing I want to mention about the 6 Plus: as I attempted to bend it back to it's original form it cracked in that location and it also cracked the glass on the screen as i hope you can see there in that image so we ended up with a crack after all so a little bit less usable then just a bend so I don't know what my reccomendation is if yours ends up bent, probably just leave it that way because when you attempt to bend it back, you might very well end up cracking the display along with it. But, enough about the 6 Plus, is this unusual for a large device, let's find out now using the Note 3, let's go! So, this Note 3 was actually dead, so i just got a battery backup here to charge it up, should have checked that before i started recording, but this is amazing, with the same or maybe more force, this thing hasn't bent at all. Or it bent, i mean, it bent as i was doing it it was creeking and making all kind of crazy noises, but... ultimatly, no damage. Let's go ahead one more time here... and try this again, with it plugged in this time. Just plugged in to a battery backup. So here we go. That is as hard as i can push. And nothing. Oh, it's a little warped. It's a little bit warped. You can probably see that, it's a tiny bit warped. But, wow, that device is completely functioning, that's crazy so, the Galaxy Note 3 survives the exact same bent test that the iPhone 6 Plus failed. That i did not expect, with a plastic build. But, there you have it, materials like plastic in many ways offer, I don't know, the best solution for durability in some cases I guess this is a good example of that. Obviously, not the most beautiful material to hold in your hand, but if you're looking for something that can withstand a torture test like this, then I guess the Note technically wins this particular battle. We'll have to wait and see what happens with the Note 4, when it comes out, it's launching very shortly, but at this moment, we have a completely functional Note 3 with very little battery power, because I didn't charge it in advance. Anyways, that wraps up this video, This were some painfull tests to do, although in this particular case, the Note 3 survived. But let me know what you think down in the comments, is that what you expected to see? Probably not. Alright, that wraps up this video. Leave a thumbs up down below if you approve of it or enjoyed it or found it to be informative in any way possible. Subscribe if you haven't yet and I'll catch you in the next episode, later. Squarespace, the all-in-one platform that makes it fast and easy to create your own professional website portfolio and online store. For a free trial and 10% off visit squarespace.com/unbox and enter offer code \"unbox\" at checkout. A better web starts with your website to get to. [Subtitles made by Quei Due Soliti Nerd]",
    "transcript_keywords": [
        "Note",
        "huge number",
        "number of requests",
        "similar formfactor",
        "formfactor and people",
        "bend",
        "bend it back",
        "back",
        "bent",
        "device",
        "bend test",
        "watched the iPhone",
        "Galaxy Note",
        "bit warped",
        "battery backup",
        "warped",
        "battery",
        "cracked",
        "attempted to bend",
        "attempt to bend"
    ],
    "transcript_entity_values": [
        "SquareSpace",
        "Quei Due Soliti Nerd",
        "Squarespace",
        "3",
        "10%",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL"
    ]
}