{
    "id": "FwqTSqBOY4g",
    "title": "Taylor Swift vs. Ronald Reagan: The Ticketmaster story",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-03-21T14:00:13Z",
    "video_url": "https://www.youtube.com/watch?v=FwqTSqBOY4g",
    "category": "Science & Technology",
    "tags": [
        "ticketmaster taylor swift",
        "taylor swift ticketmaster",
        "taylor swift",
        "ticketmaster senate hearing",
        "taylor swift ticketmaster disaster",
        "taylor swift eras tour",
        "ticketmaster",
        "ronald reagan",
        "the cure",
        "ticketmaster monopoly",
        "concert",
        "ticketmaster investigation",
        "the cure ticketmaster refund",
        "ticketmaster fees",
        "taylor swift tickets",
        "taylor swift midnight",
        "taylor swift tour",
        "concert tickets",
        "news",
        "concerts",
        "live nation",
        "taylor swift tour tickets",
        "taylor swift anti hero",
        "the verge",
        "decoder"
    ],
    "views": 32424,
    "likes": 1127,
    "comments_count": 81,
    "description": "Ticketmaster botched the sale of Taylor Swifts The Eras Tour and so many others. Its gotten so bad - and has angered so many Taylor Swift fans - that in 2023 Congress held a hearing on antitrust law. Since the 1980s a series of policy changes have helped the firm grow to dominate every single aspect of the live events business. And Ronald Reagan is to blame. #TaylorSwift #News #Music   Read more:   0:00 Intro 1:33 History of Antitrust Law 3:33 Ronald Reagan enters the ring 5:06 Ticketmaster begins its reign 6:04 Horizontal monopolies explained  7:51 Vertical monopolies Ticketmaster/LiveNation Merge explained  8:39 Ticketmaster sued 9:49 How bad Ticketmaster is today 12:01 How to (hopefully) fix Ticketmaster  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://bit.ly/3JWY34Q",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- So I basically spent an entire day trying to buy tickets to the Taylor Swift Eras tour. And like millions of other people, I had a terrible experience doing it. - How do you (beep) up this badly? You knew this was coming. You knew how many people signed up for presale. - Ticketmaster site wasn't equipped to handle all the demand and it just kept crashing. People waited in the pre-sale queue all day only to get kicked out again. A few lucky people finally got to the front of the line, had tickets in their cart, then got kicked out and had to start all over again. This happened to me. If you went through all this, you kinda know it was like playing the world's worst video game, and the prize for winning, was getting to pay outrageous Ticketmaster fees. Now, the weird thing about this is that this is far from the first time that Ticketmaster has failed in this way. Everyone's unhappy with Ticketmaster, but it still controls over 70% of the market for ticketing. In fact, it's had over 80% of the market for primary ticketing, that's the first sale of tickets, since 1995. How did Ticketmaster become the dominant market leader when it's frustrating and loaded with exorbitant fees at best? And utterly incompetent at worst? The answer, of course is Ronald Reagan. (ambient music) [Narrator] This is Decoder. - We've got a special episode today. We're diving deep on Taylor Swift Ticketmaster and how a handful of policy changes in the 1980s led to one firm so thoroughly dominating the live events business in the United States that Congress held a hearing in 2023, because Taylor Swift fans were so upset about antitrust law. Here's a really simple version. In 1890, Congress passed the Sherman Antitrust Act. President Theodore Roosevelt ran around using it to break up a bunch of monopolies. In 1914, Congress clarified the Sherman Act with the Clayton Act. Which specifically prohibits anti-competitive mergers. And up until the '80s, this was all working. The government was pretty aggressive about breaking up monopolies. But in 1978, law school professor Robert Bork writes a book called, \"The Antitrust Paradox.\" Which essentially says we've been doing antitrust all wrong. His argument is that big companies often become big, because they're good at what they do. And because being so big makes them efficient, that means people will eventually pay lower prices. Now, here in 2023, I think we all know how well that worked out. But put your mind back in 1978. This idea is like exciting and fresh. So Bork says a company shouldn't be broken up just because it's big. And antitrust law should actually protect companies who win in the market and become big, based on their superior ability. So Bork proposed a new approach to antitrust law which he called to the Consumer Welfare Standard. He said that courts and federal agencies like the Department of Justice and the Federal Trade Commission should look out for the consumer welfare. Which he mostly measured by prices. What that means for us is that unless a monopoly causes an increase in prices, it's okay. And that's the Bork philosophy. Let the big businesses get big and stay big as long as they don't harm consumer welfare. In 1979, the Supreme Court decides Reiter versus Sonotone. In that decision, the court officially endorsed Bork's claim that Congress had actually intended to adopt the consumer welfare standard when it wrote the first antitrust law in the 19th century. Again, the consumer welfare standard is not actually in these laws. Bork just managed to convince everyone that he could, read Teddy Roosevelt's mind, and this is what old Teddy Bear wanted. It's kind of incredible. Anyway, Bork and the Chicago School are in vogue from the 1980s on. Really, they're still how we think of antitrust law today. In 1980, Ronald Reagan is elected President. Reagan and his team are big fans of Robert Bork in the Chicago School. Well, does that matter? Here's Sandeep Vaheesan, legal director at the Open Markets Institute. - President Reagan was really a key figure in the history of antitrust. He remade antitrust in some major ways by doing two things. First, he appointed Chicago School lawyers and economists to lead the Department of Justice and Federal Trade Commission, which are the two main public enforcers of federal antitrust law. These officials had a very different view of antitrust than their predecessors. - By this point the Supreme Court has already started adopting Borks ideas. - They believed antitrust should be exclusively about consumer welfare, which they described as low prices, high output. Second, they adopted a new set of economic assumptions about different business practices. For example, mergers and acquisitions were historically seen as principally a way of concentrating power in fewer and fewer hands. And generally not producing any offsetting public benefits. The Reagan administration flipped that. They said actually mergers are generally good. - Side note, Bork actually cast such a spell on Reagan that Reagan actually nominated him to be on the Supreme Court. That nomination failed in part because Borks videotape rental history was leaked to the press, which eventually led to a federal law making your video rental history private. This is true. It's also where the term \"Borked\" comes from. The '80s. Ticketmaster was started in 1976, but the modern era of Ticketmaster ticks off in 1982. That's when the Pritzker family acquires a dominant stake in Ticketmaster. They become the dominant shareholders, and bring in a new CEO named Fred Rosen. And the company focuses on software for the computerized ticket business. - His sales team went around to all of the venues and said to them, \"What would you think \"if we doubled the service fees?\" And they said, \"Why would we wanna do that? \"It's gonna discourage people from buying tickets.\" And what Ticketmaster said was, \"Well, if we do it, we'll share the revenues \"from this new elevated service fee.\" - This fee sharing arrangement is how Ticketmaster is able to compete with its main competitor at the time. A company called Ticketron. It starts poaching Ticketrons venue clients. By 1991, Ticketmaster just goes ahead and acquires Ticketron. - So when Ticketmaster acquired Ticketron, they were direct competitors. They were in the same industry, and hence that is a form of horizontal integration. - Did you hear that concept? When a company buys a direct competitor that's called horizontal integration. This is important because later Ticketmaster is gonna do some vertical integration as well. But we'll get to that. - There's immediately, a strong concern about abuse of market power. Does this eliminate competition? And whenever have elimination of competition that may harm consumers because suddenly there's not another competitor around who could lower prices, who could offer better service, who could offer better quality. - Okay, so now it's the mid '90s. In 1995, ticketmaster.com launches. Throughout the rest of the '90s and early 2000s, Ticketmaster slowly gains more and more power. It launches in an increasing number of countries around the world, and inks partnerships for ticket resale with the NFL, the NHL, and the NBA. It even tickets the Olympics. In 2001, Ticketmaster strikes a deal with Clear Channel Entertainment, which is now called Live Nation, to ticket their events. Clear Channel or Live Nation by this time was becoming America's largest concert promoter. That's the marketing for a concert, basically filling seats. But Live Nation also owns and manages the concert venues. So it really owns the whole live event pipeline. And in the 2000s, as music piracy upends the industry, big artists start signing massive exclusive deals with Live Nation. So by 2007, live Nation has a bunch of exclusive deals with huge artists, ownership of most major venues, and a lock on the concert promotion business. So then they did the next natural thing. They started working on a ticketing business to compete with Ticketmaster. So that brings us to 2010. Now it's time to talk about vertical integration, which gets even less scrutiny than horizontal integration. Here's Florian. - And then the extreme case, of course is a vertical monopoly where at all points of the value chain, there's only a single provider. So that would of course give that player a tremendous amount of market power. Because not only are they the only seller, but they're also the only buyer, and they're controlling all of the inputs that are happening along this value chain. - In 2010, Ticketmaster and Live Nation decide to merge and form Live Nation Entertainment. So Ticketmaster, which sells tickets decides to merge with Live Nation which owns venues, and puts on and promotes concerts. A lot of people think this created an unfair vertical monopoly, and the deal should have been stopped by the Obama administration. A handful of states actually sued over the Ticketmaster/Live Nation deal, as did the Justice Department. In order for the deal to go through, Ticketmaster promised the Department of Justice it wouldn't do anything anti-competitive. It's basically just a pinky swear. It's pretty hard to enforce. The company was forced to sell one of its holdings another ticketing company to a rival firm, and it promised to license its ticketing software to another rival called a AEG, which is a big promoter and competitor to Live Nation. The terms of the Live Nation merger established by the DOJ lasted until 2019 when they were reviewed. We talked about that with Dean Budnick - And in 2019, the government decided to renew that consent decree, essentially giving permission to this merger, and there hadn't been a dramatic change in terms of market dominance by Ticketmaster between those two periods of time. So at least the Department of Justice has examined this issue twice. But on two separate occasions, the government has opted not to step in and do anything. - So that brings us to today. Ticketmaster and its parent company, Live Nation Entertainment, dominate the market for live concerts. Live Nation's dominance of ticketing and promotion has allowed it to shut out competitors. Jack Groetzinger, the CEO of SeatGeek, talked about this at the January hearing as well. He claimed that when venues switched to SeatGeek or another Ticketmaster competitor for their ticketing, Live Nation, which controls the artists and their promotion, stops giving concerts to those venues. - One case the Live Nation president told the venue that they would \"Go nuclear if they left.\" So the threat is real. It's been documented. It happens. - With Ticketmasters growing dominance and lack of meaningful competition, ticket prices and the fees that accompany them have drastically increased. Where this gets even deeper is that lots of people resell their tickets, and Ticketmaster has a big chunk of that market too. If you try and use another service like StubHub to buy a ticket that Ticketmaster originally sold, you still need to have a Ticketmaster account and enter their ecosystem. So now they have your data, even if you didn't want to interact with them in the first place. A couple senators at the hearing also had some thoughts about how to regulate Ticketmaster into working better. Basically, the government redesigning Ticketmaster to make it friendlier for consumers. I guess that's one way to do it. The other way is to have a more competitive market. SeatGeek is another primary ticketing site that has struggled to compete with Ticketmaster. Ditto for Eventbrite and StubHub. In our reporting for the story, we also talked to Russ Tannon, president of Dice. A venture backed ticketing startup. Dice has made its tickets non-transferable. There's a QR code with your ticket that appears right before the event, to prevent scalping. But in a functional market, some artists would choose to use Dice's system that doesn't allow resale. Some would use SeatGeak. And some would still use Ticketmaster. And all of them would compete to build the fairest system that made fans the happiest. Without that competition, a lot of the things that Ticketmaster would have to do to not suck, requires the company to make decisions that no publicly traded company with a responsibility to its shareholders, could reasonably make. Ticketmaster would have to increase the cost of app development and servers, while limiting the profits from all those fees. And that's just not gonna happen, unless something makes it happen. And that means there's only two choices. We can accept that Ticketmaster is a monopoly and have a bunch of weirdos in Congress try to regulate it directly. Or we can figure out how to inject some more competition into the market, so Ticketmaster makes better choices just to stay in the game. See, what Bork and Reagan didn't think about when they rewrote antitrust law, is that when companies get so big, they have no competition they have no more incentive to be good at what they do. The new chair of the Federal Trade Commission is named Lina Khan. She's written at length about the problem with Bork's approach. - [Lina] The current framework in antitrust, the consumer welfare framework, really fails to capture forms of market power and forms of dominance that should be relevant to antitrust. And do raise competition concerns. - And there are other glimmers of hope under the Biden administration. - We're seeing some positive signs, I think. The Department of Justice has made reigning an employer power a key part of its enforcement program. They've gone after many managers and firms for engaging in wage fixing, no hire agreements, no poach agreements. - But all that's easier said than done. Under Commissioner Kahn, the FTC has aggressively gone after big tech, but it's first attempts at lawsuits have been busts. The court keeps knocking them down, because they're just not agreeing with Kahn's new version of antitrust. They're stuck in the consumer welfare standard. There's another prong of attack going on over at the Biden Justice Department, which is investigating Ticketmaster and Live Nation. Seemingly asking whether Live Nation Entertainment is a monopoly after all. Senator Klobuchar nudged the Justice Department to take action at the hearing. - I know you, Ms. Bradish talked about this idea of spinning off companies. We've all seen that as a remedy that would most likely be coming from the Justice Department. All we can do here is put forward the evidence and these are sworn testimonies back and forth under law, so that the Justice Department can look at this discussion. (ambient music) - It seems like all this pressure forced Ticketmaster to at least do a little better with Beyonce's upcoming tour. But the underlying problems are all still there. So we'll see if the Swifties can push the Department of Justice into breaking up Ticketmaster and Live Nation. Anything's possible. We'll see if Congress does anything to update our antitrust laws. But in the meantime, the question we should all be asking ourselves is, \"Do we want to live in the Bork/Reagan world \"of weird regulated monopolies? \"Or do we want these companies to actually compete?\" I should be the King of America. Let's just go up a little bit more. - [Crew] There's our random card. (Nilay laughing) - Vote Patel. Hey everybody, this was the short video version of this episode of Decoder. That's the podcast I host. If you want the full episode, go anywhere you get your podcast and look for Decoder.",
    "transcript_keywords": [
        "Live Nation",
        "Ticketmaster",
        "Live Nation Entertainment",
        "live",
        "Nation",
        "Justice Department",
        "Taylor Swift Ticketmaster",
        "antitrust",
        "Bork",
        "antitrust law",
        "Live Nation president",
        "Department",
        "Justice",
        "Consumer Welfare",
        "called Live Nation",
        "Live Nation deal",
        "Nation Entertainment",
        "Live Nation merger",
        "big",
        "market"
    ],
    "transcript_entity_values": [
        "Decoder",
        "Reagan",
        "Taylor Swift",
        "Biden",
        "Chicago School",
        "1914",
        "NBA",
        "only two",
        "Clear Channel Entertainment",
        "Eventbrite",
        "Reiter versus Sonotone",
        "One",
        "NFL",
        "Florian",
        "Fred Rosen",
        "NHL",
        "1978",
        "Live Nation's",
        "Ticketrons",
        "Klobuchar",
        "Lina Khan",
        "Second",
        "2010",
        "1979",
        "the King of America",
        "the Sherman Antitrust Act",
        "the Sherman Act",
        "the Consumer Welfare Standard",
        "2001",
        "Ticketron",
        "Pritzker",
        "the 2000s",
        "Obama",
        "The Department of Justice",
        "Kahn",
        "1991",
        "the Open Markets Institute",
        "Federal Trade Commission",
        "1982",
        "the mid '90s",
        "the Ticketmaster/Live Nation",
        "Clear Channel or Live Nation",
        "Beyonce",
        "1976",
        "the Department of Justice",
        "the '90s",
        "first",
        "1995",
        "DOJ",
        "Ticketmaster",
        "Live Nation Entertainment",
        "Ticketmasters",
        "FTC",
        "Ronald Reagan",
        "the Clayton Act",
        "Borks",
        "over 80%",
        "Russ Tannon",
        "Taylor Swift Ticketmaster",
        "Robert Bork",
        "like millions",
        "Olympics",
        "Ticketmaster and Live Nation",
        "Congress",
        "the Justice Department",
        "Lina",
        "StubHub",
        "the Federal Trade Commission",
        "2019",
        "Dean Budnick - And",
        "the 1980s",
        "SeatGeek",
        "an entire day",
        "First",
        "one",
        "Theodore Roosevelt",
        "Teddy Roosevelt's",
        "over 70%",
        "today",
        "Jack Groetzinger",
        "Swifties",
        "Dice",
        "1980",
        "the '80s",
        "AEG",
        "the 19th century",
        "Teddy Bear",
        "early 2000s",
        "Bork",
        "America",
        "the United States",
        "2023",
        "the Biden Justice Department",
        "two",
        "all day",
        "Borks",
        "the Chicago School",
        "Sandeep Vaheesan",
        "Live Nation",
        "Patel",
        "January",
        "Bradish",
        "The '80s",
        "the Supreme Court",
        "2007",
        "1890"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "LAW",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "LAW",
        "PERSON",
        "PERCENT",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERCENT",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "GPE",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "DATE"
    ]
}