{
    "id": "FWz_oEcaS20",
    "title": "How to share files b/w two computer using a LAN cable (NEW)",
    "channel": "TechWiser",
    "channel_id": "UCdp6GUwjKscp5ST4M4WgIpw",
    "subscriber_count": 2200000,
    "upload_date": "2013-08-10T13:25:27Z",
    "video_url": "https://www.youtube.com/watch?v=FWz_oEcaS20",
    "category": "Science & Technology",
    "tags": [
        "tips",
        "tricks",
        "Send files from one computer to another",
        "LAN CABLE",
        "SHARE DATA",
        "TWO COMPUTER",
        "Local Area Network",
        "HOW TO",
        "how to share data between two computers using lan",
        "share data between two computers using lan cable",
        "Tutorial",
        "Connect Two Computers"
    ],
    "views": 531150,
    "likes": 2406,
    "comments_count": 329,
    "description": "In this Video, we will find out how to Send files from one computer to another with Lan cable (cat5).    You can reach me here  Website -  YouTube -  Facebook - Twitter -  Instagram -   Which background music did I use?  I use Audio from YouTube audio library. Drops of H2O (The Filtered Water Treatment) By J.Lang from ccMixter. Available at   License: Creative Commons Attribution (3.0)  What camera do I use?  Canon 70D  What mike do I use? Blue Yeti and Video Mic pro (depends on requirement)  What tripod do I use? Manfrotto MVKBFR  What video editor do I use? Final Cut Pro  My computer do I use? iMac 2015 for editing and a ThinkPad for casual work Audio",
    "description_links": [
        "http://techwiser.com/how-to-connect-pc-to-pc-lan-cable/",
        "http://techwiser.com/",
        "https://www.youtube.com/techwiser",
        "https://www.facebook.com/techwiser",
        "https://twitter.com/TechWiser",
        "https://www.instagram.com/techwiser",
        "http://ccmixter.org/files/djlang59/37792"
    ],
    "transcript": "Hii This is Mrinal from receivetipstricks.com and in this video we will see how to share data b/w two laptop using lan cable. OK so let get started we will do that in three step 1 In the first step we will connect the both laptop physically with a LAN cable 2. In the second step we will manually configure the ip settings of laptop. 3. ANd in the last step we will make the data folder shareable so that we can transfer the data. OK before we get started the first thing you need to do is connect the both laptop with a LAN cable. Let me show you how it's done so now both the laptop has been connected with LAN cable , lets proceed with 2nd part To configure the ip setting go to network and sharing center and THEN Go to advance sharing setting here TURN ON all sharing option while turning off the password protection SHARING. once you are done CLICK save changes. In the network and sharing center and goto ip v4 setting of your local area connection and manually enter the ip, If you are not familiar on how ip works stick to ip setting show in this video. Also make sure that both pc have same work group name. you can give any name you want in this case (WHICH IS DEFAULT) the name is WORKGROUP all in uppercase. OK NOW YOU HAVE TO Make the similar changes to second laptop. WHICH is Turn on sharing OPTIONS While configuring ip OF SECOND PC make sure to reverse the ip address and default gateway from the first laptop And make sure workgroup name is same as of first laptop. ONCE DONE WE ARE READY TO MOVE TO NEXT PART AND SHARE OUR FILES AFTER successfully configuring the ip setting in part 2 ,both pc will be now shown in the under the same network Now to share folder with other pc. Right click on the folder and select share with specific people option, Add users and give permission depending on your requirement Once you are done click on share button. Click on done and your folder will be share on second pc. In your second pc go to network option and select the first computer name. Here you will find the share folder. Now you can copy these files to your hard disk or add a new one, The average speed OF COPYING FILES ranges from 10 -30 mb/s . If everything works well for you, you will now be able to share data using LAN cable but if you still face any problem you can always comment below and I will ready to help you. If you like my video and you think it's was usefull to you please subscribe to my channel. It will help me alot. Thanks for watching.",
    "transcript_keywords": [
        "Mrinal from receivetipstricks.com",
        "lan cable",
        "lan",
        "laptop",
        "share",
        "sharing",
        "Mrinal",
        "cable",
        "setting",
        "step",
        "make",
        "data",
        "folder",
        "share data",
        "CLICK",
        "network",
        "FILES",
        "sharing center",
        "share folder",
        "option"
    ],
    "transcript_entity_values": [
        "two",
        "10 -30 mb/s",
        "LAN",
        "3",
        "WORKGROUP",
        "second",
        "SECOND",
        "first",
        "2nd",
        "1",
        "2",
        "three"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}