{
    "id": "fxGI8r8vAFk",
    "title": "LG Wing Teardown! - HOW DOES IT WORK?!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-09-24T13:15:04Z",
    "video_url": "https://www.youtube.com/watch?v=fxGI8r8vAFk",
    "category": "Howto & Style",
    "tags": [
        "LG Wing",
        "Smartphone",
        "tech",
        "LG wing teardown",
        "How does the LG wing work",
        "folding phone",
        "LG",
        "best smartphone",
        "cool smartphone",
        "unique smartphone",
        "wing"
    ],
    "views": 7151833,
    "likes": 213315,
    "comments_count": 16623,
    "description": "Its time to see how the new LG Wing works... from the inside! LG sent over a preproduction phone that I could take apart. Get more info here:  Huge thanks to LG for sponsoring this video. The LG Wing might just be the craziest phone of 2020. Its definitely one of the most unique smartphones of the year. The screen of the new LG Wing can swivel up into a 'T' shape. Revealing a smaller square screen hidden below.   *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.lg.com/global/lgwing",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The LG Wing is probably one of the most unique devices we've seen all year...or maybe even of all time. It's one of those devices that, well, blazes its own trail without really stopping to ask for directions. And I'm all for it. This is a pre-production unit sent to me by LG so it's not a retail unit. The durability test has to wait until that comes out like we always do. But the hardware is finalized so we can take it all apart and see how it works. Huge thanks to LG for sponsoring this video and sending over the Wing. Rather brave of them since I've never opened up a phone like this before. And there's a pretty good chance it won't survive. Let's get started. [Intro] The LG Wing has about the same size, shape, thickness and weight as my Note 10 Plus inside of its case. But the LG Wing can do this...which is something I never thought a phone would need to do. Instead of folding, this guy swivels. It'll be super interesting to see how that works from the inside. The phone splits in half, swiveling up into a t-shape so the screen is horizontal while revealing a secondary square screen down below. The swinging motion feels solid and really easy to initiate. And something catches the screen at the top of the swivel to gently ease it into place. We're going to find out how the hinge works once we get inside. LG has installed a high lubricity polyacetal which is a lubricated plastic of sorts that surrounds the front panel and protects the screen. It's a softer, smoother plastic raised up to form a slight cavern inside so foreign materials won't be rubbing up on the screen when it's closed or opening. This is important because pocket sand is a real danger to glass displays. When the phone is opened up in its winged state, there's more real estate for activities and multitasking. Like with YouTube, it displays the video up top and the video controls down below. Or when we're in the camera app the bottom display can act as a gimbal for the camera unit adding extra electronic stabilization to the camera. There is no physical movement of the camera hardware while you're controlling that gimbal. It's all done with software, but still pretty cool. Activating the top camera makes it pop out of the phone like a daisy, and then the Wing can film forwards and backwards at the same time. It also has the same retract and fall protection features that we've seen in other pop-up cameras. The coolest thing though, I think, is the ability to watch a video full screen while another app like texting is open at the bottom. Or even the ability to comment on a video while it's still full screen. Or maybe while you're on a road trip, navigation can be vertical while the music is over on the side screen. There are a lot of different options. I mean, let's be honest, this probably isn't going to be the best phone to recommend to grandma. But if you're looking for the latest, craziest, and most uniquely designed phone on the market, this might just very well be it. Now that the Wing has been awake for 5 minutes, it's time to take it apart. So keep in mind that this is my first time seeing the LG Wing and it is very different from any other phone we've taken apart recently. So cross your fingers for our new friend's survival. The LG Wing has passed 9 different mil standard 810g tests one of which is the shock test, which dropped the Wing at 26 different angles from 1.2 meters and it still survived. But that's obviously quite a bit different than being completely dismantled. I'll remove the back glass panel since that's where I'd assume we'd find the screen and internal connectors, along with whatever magic makes up that swivel hinge. With the back glass gone, we get our first look at the wireless charging pad, and the no dogs allowed sticker which is good. Since I'm not a canine I'll continue. There are 9 normal Phillips head screws holding down the top plastics. And once that panel is removed we get our first tease at how LG has assembled the Wing. We know ribbon cables can flex, you know, from those pop-up cameras. And this ribbon cable controlling the screen goes through the PCB and rotates gently with the display inside of its large, smooth, circular opening. LG says they've tested this opening motion over 200,000 times. Which, like if you flipped open the phone 100 times a day would still last you about 5 years. So far, so good. We can also get a close up look at the pop-up front facing camera. It's got the same stepper motor setup that we've seen other pop-up cameras use. I used to dedicate an entire video to a pop-up camera, but now we've got whole phones splitting in half. Technology is pretty great. I'll disconnect the battery, the bottom screen, the USB-C charging port cable, all just like little Legos. Then I'll pull out the SIM and expandable memory SD card tray. You might think that a phone like this wouldn't have any water protection, and you're kind of right. The phone isn't exactly sealed shut. But LG has coated the internal boards with a water repellent coating. There's still no official IP rating, so keep it away from water, but it is nice to know it does have some protection. I'll lift the motherboard out from the phone after disconnecting the 32 megapixel front-facing camera. There are 3 rear facing cameras. The 12 megapixel swivel camera up top, a 64 megapixel main camera, which does have optical image stabilization, and a 13 megapixel wide angle camera down at the bottom. The top camera does the whole gimbal thing that I showed you earlier, with its built in electronic stabilization. There is a small thermal pad on the back which helps transfer heat away from the processor into the frame of the phone. I'll take the battery out next before we try to remove the wing. There is an incredibly reasonable amount of adhesive holding the battery down. No magic pull tabs. But it does pop up easily with my pry tool. Thumbs up for that. It has a 4,000 milliamp hour capacity. We have a few more revelations about that hinge from this vantage point. The little doohickey that cushions the hinge opening is right here next to the display ribbon. It's the smallest hydraulic damper I've ever seen. Hydraulic shocks are common on trucks and off-roading vehicles to help cushion the impact of the vehicle while off-roading. And here we have the babiest of the baby sharks inside of the LG Wing. If we can get an awe down in the comments that would be great. We'll get a closer look at that guy in just a second. In order to get the front screen off, I imagine it has something to do with these 6 large Phillips head screws. After those are gone, I can tell the screen wants to come away from the phone but it's still connected somehow. I'm trying to be gentle since I never really asked LG if they wanted this phone back alive or not. But, they also didn't tell me how to open it, so here we are. After a lot of unfruitful jiggling and wiggling, I realized that the screen itself had a little hole in its sliding mechanism. Kind of like how we would find in a hotel room chain door lock. And once I got those internal screws removed, it gets loose enough so the hole can be lined up and popped off the body of the phone. I used to, you know, tell my mom that video games would help me learn problem solving skills that I could use as an adult. And I don't think this is exactly what she had in mind, but I'm still counting it. There are 9 black screws holding the hinge to the super thin top display. And once those are gone, we finally get our full complete view of the LG Wing hinge. The rest of the hinge components are riveted together which makes sense, because what's left inside are two pretty powerful springs. One that helps the phone open and hold it open. And the other that holds it in a closed position. Both equally balanced so that the swiveling motion itself is easy. The large hole in the center is for that ribbon cable. The two curved sections you see on the hinge are for the double locking mechanism that keeps the screen from opening too far in either direction. And having two of them both made out of metal helps keep the screen strongly positioned parallel to the rest of the phone body. It looks like our itty bitty hydraulic damper is held in place with three tiny screws of its own. I'll pop those out and pull away our tic-tac size little friend. It's amazing how small this thing is. The same technology that keeps the screen door from slamming shut is now inside of a cell phone. 2020 has been pretty wild. Speaking of wild, it's going to be really crazy if I can get this whole thing put back together and functioning again. I'll feed the top display through the hinge and get that screwed down. The top display is 6.8 inches, and the bottom display, which is still attached to the frame, is just about 4 inches. Getting the curved metal guiding slot in the screen lined up with the metal post on the phone body is probably the trickiest part of the reassembly. But once I feel it get clicked in, everything else just falls into place exactly how it should. And I can attach the spring portion of the swivel hinge back to the frame from the inside. Everything else is relatively normal just like a regular phone. The motherboard goes back in with its popup camera. And all of the little Lego style ribbon attachments get clipped in. I'll lay the battery in place and get the Wing screen ribbon connected. Then I can attach the wireless charging and protective back plastics with the screws. And trust me, I'm just as surprised as you are. The whole thing still turns on and functions like normal. Not too shabby. I'm impressed at LG's leap of innovation. The Wing brings some exciting diversity to an otherwise rather boring sea of rectangles, and I think it's pretty cool. I'm curious to hear your thoughts about the Wing down in the comments. We'll do a durability test when the retail version comes out to keep things consistent. I am glad that LG gave us an early look inside though. Hit that subscribe button if you haven't already. Come hang out with me on Instagram and Twitter. And thanks a ton for watching, I'll see you around.",
    "transcript_keywords": [
        "Wing",
        "phone",
        "screen",
        "camera",
        "Wing screen ribbon",
        "inside",
        "hinge",
        "top",
        "Wing screen",
        "popup cameras",
        "back",
        "display",
        "video",
        "top display",
        "Wing hinge",
        "top camera",
        "cameras",
        "popup",
        "pretty",
        "screws"
    ],
    "transcript_entity_values": [
        "all year",
        "stepper motor setup",
        "Wing",
        "LG Wing",
        "2020",
        "1.2 meters",
        "9",
        "4,000 milliamp hour",
        "6",
        "Twitter",
        "SD",
        "Lego",
        "Instagram",
        "about 5 years",
        "32 megapixel",
        "5 minutes",
        "two",
        "100",
        "YouTube",
        "polyacetal",
        "three",
        "bitty hydraulic",
        "IP",
        "half",
        "Phillips",
        "The LG Wing",
        "Wing",
        "the LG Wing",
        "64",
        "first",
        "second",
        "6.8 inches",
        "PCB",
        "13 megapixel",
        "200,000",
        "12",
        "3",
        "One",
        "one",
        "just about 4 inches",
        "26",
        "LG"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG"
    ]
}