{
    "id": "FZe7OllHUXw",
    "title": "They Said It Can't Be Ripped...",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-08-06T14:59:50Z",
    "video_url": "https://www.youtube.com/watch?v=FZe7OllHUXw",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "mighty wallet",
        "mighty",
        "wallet",
        "dynomighty",
        "cool wallet",
        "tyvek",
        "best wallet",
        "best",
        "2016",
        "crazy",
        "futuristic",
        "things",
        "cool",
        "innovation",
        "invention",
        "new inventions",
        "cool gadgets",
        "future",
        "amazing inventions",
        "awesome inventions",
        "new technology",
        "weird",
        "durability",
        "google",
        "smart",
        "products",
        "technology (industry)",
        "cool inventions",
        "wallet (product category)",
        "new technology 2016",
        "minimalist"
    ],
    "views": 9298605,
    "likes": 132215,
    "comments_count": 6185,
    "description": "(   ) --- Today's Mystery Video -  Mighty Wallet (USA Link) -  Mighty Wallet (International Link) -   This is the Might Wallet from Dynomighty. It's made of something called Tyvek which is supposedly incredibly durable. It's light, thin and relatively inexpensive.  From the manufacturer -  Keep your money in your money! The Mighty Wallet is tear-resistant, water-resistant, expandable and recyclable. Made from Tyvek (think express mail envelopes), these cool wallets resist tearing because of thousands of interlocking plastic fibers spun in random patterns, giving them incredible strength. The ingenious origami construction was and is the original folded Tyvek wallet designed by Terrence Kelleman. The stitch less design reinforces the materials own strength and allows these very slim wallets to instantly expand and adapt to your own personal storage needs. The Mighty Wallet will expand right before your eyes. Because of the slim, lightweight and water resistant features, you can take these cool wallets anywhere. They make great \"night out\" wallets for a slender silhouette and the writable surface conveniently acts as a quick note pad on the go. In time, the Mighty Wallet will gradually soften and patina but, even after years of wear, it will still offer surprise and solicit intrigue.  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/OIxKPptaI1Y?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "http://amzn.to/2aBMge7",
        "http://geni.us/wZwMB",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So I told you stuff just arrives here... At the studio. Everybody wants to be on Unbox Therapy. This is no exception, you can see I even got like a little sticky note here. \"Hey Unbox Therapy, here are some Mighty Wallets to check out.\" \"If you have any questions let us know.\" Maybe I will. \"What is a Mighty Wallet?\" \"Mighty thin, mighty strong, mighty green.\" \"Touch me, I'm Tyvek.\" Based on my understanding here, this is a super thin material. That somehow you can't tear? And it expands as you fill it? Look at the image on the back. \"The incredible strength of the Mighty Wallet comes from its super strong material and unique folded design. This super thin and lightweight Tyvek.\" \"It's incredibly strong and resistant to tears and stains.\" \"Also a true conversation starter,\" at least that's what they'd have you believe. Alright, let's crack one of these open. What do I do here? Is there a... way to do this correctly? Is that it? What'd I do? Alright. Is there a way to- Am I missing something here? [laughs] Do I just- I might be completely out of my mind- Oh! So that part is meant to do that, alright. Alright, what do we have here? \"Dare to Tear - take the challenge!\" \"Ask someone to tear this card in 1 minute or less.\" This card, so I don't even- That's super thin! It just feels like paper. [laughs] Why 1 minute? They're only giving me- -a minute to do it Okay fine, yeah. They, yeah, they got something going on there. Dare to Tear, I don't know- uh. \"Artist Collection,\" you can print your own, whatever you want onto the wallet. Oh! And there's a code. There you go, 5 dollars off, alright. So, it's a super thin wallet that expands as you put stuff in it. Do I have any money? Yes, I have some. This is obviously not going to expand it too much, but, you just slide that baby in there. That is weird, money in money. Money on money action. And then this thing is made out of the same material, but it's super thin! I suppose that's kind of the point, because it's made out of this Tyvek material. You could throw some people off, you pull that baby out; they're like, what, wha- what magic is this? What's this guy up to? Look at that, that looks like a paper envelope! Same material, Dare to Tear. Oh yeah. What is- ? It's so weird because it feels exactly like paper, until- you try- to do an- Magic. Look at this, it's like the comic book version. Apparently they've got many versions of these. Plus there's a couple jokes they added on there, look at this little kid with the hat on, what is this? Some kind of illuminati thing? The face with the skull. They're taking it to another level. A couple of cards here, go ahead and- Throw 'em in. There you go. You got your super thin, strange, What looks like a paper wallet until you give it to someone and you're like, \"Hey why don't you tear it then tough guy?\" \"You got one minute!\" [struggling] How about this? How's your Tyvek holding up now? How about this? YES! What do you say now?!",
    "transcript_keywords": [
        "Unbox Therapy",
        "Hey Unbox Therapy",
        "Mighty",
        "super thin",
        "tear",
        "Mighty Wallet",
        "super",
        "thin",
        "Wallet",
        "Alright",
        "Tyvek",
        "Dare to Tear",
        "money",
        "material",
        "Therapy",
        "Hey Unbox",
        "Unbox",
        "Dare",
        "paper",
        "minute"
    ],
    "transcript_entity_values": [
        "Dare to Tear",
        "one minute",
        "Dare to Tear",
        "Artist Collection",
        "Unbox Therapy",
        "Dare to Tear",
        "Magic",
        "illuminati",
        "the Mighty Wallet",
        "1 minute",
        "5 dollars"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "PRODUCT",
        "NORP",
        "ORG",
        "TIME",
        "MONEY"
    ]
}