{
    "id": "G3EuYRbGtmA",
    "title": "The Biggest Leak in Gaming History",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-09-20T00:48:42Z",
    "video_url": "https://www.youtube.com/watch?v=G3EuYRbGtmA",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Rockstar",
        "GTA",
        "GTA VI",
        "GTA 6",
        "Grand Theft Auto",
        "Grand Theft Auto 6",
        "Grand Theft Auto VI",
        "leaks",
        "GTA leaks",
        "GTA VI leaks",
        "gameplay",
        "story",
        "single player",
        "DLC",
        "protagonist",
        "player",
        "GTA 6 player",
        "Rockstar leak",
        "hack"
    ],
    "views": 666233,
    "likes": 35785,
    "comments_count": 1164,
    "description": "Get $25 off all pairs of Vessi Footwear with offer code techlinked at    LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:   Timestamps: 0:00 don't be sad 0:13 GTA VI leaks confirmed 1:23 Texas social media law re-instated 2:25 Apple funds \"App Association\" 3:24 Vessi Footwear 3:54 QUICK BITS 4:01 ASUS ROG Phone 6D Ultimate 4:39 Instacart shopping cart 5:11 Cyberpunk 2077 resurgence 5:37 KiwiFarms hacked 6:05 Supersonic passenger jets   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.vessi.com/techlinked",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/KaONC",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- If you ever feel sad, just remember that \"TechLinked\", the premier tech new show on the internet still gets kicked off our set so Litus can vlog a poly pocket PC or something, but that's just another reason to be sad. So, I don't know why would I tell them that? The rumors are true. GTA VI is real, because of course it is, just because Rockstar isn't Assassins Creeding a new game into the world every year, doesn't mean they just forgot that people like to see number go up. - [Co-host] Printed money. - GTA VII, let's just skip it. Over the weekend, nearly 100 videos from an early build of the game were leaked onto GTA forums and the internet being what it is, it didn't take long for the clips to show up on YouTube and other websites. Rockstar has already confirmed that the footage is indeed authentic and they are in fact, still developing GTA VI, though, of course, they were quite miffed that someone hacked into their servers and got their hands on the footage. They would've thought fans of a franchise about career criminals had more respect, decorum. The hacker is also claiming responsibility for the recent network intrusion that affected Uber and went on to say he pilfered the game capture after compromising the Slack account of a Rockstar employee. - [Co-host] Hard at work, this guy. (laughs) - No breaks. No word yet on when GTA VI might be released though rumors indicate that it might be another couple years. They might be able to squeeze out another remaster or re-release in that time, we'll have to see. I want a Sega Genesis version. A US federal appeals court has reinstated a Texas law that would make it illegal for tech companies to moderate content based on political viewpoint. Even if that viewpoint entails the belief that it is one's civic duty to reply first on every post with no comments. - [Co-host] Or else you're not a citizen! (laughs) - It shouldn't be a bipartisan thing. They don't know we're doing Starship Troopers. At issue is whether the First Amendment's free speech protections extend to social media providers that delete, demonetize or otherwise discriminate against content that the platforms view as misleading, hateful, or spreading of misinformation. Supporters of the law view it as a necessary check on the power of large tech companies while opponents point out it forces social media platforms to host false or dangerous content when they're private entities that qualify for first amendment protection. Because another federal appeal circuit has already ruled in the other direction, this is likely setting up for a showdown at the US Supreme Court, where the issue will be decided with a ruler duel. Somebody's gonna bring a meter stick. It's gonna be dangerous. There's a lobbying group that fights for small app developers but it turns out over half of its funding comes- (splutters) I just got attacked by a bee. Apple sent it. Because they knew we were gonna badmouth them here. Over half of the group's funding comes from Apple. The group in question is called the App Association and its publicly stated goal is to give a voice to small technology companies trying to break into the crowded app in IOT space. But the issue is that because they get so much of their funding from Apple much of their lobbying is focused on, you guessed it, trying to shoot down bills that Apple doesn't like. Including a pair of proposed laws that would have loosened Apple's stranglehold on how much independent developers have to pay Apple to be listed on the app store. The App Association has already denied that it's just a front for Apple, but unsurprisingly some industry observers are already pressing X to doubt on their iPads. There's no X button on the iPad. Unless someone's using the touch controls, you don't do that. Now, it's time for Quick Bits brought to you by Vessi Footwear, who hates wet socks as much as you do. Man, now that's a relatable brand. Well say goodbye to squelchy socks with Vessi's lightweight, breathable and water resistant shoes. Their diamond text material not only keeps your feet dry, but keeps them warm in the winter, and cool in summer. Comfort is at the forefront with their stretchy design, and so is responsibility. Vessi makes cruelty free products right down to the glue! Their shoes are 100% vegan. Give yourself a little treat. Click the link below and use code techlinked to save 25 bucks today. Quick Bits? (gasps) Oh my God! If you're unsatisfied because your phone is insufficiently chunky. It's my daily life, daily experience. ASUS has the product for you. The new ROG Phone 6D Ultimate, wow- - [Co-host] 60 pounds! (laughs) - 60 fps. Not enough. Has what the company calls an arrow active portal, which is designed for use with a bundled cooler. Basically a fan shoves lots of air through the portal and onto internal cooling fins, kind of like how a desktop CPU air cooler works. Testing indicates that the system does result in a drop of a few degrees Celsius, but really you can't quantify this kind of cool. But here's a problem more of you probably face, waiting in a long checkout line at the grocery store. Well, Instacart thinks it has a solution, as it's rolling out a system that allows you to scan items at the store as you grab them, and pay from the app. They're also releasing a lightweight, smart shopping cart that can auto detect items and check them off your shopping list. - [Co-host] They don't wanna hire people. - We don't like people. You'll have to sign in through Facebook and allow the cart to access your call logs and browsing history, but hey, it could be cool. - [Co-host] And location. - And location, and your... postal code. Cyberpunk 2077 is once again atop the Steam charts. And while a lot of the infamous bugs the game originally shipped with have been addressed, it looks like the actual reason for the recent surge in popularity is the anime spinoff, Cyberpunk: Edgerunners, that's now out on Netflix. - [Co-host] That was my name in college. - The anime has been well received, which might be because it runs at a consistent frame rate and doesn't regularly depict its characters glitching through cars, but it could also be a good show, I don't know. You may have thought that Kiwi Farms had gotten lumber jacked right off of the internet, but it turns out they found another content delivery provider and got hacked. A site admin said that there was a security breach and all users may have had their login credentials and IP addresses compromised. - [Co-host] Sorry. - Obviously we don't condone doxing but it's hard to feel terribly bad for these users getting a little taste of their own medicine, huh? Maybe harassing people is wrong. And Boom supersonic is pushing ahead with plans for its faster-than-sound airliner, even though basically every major aircraft engine manufacturer is uninterested in working with it. - [Co-host] You don't need noise canceling headphones on those things. - With the airline industry squarely focused on fuel emissions, the engine companies don't think a supersonic model is a good business decision, but despite this, Boom has said they do in fact have an engine partner they'll reveal later this year. Re... they're working on it. Hopefully this is true as both American Airlines and United Airlines have a combined 35 planes on order from Boom and I'd hate for a cost overrun to end up being an excuse for them to charge me even more for a checked bag, before my plane disintegrates at Mach 3. - [Co-host] Only billionaires are invited to Riley. - And I'd hate for you to miss any more tech news, so come back on Wednesday, when we valiantly reclaim our set. - It calls to me, this injustice will not stand! - [Co-host] As a truck drives by.",
    "transcript_keywords": [
        "Litus can vlog",
        "vlog a poly",
        "poly pocket",
        "Apple",
        "GTA",
        "sad",
        "app",
        "feel sad",
        "Litus",
        "GTA VII",
        "App Association",
        "set so Litus",
        "premier tech",
        "game",
        "Assassins Creeding",
        "Rockstar",
        "tech",
        "content",
        "companies",
        "tech companies"
    ],
    "transcript_entity_values": [
        "Sega Genesis",
        "iPad",
        "25 bucks",
        "GTA VI",
        "100%",
        "Kiwi Farms",
        "the weekend",
        "GTA",
        "Slack",
        "the App Association",
        "US",
        "60",
        "Texas",
        "Riley",
        "Boom",
        "American Airlines",
        "nearly 100",
        "another couple years",
        "a meter",
        "Vessi Footwear",
        "over half",
        "later this year",
        "United Airlines",
        "summer",
        "ROG Phone 6D Ultimate",
        "TechLinked",
        "the US Supreme Court",
        "today",
        "2077",
        "35",
        "Quick Bits",
        "Over half",
        "Litus",
        "daily",
        "first",
        "60 pounds",
        "Instacart",
        "Netflix",
        "The App Association",
        "Facebook",
        "the First Amendment's",
        "a few degrees Celsius",
        "IOT",
        "Mach 3",
        "Wednesday",
        "iPads",
        "the winter",
        "CPU",
        "Rockstar",
        "YouTube",
        "ASUS",
        "Apple",
        "Vessi"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "LAW",
        "QUANTITY",
        "NORP",
        "FAC",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON"
    ]
}