{
    "id": "G6DV5lHjDws",
    "title": "Osmo Action hands-on: GoPro should be worried",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-05-15T13:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=G6DV5lHjDws",
    "category": "Science & Technology",
    "tags": [
        "osmo action",
        "dji osmo action",
        "dji",
        "dji action camera",
        "action camera",
        "action camera 2019",
        "gopro",
        "gopro hero",
        "hero7",
        "dji oslo",
        "gopro hero7",
        "gopro hero 7",
        "gopro hero 7 black",
        "hero 7 black",
        "dji vs gopro",
        "hero 7",
        "dji osmo action camera",
        "Oslo",
        "osmo pocket",
        "dji 2019",
        "action cam",
        "dji action",
        "hero 7 back",
        "dji camera",
        "camera",
        "dji event",
        "new camera",
        "action",
        "review",
        "hands on",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 380219,
    "likes": 7462,
    "comments_count": 669,
    "description": "DJIs Osmo Action is the companys first action camera. Its a direct competitor to GoPros Hero 7 Black, matching it on almost every spec while also offering a few unique features  like a front-facing selfie screen. It costs $349 and is available now. So GoPros reign as champ...might be coming to an end.   Learn more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2LK3AQ2",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "I'm going to fucking do it! I'm just going to fucking do it! It was freezing, yeah. DJI has successfully put cameras in the sky and pockets of everyone from professionals to amateurs. And now they're looking to enter your bike frame, or maybe your car hood, with the Osmo Action. (upbeat music) It's building on the many small, successful, super stable cameras DJI is known for, but in the form of an action camera. Before we dive in and swim around some more, the model I'm using is final hardware, but it's prerelease software. So think of this more as an extended hands-on, rather than a full-fledged review. So the Osmo Action: it looks and feels very familiar, down to the two prongs of its housing. It weighs about 0.3 pounds. It's shockproof, dustproof, and waterproof up to 11 meters. There's a double locking battery compartment on the bottom and a single locking USB-C and microSD card slot on one side. A record and power button sits on top, while a QS button, or Quick Selection button, for switching between camera modes, is on the side. It feels super rugged and solid. And it even has a screwable lens cover and a front-facing screen. With the cover, you can easily and securely put on ND filters, which is great for filming on a bright, sunny day, especially if you're going to be bouncing in and out of water. You don't want your ND falling off. Now, the front-facing screen was even more helpful than I thought. And you can switch between it by double-tapping with two fingers on the back screen. With this front-facing screen, it makes it super easy to set up a shot of yourself without having to use an app. Or while you're riding, you can quickly look down and make sure you still look like the damn champion that you are, riding a Citi Bike. It's amazing, and you're going to love it. Just try not to look down at yourself too much. Now, internally, you have a 12-megapixel camera, capable of 4K 60 fps video at 100 Mbps. Or 240 fps video at 1080. The photos are clean in good lighting conditions and with the graininess you would expect out of such a small sensor in lower light. The warp in 16 x 9 photos is very alive and well. But with a 145-degree angle lens, I really wouldn't expect anything different. Now, the shutter button is extremely responsive, with no noticeable lag at all. But where this camera excels is stabilized video. Or what DJI is calling RockSteady. It's their attempt at in-body stabilization, and it puts the Osmo Action in direct competition with the GoPro Hero 7, which introduced its HyperSmooth feature last fall. Much like HyperSmooth, RockSteady is just impressive. You can run, you can jump, you can skate, and the footage just comes out super smooth, with the teeniest, tiniest crop, which it does a bit more than GoPro's HyperSmooth. But the feature, at large, is incredible, and I think anyone coming from anything other than a GoPro Hero 7 will just be super happy to have it, especially without the hassle of having to have a gimbal. Now, where I do think the GoPro has a bit of an edge is the auto-exposure. When you look at the footage side by side, and quickly the light changes, the GoPro just adjusts to that higher, brighter light a teeny bit faster. I've used a whole bunch of cameras, and one of my favorite things to do when I get a new camera is to check out its menu system. It's something that all users will inevitably face at one point or another. And I got to hand it to DJI: they kind of nailed it. It's really intuitive and easy to use. Swiping in any direction on the main screen will lead to camera and video settings, playback, or the main menu, which consists of eight icons to get you started. Most of them are single actions, such as the sun icon leading you to brightness controls. While others, like the screw, brings you into a longer, scrollable menu for the nitty-gritty controls, such as voice commands. The touchscreen is super responsive, and I was actually really surprised at how fast clips played back on the camera itself. That was fucking nuts, man. I would need a bit more time to know for sure how the battery life is, but, in my use, it's been pretty good and extremely comparable to the Hero 7. Yes, the compartment gets a little bit warm when you're continuously recording, but it doesn't get so warm that I wouldn't mount it to my body. Woo! Yeah! One more note on this prerelease software: when shooting video, the lag of the screen is almost dizzying. And it makes me wonder if DJI is going to be able to fix this before this camera hits store shelves. Now, software in such a small body and such high resolution is a really difficult problem. So time will tell. GoPro put action cameras into the hands of many. And they were the first to do it, and they broke all the ice, made many mistakes, and lots of versions of one product. But it allowed newcomers, like DJI, to come into the game late and jump up to that high pedestal that GoPro worked so hard to build. Look at the footage of the Osmo Action versus the GoPro Hero 7. You almost can't tell them apart. I mean, even down to the mounting systems that these cameras use, which is a super clever move by DJI, considering that GoPro accessories exist almost everywhere in the world. And there's one for anything you could want to mount this camera to. So, as a consumer, it might come down to the price. And at $349, the Osmo Action is just a little bit cheaper than the GoPro Hero 7. Or it might come down to the brand. If you already own DJI products, you're going to feel really comfortable picking up an Osmo-branded gadget. And that slightly cartoonish, low-key awful sound that DJI products make? Well, the Osmo Action has them, too, and you're going to feel right at home using it. I do have a quick question: I see a lot of people using GoPros in Times Square or just on selfie sticks. What are you guys using action cameras for? Are people still mounting these to surfboards, or have they just become small cameras you can take everywhere? Let me know in the comments, and we'll see you next time.",
    "transcript_keywords": [
        "Osmo Action",
        "DJI",
        "Action",
        "GoPro Hero",
        "GoPro",
        "camera",
        "Osmo",
        "cameras",
        "action cameras",
        "Hero",
        "super",
        "screen",
        "put action cameras",
        "bit",
        "GoPro put action",
        "fucking",
        "DJI products",
        "video",
        "cameras DJI",
        "Osmo Action versus"
    ],
    "transcript_entity_values": [
        "about 0.3 pounds",
        "GoPros",
        "one",
        "GoPro",
        "RockSteady",
        "HyperSmooth",
        "16 x 9",
        "microSD",
        "Times Square",
        "last fall",
        "1080",
        "eight",
        "GoPro",
        "12-megapixel",
        "Osmo",
        "DJI",
        "100 Mbps",
        "the Hero 7",
        "the Osmo Action",
        "ND",
        "349",
        "QS",
        "two",
        "One",
        "sunny day",
        "4",
        "USB-C",
        "11 meters",
        "Quick Selection",
        "240",
        "first",
        "145-degree",
        "up to"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "EVENT",
        "LAW",
        "GPE",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY"
    ]
}