{
    "id": "g6ZmlqZaNoM",
    "title": "Matrix PowerWatch 2 Review: You Are The Battery",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-06-26T23:03:10Z",
    "video_url": "https://www.youtube.com/watch?v=g6ZmlqZaNoM",
    "category": "Science & Technology",
    "tags": [
        "matrix powerwatch review",
        "matrix powerwatch 2 luxe review",
        "solar smartwatch",
        "solar powered watch",
        "thermoelectric watch",
        "never charge watch",
        "thermoelectric power"
    ],
    "views": 433792,
    "likes": 15840,
    "comments_count": 906,
    "description": "I started wearing the Matrix PowerWatch 2 one week ago today, haven't taken it off since  and its power meter still reads 100 percent. How? Because as it turns out, MrMobile is a battery! And you know what? You are too.   Join me for a video covering the best smartwatch of 2020  at least, when it comes to staying power and technological innovation. As for the rest of the Matrix PowerWatch 2s feature set? Well  thermoelectric power generation might be tough, but making a smartwatch that works well? That's even tougher. Its MrMobile's Matrix PowerWatch 2 review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S MATRIX POWERWATCH 2 REVIEW]  MrMobile's Matrix PowerWatch 2 Review was produced following seven days with a Matrix PowerWatch 2 Luxe review sample provided by Matrix Industries. The device was paired with a Samsung Galaxy Fold and running software version v2.5.6r0. Production sample running release software.   MrMobile does not produce reviews sponsored by the subjects of those reviews. Neither Matrix Industries nor any other company paid a fee or otherwise offered compensation in exchange for this coverage.   [PRODUCTS IN THIS VIDEO]  Matrix PowerWatch 2 [Matrix Industries]:    [LINKS]  Thermoelectricity, Seebeck and Peltier Effect. Electricity Generation from Heat [Ludic Science]:   PowerWatch 2 Experience [Reddit]:   Thermoelectric Effect / Seebeck Effect [Wikipedia]:   Matrix PowerWatch 2 uses solar, heat to power GPS, heart rate at CES 2019 [Cnet]:   Stay Cool: High-Tech Ways To Beat The Heat [MrMobile]:   Matrix PowerWatch 2: The Most Powerful Watch In The World [Matrix Industries]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #matrixpowerwatch2 #powerwatch2 #powerwatch #matrix #smartwatch #thermoelectric #solar",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1RN",
        "https://www.youtube.com/watch?v=Mki_dJLoDZw",
        "https://www.reddit.com/r/PowerWatch/comments/gylyer/powerwatch_2_experience/",
        "https://en.wikipedia.org/wiki/Thermoelectric_effect#Seebeck_effect",
        "https://www.cnet.com/news/solar-and-heat-powered-matrix-powerwatch-2-can-run-a-marathon-with-gps-and-heart-rate/",
        "https://www.youtube.com/watch?v=X2nTtGHjaiQ",
        "https://www.youtube.com/watch?v=8K5i2pVKBEA",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "(upbeat music) - Seven days. That's how long ago I first strapped on the \"Matrix PowerWatch 2\". And today, the power meter still reads 100%. How? Well because at it turns out I am a battery. And you know what? You are too. (upbeat music) Okay, to phrase it more accurately, humans aren't necessarily batteries. At least not until the machines take over. But we are great sources of heat. And within the difference between our hot bodies and the cooler outside air, is the potential to generate power. Maybe you remember a review I ran last year featuring a personal cooling bracelet called the \"Ember Wave\". That device used battery power to essentially turn itself into an ice cube on your wrist. By harnessing something called the Peltier effect. Well watch what happens when YouTube Channel LudicScience takes a similar Peltier unit and puts his hand on it. The difference between his warm skin and the ambient temperature, generates electric current. That's called the Seebeck effect. And it's how the PowerWatch 2 recharges its own battery. See the aluminum back plate of the watch is the hot side and the cold side is the metal bezel and the rest of the casing. The greater the temperature difference between your skin and the outside air, the more current the watch can put back into itself. Watch the charging meter on the perimeter of this watch face peter off from max to zero when I take it off and put it on the cool surface of my dining room table. But maybe you already see the problem. In the summer, sometimes there's not much difference between your body temperature and the surrounding air. And above 90 degrees fahrenheit, about 32 degrees celsius, the thermo-electric generator doesn't produce enough current to charge the battery at all. Well, that's where the PowerWatch 2 takes a page out of Len's book. This bezel, beneath the sapphire cover glass, it's actually an annular solar cell and it's much more efficient than the thermo-electric generator at putting power back into the battery. During my time with the watch here in June. Far and away, the most power generated on a given day has been from solar. Now, I imagine if it were the dead of February these figures could well be reversed. But the bottom line is, until I started filming with it and leaving the watch off my wrist a lot I never saw a power level below 100%. And it's been seven days since I first put it on. This watch literally comes with a charger and it's FAQ's says you probably never have to use it. In an era where Apple adds sleep tracking to the Apple Watch, but hastily adds that you'll have to charge it the morning after, this is incredible. And it's why I've wanted to cover the PowerWatch 2 for months. Even though it was first announced a long time ago. Of course something that lasts forever is only good if you enjoy it. Like my marriage. Folks, and here's where the PowerWatch 2 still needs a lot of work. While it delivers on the fundamentals of a timepiece, with the watch face visible in all conditions. Backlight, step-tracking and all that, it's a pretty weak smart watch. It has the trappings of one. It'll connect to your phone via Blutooth and buzz your wrist for notifications. You can use GPS to track workouts and it's got a heart rate sensor that can feed data to Google Fit or Strava to help you with your health, yes. For a grown-at-home smartwatch platform it's got surprisingly robust functionality. But just like in that other Matrix, there are glitches. About once a day, I'll realize \"Hey, I haven't gotten a wrist buzz in a while.\". Turns out I was still getting emails and texts but my watch had just lost the Bluetooth connection to my phone. No notification, no alert, no buzz, just drops offline and never reconnects. I had to go to the Matrix discord channel to learn that I had to toggle Bluetooth and restart the watch to fix that bug. I assume that this is what Matrix is referring to in it's FAQ when it says you should sync regularly in order to avoid slow syncing. (soft music) Other bugs are easier to live with. Just by virtue of the fact that Matrix knows about them and says it's actively working on them. The lack of milliseconds on the stopwatch, the occasional nonsense notifications with corrupted unicode, the lack of customizable watch face, take your pick. They're all over the discord. You know the company is on top of it's communication. It hosts \"Ask Me Anything\" sessions once every month or once every couple months. And it keeps people informed about forthcoming features and software updates. It would all be so much easier to live with if the watch had just come out. But these are the kind of bugs you expect from an early BETA product, not one first announced in January 2019. Of course Matrix didn't get into this business to make the world's next great smartwatch. It's business is thermo-electric power generation. This is a convenient platform to demo that. Honestly, even with all the bugs, I almost wanna keep wearing it, just cause it's so incredible not to worry about charging my smartwatch. This is the kind of technological achievement that can even make you forgive a watch that on your wrist is the size of a water main pipe flange but at a price that starts at $499 and goes all the way up to $699 for the top shelf Luxe trim here, well, as fun as it can be to beta test space-age technology, I typically prefer not to pay for the privilege. Now that's unless of course, you're talking about folding phones. We all draw our own lines at different places. Check out my recurring series called \"Into the Fold\" where I explore that delightfully strange world of folding screens. And if you decide you do want to join the small but vibrant community of PowerWatch 2 owners, I'll drop a link to purchase below. As always, Mr. Mobile works for you and not the manufacturers, folks. Matrix was given no copy approval or editorial input into this review video. They're seeing it for the first time, right along side you. Please subscribe to theMrMobile on YouTube if that's the kind of video you'd like to see more of. Till next time, thanks for watching and if you can't stay home, then stay safe and keep wearing those masks while you stay mobile my friends.",
    "transcript_keywords": [
        "watch",
        "Matrix",
        "watch face",
        "power",
        "PowerWatch",
        "battery",
        "wrist",
        "called",
        "difference",
        "Apple Watch",
        "Matrix PowerWatch",
        "time",
        "put",
        "Matrix discord channel",
        "air",
        "bugs",
        "temperature",
        "back",
        "current",
        "thermoelectric"
    ],
    "transcript_entity_values": [
        "the summer",
        "seven days",
        "every couple months",
        "about 32 degrees celsius",
        "the morning",
        "June",
        "the Apple Watch",
        "Strava",
        "Peltier",
        "up to $699",
        "peter",
        "Apple",
        "months",
        "90 degrees fahrenheit",
        "last year",
        "YouTube",
        "Len",
        "January 2019",
        "Mobile",
        "Seebeck",
        "today",
        "first",
        "Seven days",
        "a given day",
        "Google",
        "the \"Matrix PowerWatch 2",
        "Blutooth",
        "Into the Fold",
        "100%",
        "YouTube Channel LudicScience",
        "the \"Ember Wave",
        "499",
        "Luxe",
        "FAQ",
        "PowerWatch 2",
        "February",
        "Matrix",
        "one",
        "Peltier"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "MONEY",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "LAW",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}