{
    "id": "G8J7lCAs38w",
    "title": "Redmi Note 7 Durability Test - It almost survived...",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2019-02-27T08:50:31Z",
    "video_url": "https://www.youtube.com/watch?v=G8J7lCAs38w",
    "category": "Howto & Style",
    "tags": [
        "Redmi Note 7",
        "Redmi",
        "Xiaomi",
        "Redmi note 7 unboxing",
        "Redmi note 7 review",
        "Redmi note 7 bend",
        "redmi note 7 durability",
        "Redmi note 7 pro",
        "Bend test",
        "bend test fail",
        "Mi",
        "best budget phone",
        "android",
        "iphone",
        "smartphone"
    ],
    "views": 8631940,
    "likes": 158149,
    "comments_count": 16903,
    "description": "The Redmi Note 7 is one of the best budget phones you can buy. Powerful specs, Tons of features, and... a plastic frame. Will the Redmi Note 7 survive every day use? Yes. Will the Redmi Note 7 Survive extreme abuse? No. Most phones do survive my tests. The Redmi Note 7 did not. It took 3 strong bends. But the phone did give up the ghost when the screen cracked. The front glass however, did not break. Just the LCD under the glass. Interesting.   Would a plastic phone frame make you nervous?   *Follow me for updates!* Instagram:  Facebook:  Twitter:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:    TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "The Redmi Note 7 is made by Xiaomi, one of the largest smartphone manufacturers in the world. Xiaomi's Redmi line of phones is the cheaper, more budget lineup. And it has not always survived my durability tests. The Redmi Note 3 failed catastrophically, but the Note 5, with it's metal back, survived just fine. Today we're here with the Redmi Note 7 to see how well Xiaomi's newest phone holds up under a bit of pressure. Let's get started. [Intro] The Redmi Note 7 has the teardrop camera notch up at the top, and a dual iPhone-style camera setup on the pink psychedelic back. This thing looks pretty awesome. Kind of like spotlights shining up into the sky after a nuclear apocalypse. Starting with the scratch test. I have a set of Mohs mineral picks that tell me what the screen is made from. Lately, even with budget phones, they've been using glass and Xiaomi is bragging about Gorilla Glass 5 on this model, which is good. With no scratches showing up before a level 6, and deeper grooves at a level 7, this inexpensive smartphone is holding it's own so far. The teardrop notch holds a 13 megapixel selfie camera right below the large plastic speaker grill. The grill is sitting pretty tight between the glass and the frame, but with a little persuasion, it can come out of it's hole. Not a deal breaker of course, but just something worth knowing. All things fall apart with time, and some just quicker than others, which is why we're here checking smartphone build quality in the first place. Something interesting with the Redmi Note 7 is that the dual SIM card tray is made from plastic. Normally, we would expect metal here. Also surprising is the water resistant ring around the SIM card opening. It snapped when I pulled out the tray. Yeah the tray holds the SD and SIM card, but I'm not overly impressed with the materials so far. It looks like plastic is the theme of the Redmi Note 7 this time around, with the entire side panel made from painted plastic. Plastic is not a bad thing of course, it's softer than metal, but also much cheaper to manufacture. And low cost is definitely what Xiaomi is after in this line of phones. The bottom of the phone is also plastic, right next to the USB-C port. And everything over here along the right side including the power and volume rocker is all made from plastic. Budget phones are a great thing, especially ones with features. And the Redmi Note 7 comes with a headphone jack and IR blaster. It's funny how the inexpensive phones these days are including more features than the major flagships. The back panel is made from glass, protecting the Redmi logos. I'll make my way up to the fingerprint scanner, and surprisingly, the fingerprint scanner is invincible. Zero scratches on the surface thumbs up for that. Cameras are important on any smartphone. The flash is protected under the rear glass, and the dual cameras include a 48 megapixel main camera with a 5 megapixel depth sensor, both protected with glass and unaffected by my razor. While this phone is an inexpensive budget phone, usually costing around $200 or so, it's using a large 6.3 inch IPS display that's both larger and more pixel dense than Apple's budget iPhone XR. The XR is using the same LCD technology but costs 4 times as much, and the iPhone has 83 less pixels per inch, that's embarrassing. The Redmi Note 7 lasted 9 seconds with the burn test, but then it completely recovered with all it's pixels turning back on after heat was removed. The ultimate test of structural durability is the bend test. With the plastic frame of the Redmi Note 7, I have my doubts about it's strength. The first bend shows some massive flex on both the frame and the screen, but no shattering, cracking, or breaking. I do always bend the phones from both sides though, and with the reverse flex we get 2 cracks in the plastic frame, one next to the power button and one along the SIM card tray. The phone is still alive not too shabby. The Note 7 can definitely handle some abuse and still keep kicking. One last bend for the road. And without the structural support on both cracked side rails, the screen is unable to survive. The LCD cracks underneath the glass surface, rendering the display useless, and the touch sensitivity completely. It's not a good day for the Redmi Note 7. This is not the first Xiaomi phone to fail my durability test. This Note 7 will join the Note 3 and the Mi 5 on my Shelf of Shame. It did put up a good fight though. And with the extremely fair price point it has, I won't be dragging it through the mud. But we still should figure out why it broke...and for those secrets, we have to go inside. The back panel is built like most glass backed phones. A little bit of adhesive holding onto the outside of the plastic frame. Honestly, with how cool this cracked glass looks though, I don't think I would even mind much having a cracked phone. Inside we can see the large 4000 milliamp hour battery. And if we look closely we can see where the breaking points are along each side of the frame. Here at this SIM card tray, and over here at the power button. Holes and buttons in the frame are definite weak points as we learned with the iPad Pro. Looking closer at the frame we can see that it's not entirely made from plastic. The plastic is molded into a cheap porous metal with little dovetail joints. But the weak spot in the power button in the frame has no metal supports behind it. And the metal over here in the SIM card tray has just chipped it's brutal self clean out of the frame. Xiaomi was able to keep the Redmi Note 7 price low by using more plastic instead of metal, which looks cool, but unfortunately allowed itself to flex into oblivion. It definitely looked beautiful while doing so though. Obviously, I just put this phone through a lot of abuse cuz that's what I do. Most phones end up surviving. In normal every day situations, with a good case on your phone, you won't have anything to worry about. But cellphones are the most abused pieces of technology on the planet, and it's good to know what to watch out for, and what your phone is made of before you buy it so you can be careful and protect it where it's needed. Huge thumbs up to Xiaomi for the solid specs and fair pricing though. Just next time we might need a bit more metal and structure inside. Hit that subscribe button if you haven't already, and come hang out with me on Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "Redmi Note",
        "Note",
        "Redmi",
        "SIM card tray",
        "SIM card",
        "plastic",
        "phone",
        "Xiaomi",
        "Xiaomi Redmi line",
        "phones",
        "frame",
        "Xiaomi Redmi",
        "glass",
        "SIM",
        "made",
        "plastic frame",
        "largest smartphone manufacturers",
        "metal",
        "card tray",
        "card"
    ],
    "transcript_entity_values": [
        "Zero",
        "4000 milliamp hour",
        "iPhone",
        "Xiaomi",
        "SD",
        "IR",
        "around $200",
        "jack",
        "Redmi",
        "6",
        "83",
        "the iPad Pro",
        "Twitter",
        "4",
        "SIM",
        "the Mi 5",
        "Redmi",
        "5 megapixel",
        "9 seconds",
        "Apple",
        "XR",
        "iPhone XR",
        "first",
        "Xiaomi",
        "LCD",
        "these days",
        "Today",
        "3",
        "One",
        "48 megapixel",
        "6.3 inch",
        "13",
        "one",
        "2"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "FAC",
        "ORG",
        "QUANTITY",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL"
    ]
}