{
    "id": "g8RvemwBQxg",
    "title": "Illegal iMac Knockoff: eOne Follow-up - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-01-26T16:59:42Z",
    "video_url": "https://www.youtube.com/watch?v=g8RvemwBQxg",
    "category": "Science & Technology",
    "tags": [
        "Illegal iMac Knockoff: eOne Follow-up - Krazy Ken’s Tech Talk",
        "Apple",
        "iMac",
        "iMac G3",
        "Steve Jobs",
        "eMachines",
        "eOne",
        "Mac OS",
        "Windows",
        "LGR",
        "eOne Mouse",
        "Apple Puck Mouse",
        "Bondi Blue iMac",
        "Blueberry iMac",
        "Celeron",
        "PowerPC",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer",
        "Computer Clan",
        "Lawsuit"
    ],
    "views": 114935,
    "likes": 5319,
    "comments_count": 234,
    "description": "You can support this channel on Patreon!   Watch part 1 first   A month ago, Krazy Ken showed off the eMachines eOne (which Apple sued them over) but there's more to talk about today  See more rare & retro tech   Watch my tech scam-busting episodes    Follow me on Twitter   Facebook   Shop for cool stuff on my store   Hey! I have a Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Special thanks to Moto M for the eOne mouse donation!  Download Computer Clan wallpapers    Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://Patreon.com/KrazyKen",
        "https://youtu.be/nWnSqJTnpWk",
        "https://youtube.com/playlist?list=PLFWeyvvxf1rj0b0ROShJvi0E60KAyiwbn",
        "https://bit.ly/clan3o1EdZ2",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/wallpapers",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- A month ago, I released an episode about the eMachines eOne, and yeah, Apple sued them. But since then, I've gathered some new information I wanna share with you, and I found the elusive mouse. (upbeat electronic music) Hey everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and thanks to everyone who watched my original eOne episode. But I'm not done yet. I have three more topics I'd like to talk about with you and we'll start with the spec comparison. In the original episode, I compared the eOne specs and design to the first gen revision A iMac, which shipped in August, 1998. However, Apple revised the iMac several times before this thing launched in August, 1999. So I'd like to revise my comparison because there's one factor that might have affected the lawsuit, which we'll talk about in a sec. The first-gen iMac featured 32 megabytes of RAM, a 4 gigabyte hard drive, and a 233 megahertz PowerPC G3 processor for $1,299. And the eOne featured 64 megabytes of RAM, a 6.4 gigabyte hard drive, and a 433 megahertz Celeron processor, for $799 before rebates. However, to make the comparison more fair, I should reference Apple's revision D iMac, which was released in April, 1999. It featured the same 32 megabytes of RAM, but the hard drive was upgraded to 6 gigabytes and the processor was upgraded to a 333 megahertz G3, and the price was dropped down to $1,199. So those are the, I guess you could call them more accurate specs that were available at the time shortly before the eOne launched. But there's one more thing... and that leads us to the design comparison. And I might sound a little bit picky here, but in a lawsuit, you kind of have to be picky. Aside from the new color choices, much of the iMac's visual design remained the same from revision A to revision D. The two noticeable differences are the removal of the accent color on the door and the infrared port has also been removed. But the Blueberry iMac is where we need to focus today. So I recently obtained one so we can get scientific. And yeah, something is wet on the inside. There's brown liquid everywhere, juicy. Thankfully, we don't actually need the product to work. We just need to look at the case. Anyway, when I compared the colors in the original episode, you can see the original Bondi Blue iMac is a little more green than the eOne's color. But I think we should ignore the Bondi Blue color, because the Blueberry color is actually what was available around the time of the eOne's launch. So I re-photographed the Bondi Blue iMac and the eOne, and I took an additional photo of my newly-acquired Blueberry iMac, all with the same lighting and camera settings. And we can see the eOne's color is nearly identical to the Blueberry iMac color, even more similar than the original Bondi Blue. But if we examine a small portion of these colors, we can actually notice a subtle difference. The eOne's blue look slightly more saturated, but in the end, that still wasn't enough to convince the courts. Now this begs the question, which iMac color, if any, did eMachines use for inspiration? I can't find the official records on this case, at least not yet, so I can't say with 100% certainty. And let's not forget, manufacturing lead time also plays a factor. This thing might have been sent off to manufacturing before the Blueberry iMac even existed. All that technical stuff aside, I believe most of us, if not all of us, can agree the color eMachines chose was too similar to the iMac. At least in this situation, the legal system agrees. And that brings us to the eOne mouse. This little bugger was hard to find. When I purchased my eOne, the mouse was not included, much like LGR's situation. So instead, I bought a Kensington mouse in a box, which has a similar aesthetic to Apple's iMac. But I craved more. I wanted the original eOne mouse. While I was working on the last episode, a generous donor contacted me on Twitter and offered his mouse to me. But in the middle of the conversation spanning several days, his Twitter vanished. I lost touch with him. But then another miracle happened. One of my generous patrons, Moto M, donated his eOne mouse to me. Pretty neat. The only downside is it's ball-less. But hey, beggars can't be choosers. This is totally okay. I have tons of balls I can shove into this mouse. Wow, don't repeat that in public. The eOne mouse design is more original and actually very different from Apple's. It's probably a good thing eMachines didn't borrow much inspiration from Apple's infamous \"puck mouse\" because, well, it's one of the most ridiculed mice in history. Its small circular shape made it kind of uncomfortable to hold. I mean, heck, Apple even discontinued it after only two years. - We got the coolest mouse on the planet right here. - But look on the bright side, you can add an iCatch to the mouse to make it more comfortable. Just do this. Now we're talking. Anyway, the eOne mouse's translucent white and blue is similar to Apple's, but everything else is different. The shape is an oval instead of a circle, and it's taller, giving the user a palm rest, and it connects to the computer via PS/2, not the newer USB standard. Also, it has a right click, unlike every Apple mouse until the Mighty Mouse in 2005. It also featured a scroll wheel, another handy feature that Apple didn't implement until again, 2005 for some reason. And the scroll wheel also functions as a center click. But I will say the click on the eOne mouse is just not as satisfying as the Apple mouse. The eOne mouse is just a little more resistive and gummy-feeling, but again, you get many more features with this mouse compared to this thing. But here's a bonus thing. The original seller also gave me this off-brand mouse. Seriously, I can't find a brand name on this thing anywhere. It just says mouse. I love the colors of it and it matches the eOne style really well, and I think it's more comfortable to hold, and the click is way more satisfying. However, you do miss out on the scroll wheel with this product. But check out that blue PS/2 cable. Delicious. And with this, my eOne setup is now complete, except for the missing panel that's supposed to cover the media control. Some stuff just breaks off and disappears into the ether. And thanks again, Moto M, for this awesome donation. And speaking of generous donations, I just wanted to take a quick moment to talk about my Patreon instead of having a sponsorship in today's episode. If you'd like to support my show, you get some awesome rewards in return. You'll get your name in the credits, plus access to all of my exclusive wallpaper downloads, early ad-free access to episodes, and exclusive videos that the public doesn't get, including my new Krazy Ken Aftershow. So please consider pledging today on Patreon.com/KrazyKen to get all of that awesome stuff. Your support is greatly appreciated, so thank you very much. And as always, I'm cooking up some great stuff so stay tuned. Catch the crazy and pass it on. (energetic electronic music) - Dad, what was it like back in the day? - Son, back in the day, we had some balls. - Gross.",
    "transcript_keywords": [
        "eOne mouse",
        "mouse",
        "eOne",
        "Bondi Blue iMac",
        "Apple",
        "iMac",
        "Blueberry iMac",
        "Bondi Blue",
        "original Bondi Blue",
        "Apple mouse",
        "original eOne mouse",
        "color",
        "Blueberry iMac color",
        "Blue",
        "Bondi Blue color",
        "eOne color",
        "original",
        "eOne mouse design",
        "Blue iMac",
        "Blueberry"
    ],
    "transcript_entity_values": [
        "USB",
        "April, 1999",
        "A month ago",
        "Bondi Blue",
        "6.4 gigabyte",
        "333 megahertz",
        "233 megahertz",
        "Moto M",
        "4 gigabyte",
        "32 megabytes",
        "2005",
        "D.",
        "two",
        "Apple",
        "blue PS/2",
        "August, 1998",
        "the Mighty Mouse",
        "Patreon.com/KrazyKen",
        "1,299",
        "Bondi Blue iMac",
        "Celeron",
        "D iMac",
        "eMachines",
        "Patreon",
        "the day",
        "today",
        "Krazy Ken",
        "only two years",
        "799",
        "6 gigabytes",
        "1,199",
        "August, 1999",
        "100%",
        "Blueberry",
        "first",
        "one",
        "RAM",
        "433 megahertz",
        "LGR",
        "several days",
        "the Blueberry iMac",
        "iMac",
        "eOne",
        "One",
        "G3",
        "Krazy Ken Aftershow",
        "iCatch",
        "Twitter",
        "64 megabytes",
        "sec",
        "three",
        "Blueberry iMac",
        "Kensington"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "NORP",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "PERCENT",
        "WORK_OF_ART",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "GPE"
    ]
}