{
    "id": "g9OGphrEMb0",
    "title": "Kali Linux: Hacking DHCP and MITM",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2019-11-14T20:16:07Z",
    "video_url": "https://www.youtube.com/watch?v=g9OGphrEMb0",
    "category": "Science & Technology",
    "tags": [
        "kali linux",
        "dhcp",
        "dhcp hack",
        "dhcp server",
        "kali linux tutorial",
        "kali linux install",
        "kali linux hacking tutorials playlist",
        "kali linux basics",
        "kali linux tutorial for beginners",
        "kali linux 2019",
        "kali linux 2020",
        "kali linux hacking tutorials",
        "ethical hacking",
        "ethical hacking tutorial",
        "ethical hacking free course",
        "ethical hacking course",
        "ccna",
        "ccna 200-301",
        "linux tutorial",
        "ceh",
        "oscp",
        "hacker",
        "hacking",
        "cisco training",
        "ine",
        "cbt nuggets",
        "ccna study",
        "kali",
        "yersinia",
        "whitehat",
        "linux"
    ],
    "views": 94063,
    "likes": 2293,
    "comments_count": 147,
    "description": "Learn how to hack DHCP with Kali Linux! Learn how to use Kali Linux to use a Denial of service attack (DOS) against a DHCP server; set up a rogue DHCP server on Kali Linux and then get hosts to send traffic via Kali Linux so you can use a man-in-the-middle (MITM) attack and capture packets and see usernames and passwords using Wireshark.  It's can be so easy to hack badly configured networks with Kali Linux! Make sure you have got your network configured securely. Otherwise, look how you can hack networks using Kali Linux running on a Windows 10 computer and applications like Yersinia! It's important that you as a network professional know how to protect networks from hackers. Even the new Cisco CCNA 200-301 exam covers some of these hacking topics. Don't just learn the theory of hacking, learn how to hack practically.   In this Ethical Hacking with Kali Linux playlist, I'm going to show you step by step how to hack and protect networks.  Menu: Overview: 0:00 Network Setup: 2:44 DHCP Denial of service attack: 7:18 Rogue DHCP Server: 10:14 Forward traffic via Kali: 14:14 Capture Passwords using Wireshark: 14:51  ====================== Referenced Videos: ====================== DHCP Basics:  EVE-NG:  GNS3:  Kali:   kali linux Hacking Ethical hacking  EVE-NG GNS3 VIRL Packet Tracer 10x Engineer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  LPIC 1  LPIC 2 Linux Professional Institute LX0-103 LX0-104  XK0-004   Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #kalilinux #ethicalhacking #hacker",
    "description_links": [
        "https://youtu.be/Dp2mFo3YSDY",
        "https://youtu.be/FDbgTlr-tnw",
        "https://youtu.be/Ibe3hgP8gCA",
        "https://youtu.be/K1bMSPje6pw"
    ],
    "transcript": "- If you don't configure your network properly, it's very easy for someone using Kali Linux or another type of hacking tool to exhaust the IP addresses in a DHCP pool, set up a rogue DHCP server and then allocate IP addresses to clients in a incorrect subnet and what I'm gonna show you in this video is how to do that but also show you how to setup the Kali Linux host as the default gateway so that traffic from PCs are sent via Kali Linux to the internet or to other devices in the network, so that we can implement a man in the middle attack. (rock music) DHCP or dynamic host configuration protocol is a fundamental building block in networks today. An administrator, which could be you, will configure a pool or scope, which is a range of IP addresses that are allocated to hosts in a specific subnet. Hosts will send a broadcast, typically to request an IP address from a DHCP server and the DHCP server will allocate the IP address to the client. Have a look at this video, which I've linked here and below if you wanna learn more about the fundamentals of DHCP. In that video, I show you how DHCP is configured, how IP addresses are allocated to clients, I show you through Wireshark captures how messages are sent from a client to a server and from a server to a client. Now, quick summary of what we gonna do in this video, we going to hack DHCP, we gonna exhaust a DHCP pool or DHCP scope, so that's the first attack. We gonna set up a rogue DHCP server to allocate IP addresses from a fake subnet, second attack. Third attack, we gonna set the default gateway of clients to Kali Linux, so when they get an IP address from the rogue subnet, they going to see their default gateway as the Kali Linux host and that allows us to implement a man in the middle attack, so four attacks right there. Then we'll use Wireshark to sniff passwords on the network. You need to be careful when you configure your network using protocols such as DHCP. Make sure that you configure your network securely and properly otherwise it's very easy to hack networks that run DHCP. Now, this is one of multiple videos where I'm showing you how to hack networks using Kali Linux. I don't just wanna show you how to break networks, I wanna show you how to protect networks and I'll show you how to do that in subsequent videos in this series. Now, if you enjoy this video, consider subscribing to my YouTube channel, please like the video and please click on the bell to get notifications when I post a new video. Okay, let's get started. In previous videos in the series, I showed you how to hack a physical Cisco switch but I'm traveling at the moment, so I don't wanna carry a whole bunch of equipment around with me, so what I've done is taken that switch, or logically taken that switch and put it into the cloud. In this example, I'm using EVE-NG and I've got a Cisco switch, as well as a Cisco router, I've got a Windows 10 computer, and I've got Kali Linux, these devices are connected to the internet. This network is running in the cloud but you could simulate this network on your laptop using GNS3, or EVE-NG, or Cisco VIRL. In this example, the switch is running a Cisco VIRL IOS image, the router is running a Cisco VIRL image as well. Have a look at my EVE-NG videos or my GNS3 videos, if you wanna learn more about how to virtualize networks on your laptop or how to virtualize them in the cloud. So let's start with the switch. Here's my console to the switch. Now, in this example, I'm currently in South Africa, so my connection may be a bit slow to the Northern Hemisphere, hopefully it won't affect this lab, but notice I've connected to a switch show version, shows me that this is a Cisco vIOS layer two switch running version 15.2. Now, don't worry too much about the details of the switch. This is a Cisco switch but any switch could be used in this typology. I'm also using a Cisco router but again, you could use any router here if you wanted to. So this Cisco router type show version is a Cisco IOS V router running version 15.6(1)T. The reason I'm using a router here is I wanna setup this router as a DHCP server. So if I type show run, that shows me the running configuration of this device. And what I wanna point out here is I've configured a DHCP pool. A DHCP pool in Cisco terminology is very similar to a scope, so it's a range of IP addresses that we gonna allocate it to clients in our network. The subnet that's gonna be allocated is 10.1.1.0/24. So /24 mask is being used. This is the default gateway, that is the IP address of the router. I've set in the dns server to Google. Scrolling down, notice this is the IP address of the Cisco router. At the moment this device has its interface shut down, so what I'll do is no shut, that basically enables it, I'll also enable the connection to the internet going back to my typology, this interface on the router connects me to my internal network, this interface connects me to the internet. So I'll type end here, show IP interface brief. This is the IP address on the internal interface, interface is up up, that means that it's working, this interface is connected to the internet, it's using DHCP, so this router should be able to, as an example, ping google.com, which it can. And I'll save the configuration of the router. Now, again you don't have to use a Cisco switch or a Cisco router. The reason I wanna use a Cisco switch here is, Cisco switch, it supports something called DHCP snooping, which allows me to stop these kind of attacks in a network. I haven't configured anything on the switch at the moment but in subsequent videos I'll show you how to stop this attack. But I firstly wanna show you what's possible using Kali Linux. So I'll open up a console to Kali. I'm not gonna get into the debate about the correct way to pronounce Kali, different people pronounce it differently but for the moment that's the way I'm gonna pronounce it. Okay, so here's my Kali Linux host. Let's check if it got an IP address, it may not have got an IP address because the router's interface was shut down. I'll use more here rather than simply showing all the output and what you'll notice is this device has this IP address, 10.1.1.3. show ip dhcp bindings on the Cisco router. We can see that this IP address has been allocated to this Mac address. This command, show ip dhcp binding, basically shows us which IP addresses have been allocated to which Mac addresses. So this is the Mac address that Kali is supposedly using 5001.0002.0000 and back in Kali we can see that is the Mac address of this ethernet interface. Okay, so what I'm gonna do now is start yersinia using a graphical user interface. In a previous video, which I've linked here, I showed you how to install this on Kali Linux. I also showed you how to implement or use layer two attacks using yersinia, but in this example I'm gonna show you how to use this for DHCP attacks. Okay, we're told that this is an alpha version, that's okay, so I'm gonna click okay and I'm gonna go to DHCP. We can see some options here but what I wanna do is launch a DHCP attack, so click launch attack and we going to send discover packets using denial of service. Now, before I do that, on the router, show ip dhcp binding. We only have one IP address allocated to a client. Now, the reason why the Windows host hasn't got an IP address yet is it's currently off, I haven't started the Windows host at this point. So again, show ip dhcp binding on the Cisco router, only one IP address has been allocated. So in Kali, I'm gonna click okay to start a discover denial of service attack. And what you'll see is a whole bunch of DHCP messages are being sent into the network, you can see this packet count is going up. On the Cisco router, show ip dhcp binding. What you'll notice is a whole bunch of IP addresses have now been allocated, so 10.1.1.1, 10.1.1.2, three, four, and it just carries on, basically Kali Linux has exhausted the DHCP pool on the Cisco router. And as I keep scrolling, what you'll notice is all addresses have been taken from this pool, there are no IP addresses left in this pool, show ip dhcp ? pool, let's press enter here, 253 addresses have been allocated from the pool. The reason why it's 253 is the router is using IP address 10.1.1.254. So this IP address shouldn't be allocated to clients because that's the IP address that the router is using. So again, show ip dhcp pool shows us that at this point we've successfully exhausted the DHCP pool on the DHCP server. No IP addresses are gonna be available for this Windows 10 client when we start it up. So I'll start that up and I'll open up a console to the Windows device. It'll take a while for this device to boot up but once it's booted up fully, we'll see that it won't get an IP address because we've exhausted the IP addresses in the DHCP pool. Now, a warning I will give you is a lot of packets are being sent into the network, that can cause all kinds of issues, so don't run this in a production network, be careful where you gonna run these attacks. Notice the number of DHCP discover messages being sent into the network. Okay, so my Windows PC is booted up. I'm gonna open up a command prompt and what I'll do is make this bigger so the font isn't so small. It's running really slowly here and that's probably because of the number of broadcasts being sent into the network. If I type ipconfig, notice no IP address has being allocated to this Windows PC. It's using the default 169.254 IP address range, ipconfig/renew. This device is not going to get an IP address because we've exhausted the DHCP pool on the DHCP server. But what we can do now is launch our second attack, so I'm gonna click launch attack and let's set up a DHCP rogue server. IP address is gonna be 10.1.1.3, that's the IP address of our Kali Linux server. I'm gonna allocate IP addresses in the range 10.1.1.100 to 10.1.1.150. I'll set the lease time to 3600 seconds, same for renew, subnet mask will be this. The default router is now gonna be Kali, it's not going to be the actual router in the network. DNS server, we'll set as Google and the domain name, you probably don't wanna use something like hacked.com, let's just specify, home.com and click okay. Okay, back on the Windows host, type ipconfig. Notice we've been given this IP address 10.1.1.100 and notice this default gateway is 10.1.1.3. That's a really important, the actual default gateway is 10.1.1.254. Kali Linux is using IP address 10.1.1.3. So ifconfig more, shows us that this is the IP address of the Kali Linux host. So the Windows computer is using Kali as it's default gateway. That's important because when the Windows host sends traffic to the internet, that traffic is gonna go via Kali to this router onto the internet. So as an example, the router has this loopback interface configured on it of 1.1.1.1, that's essentially a loopback or imaginary interface on the router that allows us to add a subnet to the router. The PC at the moment won't be able to ping that loopback address because the traffic is going through the network to Kali but Kali is not forwarding that traffic to the router. We need to type a command on the Kali Linux host to forward the traffic. So again, notice the pings are failing. So in Kali we gonna type sysctl - w net.ipv4.ip underscore forward equals one. Basically, we gonna allow the Linux host to forward traffic that's sent to it. So on the Windows PC, ping 1.1.1.1 now works, that traffic is going via the Kali Linux server. And we can see that by going to applications, sniffing and spoofing, wireshark. So wireshark will allow us to see the traffic being sent on the network. I'm gonna capture traffic on ethernet zero and I'll filter this for icmp traffic. So back on the Windows PC, if I ping 1.1.1.1, we can see that traffic from the PC to the router. We see a bunch of ICMP redirects but essentially the traffic is being sent through Kali to the router. We only see half the conversation but we can see the pings. And this is the important piece. Let's assume the administrator of the router did something very stupid and allowed Telnet connections. So on the Windows PC, I'm going to Telnet to the router to administer the router, we should actually be using SSH. So before I click okay, let's filter for Telnet in wireshark and I'll click open in PuTTY. Now, that font is very small but I'll enter the password and log in. So I've changed the font now. Basically, the router prompted for a password, which I entered and I'm now in what's called user mode, type enable, enter my password, and I'm in privilege mode. But notice in Kali now, I can see Telnet information including the password, here's the password, C-I-S-C-O, cisco. Now, that's not such an easy way to view it, so I'm gonna right click on a packet and click follow TCP Stream, and what you'll notice there, there's the first password, I typed enable, there's the second password, which is cisco. So I was able to see the password that was transmitted from the Windows host to the router because the traffic is being sent through the Kali Linux host to the router. So that is an example of the man in the middle attack. Now, on the PC I'll open up a web browser and what I'll do in Kali is specify http, so let's look at http traffic. You should be using https, most websites use https. But again, if I connect to the router and put in my username and my password using http and sign in, I can log in to the router and I'll be able to view information on the router, such as monitor the router by using commands on the router. So I could type, show ip interface brief, as an example and execute that command on the router using http. But back in Kali, you'll notice I'll be able to see all the http traffic from the PC to the router. And one of the things I wanna point out here is notice authorization, there are the credentials, username and password used to log in to the Cisco router. Again, that's a man in the middle attack, the PC is sending the traffic to its default gateway, which is the Kali Linux host, which is sending it to the router. But we could connect to the internet, so on the Windows PC, I'll open up another tab, most websites are now using encryption. One of them that's not, which is really bad is Oxford University, ox.ac.uk. That website is using http not https, notice it says, not secure in the output here, very bad. Your connection to this site is not secure, we've been told. So back in Kali we can see traffic sent from the Windows PC, 10.1.1.100 to 129.67.242.154, which is the Oxford University website. Now, at least here on their website, when you try and log in, so go to Oxford students as an example, they are now using encryption. So only part of their website is in clear text, we should be using https today but the point is, I can see part of their website through Kali Linux by using this man in the middle attack. You should always make sure that your traffic is encrypted and that you using a valid certificate, so it's really important that you verify that the certificate is a good certificate, that it's been issued correctly, that it's not a rogue certificate. So make sure that your traffic is encrypted, especially if you using wireless hotspots or open networks, make sure that the certificate is valid because the traffic could be going through a device such as Kali Linux. Don't just connect to any network, make sure that networks that you connect to are good. Make sure that you use a VPN or some kind of encryption mechanism so that your traffic is not sent in clear text. Now, hopefully you've learnt something, this has been quite a long video, quite a lot of things that I've shown you here. If you have, please would you subscribe to my YouTube channel, please would you like this video and please click on the bell to get notifications when I post a new video. I'm David Bombal and I wanna wish you all the very best. (rock music)",
    "transcript_keywords": [
        "Kali Linux",
        "Kali Linux host",
        "DHCP",
        "Kali",
        "Cisco router",
        "Cisco",
        "router",
        "Kali Linux server",
        "DHCP pool",
        "Linux",
        "DHCP server",
        "address",
        "Linux host",
        "Cisco switch",
        "Windows",
        "show",
        "traffic",
        "network",
        "Cisco VIRL",
        "Windows host"
    ],
    "transcript_entity_values": [
        "first",
        "Linux",
        "three",
        "129.67.242.154",
        "cisco",
        "SSH",
        "253",
        "half",
        "Cisco",
        "dns",
        "VPN",
        "One",
        "four",
        "two",
        "5001.0002.0000",
        "Wireshark",
        "3600 seconds",
        "Windows",
        "only one",
        "zero",
        "second",
        "South Africa",
        "10.1.1.0/24",
        "YouTube",
        "Google",
        "today",
        "the Northern Hemisphere",
        "IP",
        "ICMP",
        "Kali",
        "Mac",
        "10.1.1.1, 10.1.1.2",
        "one",
        "Stream",
        "15.2",
        "10.1.1.3",
        "GNS3",
        "firstly",
        "10.1.1.100",
        "Cisco",
        "Cisco",
        "Windows 10",
        "Third",
        "Kali Linux",
        "DNS",
        "Oxford",
        "Oxford University",
        "169.254 IP",
        "Windows",
        "DHCP",
        "David Bombal",
        "EVE-NG",
        "the Kali Linux",
        "Cisco IOS",
        "the Oxford University"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "LOC",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "GPE",
        "NORP",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}