{
    "id": "GAboygK-XhE",
    "title": "Dear MKBHD - Sandal \"Review\"",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-04-25T15:01:53Z",
    "video_url": "https://www.youtube.com/watch?v=GAboygK-XhE",
    "category": "Science & Technology",
    "tags": [
        "mkbhd",
        "marces brownle",
        "marques brownley",
        "marques brownlee",
        "shoe",
        "atmos shoe",
        "atoms 251",
        "mkbhd 351",
        "intel",
        "amd tehc",
        "shoe review",
        "reviwer",
        "tech shoe"
    ],
    "views": 2285676,
    "likes": 147915,
    "comments_count": 5860,
    "description": "Ugh. Dbrand.   You saw it all coming. We're an apparel/YouTuber merch channel now. I mean, if the shoe fits, we're gonna review it. MKBHD, you are our first victim. Bye AMD, Bye Intel, Bye Nvidia. It was fun. Now we do footwear reviews.  Buy Marques' Sandal:   Discuss on the forum:   Check out the top of the line shoe testing rig we specifically put together to benchmark the 251:  Buy a Gigabyte X570 Aero G Motherboard:  Buy an Intel Core i9-13900K CPU:  Buy Corsair Vengeance RGB 4600 MHz 16x2 DDR4 RAM:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:40 Meet the 251s 2:29 Labs Testing 5:13 Our superior Sandal 7:40 Outro  shoe.",
    "description_links": [
        "http://shortlinus.com/",
        "https://atoms.com/MKBHD",
        "https://linustechtips.com/topic/1502902-dear-mkbhd-you-tried-merch/",
        "https://geni.us/rEc8Kk",
        "https://geni.us/kAXZ",
        "https://geni.us/XkIR",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(gentle upbeat music) - Hey, what's up guys? Linus Tech Tips here. Footwear, love it or hate it, everyone's wearing it. Footwear has more daily active users than Facebook, Twitter, Reddit, and WeChat combined. So when a longtime rival gets to market before me, YouTube's foremost apparel salesman, you know that I'm gonna be first in line to check it out. So I've had these for about a week and I gotta say, Marques, you more than anyone know that it takes courage to change an industry. - Courage. - And I gotta respect bold design decisions. I mean black and red? I wouldn't have done it, but it's undeniably you and that is one of the coolest things about making clothes bringing a bit of yourself into the world. I do feel like we're too close for me to lie to you though man. I'm a little confused by the way that you've constructed this sandal. I've never made footwear myself but I have made hats, available at lttstore.com, and what is a sandal, if not the hat of the foot? So I feel well qualified to provide you not only with praise for what I feel you've done right but also valuable feedback from my lab on what you can do to improve your spiffy new kicks. That's right. I can spend six figures on a robot too, you know. (bell dings) I mean not my own money, of course. Thankfully, the knuckle draggers at dbrand who have dogged me for years making my devices more wrapped and my life more worse have agreed to open their purse strings yet again to give the community what they want, prettier devices, and the real story of the MKBHD x Atoms 251. Give them hell boys. (shoe clunks) The 251 is what the kids, and I guess trendier adults would refer to as a hightop sandal and is reminiscent of iconic designs like the Air Jordan 1s. The upper is made of recycled mesh and synthetic leather and the soul is made of rubber using a zero waste injection molding process. Kudos for aiming for sustainability. Embroidered on the heel is the number 251. A reference to the length of young MKBHD's first video. It definitely lacks some creature comforts compared to what I'm used to. I mean, laces, what is this Rome? It definitely screams Marques Brownlee and I've gotta imagine that that's what his fans want. Let's move on to our lab tests though. Knowing Marques's reputation as \"The best tech reviewer on the planet\" we felt it prudent to focus on the tech of the 251s. Everything from the tops to the under buns to the all important tips. First up is what we call Don/Dofficiency. That's how fast you can put on or remove the sandal. Honestly speaking, we're off to a pretty rough start here. I alluded to this before, but the laces slow you down immensely. And while it doesn't look that bad in a vacuum, as soon as we add the leading market competitor to our chart it's clear that if time is of any importance to you this is the wrong sandal. Next up is our swampiness test. We took a heavily moistened sock and placed it inside the sandal recording the time to reach a dry state. And unfortunately, this is another bad showing for the pretending to be located in NYC hightops at this rate of swamp dissipation, any puddle mishap could easily lead to Wrinkly Toe Syndrome at best or Trench Foot at worst. Don't Google that. Both of these results indicate a low Beach Compatibility Factor. And here's the thing. I don't like sand. It's coarse and rough and irritating and it gets everywhere. But if I have to go to the beach, then I wanna make sure that I can efficiently swap between land and sea without bringing home half a pound of unrefined silicone. And unfortunately, the 251s fail here in a really big way, but there's still room for them to impress. To evaluate thermal performance, we mounted one of our samples on our 13900K test bench and ran both Cinebench and MSI Kombustor for 30 minutes measuring the resulting temperatures and clock speed. Unfortunately, compared to our NH-D15 reference heat sink the 251s represent a very poor value for CPU cooling. But just because it can't cool a CPU doesn't mean it couldn't cool a foot. So we devised a test to find out but the results were again, extremely unfavorable. This is by far the least breathable sandal that I have ever encountered, which does not bode well for our olfactory test suite. This one involved wearing the shoes for two days straight through my usual mix of badminton, Beat Saber and sleeping in the nude then recruiting a panel of brave volunteers to assign an odor mitigation grade or OMG. The results were well, kind of upsetting for me personally actually, and it was clear that after just two days, my unique blend of nerd sweat and sporty tri-hard aroma were permanently caked into these unique non-removable side panels. Finally, we tested out Ground-Orthogonal Locomotion Distance which is an all important stat for the vertically challenged and they did pretty okay here, probably the best result yet, but still fell well short of our control test with my daily driver sandals. So it's clear Marques that with my history as a connoisseur and taste maker in the sandalverse I have a responsibility to show you how with just a few modifications you could turn these 251s into 10 out of 10s. I am so excited to unveil the all new Linus x Marques x Atoms x dbrand, 2.5 foot 1 sandals minus sock. This one of one drop represents the greatest design ideas from the past, the present, and dare I say, the future it's just a whole new breed of footwear. But look, don't just trust me, bros. Trust the numbers, they don't lie. Our Metatarsal Liberation Window massively improves breathability over marques's flawed design decimating our swampiness values, and as an added bonus they are completely hot sockable, allowing the user to customize their style on the fly. We've also snipped the tip, freeing those crowded little toesies. This not only boosts the effectiveness of our MLW technology, but it also provides extra comfort and size compatibility for those with 11 or more toes and optionally exposes nature's most potent natural weapon the toenails, giving our wearers a boost in their self-defense stats. And now I'm really proud of this next part. After extensive negotiations with NASA, we've reached an agreement to use the same Swiss designed hook and loop fasteners that are found on the International Space Station. These are almost solely responsible, pun intended, for our record breaking Don/Dofficiency scores and the weight reductions that resulted in massively improved GOLD scores, ergonomics and sneakability. As for what dbrand contributed, well nothing of substance like usual but their overpriced stickers are available in every color meaning that you don't need to be locked into a red and black color scheme on the new 2.5 foot-1. However, effortlessly cool the red and black might make you look. This, not this, is how you make a sandal. - It's supposed to be a shoe. - What, it's a shoe, it's supposed to be a shoe? Oh. Uh, well that makes a lot more sense. I guess that's pretty good then. Congratulations, Marques. I wish you nothing but success in this strange venture who buys a shoe in this economy. So much wasted material. If you guys enjoyed this video why don't you check out the time Marques showed off our screwdriver in a sponsored PC build. (upbeat electronic music)",
    "transcript_keywords": [
        "Marques",
        "sandal",
        "test",
        "Footwear",
        "made",
        "foot",
        "shoe",
        "Marques Brownlee",
        "Tech",
        "Linus Tech Tips",
        "time Marques",
        "clear Marques",
        "feel",
        "design",
        "results",
        "sandals",
        "screams Marques Brownlee",
        "make",
        "Hey",
        "marques flawed design"
    ],
    "transcript_entity_values": [
        "Twitter",
        "one",
        "2.5 foot",
        "the International Space Station",
        "two days",
        "first",
        "the MKBHD x Atoms",
        "Google",
        "Marques Brownlee",
        "bros. Trust",
        "Reddit",
        "half a pound",
        "251s",
        "Footwear",
        "zero",
        "First",
        "just two days",
        "Wrinkly Toe Syndrome",
        "daily",
        "Footwear",
        "Swiss",
        "the Air Jordan",
        "Marques",
        "11",
        "Beat Saber",
        "Ground-Orthogonal Locomotion Distance",
        "Marques",
        "Rome",
        "13900",
        "10",
        "Cinebench",
        "1",
        "Don/Dofficiency",
        "NH-D15",
        "MKBHD",
        "30 minutes",
        "YouTube",
        "about a week",
        "Linus Tech Tips",
        "CPU",
        "10s",
        "Facebook",
        "six",
        "NASA",
        "MLW",
        "NYC",
        "Trench Foot",
        "Don/Dofficiency",
        "Linus",
        "WeChat",
        "2.5",
        "251",
        "years"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "TIME",
        "PERSON",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "LOC",
        "FAC",
        "ORG",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ]
}