{
    "id": "Gd1cXIDEr90",
    "title": "KaliPAK 601 Review: Unlimited Power",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-07-20T12:13:00Z",
    "video_url": "https://www.youtube.com/watch?v=Gd1cXIDEr90",
    "category": "Science & Technology",
    "tags": [
        "best battery pack 2017",
        "best solar generator 2017",
        "kalipak 601 review",
        "biggest battery pack review",
        "mrmobile"
    ],
    "views": 84317,
    "likes": 3593,
    "comments_count": 241,
    "description": "The KaliPAK 601 is like no battery pack youve ever seen. Instead of fitting in your pocket or purse, it comes with a shoulder strap  because its a portable generator weighing in at 14 lbs and packing a staggering capacity of 558 Wh. I call the KaliPAK 601 a generator because its more than just a lithium-ion battery; nestled within the folds of this nuclear suitcase are a series of solar panels designed to let you live completely off the grid (for a while, at least). And all Kalisaya asks for the privilege of carrying this beast is  well, a lot of money. But, in the context of outdoor tech in 2017, not an unreasonable amount. Join me for the MrMobile review of the KaliPAK 601!  Visit Kalisaya at  and get 10% off with promo code MrMobile!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  KaliPAK 601 [Kalisaya]:  (10% off with promo code \"MrMobile\")  KaliPAK 601 [Amazon]:   AC Inverter:    [ABOUT THE KALIPAK 601 REVIEW]  MrMobile's KaliPAK 601 Review was produced following five days with a KaliPAK 601 review unit on loan from Kalisaya.   Portions of this review were shot with a Sony XZ Premium on loan from Clove Electronics [ MrMobile thanks Clove for its support.   [FURTHER READING]  \"Best Solar Generator Reviews\" from All Things Boat:   Modern Outdoor Dweller:    [MUSIC]  Raiders by Cymatix, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://kalisayapower.com",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/30f",
        "http://mrmobile.tech/30c",
        "http://mrmobile.tech/30d",
        "https://www.clove.co.uk/].",
        "http://www.allthingsboat.com/best-solar-generator-reviews/",
        "http://www.modernoutdoordweller.com/",
        "https://www.premiumbeat.com/royalty_free_music/songs/raiders",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [ Mr. Mobile] Smartphones these days have pretty big batteries, but thanks to power-hungry features like 4K cameras and 4K displays, if you use them to their full potential you can wind up with a dead phone by lunch time. In the office where outlets are everywhere that's not a big deal. But for a weekend out on the water, or a long drive into the wilderness, you need something like this. I'm Mr. Mobile, and I've spent five days with the KaliPak 601, a portable power station for the outdoor aficionado with deep pockets and strong shoulders. (upbeat techno music) The 601 is the largest of three power generators from Kalisaya and I really can't emphasize large enough this is nothing like the pocket batteries you're used to plugging your phone into. It's a suitcase-sized power station that tips the scales at about 14 pounds and comes with a shoulder strap in the box. Now Kalisaya does make the most of that space. You get a storage bag for all your phone and tablet chargers and your devices themselves. And there's a dedicated envelope for the included solar panels too. More on this in a second. On the other side, behind a non-removable cover, is a giant lithium-ion battery, 558 watt-hours. For context, the battery of the surface laptop I'm writing this review on is a mere 45 watt-hours. Accessing all that power is simple, at least for mobile devices. Two 12 volt DC outputs and four USB type A ports can handle most any phone or tablet out there, with charging rates maxing out at about 12 watts. Not the fastest but it gets the job done. I've used the 601 to power all my devices and some of my family's for much of the past week. That's three or four smartphones, a smartwatch, and iPad Pro, the odd action camera. It took me four days to drop below the 70% mark. I can tell that with a glance at the power meter, and if I want more detailed info, there's an app that talks to the KaliPak over Bluetooth. When you do run down the battery you can charge it by plugging in to AC power, which takes about 10 hours to bring it from empty to full. If you're still out in the field, well that's where the solar array comes in. Unfold it, plug it in, and point it at the sun and you can get a theoretical 40 watts of charging power out of the thing, if you're willing to do a little math. See as I learned during my with Modern Dad, there's an optimal angle for solar panels and it's based on your latitude. My testing grounds for the KaliPak are located at approximately 41 minutes north latitude. Multiplying that by 0.93 and subtracting 21, it gets me an ideal solar panel angle of 17 degrees. Now if you didn't bring your protractor camping, well you can use the app to see how much juice you're getting from our favorite mass of incandescent gas and adjust your angle accordingly. Keep in mind that solar is a pretty slow charging method. Kalisaya cites 18 to 19 hours for a full charge. When you remember that the sun is only up for about 15 hours a day here in the summer, well, solar charging has a stop gap. Fortunately the battery is big enough that you shouldn't need to use it much over a weekend. The 601 first hit the market over a year ago, so you won't find bleeding edge features like USB-C. Also I wish Kalisaya could have found space for a 110 volt AC plug as Anker did on its much smaller PowerHouse. Now this was a conscious decision. The company didn't want to include an AC inverter for a number of reasons: Efficiency, weight, cost. But, still I'd really appreciate the convenience. If you do want to charge a laptop you have to buy a separate plug-in inverter or use a DC adapter. Also, while there's an available rain coat for the device, it's sold separately. Only the solar panels are rated for dust and water resistance. The KaliPak itself is not. Given that, I was kind of put off by the $600 price tag, and even more so by Home Depot, which wants a stratospheric $830. But that's coming at this thing from the perspective of a gadget nerd. Turns out that camping and outdoorsy tech routinely runs on the expensive side. At this price tier the only comparable product I could find in terms of power density and size was the Jackery Power Pro, which is earlier in its life cycle. It's just starting deliveries to kickstarter backers. Larger power packs from Goal Zero and Energy cost about $1500. And on the other side, the Anker PowerHouse doesn't come with solar panels, has a substantially smaller power reserve, and only saves you about a hundred bucks. Given all that, the KaliPak 601 starts to look like a better deal, if you're shopping for a solution to the problem of keeping your gadgets charged on the fringes of civilization. Just be sure to factor in the cost of whatever accessories you're gonna want. And leave room in your weight calculations for all 14 pounds of this sucker. For more mobile tech, from outdoor to indoor, check out Mr. Mobile's channel on YouTube and subscribe if you haven't already. Until next time, thanks for watching and stay mobile, my friends.",
    "transcript_keywords": [
        "power",
        "solar",
        "solar panels",
        "Mobile",
        "dead phone",
        "power station",
        "Kalisaya",
        "big",
        "Jackery Power Pro",
        "KaliPak",
        "pretty big batteries",
        "phone",
        "panels",
        "big batteries",
        "battery",
        "full potential",
        "charging",
        "Power Pro",
        "powerhungry features",
        "lunch time"
    ],
    "transcript_entity_values": [
        "the summer",
        "110 volt",
        "Kalisaya",
        "AC",
        "about 14 pounds",
        "Anker",
        "five days",
        "40 watts",
        "KaliPak 601",
        "about 12 watts",
        "YouTube",
        "17 degrees",
        "four",
        "21",
        "USB",
        "iPad Pro",
        "Kalisaya",
        "70%",
        "Mobile",
        "KaliPak",
        "about 10 hours",
        "four days",
        "18 to 19 hours",
        "Home Depot",
        "about a hundred bucks",
        "558 watt-hours",
        "first",
        "the past week",
        "all 14 pounds",
        "USB-C.",
        "these days",
        "4",
        "about $1500",
        "600",
        "about 15 hours",
        "second",
        "a year ago",
        "DC",
        "approximately 41 minutes",
        "0.93",
        "601",
        "PowerHouse",
        "830",
        "Two",
        "Goal Zero",
        "Energy",
        "the Anker PowerHouse",
        "45 watt-hours",
        "three",
        "a weekend",
        "volt DC"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERCENT",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "TIME",
        "ORDINAL",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}