{
    "id": "Gd3cyoZG3mQ",
    "title": "Jelly: The Smallest Smartphone I've Ever Held",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-04-21T22:41:08Z",
    "video_url": "https://www.youtube.com/watch?v=Gd3cyoZG3mQ",
    "category": "Science & Technology",
    "tags": [
        "smallest smartphone",
        "smallest phone",
        "smallest phone 2017",
        "jelly phone",
        "jelly smartphone",
        "posh micro x",
        "mrmobile",
        "michael fisher",
        "jelly review",
        "u jelly"
    ],
    "views": 307043,
    "likes": 8720,
    "comments_count": 913,
    "description": "The folks who built Jelly don't claim it's the smallest smartphone in the world; that honor might belong to its predecessor, the Posh Micro X. Rather, Jelly is touted as the world's smallest smartphone that also includes 4G. Toss in Android 7.0, dual SIMs, a replaceable battery and a full-size headphone jack, and you start to wonder if maybe a phone that fits in your coin pocket is worth re-learning how to type on a keyboard the size of a matchbook. And that's not even taking into account the bargain-basement price. Is Jelly worth braving the hazards of Kickstarter? Watch MrMobile's hands-on with the world's smallest [4G] smartphone to find out!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Jelly Smartphone:    [ABOUT THE SMALLEST SMARTPHONE HANDS-ON]  MrMobile's Smallest Smartphone of 2017 video was produced following three days with a Jelly Smartphone review unit on loan from Ogadget/Gadget Labs. The device was tested on T-Mobile US in Greater Boston. The Jelly smartphone review device received no software updates and was not connected to a wearable.   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Fashionista\" by Olive Musique, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/20v",
        "https://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- A smart phone in 2017. Camera on the back, display on the front, home key down below. Pretty standard. So, what makes this one special? Well, this one fits in your coin pocket. I'm Mr. Mobile and this is Jelly. (funky electronic music) Beyond having the weirdest name since the Veer, Jelly is tiny. It's on loan to me from the folks at Gadget Labs, who claim it's the world's smallest 4G Android smart phone. And if small is what the folks at UniHertz were going for, well, mission accomplished. Similar to its predecessor, the posh MicroX, Jelly is under a half inch thick, and it masses just 60 grams. That means the battery is tiny, too, at under an amp hour. And heavy use will run it dry in about half a day. But it is removable so you can carry more than one. And the display it has to power is also small, less than two and-a-half inches across. Jelly does bring some cool stuff to bear despite its size, like 4G LTE, dual SIM slots, microSD expansion, and Android 7. My unit has the March security update, and Google Play Services are here, too, so you can download your favorite apps from the Play Store. But when you're building a phone this tiny, compromises are unavoidable. There's no fingerprint sensor, it chargers via older Micro USB cables, and the spec sheet is entry level, with some telltale corner cutting in a few of the onboard apps. (chuckles) It's still got a headphone jack, though. What's it like to use? Actually a lot of fun. Broadly, it's no surprise that phones this small are possible. I mean, after all, we have had wrist watch phones for years, now. Jelly is interesting because it's tiny and it's a fully fledged phone. You swipe between home screens to see your apps and widgets, turn it sideways to watch Netflix, and put it up to your ear to take calls. Those are surprisingly clear on my end, though callers say I sound a little muffled. And when it comes time to type, well, it's difficult, but not as much as I expected. gboard's predictive text has gotten good enough that it usually corrects me correctly. The best part of the whole thing? No super human hand stretch is needed to get to the notification shade. Praise Jelly! The worst part of the whole thing is the camera. There's no way around it, it's terrible. Especially when you put Jelly's photos up against the same shots taken with a Google Pixel. There is a front-facing camera, too, though, if you want to test out Jelly's beauty mode, or try to get a video call going on Skype. Just keep in mind that apps are slow to open on this hardware and many have trouble scaling to such a small canvas. That's easy to forgive when you think about the price point. Jelly is a Kickstarter project launching April 30 and early backers will be able to snag it for about 60 bucks. And even if you're late to the party, it tops out at $79. So it's being pitched as a sometimes phone, for workouts, or a backup communicator, or a phone for kids. It's definitely not for tech geeks. I couldn't put up with the slow performance or the jiggly buttons or the cheap glossy finish. But some folks still really want a super pocketable phone, but also need the functions of a smart phone. For them, Jelly might be an okay fit at a compelling price. Just don't expect it to excel at anything beyond being tiny, and you stand a pretty good chance of making your big-phone-toting friends...jelly. Are you a fan of tiny phones? Drop a line in the comments. And for more videos like this one, on all mobile tech, macro and micro, subscribe to Mr. Mobile on YouTube. 'Til next time, thanks for watching. And stay mobile, my friends.",
    "transcript_keywords": [
        "Jelly",
        "phone",
        "smart phone",
        "tiny",
        "Android smart phone",
        "Mobile",
        "Google Play Services",
        "small",
        "phones",
        "apps",
        "smart",
        "folks",
        "Gadget Labs",
        "Android",
        "Google Play",
        "Play",
        "put",
        "Android smart",
        "Camera",
        "Play Store"
    ],
    "transcript_entity_values": [
        "Jelly",
        "less than two",
        "Gadget Labs",
        "2017",
        "just 60 grams",
        "LTE",
        "UniHertz",
        "the Play Store",
        "microSD",
        "Google Play Services",
        "Veer",
        "Kickstarter",
        "Android 7",
        "Micro USB",
        "about 60 bucks",
        "SIM",
        "Skype",
        "April 30",
        "YouTube",
        "G Android",
        "Mobile",
        "March",
        "more than one",
        "jack",
        "79",
        "about half a day",
        "4",
        "gboard",
        "an amp hour",
        "years",
        "a half inch",
        "Netflix"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORG"
    ]
}