{
    "id": "GdQ5bClEgHg",
    "title": "Hello, old friend… - Media Ripping Explained",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2024-08-12T18:35:14Z",
    "video_url": "https://www.youtube.com/watch?v=GdQ5bClEgHg",
    "category": "Science & Technology",
    "tags": [
        "piracy",
        "blu-ray",
        "4k video",
        "how to pirate",
        "how to rip discs",
        "netflix",
        "prime",
        "amazon",
        "disney",
        "disney+",
        "HBO",
        "anime",
        "free movies"
    ],
    "views": 1727638,
    "likes": 98487,
    "comments_count": 5524,
    "description": "Get a 15-day free trial for unlimited backup at   Check out the MSI MPG 341CQPX QD-OLED Monitor at   Big Movie Studios dont want you to know this one trick - that you can easily rip your physical media, and do WHATEVER you want with it. That is, if you watch this video to learn how! Its not exactly piracy, but not exactly LEGAL across the globe either.  Discuss on the forum:   Buy a LG BP60NB10 Blu-ray Writer:  Buy a LG WH16NS60 Blu-ray Drive on eBay:   Buy a Pioneer BDR-XD08UMB-S Blu-ray Drive:  Buy a Pioneer BDR-211UBK Blu-ray Drive on eBay:    Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   GET A VPN:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   Step by Step guide to setting up your drive for Blu-ray ripping:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Legality =/= Morality 1:40 How to rip Blu-rays  2:35 Remuxing  3:35 ReEncoding 4:59 A (brief) History of Optical Disc Piracy 6:59 WHY you should rip your Blu-Rays 11:43 Plastic is better than Digital",
    "description_links": [
        "https://www.backblaze.com/landing/podcast-ltt.html",
        "https://lmg.gg/MSIMPG341CQPX",
        "https://linustechtips.com/topic/1579335-hello-old-friend%E2%80%A6-media-ripping-explained/",
        "https://geni.us/0jKWZ",
        "https://ebay.us/IFAdZY",
        "https://geni.us/rRrcb",
        "https://ebay.us/WQB0XA",
        "https://lttstore.com",
        "https://lmg.gg/lttfloatplane",
        "http://www.piavpn.com/linus",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://forum.makemkv.com/forum/viewtopic.php?f=16",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "What I'm about to show you isn't exactly legal, but legal doesn't necessarily mean something is right anyway, does it? It's legal to raise my subscription fees whenever they want. It's legal for them to control how I use my own account and the media I paid for. It's legal for them to keep showing me ads and steal my data when I pay for the service. And it's even legal for them to take my money and disappear into the night with my media. Now, piracy can be just taking things without paying for them, but sometimes it's a little more noble than that. Sometimes it's about taking control back from the powers that be, reasserting our right to own the things that we've paid for and use them however we please. So I beg you, look at this, big movie studio exec. It's blurred, so you won't have any ammunition for a DMCA takedown, but believe me when I say that it's your Blu-ray and I'm streaming it from my PC to my phone because I don't care about your rules. And guess what? I'm gonna take it one step further and show everyone watching how to do it. Who knows, if you have a tech savvy nephew or something, you might even get them to watch along and set it up for you. It truly is very convenient. Of course, as you know, creating video costs money though, so I can't tell your nephew anymore until we get through this message from our sponsor. MSI, game like it's going out of style with the MPG341CQPX QD OLED monitor. Experience gorgeous visuals, lightning fast 0.03 millisecond response times and a 240 Hertz refresh rate. Check it out using our link. To rip a Blu-ray, all you need is the disc, a compatible drive like this one from LG, we'll have a full list link down below and a computer or NAS with a lot of free storage space. Start by downloading and installing Make MKV and SDF tool flasher, as well as the custom firmware for your drive from the guide that we'll also have linked down below. Then use SDF tool to flash your drive by pointing it to the firmware you downloaded. Next, pop the disc in and use Make MKV to back it up, making sure that you select decrypt video files. Hit okay and in about an hour, you're gonna have a copy of your entire Blu-ray disc that is tucked safely away in your computer and you're done. Well, sort of. You can play the full quality M2TS video that's usually found in the BDMV / stream folder. The biggest one is gonna be your movie and the smaller ones are usually gonna be extras or special features. But if you want a more broadly compatible file that will play nicely with more devices, we recommend remuxing or re-encoding your video. Remuxing means simply changing the container of the video file without altering the quality or size. If you go back a few steps, you can actually choose this option right in Make MKV. This is a great choice, especially for discs that have playlist obfuscation as an anti-piracy measure, which could lead to glitches or your movie being split into chunks. Apparently Lionsgate movies are notoriously bad for this. Make MKV can attempt to load the Blu-ray menu in Java to help you sort which playlist holds the correct files to remux. But if you're having issues, there are resources that would prefer to remain anonymous, but that can be found with a quick Google search on a per movie basis. But if you want the whole disc on your drive, you can also use MKV tool next to convert specific files to MKV for your personal enjoyment. If you want both better compatibility and a smaller size though, a full re-encode with handbrake is the way to go. Re-encoding means fundamentally rearranging the ones and zeros of the media file in a matter that can shrink the video size, but usually at the expense of some quality. To do this, open up handbrake and drag the entire backed up folder into the window. Let it scan and when it's done, use the dropdown menu to select the right video file or files. Look for the ones that are the proper length, then choose your export preset. This one is great for very high quality Ultra HD, but some of your devices might play better with HEVC. You'll have to play around with things a little bit to see what works for you, but here are some starter presets. There's a lot more to fine tune in here, like audio tracks, the ability to keep or remove certain languages of subtitles, or even burn them in. We'd also recommend changing the frame rate to same as source. And once you're done, you can hit go and wait anywhere from several minutes to several days, depending on your settings and hardware. Once everything's encoded up the way you like, you add it to your favorite self-hosted video streaming library, and that's it. You've got your own personal Netflix, one that can't be taken away from you and never goes up in price. But the simplicity of this whole process is a little deceptive. Before these user-friendly tools could be developed, a lot of hard work was done to break the encryption of Blu-ray discs and of the DVDs that came before them. But that wasn't always the case. The difficulty curve has actually gone very easy, very hard, back to very easy. So how about a fun little piracy history lesson? In the early 1980s, when CDs were unveiled to the world, hard drives for home computers were hovering around 10 megabytes of total capacity. To put that in perspective, it would take about this many hard drives to store a single CD album. Sony and Philips, the joint creators of the CD standard, didn't bother to write any form of copy protection into the specification because the pricing of CDs was so competitive compared to those hard drives. I mean, what are you gonna do? Spend a quarter million dollars on drives or just head to the local Sam Goody for a new $20 copy? But by the early 2000s, things had changed. CD burners had become commonplace in home computers and the price of storage had plummeted. That, combined with the adoption of compressed audio formats like MP3, the growth of broadband internet, and the rise of easy-to-use piracy networks like Napster, took music sharing mainstream. By the time things really reached the masses, DVDs had already been a thing for about four years, but the makers had definitely learned at least some lessons from CDs. There were many restrictions built into the DVD specification that prevented duplication and piracy. However, they were relatively primitive and were ultimately defeated by brute force attacks. By the time most new PCs shipped with a DVD drive then, libraries that could decrypt DVDs were readily available. You just needed to know where to look. Blu-ray, on the other hand, took longer. The copy protection is vastly more sophisticated, even including the ability to revoke and issue new encryption keys through new disks, but the industry was also going up against much more powerful computers in the hands of much more experienced hackers. It's an arms race that the studios can't possibly hope to win in the long-term. Speaking of long-term, that's reason number one why we made this video and why we think you should be ripping your Blu-rays. Mass failure of entire generations of optical media is coming, and it's coming really soon due to something called disk rot. Blu-rays actually have the shortest expected lifespan of any commercial disk format yet, at only five to 20 years. And while hard drives and SSDs also fail, sometimes even faster, once you've backed up your disks, it's much easier to move that data around and back up your backups. Reason number two is video quality. Streaming services are absolutely a viable alternative to get convenient access to your media, but to hit their profit targets in a very competitive industry, they've made serious compromises to picture quality. A 4K Blu-ray can go as high as 144 megabit per second, whereas most streaming services are currently sitting under 20. Now, most of the time, it's fine, but as TVs get bigger or as you get to those ever more popular underexposed dark scenes, the lack of detail and the graininess can take you right out of the drama. And that's even ignoring the loss in audio quality. I get it, encoding efficiency has come a long way in the last decade, but no, it's not enough to make up for that sweet, sweet raw data. Number three, if you're buying your Blu-rays to rip, you will actually be better rewarding the movies that you actually like. And this one is probably the most important point. The best movies rarely have the best box office returns, but in the past, home sales have rewarded those filmmakers that took a risk and couldn't find an audience in the multiplexes of yesteryear. And at the time, the accepted wisdom was that a movie only really needed to double its reported budget to remain profitable. This is due to marketing budgets often matching that of production budgets, not to mention the fact that a theater takes a lot of the gross receipts. However, it's been suggested in recent years that to break even, the required box office target is now more like a factor of three or four, as streaming services have cut a hole out of the post-theater profits. Now, I sure as heck don't miss paying $30 for one movie, but it's also important to actually support the creators making the content you love if you ever wanna see any more of it. As content creators ourselves, we rely on multiple means of supporting ourselves, ads, subscriptions, and the fine merchandise on lttstore.com, like the insert merch promo of the week here. Well, we'll have something that pops up. Anyway, I realize that my take on this stuff is a little more nuanced than the average Redditor is gonna be able to process, but I'm definitely not anti-piracy. You do whatever lets you sleep at night. I've always said that. I just feel that it's my responsibility to paint the complete Corsair canvas. Studies have shown conflicting reports on the damages of copyright infringement on creative industries. For example, an EU study, often disproportionately cited by proponents of piracy, shows that video game sales actually go up as a result of piracy, presumably due to increased word of mouth. However, of 34 academically reviewed studies pertaining to piracy, 29 of them have found that online copyright infringement causes statistically significant harm to legitimate sales. Only five studies found no harm to legitimate sales. In fact, that same popular EU study that seems to validate game piracy showed that both the book and movie industries have suffered due to piracy, especially when it came to newer movies. So in this end game corporately driven society, we know that only your money speaks and divesting from the services that are proud to announce they now use only 30% machine judgment to green light their shows is a good first step, but you may also wish to invest in the things you want to see more of. It's also kind of fulfilling to own a piece of what you love. And yes, I unironically love Despicable Me, deal with it. That's reason number four. Under the current state of digital laws, you don't own anything. You're more or less leasing the right to access the content. And that applies even to digital purchases of full movies from services like Prime, Apple, or Google TV. When you read the terms of service, these platform holders reserve the right to revoke that access on a whim, huge L. I mean, luckily most platforms that have tried this have faced a backlash so severe that they had to backtrack, but that is at best a temporary W and I wouldn't count on it to last. That last bit is a big part of why buying this stupid piece of plastic is so much better. Sony is not going to be able to enter your home and blend up your copy of Morbius, despite probably wishing that they could. Another big one is special features. The behind the scenes from the Lord of the Rings box set literally set one of our production guys who happens to be the one filming this video on his current career path. That stuff is dead on streaming platforms. I mean, yeah, some studios still produce short making of documentaries about their films that autoplay as the credits roll, but they almost never feel as raw and plain awesome as the old ones or as awesome as the segue to our sponsor. Backblaze. Backblaze is an affordable and easy to use cloud backup solution that starts at just $9 a month. They make it simple by allowing you to backup almost anything from your Mac or PC and access it anywhere in the world with their web and mobile apps. You can easily protect business data too through a centrally managed admin and an enterprise control add-on giving you even greater control over endpoint backups. Backblaze also lets you restore your data by web or even by mail. They will ship you a hard drive with your data on it right to your door. And when you're done, you can return the hard drive to them for a refund. And if you're worried about accidentally deleting files, you can increase your retention history to one year for free. With over 55 billion files restored and three exabytes of data under their management, Backblaze has got you covered. They even have us covered. We actually backup our servers to Backblaze nightly. So don't wait. Sign up and get a 15 day free trial with no credit card required today at backblaze.com/LTT. If you guys love sailing the forbidden seas, hey, give this video a thumbs up. And maybe if you're looking for something else to watch, go check out the one where we compared Plex and Jellyfin, a couple of the aforementioned personal Netflix services that we really love around here.",
    "transcript_keywords": [
        "Make MKV",
        "video",
        "Bluray",
        "hard drives",
        "legal",
        "MKV",
        "piracy",
        "drive",
        "hard",
        "movie",
        "Make",
        "video file",
        "files",
        "quality",
        "drives",
        "data",
        "services",
        "movies",
        "things",
        "Streaming services"
    ],
    "transcript_entity_values": [
        "around 10 megabytes",
        "Sony",
        "Jellyfin",
        "about four years",
        "one",
        "only five to 20 years",
        "240",
        "Lionsgate",
        "Despicable Me",
        "Netflix",
        "LG",
        "Google",
        "the early 1980s",
        "first",
        "Apple",
        "M2TS",
        "recent years",
        "only 30%",
        "Hertz",
        "the night",
        "DMCA",
        "Java",
        "Number three",
        "30",
        "Corsair",
        "15 day",
        "Morbius",
        "Blu-ray",
        "BDMV",
        "zeros",
        "several minutes to several days",
        "Napster",
        "number one",
        "Only five",
        "today",
        "about an hour",
        "EU",
        "Rings",
        "the last decade",
        "Mac",
        "L.",
        "MSI",
        "Remuxing",
        "a quarter million dollars",
        "29",
        "Plex",
        "the early 2000s",
        "just $9",
        "Sam Goody",
        "144 megabit",
        "the week",
        "4",
        "three or four",
        "Google TV",
        "SDF",
        "as high as",
        "34",
        "20",
        "number two",
        "NAS",
        "K Blu-ray",
        "three exabytes",
        "HEVC",
        "Philips",
        "over 55 billion",
        "under 20",
        "number four",
        "0.03 millisecond",
        "one year"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE"
    ]
}