{
    "id": "gDYBl6e950E",
    "title": "VIDEO GAME KNIVES IN REAL LIFE",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-06-16T16:00:04Z",
    "video_url": "https://www.youtube.com/watch?v=gDYBl6e950E",
    "category": "Science & Technology",
    "tags": [
        "cs go",
        "cs:go",
        "knives",
        "cs go knives",
        "elemental designs",
        "elemental",
        "designs",
        "cs",
        "go",
        "counter strike",
        "counter",
        "strike",
        "global offensive",
        "skins",
        "counter strike knives",
        "unboxing",
        "unbox therapy",
        "unboxtherapy",
        "cs go unboxing",
        "counter strike unboxing",
        "tech",
        "technology",
        "video games",
        "gaming",
        "crazy",
        "combat",
        "edc",
        "review",
        "youtube",
        "video",
        "google",
        "csgo",
        "best",
        "new",
        "gadgets",
        "counterstrike",
        "counter strike global offensive",
        "counter-strike",
        "case opening",
        "2016",
        "knife",
        "counter strike go",
        "offensive",
        "game",
        "games",
        "knife unboxing",
        "pc"
    ],
    "views": 7899641,
    "likes": 137505,
    "comments_count": 23593,
    "description": "Today's Mystery Video -   Elemental Knives -   Today we've got something unusual... As mentioned in the video you never really know what's going to show up at Unbox Therapy HQ. These are some crazy knives from Elemental Designs modeled after the knives in CS:GO  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "https://youtu.be/DOiaxdNPvd4?list=PL7u4lWXQ3wfI_7PgX0C-VTiwLeu0S4v34",
        "https://elementalknives.com/",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "What's up guys lew here back with another video and today and today We're gonna we're gonna do something strange. you know I receive boxes here at Unbox therapy, and I don't always know What is in them, these my friends. are REAL LIFE counter-Strike knives What what do you mean? what so this company here is called believe they're called Elemental knives, am I right about that I'm gonna link them in the description you could check them out . Interpretations of the knives that you use in the game This is video games come to life. So what we're gonna Do is inspect these babies and see just how crazy? Videogame knives look in real life now also inside the box was this little slip here You can see with a special code for some cSGo skins, so yeah You want to follow these instructions if you're the fastest to redeem this some free stuff? first one of the day ,now obviously this is a Slightly different video than usual, but I'm kind of pumped full disclosure. I'm not a counter-strike player myself So you guys are gonna know a lot more about these than I do? OHHHHH Whoa, It's kind of like a rainbow thing going on Wow Now my feeling on these things is I mean They're they're mostly commemorative right like these are collectors type things that said I mean, holy smokes this thing is legit You happened to get attacked by a bear or something while you're playing counter strike reach for the real deal? OHHH There's something else. I did not know that this guy has a legit holder open that baby up Whoo get me the box? Combat training for years. That's what Unbox therapy has truly been about it's all a ploy to practice my knife skills on cardboard boxes Think about it boom pocketable I guess Flip style knife oh man. [oh] oh, these are crazy look at that this guy like the tiger situation in the gold it has a clip on it as well So you could put it on a belt so we got a little pouch here as well. Let's see how this guy goes in There you go sweet, okay Man, these are sharp as well. I Like this one this one has you know this piece of steel goes across the entirety of the knife This is like from a durability perspective a very solid Long lasting idea here this guy up here's for what like for skinning something? I think this these are like legit hunting knives this is the biggest one This could get wild you guys got to vote down below which one was your favorite This is the rambo knife right here I mean, you're like almost in the sword territory at this point here That is a combat knife right there again a crazy pattern on that, this if you need something like this You're a pretty serious dude Sylvester stallone special right there all right. Maybe something more practical here okay, so we got another flip style with that like Rainbow pattern Reflective a lot of different colors represented in there that's really cool whoa Jack that's not mean you can't feel comfortable right now. Oh my God that looks dangerous Wow in this case. It just has a hard shell and Some cord here. Oh That is that might be the perfect unboxing look at that Classic combat look here. You know look at check out that spider-Man pattern on there that one feels really comfortable as well. Oh Yeah, another Kind of Hook Style going on Different color Pattern wow, what do you think about that right there? Okay Super gruesome looking, I'll probably use it on watermelon myself. I'm a peaceful guy the last one Perfection [oh] It's another Rambo joint with a different paint job on it. I mean come on This is still the one for me. I can see The Hardcore Csgo players getting amped about this knife collectors. What can I say? Thanks to elemental knives Very cool. You know who you are you're the man",
    "transcript_keywords": [
        "today and today",
        "lew here back",
        "REAL LIFE",
        "knives",
        "today",
        "REAL LIFE counterStrike",
        "LIFE counterStrike knives",
        "knife",
        "guy",
        "guys lew",
        "LIFE",
        "Elemental knives",
        "Unbox therapy",
        "called Elemental knives",
        "pattern",
        "REAL",
        "video",
        "kind",
        "video and today",
        "guys"
    ],
    "transcript_entity_values": [
        "lew",
        "today",
        "first",
        "Rambo",
        "Elemental",
        "Different color Pattern",
        "years",
        "Hardcore",
        "Unbox",
        "Jack",
        "Classic",
        "Sylvester stallone"
    ],
    "transcript_entity_types": [
        "PERSON",
        "DATE",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERSON"
    ]
}