{
    "id": "geMgArt2bcA",
    "title": "Why is this $10,000??? - Fujifilm GFX100",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-09T00:28:52Z",
    "video_url": "https://www.youtube.com/watch?v=geMgArt2bcA",
    "category": "People & Blogs",
    "tags": [
        "Camera",
        "Digital",
        "DSLR",
        "Mirrorless",
        "full frame",
        "sensor",
        "IMAX",
        "Stills",
        "Video",
        "lenses",
        "zoom",
        "4K",
        "1080p",
        "quality",
        "details",
        "focus",
        "auto",
        "battery",
        "external",
        "microphone",
        "video",
        "photography",
        "cinematography",
        "SD Card",
        "Memory",
        "accessories"
    ],
    "views": 332342,
    "likes": 14983,
    "comments_count": 745,
    "description": "You could either buy a decent used car or this camera... some would take the camera.  Buy Fujifilm GFX100 Mirrorless Camera:  On Amazon (Paid Link):   On BHPhoto (Paid Link):   Buy Fujifilm GFX100 Accessories:  On Amazon (Paid Link):   On BHPhoto (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:  Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/mgJM",
        "https://geni.us/PYQK",
        "https://geni.us/GlmC",
        "https://geni.us/cBoWU",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- So today is exciting, because I get to try a camera that came out almost nine months ago, ten months ago ish, but that I've been wanting to try for a very long time. Fujifilm's GFX100. Now, why is this camera special? Because it is their best medium format camera, that they've ever made. So for those of you that watched the GFX50r video that we did online as (mumbles) a little while ago, this is the better, higher end version of that camera, and that was the first digital medium format camera that I've ever used. So we have a camera strap, some adapter plugs and here is the view finder. So the view finder on this camera, and Fuji's other larger GFX50s medium format camera, have a removable view finder. You can get a couple of different types and the old GFX50s, which is the one I didn't try, the view finder from that camera also does work on this one. So for those of you who are unfamiliar, medium format sits right above 35 millimeter full frame, and then below that you have APSC and Micro 4/3. So the sensor size, is huge! This is the highest resolution stills camera, I think this is the highest resolution camera that I've ever held, period. Very cool, you have another secondary display beside your main LCD for your settings, so you don't have to, if you don't want to, overcrowd your LCD, but you'll still then be able to know your settings. The cherry on top of that, is you can actually change what is displayed on the secondary display. And the rear sub monitor setting, you can go to stills mode or movie mode, and in stills mode, you can have a display your histogram. Okay so, unfortunately (mumbles) is almost dead, and as far as we can tell, in the box, there is no changer. So, that being the case, we're going to see now, if we can charge this thing through the type C port. It did turn on but it is not charging. Fuji, I know that you listen to customer feedback, and people ask a lot of you. But would it be so hard to allow people to charge their camera and use it? It has duel SD card slots, which is always nice to have. The display on the top is pretty useful, you can actually map it to different things. I've now changed it to have ISO and shutter speed. The physical virtual dials on it, so you can easily tell what you're settings are just by looking at the dials. Kinda feels like a virtual version of what Fuji physically does on their other cameras, like my XT2, where you have physical dials. On the right here you have their multi movie and still mode, which you have to press down this little button on the top in order to change the mode, which is nice. I don't know how much I like the fact that there in, 'cause usually the button is the top button, and then you can just press down and change it, whereas this one, you have to hold down and then use a second finger to move it. You got two NP-T125 batteries, they're 1230 milli-amp hours each. Which for a manufacturer standard battery, is not that great. It is a little disappointing in that Fuji themselves does not include larger batteries right off the bat. And the nice thing about the LCD, is that it's touch screen. And then the EVF itself is honestly, very good, quite sharp. Reasonable amount better than the GFX50r that I used. It's sharper and it has no issues with black out or motion blur. So trying the portrait grip again, it is not very comfortable, the fact that there's no padding and the grip itself is not nearly as significant as the main grip. This feels like an after thought addition. It's great that they made a battery grip style camera, that has two batteries, which, considering the sensor and all the other power hungry parts to this camera, feels like a necessity, not something that they just added on to have a better featured camera. This is probably the worst part about the camera, honestly. It balances okay, but because it isn't comfortable, I could not imagine shooting an entire session with the grip like this. I'd almost rather have some sort of other solution to get the camera this way. Now if you watched the XT4 video, you know that I was upset that Fuji did not put a headphone jack on the XT4, but they did put a headphone jack on this. Fuji also did include this interesting little tilt adaptor, which I've not used before and I didn't get a chance to check one of these out, 'cause I haven't used their other 50s, but this adaptor basically allows you to use the GFX100 in the same way that you would use an old film medium format camera. So, you can see that the adaptor adds quite a bit of girth to this guy. Look at how far away, the EVF has moved almost the size of itself away from the camera, but the benefit of this little adaptor, it allows you to do this. It can also go side to side. So when you really wanna point your camera to the left or the right, and look at it straight ahead, well Fuji's got you covered. For a measly $579 US, which is ooph. For this little adaptor that does this and this, and this and this and this. That's a lot of money, but if you're paying $10,000 for a camera, why not? It's fun. Oh, that is a tight mount. Feels good. Yes. Yeah it, wow, I'm surprised. This mount and the whole camera with the lens on it, feels very solid. So another big selling point to this camera, over the GFX50r or the other medium format camera's that Fuji has made so far, is that this has two really big features that no medium format camera has ever had. One, in-body stabilization, 5.5 stops, which in order to take advantage of the 100 megapixel resolution, that's huge, because then you can shoot at shutter speeds that you wouldn't be able to handheld, or even in general, be able to shoot handheld with a lot more confidence that your shot's are gonna come out perfectly tack sharp. And then the second feature that is it, is phase detection autofocus, which for those of you who are nerdy and know what that is, phase detection versus contract detection on a focus on a stills camera, is night and day difference. Phase detection is so much faster and a lot of the times, so much more accurate. And Fuji's implementation of the phase detection autofocus, is pretty impressive. (plastic rustling) Most of Fuji's lenses that are this high end come with a little baggie, which is nice. Owners manual, who reads that for a lens? And then the lens itself. (plastic rustling) And it's an image stabilize lens, on top of the fact that the camera itself will have in-body image stabilization, so that stacking of stabilization is really gonna give you a lot of confidence on the long end of a lens like this. Oh this is an even tighter click, holy crap. This lens mount is very strong. Okay, to the biggest lens for stills, that I've unboxed. So this feels, honestly, pretty similar to a 7200 Canon lens that I've used in the past and honestly, the size of it is also very similar. Might even be a little bit lighter. And this also has OIS, which is nice. And like it really does focus very quickly. My XT2 doesn't focus this quickly. It is really impressive that if you really wanted to, you could go out on the street or if you were doing nature photography and something was happening quickly, you could just point your camera up and then very quickly get your focus and have confidence that you were both relatively stable and sharp, really impressed. 'Cause again, this is a lot of sensor to process, every time you hit that shutter button. Okay, so going back to the 32 to 64 for a second, this camera also has, which is a first for medium format camera's in general, 4K, 10-bit video. So, that puts it as a not terrible option for 4K video. Now again, you are paying $10,000 for a stills camera that is fully featured but the fact that it also has 4K video that's not bad, is impressive. You have the Turner profile, that has been added to most of Fuji's camera's now, all the new ones at least, and you also have Log, that you can, F-Log, that you can shoot in camera and then grade later or, I believe also, shoot externally. That means you get to use a medium format sensor, for 4K video. Guys, that's crazy. Now, unfortunately, before, I got too excited, I also realized that most of Fuji's lenses, that you would use with the GF mount on this camera, for stills, are not really gonna be able to take advantage of that larger sensor because there's at stops that are pretty deep. This is a F4, that's an F5.6 and then this is also an F4. However, if you adapted a lens that could cover the size of the sensor, then you have a set up that gets into IMAX territory, in terms of resolution. Now, it's not gonna be as good as that but that's honestly not, that's fine, 'cause it's a stills camera. But that can also shoot video, on a sensor, this big! That's pretty cool, honestly. I'm impressed that Fuji decided to take the time to add that feature and make it not bad. It's 10-bit, H265, and you can record externally with a Log profile, and it shoots amazing stills. Good job Fuji. So if you're looking for a medium format camera that can do more than most medium format cameras can do, this might be it. Subscribe to Short Circuit, see you guys later.",
    "transcript_keywords": [
        "camera",
        "medium format camera",
        "format camera",
        "Fuji",
        "medium format",
        "ten months ago",
        "months ago ish",
        "format",
        "medium",
        "months ago",
        "lens",
        "ten months",
        "Fuji camera",
        "video",
        "sensor",
        "view finder",
        "lot",
        "feels",
        "months",
        "honestly"
    ],
    "transcript_entity_values": [
        "a measly $579",
        "32",
        "One",
        "Fuji",
        "US",
        "4",
        "100",
        "ISO",
        "second",
        "almost nine months ago",
        "XT2",
        "F4",
        "EVF",
        "1230 milli-amp hours",
        "GFX100",
        "10",
        "first",
        "Fujifilm",
        "10,000",
        "two",
        "Turner",
        "35 millimeter",
        "Canon",
        "LCD",
        "50s",
        "NP",
        "Fuji",
        "5.5",
        "Short Circuit",
        "IMAX",
        "ten months ago ish",
        "SD",
        "jack",
        "H265",
        "today",
        "7200",
        "F-Log"
    ],
    "transcript_entity_types": [
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PRODUCT"
    ]
}