{
    "id": "gidJopKtcnc",
    "title": "Want a Ride? - My Electric Hummer Battery is MOUNTED!!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2022-02-19T14:44:43Z",
    "video_url": "https://www.youtube.com/watch?v=gidJopKtcnc",
    "category": "Howto & Style",
    "tags": [
        "Electric Hummer",
        "EV Hummer",
        "Hummer EV",
        "Electric truck",
        "electric conversion",
        "electric vehicle",
        "EV",
        "cybertruck",
        "tesla",
        "rivian",
        "ford lightning",
        "electric hummer conversion",
        "tesla battery module",
        "electric hummer",
        "hummer ev",
        "gmc hummer",
        "ev hummer conversion",
        "ev hummer",
        "Electric HMMWV",
        "electric humvee"
    ],
    "views": 1710453,
    "likes": 88319,
    "comments_count": 5885,
    "description": "It is time to take our FIRST DRIVE in my Electric Hummer! Get your first month FREE with any Kiwico Subscription:   This day has been in the works for a very long time. I started taking apart my Military Hummer January of 2021, and here we are taking it for a spin with its electric motors in February of 2022. A full year of hard work and learning later. Thank you for joining me on this adventure! Its been super fun and we have a lot more work to do! Should we add some Solar panels to the top?! I think so.   Grab your Whisper Project shirt (since its not a Hummer any more) here:   Huge thanks to Oshcut for the Laser and Tapping Machines:   Watch all the EV Humvee build videos in order HERE:    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Plastic Pry tools:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://www.kiwico.com/JerryRig",
        "https://www.jerryrigknife.com/",
        "https://www.Oshcut.com",
        "https://youtube.com/playlist?list=PL0vZL9uwyfOFezIOiBjkdW3TTdn0Q_AKL",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "Today's a pretty big video. We are taking all of these battery boxes and putting them in the Hummer. The hardest part of this whole project, and I kid you not, is finding plugs for this middle battery box. We have wires needing to leave all sides. We have this big plug right here for the two out wires going to the motor in the front. Then we have a gaggle of communication wires that need to go out the back side. So while finding the correct plugs was extremely difficult, I think I did find some that will work and hopefully this all works out. Up to this point we've been tethered by the 2 aught cables going up to the Humvee giving us a driveable range of about 3 feet. So today, once everything is connected and in the Hummer with their plugs, we'll be ditching the tether completely and we should be able to pull completely out of the garage. This video is sponsored by KiwiCo. More on them later. And we also have official Whisper Project t-shirts, with Whisper Project on the front and all of the specs of this massive Hummer on the back. You've seen all the videos and now with this shirt you'll have proof that you were here when it happened. I'll leave a link down in the description for those. And now we have a huge project ahead of us because these batteries aren't going to move themselves. Let's get started. [Intro] The first plug we're using is a canon plug from the HD30 series and this guy can handle 30 wires coming out of it from the BMS and the relays attached to the contactors. There was one website that was decently good at pairing up male and female plugs and that's wirecare.com. Not sponsored, they just have a really good plug assembly website that is much better than everyone else's. Now we just have to disassemble the center box, add the plug and start populating the wires. [Drill sounds] Obviously a smart person would have preplanned and drilled these before assembling the battery box, but I am not a smart person and this is my first time building an electric vehicle, which is why we're drilling the plug holes after the fact. We're making this up as we go. You might be thinking to yourself, 'Hey Jerry, if the boxes are watertight how do you compensate for the thermal expansion of the modules as they heat up?' And that's a fantastic question. We're doing that with this guy. It's called a breather valve. Inside of this little guy is a semi-permeable membrane, which means it can be completely submerged and then pulled out of the water and still breathe. So it'll keep the boxes watertight while allowing hot air to escape and keep the inside of the boxes equalibriumilized. To add the breather valves all we have to do is drill a hole in the side of the box and tap. Tapping the 3 16th aluminum on the back side of the box allows us to thread the valve in after it's been assembled, which you'll see in a second. So you've seen this part but you have not seen what's back here. And I promise I'll make a whole video explaining how we did the cooling system, but a brief short explanation is that coolant will come in one of these lines, cycle through the battery, and exit out the side. I'll go into way more detail in a cooling video after we get this battery mounted. If you remember, we have lasered out half inch aluminum panels to be the tops of each of these three boxes. But we haven't quite figured out a way yet to get the boxes from this table into the Humvee. According to my math they are going to each weigh about 400 pounds, which isn't something you can just pick up. But I think I do have a solution and we're going to do that with...an industrial grade dual armed, orthogonally constrained tapping machine, with over 350 pound feet of torque. This bad boy is able to tap up to an inch and a half hole which is insane. Obviously we're not going to use inch and a half today on our project. We just need holes for an eyelet so we can hang the box from my engine hoist and bring it over to the Humvee. I'm here again at OshCut, you know, OshCut has the lasers and massive bending machine. But they also have this, which makes it super convenient to tap holes inside of thick pieces of metal. Now I won't have to do it myself. Of course I won't say no to trying out this beast of a machine though. [Drilling sounds] And just like that our holes are drilled and tapped. [Vacuum sounds] So each of these battery modules has plastic ridges along the top and we've laser cut slits into this top plate and they will sit down and hold the module securely, forward and backward, as well as left and right. Just for the record we have installed the 2 aught cables onto their terminals and we've also insulated the ends, so as we feed them through the box there are no live bare metal connections and they're safe to touch. Then the box itself is slid down over the top plate. It's a pretty snug fit, and this unfortunately means that the orange high voltage bus bars are going to be covered up, as well as the blue water cooling manifold in the back. Which is unfortunate because those do look pretty awesome. But since you guys have watched the video, you'll know what's inside of the boxes. Things will be much safer then they're contained and protected. To seal the box up and make it watertight, we're using something called RTV gasket making silicone. This applies as a thick liquid and then dries and solidifies to help keep water out. Kind of like what we saw inside of the Galaxy Fold 3, how they sealed inside of their hinge. We're using the same thing on this battery box. We'll be gooping it on nice and thick, but these battery boxes won't be seen so it might not be super aesthetically pleasing at the moment, but at least they'll be watertight. [Hammering and drilling sounds] Once the sides are in place we can take some half inch screws and screw into the half inch slab of aluminum at the bottom and the top. [Drilling sounds] And there we have it. One of the three boxes is now assembled. Quick peek inside so you can see how it works. We will have these 2 aught cables going out through the conduit to reach the other boxes. We have the terminals insulated, the cables insulated, the bus bar is insulated. Then over here where we have the cooling come out we have these little rubber grommets that are screwed into the side of the frame, once again there to help keep water out. Now I think the last thing we have since these little eyelets are screwed in is just taking this box and plopping it behind the driver's seat. Should be pretty easy. We'll see how it goes. Before we can set this box in the Humvee though we do have to weigh it. Now this box has enough power inside to run a house, an entire house here in the USA for one day. So let me know before we weigh it down in the comments how much you think it weighs. Last chance. Is your guess down in the comments cuz I have it right here. Just shy of 500 pounds. Not too shabby. Now let me know also down in the comments how close you were to your guess. It's hard to calculate that much energy, enough to run a house for a day. But inside of this Humvee we have enough energy to run a house here in the USA for three days, but not unless we actually get these batteries in. Which is now. We also took a sheet of adhesive rubber and lined the battery box in the spots where it might come in contact with the Hummer frame to isolate it from vibrations as well as to isolate each of the boxes from each other. It might be a bit overkill but you know when you're working with this much power, overkill is a good thing. [Ratchet sounds] And there we go. One of the three boxes is in and you can kind of see how things are going to work. With the 2 aught cables and the data coming out through the conduit into the middle and side boxes. I'll go through how we mounted it to the back when we do the passenger box. Now that we've done one the other one should go slightly quicker. And then we have to finish off the middle box. But we are so close, I can almost feel the wind through my hair. So right now I am standing where a battery box should be and it's time to wire up a plug to our inverter. Remember, we're taking the DC power from the batteries and turning it into AC with a 2 aught cable bridging the two. And that 2 aught cable needs a plug. One cool thing about the wires we're using is that they are shielded, meaning that there is a metal mesh over the copper conductor and that metal mesh is grounded to the low voltage 12 volt system and gets rid of some of the frequencies coming off of the wire as power is flowing through it so it doesn't disturb our sensitive electronics like our display and can system. The plugs I'm using have the same voltage, and more importantly, amperage rating as the 2 aught wires that I'm using. And through a complex system of doohickeys, rubber grommets, and crimped components, our 2 aught wires are successfully inserted into a plug. Alright, moment of truth. Everything is connected. This is the side that's going to go into the battery box. Jeremy's going to put it in. Done. We now have a high voltage plug. As far as mounting the aluminum boxes to the frame of the Humvee, we've lasered and tapped a mounting plate which gives us more thickness and a solid spot for the bolts to thread into and hold it tight, pinching the beam that's supporting the whole thing. It's time for the passenger box. The sheets we're taping to the side are called mica sheets. These are sitting on top of the modules inside of the original Tesla battery. They're designed to be a good insulator. And speaking of insulators, each one of these modules has a piece of plastic, a sliver of air, and another piece of plastic separating each one. It's important as we're driving down the road that none of them will actually be touching each other or jostling around. The box is tight enough to keep any friction from happening to the modules. And the mica sheet, along with the layer of plastic, is there to keep it from coming in contact with the edge of the box. We're pretty safe in there. [Drilling sounds] Phew! Now we just have to put that into there. Then once the box is in place we can take the bolts, along with a washer, insulated grommet, and slide it through into that bolt plate we left there earlier. [Drilling sounds] So it's time to wire up all these super fine tiny wires inside of the main high voltage junction box, the middle battery box. What we're using is this canon plug with 31 holes in it. It's called an HD30. [Drilling sounds] And the part we're mounting on the box has a flat part on top which keeps it from rotating when it's sitting inside of that little box. There's a lot of little wires in here but they're all relatively super kind of important. Luckily these are super easy to use and I'll show you how. So this is Jeremy and he's been wiring up the plug. We're pretty close to done but there's a couple left. This is the little pin that goes inside of the cannon connector. The receptacle slips over the wire and gets crimped into place with a special crimp that pinches it on all 4 sides. -So it's super easy, just push this in and wait for the click. -That was it? -That was it. -So right now I'm just wiring up the 2 aught cables that go to the plug leading outside of the box. And one of the things I really like about this crimp is that it actually leaves an imprint of what it's crimping on the actual lug. Let me show you. If you look on the back here really close you can see the little 2 aught kind of tattooed onto the lug there. And that's one of the ways you can tell that the lug is solid. Once again, I'm not an expert in any of this. I'm just doing it and pretending like I know what's going to happen. [Heat dryer sounds] Before we set the center box in, you will be pleased to know that I did clean up all the wires in the truck bed as well as organize the wires underneath the hood. They are not in their final placement yet sheathed in that plastic, but I did take some Linus Tech Tip's Velcro ties and get them in the general spot where they're going to be when it's all finalized. I think Linus thought that they were going to be used for computers and desks but here they are in an EV conversion. When everything's finalized I'm going to be sheathing all these cable strands and wires inside of this, a protective plastic cover that keeps everything super protected. But before we can do that we have to make sure everything works. Two of the three boxes are in the Humvee. It's time for the center and final box. [Drilling sounds] That looks good! [Heat dryer sounds] So we've weighed the two side boxes. Each of them weigh about 480 pounds. The center box is going up. Put your estimates down in the comments. We are looking at 324 pounds as it's completely suspended off of the table. We should probably put that back down. So doing the math, which I'm not an expert at, it looks like we have right around 1300 pounds worth of batteries. It'll be really interesting when we get to the end of this and we can see the weight difference between what it originally had and everything I've put into it. So we finally have all three boxes in place and it looks amazing. I'm a little biased. But let me show you how we're going to join them up. Because each of the boxes has two pieces of these orange cables going through along with the data cables and they're all passing through with this piece of conduit. Now this is really stiff. I can barely move it with my fingers because it's cold. But if we open this up we have one that's been cooking and it is extremely soft and supple and ready to be added between the boxes. There we go. And now we have the perfect pathway for the 2 aught to sneak through the watertight conduit into the center box. [Heat gun sounds] [Ratchet sounds] Ladies and gentlemen, I think it's finally time to see if this rolls. But quick, let me show you what's inside the center box. I might be stalling a little bit but just so you can know how it works from the inside. My view from back here looks pretty amazing. Obviously we have the electric motor up there, the negative most battery on this side. Positive most battery on this side. And this is what's controlling all of our power. And once the contactors are clicked, energy can flow out through the cable that we made the plug for, into the inverter and to the motor. And with all of that power so eloquently controlled in that center box, it is time to turn the key. We've been working on this project for well over a year now and there are so many different parts to this puzzle. It's weird to see it all come together right now. Let's see what happens. [Engine trying to start] I got you for a second there. This time we're going to do it for real. Turn the key, and we're going to listen. Got that first click....second click! I think this is driveable. Before we can go anywhere though it's nighttime and we probably need some headlights. We're putting the hood back on. An electric motor brought it into the garage and an electric motor will be the thing that brings it back out. [Dramatic music playing] It is time for a midnight drive. I think all the settings are right. This could be a very interesting drive. Oh man. Yeah! It's been a while since we've cleaned the windows on this thing. There's a parking lot right next to my house. We're going to pull in. This is so sick dude! Yes! It takes a minute to get used to for sure. Oh this is crazy. This is the first time this has moved in years. Wow. Alright, so the torque box is a little louder than I anticipated, but that, like, whining noise, like, that went away which was interesting. That went away after a couple minutes. And now it's back so it must be when you're going really slow. Alright, first impressions here on my very first drive. We haven't gotten the settings totally dialed in yet. Honestly it's a little bit noisier than I thought it would be. But it is incredibly fun to drive. I think we need to dial some more stuff in with the VCU. But it's amazing that it's actually moving. It's literally been sitting in my driveway for two years as we planned this and for one year in my garage as we've been putting it together. The videos might make it seem like it looks easy, but it's actually been like a hundred hours per video that we've made. It's taken a lot of time but so far I'm super happy. It's a very unique ride that I've never, you know, driven before. And we can't go very far because we haven't hooked up the cooling system yet. It's winter so I'm not super worried about it. The batteries aren't going to overheat, but I am worried about the motor and inverter. So we can't go super far. We will do that in a future video along with taking it on a more, you know, off road real world drive. Hopefully by then we have everything dialed in. But it is super exciting. What do you think, Jacob? -Yeah those brakes work great. -What about the rest of it? -Yeah, it's, I mean it's kind of hard to drive with one hand. -We haven't gotten the brake switch added to the pedal yet so we're just manually controlling it. We are in a parking lot though. That's what parking lots are for. Heck ya, dude! Does it look weird facing that direction? I think it does a little bit. I mean obviously there's a lot more we need to do. This is just the first drive. It was struggling a little bit when we first left the garage. And then we punched a random number torque-wise into the VCU and it's working fine, but there's a lot more we can dial in. This whole thing has just been a massive learning process for me. This is the very first electric vehicle I've ever built and one really cool thing about learning is that you can do it whenever. Which brings us to KiwiCo. KiwiCo's mission is to provide the next generation of innovators with the tools and the foundation to become creative problem solvers and critical thinkers. They do that with fun monthly hands-on projects and activities like this one about slime circuits. Turns out when you add borax and glue to water you get some cool looking slime that actually conducts electricity and makes little circuits. It is infinitely safer to learn about electricity using slime circuits than it is building your own electric vehicle. It's a lot cheaper too. These monthly crates are designed by experts and are a great resource for learning at home. It's super fun. There are 8 different subscription lines catering to different age groups and topics from toddlers to teens, all the way to adults. My wife still gives out these subscriptions as gifts for holidays or birthdays and my nieces have a lot of fun with them. And personally I think the STEAM projects, science, technology, engineering, art, and math are a lot more fun when it's hands-on. That's my favorite. But you don't have to take my word for it though. They've shipped over 30 million crates and you can get your first crate for free with the link down in the description. KiwiCo.com/JerryRig. So while the Hummer is indeed now mobile, there are still quite a few things we need to do on it like add cooling so we can drive farther than just my neighborhood. As well as make sure everything is programmed and working nicely together. And then we can take it out for a real drive. This is going to be a work in progress for the next long while. So if you haven't hit that subscribe button, I would appreciate it if you did. Hit that notification so you don't miss any future uploads. Come hang out with me on Instagram and Twitter. Sometimes there are sneak peeks over there. And as always, thanks a ton for watching. And I'll see you around.",
    "transcript_keywords": [
        "box",
        "battery box",
        "boxes",
        "Inside",
        "center box",
        "plug",
        "battery",
        "wires",
        "side",
        "middle battery box",
        "back",
        "super",
        "aught",
        "aught cables",
        "time",
        "Humvee",
        "thing",
        "cables",
        "Hummer",
        "lot"
    ],
    "transcript_entity_values": [
        "an inch and a half",
        "some half inch",
        "OshCut",
        "324 pounds",
        "1300 pounds",
        "Humvee",
        "about 400 pounds",
        "Hummer",
        "8",
        "Instagram",
        "two",
        "three",
        "Jerry",
        "two years",
        "one",
        "Two",
        "AC",
        "Humvee",
        "DC",
        "31",
        "a minute",
        "500 pounds",
        "years",
        "a couple minutes",
        "monthly",
        "4",
        "RTV",
        "VCU",
        "3 16th",
        "EV",
        "Whisper Project",
        "12 volt",
        "the Galaxy Fold 3",
        "half inch",
        "USA",
        "Linus",
        "three days",
        "one year",
        "over 350 pound feet",
        "one day",
        "Tesla",
        "first",
        "second",
        "a year",
        "the half inch",
        "midnight",
        "over 30 million",
        "winter",
        "today",
        "Today",
        "Jacob",
        "a hundred hours",
        "30",
        "One",
        "about 3 feet",
        "about 480 pounds",
        "BMS",
        "OshCut",
        "Jeremy",
        "Twitter",
        "Drill",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "FAC",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "DATE",
        "TIME",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "FAC",
        "QUANTITY",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}