{
    "id": "gj4x9YaUATU",
    "title": "LOL Facebook, get rekt",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2022-02-05T03:25:49Z",
    "video_url": "https://www.youtube.com/watch?v=gj4x9YaUATU",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Riley",
        "Meta",
        "Facebook",
        "stock",
        "Meta stock",
        "Facebook stock",
        "Facebook users",
        "daily active users",
        "Meta value",
        "Facebook value",
        "Meta VR",
        "Horizon Worlds"
    ],
    "views": 740494,
    "likes": 43871,
    "comments_count": 1187,
    "description": "Visit  to get started learning STEM for free, and the first 200 people will get 20% off their annual premium subscription.   LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES:  --------------------------------------------------- Timestamps: 0:00 Haunted Linus 0:12 Meta loses users + money 1:26 Apple 'reduces' App Store commission 2:29 Intel bashes AMD vulnerabilities 3:29 Brilliant 4:12 QUICK BITS 4:18 Chromebook Repair Program 4:41 Reddit downvotes 5:02 Amazon Prime price hike 5:37 GTA V on PS5, GTA 6 later 6:01 Meta VR personal boundaries  FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://www.brilliant.org/TechLinked/",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/JarhT",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked"
    ],
    "transcript": "- Whoa, jeez. Ah, there's a lot of tech news flying around here today. - [Riley] Linus, are you okay? - What, you can't see them? - [Riley] Are they in the room right now? - Yeah, here look. Here's one, boom. - [Riley] Ah. - Got him. Meta suffered a monumental blow this week, when it reported a drop in daily active Facebook users for the first time since the platform launched 18 years ago. I don't have my prompter remote 'cause I threw it at Riley. As a result, the tech giant stock dropped by over 20%, wiping out over $250 billion in value, the single biggest valuation wipeout for an American company in history. - [Riley] What about General Electric? - Now, usually it would seem rude to revel in others' misfortunes. But after Facebook's tumultuous history of hiding data about its problematic psychological impacts, while leaking vast amounts of user data that it sells to advertisers, well, let's just say the internet didn't have very many F's to give. On top of all that, Facebook is facing a lawsuit from Australian billionaire, Andrew Twiggy Forrest, over what he describes as its failure to stop criminals, using his image to advertise for crypto scams. Making things more confusing is the fact that Forrest is in the business of mining, but not crypto mining, like the real one. - [Riley] Oh. - Will Facebook survive of this? Yes, yes, they will. But it's okay. Let's just a moment and chat and Freud together. (Riley laughing) - [Riley] Eat it, Facebook. - In the Netherlands, Apple has offered to reduce its commission on iOS in-app purchases from 30% to a generous 27%, when users use a payment processor other than Apple Pay. - [Riley] How nice. - And honestly, I feel like we should be thanking them. 3% can do a lot, if you invest it. - [Riley] They're still doing well. - The announcement comes after Dutch regulators ordered Apple to allow the use of third-party payment processors in iOS dating apps and fined the company 5 million euros for missing the first deadline to comply. Many experts analyzing the Epic-V-Apple lawsuit expected Apple to continue to charge a commission, if third party payments were allowed. But since a 3%-drop might not actually even cover the transaction fees of whatever Apple Pay alternative is used, many developers are wondering if switching is worth it. And then, there's also the fact that you're trying to use iOS, Apple's intellectual property, without paying them a third of your income. Have you any morals? - [Riley] Can you imagine getting a desktop that's for free? - That's their property in the metaverse. And Intel has pulled another Intel with a new report comparing the number of hardware vulnerabilities found in Intel's chips versus those from its arch enemy, AMD. Intel's 2021 security report notes that 31 flaws were discovered in AMD CPUs, while only 16 were found in Intels. Intel did have almost twice AMD's flaws in their GPUs, but actually, apparently, that's due to a component found in Intel graphics chips made by (coughs) AMD. - [Riley] They're beautiful flaws. - This would all kind of make sense if every flaw was equally dangerous, but not all vulnerabilities are as bad as the one in Helm's Deep. That single explosive, I mean, we didn't see that coming. Besides, Intel and AMD should probably focus on unity right now, since 23 serious flaws were just found in UEFI firmware that's actually used by both of the companies and many others. So it's time to stop fighting. - [Riley] Yeah. - I mean keep fighting, but fight bad guys, not each other. - [Riley] Oh. - And no groin shots. Time for a Riley break. - Now, it's time for \"Quick Bits\" brought to you by Brilliant, the easy way to learn new things as part of your New Year's resolution. Yeah, I know you forgot about it a month later. That's why you need Brilliant. They make learning STEM concepts with dense-sounding names, like algorithm fundamentals and scientific thinking accessible and fun, because it uses active learning with engaging problems to solve and interactive visual concepts to play with. There's no harsh grading, long lectures or strict time limits. I mean, it sounds to me like Brilliant should run for school board president 'cause that would be a awesome. So crush your 2022 goals and use the link below to join Brilliant's community of 8 million learners and educators today. And the first 200 people can save 20% off a year of STEM learning, Brilliant.org/TechLinked. Get smart. - You, guys, totally thought I was gonna give you a break from Riley, but it was a break of Riley. - [Riley] Was it a what? - Google has gotten into the right-to-repair spirit with their new Chromebook repair program, which will help schools set up repair facilities, partially run by and for students. The program is obviously meant to help Google compete against recent pro-repair moves made by Microsoft. But that doesn't mean we can't celebrate the fact that the program encourages fixing devices, instead of chucking them. There's a different school program for that. - [Riley] That's a star player. - Twitter is initiating a wider rollout of its Reddit-esque downvoting feature, which will now be offered to a selection of users worldwide. For now, the downvotes will only be visible to the user that does the downvoting, so you won't have the satisfaction of knowing you just taught that person a lesson. And they're probably still just gonna post the same meme for the 200th time. But to be fair, guys, it is a funny meme. - [Riley] Great GIF. - Amazon is increasing the price of its all-encompassing Prime subscription service for the first time in four years. Now, access to free same-day shipping, ha ha not really free, some books and music, some Twitch stuff, and some TV shows that, It says mediocre in here, but I don't know- - [Riley] They're okay. - I haven't watched any of them, will cost 139 US dollars a year instead of 119. Thankfully, there is a way to secure one more year at the old price, that'll be in the news sources down below, or you could just not. - [Riley] eBay is a thing. - I mean, Daddy Bezos gotta have them rebuild that bridge for his yacht, right? - [Riley] He should have the rocket. - Rockstar has confirmed that Grand Theft Auto V will go through one more zombie mutation and lurch (groans) onto Playstation 5 and Xbox series S and X on March 15th. - [Riley] Not bad. - The studio also announced that they're working on the next Grand Theft Auto, which will come out at some point, probably involve stealing cars- - [Riley] What? - Maybe Grand Theft Auto Vs. - [Riley] In space. - In space. (laughing) We could be wrong. And Meta might be struggling, but they are adding a personal boundary system to their Horizon Virtual Reality World, VR chat, poppy thing. It will prevent other avatars from getting too close to yours, which may help prevent virtual harassment initiated by creeps online. Somehow, those creeps got online. - [Riley] What? - How do they do that? - [Riley] Stop. - Although pushing up against the boundary would probably be just as creepy, they're just, yeah, let's make it- - [Riley] Right, it's just like if they're just here. Is that as- - Yeah, it's still weird. And what's also weird is this video's over. - [Riley] What? - There was all that tech news flying around. I swear I saw it. - Not, it's in your mind. - That wasn't that much. - [Riley] Get it. Get this man some help. - We need more of us. Come back on Monday. Come back on Monday.",
    "transcript_keywords": [
        "Grand Theft Auto",
        "Intel",
        "Apple",
        "Facebook",
        "Grand Theft",
        "Theft Auto",
        "time",
        "Apple Pay",
        "AMD",
        "Riley",
        "Brilliant",
        "Year",
        "Yeah",
        "Andrew Twiggy Forrest",
        "flaws",
        "found",
        "active Facebook users",
        "Theft",
        "Grand",
        "Auto"
    ],
    "transcript_entity_values": [
        "18 years ago",
        "Forrest",
        "31",
        "Helm",
        "one more year",
        "General Electric",
        "Intel",
        "Chromebook",
        "Riley",
        "Freud",
        "New Year's",
        "20%",
        "four years",
        "one",
        "3%",
        "2021",
        "Google",
        "Twitch",
        "119",
        "Meta",
        "Riley] Linus",
        "Dutch",
        "a year",
        "a month later",
        "Amazon",
        "Reddit",
        "over 20%",
        "Bezos",
        "200",
        "30%",
        "American",
        "March 15th",
        "139 US dollars",
        "Intels",
        "Microsoft",
        "over $250 billion",
        "Andrew Twiggy Forrest",
        "5 million euros",
        "2022",
        "daily",
        "third",
        "Australian",
        "first",
        "AMD",
        "AMD",
        "8 million",
        "Facebook",
        "\"Quick Bits",
        "UEFI",
        "Riley",
        "Monday",
        "Grand Theft Auto V",
        "eBay",
        "this week",
        "Grand Theft Auto",
        "a third",
        "23",
        "same-day",
        "Xbox",
        "Rockstar",
        "Netherlands",
        "27%",
        "200th",
        "Apple",
        "today",
        "Playstation 5",
        "only 16"
    ],
    "transcript_entity_types": [
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "EVENT",
        "PERCENT",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "NORP",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "NORP",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "PERCENT",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL"
    ]
}