{
    "id": "gkmzDwgvqQM",
    "title": "This Smartphone is Built Different...",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2021-12-06T18:26:25Z",
    "video_url": "https://www.youtube.com/watch?v=gkmzDwgvqQM",
    "category": "Science & Technology",
    "tags": [
        "Fairphone",
        "modular phone",
        "repairable phone",
        "right to repair",
        "MKBHD",
        "fair phone",
        "repair",
        "tech repair",
        "iPhone repair",
        "repair program"
    ],
    "views": 3174949,
    "likes": 149248,
    "comments_count": 7485,
    "description": "The Fairphone 4 is the most modular, sustainable phone in the world.  The FairPhone:  Another way to save the planet #teamseas:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Phone provided by Fairphone for video.  ~",
    "description_links": [
        "https://www.fairphone.com/en/",
        "https://teamseas.org",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube/com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "- Hey, what's up? MKBHD here, and this, this is not a normal phone. (upbeat music) So, you know, they say the best way to act is if everyone else acted like you, then the world would be great. Be the change you wanna see in the world, right? So in this world of constant e-waste and this fight for better, more repairable gadgets, this is called the Fairphone 4, and it's aiming to do exactly that. So at first glance, it's a pretty basic looking phone. It's 579 euros, or about $650. And that gets you a clean, basic design, flat front and back, curves at the corners, a little on the big side, but nothing we haven't seen before. That's a 6.3 inch, 1080P display up front, a metal frame, a fingerprint sensor on the power button, and USB-C at the bottom, and it has 5G, which previous Fairphones didn't have. It looks pretty good, but that's just at first glance. This phone is designed from the ground up to be sustainable, modular, repairable, and upgradable by you. That is very unlike any other phone out right now. So, how do they do it? Well, you start with the basics. You saw the packaging, which is recycled paper and cardboard printed with soy ink so this packaging is entirely sustainable. Then the phone itself is pretty easy to get into for anyone, not just professionals, anyone. So you get into this notch down here, built into the corner of the phone, and that lets you pull off the soft touch, fully recycled plastic back cover and that lets you get into all the parts of this phone. So the 3900 million power battery, that can be easily popped out, replaced just like the good old days, and then the rest of the pieces are all easily accessible by just 12 screws. So you just need a little Phillips screwdriver to jump right in. And then, each of the parts pops right out like a puzzle piece. So it isn't necessarily individual components, but the camera and speaker housing up here at the top can be removed and replaced pretty easily. If you take off the bottom, you can replace your speaker module for a new one. I literally just popped a ribbon cable off and was able to remove just the USB type C port from this phone. So if your port breaks or gets loose, you don't have to replace all of the inside of your phone, you don't have to pay someone an exorbitant amount of money, you don't have to throw it all out and buy a whole new phone, you just head over to Fairphone's website and scroll through the list of modules and pieces that they sell and buy exactly which one you need. Then when you get it, you take the phone apart pretty quickly and easily, and can replace it. So like I said, it's not like other phones. You know, these days in a normal smartphone, if one little part breaks typically that's, you know, you have very limited options. Where Fairphone envisions a future where anyone can identify something broken or something they wanna upgrade and just do it themselves. So that'll include your battery, your rear-facing camera, your front-facing camera, your speaker, your earpiece, your USB port, and, of course, your display. The whole front, the display, is easily removable with a single ribbon cable. And that replacement to the user is 80 euros. And honestly, very easy to do yourself, unlike pretty much every other smartphone. This one scores a 10 out of 10 repair score from iFixit. There's no glue, no complex screws, nothing to make it unnecessarily difficult to take apart. And it comes with a five-year warranty, including a promise to support the phone and sell the spare parts for five years after the phone comes out, it's a dream. So I am a huge fan of this vision, but it's worth noting, it's not perfect, right? This is where the inner instinct to review everything comes out for me. Like, if you were to buy this 650ish dollar phone, there are some obvious trade-offs. So let's just, for the sake of example, take the Fairphone up against if you were gonna buy a phone, something else of similar price like Pixel 6. So for one, the Fairphone is a thick phone with about three Cs, right? So it's a little bit thicker and heavier than a Pixel, but just enough where it's not bad, but you can tell a difference in the hand. And the specs and performance are just on different levels. So the Pixel's tensor chip feels roughly equivalent to a high-end Snapdragon 8 Series, maybe a triple eight or an 865. The Fairphone has solid specs, but definitely closer to mid range, Snapdragon 750G and six or eight gigs of RAM with 128 or 256 gigs of storage. That incredible removable battery that I talked about, it is 3900 million powers, but that is smaller than the 4,600 that they fit into the Pixel 6. And then the display, well, it's pretty big and bright and covered in Gorilla Glass 5, it would also be a relatively weak point in a phone in this range at 1080P, 60 Hertz, LCD. Phones like the Pixel 6 would get you a larger, brighter, higher refresh rate display that gets much closer to the edges and is OLED with all the color and feature benefits that come with that. And then, of course, we all know about the Pixel and its new cameras. The Fairphone, those have a 48 megapixel main camera, and a 48 megapixel ultra-wide, and a time of flight sensor in it's array back here, but they're acceptable. It looks kind of like a Moto G or a Samsung A Series phone where they'll give you passable photos in decent light, but as soon as the conditions get tough, they kind of fall apart. There is also a slightly lesser IP54 splash resistance rating for this phone, which is actually kind of amazing for a phone built like this, but that is less than the IP68, the full submersion protection for the Pixel. There's also no wireless charging. The point is, you know, these two phones are pretty similar functionally, they're both Android phones, but as a customer choosing to buy one, you'd have to really value the repairability and the sustainability offered by the Fairphone to pick it over the Pixel, or really any other phones in this range. Now part of that is because it's hard to do all of those things in a super tightly built gadget and do all of their repairability and modularity on top of that. But also the other part is, it's a small company that doesn't have the same resources to make an incredible world-class bleeding edge phone that's tightly packed, and keep the sustainability stuff in their supply chain, and keep the price competitive. So, here's my take. There is no such thing as a 100% sustainable phone like this. Like, if you go back far enough, you will find things eventually that are imperfect. So there is no perfect sustainable smartphone. But the Fairphone represents the furthest anyone has ever gone by far. There's a lot of different materials that go into building a smartphone, plastic, glass, aluminum, nickel, copper. Fairphone goes the extra mile to source those build materials fairly and responsibly, which definitely costs more. So the back cover of this phone, like I mentioned, is made from 100% recycled plastic, and over 50% of the plastic inside this phone is post-consumer recycled. Then, the aluminum rails come from an ASI certified vendor, meaning worker health and safety are protected and no child labor is used. And even for other mined materials like tin and tungsten and the lithium in the batteries, they make sure to invest in sustainable sources or use mines that have been assessed by IRMA, the Initiative for Responsible Mining Assurance. But even so, the world still has a cobalt shortage today, so mining it at all is not ideal. We really should be recycling it way more than we do, but a ton of the world's cobalt is sitting in drawers. There's apparently 300 million phones just sitting, hibernating in drawers right now doing nothing, in just Germany and France. Imagine how much that scales up for the entire world. And then, of course, you can go even further and further back, like I can already see the YouTube comments like, well, what about the computers they're using to design these, are those sustainable? What about the buildings that they operate out of? Was there solar panels on the roof of the studio they shot their commercials in? Like nothing is 100% perfectly, wholly sustainable, and even Fairphone could do better. There is no charger in the box in the Pixel 6 and a lot of other phones in that price range and there's also no charger in the box for the Fairphone. But like I said, Fairphone is setting the bar by going farther than anybody else. And even in the case that they're not perfect, Fairphone the company is pledging their entire company to be e-waste neutral, meaning for every phone they put out into the market, they collect an equal amount of e-waste. That explains the slot in the packaging where you can drop your current device and send it back to them to be recycled. This is the most sustainable phone in the world, and it's a real phone that you can buy, kinda, it's only available in Europe so to get it to the U.S. I had to import it, but it's real, it's a real phone, so it can be done. So, the real question is, this is one, can other phones be this sustainable too? Yes and no. So one curious thing that was mentioned in Fairphone's official video when I was on their site is that they have to, in order to offer these five years of replacement parts, they have to maintain a good relationship with those parts vendors and their suppliers. And so, they can't use too extreme or too low supply versions of parts, they need to use mostly average parts. So the phone has to be an average size and use mostly average specs. Like, basically, Fairphone the company isn't big enough to be designing every single thing inside their own silicon, their own image sensors, their own displays. So they're bound by those suppliers and what they can continually supply. But even for the others, these mega companies out there who don't have those same bounds, we are often rewarding the phones out there that are pushing the limits, that are actually unique, and that are different for a change. That is, by definition, the opposite of average. That is the opposite of sustainable. But I still think there's room for these other companies to take parts of what Fairphone is doing. Things like not using a ton of glue and not using a bunch of different complex screws and just making their parts in general, a bit more accessible and more repairable and thus a bit more sustainable. So look, I don't think Fairphone is ever expecting to be a leader, a global leader in smartphone sales, like, they're never gonna pass Apple, or Samsung, or Huawei, or anything like that. But, what they are doing is proving that there are real ways for smartphone companies to do better for all of those companies to have better practices. And even small changes from those companies can make a big difference. So from here on out, I want to make a pledge to include some section in all of my future smartphone reviews on repairability and sustainability, just to shine a light on that and give those companies a reason, a reward, to make those compromises. And, as for you and I, we can do a much better job of recycling our old electronics. So, do you have a smartphone sitting in a drawer, unused, gathering dust? Recycle it. Anyway, we only have one earth, hot take, we should be taking better care of it. That's about it for this video, thanks for watching. Catch you guys on the next one, peace. (upbeat music)",
    "transcript_keywords": [
        "phone",
        "Fairphone",
        "phones",
        "Pixel",
        "sustainable",
        "parts",
        "sustainable phone",
        "pretty",
        "smartphone",
        "world",
        "back",
        "real phone",
        "buy",
        "make",
        "companies",
        "display",
        "easily",
        "recycled",
        "Series phone",
        "real"
    ],
    "transcript_entity_values": [
        "5",
        "today",
        "over 50%",
        "iFixit",
        "Apple",
        "G",
        "just 12",
        "579 euros",
        "one",
        "Huawei",
        "Europe",
        "750",
        "Hertz",
        "80 euros",
        "LCD",
        "Moto G",
        "about three",
        "Series",
        "IP54",
        "256",
        "eight",
        "6.3 inch",
        "128",
        "10",
        "Pixel",
        "ASI",
        "Android",
        "650ish dollar",
        "first",
        "USB-C",
        "Fairphones",
        "3900 million",
        "the Fairphone 4",
        "865",
        "4,600",
        "these five years",
        "Samsung",
        "Cs",
        "Fairphone",
        "about $650",
        "five years",
        "the Initiative for Responsible Mining Assurance",
        "five-year",
        "France",
        "YouTube",
        "Germany",
        "RAM",
        "U.S.",
        "1080P",
        "6",
        "six",
        "60",
        "IRMA",
        "300 million",
        "48 megapixel",
        "two",
        "100%",
        "Phillips",
        "a ton",
        "USB",
        "these days"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG",
        "NORP",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "DATE",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "GPE",
        "ORG",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE"
    ]
}