{
    "id": "gknaNAhSJFY",
    "title": "What the Heck is \"FAST IPS?!\"",
    "channel": "Greg Salazar",
    "channel_id": "UCmbkRUS_4Efdt5UIhwNqtcw",
    "subscriber_count": 895000,
    "upload_date": "2022-07-20T00:16:41Z",
    "video_url": "https://www.youtube.com/watch?v=gknaNAhSJFY",
    "category": "Science & Technology",
    "tags": [
        "what the heck is fast ips",
        "pixio px277",
        "pixio px277 pro gaming monitor",
        "px277 pro",
        "fast ips",
        "px277 prime",
        "pixio px277 pro vs prime",
        "pixio px277 pro review",
        "gaming monitor",
        "ips",
        "greg salazar",
        "budget gaming monitor",
        "Pixio"
    ],
    "views": 61781,
    "likes": 2084,
    "comments_count": 237,
    "description": "Monitor terminology can be very confusing! Not only do we need to account for various screen technologies - there's plenty of marketing jargon baked in as well! Let's discuss what the heck \"Fast IPS\" is and how it looks to the human eye.   Consider supporting us on Patreon!   Learn more about the Pixio panels tested in this video: Pixio PX277 Prime   Pixio PX277 PRO    Snag an OEM Windows 10 Pro key for $16 using code 'SKGS' for a 25% discount: Win10 Home ($15): Office 2019 ($48):    My studio gear on Amazon: Sony A7C (Primary):  Sony a6600 (Secondary):  Sony a6400 (Webcam):  2x Pixio PX277 Prime 165Hz IPS Monitors:  Neewer LED Lighting Kit:  Audio-Technica AT2035:  Yamaha MG10XU Mixer:  Neewer Microphone Arms:  Arrowzoom Sound-Damping Foam Panels:    Follow me on social media: TWITCH:  FACEBOOK:  TWITTER:  INSTAGRAM:    Join our public Discord server:   DISCLOSURES: All Genius links are tied to our Amazon Associate account, from which we earn a small sales commission. Links containing a 'bit.ly' reference forwarding to Newegg are tied to our Rakuten account, from which we earn a small sales commission. All sponsored links and comments will contain the word \"SPONSOR\" or \"AD.\" Any additional revenue stream will be disclosed with similar verbiage.",
    "description_links": [
        "https://www.patreon.com/gregsalazar",
        "https://geni.us/Mvwft0",
        "https://geni.us/BnrpPYf",
        "https://bit.ly/Win10SKGS",
        "https://bit.ly/homeSKGS",
        "https://bit.ly/2019SKGS",
        "https://geni.us/lOeoIA9",
        "https://geni.us/k8VBToq",
        "https://geni.us/24nqw",
        "https://geni.us/bCg4nD",
        "http://geni.us/9VTXr0",
        "http://geni.us/xvQc",
        "http://geni.us/d4VvGM",
        "http://geni.us/1w5Sx2Y",
        "http://geni.us/EKFxZc",
        "http://www.twitch.tv/GregSalazar",
        "http://www.facebook.com/GregSalazarYT",
        "http://www.twitter.com/GregSalazarYT",
        "http://www.instagram.com/GregSalazarYT",
        "https://discord.gg/jYA9Xvp"
    ],
    "transcript": "Wow. Okay. Yeah. It's a bit messy in the room right now. You guys don't get to see much of this though. The beauty of videography is that I can totally hide all of it and just start with a shot like this. This here is a gaming monitor or content creation monitor. You can do a lot with this thing. Actually, this has been my daily driver. I have a set of these. I have a pair for, over two, three years now. This is the Pixio PX277 Prime and it's 165 hertz. I think it's IPS and it's 1440p. It's all around an excellent affordable panel. It's one of the better value ones out there. And I've recommended it for a good while. But there are a few issues with IPS technology and Pixio has attempted to remedy one of these, in a revision of this panel. They call the PX277 PRO. I wanna preface this video by mentioning that we do already have a video on the channel talking about how IPS technology is different from VA technology, OLED technology and even TN technology. These are pretty, pretty common. I would say at this point with the exception of maybe OLED monitored technologies out there. So when it comes to displays and how they work, how the pixels either produce their own light or are lit from the back light. And then you have polarizers and color filters and it gets really complicated. Just watch those videos. If you don't know how this stuff works and it's not like the ultimate in depth guide. But it will kind of, you know, get you familiar with some of the terminology. You might hear us mention in this one. So the gist of IPS displays is that their color reproductions tend to be pretty accurate, nearly on par with what you would see, you know, with your own eyes, your own naked eye in person. So, you know, attempting to replicate that on screen of course, there's a lot of magic involved. And so the final image that you see on the display might look a bit washed out or maybe too saturated, or maybe the contrast doesn't look right, or maybe there's just a lot of fuzz and it's not very sharp. IPS tends to reproduce a natural image the best and that's why it often is a more expensive technology in monitors over say VA, and especially TN. Now there are advantages to TN and one of those is ghosting. And what I wanna talk about in this video is how Pixio is addressing the ghosting problem, with their new fast IPS displays. Now, when you hear the word fast you might think, well, okay, you know 165 Hertz display, that's really quick, right? I mean, this is 144 Hertz right now. But still that's a really high refresh rate. That must be a quick monitor. But fast in this context is referring to the ability for an image on screen to disappear. The ability for those liquid crystals to shut and open, right? How fast those window shutters can close and open, determines how quick, how fast a display technology is. Now I want you to look at this slow motion shot of a Pixio PX277 Prime. Again, this is the the monitor that I've been using for a very long time. And there's really nothing wrong with this here that you're seeing. There is a bit of ghosting, but it's not super apparent. Now in the context of gaming this could be a problem. You could see in other situations where it'd be difficult to read text on screen. Let's say if the text is moving too quickly if you're playing a first person shooter game like CSGO and you're panning across your screen, and you just get a glimpse of somebody maybe far away in the distance. You might not be able to read that name. You might not be able to notice that it's a person. You might think it's something else because that image is a bit too blurry, right? Those previous frames haven't disappeared quick enough. And so you see kind of like just these weird tails around objects when they're fast moving. That's what this blur busters DOTA2 slide is for. So up top, you've got 60 FPS and at the bottom you've got 144. The higher refresh rate you would just infer naturally, would allow you to see more detail on screen, pick up more information because you have more information being displayed per second. That would be beneficial to the player but at a certain point, adding additional frames per second becomes pointless in a traditional IPS panel. And the reason why is because you'll just, you're just essentially adding more remnants of previous frames to said image. So you've got this large blur, essentially around very important objects that can make reading text very difficult. That can make seeing objects on screen very difficult. And as a result, it's just not desirable. You'll see a lot of eSports players actually avoid IPS panels and it's not because they don't want pretty colors. That would be pretty cool. But the colors aren't necessarily as vital as having a clear, fast moving image. And that's why a lot of 'em actually use cheaper TN panels. Maybe they'll be higher refresh rate TN panels. So the cost kind of offsets itself. But TN technology actually does a really good job at getting rid of those previous frames quickly. The response times of TN panels are great and that means that ghosting is minimal. So you get very, very clean, fast moving images. And that's what, oh Jesus, that would've been really bad. I scared the mess out of me. I thought the whole panel was just gonna fall apart right here on camera. Well, at least I recorded that. I'm sure Jeremy will leave it in just for the LOLs. Anyway, that's where the PX277 PRO comes into play. This is advertised as a fast IPS panel, which as you can infer, just based on the topic of this video, it means that ghosting has been reduced. So those faster moving images, like in this case, you can see the UFOs sliding from left to right. These UFOs don't have as noticeable tales. And that's because those previous frames are disappearing faster. Those liquid crystals are opening and closing quicker. So those older frames are just, they're just vanishing right before our eyes. This looks very similar to some modern TN panels. And I'm very impressed by this because you're not losing color, right? And that's one of the huge side effects of opting for TN. You just don't have great color reproduction. Twisted pneumatic displays have pretty much always had that as their achilles heel, but with fast IPS now, you get the best of both worlds. You just compare these side by side. You can see how much smoother and how much cleaner, the PROs image is. This is pretty stunning. Actually the first time I've seen a fast IPS display in person. Pixio is not the only monitor manufacturer by the way, that is selling fast IPS panels. I wanted to mention that as well. This isn't like a Pixio exclusive thing. In fact, Pixio a lot of times will use displays from other actual manufacturers. They'll just rebrand them. They'll maybe change some internal aspects of, the housing, maybe they'll integrate or not integrate the AC adapter, et cetera. The stand is always gonna be a bit different. This stand actually is pretty versatile. Rotates, pivots and you can also tilt up and down. So that's cool, bit of a tangent there, but yeah I was overall very impressed with how much cleaner the image looked in this fast IPS panel. The one thing I'm kind of concerned about is price though. Because as I'm sure you're aware, having a faster, lower response time screen, isn't really, I don't know. It's not the biggest selling point for folks. And it's just because a lot of, you know, untrained eyes, let's say aren't gonna notice, obviously you guys watching this one if you haven't already heard of it by now you do know what to look out for when you hear the term fast IPS. But you know, the layman, the average gamer, just buying an affordable panel, they're not gonna know. So is the price difference worth it? So it looks like the PX277 Prime, you can purchase this for $259ish US dollars as of time of filming. I'm totally doing this off the cuff. I didn't know the prices going in and making this video. Now the Prime, which is again, that's the non-fast IPS display. I've been using two of those for my personal editing rig. The display elsewhere is pretty much the same, at least, from what I can just tell from the naked eye. The color accuracy looks to be on par, same 165 Hertz max refresh rate, with display port cable, same dimensions, 1440p the only physical difference I could tell apart from the small, kind of subtle RGB in the PRO panel is the stand. The stand is noticeably cheaper in the Prime. Now, if you're gonna be using like a third party, base or mount, it doesn't matter anyway. But the PRO definitely has the superior stand. The PRO, however, the fast IPS panel, this one here sells for $369.99 So that's about a hundred dollar difference. And again, with the ghosting difference aside, you do get the stand advantage. You get a little bit of RGB, that doesn't really make much of a difference here. There are smaller, I would say less significant differences, between the two. But the fast IPS mention, is I think the biggest selling point here. And I'm not sure it's worth the a hundred dollars difference for eSports gamers who are just dead set on also having a color accurate panel. Fine. This makes a lot of sense and look, $369 for a decent 1440p high refresh rate display is really not that bad. You could be spending a lot more for a display that looks pretty similar. And that's one of the reasons why I'm such a huge fan of Pixio. They're like the, I don't know they're like the Honda of displays. Like I don't mean for that to be insulting. But they just work, right? Hondas just work. They're pretty reliable cars. These are pretty reliable panels in my experience. And you get a lot of bank for your buck. They're affordable, for the most part. They don't have any like super, super high end flagships. That's gonna cost you like two or three grand. They stick with what works and what is attainable by a majority, I would say. And that's why I've used them. I try to practice what I preach and I try to buy and personally use things that, you know, that I could see myself using if I wasn't being sent stuff for free. And, and this is certainly one of those. I think the PRO is a contender. The Prime is the better value though. I will say that if you're just interested in having a color accurate panel that's also a higher refresh rate. 27 inch diagonal display size, 16x9. Of course, this is an ultra wide, there's no curve here. I think the Prime is fine but the PRO it steps it up a notch. I'm not sure if it's worth a hundred plus dollar delta. But at least now, you know what fast IPS means, right? So again, I wanna show you both of these on screen just so you know what you're really getting here for the dollar. The image on the right is by far superior, much cleaner. There's a less noticeable tail. It's significantly smaller, shorter, and that's because the display can switch between frames much faster. Essentially what we're talking about here is response time. When you hear that term being tossed around it doesn't mean probably what you would think it means on paper. Response time as in like, if I push a key, how quickly will it show up? You know, as an input on screen, that's input lag. That's a different thing. And most gaming monitors are gonna have very low input lag. But when you hear response time like let's say gray to gray. That's testing how quickly a frame can appear and then disappear. With that, I hope you enjoyed watching this video. Pixio just sent these two panels out and I really have no use for them. Because again I have the two that I've been using for so long. They're tried and true and I'm not gonna change anytime soon more than likely. So I'm just gonna give these away. If you live in and around Orlando, Florida you wanna come pick one up send me an email, just actually, you know what? Don't do that. Don't send me an email. Jeremy's gonna leave it in the video. I know he is. I'm gonna get bombarded with emails for no reason. Send me a tweet. If you don't have Twitter, I'm sorry. That's just the best way to contact me. It's the quickest. If you want a free Pixio panel and you live in around Orlando, Florida. Just give me a shout and we can arrange for pickup. If you aren't local, don't bother. You have to be local and you have to be the person meeting me. You can't say, hey, I'm gonna have a buddy come and pick it up for me. Is that cool? That's not gonna fly. It's gotta be you in person. And if you're willing to do that, you can take one of these off my hands, one per person. And I'm not gonna tell you which one I'm gonna give you. It's gonna be either the Prime or the PRO, but at least you'll get a free gaming panel. So a little extra here to end this one out. If you guys enjoyed watching this let me know in the comments section below, you know, just say what you liked, I guess, or maybe what you didn't like. Consider giving this one, a thumbs up, if you did, in fact, enjoy it. Consider subscribing if you haven't already. And I think that's about all I have to say on this one. My name is Greg. Thanks for learning with me.",
    "transcript_keywords": [
        "fast IPS",
        "fast IPS panel",
        "IPS",
        "IPS panel",
        "fast",
        "panel",
        "Pixio",
        "fast IPS displays",
        "IPS panels",
        "display",
        "PRO",
        "Prime",
        "pretty",
        "IPS displays",
        "panels",
        "lot",
        "IPS technology",
        "image",
        "screen",
        "technology"
    ],
    "transcript_entity_values": [
        "first",
        "Honda",
        "Orlando",
        "FPS",
        "a hundred dollars",
        "AC",
        "Pixio PX277 Prime",
        "Pixio",
        "$259ish US dollars",
        "third",
        "165",
        "two",
        "VA",
        "CSGO",
        "369",
        "DOTA2",
        "Hertz",
        "second",
        "369.99",
        "a hundred plus dollar",
        "Florida",
        "daily",
        "two, three years",
        "IPS",
        "TN",
        "RGB",
        "about a hundred dollar",
        "one",
        "Jesus",
        "144",
        "Pixio",
        "27 inch",
        "Greg",
        "16x9",
        "Pixio PX277",
        "Twitter",
        "60",
        "Hondas",
        "eSports",
        "Jeremy",
        "Pixio",
        "TN"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "GPE",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG"
    ]
}