{
    "id": "gLBEvMnaNfQ",
    "title": "What is AMD DOING??",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-05-26T02:55:40Z",
    "video_url": "https://www.youtube.com/watch?v=gLBEvMnaNfQ",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "AMD",
        "Ryzen",
        "Ryzen 9 3900XT",
        "Ryzen 7 3800XT",
        "Ryzen 5 3600XT",
        "leak",
        "boost clock",
        "base clock",
        "refresh",
        "Ryzen refresh"
    ],
    "views": 842015,
    "likes": 46292,
    "comments_count": 2443,
    "description": "Get $40 off with code PAYITFORWARD and grab yourself a pair of Vessi Footwear at   Buy AMD CPUs On Amazon (PAID LINK):  On Newegg (PAID LINK):   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   NEWS SOURCES  RYZEN EARLY     DANCING IN SEPTEMBER?     PEELED APPLE     THE EYES OF TEXAS ARE UPON YOU   THE OTHER LINUS MAKES A CHANGE   ONLY TOOK THIRTEEN YEARS   GOTTA GO SLOW   EK 3 USA  ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://www.vessifootwear.com/techlinked",
        "https://geni.us/m03TqBB",
        "https://geni.us/BTX9",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://www.tomshardware.com/news/amd-ryzen-3000-xt-refresh",
        "https://www.chiphell.com/thread-2222285-1-1.html",
        "https://twitter.com/9550pro/status/1264791454775341058",
        "https://www.digitimes.com/news/a20200521VL200.html",
        "https://www.techspot.com/news/85339-report-next-gen-graphics-cards-nvidia-amd-arrive.html",
        "https://www.techradar.com/news/amd-nvidia-may-launch-their-next-generation-graphics-cards-in-september",
        "https://9to5mac.com/2020/05/25/9to5mac-daily-may-25-2020/",
        "https://techcrunch.com/2020/05/23/hackers-iphone-new-jailbreak/",
        "https://www.wired.com/story/apple-ios-unc0ver-jailbreak/",
        "https://www.engadget.com/ti-bans-assembly-programs-on-calculators-002335088.html",
        "https://www.techradar.com/uk/news/linux-chief-says-hes-picking-amd-over-intel",
        "https://www.pcgamer.com/halo-3-public-tests-could-start-in-early-june/",
        "https://www.nintendoenthusiast.com/sonic-the-hedgehog-games-are-releasing-slower-to-increase-quality/",
        "https://www.kitguru.net/components/cooling/joao-silva/ek-launches-a-limited-edition-us-themed-velocity-cpu-block/?fbclid=IwAR33tWK0qa4x7pEioH8yofj4R_uotmoX90NDhDWwh6v_Z3_elSER7v9vr9E",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I have systematically examined today's tech news and according to my calculations it is indeed hype. - [Man] Yay. We've already been talking a lot about processor releases this year but we might actually be getting yet another one as rumors indicate that a refreshed Ryzen 3000 lineup will launch before the upcoming 4000 series. A possible report from the chip help forums indicates that AMD might be rolling out three chips with boosted clock speeds, a Ryzen 9 3900 XT, Ryzen 7 3800 XT and a Ryzen 5 3600 XT. The timing of this release does raise some questions. It's unclear whether AMD is just trying to give Intel a little bit more competition against the 7th gen chips or if there might be a slight delay with Zen 3. Either way you might wanna wait a little bit before buying Ryzen unless you just really crave that new CPU smell 'cause I can tell you it smells good. And there's now a possible release date for the new graphics cards coming from team green and team read. A report from Digi time suggests that both NVIDIA's and peer consumer GPU and AMD's big Navy lineup should be out in September just in time for you to be forced to ignore them because you have to do homework. - [Man] I hated doing homework. - I just didn't do it. (laughs loudly) - [Man] He's losing it. - Although this report is unconfirmed, it does match up with the other rumors we've heard especially as September marks the end of the year's third quarter, which has previously been given as a possible release window. So it might turn out that our fears of big tech releases being delayed due to the pandemic were unfounded but you can't blame us for being scared. I mean, I didn't really think leather jacket man's whole bit about cooking up the world's biggest graphics card. Was that funny? Is this is a joke to you Jensen? This is our kitchen set. You get out. - [Man] He copied us. - How dare he. You know how iOS solid has historically been pretty tough operating system to jailbreak. I mean especially in comparison to Android. Well, one clever group of hackers has just bucked that trend as the uncover group has jail broken all phones that use iOS 11 and later and yes, that includes iOS 13.5 which was just released a few days ago. How could you jail break a baby? You disgust me. (laughs) Apparently uncover found a zero day bug that was able to bill a jail break around and the good news is that if you're an iPhone enthusiasts that wants to open up the operating system while still keeping security features for apps you find useful like Apple pay, the jail break actually does leave those alone. It's pretty cool news, but it also makes me wonder if Apple's security standards are slipping a little bit. I wonder if someone on their security team is going to be put through the juicer. You know. - [Man] I don't wanna see that. - I think you do. Today is Quick Bits are sponsored by Vessi footwear the 100% waterproof shoe. Walk through rain, mud, snow and slush without worry while the diamond texture material keeps your feet at a comfortable temperature. Stay cool on hot days and warm on cold ones. They're flexible and stretchy like a second pair of socks and they only weigh 175 grams about the weight of an iPhone. - [Man] But you can't jail break this one. - Why would you want to jailbreak these? These are perfect the way they are. - [Man] How exactly? - They've got grippy soles, anti-microbial inserts for fresh feet and both men's and women's versions in a variety of styles and colors. They're a great addition to anyone's shoe closet, including mine. Check it out today at the link below or Vessifootwear.com/techlink and save 40 bucks by using offer code Pay it forward. Yeah, I need bits. Quick, quick bits in here. Get here stop. - [Man] Okay. - I don't know what you're laughing about, it's an important thing that we need to. - [Man] All right I'll get him. Oh jeez he's angry. - Hello Gordon. Graphing calculators are about to get less fun as if that could happen right? - [Man] That's impossible. - Texas instruments is no longer supporting some popular apps based on either C or assembly code. It's apparently to prevent cheating, but the change means that many math programs and games like Doom will no longer work. If you use a program that you think might be effected your only recourse for now is to not update the firmware. But if you're really bored, think writing a naughty word upside down with numbers should still work. - [Man] I checked, still good. - Still good. Speaking of good, Linus Torvalds announced a new version of the Linux kernel this weekend, but he also made a big announcement of a more personal nature. As he switched to an Threadripper 3970X for his desktop computer. What did you think it was? This means it's the first time in around 15 years he's used AMD as his daily driver rather than Intel. It also means I owe some people a lot more money due to some bad bets. Dammit Linus. Halo 3 will be coming to PC early next month as a release for public testing. If you want to be a tester you have to sign up for Halo's free insider program. Now official release will probably be announced sometime soon so go ahead and sign up if you want your Halo fix early. It's great news for PCMR members who have a physical reaction to the thought of touching an Xbox. - [Man] Nasty. - Nope, you don't have lots of titles in the Sonic series have been subpar to say the least after the blue hedgehog 16 big glory days. I do. Sega has announced that future installments won't come out as quickly so development team can take a little bit more time to relax and make sure the games are actually good. Sometimes gotta go fast, isn't really the correct approach, especially when it comes to Sonic '06. Fun facts, they went fast and they split the team in two - [Man] And it didn't work. - Oh no. - [Man] I have never played a single side. Not a single one? - [Man] Nope. - Never. And as for our American viewers. - [Man] American. - American. EK Water Blocks i has made us special edition CPU block decorated with the American flag from Memorial day. It's a nickel base block that comes with RGB lighting and EK will be donating a hundred dollars for every block sold to Shellback, a charity that puts together gaming rings for disabled veterans. So if you're looking to upgrade your PC it's a great cause of support. You know, up here in Canada, all we got was maple syrup tented coolant. - [Man] You don't drink it. - I tried, It doesn't work. You know what else doesn't work? The rest of this show. Come back Wednesday for more tech news made with 100% real tech with no preservatives. - [Man] Keep making it fresh. - Yeah, I got to have it fresh. It's more expensive that way but you got to pay for quality right.",
    "transcript_keywords": [
        "systematically examined today",
        "Ryzen",
        "systematically examined",
        "AMD",
        "jail break",
        "bit",
        "release",
        "AMD big Navy",
        "examined today tech",
        "good",
        "work",
        "jail",
        "refreshed Ryzen",
        "team",
        "Quick Bits",
        "American",
        "tech",
        "Bits",
        "examined today",
        "buying Ryzen"
    ],
    "transcript_entity_values": [
        "PCMR",
        "Memorial day",
        "Shellback",
        "Ryzen 7 3800 XT",
        "Intel",
        "100%",
        "three",
        "13.5",
        "40 bucks",
        "Linux",
        "Gordon",
        "4000",
        "this weekend",
        "one",
        "early next month",
        "Texas",
        "NVIDIA",
        "iPhone",
        "this year",
        "the end of the year's third quarter",
        "Ryzen 5 3600",
        "around 15 years",
        "Today",
        "Ryzen 3000",
        "second",
        "Navy",
        "American",
        "a hundred dollars",
        "EK Water Blocks",
        "Sonic",
        "a few days ago",
        "Ryzen 9 3900 XT",
        "Xbox",
        "Vessi",
        "September",
        "daily",
        "Jensen",
        "AMD",
        "first",
        "16",
        "7th",
        "two",
        "Android",
        "'06",
        "Canada",
        "iOS 11",
        "Halo 3",
        "GPU",
        "Wednesday",
        "XT",
        "Linus Torvalds",
        "Sega",
        "Halo",
        "Linus",
        "RGB",
        "zero day",
        "CPU",
        "175",
        "Ryzen",
        "EK",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "LAW",
        "DATE",
        "DATE",
        "NORP",
        "ORDINAL",
        "ORG",
        "NORP",
        "MONEY",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG",
        "FAC",
        "PRODUCT",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "GPE",
        "LAW",
        "PRODUCT",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE"
    ]
}