{
    "id": "GLgnhI0_O50",
    "title": "I'm in LOVE again! - Apple MacBook Pro",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-11-01T18:29:29Z",
    "video_url": "https://www.youtube.com/watch?v=GLgnhI0_O50",
    "category": "Science & Technology",
    "tags": [
        "Apple",
        "MacBook Pro",
        "M1 Pro Processor",
        "M1",
        "CPU",
        "GPU",
        "Mac",
        "Laptop",
        "Notebook",
        "Keyboard"
    ],
    "views": 1638333,
    "likes": 54286,
    "comments_count": 2342,
    "description": "Get a new skin from dbrand today at   Apple's MacBook Pro is finally here, and we got the M1 Pro processor version! Anthony is genuinely excited to see Apple going back to form by making many improvements while taking a step back in key areas!  Buy 2021 Apple MacBook Pro (14-inch, Apple M1 Pro) On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):   Buy 2021 Apple MacBook Pro (16-inch, Apple M1 Pro) On Amazon (Paid Link):  On Best Buy (Paid Link):  On BHPhoto (Paid Link):   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS ---------------------------------------------------   0:00 - Intro 1:57 - Unboxing 4:08 - Apple MacBook Pro Impressions 4:33 - Magsafe Test 4:59 - Exterior impressions 5:53 - Why HDMI 2.0? 6:36 - Sponsor - dbrand 7:19 - Powering on the MacBook Pro 11:24 - Opening up the laptop 12:32 - Final thoughts",
    "description_links": [
        "https://dbrand.com/shortlinus",
        "https://geni.us/BQVBPk",
        "https://geni.us/nP8Ll",
        "https://geni.us/PVD2i0p",
        "https://geni.us/WidQ5",
        "https://geni.us/QOkG",
        "https://geni.us/SdqD",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- You know, walking along, walking along, Oops. (men laughing) Ladies and gentlemen, (box thuds) we got them. (man booing) (laughs) Oh, we do have them though. We have both the 16 inch and 14 inch of the new MacBook Pro's. This one here is the base model. We have a regular model that has the same kind of specs as the 16 inch which is the full-fat M1 Pro. These are the M1 Pro models. The Max's are a little bit further out. People are saying, \"Oh, you're getting super excited about a thing that you don't even have yet.\" And it's like, that's not quite what that's all about. The excitement isn't about, \"Oh, it's a new shiny, I like the shinies. Give me the shinies.\" It's about, Apple has been going in the wrong direction for a long time now, like, at least since 2016 and now we have something that's, what a lot of people feel is a return to form. It's back to the similar kind of form factor and design philosophy that kind of exemplified the 2015, that earlier MacBook Pros. Now, granted, they're probably, I haven't taken one apart, but they're probably still not very repairable. And obviously you have the Apple ecosystem to deal with because these are M1 Apple Silicon processors. So you're not going to install windows on here and Linux is just kind of just getting off the ground for these platforms. But it's something that is exciting just because it kind of brings us back to the idea that Apple is a company that can listen to feedback, that can admit that sometimes it makes mistakes, that sometimes innovation requires going back to the drawing board in order to make something that's a little bit less restrictive. And that's what we've got here today. Let's start off with the 14 inch here. I always love Apple boxes. These are super high quality. And of course they're just cardboard. They're just good quality cardboard. I like it. Actually, let's take a look at the bottom. Yeah, there's nothing on there really. And Jono informs me that this is a sponsored video by dbrand, which is evident by the nice marble skin we have on here. Let's just set this aside for now. We'll talk more about dbrand later. - [Jono] They paid us. - They paid us. They didn't pay me though. Okay, So we got this. This is the, Oh, is this the base model power adapter? what's the size of this thing? Because one of the things about the base model MacBook is that you don't by default get the fast charging capable power adapter. So what did we get here? We got a 96 watt, I think this is the fast charging one. I think the other one is 65 Watts or something like that. So we must've upgraded this or I have the wrong one. This is the wrong one. This is actually the 10-core and 16-core GPU model. So I thought this was the 14-core and 8-core, 8 and 14, I of course got the (bleep) model. - [Jono] He didn't know? Uh oh. - Oops. - The difference between the 8-core and 14-core and the 10-core and 16-core model is just basically that one has been down. It's not actually different Silicon, as far as I know, it makes the most sense because, like, the Apple is not selling this stuff to anybody else. So, it's just going to go into a lower model MacBook, but that's not the only interesting thing about the new power adapter. We also have this new connector. The adapter itself is still type C, that's not changed. I don't think. oh, it's braided. I forgot about that. Apple cables are never really usually braided. They're usually just like a silicone wrapped or whatever. So USB Type-C on one end with a little paper cap, plugs into the adapter, like so and on the other end, that is MagSafe and that is a very, very short MagSafe connector. Let's get the MacBook out of its little protective sheet there and see what that's like to plug in. That actually looks cooler in person than I thought it would. The MacBook Pro embossed on the bottom. Sorry, I'm getting distracted. And also these feet are nice. These are better than the feet that were on the old MacBooks, like, they were just held in by, I think like a plastic rivet. Wow! That is shallow. Yeah, so MagSafe just goes right in like that. How about that? You know, walking along, walking along. Oops. (laughing) - [Jono] I actually got scared. - Oh, okay. Well, (laughs) it did work, but if that was a little bit closer to the edge, it probably wouldn't have worked quite so well. However, if that was a USB Type-C cable plugged into there, that would have been on the floor. So, it still points to MagSafe. The gap here, usually there's like more of a lip where the the lid meets the chassis, but it's very, very flush. It's like difficult for me to get into there. Like I can get my fingernail in there, but that's about it. So, we've got that shallow MagSafe that did the job, Type-C, thunderbolt 4 connections, two of them on this side, and one more on the other side. We have this high impedance headphone output. Now this SD card slot, do we have a full size of SD card that I can just borrow real quick? I'm interested to know what the depth of it is and whether it's like a clicky kind of affair. So how deep does this go? - [Jono] That's what she said. (fakes laugh) - Yeah, it's about like back then. So, you get one of these half height cards and you can flip it in there and it's totally in there. Anyway, we got this other thunderbolt 3 port here and a full sized HDMI port which is, (man shouts excitedly) which is HTMI 2.0. There are people saying, \"oh, well it should be HDMI 2.1. Why is a new machine coming with HDMI 2.0?\" And I mean, I get that. I would prefer HDMI 2.1. But at the same time, you had to think about what Apple is trying to accomplish there, like not all video cards, I think right now, or even displays have HDMI 2.1 inputs and outputs. This is mostly intended for use with a TV. Most of which don't have HDMI 2.1 to this day. (MacBook starts up) Ah, see, I wasn't going to turn it on. I was going to wait to turn it on after I talked to you about dbrand. Whatever, so dbrand sponsored this video, you can see that they sponsored it by the sticker on the back here, the nice sticker for your technology products, the very expensive sticker. Expensive though, it may be, it actually does feel really nice and it is visually appealing. I'm not sure if I would prefer it over the bare metal, but at the same time, it's protecting your bare metal. So your MacBook, which famously holds its value for a long time, will hold its value even better with a dbrand skin on it to protect it from scuffs and scrapes. They're still, They're not following me on Twitter. So, I mean, I'm not gonna go out of my way to, Anyway. (laughing) This looks real nice. Yeah, the keyboard is nice-feeling. It feels like an actual keyboard. Like it feels like an Apple keyboard. Obviously we have the notch, which wasn't super noticeable just now, but now it is. One thing that has been noted about the notch, if there are too many menu items up here or there are too many items in the bar over here, they'll go under the notch. Hopefully Apple fixes that. I don't know how they're going to, like, maybe if there's too many things, it'll just give you an overflow menu or, I don't know, There's gotta be a way around that. It would have been a lot easier to deal with if there weren't such a big notch. I don't think it would bother me that much in everyday use but I am focusing pretty hard on it right now just because I'm paying attention to it. You do get a bigger camera. Yeah, it's 1080p. I should probably take some kind of picture or recording with it. Let's, they still have photo booth? They do, great. Yes. Okay, cool. That just took a moment. Oh, wow. That actually looks pretty good. - Yeah, is it smoothing? - I don't know. - Yeah. I don't look that young IRL. (laughing) - Yeah. You've got no texture in your face. - Yeah. And it looks like I just like lathered up with lotion, it's weird. - Is there no way to turn this off? - I don't know. - Yeah, we should probably crowd rave, I guess. I have no doubt that it's going to be good. This is the 14 inch, by the way. So whatever this sounds like, we're going to have to fire up the 16 inch and see what that sounds like. Also, can you get me an iFixit kit. I want to take this thing apart. Nah, this is pretty good. Like, this spatial audio is like, actually, just really, really good. So like not quite surround, but stereo expansion. (music playing) That sounds like a good Bluetooth speaker. I don't know if you were hearing that. You'll like sit here and like, listen to that. - [Man With Mask on] I think that's better than the XPS. - [Anthony] Oh yeah absolutely. - [Man With Mask on] Yeah. - [Anthony] It's not even a question (music playing) - Yeah, not even close. - [Anthony] Yeah. - But like the stereo imaging and the base and the tightness of everything is just really good. Also the screen, is this in ProMotion? I think it is, like, it has to, yeah, that's definitely ProMotion. So one of the neat things about ProMotion is that it's just Apple's fancy word for saying adaptive refresh rate 120Hz. But the neat thing about it is that it can be set for 60Hz or 48Hz, which is a multiple of 24 for film stuff. Oh, I can turn off HDR. But then again, like if your content looks better without HDR, like Apple's HDR tone mapping looks pretty good for the most part. But if you end up with issues where you need like accurate color. Then yeah, you should probably turn it off. So. that's as dark as the screen gets. I don't know if you can actually see it. - [David] I can see it - That's as dark as it gets without turning off. So if I go one tick over, it turns off. I want to see how the 16 inch sounds. Cause like I don't expect it to be significantly different in terms of the display or anything else, but I want to see how it sounds because it's bigger. It's got a bigger theoretical resonance chamber. Actually, I wasn't going to talk about anything else other than the sound but the difference in screen real estate, makes it so that the notch basically doesn't matter. This is what I would prefer to carry (music playing) Very similar, but, bass is much tighter and fuller on the 16 inch, which is what I would expect. So I'm pretty impressed so far with the overall fit and finish of this thing as well as its performance in terms of audio and visuals. Let's rip it apart. All right, we got torx as usual. There are probably going to be clips down here too, so, I hope there's no screws under these feet. This bevels in. And that's why I can't, Also yes, I did kind of push that one in. It's Okay, don't worry about it. Oh, Nope. It just comes forward. Great, got it. - As they say, Our computers are better looking on the inside, than the others are on the outside. Is that true? - It does look pretty good. - It does look pretty good, look at those fans. - [David] I love the face. - [Anthony] Yeah. The face they made, They make it face all the time. - [Jono] Even just this touch on the fan there. - [Anthony] Yeah. I was really hoping that I would see a removable SSD but I don't see one of those. I do see the wireless antennas here that goes out to the main area there. I think this is the battery here on both of these sides or any of the speakers. Yeah, It's difficult to tell without taking it further apart, what each of these is for. Well, that was fun and illuminating. We got to see what the insides of this MacBook looked like. (MacBook starts up) Does it just power on automatically when you open the lid? Like it was off. Bottom line, I mean, fit and finish of it is excellent. The notches, we'll see. Yeah, It's in a form factor that's reminiscent of the older, slightly chunkier, but it's actually not all that much chunkier, if any MacBook form factors that we have come to miss? I appreciate it. That's where I was going with this. I appreciate the fact that we're not trying to reduce volume by any means necessary. We're using that volume for more, maybe not necessarily power, although this is presumably, significantly more powerful than this guy which I currently have upside down and I'm gonna leave it that way because it's on the way out. - [Jonathan] Oh! - Oh, got'em. And this is why people are so excited about this generation of Mac books, not because, oh, it's a new shiny. It's because it represents something more. It represents a return to form that, honestly, for many people, Apple hasn't been to in a long time. And you know, you can stay here for a long time if you want to. I'll stick around. You know, the weather recently was pretty bad. We had that cyclone, the bomb cyclone, but you should probably just get subscribed and follow a ShortCircuit for more unboxes Like this one. You don't really want to stick around too long Cause I'm not that interesting in terms of small talk.",
    "transcript_keywords": [
        "Apple",
        "Yeah",
        "good",
        "MacBook",
        "MacBook Pro",
        "kind",
        "model",
        "pretty good",
        "Pro",
        "HDMI",
        "inch",
        "pretty",
        "thing",
        "time",
        "Pro models",
        "model MacBook",
        "base model",
        "long time",
        "Apple Silicon",
        "Apple HDR"
    ],
    "transcript_entity_values": [
        "MacBook Pros",
        "65",
        "half",
        "3",
        "24",
        "Jonathan",
        "60Hz",
        "One",
        "M1 Pro",
        "HTMI 2.0",
        "8",
        "one",
        "14",
        "4",
        "MacBooks",
        "this day",
        "iFixit",
        "Max",
        "MacBook",
        "96 watt",
        "Hopefully Apple",
        "14",
        "14 inch",
        "Watts",
        "ProMotion",
        "Twitter",
        "MagSafe",
        "2015",
        "Jono",
        "MacBook Pro's",
        "Linux",
        "10",
        "Silicon",
        "16 inch",
        "16",
        "two",
        "HDMI 2.0",
        "GPU",
        "USB Type-C",
        "Mac",
        "48Hz",
        "ShortCircuit",
        "120Hz",
        "SD",
        "2016",
        "2.1",
        "MacBook",
        "M1 Apple Silicon",
        "XPS",
        "Apple",
        "today",
        "SSD"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "DATE",
        "QUANTITY",
        "LOC",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORG"
    ]
}