{
    "id": "gLrue6_Dajs",
    "title": "Night Mode: iPhone 11 Pro Max vs Pixel 3a XL!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-09-18T06:27:25Z",
    "video_url": "https://www.youtube.com/watch?v=gLrue6_Dajs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone 11",
        "pixel vs iphone",
        "iphone 11 vs pixel 3a",
        "review",
        "photo test",
        "night mode",
        "night mode test",
        "night mode camera review"
    ],
    "views": 2004342,
    "likes": 51278,
    "comments_count": 6973,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today we're gonna be doing a night mode test on the Pixel 3a and the new iPhone 11 Pro Max. As soon as I heard that the new iPhone 11 has night mode, this is a test that I knew I wanted to do. So I've got this really cool rig. Look how cool! - You look like Gandalf from \"Lord of the Rings\". - Is that a \"Lord of the Rings\" joke? - Gandalf, from \"Lord of the Rings\". - I've still never seen \"Lord of the Rings\" - circa - or \"Harry Potter\". - 2019. - Okay, let's go get some photos! (upbeat music) Super cool! (crickets chirping) All right, this is gonna be on auto. Night mode, engage. (upbeat music) Wow, wow. These both look really good. (upbeat music) Okay, I'm gonna, tell me where I should go, Jen. - Okay, ready? I think I'm taking a photo. (upbeat music) - Whoa, I look cool. I forgot which phone was which. Okay, let's move on. (upbeat music) Jenna, I gotta take a photo of me. Okay, the first photo I'm gonna be taking is, I'm gonna set this to the max exposure so it's gonna be eight seconds. One, two, three-- - There's a person walking in the shot. - Oh, you're ruining it. (upbeat music) Yeah, you can't even see her. She's gone. - Maybe it was a ghost. - She's like a thief in the night. (upbeat music) Okay, let's go somewhere else. We've got a little water fountain here. Let's see what this looks like. - Oh, it's wet! - This is really not that great of a photo. (upbeat music) The Pixel definitely makes everything a lot more colder, whereas the iPhone, I feel like, is a little more of like the natural type of light. What they were mostly saying is they wanted it to feel like it wasn't taking you out of the element and it was more natural colors, whereas the Pixel looks a little more neonyish. Although, I do like neon. This is gonna be a really cool shot. There's hardly any light over here. So I'm gonna turn the exposure up all the way. (gasps) Wow. (upbeat music) This looks amazing. I'm super impressed. I mean, they both look like really good photos. That's the problem when you're doing a comparison. Like, if I just saw this one, I'd be like, \"Wow, that's incredible!\" And then if I just saw this one by itself, \"Wow, that's incredible!\" But then, when you get them both together, you're like, \"Wow, okay, let me just pick this photo apart.\" - [Tyler] Like, wait, but look at both of them compared to what the, like... - Yeah. - Completely dark. - It's so dark. That's cool. Okay, maybe over here, there's a lot of light here. Actually, wow, you look like a demon. (Jen laughs evilly) This looks cool, you look cool. - You said I looked like a demon. - All right, there's a lot of light here, though. - Okay, I'm not gonna move, ready? - Yeah, hold on, wait. Okay, well, whoa, just hold on, hold on. Ready? Do not move, starting now. (upbeat music) See, what's cool with the iPhone, is it does show you the rest of the frame, so this is what you actually will be taking a picture of, but if I wanted to zoom in or zoom out, it'll show you that whole frame. Okay, you can move, sorry. - Well, what the heck, man? Is it my new profile picture or-- - Definitely not. - Okay. - Not our best work. Okay, we need darker. Should we go down to the beach? I think that's a good try. We should try that. A good try, it's a good try. Okay, we're gonna try to get this shot really quick. Oh my God, this looks so cool, I'm so hyped about it. Setting it to max, five seconds. Okay, let's see. (upbeat music) Both of these look great. Like, the fact that we're getting this type of photos in this low light from a freaking phone... Let's find more darkness. - [Jen] Look, we can see what they're watching on TV. They're watching baseball. - Tyler's using his phone light because it is so dark here that there's no way you guys could even see me at all. Okay, let's get this shot. Okay, are you ready? (upbeat music) Wow, wow, holey moley! You guys, this is insane. Okay, show them how dark this is. This is so insane. We need to find darker. - [Justin] What? - Darker. (Tyler laughs) I don't even have a weapon right now. Did we miss the full moon? I think we did. All right, let's see what this looks like. - [Jen] Oh, there's an animal. I'm gonna go look at that animal. - Though, there's crime down there, careful. All right, ready? It says, \"Move back to improve focus.\" The Pixel is struggling right now on this. That's crazy. 28 seconds? (upbeat music) The Pixel did not even manage to focus at all. We're gonna try this again, though. Okay, it focused, so that's good. Oh, that looks pretty good, actually. All right, I'm gonna go back to the iPhone and I'm gonna do a little less exposure 'cause that was kind of aggressive. And we'll do five seconds. Yeah, that's a lot better. Wow, wow, I'm so impressed. Haters are gonna say it's photoshopped! They both look pretty good. Yeah, but this is crazy. Right? - [Tyler] That's just, wait, black? - [Justine] Yeah. - [Tyler] It's insane. - It's really crazy. I'm impressed. Actually, could be cool, I'd like to get a, maybe a shot of myself. - [Tyler] What if you sat there? Like, sit up on that wall? - I like that. - [Jen] Okay, ready? (upbeat music) You don't have to pose anymore. - Oh, okay. I'm into it. They're both like two different looks. I would like to do a shot, Jen, right here, looking down, and then maybe flash a little light at me? (upbeat music) It's so dark down here. - [Jen] All right. - [Tyler] I'll just do it for, like, two seconds. - [Justine] Okay, that might be even too long, but we'll see. Well, maybe not. - [Jen] Okay, ready? Go. (upbeat music) - I look like, I've got a dumb pose. I thought you wouldn't be able to see me as much, so I have messed up, 'cause you can see me quite a lot. This is cool, though. You're, like, leaning, this is such a cool shot, I love it. Oh, man, this is so crazy, they look so good. This video was so much fun. I hope you guys enjoyed it. I would love to know from you, in the comments below, which photos were your favorite and which phone do you think looks better? Maybe not look better, but which ones did you prefer more? Because I think they honestly look, they both did such a good job. And now I'm gonna go, I think, to bed because it's past my bedtime. It's so dark out here. Jenna! Where has my Jenna gone? - [Jen] I found a beach kitty. - Oh. (upbeat music)",
    "transcript_keywords": [
        "Wow",
        "Pro Max",
        "Lord",
        "Rings",
        "night mode",
        "cool",
        "night mode test",
        "Pixel",
        "Pro",
        "good",
        "shot",
        "photo",
        "mode",
        "mode test",
        "ready",
        "night",
        "iPhone",
        "Yeah",
        "crazy",
        "dark"
    ],
    "transcript_entity_values": [
        "iPhone 11",
        "Gandalf",
        "Justin",
        "eight seconds",
        "iPhone",
        "Pro Max",
        "Harry Potter",
        "Jen",
        "two seconds",
        "five seconds",
        "holey moley",
        "Lord of the Rings",
        "max",
        "two",
        "2019",
        "28 seconds",
        "Tyler",
        "first",
        "Jenna",
        "Rings",
        "One"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PERSON",
        "ORG",
        "TIME",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "TIME",
        "TIME",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "TIME",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL"
    ]
}