{
    "id": "GlSffsbj3ow",
    "title": "Is It A Phone, A Laptop, Or A PC?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2017-02-20T19:23:27Z",
    "video_url": "https://www.youtube.com/watch?v=GlSffsbj3ow",
    "category": "Science & Technology",
    "tags": [
        "unbox therapy",
        "unboxtherapy",
        "( ͡° ͜ʖ ͡°)",
        "tech",
        "technology",
        "gadgets",
        "gadget",
        "unboxing",
        "review",
        "unbox",
        "therapy",
        "new",
        "youtube",
        "hp",
        "hp elite x3",
        "elite",
        "x3",
        "elite x3",
        "pc",
        "computer",
        "smartphone",
        "windows",
        "elite x3 review",
        "microsoft",
        "apple",
        "iphone",
        "vs",
        "iphone 7",
        "apple iphone 7",
        "iphone 7 plus",
        "android",
        "laptop",
        "notebook",
        "desktop pc",
        "monitor",
        "best",
        "2017",
        "new inventions",
        "cool gadgets",
        "cool gadget",
        "awesome",
        "video",
        "products",
        "innovation",
        "invention",
        "futuristic",
        "technology (industry)",
        "future",
        "cool technology",
        "7 plus",
        "samsung"
    ],
    "views": 2148086,
    "likes": 47240,
    "comments_count": 3722,
    "description": "See all the tech specs and buy the HP Elite X3 here:   UK -  FR -  DE -  ES -   HP asked me to take a look at the new Elite X3. The X3 is a 3-in-1, meant to replace the need for a separate smartphone, laptop and desktop PC. The X3 is also rugged, I took it up to the wilderness and even dunked it in the lake.  Read more about how the HP Elite X3 can change the way you work:     FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://hp.tl/60068V188",
        "http://hp.tl/60058V18L",
        "http://hp.tl/60058V1HL",
        "http://hp.tl/60048V1ym",
        "http://hp.tl/60008V1ZC",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "So Hp came out with this new product. They're calling it a 3-in-1 and it's kinda in the name, the Hp Elite X3 So when they reached out they said hey we think your the right guy the check it out To see if its the next cool thing. I said send it over. I'm trying to always uncover that next thing you might not have known about Including the idea of a 3-in-1 There's a phone component, there's a desktop component, and a laptop, or in this case lapdock. Now what Hp is aiming to do with this X3 is to eliminate all three of those and replace them with one. So in front of me here I have the X3 and deskdock combo. *Whispers* Alright. Over here on the left is the X3 right here as you can see. When this connects to the dock all of a sudden you can have a desktop style computing experience. so the audio on this device is done by the legends over at Bang & Olufsen. On the bottom here there is a USB-C style connector. We of course have out various buttons on the side here. There is a headphone jack, the camera is on the rear and there is a rear fingerprint scanner as well. You got a forward facing camera, but there's also an iris scanner. Maybe listen you wanna take the security to completely different level. You want to be in the future. It's time for that retina scan. Check it out So your choice. Dual-sim or sim card as well as sd expansion options are good. There's a gasket and that's important because this device is actually water resistant. IP67 rating. Also inside the box here is the dock and this thing is hefty Now the X3 goes ahead and sits down on there. Your power port, your wired Ethernet jack, there's a display port, couple of USB-3 ports that are also capable of charging other devices at high speed. And then over here is a USB-C type connector as well. USB-C to a standard USB cable. They did give us a hea- oh, a pretty nice headset actually. A power brick to keep it all juiced up. There's some adapters included for the dock. If you happen to have a case on your X3 and it's a slightly wider stance on there. There is a port to keep it locked. You can lock this down so that it's secure Alright so I've got the phone booted up as you can tell but for me this is really where it comes to life. In this kind of environment. This is what sets it apart from different devices that are out there. Since it's running Windows When you connect it to this dock right here all of a sudden your various peripherals become available to you and you can use this device in a more desktop/PC like experience.So i'll show you what that's like. Put this in here Now i'm connected with display port here and keep in mind the dock itself has couple of USBs as well as USB-Cs on it so you can connect other peripherals to the dock Now i have a keyboard and mouse connected These ones are wireless so they're connected over bluetooth but if these were wired USB devices they'd work just as well going straight into the dock. So you'll see I move around here like a desktop style interface and if i scroll through maybe open up a web browser here So here we have a full web browser you can see I've got Unbox Therapy, the Unbox Therapy YouTube page loaded up So whether its consumption or creation, it should have you covered You can come down here open a word document for example and now you'll really get down to business typing something hopefully as important as this is. Obviously if you've got a longer form document having more screen real estate is going to make you more productive. So what you can do here is, as you'll see I just move around just like the mouse. Yeah, it works like a touchpad if you've ever used the touchpad on a laptop before. That's essentially how this operates. Now some of you guys might not know this but I'm not in the studio all the time. I'm not sitting here in this cosy enviroment. Sometimes, I like to get out into the wilderness Sometimes, I like to work remote *Music* But you can also do, a wireless dock to something called the lapdock. Which is a more traditional laptop styled form-factor It's gonna be useful on airplanes, potentially in coffee shops It's got a keyboard, a display And once again, the brains are always inside the main X-3 unit. So there you have it, the elite X-3 A super ambitious device Aiming to eliminate the need for a number of different devices In your ecosystem. A desktop, a laptop and of course a phone. You can start a book on your phone, and finish it on your desktop or You can start a movie at home and then finish it on your phone. It goes, where you go. X-3 Continuum The future Watch this *Grabs phone* I'm out. *Outro music*",
    "transcript_keywords": [
        "dock",
        "desktop",
        "phone",
        "device",
        "devices",
        "Unbox Therapy",
        "USBC",
        "port",
        "thing",
        "laptop",
        "desktop style",
        "style",
        "USBC style connector",
        "display port",
        "display",
        "USBC style",
        "product",
        "Alright",
        "connected",
        "USB devices"
    ],
    "transcript_entity_values": [
        "Hp",
        "USB",
        "three",
        "USB-C",
        "USB-Cs",
        "3",
        "X3",
        "Unbox Therapy",
        "Ethernet jack",
        "Bang & Olufsen",
        "X3",
        "Windows"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "ORG",
        "PRODUCT",
        "ORG",
        "GPE",
        "WORK_OF_ART"
    ]
}