{
    "id": "gM_Jm_6tqEQ",
    "title": "Our Garden Can Now Water Itself! - How to Harness Gravity?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2021-06-14T13:15:02Z",
    "video_url": "https://www.youtube.com/watch?v=gM_Jm_6tqEQ",
    "category": "Howto & Style",
    "tags": [
        "JerryRig Garden",
        "Accessible garden",
        "Raised flower bed",
        "self watering garden",
        "drip system",
        "low pressure drip system",
        "planter boxes",
        "automatic irrigation system",
        "gravity drip system",
        "DIY watering system",
        "drip irrigation",
        "massive raised garden",
        "garden for wheelchair",
        "how to plant garden",
        "planter box",
        "how to garden",
        "self watering system for plants"
    ],
    "views": 1348563,
    "likes": 51416,
    "comments_count": 2376,
    "description": "Today we plant our garden! Try out Huel here!:  and thanks to Huel for sponsoring this video! Cambry and I built our large raised accessible garden last year. And so far, everything is still in one piece! This year we are upgrading the garden with a self watering drip irrigation system using water collected from the rain! Free water is the best water. Hopefully we get some rain this year!   Building the Garden HERE:  Last Years Harvest HERE:  2021 Harvest HERE:   Get my razor knife here!    Anker is named as the Official Charging Partner of JerryRigEverything:    *Follow me for updates!* Instagram:  Facebook:  Twitter:   LARGE tool kit:  Travel Tool Kit:  Mega Tool Kit:  Green Pry tool:  Metal phone opening tool:  Replacement phone parts:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://my.huel.com/Jerry",
        "https://youtu.be/e3HFRlrQxH4",
        "https://youtu.be/etHEgZtjRWE",
        "https://youtu.be/iNnVlWPqHQc",
        "https://www.jerryrigknife.com/",
        "http://ankerfast.club/JREpartnership",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://www.fixez.com/?utm_source=JerryRigEverything",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://click.dji.com/AI2tmSb0onM9XPVwb-Se0g",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Music] Do you remember the accessible garden we built last year? Well we're still watering everything by hand, so today I'm going to change that and build something that will water the garden by itself with the power of the earth...sometimes called gravity. We have planted everything already, even though nothing's popping up yet. Cambry, you want to tell where the things are at? -Sure. So we've got pumpkins at the very end, corn, watermelon, peppers, and lettuce...generally. -Last year we had a lot of fun with the garden, so it'll be interesting to see what things start looking like when they pop up again. If you remember last year, our pumpkins got pretty out of hand. We do have a while before vegetables start popping up though. -But luckily, growing your own garden is not the only way you can eat healthy. -Huge thanks to Huel for sponsoring this video. Are you ready for lunch? -Yeah. -Huel is a really quick, easy to make, complete meal, and includes 27 essential vitamins and minerals. All you need to do is add water. I like Huel because everything is ready to go. There's less shopping, less cooking, and the best thing is that complete meals can cost less than $2. Today we're going to try the yellow coconut curry and the hot and savory rice and quinoa. And in about the same amount of time that you've been listening to me talk, lunch is ready. Mix with hot water and cover for about 5 minutes and it's good to go. -Both of these are nutritionally complete vegan meals packed with rice, quinoa, and vegetables. 4 -Plus, each of these bags has a super long shelf life so there's no food waste. -Huel has sold over 150 million meals in over 100 different countries. -So as you can see there are a lot of different ways to eat healthy, even without a garden. I'll leave a link down in the description so you can pick out the meals you'd like to try for yourself. Getting all your vitamins is pretty important. Speaking of which, let's get started. [Intro] So in order for my garden to water itself, I need to get the water to do the work for me. And I'm going to do that by mounting this giant tank over the doorway. That way gravity can take water from the tank and move it into my flower beds. Now you're probably like, 'Hey Jerry, how are you going to water your garden with an empty tank?' And it does rain here in Utah. We get about 16 inches a year. What's going to happen is I'm going to harvest the rain that falls off of the roof, run it down into the tank, and then it goes out to water the garden using gravity the whole way. Science. If you know anything about water, water is super, super heavy, so I'm using some heavy duty pallet racking to create a shelf above the doorway. I'm using two sets of pallet racks to create a platform. The heavy duty frame can hold about 20,000 pounds. And each level of shelf can hold about 13,600 pounds. And lucky for us, our water tank is only going to weigh about 10,000 pounds when totally full, which is right around 1,200 gallons. Once the blue shelf legs are tilted up right, I can add the shelf exactly where needed so I still have room to swing open the door. I'm mounting it up high for two reasons: one, so it takes up less space inside of the barn. And two, the higher the tank, the more water pressure we get. I think for every two feet we get an additional psi of pressure. That's why you see a lot of cities have water towers mounted super high up in the air, because gravity just naturally gives them more water pressure to use in the city. I'm using some HDF, or high density fiberboard to make a shelf on the platform. It'll rest on top of the metal supports and give the tank something flat to sit on. Now it's time to get this tank, it's a 1,500 gallon tank, on top of our platform we just built. I think the tank weighs about 400 pounds, but it's also just super huge and awkward, but I have one of these mobile pallet jacks so we're going to try to jerry rig something and make it happen. I am using a white water tank inside of my barn, which is fine because the sun is never going to hit it. If I was making a water tower outside of the barn I would want to use a different color tank, one that the sunlight can't get through. Otherwise, algae and stuff will grow inside. A little higher. I added one more beam up top and then we had two extra beams that I just put right down here in the center. I am going to bolt the whole thing down to the concrete that we have below the tower, but I want to make sure that my manifold works before I do that. So working on the manifold right now. This is what's going to connect up to the tank. I decided to go with these nozzles here which are more of a ball valve because they have so much room in the center for water flow. You can see as you turn this lever the ball opens up inside, and I'm going to have four outputs on this manifold, two of which are just going to be closed off for right now. I'll probably run like a little sink or something to it. And then these two, one's going to run to the garden and one is going to be empty so I can use it as a blowout valve during the winter. And then attached to the metal nozzle I have the garden hose threads here because the threads that go into the piping are fine thread, and the threads that go into a garden hose are more of a coarse thread. And I have the white Teflon tape keeping a watertight seal inside of all of it. And of course, all of these nozzles can turn off individually, or they can all turn off up here at the very top. Now we just have to install this in the tank. So as of right now, the shelf that the water tank is sitting on is strong enough to hold the full weight of a full tank. I don't ever plan on having the tank full, I plan on keeping it about halfway, just letting the rain replenish it enough. And I'll have a valve on the outside where I can divert the gutter water off of the side of the barn to the yard. But to make things a little more safe, I have added 5 inch beams between these two levels. So instead of 4 beams holding up the water tank, now we have 6 beams holding up the water tank, with quite a bit of structural integrity right here in the center. Because as the load increases on this beam, it'll be transferred directly down to this beam where all 6 of them are now doing the work. So since there's no rain right now I am filling up the tank a little bit with our hose just so we can test it out and make sure everything works. Right now we have about a little over 200 gallons and no leaks so far. This is just water that sprayed earlier. So if I turn this, now we have water flowing to the manifold. And if I turn this, that let's water flow from the tank, out the hose, to the garden. Not bad. And that's the water we got so far. So now we know the water flows, now we just have to make it happen automatically. I'll probably replace this hole with PVC once we know for sure it works, but as of right now this is one giant experiment. And the way we're going to get this to water the garden automatically is with one of these timers. This is a low PSI timer that is battery operated and can turn on at different intervals and for certain durations. You can see that it's closed right now, and as soon as I turn it to on, the motor will kick on and it will open up. And then we can turn it back off again, and it does that all automatically. And there's a little screened filter inside that helps keep the debris out of the drip lines. Well, so far it looks like it's working. Now we just need to get the rain collection part figured out. So like I mentioned earlier, the math of my roof should be able to fill the water tank about 4 times during the year. Obviously I won't need to keep it full during winter when I'm not watering my garden. During the summer while I'm using the tank, it should maintain itself around half full or half empty depending on pessimism levels. In order to harvest the rainwater I have gutters in place along the roof line. They'll catch the water and divert it into a PVC setup. At the top we have a screen that will help get rid of any leaves or sticks that might blow up onto the roof. Then as the water falls down the line it can either get diverted into the tank or fall straight down and get diverted into the yard. It's just another way of making sure that the tank doesn't get too full. I use 16 concrete anchors to mount the pallet racking to the concrete and I added a mosquito-proof screen at the top of the tank which will help keep the bugs and any debris from falling inside. I also added a drain plug up top so if the tank ever does get too full there's somewhere for the water to go. Obviously, the easier way to do this would be to just put a black tank on the ground and have some kind of pump to generate the pressure. But then you need electricity and it's more fun to just use the power of the earth. Alright, there is no rain today so we're going to have to test this out manually. Moment of truth. Get some water up there on the roof. Should have it start running down the gutter into the leaf catcher, down through the PVC, into the barn. Remember, this is where it's going to have the little valve on the side run around to the backyard if I want to turn it off. And we should hear it flow into the tank. Now we are able to catch the rain, store the rain, and use gravity to water our garden all by itself. So what do you think, Cambry? -I'm super excited. I think taking care of this garden is going to be so much easier so I can really focus on weeding and collecting the plants instead of, I don't know, watering and making sure they have the right nutrients. -Yeah. -I think the best part about this is if we were to leave our house, asking someone to come water our plants isn't a big chore. We can just turn the nozzle and we're using water that's coming from the sky and feeding our plants and then feeding us. -And all happening automatically. Now this is one giant experiment so I'm...I'll probably leave the drip system on for maybe an hour to start off with. And then as the plants get bigger I can schedule it to run, you know, for an hour, for two hours in the morning and the night. So it'll just be one process. So maybe...if you're going to attempt this yourself, maybe wait until our fall video where we talk about the harvest and have actually used it for a little bit. But I'm excited. It should be a fun experiment. -Things are already growing, like it's a happy garden already. -You want to finish this off? -Yeah. Thanks a ton for watching. We'll see you around.",
    "transcript_keywords": [
        "water",
        "tank",
        "water tank",
        "garden",
        "turn",
        "water tank inside",
        "rain",
        "full",
        "shelf",
        "make",
        "top",
        "inside",
        "white water tank",
        "super",
        "water pressure",
        "year",
        "water flow",
        "Huel",
        "gravity",
        "accessible garden"
    ],
    "transcript_entity_values": [
        "the summer",
        "about 16 inches",
        "around 1,200 gallons",
        "about 13,600 pounds",
        "6",
        "about 400 pounds",
        "the year",
        "Cambry",
        "over 150 million",
        "four",
        "two",
        "Huel",
        "less than $2",
        "16",
        "Jerry",
        "an hour",
        "27",
        "two feet",
        "the winter",
        "4",
        "1,500 gallon",
        "around half full or half",
        "HDF",
        "about 20,000 pounds",
        "hose",
        "I'll",
        "5 inch",
        "about 5 minutes",
        "Teflon",
        "last year",
        "about 10,000 pounds",
        "winter",
        "today",
        "over 100",
        "Today",
        "about 4",
        "Utah",
        "one",
        "two hours",
        "maybe an hour"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "TIME",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "TIME",
        "TIME"
    ]
}