{
    "id": "GMdM44E3v74",
    "title": "Why electric scooters are illegal in New York and London",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-11-25T14:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=GMdM44E3v74",
    "category": "Science & Technology",
    "tags": [
        "electric scooter",
        "scooter",
        "electric scooters",
        "electric scooters illegal",
        "scooters",
        "e scooters",
        "escooters",
        "London",
        "new york",
        "illegal",
        "ban",
        "banned",
        "electric",
        "best electric scooter",
        "electric bike",
        "lime",
        "lyft",
        "uber",
        "bird",
        "bird scooters",
        "electric scooter review",
        "electric scooter 2018",
        "xiaomi scooter",
        "best scooter",
        "motorized scooter",
        "2019",
        "e-scooter",
        "sharing",
        "ride sharing",
        "los angeles",
        "california",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "google",
        "verge",
        "the verge"
    ],
    "views": 367066,
    "likes": 6881,
    "comments_count": 812,
    "description": "Spend any time in New York or London and youll come across dozens of people whizzing along each citys streets on electric scooters. Yet, despite their popularity, e-scooters are technically illegal in both places, and the politicians with the power to change things are in no rush to do so. So what's the hold up?  Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/37AlBHo",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- So I've always been a cyclist who hated electric scooters, until I went to Berlin. (upbeat music) So, I was sold on the idea of getting an electric scooter but when I got back to London, I hit a little bit of a snag. It turns out, scooters are essentially illegal to use here because of a series of laws that date back to the Victorian era. The oldest one is the Highway's Act 1835, which bans horse, ass, sheep, mule, swine, cattle, or carriage from being on the pavement or sidewalk. But, there's a more modern law which updates this old law and is the final nail in the coffin, which says that \"carriages\" include any mechanically propelled vehicle. In other words, \"don't ride your scooter on the pavement, you weirdo.\" But the real problem is the laws that collectively prevent electric scooters from being used on the road. Now, in the eyes of the law, electric scooters just, kinda, don't exist. And so somehow they fall into the same category as motor vehicles, yet they've got no chance of meeting the same kind of safety and tax regulations. Oh, and, don't even think about riding in the bike lane, those are reserved for things with pedals, so scooters are out. Oh, electric bikes are cool, you guys can stay. (upbeat music) There are a lot of scooters on London streets but technically, every single one of these riders is risking a 300 pound fine and six points on their license. - And if you live here, in New York City, you've probably noticed the same thing. Electric scooters are everywhere but there are no shared scooters like Bird and Lime. And that's because, they're technically illegal here to. Now the enforcement is not quite as harsh as it is in London. And the cops basically turn a blind eye, but E-scooters are on the list of banned vehicles with the DMV. So scoot at your own peril New York. (upbeat music) - [Jon] There is a loophole, and that's that E-scooters can be ridden on private land in the UK. For the past year, Bird has been running an electric scooter trial in the Olympic Park in London. The company's hoping that the more people it can get on to scooters, the more people might have the same kind of revelation that I had in Berlin. Bird is just one example of an electric scooter sharing company. But there are plenty more that will want to move in, as soon as the city legalizes scooters. And we all know what that can look like. I think it's fair to say, a few cities were maybe too hasty in opening their doors to E-scooter companies. - [Andrew] Now, take Austin, Texas for example. That city is over run with electric scooters. Now there's a recent study from the CDC that found that 20 people were being injured per 100,000 E-scooter trips, over a 3 month period. That's a pretty alarming rate. Part of the problem is, the scooter sharing companies are moving faster than the city regulators can keep up. So you've got cities like San Francisco, Madrid, Indianapolis and Antwerp, that have been forced to write regulations after the scooter companies have already come in and dumped dozens and dozens of scooters on their streets. But here in New York State, they're trying to avoid that problem by letting each city write it's own rules governing scooter sharing services. But the governor Andrew Cuomo, hasn't signed the bill yet and it's leaving electric scooter companies in the dark as to when exactly they're gonna get the green light. Gradually some ideas are starting to emerge about the best way for allowing electric scooters and their rental companies to come in to cities. - All of this is to say, that potentially the UK's slow progress in allowing electric scooters, maybe, isn't the worst thing in the world. I mean in a weird way, the UK's outdated laws have brought the country a little bit of breathing space, to work out how to allow electric scooters, without suffering their downsides. And then when electric scooter sharing companies move in, they'll have to play by the countries laws. - [Alan] I think what we would like to see, and what we're arguing for in the UK at the moment, is for rules and regulations to be proactively put in place. So for example, in the UK, we would like the government, to legislate a minimum safety standards for the actual E-scooters which are going on the roads. And longer term, by working better with cities, we think that's a way in which you can make this industry, you know, really sustainable. - So change could be on the way, it's just happening very slowly. In March 2019 the UK's Department For Transport announced a huge analysis into the countries transport regulations. They called it the \"biggest review in to transport \"in a generation\". The department is vague on what they will be doing, but it looks very promising for scooters. They speak of trialing, regulating and possibly adding new vehicle definitions that could allow scooters to be used on public roads. But where it starts to get really complicated, is where the report says that even city street designs may need to evolve to accommodate new vehicles. It's a problem, that so many modern cities are designed with cars in mind and as long as that's the case, other forms of transport will be more dangerous to use than they need to be. I mean even in the case of the UK's first electric scooter death, some reports pointed towards a confusing road layout as one potential cause. And in New York, at least six people have died while riding electric bicycles, electric scooters or mopeds this year alone. - I think the best, numbers of people using scooters in 2018 was 84 million trips, for bike and scooter share in the US. That's really something and cities are taking notice. Shared micro-mobility can only grow if we provide safe places for people to bike and to scooter. - [Jon] So the genies out of the bottle, electric scooters are coming. And they come with potentially massive benefits to our most congested cities. But it's hard to ignore the risks, both to the safety of scooter riders themselves, as well as people that share the streets with them. And getting the balance right, could require new laws and it might even need cities to be redesigned to accommodate scooters and to encourage them to be used safely. These are things that take time to change. Cities and countries can't afford to move fast and break things. In the same way that tech companies can. And making the wrong decision now might affect how livable our cities are for decades to come. - [Nicole] There is no doubt that, when cities and companies work together, that cities have established goals, that shared micro-mobility can be a really good thing for cities. - Take Austin Texas for example, the city has been totally over run with scooters, but (laughs) - The real problem is the laws that collectively. What is happening over there? Ahhh! We're late for the truck regatta (laughs)",
    "transcript_keywords": [
        "electric scooters",
        "scooters",
        "electric",
        "scooter",
        "hated electric scooters",
        "cities",
        "electric scooter sharing",
        "scooter sharing",
        "allowing electric scooters",
        "electric scooter companies",
        "companies",
        "scooter sharing companies",
        "City",
        "laws",
        "scooter companies",
        "people",
        "London",
        "York",
        "cyclist who hated",
        "hated electric"
    ],
    "transcript_entity_values": [
        "New York",
        "300 pound",
        "one",
        "Berlin",
        "Madrid",
        "84 million",
        "1835",
        "at least six",
        "March 2019",
        "the Olympic Park",
        "100,000",
        "3 month",
        "US",
        "six",
        "UK",
        "Austin",
        "Victorian",
        "Indianapolis",
        "Department For Transport",
        "20",
        "Alan",
        "Antwerp",
        "London",
        "the past year",
        "New York City",
        "CDC",
        "this year",
        "Bird",
        "New York State",
        "2018",
        "Texas",
        "DMV",
        "dozens and dozens",
        "Andrew Cuomo",
        "decades",
        "first",
        "San Francisco"
    ],
    "transcript_entity_types": [
        "GPE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "GPE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "LOC",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "GPE",
        "GPE",
        "NORP",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "GPE",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORDINAL",
        "GPE"
    ]
}