{
    "id": "gn4xlnM2BNk",
    "title": "Trying a $100 PC from Amazon...",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2018-03-13T15:07:47Z",
    "video_url": "https://www.youtube.com/watch?v=gn4xlnM2BNk",
    "category": "Science & Technology",
    "tags": [
        "pc",
        "computer",
        "cheap pc",
        "cheap computer",
        "budget pc",
        "budget computer",
        "cheapest computer",
        "desktop",
        "mini pc",
        "amazon",
        "budget",
        "cheap",
        "unboxing",
        "review",
        "is it worth it",
        "austin evans"
    ],
    "views": 1773639,
    "likes": 35961,
    "comments_count": 3369,
    "description": "Check out LastPass!  The $100 Guleek Mini PC on Amazon:  This video was sponsored by LastPass. I bought the cheapest new desktop computer I could find on Amazon. Things didn't go well.  Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "http://goo.gl/vECGwb",
        "http://austin.tech/guleek",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- Hey, guys, this is Austin. I set out with a simple goal, to find the cheapest, brand new computer that I could find on Amazon, and well, this is what I've got. And big shout out LastPass for sponsoring today's video. This is the Guleek GPC Wintel Mini PC. As you can see, it's pretty mini. So the main idea here is that for $100, this is going to be a fully functional computer. It's not going to be bare bones. You don't need to install Windows. Everything should come all ready to go. Oh, here we go. We've got the technical specifications. The quad-core Intel Atom Z8300, Windows 10, two gigabytes of RAM, and 32 gigs of storage. For $100. As I was saying, this guy is about as small as it gets. So what we're getting here is a full fledged desktop computer. You're gonna be getting USB ports, HDMI, really, really rattly plastic, but it actually does come in this nice, aluminum chassis. We get a HDMI cable. Wow, that's actually really nice. We also get what looks like to be the power adapter! So one of the nice things about this guy is that even though it's included in the box, it just runs off of a standard five volt micro USB. So in theory, you could run this off of something like a battery bank or even like a normal phone charger. Hardware-wise, there's really not a lot to the Guleek Mini PC. So it does have that aluminum build, but if you come around back, what you're going to find is a full-size USB 3.0 port, a USB 2.0 port, micro USB for power, HDMI out, as well as a headphone jack and a micro SD card slot. That micro SD card is going to be important because with only 32 gigs of storage, you're definitely gonna wanna expand that. I will say one thing, it immediately recognizes that I'm using a 120 hertz monitor, and it's actually using the full refresh rate. That's kind of cool. Oh, God, what? Did I crash it? So, one quick monitor swap later, we have a fully-working PC. All those weird issues actually had nothing to do with the computer, and once we get in here, I mean, everything seems to be working fine. One of the big issues though is that we're running a full Windows 10 PC with only two gigs of RAM. So say you wanna do something simple like watch some YouTube. Well, if we come over to the channel and try to load up a page, you're going to see that things slow down quite a bit. Most of that is because we only have two gigs of RAM. The Atom processor is not helping. However, once you actually get it to load if you're a little bit patient, it does totally work. Oh, also, our video's on trending. That's kinda cool. (laughing) We might not have speakers, but you can see 1080p video, especially on YouTube, does play back just fine. Now what's cool is is that even though this is going to be a lower end PC, you're actually getting a GPU that is theoretically capable of pushing a 4K display. Although, that's probably not the greatest idea. You know, I actually think there's a lot that we can do with this PC, but before we do that, I wanna give a huge shout out to LastPass for sponsoring this video. It's almost like it's a perfect sort of fit. When you get a brand new PC and you wanna have all your passwords and all your logins in one place. Funny how that happened. Not like we planned it or anything. I personally have been using LastPass for over five years now at this point. And what you're getting here is something that's gonna allow you to get all of your passwords all under one, secure umbrella. So say, for example, that you use the same password on lots of site, which of course no one would ever do who watches the channel. Right? What LastPass allows you to do is to create a completely random generated password for each and every site that you visit. So even if say one site gets hacked, that doesn't mean that someone can get into all of your other logins. Now what's cool is is that LastPass keeps all this super secure underneath a master password. What's nice about that is there are multiple ways of getting into it. You can add two-factor authentication. It actually is a really secure way of doing things. The best part is that you can get LastPass for free. Now they do have a $2 a month premium plan, which is what I've been on for a while. But regardless, you should be using a password manager, and I legitimately use LastPass every single day. If you guys wanna check it out, the link is in the description, and huge, huge shout out to LastPass for sponsoring this video. Now sure, having a mini PC is fine and great. What's the fun if you don't actually take advantage of how small it is? Everyone knows that a cheap PC is not going to be the most powerful thing in the world, but this is where things get a little bit more exciting. This is the Gechic On-Lap 1102H portable monitor. Now there are lots of portable monitors out there, and most of the time, they're pretty decent. What makes this a little bit different is it has its own dedicated battery built in. So with pretty much just a single HDMI cable, we can get a fully portable setup. See where I'm going with this? So first of all, we have the actual display itself. So we're looking at an 11.6 inch... (crinkling) (clears throat) We're looking at a 11.6 inch 1920 by 1080 panel. Plenty bright enough and especially plenty sharp enough to be able to handle our Guleek Mini PC. So, with our Gechic monitor up and running, this is our questionably useful setup. So, first of all we have the Guleek PC. Now connected to that is our Samsung T3 SSD, which is going to have all of our Steam games on it. It's being powered by this Mi power bank. We also have the monitor, which normally would be running on its own power, except that it was not charged. So we have it connected to another battery bank, and with all this, we have only one spare USB port, and I'm trying to get games set up, so I'm having to hot swap mouses and keyboards and controllers to try to get something to work because we really planned things out solidly. There are definitely some cool things about this setup though. The Gechic monitor is really nice-looking. So you're getting that full 1080 resolution, and not only is there going to be a matte display, but you know, in theory when you remember to charge it, it is going to be a really nice portable setup. It even has some things on the backside to be able to hook up something like a compute stick so you can have a fully portable little setup, but none of that matters if I can't play CS:GO in a park. Because that's the whole premise for this video. Please, please tell me that this is actually going to let me load it. So we're into the menu, I cranked all the settings down, and it looks like we're actually loading, and it should work in theory. I've done a lot of testing with CS:GO. Usually when we have a really low end system, that's sort of the first game I go to actually see if it will work, and while I've never done it on an Atom chip, that should, in theory, be able to run. It's gonna be on low settings and not a great frame rate. Initializing game data. I don't think I've ever seen CS:GO take five minutes to load but that's fine, who cares how long it takes to load? Just matters if we can actually play the game or not. Oh, no! No! CSGO.exe has stopped working. Right before the load finished. Ugh, I feel that right here. So what did we learn? We learned that the Guleek is a pretty decent PC as long as you don't ever try to play a game on it. So I'm curious, what do you guys think about the $100 Guleek Mini PC? I'm sure you will have lots of very insightful comments about this entire video. So be sure to let me know in the comments below, and of course, definitely be sure to go check out LastPass with the link in the description. There guys, thank you so much for watching. I'm going to go cry myself to sleep over not being able to play a game right now.",
    "transcript_keywords": [
        "Guleek Mini",
        "Guleek GPC Wintel",
        "GPC Wintel Mini",
        "USB",
        "LastPass",
        "Guleek",
        "Mini",
        "things",
        "video",
        "Austin",
        "HDMI",
        "micro USB",
        "monitor",
        "load",
        "nice",
        "game",
        "cool",
        "Guleek GPC",
        "Windows",
        "portable"
    ],
    "transcript_entity_values": [
        "2",
        "the Guleek GPC Wintel Mini PC",
        "every single day",
        "Atom",
        "micro SD",
        "LastPass",
        "the Gechic On-Lap 1102H",
        "volt micro",
        "1080",
        "first",
        "RAM",
        "Amazon",
        "USB",
        "Samsung",
        "only 32",
        "Austin",
        "two",
        "Windows 10",
        "micro USB",
        "Windows",
        "only two",
        "Mi",
        "Guleek",
        "HDMI",
        "120",
        "4",
        "Gechic",
        "one",
        "YouTube",
        "32",
        "over five years",
        "Guleek Mini",
        "Intel Atom",
        "five",
        "month",
        "SD",
        "1080p",
        "the Guleek Mini PC",
        "11.6 inch",
        "only one",
        "One",
        "1920",
        "five minutes",
        "11.6 inch",
        "100",
        "GPU",
        "today",
        "the Guleek PC",
        "two gigabytes"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY"
    ]
}