{
    "id": "GN6ZlssqNAE",
    "title": "“Thinnest iPad Ever” – WHAT COULD POSSIBLY GO WRONG?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2024-05-16T06:39:24Z",
    "video_url": "https://www.youtube.com/watch?v=GN6ZlssqNAE",
    "category": "Howto & Style",
    "tags": [
        "m4 ipad",
        "ipad pro 13 inch",
        "apple ipad",
        "thinnest apple product",
        "M4 iPad durability test",
        "apple pencil pro",
        "magic keyboard",
        "ipad air",
        "ipad",
        "2024 ipad",
        "iphone"
    ],
    "views": 4162578,
    "likes": 211172,
    "comments_count": 9579,
    "description": "Today we durability test the Thinnest Apple Product of all time the M4 iPad Pro 13 inch. What could possibly go wrong? Turns out - the results are different than you might expect.  Grab a teardown skin for your iPad or smartphone HERE:",
    "description_links": [
        "https://www.db.io/ipad-skins"
    ],
    "transcript": "Apple's brand new 13 inch M4 iPad Pro. The thinnest Apple device ever. Thinner than even an iPod Nano. It's wild to see how far technology has come, but is it durable? Can it survive everyday life? That's what we're here to find out. Hit that subscribe button and buckle in. We're going to see how this iPad is so thin. Inside the box we get a color matched USB-C cable and a 20 watt charging brick. Thank you very much. But that's it. First thing I noticed on this M4 iPad is that since it's so thin, it's actually difficult to pick up off my desk. And it looks like mine might have arrived with a slight bow in the housing. As someone who works with metal regularly, I can zero out my angle finder on my flat tabletop, Splitting hairs of course. Not that I have many to split, but between heat treating, and warping, I imagine not many of these ultra thin iPads are going to arrive perfectly flat. .1 degrees is better than I was expecting though. And to be honest, while I don't personally yearn for ultra thin electronics, I can still appreciate that packing all this hardware into such a tiny device is an incredible feat. It really is only 5.1 millimeters thick. For my American audience, that's about the same thickness as 3 quarters, 7 razor blades, or 1 third the width of a Ben and Jerry's lid. And just for the record, I am not the Jerry mentioned in Ben and Jerry's. However, I am available for adoption. Where was I? Oh yeah. Apple says that in order to increase the overall structure with decreased thickness, they've added a cowling over the main logic board. That logic board runs through the center of the iPad, and I can even feel that central rib through the top class with just my fingers. And hopefully we'll be able to see it with our eyeballs in just a few minutes. The most impressive technological addition to the iPads this year, in my opinion, has got to be the tandem OLED display. Let's take a peek at it through my microscope. OLED screens are awesome. The individually lit pixels, as you can see here through the microscope, deliver super crisp and vibrant images. What Apple has done here, for the first time ever, is stack two OLED screens on top of each other. So not only are there 264 pixels per inch, but there are also, apparently, 264 identical pixels below those pixels acting as a backlight. An OLED backlight for an OLED display. This gives us a ridiculous 1000 nits of HDR brightness with a 1600 nits peak. If you notice, the file icon on the M4 iPad Pro has super long blue diodes, while the iPhone 15 on that same folder icon has much smaller diodes within the exact same footprint. This is actually only because the iPhone 15 OLED has twice the pixel density and is in no way comparable to the tandem OLED conversation, since my microscope only sees in a 2D plane and tandem OLED exists in 3 dimensions. But it still looks cool and it was worth a shot. The tandem OLED isn't the only thing Apple changed up. There's quite a bit more hardware inside of the Apple Pencil Pro. I'm definitely not the target demographic for a $129 professional pencil, especially when my razor knife is only 15 bucks. But I guess it just depends on which side of the tablet you'll be drawing on. As you saw, the tip is removable and inside that plastic housing is a pressure sensitive ribbon that can sense minute pressure differences from your fingers. We first saw this technology debuted with the HTC U12 Plus Android phone back in 2018. The ribbon triggers a taptic engine that we can find past the square mounting magnets. It's all tucked up into the back end where the eraser should be. The taptic engine makes it realistically feel like an actual button is getting clicked, even though there are no clicky buttons. It's a complex piece of engineering and an interesting tool built for a very specific job. Some of my favorite tools, however, are my Mohs picks, which help us differentiate between different materials. The tandem OLED Apple is using this time around because it feels to be protected with glass. And since there are no marks left by my Mohs 2, 3, 4, or 5 picks, we can be sure that Apple is using a thin tempered glass screen that scratches at a level 6 with deeper grooves at a level 7. The Mohs hardness is especially relevant this time around when we open up Apple's new Magic Keyboard. We already know that something at a softer level on Mohs scale of hardness cannot scratch any of the levels above it. A level 3 aluminum won't scratch a level 6 glass, and a level 6 glass will never scratch a level 10 diamond. However, this time around, Apple's Magic Keyboard is made from an anodized aluminum. The keys themselves are plastic. Anodization is necessary for material protection, aesthetics, and as well, there's a rather large 1% of the human population that has a bare aluminum contact allergy. We learned this while building wheelchairs at my factory. Bare aluminum is not like kryptonite or anything. It's more like a slow motion poison ivy rash after extended contact. And the aluminum oxide anodizing top layer helps eliminate those reactions. F in chat for the F. But that same aluminum oxide coating also ranks at a level 9 on Mohs scale of hardness, which when pressed right up against the level 6 glass display of the M4 iPad Pro makes me worried. However, even though the metal is coming directly in contact with that glass, the Magic Keyboard hinge does not allow for any lateral movement, which reduces the abrasive potential. And to further decrease worries of accidental scratches, I took my level 9 anodized iPhone 15 and scuffed up the iPad glass as well as I could, but each of the marks wiped completely away. I imagine the surface lubricity of the anodizing and smoothness of the glass, along with the rigidness of the Magic Keyboard, will all help to keep the glass undamaged. So far, there doesn't appear to be anything to worry about. There's no glaring build quality issues yet. There's one 12 megapixel selfie camera tucked into the long side bezel of the iPad Pro, protected with the same scratch-resistant glass. And swinging our way up to the ultra-thin frame rails, we see we have a whole lot more anodized aluminum, along with the Apple Pencil dock and two metal volume buttons that cannot be removed. The top of the iPad Pro has two stereo speaker openings and a terribly placed center microphone hole. You'll see why in a second. Moving along to the other long flat side, Apple has removed the microphone hole in the center of this rail. Glad that's gone. And down here at the bottom of the M4 iPad, we can see that the thickness of the iPad is literally constrained by the tiny size of the USB-C port, which sits right between two more stereo speaker openings. If this thing gets any thinner, we'll have a camera bump and a charging port bump. Speaking of camera bumps, Apple's removed one of the camera lenses this year, and to be honest, no one's going to notice. There's a lower time of flight 3D LiDAR scanner, and the upper circle is the only remaining 12 megapixel rear camera with a single color diffused LED flash, which is also tucked into the same camera hump. Now one of my favorite parts of owning an iPad is its immense canvas for which I can display my artwork. Drawing on the tandem temporary, so I'll just use the back. I learned two new things recently. One, apples are made up of 25% air, which was news to me. And even more interesting, lions, like the anatomically correct beast you see here, actually eat apples. Yeah, they're carnivores and all that, but if they get hungry enough, apples are on the menu. You learn something new every day. To keep your own iPad from getting scratched, might I recommend my Teardown Skin collab with dbrand. Astute observers might notice that this skin is the same teardown skin as last year, because of course we haven't seen the inside of the M4 yet, so how would I have a skin for it? But don't you worry, there's a very large probability that we'll see the insides in about 60 seconds, and then we can start shipping out the real deal. Link down in the description. The coolest part of the tandem OLED that I didn't mention before is that because of the double diodes, each pixel doesn't have to run at maximum load. Just like a person can walk farther than they can sprint, two pixels working together means that a single pixel doesn't have to work as hard. So overall the screen uses less power while having a much longer lifespan, which is awesome. There also appears to be no effect on the 13 inch ultra retina display from my lighter, even after burning it for more than 60 seconds, so thumbs up for that. Finally, the bend test. No one's going to be putting their iPad Pro in their back pocket obviously, but it will very much be bumping around in backpacks, book bags, and as Apple's thinnest product ever, we need to know how this Netflix machine is going to hold up to everyday life. When bent from the back, the answer is that it holds up surprisingly well, like suspicious black magic levels of structural integrity going on. You can see the glass screen literally ripple away from the frame, eliminating any water resistance, but all that hardware itself is still intact. Yeah, the M4 iPad Pro might be a bit bendy right out of the box and will definitely not be straight after a few months of regular use, but that central spine is definitely providing enough structure for horizontal bends. I'm very impressed. Vertical bends, however, still not as wrecked as Drake, but holy macaroni, there's no recovering from this catastrophic failure right at the charging port. The M4 iPad Pro is now built like a rainbow, or bow and arrow, or a bowing. Joke just made my life insurance go through the roof, kind of like that wheel did. The back side of the charging port itself is what put pressure on the inner side of that glass, cracking it up from the bottom edge, which means that now we get to go find the M4 chip. I do happen to have another smaller 11 inch M4 iPad Pro with the nano textured glass, so if this video gets 100,000 likes, we can see if that one also falls apart in the same place. If we roll back the glass like a very expensive tortilla, we can get our first look at that center spine, or cowling, that Apple added over the motherboard. This time around we also have some very circular loudspeakers instead of rectangular. And with 14 Phillips head screws removed, Apple's cowling comes off in two pieces. It's incredibly thin, like the rest of the iPad, but obviously gets the job done. If Apple could add another more perpendicular spine running widthwise near the charging port, where all that structure was removed, this thing probably would have survived. And there you have it, the M4 chip in all of its glory, right alongside the 10,209 milliamp hour pouch style battery. Honestly it's a pretty cool tablet. Congrats to Apple on the tandem OLED development. Let me know if I should test the smaller unit and grab your teardown skin with the link in the description. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "iPad Pro",
        "Apple",
        "tandem OLED",
        "iPad",
        "OLED",
        "tandem OLED Apple",
        "Apple Pencil Pro",
        "Pro",
        "glass",
        "Apple Magic Keyboard",
        "OLED Apple",
        "Magic Keyboard",
        "level",
        "Apple Pencil",
        "Apple brand",
        "tandem",
        "OLED screens",
        "OLED display",
        "tandem OLED display",
        "apples"
    ],
    "transcript_entity_values": [
        "3",
        "just a few minutes",
        "iPhone",
        "M4 iPad Pro",
        "M4",
        "9",
        "3 quarters",
        "Ben",
        "only 5.1 millimeters",
        "6",
        "about 60 seconds",
        "iPod Nano",
        "15",
        "20 watt",
        "the iPad Pro",
        "10,209 milliamp hour",
        "1600",
        "The M4 iPad Pro",
        "two",
        "OLED",
        "100,000",
        "American",
        "the Magic Keyboard",
        "Jerry",
        "1 third",
        "Mohs",
        "1%",
        "selfie",
        "the iPad Pro",
        "the M4",
        "Teardown Skin",
        "12 megapixel",
        "Netflix",
        "2D",
        "iPad",
        "Phillips",
        "zero",
        "10",
        "iPad",
        "this year",
        "1000",
        "5",
        "Drake",
        "Apple",
        "USB-C",
        "264",
        "OLED Apple",
        "iPads",
        "more than 60 seconds",
        "2018",
        "11 inch",
        "first",
        "second",
        "last year",
        "4",
        "a few months",
        "iPads",
        "the HTC U12 Plus Android",
        "13 inch",
        "First",
        "Apple Pencil",
        "the M4 iPad Pro",
        "129",
        "between two",
        "only 15 bucks",
        "this M4 iPad",
        "3",
        "One",
        "Magic Keyboard",
        "iPad Pro",
        "14",
        "264 pixels per inch",
        "one",
        "7",
        "25%"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "DATE",
        "QUANTITY",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT"
    ]
}