{
    "id": "Gpd2y2x1gdk",
    "title": "Fixing Game Boy Color Sound Problems",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2015-03-17T17:00:01Z",
    "video_url": "https://www.youtube.com/watch?v=Gpd2y2x1gdk",
    "category": "Gaming",
    "tags": [
        "Game Boy Color (Video Game Platform)",
        "Handheld Game Console",
        "Game Boy (Video Game Platform)",
        "Video Game (Industry)",
        "repair",
        "DIY",
        "Pokemon",
        "Nintendo (Video Game Developer)",
        "speaker",
        "soldering iron",
        "multimeter",
        "Game Boy Pocket",
        "Game Boy Advance",
        "Nintendo DS (Video Game Platform)",
        "Sound",
        "Audio"
    ],
    "views": 98118,
    "likes": 2773,
    "comments_count": 168,
    "description": "The sound on my Game Boy Color wasn't working, so here's what I did to fix it.  -----------------------------------------------------------------------------  Follow me on Twitter! @thisdoesnotcomp  This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Eric Skiff (",
    "description_links": [
        "http://ericskiff.com/music/)."
    ],
    "transcript": "Hey everyone. It's Colin, how's it goin'? In a previous video, I showed you this. This was the kind of new to me, Pokmon edition Game Boy Color that I picked up. And, it works great. It's got some cosmetic issues. It's just got some regular wear and tear, but there is one problem with it, and that is related to the sound. Now, sound problems on the Game Boy Color are nothing new. It's actually a pretty common problem with this model. So in this video, I'm gonna show you how I went about getting this thing fixed up. Some basic troubleshooting and then the actual repair, so let's go! So troubleshooting the source of the problem on these, thankfully, is very simple, and really only involves a pair of headphones and a couple of minutes of your time. So first, fire up the Game Boy with a game in it, turn the volume control all the way up. Do you hear anything? If you do hear something out of the speaker in the front, does it sound normal? Is it a decent loudness, or is it really quiet or is it really distorted? If it sounds normal, plug a headphone jack in. Does that work correctly? If that doesn't, that suggests you've got a problem with the headphone jack itself. If you get audio out of the headphone jack but you don't get anything out of the speaker inside, and that's the problem that I have with this particular Game Boy, then there's another test that you can do to figure out exactly what the cause of that problem is. What you need to do is disassemble the Game Boy, and for this basic troubleshooting, you just need to take the back cover off. It's six screws, they come out pretty quickly. You gonna need a basic multimeter, just something that you can use to test continuity. With the probe of your multimeter, and no headphone jack plugged into the socket on the Game Boy, you're gonna want to check continuity between these two points. The two points in that headphone jack are what makes the circuit so that the sound gets routed to the speaker when you don't have headphones plugged in. What we're testing by checking for continuity here is if that contact inside the headphone jack is either dirty or broken. If you don't get continuity when you're checking those two points in the jack, that means you have a problem with the jack itself. In my case, I'm getting continuity between those two points, which means I'm having a problem with the speaker itself. And that is actually one of the most common problems with the Game Boy Color is the speaker itself. For some reason, they just tend to fail. Thankfully, there's an easy solution to it in that you can go on places like eBay and buy replacement speakers very readily, and they're pretty inexpensive. At the time I'm filming this, I'm seeing deals like two of them for $10 with free shipping. Now, I wanna get this one fixed today, and also because of the fact that this is one of the limited Pokmon editions, I don't really want to stick an aftermarket part in it to repair it. I, at least, feel that there's going to be some value to be retained in the unit by using an authentic repair part. So, I decided to scrounge a replacement part from another Game Boy Color. Thankfully, I had one on hand. I actually have five other Game Boy Colors on hand, and if you've watched any of my previous videos, you'll remember, that I did a little bit of a wall hanging or wall display out of them by sticking them all on a picture frame. The yellow one of the five had some functional issues, and for an art installation, that doesn't really matter to me 'cause they don't need to function. So, that became the perfect donor machine in order for me to scavenge the part out of. So this part involves a little bit of soldering, but thankfully, it's very straightforward and easy. All you need to do is disassemble your donor Game Boy Color, desolder the wires from the speaker itself (I think it's easier to desolder them from the speaker than it is to desolder the wires from the logic board), take the old speaker out, desolder the defective speaker, and then just solder the replacement one in its place. Just a couple of minutes, you don't need a fancy soldering iron. Sometimes you won't even need any spare solder, and when you're done, you should end up with a Game Boy Color that works and sounds great. So, if you like the video, please give me the thumbs-up. If you haven't already, do subscribe. The button's right down there. And as always, thank you all so much for watching.",
    "transcript_keywords": [
        "Game Boy Color",
        "Game Boy",
        "Boy Color",
        "Game",
        "Boy",
        "edition Game Boy",
        "donor Game Boy",
        "headphone jack",
        "Color",
        "problem",
        "Boy Colors",
        "speaker",
        "jack",
        "headphone",
        "Pokmon edition Game",
        "continuity",
        "part",
        "sound",
        "points",
        "thankfully"
    ],
    "transcript_entity_values": [
        "two",
        "10",
        "eBay",
        "the Game Boy Color",
        "Pokmon",
        "Colin",
        "five",
        "jack",
        "the Game Boy",
        "six",
        "Just a couple of minutes",
        "first",
        "one",
        "Game Boy",
        "a couple of minutes",
        "Pokmon",
        "Game Boy Color",
        "today"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "DATE"
    ]
}