{
    "id": "gqEUFZgLw_Y",
    "title": "The All WALMART Gaming Setup",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-05-31T20:21:20Z",
    "video_url": "https://www.youtube.com/watch?v=gqEUFZgLw_Y",
    "category": "Science & Technology",
    "tags": [
        "wallmart",
        "walmart",
        "wal-mart",
        "wall-mart",
        "wallyworld",
        "walmrt",
        "gaming",
        "gmaing",
        "gaming setup",
        "peripherals",
        "mouse",
        "keyboard",
        "onn",
        "cheap headphones",
        "best cheap gaming setup"
    ],
    "views": 4935354,
    "likes": 129651,
    "comments_count": 5402,
    "description": "Answer your emails faster and with confidence using Grammarly! Go to  to sign up for a FREE account and get 20% off Premium!  Get your NZXT BLD system today at:   Walmart might not have the best reputation when it comes to gaming computers, but what about gaming PERIPHERALS? We searched through Walmart.com and bought all of their NEW ONN brand gaming peripherals, mice, monitors, and keyboards - OH MY!  Discuss on the forum:   Buy an onn. Lightwieght Gaming Mouse:   Buy an onn. Wireless Gaming Mouse:   Buy an onn. Webcam with Ring Light:   Buy an onn. 8 AC Outlets Surge Protector:   Buy an onn. Gaming LED Mousepad:   Buy an Iridescent Office Chair:   Buy an onn. Desktop Speakers:   Buy a Wireless Charging Lamp:   Buy an onn. Gaming Mech Keyboard:   Buy an onn. 27 Inch Gaming Monitor:   Buy an X Rocker Play:   Buy a Computer Desk:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:46 Computer Desk 1:39 Mesh Back Office Chair 2:33 Onn Gaming Monitor 4:21 Onn Power Bar 5:21 Onn RGB Mech Keyboard 6:38 Wireless Gaming Mouse 7:45 Wired Lightweight Mouse 8:17 RGB Mousepad 8:42 Webcam w/ Ring Light 9:04 Wireless Charging Lamp 10:20 Onn Desktop Speakers 11:57 Gaming Headset 13:06 Sketchy Driver 13:50 Podcast Mic 14:10 Webcam Impressions 14:11 Mic(s) Impressions 16:30 Speaker Impressions 16:46 XRocker Play 2.0 19:06 Outtakes",
    "description_links": [
        "https://grammarly.com/LTT",
        "https://nzxt.co/LinusBLD",
        "https://linustechtips.com/topic/1434442-the-all-walmart-gaming-setup/",
        "https://geni.us/ifpg7",
        "https://geni.us/k5NeON",
        "https://geni.us/bByFrB",
        "https://geni.us/Lhet",
        "https://geni.us/AKRjnIg",
        "https://geni.us/6CmZsk8",
        "https://geni.us/HBAOpF",
        "https://geni.us/qeyq",
        "https://geni.us/015lLXc",
        "https://geni.us/NWpznV",
        "https://geni.us/voUAw",
        "https://geni.us/ywBS0",
        "https://lttstore.com",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- Walmart is turned Onn. And so am I. That's right. After being laughed out of town when their overpowered series of gaming desktops received universally negative reviews, Walmart is now back with a full slew of gaming peripherals. We got speakers, monitors, (dramatic thuds) webcams, microphones, keyboards mice, desk pads, and even the desk itself. Some of it's good. Some of it literally smells like poo. And I'll tell you all about it after this segue to our sponsor! NZXT! NZXT wants to make building a custom PC easier. With NZXT BLD, just set a budget, see how the computer performs with your favorite games, and BLD takes care of the rest. Use the link below to get your own custom PC today. Our journey begins with the aptly named Hometrends computer desk. They helpfully left out words like trendy or deluxe and they do admit that it's made of PVC. Has a soft-close door, though. (door bangs) Oh, well hold on, sorry. There you go. (laughs) Having not seen the listing on their site, I'm guessing 119 Canadian dollars. - [Adam] Oh wow. Well, you're not-- You said Canadian? - I said Canadian. - [Adam] You're $10 over on the Canadian price. - I'm $10 over. Wow. Well, that's pretty good. I'm not saying I'd pay that for it. - Yeah, and especially when you consider that you could just go to Ikea, do the classic countertop plus four legs and a set of Alex drawers. - For half the price, yes. - Well... - Well, a little over half with the ALEX drawers. - If you get the ALEX drawers, it's, like, $10 more. - Certainly it'll be larger. (laughs) This is like a little Linus-sized desk! - Well, we brought you a little Linus-sized chair! - [David] Ew. - What makes this a gaming chair? Other than that it's RGB, sort of. (laughs) - This isn't the actual gaming chair that we got you. This is just their default office chair. - I see. This is their default office chair? Whose office has-- You know what? To their credit, the butt cushion on this is actually better than almost any chair I've ever encountered under, like, 100 bucks. - [Adam] Yeah, that might be true for the first half hour. - [Linus] I'm guessing... No, I'm guessing $89.99. - US or Canadian? - [Linus] Canadian. It's $69.99 Canadian. - It's $69.99 Canadian? - [David] Wow! - Yeah. And, feasibly, if it's for a child who's very lightweight, the foam was probably gonna be plenty of support. - And it is kind of child-sized. Along with this desk. - Let's get some gaming accessories. I think the first thing we have to start with is our monitor. - Oh, that's a cute pun. I thought the monitor was just called the Game, which I guess I lost now... (David groaning) But it's \"Game Onn,\" which I guess is more just their slogan and the product is the curved QHD gaming monitor. Ooh! Well, that's definitely for gamers. It's very light. (laughs) Are you getting the point based on how easily I can wiggle this around? - [David] Yeah. You've got what used to be speaker grills down here. Clearly, this is a repurposed chassis from a different model of display, 'cause there's no speakers in there. You got HDMI1, HDMI2, and display port. Now there's your power in, external power brick, and the headphone jack. Base mounting, though. That's always nice to have. And it's got joystick-style controls. Nice, quick and easy assembly so far, though. It's completely toolless up 'til now. Wow, this is surprising. It comes with both a display port and an HDMI cable, which isn't a big deal for a high end monitor, but for budget monitors where they're trying to save every couple of dollars, it's an unexpected inclusion. It means that it'll be ready to go for both your gaming PC and your console, if you're in your dorm room or whatever, right outta the box. I'm saying this puppy is $239.99 US. - [Adam] $209 US. - $209, okay. Well I'm glad I didn't go higher. And wait, it's even got height adjust! Okay, none of that. Wow. Suck on that, Apple. - [David] Oh! - Do these have Onn branding on them? - No, these are just the most generic display port cables I've ever seen. - That's funny because they actually sell Onn HDMI cables and Onn premium HDMI cables for twice the price. - Oh. What makes the premium ones premium? - The price! (Linus chuckles) - I mean, before we get anywhere, we need something to plug it into. - \"Protect Onn.\" Oh, I thought it was a joke. When it was, like, \"Game Onn?\" Yeah, they're still making puns here! \"Hang Onn!\" What, \"Hang Onn?\" Oh, I get it. - And, you know, Protect Onn, that thing that everyone says. - Yeah, Protect O-- - Yeah. - Holy crap. (plastic banging on table) This is dollar store grade, but with five volt 2.4 amps shared charging. Man, I'm sorry. I know this is gonna derail things a little bit. - [Adam] Do you wanna guess the price before we go in there? - The price better not be more than like 10 bucks. - $25. - This boy got mashed. Initially, I thought there was absolutely nothing clamping down this main AC power cord. Like, I thought you could just pull on this thing and it would just heave on the solder joints but that's not actually the case. The plastic molding has these little ribs that use this screw and this one to kind of (grunts) clamp down on it. To be clear, it's not great. (laughs) But it's something. - Well, let's get you to the accessories. - We're back to Gaming Onn. - Yes. - Oh! This is a mechanical keyboard. - [David] Hey! - Oh, that's why it's called RGB mechanical keyboard. (Adam laughs) \"Satisfying sharp click.\" Well, I think satisfying and sharp is a little optimistic. (keys clacking) - Also, did they mention what kind of blue switches? - No, they don't, but these are extremely twangy, cheap blue switches. Plastic base, but metal deck. Actually decent flex. Multiple cable channels. Height adjust. I'd never buy it at this price because I recognize the legend on the keys, and I know that you can get boards from this manufacturer for, like, 40 to 45 US dollars, but I'm gonna say this one is $60. - $44.94. - Really? - Yeah. - With the wrist rest and everything? Alright. - I just wanna highlight, I was taking a look through the quick start guide, 'cause I think quick start guides for things like keyboards are funny. Here's a way that they cut some costs. You can download the software at their website but do you think that they paid money to get onn.com? - Oh? - No, it's www.onn2.tech. (David chuckles) - Braided cable. Storage for the dongle in the base. - [David] Okay! - You got my attention, Onn. - [David] No, you're supposed say, \"You're turning me Onn.\" - Color-indicated DPI cycling, probably. Forward and back buttons on both sides, it's ambidextrous. I'm (sighs) kind of into this. If this is less than, like, 45 bucks, then I like it a lot. Type C charging! - [David] Oh! - [Linus] What! - [David] Got Logitech beat! - $36.88. - [David] What? Okay. - Man, we've now done Monoprice, AmazonBasics, and I think AliExpress for gaming setups. I think Walmart might be coming out ahead right now. What are the flipping odds? Especially given their inauspicious start in the category. - They haven't gone the Amazon route of trying to do everything. They have a lot of different stuff under the Onn brand, but they're not trying to make 20 different versions of everything, which seems good. This could be for now, though. It could get much worse. They could end up sprawling and making a bunch of-- - Well, we haven't tried any of it yet. - Yeah, still plenty of time for it to be terrible. - How much is the wired one? I would guess around the same price, given that it has very similar specs. Oh, it does have a different body type. - [Adam] Well, with all the savings they can make on shipping those lightweight mice, they come in at $24.88. - Do you have the scale? Is the scale here? I don't think the lightweight mouse is light. 100 grams, and I'm even supporting the cable here. How much is the wireless one? $110. And it has a battery in it. (chuckles) - [Adam] And for context, the super light is 63 grams. - Yeah. Alright, see you later. We have much better boxes for our mouse pads, just wanna say. lttstore.com. Much higher quality packaging. Oh God, it's RGB. Here's your micro-B power input. Alright. The top fabric is nothing special. This is a freebie-grade mouse pad, but with RGB strapped to it. I would never pay this, but I'm assuming it's, like, 20 bucks. - [Adam] $16.88. - Okay. - [Adam] If you want to stream - (groans) \"Surf Onn ring light webcam with auto focus, 1440p resolution.\" - [David] Oh, that's a mistake. - \"And a built-in microphone.\" I think the built-in ring light is probably worth an extra five bucks, so I'm saying it's $20. - [Adam] The webcam with ring light comes to $29.94 - Juice Onn wireless charging lamp! Charging pad pad wirelessly charges your Qi-enabled device. LED charging indicator. Oh, okay! You can kind of position it wherever you want. I mean, I'm sure it's not high CRI or whatever, but if you just want a little LED lamp to-- Wow, really stays exactly where you put it. Very adjustable. - [David] What's CRI? - CRI... I actually don't know what it stands for, but I know that-- - [Brandon] Color rendering index! - Sorry? - [Brandon] Color rendering index! - Color rendering index. Basically what it means is that the light outputs within a very narrow band of the visible spectrum. So you don't just have messy wavelengths that are not supposed to be there. - Might not be super accurate, 'cause we do have filming light here, but if we get really close, that's 82. - That's not bad. - That's actually not terrible actually. - But the red channel is really bad. - Right, okay. - So if you're filming, don't buy this light. - [Adam] Does the wireless charging work? - Only one way to find out. (Linus grunts) Yep, immediately. - [Adam] Oh! - And for only $19.88! - Not bad! - [Adam] Yeah! Of course we need some way to listen to audio. - Yeah, 'cause it sure isn't gonna be through the empty speaker holes on our monitor. \"Break the silence. The days of lip reading on your PC are over.\" - [David] What? - These better not be more than 25 bucks. - The speakers with volume and bass control are $19. - Nice! - [Adam] But I mean that's-- - Oh, wow. - [Adam] That's been a good trend, is that you've been overestimating most of the stuff we're getting. - Well, it's more that I just thought with inflation. You know, cheap, crappy computer speakers were 20 bucks when I was a kid. So I kind of thought, \"Well surely they've gone up a little, I haven't shopped for them since then,\" right? - And now for the pice de la rsistance, the Walmart computer! - What? - It doesn't exist, they've been shamed out of existence. They don't make any computers anymore. - Really? - Yeah, there's no pre-builts. They don't even have laptops for sale anymore, just their tablets. - Is this based on parts that are available on Walmart's website, or is this just a test bench for-- - This is just my test bench. - Oh, okay. There we go, it's Onn! (Adam laughs sarcastically) - [David] It was funny when I did it. - What is this wallpaper? I'm sorry, I'm going to-- - [David] That's the Zuck. - [Adam] Hey, no, this is my test bench! I chose my wallpaper! - Oh my God, You set this wallpaper and then the activation window closed and now it cannot be changed. - What can I say? I'm a hacker, man. (laughs) They came! - This has been a while-- Oh. Oh! - Yeah, they literally just got delivered. - Oh, this is great! We've got our headset. - I think we should maybe consider these for \"WAN Show,\" 'cause I don't know if we have podcast mics. (David laughs) - Oh. Rechargeable and wireless. And based on the pricing I've seen so far I'm gonna guess... I don't know, 65 bucks? - The wireless gaming headset is $52. - 52 bucks. And I still manage to come in over. Comes with both a USB-C charging cable and a 3 1/2 millimeter. 4 pole jack. - [Adam] (chuckles) 4 pole? - Yeah, so well, okay-- - Oh, no it's not four, I was thinking like, like audio file four pole. Just because it has the mic on the same plug. - Yes. - [Adam] Yeah. It's been a while since I've been this impressed by a budget product lineup. Every single one of these, I have overestimated the price. - [David] Walmart, you heard it here first. Put that on your box. - \"Cheaper than Linus expected.\" - [David] Yeah. (laughs) - And you know what? Holy crap, this is not a TN panel. - [David] What? - It's not a good non-TN panel. But it's not TN. I'd say it's IPS 'cause you can really see that blue glow when it's off axis. To be clear, that's not a bad thing at all. Wait, onn2.tech? - [Adam] Ww.onn2.tech. - Wait, holy crap! It doesn't even load up a site. It just immediately starts downloading the setup software. (David laughs) - [David] Not sketchy. - That is absolutely terrifying. As an end user, If I wasn't making this video, I would not wanna open any file that just automatically downloads when I visit a URL. It didn't even-- Like, look at this! I didn't even realize it was downloading something! Like, watch this. It doesn't even change the page I'm on! \"Professional sound quality with cardioid recording pattern. Ideal for podcasts, vlogs, and voiceovers. Say it again. Testing, testing, is this thing Onn?\" - [David] Damn it, they took the joke from us. - This is one of those products where I have seen impressive cheap cardioid desktop mics. So it's entirely possible this thing doesn't suck. That's not bad! Even with this light right behind me, though. That is very usable for 30 bucks. - [Adam] Have you turned the ring light on? - Huh? I have no idea how to turn the ring light on. (men talking over each other) (yelps) What just happened? Is it touch? - [David] Oh! - (gasps) It's touch! - It's up here. There's a label right there. - Now let's try the ring light. Um... (Adam laughs) Underwhelming. - [Adam] It's no brighter than your display. - Oh wow. Yeah, check this out, David. How can you have below zero? For context, let's go ahead and measure one of our studio lights. We're at 96 and you can see the biggest difference is this red channel here. That's really, really important for natural skin tones because of all the, you know, blood coursing behind our skin. So, if you have a streaming light with absolutely no red channel output, it shouldn't be surprising that you look like a ghost. Or at least I do. We forgot to record the audio, so let's do this again. We're gonna start with the microphone right on the webcam, and... (keys clacking) - I was supposed to play games like, \"I'm a streamer right now,\" or something like that. It's not working very well. We just applied a driver update from AMD and the game is just not working. - So let's switch over to the headset mic and I'll give you guys an audio sample from that. And yeah, it's crazy, like I'm firing. I can't see anything, so let's just go back to the Windows desktop and let's give the podcaster microphone a couple of different chances here. First, from its position right now under the monitor. And then second, there we go. If you wanna try and get it a little closer to your mouth in front of the keyboard, it's not the most ergonomic thing ever, but Walmart doesn't have an arm. So as a Walmart gamer, I guess I don't get an arm. Give it a chance to kind of sound a little richer and more podcast-y. I can't hear any of this. You guys are gonna have to be the judges. - So, it turns out these microphones are really spicy and you need to turn them way down in Windows to get them not to clip, like, insanely. So here's one with them not clipping. This is the podcast microphone. It's placed right in front of me. And then here's some keystrokes in the background. (keys clacking) You know, what if I'm typing a message? And then here's the audio for the webcam. Same deal, keystrokes in the background. Let us know what you think. Hopefully this sounded a little bit better than when Linus did it. (\"Crab Rave\") - 13, 14 year old me would've been happier than a pig in (beep) to have a setup like this. (\"Crab Rave\") - Would 13 or 14 year old you want one of these? - Wait, what is this? - This is what happens when you search \"gaming chair\" on Walmart. It's the X Rocker Play 2.0 floor rocker gaming chair. It's got two speakers in it, folds for storage. - It can't be worse than what I'm sitting on right now. - [David] Okay, I kind of want this. - Ew, it smells like a fart. (men laugh) Oh my God. Smell it. - Oh my God. It smells like actual horse (beep). - [David] It can't be that bad. - Oh my God, no, David. - It smells pretty-- - It actually smells like poop. - [David] What the (beep)? (Linus laughs) Why? What did they do? I don't know, but it smells really bad. I don't wanna sit on the poo chair! (laughs) Here's your audio input. It runs on five volt one amp power. I give you my personal Linus Tech Tips guarantee that these speakers sound as bad as they smell. (\"Crab Rave\") I've heard enough, this thing sucks. Can we please return this one? - [Adam] (laughs) Yeah. It smells like (beep). - I really do not want to have this in the building, and I'm gonna say $75. - [Adam] $99. (laughs) - No. - Their 2.1 version comes on a pedestal so you can sit at couch height and that's $278. - No. (David laughs) No, I'm not gonna wait any longer to tell you about our sponsor. - Thanks to Grammarly for sponsoring this video! whether you're job hunting or just trying to get all your work done before heading out for vacation for the summer, Grammarly is here for you. Grammarly is an all-in-one writing tool that helps you with grammar and spelling suggestions that help professionals save time. Simply install the free desktop app, log in, and start typing like normal. There's also Grammarly premium, which provides more in-depth feedback on your writing. It's got advanced features to help you feel more confident in your writing and to save you even more time. We recommend checking out the tone, transformation, and clarity suggestion tools to make your writing more compelling. They help you by rewording phrases to make you sound more confident and by removing unnecessary jargon to help you get your point across more clearly. A group of people here at LMG on our business team use Grammarly to help them make their workflow more efficient. It helps them save time proofreading important emails and documents, as Grammarly helps them get it right the first time. So work smarter, not harder. Go to grammarly.com/ltt to sign up for a free account and get 20% off Grammarly premium today. - [Linus] It has to be plugged into the power strip. - [Adam] That's a 3070 Ti. - [David] You got a $45,000 warranty, dude. - [Linus] Yeah, exactly, okay. I'm gonna get so many 3070 Tis if this thing blows up. You know, I've always wondered why people ask so much for dead hardware on eBay and stuff. I guess insurance fraud could be a reason. Your house burns down, so you just find a bunch of computer hardware, put it in a fire, and huck it in, whatever remains of them. - [Adam] Good tech tip. (men laughing) - No, no, no--",
    "transcript_keywords": [
        "Onn",
        "Yeah",
        "light",
        "gaming",
        "Canadian",
        "Walmart",
        "Game Onn",
        "ring light",
        "Protect Onn",
        "gaming chair",
        "chair",
        "bucks",
        "Hang Onn",
        "thing",
        "price",
        "Grammarly",
        "Onn HDMI cables",
        "Onn ring light",
        "kind",
        "wow"
    ],
    "transcript_entity_values": [
        "40",
        "45,000",
        "one",
        "I.",
        "20",
        "13",
        "eBay",
        "52",
        "16.88",
        "QHD",
        "RGB",
        "45 US dollars",
        "209",
        "Monoprice",
        "Brandon] Color",
        "Logitech",
        "36.88",
        "AMD",
        "19",
        "30 bucks",
        "110",
        "20",
        "Canadian",
        "Linus",
        "100 bucks",
        "the summer",
        "half",
        "a little over half",
        "Apple",
        "first",
        "25",
        "96",
        "that's--",
        "First",
        "David] Walmart",
        "AliExpress",
        "the first half hour",
        "five volt",
        "Amazon",
        "65 bucks",
        "60",
        "63 grams",
        "4",
        "Linus Tech Tips",
        "$209 US",
        "Hang Onn",
        "every couple of dollars",
        "BLD",
        "Adam",
        "Onn",
        "20 bucks",
        "3 1/2 millimeter",
        "29.94",
        "3070 Ti",
        "99",
        "44.94",
        "100 grams",
        "AC",
        "four",
        "Windows",
        "10",
        "24.88",
        "David",
        "$69.99 Canadian",
        "only $19.88",
        "NZXT BLD",
        "14 year old",
        "119 Canadian dollars",
        "LMG",
        "Break the silence",
        "2.0",
        "20%",
        "TN",
        "2.1",
        "$239.99 US",
        "82",
        "more than 25 bucks",
        "HDMI",
        "two",
        "45 bucks",
        "NZXT",
        "second",
        "AmazonBasics",
        "75",
        "more than like 10 bucks",
        "Crab Rave",
        "an extra five bucks",
        "Game Onn",
        "CRI",
        "89.99",
        "Game Onn",
        "today",
        "de la rsistance",
        "Surf Onn",
        "Zuck",
        "HDMI2",
        "Grammarly",
        "Walmart",
        "278",
        "US",
        "Protect Onn",
        "Gaming Onn",
        "Ikea",
        "Protect Onn",
        "WAN Show",
        "five volt 2.4",
        "Onn",
        "no--"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "MONEY",
        "NORP",
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "TIME",
        "QUANTITY",
        "ORG",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "MONEY",
        "DATE",
        "MONEY",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "MONEY",
        "PERSON",
        "MONEY",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "CARDINAL",
        "WORK_OF_ART",
        "MONEY",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "MONEY",
        "GPE",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "QUANTITY",
        "ORG",
        "ORG"
    ]
}