{
    "id": "gqIaghWK6Ec",
    "title": "Where Banks Keep Your Money",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-06-24T16:30:28Z",
    "video_url": "https://www.youtube.com/watch?v=gqIaghWK6Ec",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "banks",
        "bank vaults",
        "currency",
        "GTA",
        "federal reserve",
        "where do banks get their money from",
        "bank vault door",
        "money",
        "banking",
        "finance",
        "gold",
        "gold and silver",
        "personal finance",
        "bank",
        "economy",
        "interest rates",
        "federal reserve system",
        "where do banks keep their money",
        "finance news",
        "economics",
        "investment",
        "bank robbery",
        "bank account",
        "grand theft auto",
        "gta v",
        "gta 5",
        "cash",
        "banking system",
        "interest rate",
        "fed interest rate"
    ],
    "views": 80352,
    "likes": 3332,
    "comments_count": 137,
    "description": "It's not a piggy bank... Why There's a Traffic Jam on Mount Everest:  The $8 Trillion Company:  How Free To Play Games Took Over:  Why Disney Doesnt Make 2D Animations Anymore  Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/l_3KVwHa36M",
        "https://youtu.be/8MMe0LolYj8",
        "https://youtu.be/UgFptWUx9K0",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is where banks keep your money. Now we've all gone to the bank, seen the huge vault and wondered, \"Could I GTA that?\" Vault themselves have been around for centuries. Just look at Egyptian pyramids. But the iconic bank vaults that we know today became popular in the 1800s during the Gold Rush, when the Gold Standard actually dictated the value of currency. Prospectors in the West could go to a bank and directly exchange gold nuggets for cash. Then of course the banks would need to store that gold in their safes. But come on, this is the wild, wild West, a much more nefarious time. Early bank robbers could roll up and literally just take the safe. Like, pick it up, walk out with it at their leisure, so vaults had to get bigger, heavier, and then room-sized by the 1920s. The problem was that even as the vaults got better, thieves still found a way in. The first locks could be picked, the stronger locks could be blown up, and so on and so on. More locks were added to thicker and thicker vault doors, until ultimately the vaults hit what we see today. However, bank vaults aren't just really needed anymore. If you go to a bank today, you probably won't find 100-karat diamonds and stacks of gold bars. Instead, for the most part, vaults just contain people's safety deposit boxes filled with stuff like legal documents and whatever Matt puts in yours. - [Matt] Beanie Babies. - [Austin] Oh, that's a bad investment, man. - [Matt] Uh, time will tell! - The problem is old vaults were so well-made with concrete and reinforced steel that it is next to impossible to tear them down. I mean, a bank vault in Hiroshima was so strong that it survived the nuclear blast. Because of this, when a bank closes, most vaults just get repurposed for something much less cool. I know the town that I grew up in had an old bank that was converted into a restaurant, and so instead of getting rid of the vault, they literally just let you dine inside the vault. They would even let you close the door and take a picture, which was always super-creepy to me. So if not for a vault, then where does a bank actually keep your money? Well, in case no one has told you, banks are businesses. If there was a big pile of cash sitting in a vault, it would look cool, but it wouldn't actually make the bank any money. - [Matt] Big stacks of cash! - [Austin] That was so low, man! - [Matt] Big stacks of cash, oh! It hit my headphones. Big stacks of cash! - Wow, that's a lot of money. - [Matt] I was going to say, \"That's all the money we've got from firing Ken, but...\" - Oh, wow! Ah, a good solid 10 Gs here, I think? You're still fired, you know. Take your salary back. And no, by the way, the money that a bank loans out is actually your money. When you deposit cash to the bank, the physical bills become owned by the bank and your account gets credited. Until you withdraw the cash, the money in your bank account is intangible, existing only on paper. Well, actually not paper, it's in computers, 'cause if it was paper, it'd be money. - [Matt] No, it's actually a cloth to prevent it from tearing so easily. - [Austin] Now the vaults aren't completely void of cash. Luckily, a bank is not allowed to loan out all of their deposited money just in case you need to, I don't know, withdraw something. The Federal Reserve sets a minimum requirement for banks to have cash on hand. Depending on the size of the bank, somewhere between three to 10% of their total daily transactions has to be readily available. The amount actually fluctuates during higher demands such as during holidays. Most of that physical cash is kept in tellers' drawers, and the rest is kept in the safe or the vault. We're talking about thousands of dollars here usually, not millions. This-- - Fat stacks of cash! - No, stop, stop. Stop, man, it's not funny anymore. And, look, you're just bending our money now. Just, okay, okay. (chuckling) This makes robbing banks not super-profitable, as the average robbery only makes off with about $7500. Now that is not a small amount of money, but definitely not a big score to retire off of, Trevor. - Who's Trevor? - GTA, man. I literally just made a GTA reference, like, seven minutes ago. When the bank has more cash than they need, they typically send it to the Federal Reserve, which kind of acts like a bank for the bank. Armored carriers transport the money between the bank and the Reserve, and once they receive the money, they just check for authenticity but also integrity. With the rise of digital banking, most newer brick-and-mortar banks don't even have a vault. Instead, maybe a safe, or some might not even keep cash around at all. - [Matt] Fat stacks of cash! - No. Now, if you're just tired of dealing with your enormous piles of cash like Ken is, you might be interested in our episode on how companies like Apple get around paying taxes. And of course, if you enjoy it, make sure to subscribe to This Is, and ring that notification bell, or else we'll put Matt in a bank vault, 'cause he's our most valuable team member. (Matt groaning) (Austin giggling) - Yeah. - Aw, right.",
    "transcript_keywords": [
        "bank",
        "cash",
        "money",
        "vaults",
        "vault",
        "Gold",
        "banks",
        "Hey guys",
        "stacks",
        "bank vaults",
        "stacks of cash",
        "Federal Reserve",
        "Big stacks",
        "Gold Rush",
        "Gold Standard",
        "man",
        "Reserve",
        "GTA",
        "Big",
        "West"
    ],
    "transcript_entity_values": [
        "Reserve",
        "Apple",
        "the Gold Standard",
        "Egyptian",
        "the Federal Reserve",
        "the Gold Rush",
        "GTA",
        "millions",
        "today",
        "about thousands of dollars",
        "Trevor",
        "100-karat",
        "Matt",
        "daily",
        "the 1920s",
        "Austin",
        "centuries",
        "The Federal Reserve",
        "Hiroshima",
        "West",
        "about $7500",
        "seven minutes ago",
        "first",
        "Ken",
        "10"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "FAC",
        "ORG",
        "CARDINAL",
        "DATE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "LOC",
        "MONEY",
        "TIME",
        "ORDINAL",
        "PERSON",
        "CARDINAL"
    ]
}