{
    "id": "GqPNX17l5Lw",
    "title": "I Passive Aggressively Clean The REST Of The Craigslist PC...",
    "channel": "Dawid Does Tech Stuff",
    "channel_id": "UCvcRA2Hva1lULVf4GCouH8w",
    "subscriber_count": 688000,
    "upload_date": "2021-10-27T17:00:17Z",
    "video_url": "https://www.youtube.com/watch?v=GqPNX17l5Lw",
    "category": "Science & Technology",
    "tags": [
        "used gaming PC",
        "craigslist PC",
        "2021",
        "tech",
        "gaming",
        "pc",
        "computer",
        "nvidia",
        "gtx 1060",
        "intel",
        "quad core",
        "cleaning",
        "budget gaming pc",
        "dawid does tech stuff"
    ],
    "views": 133465,
    "likes": 10164,
    "comments_count": 1033,
    "description": "People seemed upset that I didn't clean enough of the Craigslist PC, so I passive-aggressively clean the rest of the PC.  The video that upset people:   *For some Noob-Friendly, Dawid-approved T-shirts, and more, shop   -Here is a link to my Patreon page, it would be awesome if you check it out:   -Follow me on whichever Social media you don't hate- Discord:  Twitch:  Twitch shorts channel:  YouTube:",
    "description_links": [
        "https://youtu.be/Wa9vX4pkTm8",
        "https://dawiddoesmerch.com",
        "https://www.patreon.com/DawidDoesTechStuff",
        "https://discord.gg/b34uVGaYVB",
        "https://www.twitch.tv/dawiddoestechstuff",
        "https://www.youtube.com/channel/UCAiMJaOrvTik7XyJethz-ig",
        "http://www.youtube.com/c/dawiddoestechstuff"
    ],
    "transcript": "Behind me, I have the case and the AIO from the pretty gross Craigslist system that I did a video on on Saturday. Now, it seems like some of you took a real liking to the case and the AIO because you were pretty upset by the fact that I didn't clean them. Which, I understand you know, I also find it difficult to enjoy light-hearted content when they don't have the correct cleaning to fun ratio. Wait, he didn't clean enough of the pc [ __ ] this guy. So, in an attempt to make up for my terrible video on Saturday, i'm gonna clean them. Now on my road to Gary redemption, I'm going to start off by cleaning the AIO radiator, which in the previous video I essentially abandoned at the side of the road like an unwanted Royal heir. Now, in the comments section of the previous video, a bunch of you very matter-of-factly told me, \"Dawid, why didn't you just use a vacuum cleaner to clean it?\" Now, I wish I had a better excuse than I was a pepega and didn't think of using a vacuum cleaner, but unfortunately, I was a pepega and didn't think of using a vacuum cleaner. So today, I'm going to use a vacuum cleaner to clean it. Valida and Dyson, the cleaning combo of champions. Okay let's try a different head, oh that didn't really seem to do much, but I guess it's because in the last video I had already removed most of the dust. At this point it's more of a grime issue, right? So what I ended up doing, was getting some bicarb and some toothbrushes, I've also got white vinegar if the bicarb doesn't work, uh but yeah, I'm just gonna wash away all the grime. Okay, that's not particularly effective either, so I think what I'm gonna do is I'm just gonna go rinse it out in a basin. Oh wow, that looks way better! It's not quite perfect, but it's definitely good enough. Um, the reason that I didn't initially want to use water, just like wash it out in the basin, was because I didn't want to have to wait like three days for it to dry, which was kind of what I was thinking. Uh, but I used a bunch of compressed air to just like blow most of the water out, and yeah it's actually pretty much dry at this point. So now I just need to clean the actual pump head bit and then we can take it from there, nice! Ah, Dawid! Are you sleeping again you lazy ****. Go away! Okay, well after that lovely afternoon nap, I'm gonna get back to cleaning the case. Uh, now in this situation, I think that a good vacuum will actually make a big difference, because there's still a whole bunch of dust all over the place. And then after the vacuum, I'm gonna use cleaning liquor to wipe down the more tough to reach spaces. Oh, it's finally time to clean off the man-juice-looking stains. Oh that looks way better. It doesn't look like someone's trying to use this case to smuggle house dust into Finland anymore. So now i'm gonna reassemble it, so that we can see what the system looks like in a relatively presentable state. But before I do that, it's once again time for me to tearfully bid goodbye to my Velida gloves. Ahhh, Velida fresh! Well, this is a little bit embarrassing because in the previous video I was making fun of the owner of the system for using the age-old 'two screws in the middle of one side radiator mounting method', but if you actually have ram in the system, then there's no other way to mount the radiator, so yeah it was it actually makes sense, so... Okay, we are about half an hour into a session of Battlefield 5, running at 1080p medium settings and the temperatures are again, really good. Um, the CPU may be running a bit cooler but you know there's a much bigger AIO on it, so it does make sense for it to run a bit cooler. Gaming performance is pretty good, although that i5 is definitely a bottleneck for that GTX 1060. Which is surprising. I didn't think it was gonna be a bottleneck. But yeah, all in all, the system runs well. Exactly like last time. Okay, Gary's your pc is done. I hope that it lived up to your wildest expectations. But on a serious note the case didn't clean up very well, I spent a really long time on it. The inside cleaned up okay but the exterior plastic bits, yeah, they didn't clean up very nicely. So I very much stand by my decision in the previous video, to replace the case, because modern cases are also just feature-wise, better in every way. Except for DVD drive compatibility, but you know, unless you want to open a kiosk at a train station selling pirated Frozen DVDs, I don't know why you'd need four DVD drives. Especially in terms of cable management, new cases are way better! They pretty much cable manage themselves, whereas this CM690 takes a lot more patience and effort. So I guess this case has a higher skill-cap than modern cases. You know, it clearly shows the difference between a bad pc builder and a good pc builder. He says obviously bragging about his pc building abilities. But yeah, I think it looks much better now. The AIO cleaned up way better than the case, but again, considering how run-down the system was when I initially bought it, and the fact that I don't know how old that AIO is, means that if I was buying this system to use long-term, I would also still replace the AIO on there. Because AIOs have a bit of a dubious long-term reliability and if something goes wrong with an AIO, it's a lot more disastrous than if something goes wrong with an air cooler. So, yeah I don't know how much I trust that EVGA cooler because we don't know how old it is but yeah, all in all, I think the system looks way better and yeah I'm happy that I cleaned it up. Then on a final note before we finish off the video, the whole sarcastically cleaning the pc thing was a joke. I do get why some of you were upset with the previous video. When I was cleaning the AIO and I said that I don't have time anymore, I'm going to move on to the next thing, I get that it sounded like I was saying 'I don't care about this video anymore, let me just get it out of the way so that I can go play video games or whatever', and I get that. But that wasn't at all what I meant by that. The thing is, I have a very strict upload schedule for algorithm reasons and for personal motivation reasons, to be honest. Which means that i have a limited time frame to make a video in and that means that I have to very carefully prioritize various aspects of the video making process, so when i'm saying I don't have time for this thing anymore i'm going to move on to the next thing, I'm choosing to prioritize a well-edited, entertaining video, that's engaging and funny for you to watch, as opposed to having a clean AIO in it. So in short when I'm saying 'I don't have time for the thing, I'm moving on to the next thing'. It's not because I don't care about the quality of the content, it's because I really care about the quality of the content. You may just have a bit of a different definition as to what quality content is, but that's the beauty of Youtube, right? There are a whole bunch of other Tech Youtubers that have different definitions of what quality content is and you can go find the one that works the best for you. But yeah, with that, thank you very much for watching. If you enjoyed the video please do like and subscribe to the channel for more videos like this one, and until the next video, bye!",
    "transcript_keywords": [
        "gross Craigslist system",
        "pretty gross Craigslist",
        "gross Craigslist",
        "video",
        "AIO",
        "Craigslist system",
        "clean",
        "previous video",
        "yeah",
        "case",
        "vacuum cleaner",
        "system",
        "time",
        "cleaning",
        "vacuum",
        "thing",
        "Craigslist",
        "bit",
        "clean AIO",
        "pretty"
    ],
    "transcript_entity_values": [
        "1080p",
        "Dawid",
        "Battlefield 5",
        "Royal",
        "Craigslist",
        "Finland",
        "GTX",
        "Saturday",
        "CM690",
        "Gary",
        "Velida",
        "two",
        "four",
        "Frozen",
        "Tech",
        "Youtube",
        "like three days",
        "age-old '",
        "CPU",
        "today",
        "about half an hour",
        "Dyson",
        "EVGA",
        "AIO",
        "1060",
        "Valida"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON"
    ]
}