{
    "id": "gQvg7PkFBhg",
    "title": "Dyson Vacuum - Does It Suck?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2015-11-24T15:22:31Z",
    "video_url": "https://www.youtube.com/watch?v=gQvg7PkFBhg",
    "category": "Science & Technology",
    "tags": [
        "vacuum",
        "dyson",
        "vacuum cleaner",
        "dyson cordless",
        "cordless vacuums",
        "dyson vacuum",
        "dyson v6 motor",
        "unboxing",
        "review",
        "unboxtherapy",
        "unbox therapy",
        "review tech",
        "technology",
        "christmas",
        "shop",
        "holiday",
        "gift",
        "deal",
        "black friday",
        "cyber monday",
        "gift grab",
        "asw",
        "awesome stuff week",
        "awesomestuffweek"
    ],
    "views": 920598,
    "likes": 16296,
    "comments_count": 1145,
    "description": "In this video I'll be unboxing the Dyson V6 Animal Cordless Vacuum for Awesome Stuff Week on YouTube. More info below.  It's Awesome Stuff Week: Gift Grab!  A holiday extravaganza that brings together your favorite YouTubers for a sneak peak at the best holiday gifts -- from tech toys to kitchen toys to...actual toys.  YouTube doesn't care if you've been naughty or nice -- you still deserve a shot at the greatest gifts this holiday season; you can find them here:    *The ad unit mentioned in the video currently only works in desktop",
    "description_links": [
        "http://Youtube.com/AwesomeStuffWeek"
    ],
    "transcript": "I don't know why I'm so satisfied by a vacuum This is the Dyson V6 Animal And it, I mean. It looks serious. I gotta be honest. Taking a look at this box here. Got all these different valves and what not to be honest I could probably put this thing to good use The V6 Animal, no clumsy cord, yet better overall performance than the top 5 best selling full sized vacuums They said it, I didn't, I'm here to test it. That's my job. First things first The usual paperwork, I sense a trend and oh my goodness We have various components here Check out that purple What else, this looks important. Okay, what's cool about this.. is it's a handheld [motor makes noise] [motor makes noise again] That's.. oddly satisfying? The concept here is, you know, in the kitchen, in the car you gotta get someplace real quick, you don't have to plug it in You just grab it and go and it's small enough to fit into all those little nooks and crannies But then, when you need to get more serious and you need to show the floor what's up then you plug in the rest of the components and it turns into an upright Here's the charger, pretty standard stuff. This looks like your average gadget charger This looks like the main floor unit Well, that's where the magic happens... ...right there Let's get this all setup and clean some stuff up Alright so this is what the unit looks like in 'floor mode' This is of course if you wanted to do your regular clean up But, what's more interesting to me personally is when you remove this part you put on an attachment like this and it sorta goes into 'desktop mode' or 'vehicle mode' This is really portable at this point but still powerful So, lets go ahead and get some desk dirt and see exactly how it performs Desk dirt... ... love it On the back here there's a 'max' button, you'll see when I pull the trigger.. ...it's full tilt, but if I hit that button.. [Vacuum runs quieter] It has essentially two power settings If you can hear, what I'm saying at all No problemo It's time to test this out on the floor Let's get some dirt over there, right in that corner Time to reload Wooh That, I mean that. With that floor unit right there... ...Well I had no problem with that at all. So there you have it, for a portable unit, that's versatile and can switch between modes. That''s pretty cool. Not too bad, I don't know. I think this thing could be pretty, pretty convenient So there you have it, Dyson V6 Animal youtube.com/awesomestuffweek for more awesome videos like this one Also, more videos from other people. There's a bunch of creators doing this stuff so make sure to check out that playlist Thanks very much for watching. If you enjoy this content make sure to leave a thumbs up down below and I'll catchya on the next episode, later. [cheerful music]",
    "transcript_keywords": [
        "Animal",
        "floor",
        "unit",
        "floor unit",
        "pretty",
        "desk dirt",
        "mode",
        "dirt",
        "stuff",
        "Dyson",
        "satisfied",
        "Animal youtube.com",
        "honest",
        "desk",
        "floor mode",
        "thing",
        "Check",
        "time",
        "put",
        "components"
    ],
    "transcript_entity_values": [
        "two",
        "Wooh",
        "Time",
        "The V6 Animal",
        "Dyson V6 Animal",
        "first",
        "First",
        "5"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "CARDINAL"
    ]
}