{
    "id": "Gs6nlQhGd0Q",
    "title": "PS5 and Xbox Mechanical Switch Keyboard! Mystery Tech",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2020-05-23T17:49:02Z",
    "video_url": "https://www.youtube.com/watch?v=Gs6nlQhGd0Q",
    "category": "Science & Technology",
    "tags": [
        "mystery tech",
        "how to waste money on amazon",
        "how to waste on amazon",
        "amazon",
        "ebay",
        "wish",
        "record player",
        "sony",
        "sony ps-f9",
        "gaems",
        "gaems guardian",
        "xbox",
        "playstation",
        "tesla coil",
        "tech",
        "unboxing",
        "mystery unboxing",
        "gamesir",
        "gamesir vx2",
        "chuwi",
        "chuwi minibook",
        "laptop",
        "the test drivers",
        "test drivers",
        "this is",
        "austin evans"
    ],
    "views": 2864745,
    "likes": 71966,
    "comments_count": 2317,
    "description": "When MYSTERY TECH wastes this much money on Amazon Ken is happy. I test MKBHD on how well he knows tech:  Follow me on Twitch!   The Tesla Coil on Amazon:  GameSir VX2 Keyboard/Mouse for Xbox One and PS4 on Amazon:  The GAEMS Guardian Pro XP Xbox/PlayStation case on Amazon:   By using our Amazon affiliate links we may receive compensation for purchases through those links.  My new podcast The Test Drivers!  Our second channel @thisis!  We have a new Discord:  Subscribe!  Instagram:  Twitter:",
    "description_links": [
        "https://www.youtube.com/watch?v=AEuCh_79z2U",
        "https://www.twitch.tv/austinevans",
        "https://austin.tech/teslacoil",
        "https://austin.tech/gamesirvx2",
        "https://austin.tech/gaemsguardian",
        "https://www.relay.fm/testdrivers",
        "http://www.youtube.com/thisis",
        "https://discord.gg/sQ8Sw27",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan"
    ],
    "transcript": "- So last time on Mystery Tech, we were left with a cliffhanger in that Ken lost the item that we were supposed to have. Ken, do you have this issue rectified yet? (harp music) I mean, that's not mystery tech, right? (upbeat music) (crashing) - [Matt] It's fragile. - Is this our camcorder? This is the camcorder we sold on eBay that came back returned. (laughing) - [Ken] Oh, that's not that (beep) big, whoops. - I'm getting flashbacks. Givin' me flashbacks. What am I supposed to do with a speaker and why do I have the wonderful album \"Worlds\" by Porter Robinson? I know how to speak. (thudding) Oh, look, the correct item that we were supposed to take a look at last time. Enjoy this gem from the 80's. It is a rare piece of music culture. Did you put this in the box? - [Ken] No, that was actually the seller from eBay. I was not expecting that at all. (rustling) - I think I know what this is. Is this that weird vertical Sony turntable? - [Ken] It is. - I've never seen one of these before in person. - [Matt] Well, now you have. - How much was this? - [Ken] $800. - [Matt] So, do you remember when you failed, not one, but two-- Oh, he's gone. (door slamming) So, oh. (door slamming) You decided to come back. - I just left for dramatic effect. Why are you unboxing? That's my job. - 'Cause you left. - Go over there. - You left. - Yeah, you left. - Go over there. - No, no, no, you left. You left and now I get to unbox this thing that I-- - [Austin] Sweet, I get to be behind the camera. - I'm gonna look at this camera so Josh has to use it. - [Austin] I'm just gonna be at 80 at all times. - You should actually look at the item. - [Austin] No, I like looking at you looking very pensive as you're contemplating your lack of job. - Actually, hold on. - [Matt] The unemployment's up to $600 a week. (laughing) - Yo! That's more than Austin pays me, that's (beep)-- - [Matt] That's 550 more than I get a week. - I know, right? So the cool thing about this record player is that you can actually stand it vertically and when you pop this out, your record goes in here so I can actually try to demonstrate that right now and I believe all you have to do, I mean short of plugging it in, obviously, is like you just pop it in and a disc hold. There we go. I assume now once we plug it in and press play we should be good to go and we also have to plug it in to the speaker obviously 'cause this doesn't have any. - [Austin] But you don't wanna wake up Sentient Simba. Oh, oh, oh, oh, please stop. Please stop, no one likes this. Okay, that's enough. See this is why you're behind the camera and I'm not. - Oh, yeah, I guess I should so my actual day job now. - Hey, Porter, can we use your music? Oh wait, too bad, we're all ready copyright claimed. Are we ready? - [Ken] Yes. - Look how cool that is. Oh, I heard it. (\"Divinity\" by Porter Robinson playing) - One of the cool things about this is that it looks awesome 25, 30 years later. Like, that's crazy to me. It might be a little yellowed but it works 100% flawlessly. I mean, I don't think it was worth spending $800 and I'm still upset that you spent $800 on this but it's super rad. - [Ken] There are worse ways to spend $800 though. - A few. (thudding) SideTrak, love your work wherever you work. What is it? SideTrak Portable Monitor? The ultra portable mounted monitor for laptop productivity. Does this really just connect via USB and attach to the side of your display or something? - [Ken] I literally know nothing about it. It came in the P.O. box yesterday. - Okay. All right, wait do we know how much this is? - [Matt] $299. - Wait, wait, no, no, no, no, I'm not doin' this. You have to literally permanently mount adhesive to the back of your laptop. I'm not sacrificing my laptop to put this stupid thing on. So Ken has kindly donated his laptop for BROKE vs PRO so let's see how this actually works. So I'm going to line it up with the back corner like that. (laughing) That's in, are you sure it's in, 'kay. Okay, it's fine, it'll stretch. Is that broken right now? Is that the way the USB-C port's supposed to look? (exclaiming) I didn't even pull it that hard. It's just like, first of all it's not working. We've tried a couple of cables but second of all I'm not convinced that this is the way. This is not the greatest hinge setup in the world. I don't wanna permanently attach something. Like I get this in theory but I would personally much rather use a USB-C external display. It just has a little stand like the Asus one and then I would be just fine 'cause this is like technically, if it worked, would be fine and if I didn't break the cable which I'll admit was my bad but like (grunts) and now it's just stuck on the laptop, at least the adhesive pads are. Okay there, friends. - [Ken] I'm gonna make up for how bad that was. - Okay. (thudding) (rustling) Chuwi. What's this? Oh, the Chuwi MiniBook with an eight inch screen? Oh look, something I actually like. How much was the Chuwi MiniBook? - [Ken] Paid around $400 for it. Correction, $550. - 550? - [Ken] Yes. - Great, love it. So inside, we have not only Windows and an eight inch 1920 by 1200 IPS display but we also have an Amber Lake 8100Y processor which is an i3 or m3? I'm very curious 'cause this is a very, very small little laptop. It could be cool. I'm not sure about that though. Oh, that's it, that's the little laptop. I mean that's actually kinda cool. You know it's surprisingly dense. For something that's this small this actually feels like it weighs almost as much as a really small laptop. Okay so I initially have some reservations. This keyboard is wacky as (beep) would be my official way I would describe this. So we have fairly large keys but a very bizarre layout. So the P and the delete key are shared, we have a bunch of these little mini keys that are all squished in beside the shift. So the little touch pad is interesting 'cause it's not bad but you can't make large movements with it like you kinda have to really sorta swipe with it although it is a touchscreen and realistically I feel like I would use the touchscreen more than that but I guess it's nice to have both. You know what? I could probably get used to this. I don't think I would ever be particularly fast but it's not garbage town. So while the keyboard's actually not that bad, I found a problem. The E key is just sticky, like literally it's down right now. In fact actually it's, wait how'd it get back up? Over 100% CPU, oh it's actually boosting at 2.5. Do you hear how loud that is? (whirring) I mean it's kickin' some air. There's a market for a computer like this, right? If you want something tiny that of course is running full Windows10 and with specs that are reasonable, right, I mean you've got some decent USB-A ports, you've got USB-C, you've got micro HDMI. I mean there's something to be said for the Chuwi MiniBook however, I'm not entirely sure that this is for me and especially considering that this specific model has the E key which is sticky and pretty much makes the keyboard almost unusable, that's a bit of a problem. It's cool though. I just don't really know who needs this, right? - [Ken] Ken does. - You need this, you need the Chuwi MiniBook? - [Ken] Yes. - What do you need the Chuwi MiniBook for? Are you just tryin' to like put your laptop in your back pocket like Eminem? - [Ken] No, I think it would make a very good music jukebox with a proper DAC. - Okay, so wait, are you tryin' to tell me that you spent $550 on this so I could talk about it on mystery tech for 45 seconds and then you're gonna take it home and use it from now on? - [Ken] That's how business expenses work. - [Matt] Yeah, have you not been a part of Mystery Tech ever? - [Ken] I kinda feel bad that we've been spending a lot of money for this episode. - I don't believe you but okay. - [Ken] So we're gonna even it out a little bit. - Okay. (thudding) Cell Phone Jail, lock your phones, reconnect with the real world. Why? I gotta build this thing? Thanks, Matt. (grunting) You ever see Idiocracy with Luke Cage? - [Ken] No. - It's like so-- (fast forward speaking) then why you in jail, stupid? Get out, stupid. Awesome, you'll never get your Z Flip back. I have the keys. You'll never be able to get that back. I just, you're locked, oh. - [Ken] Matt just ate the key. - So, thank you very much for the phone jail. This was really well put together and that lock really kept me out. Can we move on to the next item please? (thudding) All right. Okay, that looks complicated. Is this a little Tesla coil? - [Ken] It is. - Oh, okay, okay. - [Ken] Supposedly, it will play music. - So I immediately can tell that this is built on top of a CPU heatsink. Can you see that? It's literally it's got like the mounting and everything. That looks just like what you would put on a CPU although I guess it's mounted with the fan on the inside. How much was this Tesla coil? - [Ken] It was about 90 bucks. - All right, three, two, one. (clicking) Oh, that's cool. What? Yo, it's literally like shooting sparks out. We need to get some slow motion on this. So essentially what this is doing is it's using the Tesla coil, the magnetic field, to not only spin but also you can see that there are these sparks that are coming out the ends and it almost looks like it's sorta splitting off into two. It looks really rad. So it might be hard to see but we've now installed the needle so theoretically this is the mode that will actually work with the record so let's first start it up. 'Kay, so it's spinning. Now, let's hit play on the record. (whining) (mechanical music) Whoa! (laughing) Dude, okay, hold on a second, hold on a second. What's happening right now is music which has been pressed into this record is being read by a needle passed through this 35 year old record player through a headphone jack into a Tesla coil and is being played back on a needle. What? - [Ken] Needles are cool! - This sounds actually like a not great speaker but look at that. That's literally a needle vibrating and that is what's causing this. (mechanical music) - [Matt] How is there bass? - 'Kay, you know what, time for my next party trick. So if I get it close, oh wow, okay that immediately works. Look how far I am away when the LED turns on. You see that? If I push it closer, it gets brighter, but look all over here, I'm getting wireless power. That's wild. Wait, let me try the other one. Oh it's green. Look at that, you can see exactly where a little bit of power then move it and that's pretty much full brightness and I can move it pretty close and it just gets brighter and brighter. Oh, it even hisses. Probably shouldn't get it that close. Let there be light. (tinkling) Ah, much better. (thudding) An Xbox One X that we already own. Okay, I'm assuming there's something that goes with this. The Gamesir AimSwitch, one combo for all controllers. All right, that is a thing. Wow, that's much larger than I thought it was going to be. (clicking) Oh, I don't know if I like the feel. What kinda keys are these? TTC mechanical switch, I have no idea what that, oh mechanical red. They feel kinda like not very good, they're kinda squishy red switches. How much was the GameSir? - [Ken] This was a P.O. Box item so it could be $10, it could be $150. - I'm gonna guess it was $150, okay, got it. Plug the receiver into the USB port of the Xbox. All right, so I need a display, I need to get the Xbox up and running. - [Matt] Well, we have something for you there too. - Okay. - [Ken] It's so heavy, I broke the box. - What's up, what is that? (grunting) Games, you got a Games case? What's the Guardian and why is the address all over it? Josh, you gotta censor the frame again. Oh good, it's not the office address, it's just your home address so we can leave that, that's fine. - [Matt] Don't leak that, that's (beep). - [Ken] Well, they didn't know that until you said it. (laughing) - Now they know, now they know. Why's it so big? Why is the order placed say January? Holy (beep), what? Guardian Pro XP performance gaming monitor. What is even happening with this thing? Look at all this stuff this thing does. Do you need to do all this stuff, are you really a pro gamer? - [Ken] Also, my favorite part and part of the reason why I got it was there are mounting holes on the top not only for your smartphone but you can also mount lights on there so if you want to stream from it and have that whole set up, you can do that too. - So you're trying to say that I can plug my Twitch channel at twitch.tv/austinevans right now where I will not using this monstrosity? - [Ken] Yes, but I know where you will find someone that'll be using this monstrosity, twitch.tv/(beep). Oh, I love it. Josh, thanks for censoring that. I didn't even have to ask. How much was the Games Guardian? - [Ken] $750. - Are you trying to tell me you spent $800 on a stupid record player, $750 on a giant (beep) off gaming thing, $500 on a laptop that doesn't work. See the pile of stuff down there, look at all the things you got for Mystery Tech. What's cool? The $90 little Tesla coil. (sighing) This is the most expensive Mystery Tech of all time. This is ridiculous. (grunting) (thudding) - [Ken] I've never seen a product make you look so small. You missed a spot. - [Matt] You missed. (groaning) (grunting) (exclaiming) Wow, that's all screen. Wow, this is actually really nicely made, I will say but for $700 it better be. If you wanna be a pro gamer, you don't listen to Ken Bolido, you buy what Ken Bolido buys. You're like the real spokesman for the channel 'cause like everything you buy all the kids are gonna wanna buy 'cause you spend all the money. It's like, \"Mom, Ken used that on BROKE vs PRO, \"can I have one?\" No, little Timmy, no you can't. So after a little bit of trouble shooting we actually have not only the Games case working but our GameSir. So first of all, with the Games case, so this is taking advantage of a 1440p display and as you can see it looks actually pretty good, I'll say. I mean it might not be the brightest thing in the world but honestly I would be super happy playing with it. What's nice is compared to most portable cases the screen is massive. Now with the rest of it, it's kind of interesting so the idea is that you can cable manage this up so we have channels here and here. So the ports for the Xbox are going into the game case itself and then we have more USBs and headphone up front. So essentially what you have to do with the GameSir is this part is wireless, right, so you have your keyboard as well as your mouse so this all runs on a battery. It wirelessly connects to this little puck and this puck combines the signal from the GameSir as well as from a legitimate Xbox controller pass it via USB. I took a while to get this thing actually properly working but once you're in a game you actually do have decent controls. Red Dead's not the greatest example because it's got a little bit of that acceleration. (gun firing) Oh, speaker's actually pretty good too. It's weird though using the mouse for aim because obviously the game thinks that we're just using a controller. For some games I think this could be perhaps a bit of an unfair advantage but also it's also a little bit of a janky setup. I mean I have a lot of cables in front of me right now. I think I'm a little bit more on board with the Games case than I am with the GameSir. For very specific use cases the GameSir might be good but the problem is is that when you look at what's capable on the Xbox One X and the one already, you can plug in a mouse and keyboard and a lot of games will support that so why would you deal with this when you can just use a legitimate mouse and keyboard that will actually work much better without any of this sort of tom foolery. Thank you very much for watching this episode of Mystery Tech. Do I have a good outro, no, but I do have some words of wisdom. Don't listen to Ken. Don't spend all your money on mystery tech because inevitably what you get is a pile of disappointment. Thank you very much for watching. I will see you next time on Mystery Tech. Am I too close right now? - [Ken] It stayed actually pretty in focus, not gonna lie. (chuckling)",
    "transcript_keywords": [
        "Mystery Tech",
        "Mystery",
        "Tech",
        "Ken",
        "Games",
        "laptop",
        "Chuwi MiniBook",
        "Games case",
        "cool",
        "back",
        "Tesla coil",
        "thing",
        "Chuwi",
        "Xbox",
        "bit",
        "good",
        "left",
        "Gamesir",
        "Tesla",
        "kind"
    ],
    "transcript_entity_values": [
        "the Chuwi MiniBook",
        "25",
        "about 90 bucks",
        "80",
        "around $400",
        "first",
        "GameSir",
        "jack",
        "two",
        "Matt",
        "80",
        "an eight inch",
        "so--",
        "90",
        "The Gamesir AimSwitch",
        "Kay",
        "one",
        "500",
        "m3",
        "the Chuwi MiniBook",
        "Ken] Ken",
        "Twitch",
        "Timmy",
        "30 years later",
        "750",
        "Ken",
        "USB",
        "Austin",
        "Xbox",
        "Games",
        "Worlds",
        "Xbox One X",
        "Ken Bolido",
        "Yo",
        "the Chuwi MiniBook",
        "this 35 year old",
        "eight inch",
        "1200",
        "Amber Lake",
        "Givin",
        "550",
        "10",
        "800",
        "yesterday",
        "2.5",
        "Xbox",
        "100%",
        "Tesla",
        "SideTrak",
        "700",
        "45 seconds",
        "Sony",
        "Divinity",
        "Porter Robinson",
        "8100Y",
        "January",
        "CPU",
        "eBay",
        "299",
        "Mystery Tech",
        "Asus",
        "up to $600",
        "Sentient Simba",
        "three",
        "USB-C",
        "Ken] Matt",
        "Porter",
        "550",
        "Red Dead's",
        "P.O. Box",
        "Cell Phone Jail",
        "Windows",
        "150",
        "Guardian",
        "Guardian Pro XP",
        "second",
        "tom foolery",
        "BROKE",
        "P.O.",
        "Luke Cage",
        "Eminem",
        "SideTrak Portable Monitor",
        "Josh"
    ],
    "transcript_entity_types": [
        "LOC",
        "DATE",
        "MONEY",
        "DATE",
        "MONEY",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "MONEY",
        "ORG",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "FAC",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "MONEY",
        "PERSON",
        "ORG",
        "PERSON",
        "FAC",
        "ORG",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "MONEY",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "TIME",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON"
    ]
}