{
    "id": "gTChDJVyji8",
    "title": "Samsung Galaxy S20 \"CHONKY-EDITION\" (Ultra)",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-03-05T23:23:30Z",
    "video_url": "https://www.youtube.com/watch?v=gTChDJVyji8",
    "category": "People & Blogs",
    "tags": [
        "Samsung",
        "108 Mega Pixels",
        "S20",
        "Ultra",
        "Flagship",
        "Smart Phone",
        "2020",
        "Camera",
        "5G",
        "Space Zoom",
        "100X Zoom",
        "Optical",
        "Lenses",
        "8K",
        "Bright Night"
    ],
    "views": 728783,
    "likes": 24269,
    "comments_count": 1569,
    "description": "It's so thick and heavy! There's a ton of tech crammed into one small device, but does it live up to the hype?   Buy the Samsung S20 Ultra On Amazon (Paid Link):  On Walmart (Paid Link):  On BHPhoto (Paid Link):  On Best Buy (Paid Link):   Thanks, dbrand for sending us the phone! Check out dbrand skins, grips, and prism screen protectors at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://geni.us/mukc",
        "https://geni.us/GFHV",
        "https://geni.us/iv0gXY",
        "https://shop-links.co/1725431972995661247",
        "https://dbrand.com/minustechtips",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- My S20 Ultra 5G just arrived and I already have some questions. To my knowledge this, the priciest of Samsung's non-foldable smartphones, is only available for $1,400 with 128 gigs of storage or 1,600 with 512 gigs and yet, here we are, it's a weird 256 gig one that Deebrand seems to have unearthed somewhere. So, without further ado, let's get started. Oh, cute. They sent me JerryRigEverything's phone. Thanks guys. And wow, this thing is freaking heavy. I hadn't managed to stay completely cloistered on this one. So I had already seen some people's comments that this thing was thick and heavy, but feeling it for myself as a different than held together. You know, more than the weight, I think it's really the thickness that makes the S20 Ultra feel so different. Somehow, even compared to a monstrosity, like the Note9, it just dwarfs it. Look at this. Even without the camera bump, it's a monster. And then you add that in and this thing is like, it feels like double the thickness when you're holding it right here. Oh yeah. Can I borrow that? Thanks Sandy. (phone thuds) Oh my God. Why would you do that? Well, no wonder it felt lower density. They're about the same weight, but this is like a centimeter shorter and here, wow. Let's get camera bump to camera bump, look at that. That's a bump. (phone thuds) That's a, that's a hill. It's big, but to Samsung's credits, it's very well balanced. Like, I don't feel like there's a heavy side or a heavy end to it. Now, I wasn't that happy with the speed of Samsung's ultrasonic fingerprint scanner when it first came out and I was accused of using it wrong, but as it turned out, they did end up updating it. And no, it doesn't matter if you just touch it or if you touch it, then hold it. It's exactly the same speed. And it was, and still does appear to be a touch slower than OnePluses, but they've definitely improved it quite a bit. That's not bad. I can definitely live with that. It's in a really ergonomic spot too. Like it's right where I would naturally touch the phone if I was bracing it on the bottom with my pinky and actually it seems to not really care if you get it in exactly the right spot. It took a little longer that time you see, but it still managed to hit it. Let's go a little low. Yeah, managed to grab that one. You know, what I really like about this out of the box is the bezels. So the top and bottom are both skinny enough that I think you can with a straight face call them infinity edge or whatever it is that Samsung's branding for that is. But more importantly to me, the right and left bezels are a little bit bigger than they were on the Note10. That was something I praised with the Note9, having a little bit of buffer space for when you're reaching across the screen and I was disappointed to see them remove. I'm really glad to see that that's back. It's got support for dual SIM, but not in the conventional way. So you wouldn't put one SIM here and then another one here where the micro SD slot is, you would just use an eSIM for your second one. Out of the box, it looks like we're configured for 60 hertz display mode operation and that's one of the big features of the S20 Ultra, the 120 hertz refresh rate. So let's go ahead to apply that. Now, one thing that I think people weren't really expecting was that when you go to 120 hertz, you are stuck in the full HD plus screen resolution. So you can either do WQHD plus. This names have gotten confusing, or you can drop down to full HD and you can have 120 hertz. So you're gonna see what's going to happen here. Yeah, high refresh rate isn't supported in WQHD plus. Frankly, it's been years since my eyes have been good enough to notice the difference between the two anyway. So I know the first thing that I'd be doing is adjusting to 120 hertz and sticking with 10 ABP. Now, one thing that's curious about this phone is that Samsung is not giving users the ability to run at a variable refresh rate. So that is to say it will drop down to 60 hertz to save battery sometimes, and then jump up to 120 when the user will benefit from it. Some other manufacturers have done that, but Samsung seems to be of the mind that the 10% hidden battery life is worth it to just have this responsiveness all the time and personally, I guess I could kinda get behind that. Like, even though we're filming this video at 24 frames per second, I'm sure you guys can notice what I'm seeing here. This is absolutely freaking nuts. What's remarkable though, is not just the smoothness, but also the low pixel persistence like you can read the text as it's scrolling by. One of the reasons, allegedly, that Samsung didn't release one of their own phones with a high refresh rate display up until now, was that they weren't happy with the color reproduction on them. So that's why you've only seen them on third-party devices from the likes of OnePlus and Asus. That's pretty though, there's nothing to my eye that looks off about this. It's a fine HDR experience. You can really see the highlights of the reflections on the leaves and things like that, that flash of the sun behind him. Great. You know, what's curious, even with all the power in this thing, it barely got warm during initial setup like I'm accustomed to, actually I realized we haven't even talked specs yet. So if you're in the US which apparently also includes Canada, except when it comes to sampling review units, you get an 865. So that's the top of the line. If you're elsewhere, you get an Exynos 990, it's got 12 gigs of RAM and the 128 gig version, 16 gigs of RAM and the 256 gig version. It's got a 5,000 milliamp power battery and upgraded Gorilla Glass 6, which apparently has the same scratch resistance as before, but with better impact resistance so you should be able to drop your phone more often and from higher. Of course, though, the big headline feature is the quadruple camera setup. So you've got your 108 megapixel F 1.8 with optical image stabilization. That's the main shooter on this thing that's been making headlines, you've got the 40 megapixel F 3.5 telephoto. So that one uses this extra space over here to add a 10 X hybrid optical zoom. It also has optical image stabilization and then you've got the F 2.2 12 megapixel ultra-wide camera for fitting all of your friends in your photos. For people who have lots of friends. I wouldn't know. I don't. Finally, there's a 0.2 megapixel time of flight cameras. One of these down here, I think it's that one a little flash and all that good stuff. So that's for 3D depth sensing. So it'll show you the broader context of what you're looking at and then the little square indicates what you've actually got in the frame of the image you're capturing. Let's start with our one X image, there's a little bit more purple in this wall than there is in person but overall, I would say that is darn impressive. Like you can read a lot of detail on things like, you know, here. Like I can clearly read this label at least as well as I can in person. This dark area over here, you can see it captured a ton of detail over there. At least what I can see to the eye. Really nice looking and then let's zoom in on our little house here. Now, one of my criticisms of phone cameras that have alternate lenses or optical zooms in the past is that a lot of the time I have noticed that you don't actually get much of a benefit over just zooming in the main shooter, which is typically the best quality one. Now, one that did a better job of this was one of Walway's recent phones, where I was like, oh yeah, there is a market improvement here. But let's go ahead and make our way through. So this is our 2x image. I would say that there is maybe, a slight improvement there and not much, here's our 4x image. That, looks way better than our zoom in, definitely, a 100%. Okay, here's our 10x that also does not look noticeably better than this one to me. In fact, I would go as far as to say that actually looks more processed and worse. Now let's go all the way to 100x. I don't think that's any better than just zooming this in. I mean, it makes four an impressive spec, but like that's clearly worse. I'm actually more impressed by the 12 megapixel ultra wide. So that's a perfectly usable image for a 12 megapixel camera, but that's not really what I'm looking at. I'm more interested in how straight the C-stand pools are at the edge. You can see they've had the process them a little bit. They're not perfectly straight you can really see it on this one right here, but that is not bad. The weight? Oh, wow. So now that's really impressive. Yeah, it is actually slightly. It is slightly curved and this table here along the bottom looks completely straight. That's really hard to do with something so close to a fish eyes capture mode. I'm really happy with that. You know what's interesting is you can really, you can actually see it making the corrections in real time. So when you're moving it around, you see something more akin to what the lens sees with all the distortions but then when you hold it still, it's kinda like, ah, hold on, go stretch this out a little bit. Yeah, got no problem. Got this, got this bro. So that iPhone looks the same size in the center of the frame or at the edge of the frame. Once they've made their corrections. Now, I wanna address the big one, the 8K video recording feature. So this is the part of the video where Brandon, I actually hand you the phone and you pick up one of our 8K cinema cameras from RED and record me talking about something else in 8K on the S20 Ultra. Can you do that for me please? All right. Thank you, sir. Here's the thing, guys, when you add more pixels to an image, what you're doing is you're increasing the data rate. So you're increasing how many samples you're taking and how many pixels that you are encoding into the finished file. But what you are not necessarily doing is capturing more definition, like harder edges between objects in the frame, because you are inherently going to be limited by the quality of your sensor, not just the number of receptor sites that are on it. No Bixby, we don't wanna talk to you, by the way, massive kudos to Samsung removing the Bixby button about time, thank you. You know, I'm gonna use this opportunity to provide some followup notes on the Galaxy Folds. I still absolutely love the giant screen, but something I didn't do with it much during my review was use it outdoors. I didn't even realize that its peak brightness is only around 350 to 400 nits. So how's that 8K recording quality Brandon, what do you think? - It doesn't look that great. - Of course, it doesn't look that great it's a phone camera. I don't know why we keep going on with this silliness. I have no problem with adding recording modes that give you more frames per second, because then you're actually capturing more information that might be useful if you're trying to like do a back flip or whatever. But pumping up the resolution in these devices that have bottlenecks elsewhere is kind of like upgrading your graphics card when you're running a Celeron CPU from eight years ago, it just serves no purpose and all we're doing is creating larger file sizes so that people need to buy a phone with a greater storage capacity with no appreciable benefit that we couldn't achieve by just having, better encoded 4K, for example. Focus the effort somewhere else. Overall, I like this thing so far, and I think I'm gonna try and daily drive it for a couple of weeks. So you guys can expect a full review over on the Linus tech tips channel. Oh! Right, and one more thing before we do that though cause I never cover this stuff over on LTT is going through the accessory. Here's a Korean standard charger, a cable (blabbering). Samsung earphones. Here's the top of the box. Not empty (box rattling) (box thudding) An included the case. Oh wait, we're not gonna use that, by the way massive shout out to Deebrand for sending us over this S20 ultra because I'm on Samsung's bad list apparently. So they also have their grip available for the S20 Ultra, which you can also get with their cool Zack edition skin that shows the internals of the phone. It's available on glossy or, actually my preference is definitely the matte one. This one looks nicer in my opinion, but I'm not gonna show it to you because you're gonna have to go over on Deebrand's website and check it out there (chuckles).",
    "transcript_keywords": [
        "Samsung",
        "thing",
        "phone",
        "Ultra",
        "image",
        "camera",
        "yeah",
        "camera bump",
        "bit",
        "hertz",
        "megapixel",
        "time",
        "Samsung nonfoldable smartphones",
        "refresh rate",
        "rate",
        "gigs",
        "heavy",
        "Samsung nonfoldable",
        "frame",
        "cameras"
    ],
    "transcript_entity_values": [
        "ABP",
        "24",
        "a couple of weeks",
        "60 hertz",
        "40 megapixel F 3.5",
        "2x",
        "100%",
        "One",
        "OnePlus",
        "RAM",
        "108 megapixel",
        "60",
        "one",
        "US",
        "8",
        "Note9",
        "4",
        "1,400",
        "iPhone",
        "12 megapixel",
        "the Galaxy Folds",
        "Deebrand",
        "OnePluses",
        "Walway",
        "Sandy",
        "0.2 megapixel",
        "JerryRigEverything",
        "second",
        "Bixby",
        "LTT",
        "Samsung",
        "128",
        "Celeron",
        "Zack",
        "the little square",
        "only around 350 to 400",
        "third",
        "256",
        "865",
        "10",
        "1,600",
        "first",
        "F 1.8",
        "Brandon",
        "Deebrand",
        "Asus",
        "16",
        "two",
        "120",
        "10%",
        "2.2",
        "Canada",
        "eight years ago",
        "Korean",
        "four",
        "4x",
        "512",
        "WQHD",
        "the S20 Ultra",
        "12",
        "Linus",
        "CPU",
        "5,000",
        "years",
        "the micro SD"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "GPE",
        "DATE",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG"
    ]
}