{
    "id": "gTDResMIK_w",
    "title": "Asus UX550 - Don’t Buy This For Gaming!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-10-03T19:56:57Z",
    "video_url": "https://www.youtube.com/watch?v=gTDResMIK_w",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "Asus UX550",
        "Asus",
        "Acer",
        "GTX 1050 Ti",
        "GTX 1050",
        "GTX 1060",
        "Best Gaming Laptop",
        "Best Laptop",
        "Best Laptop for Gaming",
        "Best Laptop for streaming",
        "best laptop for gamers",
        "powerful laptop",
        "Razer Blade",
        "XPS 15",
        "aero 14",
        "aero 15",
        "max q",
        "Thin laptop",
        "lightest laptop"
    ],
    "views": 786300,
    "likes": 13504,
    "comments_count": 1253,
    "description": "Dave2D review of the Asus UX550 ZenBook Pro. The best laptop from Asus for thin and light professional work with a GTX 1050 Ti but it's not ideal for gaming. Buy Here -  Aero 15 -   Music Credits: Background: Fili - Up Coast  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2xe6pkw",
        "http://amzn.to/2xe6fcQ",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going? Dave2D here And this is the Asus ZenBook Pro for 2017 This is the UX550, and this thing was announced quite a few months ago I think was like March at Computex when this thing was revealed and I finally been able to spend some time with it It's a very powerful machine It's one of those thin-and-light work-oriented machines that also has a GTX 1050 Ti So if you want to play some games, you can... And this is the type of stuff that gets me excited. These are the type of laptops that I'm most interested in because I mean, they're kind of stealth like, they don't look like, they're not designed for gaming, but because of the video card, you'd think they'd be able to bang if you really want them to This one... Errrgh, you'll see the end of the video as to why it's not so much of a gaming laptop but it is a very good laptop for what it was meant for. I want to talk with the design first. First thing, black. This is the first Asus laptop that I've used that is black, so fully black finish, black top, black bottom There is a silver chamfer as you go around the edges But the whole idea of this thing is black. The build quality on this thing is... Good, better than expected and let me explain. The UX501 from last year and the year before had... okay build quality, not amazing, as the panels were a little softer when you press down on them. This thing is... definitely more rigid. It's definitely better build quality than the UX501 but, it's still not perfect There's still a little bit of flex on all the panels, the top, the bottom, the keyboard deck. The screen itself If you try to torque that, it's super solid. I couldn't get it twisted very much. The hinges are also well-made. The laptop on a whole I would consider to have good build quality, not excellent I wish it was better but, it is good. The port selection on this thing is good. There's actually two Thunderbolt 3 ports and those run on all four lanes of PCIe so If you plug up an external GPU, you're gonna get max bandwidth The thing that I don't love is the inclusion of a microSD slot. Now, it's cool that they have an SD slot at all, but it's microSD and this is a pro laptop, right? This is the ZenBook Pro and working professionals Very few of them are using microSD's as their main like, form of data transfer It just doesn't make sense that they put that there. It seems almost useless because You're not gonna use that. I would much prefer to see a regular SD slot, but you're stuck with that And that kind of bugs me. There's a lot of good stuff about this laptop. I like the screen I like the speakers. The speakers are actually very very impressive It has the Harman Kardon branding and usually when you have that kind of branding on a laptop It means nothing. This time, There's four speakers, two on the top, two on the bottom. The ones on the bottom are down-firing And they sound really good. I was quite impressed with it They don't sound super loud, but the audio quality is there. The mids, the lows, the highs They're all present, and they sound good. Back to the screen up top, this one's running a 1080p panel They do make a 4K panel if I'm not mistaken But this one's 1080p. Touchscreen. The color accuracy is there. It's not super bright... I wish it was brighter, but the overall image is nice And the bezels on the screen aren't too thick, it's like, I don't know It kind of looks like the newer MacBooks in terms of the bezel thickness, but it's just an improvement over their regular Asus ZenBook Pro line. It's just a thinner, cleaner looking design up top. Okay, to get to the inside of this laptop I've removed the screws, but it's pretty simple. There's ten screws. They all pop off pretty easily, T4 And when you get inside, things get less awesome? So far, it seems like a really good laptop, right? Okay. On the inside We have a fast SSD which is good We get a great Wi-Fi card, the Intel 1865, which is good The RAM is soldered on and this bugs me This is not like one of those super-thin laptops, right? So, it doesn't make sense to me that the RAM is soldered on. Now, maybe it was a space issue Maybe it was an energy efficiency issue because you know when you solder on RAM, when it's built on board It uses slightly less energy, and if that's the case... Fine, but I just don't like seeing soldered-on RAM But the thing that bugs me is the thermal design So, we're looking at two heat pipes to cool a GTX 1050 Ti and an i7 7700HQ, so these are pretty hot components, it's not like the hottest stuff out there but they're not cool components and You'll see in the thermal performance later on that they don't do great. And the battery down here is a 72 watt-hour cell. It's getting around 6 hours of battery life with the screen at 250 nits. So this is probably in the middle of the pack in terms of battery life. It's because it's not a huge battery It's kind of a small chassis so the batteries, there's only so much space in here But if you're gonna bring this thing to class or to work, and you're expecting a full day of use out of it You're probably gonna have to bring the charger with you Just because it's a little bit tight. Um... before I get into performance because I know that's what a lot of people are interested in, I want to talk about the keyboard and the trackpad. So Keyboard is a very standard Asus keyboard. It's a good keyboard. The Home, Page Up, Page Down buttons are on the side and I like them there but not everyone does because if you're not used to them being there, if you're trying to hit Backspace or Shift or Enter, you might hit those keys But I like them there because if you want to, you can use them And you will get used to their positioning, it doesn't interfere with my regular typing anymore But for people that haven't used an Asus keyboard like this before There's a bit of a learning curve. The keystrokes themselves are a little bit soft, but firm at the same time It's hard to describe but basically the pressure that it takes to activate the switch is a little more than your average keyboard, but the spring feels softer So, it's a different type of experience than I'm used to. I just haven't used an Asus keyboard for a while but... You'll get used to it quickly because when I use this thing for like three to four months before, not this one, but a keyboard very similar to this You get used to it, and it's not a problem. Trackpad, good trackpad Probably its best feature in terms of the inputs It uses Windows Precision drivers, so it's got accurate tracking and has a fingerprint sensor for quick logins and stuff in Windows Hello. Okay, let's talk about performance because that's probably the most important thing because if it doesn't have good performance, Nothing matters, right? Okay. The performance on this thing, I got to open her back up to kind of show what I'm talking about, is... good for certain people, and not so good for other people so this is running, like I said earlier, the 1050 Ti and a 7700HQ, the Kaby Lake i7. And... Because the thermal output on these two chips is quite high It's difficult to cool something like this in a chassis this small and this compact, and with the heat pipes that they have, there's only two, maybe even one and a half heat pipes You're not gonna get the best cooling. If you're doing work stuff If you're doing like video edits and renders and stuff This is sufficient because You're not stressing the GPU at 100% all the time and your workload because you're kind of using the GPU here and there as you do stuff in Photoshop or Premiere. So I ran some video edits and I ran some renders. This thing runs really well. You're getting the performance you would expect just on the paper specs. The 1050 Ti is a good card for video editing, but when you start playing games That's when issues start to rise The temps creep up and after like 20-30 minutes of gaming, you're gonna notice some serious thermal throttling and you could probably resolve this If you re-paste it, or if you undervolt it and I mean you can, I'm not gonna do it on this unit and I'm positive that if you did, if you repasted this and if you undervolt this, you would get better performance. But I wouldn't pick up this laptop if your main purpose is to play games It's a really nice looking laptop, and it's slim, but because of the thermal issues I can't just openly recommend it for people who are quote, unquote, \"gamers\". The fans don't come on very often. When it's idle, it's actually very quiet, but at full load, It's a little bit loud, not super annoying or anything, but it can get loud So this is a laptop that was designed for professional users, right? It's a ZenBook Pro and I think because of what it's equipped with, because it has a 1050 Ti, because it has an i7, I think a lot of people are drawn to the specs and think, \"Hey, I can pick this up and play games really well on it,\" but that's not what it was designed for, unfortunately. It's a really nice looking laptop. It's not super expensive I think the base model starts at 1400-1500 dollars. This unit here with everything I've decked it out with, $1700, but... Yeah, if you're a gamer and you're hoping that this would be like, the gaming laptop that didn't look like a gaming laptop, This is not that laptop, I'm sorry. I was disappointed, and I feel like a lot of my viewers were really interested in this thing because it had such potential... But, no, it's not the one. Okay. Hope you guys enjoyed this video! Thumbs if you liked it, subs if you loved it! See you guys next time! If you're curious like, if you're looking for other options I don't know if anyone is still sticking around to this part of the video, but, if you're curious, I've been using... the Aero 15X so this is the upgraded model This is not that different in size from the ZenBook Pro. It's a completely different price point This is significantly more expensive, but they've designed this thing to house a GTX 1070. It's a significantly more powerful video card, but it's similar in size But the way that they're doing is that they have to crack this thing open and like, they're putting a ton of venting on this thing to make it more viable for gaming and That's not what the ZenBook does. They try to keep it clean and minimal, and just very nice looking It does look a heck a lot nicer than this. Like, look at this But this thing is where you're gonna get performance. If you want something that's built for gaming, look at other options like this Errr, the Aero 15, this is actually the Aero 15X. Okay. See you in the next video.",
    "transcript_keywords": [
        "thing",
        "good",
        "laptop",
        "Asus ZenBook Pro",
        "ZenBook Pro",
        "Asus keyboard",
        "keyboard",
        "March at Computex",
        "Asus",
        "good laptop",
        "video",
        "Pro",
        "gaming laptop",
        "performance",
        "kind",
        "black",
        "stuff",
        "gaming",
        "build quality",
        "ZenBook"
    ],
    "transcript_entity_values": [
        "1865",
        "1400-1500 dollars",
        "Windows Precision",
        "Premiere",
        "Page Down",
        "4",
        "Windows",
        "Asus ZenBook Pro",
        "March",
        "GPU",
        "Asus",
        "ZenBook",
        "the spring",
        "ten",
        "20-30 minutes",
        "one",
        "1080p",
        "1700",
        "T4",
        "a ZenBook Pro",
        "Photoshop",
        "First",
        "UX501",
        "Aero",
        "the ZenBook Pro",
        "the year before",
        "microSD",
        "GTX 1070",
        "GTX",
        "SD",
        "Computex",
        "UX550",
        "a ton",
        "two",
        "Harman Kardon",
        "Asus",
        "The Home, Page Up",
        "first",
        "2017",
        "SSD",
        "100%",
        "four",
        "the ZenBook Pro",
        "MacBooks",
        "Errrgh",
        "RAM",
        "7700HQ",
        "1050",
        "Thumbs",
        "around 6 hours",
        "Intel",
        "only two",
        "a few months ago",
        "Asus",
        "microSD",
        "last year",
        "250",
        "three to four months",
        "72 watt-hour",
        "Thunderbolt 3",
        "max"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PERSON"
    ]
}