{
    "id": "Gv-2-kTtAc8",
    "title": "I promise this isn't stupid! - Poly Voyager Free 60+",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-09T19:02:43Z",
    "video_url": "https://www.youtube.com/watch?v=Gv-2-kTtAc8",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Poly",
        "Voyager",
        "Free",
        "Earbuds",
        "Wireless",
        "Touch Screen",
        "HP",
        "WFH",
        "Bluetooth"
    ],
    "views": 254544,
    "likes": 8427,
    "comments_count": 294,
    "description": "Thanks to Poly for sponsoring this video. Check out the Voyager Free 60+ and the rest of their lineup using the link below:   Did you ever wish that your earbuds had a touchscreen on their case? Well these ones do. And it's.... actually not terrible?  Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 1:10 First Look 3:01 Setup and the App 7:35 Multiple connections that work?? 8:41 LABS Data 12:35 Outro",
    "description_links": [
        "https://bit.ly/41LbQ4l",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- You think you've seen it all with wireless earbuds, but you know what, you haven't, because these puppies right here have something special that I've never seen before. Poly sponsored this video, we're gonna check 'em out. These are the Poly Voyager Free 60 plus. The plus being key here. They've got a screen on the case. Simple packaging, mostly cardboard, a bunch of paper at the bottom. Don't need that though. (comical explosion sound) More screens? You never know with these guys. Okay, we've got some tips. So these are the silicone in your ear type. Those larges, I gotta say are among the largest I've seen. Kind of intimidating. You know, it bends though, it'll fit in there. And then there's small, so as is tradition, the mediums are equipped. Then there's a cable or two. One's a USB A to C, little kind of charging cable. And it comes with one of these special guys which is USB C to three and a half millimeter jack. Useful on planes. You basically plug this into the in-flight system like in the chair, then you plug the USB C into the case, and then now your Bluetooth transmitting from that audio source, the plane, or other audio sources. Handy to have. And look at that, it's alive. So what it's showing right now is battery indication for the case, which is that green circle around it. And then each bud right on there. But that's not all, because I can hit the X, then what's it do? Okay, there's a music icon. More different. What is that, like an equalizer? Those are grayed out 'cause, presumably cuz nothing's playing. But I can also swipe, Bluetooth, is that turning Bluetooth on? That's grayed out. So I guess that'll illuminate when it's connected. Volume even? Handy. Whatever that means. A QR code? Hold on, I'm tempted. Okay, there it is. Poly.com. Safe for work? We don't know. Hey, I'm on the website. Tells me to download the Poly lens app. See the world through the lens of Poly. Let's take a look at the inside. Actually no, the outside. There's a USB C port for charging. There's the hinge, and that is presumably a pairing button. Now let's go inside. You got your stem type earbuds. Then also a little hidey hole for a USB. That's cool. You can dongle it if you want. I always appreciate this cuz I, honestly, I hate pairing Bluetooth, it's always finicky. It seems to be even more finicky on Windows. So nice to be able to just plug that in. Kind of shows that they maybe are focused on office use, or work use. Then you got these puppies. Here they are. Big grill on the side there, and also on the bottom. And the logo right there. And they do have that little mesh to keep your earwax out the hole on the inside. And the contact points for the charging are on the stem. All right, let's get these puppies turned on and paired. They are making contact with my face a little bit there. Your mileage is gonna marry. Marry? (church organ playing) Your mileage may vary on whether or not they actually touch you there. I don't know if I like or just dislike that. Just is what it'd be. Tap to unlock? Oh, you gotta tap it three times. Pair device. There they are, Poly V Free, pairing successful. That was actually one of the more painless pairing processes I've had a long time, especially on camera. Poly Lens the app would like to communicate with the Plantronics Voyager Free 60 series. So many names. This is a nice app. They got little animations here. All the language seems super clear and written properly. So here we are in the app. Settings. What is that? A little book icon? Oh, it's the manual. All right, that's cool. So there are different, three different EQs. I actually have measurements from labs for all of them. We'll look at those in a bit after I listen to them myself. Mute alert types. Oh, that's cool. You know, like, you do an action like muting and you'll hear someone, usually you don't have a choice, there's just a voice in your head that goes mute on or something like that. But it looks like you can actually make it go from voice to single tone. (mimicking single chime) To double tone. ( mimicking double chime) Notification tones. Hear notification tones from other connected devices while streaming audio. That's a choice. Second incoming call. Oh, you can choose the ring behavior for when you've got another line coming into to call you when you're already on a call. You can ignore or ring once, or ring continuously. God, who would do that? Mute reminder? Receive a helpful reminder that your headset is muted during a call. Huh. It says the onscreen reminder will display on your PC only, not mobile devices. It's too bad it doesn't come up on the screen on the case. You can get alerts for if your volume is too loud. Oh, it actually just tells you when your volume is maxed and not. I think I can control the volume on here. So let's try that. Can I, oh, I gotta press the button. Volume maximum. She was very, oh god, why is it? Oh god, that really is a lot. I wanna show you guys that. - [Automated Voice] Volume maximum. (earbud beeping) - Oh god, it's still beeping. I think the the dings are unnecessary. Man, there's a lot of options here. Adjust the volume of your voice that you hear when you're speaking. Volume level tones. When adjusting the volume, do you hear like a beep, beep, beep, beep, beep every step, or just at the minimum maximum? I'm gonna say, right now, it's like boop, boop, that's annoying, min to max only. These have ANC, there's actually three modes for it. You can just turn it off. It can be standard or adaptive, which is gonna use the microphone to tell how loud the environment is, and then adjust the strength of the active noise canceling accordingly. And again, we do have measurements for the ANC, I'll show you those in a little bit. Wow, select the transparency mode level and sound signature. Environment or speech. At this point, I think there's too many settings for me to go through all of them, which is a good thing. Like, that's cool, it just makes for a boring video. Rest assured you got options in here, holy cow. Custom swipe sensor. What's nice is on the stems you can actually do swipe gestures. So you can increase the volume, or you can actually customize it like you can here to make it mute during calls. And then you've also got the tap function as well. And hold for Google assistant. Oh, and that's actually super tactile. Yeah, it literally is just a little button there. Now there's also an advanced menu like holy, where were we before? Anti startle? Eliminate acoustic shock from loud sounds. Oh, I've heard of this before. That might be something that's, when you've got transparency on, and you're hearing the world around you, if something happens that's loud, like someone drops a hammer on the concrete floor or something like that, the ANC will kick back on for a second just to, like, remove that noise, and then the ANC will turn back off, onto transparency again. Let's just use 'em and see what it's like, especially this thing. Oh yeah, here we go. Turning it down, turning it up. I think that both earbuds are equal. Oh, it's on this side here, don't use the front. No double tap or triple tap, just the button. So you actually do have to use this to switch tracks or your phone. I would like it if they just added double tap to the button. Oh no, they do have double tap, I'm redialing the last outgoing call. No. Oh, here's the ANC button. It's on adaptive, can I change that from here? Transparency on, environment. (snapping fingers) The sound didn't change too much. It's pretty natural sounding. And now it's on speech. Hey you guys wanna talk to me, please? - [Off Camera] He doesn't want us to talk to him normally. - Yeah. - He wants us to talk to him now, I mean. - Yeah, I'm just switching between environment and speech. And environment, you sounded kind of more ambient, where speech definitely, it made it sound like it was more directional. I don't know if that's what's actually changing, but that's my perception of it. And then here's the ANC. Oh, that's how I can actually change devices. Can I just pair to a second phone right here? Okay, now I'm paired to this phone. Connected. Switch device. Wait, I'm actually, am I actually connected to both? What? That music is playing from the iPhone. Hold on a second here. What does it mean to be connected to two things? Oh wait, hold on a second, I'm on do not disturb on here. Oh, the music is playing. Okay, what happens if I go like that? It's refreshing over there. You've gotta pause the existing device and then play on the next device. (slams hands on table) So many earphones advertise being able to do this kind of thing, they never work. This is so sick. It works and it's just all the more clear the fact that they have the screen. You just get more communication cuz it's telling you I am in fact connected to these two things so you're not guessing as much. Finally, this is sick. Color theme? Damn, they have a dark mode, sick. Hey, this is what the mic sounds like. I'm actually sitting in an office environment right now, and there has to be someone sitting next to me clacking away at their keyboard. Can you hear it? Oh, well let's get to the graphs. Okay, check it out. This is what I believe to be the default EQ setting, which is the base one. So here you can see it's a V-shaped curve. You got a boost in the bass, you got a boost in the treble, and then you've got a little bit of a dip in the mid. So that could make voices sound a little bit thin. But these, again, are designed to be used in office and enterprise environments. So that's why they've overcooked it over here a bit, cuz this is the part of the human voice that is about intelligibility. Human voice is really across this whole range. But if you blocked out this range, you'd still be able to hear what people are saying and understand them. But if you blocked out this range, and only had this range, it would sound like Peanuts adults. Like. (muffled speech) Now, a lot of people do enjoy listening to music with this shape, you might say that you prefer flat headphones cuz you want what the artist intended and you want something closer to our target curve here. But a lot of people actually don't want that, they want beefed up bass, and they want a brighter treble. Now if this base was not beefed up over here, and you just had this without this extra boost, it would sound bad. It would sound maybe shouty and too bright. But when both ends are boosted up, it sounds better, and people like it and they sound ex excited. It's kind of like looking at an image that's oversaturated, like really overcooked greens and reds when you're at the Best Buy and you see the the demo tapes playing, \"Wow that looks awesome.\" It doesn't look real, but it looks awesome. It's kind of analogous to this. Now let's look at the other presets. This is the preset they call flat. You can see the base has been brought down a bit. But actually, it's a little bit less flat in the mids and the low mids, the high bass, you know, around a hundred. So that actually might sound worse to some people, depending on your preferences. But again, speech intelligibility is up there, so that'll be fine. And then the bright EQ is kind of just even more of that. That's gonna be, in terms of audio fidelity and trueness, like maybe the worst one. Now all of those graphs were with ANC on. We do also have them with no ANC, not gonna comment on them, they're actually pretty close. But here they are just for your reference. And here's the actual ANC measurements. So what you're seeing here is the dotted line is if you weren't wearing headphones at all. The red line is if you put them in, you have the passive isolation, and then green is when the ANC is on. So that's why the green line is lower, you're hearing less when the ANC is on. With the exception of this dip over here. And this is something you see commonly on almost all ANC headphones, you actually have, in this frequency range, better sound isolation with the ANC off. This isn't bad though. I've actually seen the gaps here be even greater than this. And then once you pass that little dip, these track really tightly ANC on and off, doesn't matter at all in this region of the spectrum. So this is about 20, yeah, 20 DB sound isolation on this end. Which is okay, there are other earphones that maybe go to like 40. But these will be fine, especially if you're in a office environment, that's gonna be okay. And here's the mic quality. You can see it tracks pretty close to the target for a lot of the parts that matter. These bumps over here might even be intentional. Like, again, you're getting into the range where speech intelligence. Ironic. Speech intelligibility becomes a factor. So, it's possible that they intended for these to be bumped up over here. And then with these huge drop offs, this is the range of hearing that's just not really gonna be relevant to human voice. So, you're kind of just filtering out other sounds that you don't want to get passed through at that point. Now I haven't worn these for very long, but I don't think they're uncomfortable. They seem like they could reasonably deliver on their claim of all day wear. They're pretty light as well. I think that, like, having the screen on here is kind of cool. I don't like when I'm doing a thing on my computer and I have to leave the the work thing I'm doing to go to, like, tab with the music and mess with that. It might be nice just to know, regardless of what device I'm using, I control it from here and I don't have to leave my spreadsheet or my actual task and get distracted by all the stuff flashing around on my music app. I can just use this. Now how about battery life though with this bright screen? Actually is pretty normal. You get five and a half hours on the buds, we've seen more, we've seen less. And then the case will charge them twice. Pretty typical stuff. Plug that puppy in for 15 minutes to get over an hour of talk time. Oh, also I never mentioned wireless charging is supported. The wireless charges are sold separately, but this case supports wireless charging. That is another premium kind of bonus feature. Very cool. So there are actually multiple models of this thing. They start at 230, but you're not gonna get the touch screen, you're not gonna get the dongle. The one I've been showing you today is 330. Now if that sounds good to you or your business, you can actually deploy these. It sounds weird to say, but your IT personnel can deploy these easily with the app. They actually are meant to be remotely monitored through the app. So to make it easy for IT teams. I don't really thought about someone deploying earphones, but I guess in this world we live in, it's part of your workstation, and a lot of people are working from home as well. So why not? That's actually a nice to have. And I did notice in the app that there was a, the software version was like right on the front page, so I guess that tracks. Check them out at the link below. Thanks for Poly for sponsoring this video. Really interesting product. Looking forward to seeing more from them.",
    "transcript_keywords": [
        "ANC",
        "sound",
        "Kind",
        "Volume",
        "Poly",
        "USB",
        "sounds",
        "bit",
        "app",
        "environment",
        "Tap",
        "speech",
        "range",
        "Poly Voyager Free",
        "Bluetooth",
        "cool",
        "screen",
        "call",
        "case",
        "voice"
    ],
    "transcript_entity_values": [
        "all day",
        "three",
        "an hour",
        "40",
        "one",
        "USB",
        "USB C",
        "iPhone",
        "Google",
        "230",
        "five and a half hours",
        "ANC",
        "second",
        "max",
        "Second",
        "three and a half millimeter",
        "Bluetooth",
        "the Poly Voyager Free 60",
        "two",
        "15 minutes",
        "EQ",
        "330",
        "jack",
        "about 20",
        "20",
        "today",
        "Poly Lens"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORDINAL",
        "TIME",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "ORG",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT"
    ]
}