{
    "id": "gV50hpSKHFQ",
    "title": "Mark Zuckerberg on the Quest Pro, metaverse, Elon's Twitter takeover and more",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-10-11T18:25:14Z",
    "video_url": "https://www.youtube.com/watch?v=gV50hpSKHFQ",
    "category": "Science & Technology",
    "tags": [
        "mark zuckerberg",
        "metaverse",
        "quest pro",
        "virtual reality",
        "meta",
        "vr",
        "oculus quest 2",
        "oculus quest",
        "oculus quest pro",
        "oculus",
        "augmented reality",
        "facebook metaverse",
        "meta quest 2",
        "oculus quest 2 pro",
        "new vr headset",
        "elon musk",
        "tiktok",
        "facebook",
        "microsoft",
        "tech",
        "mark zuckerberg interview",
        "metaverse explained",
        "what is the metaverse",
        "meta quest",
        "vr headset",
        "meta quest pro",
        "meta quest 2 pro",
        "what is metaverse",
        "the metaverse",
        "facebook meta",
        "meta quest updates"
    ],
    "views": 355060,
    "likes": 7072,
    "comments_count": 798,
    "description": "Meta CEO Mark Zuckerberg joined The Verges deputy editor Alex Heath for an in-depth conversation about the companys new high-end, mixed reality headset  the $1,499 Quest Pro  and why he isnt backing down from building the metaverse. Zuckerberg and Heath also talked about the future of social media, why he enjoys being doubted, and the growing concerns about TikToks Chinese ownership.  Read more:    0:00 Intro 0:08 Meta rebrand 7:00 Quest Pro 11:05 Face tracking and privacy 17:13 Quest pricing and sales 18:04 Target audience and use cases 21:20 Hardware strategy and profit 23:15 Microsoft partnership 27:32 Open vs. closed computing ecosystems 31:16 Competition with Apple 33:16 Mobile platforms dynamics 37:07 Metaverse doubts 40:11 TikToks impact on social media 46:46 TikToks ownership 49:13 Facebook algorithm change - discovery engine vs. MSI 51:10 Future of social media 57:12 Elon Musk buying Twitter   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3SRpCOM",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Mark, thanks for doing this. - Happy to do it, thanks for having me. - We have a lot to talk about, including this thing sitting here between us. - Yeah, it's a good one. - This new device you've got. A lot of ground to cover. Actually, I wanted to start where you and I left off a year ago when we had this conversation, which was the rebrand to Meta. It's been a year now. The world was very different a year ago. I think your company was in a very different spot, the world was just in a different spot. I guess looking back now, I'd be curious to hear you reflect on doing the rebrand when you did, and did it achieve what you hoped it would? - Well, yeah, no, I think that that is a good place to start. I'll just start off by saying that about a year ago this time you gave us a lot of trouble by breaking the news of this rebrand, so-- - Sorry about that. - No, well, you know, you were doing your job and I respect that, so. - I appreciate that. - But I think that that was just about the biggest thing of the year that we were trying to, we tried so hard to keep it under wraps, but somehow you got that one, so touche. I know there's a bunch to reflect on here. So first is this is a long term journey, right? I mean, it was never like, okay, we're trying to, the internal conversations we had actually always expected that the initial moment of the rebrand was gonna be quite negative and that over time, we would just sort of build this out, right, just because like there were all these questions around what the future vision is that we're building and all this stuff is ahead, right? I mean, this is the first version of the work VR device line that we're shipping and it's not gonna be until later this decade when we're on V4, V5 that this stuff really starts to get fully mature. And so I just figured there's so much story here left to fill out and this is like a long term thing. So I'd say the initial response to the rebrand dramatically surpassed my expectations about kind of what could be achieved in terms of people hearing the vision that we wanted to put out there. And I think like almost overnight, in the first few months, you had all these other companies sort of jumping in and talking about how they wanted to do stuff in the Metaverse too, And I think it really popularized that term and that vision in a way that that just dramatically exceeded what I'd actually expected. You look surprised. - Well, it exceeded what I, I'm surprised because it exceeded what I expected as well, the way that Metaverse became a meme in the business world, really everywhere. And now there's Chief Metaverse Officers at companies, right? I mean it sounds like you didn't expect for it to catch on quite like that. - No I kind of assumed that we were gonna have to just continue building out the roadmap and that, I mean maybe sometime like five years from now, things would start to click and people would start to understand what we were putting together. Instead, I think a lot of people really got a lot of the vision for what it is. I mean obviously it's still this high level concept and there's a ton of stuff that still needs to get built, but I think it caught people's excitement just as sort of a kind of a long term hope for what we want to build more than I'd actually thought was possible. And that I think actually poses different opportunities and challenges. On the one hand, a lot of folks are really excited about working on it. On the other hand, I do think it just sets up for a trough of disillusionment at some point because it is a vision that's far out and we're obviously investing a lot and the products are working really well. I mean, Quest 2 is working really well and I think a lot of the research that we have, and mixed reality, augmented reality, neural interfaces, like all these, I think these are leading across the industry so I'm really excited about what we're doing. But it's not like this stuff is gonna be fully mature in a year or even two or three years. It's gonna take a long time to build out the next computing platform. So we'll see. That's been generally good. But then the other piece that I've reflected on a lot is as you've said, I think the world is in a pretty different place now. You know the market is in a different place. - Your valuation, I mean it's dramatically different. - Well, us and pretty much everyone else, right? Inflation has gone up, interest rates have gone up. When interest rates go up, that weighs on all equity prices, right? But there are kind of some people who are like maybe a little bit overly kind of financial about thinking through strategy who would say, okay well when you see things like that, then you need to dial back on on kind of long term projects. And I do think you're seeing that across a lot of the industry. So there's a part of me that thinks that it actually would've been a lot harder and probably wouldn't have been received as well to have kind of announced this vision this year than last year, given where the world is. So then the question is, well how do you feel about that, you know, given that people might be less excited about it now? And, you know, I wake up in the morning and I'm like, I'm pretty happy that we did it 'cause you could either say, hey, it would be looked at somewhat more negatively today or it would be harder to do today so are you psyched that you did this thing a year ago? And yeah because I think it would've been kind of harder to mobilize around this now and like this is what we're here to do for the next decade or however long it takes to build out this next generation of computing that's gonna be fundamentally more focused on people and delivering this sense of presence that you feel like you're right there with another person. So yeah, I'd say I'm pretty positive about how it's gone so far. But also, I don't know, I feel like I've been doing this for long enough to understand that everything that goes well brings its own challenges in different ways too. So I think you just deal with what's in front of you. But we're really, I mean I'm focused on this over the long term. I mean you've gotten some sense of the road map and we're here today to talk about the next step in the journey and in some ways, it's the beginning of a big part of the journey because work is a big part of computing. There are 200 million people who get new PCs every year primarily for work. I do think that by, as we develop the Quest Pro line and continue building it out, you're gonna be able to do pretty much everything you can do on PCs on VR and more. So I think that this is just another big vector for developing the next computing platform is basically this is a step towards all 200 million of those people who get new PCs every year, instead starting to do some of the work in VR in addition to all the folks who are gaming, hanging out socially, et cetera. - Well, let's talk about the Quest Pro 'cause I got to try it at your research center in Redmond recently, and it's very different from the existing Quest line. And I think there's two big things that people will have probably not experienced until they try it. It'll be the first time they try it and see this is the face tracking and mixed reality. And I wanted to kind of talk about those two points with you maybe starting with mixed reality, which is your, this isn't VR in the traditional sense, you're actually mixing video of the world around you with VR. Why is this something that needs to exist? I mean what is mixed reality represent on the continuum of like where you've gone with VR today? - Yeah, so just first for background, mixed reality, what it basically is is it takes, you see the physical world around you and then you can overlay digital objects. So you can think about virtual reality is the system is basically painting every pixel, right, so you're in a fully immersive world, you're in a completely different place. Over the long term, you'll have augmented reality, which are glasses. Something like what you're wearing now is basically like the target of what we would like to get to. I don't know if you'll be able to get that much smaller than that 'cause there's a lot of electronics to cram in there, right, all the silicon and the projector and the wave guides to display the holograms and the cameras to basically make sure that all the objects and the holograms are locked in the right place in the world and the speakers and batteries and all that, so a lot of stuff to fit into those glasses, but you'll get that. And when you have glasses like what you're wearing now, you'll see the kind of actual photons from the world, things around you, and then you'll overlay holograms just in that place. So mixed reality is sort of this in between where it's a VR device that basically every kind of pixel that you're seeing in your vision is rendered by the graphics pipeline in the device, but it does this thing called pass through where you have cameras on the outside, an array of cameras, because your eyes, you we see in stereo, right, that's how we get 3D. So it's not just one camera, it's important that we get the different perspectives, and it can basically pass that through in high resolution and in color and then it can either print what the photons are that it's getting from the outside or it can overlay digital objects. So you can be sitting at a desk and have your kind of perfect workstation up with three huge monitors but you can see your physical keyboard in front of you and your digital mouse so you can kind of control the digital monitors that aren't actually there. - I tried this, I tried this last week and I will say the monitor thing is compelling. What I noticed was the keyboard itself was a little fuzzy still and I didn't feel like I could see the keys super well to feel like confident typing. - Yeah, I mean I think that all the stuff will get better over time. There's some kind of tracking augmentation that we can do for certain keyboards too so yours may just not have had that. But in general, you can get a sense of where this is going. I don't think, I mean, this is a V1 device, right, so it's not like the perfect incarnation of this. I mean, just like Quest 1 to Quest 2 is this huge jump and there's many times more sales. I do think, it's like we'll keep on building this out, but I think that this is the best mixed reality that anyone has built right so far and this kind of I think is enough to introduce the concept to the world, show where it's going, get the development ecosystem starting to go. So you'll get people building use cases for work, whether it's the desktop solo productivity example. You'll be able to have kind of hybrid meetings where, you know, instead of Workrooms where, which we have today where you're in VR and you can see people's avatars, now you'll be able to have hybrid meetings where some people can physically be there and you'll see them, but then other people will just show up in VR and you'll see their avatars so that'll be pretty sweet. - So there's a, I mean there's a lot of mixed reality use cases I think that will show out over time. The other component of this is face tracking and being able to see your face movements and your eye movements. And I see the value in the experience. I did a demo where I was with one of your employees in Workrooms and it did feel more visceral, like being able to see how our face reacted in real time. - Yeah. - So I understand the use case of it completely. I'm curious how you thought about building that into the product from a privacy perspective 'cause obviously there's gonna be concerns about face tracking. - Yeah, sure, sure. I mean, first let's talk about like what it is and why it's valuable. - Sure. - I mean I think, well I can answer your question quickly on the privacy side. I mean the face sensing data stays on the device and we don't send the raw data to apps and people basically have to opt-in if they want the in-app to be able to know where they're looking, the eye tracking or their face expressions. - And importantly, you don't have the raw data either, like Meta doesn't? - No, it's on the device and it's encrypted and then it basically gets thrown away as soon as it's processed. So I think that that's, so from a privacy perspective, I actually think that that's been- - You think that's solid? - Yeah, I mean we've also had people come and audit it. I'm sure over time, we'll add more capabilities and we'll need to keep thinking through this, so security is never a thing that's done, right, but it's something that we've thought through very carefully given the sensitivity around it. But I do think it's worth just talking about why this is such a big deal, right? So mixed reality I think is clearly a big deal because it's this bridge between virtual reality, which you can build today, and augmented reality, which you kinda want, but it's still a few years away from really being able to get built. So this sort of starts to bring that experience in, even if it's in a VR form factor. The face expressions are critical because it gets to why we're in this at all, which is we're really focused on the potential of VR and AR to deliver this authentic sense of presence. No other technology can do this, right? It's like when you're on your phone or if you're on a Zoom call, it's nice to be able to see the person, you can like pick up some context around them, but your brain is under no illusion that you are there with them, right? It's like if anything you're trying to convince yourself that you're kind of having a closer interaction than you obviously know you're in a different room and all that. The magic of VR, for people who have experienced this, you know that it just, it basically immediately convinces your mind that you are present in another place and with the people who are there. When you see avatars, even if they're expressive avatars that aren't yet photo realistic, it feels very rich and present when you're there in a lot of ways, even more so than what you would get on a Zoom call today, where obviously people show up in a photo realistic way, but there's just so much that it doesn't feel like you're actually present whereas even if you have this expressive somewhat cartoon avatar next to you, it actually, you feel like you're there next to each other even if you're thousands of miles apart if they're on the other coast or something like that. - And that to you is compelling in and of its own right for this technology to where you think that's gonna be a reason people gravitate towards this technology? - That to me, that is the primary value of it is basically the ability to feel and deliver this sense of presence. I think this like human sense of presence is such a profound and magical thing that we're a company that just, like everyone here wakes up in the morning and thinks about how are we gonna like help people connect and communicate. You can't deliver that kind of sense of presence on any of the platforms that we've had the opportunity to build on yet. Right, so we've built on web, on PC, on mobile. There's a lot of good things about all those platforms, but if you think about like what is the ultimate expression of social technology, you're not gonna get it on a phone. Right so that's why we're investing so much money and like so many of our top people in trying to invent and accelerate the development of this next platform because it's gonna enable I think sort of the ultimate expression of you what we set out to do in building social software. So then the question is, okay, what are all the things that we just need to like burn down to make it so that like on the list of things that get in the way of feeling like you're even more immersed and present with other people? And one of them obviously is realistic expressions. I think that this is gonna be one of the defining characteristics of this product and hopefully a lot more that we do going forward is the accurate kind of face expressions and ability to make eye contact, which is also really powerful and also something that you can't really do on video calls today. You know, it's like if you try to look at someone's eyes, you're not looking at the camera. - Yeah. - All these kinda weird issues that break the sense of present. But in order to do that, it's a pretty big trade off in the design because you're putting a bunch of different sensors in there which consume a lot of the CPU on the device and the kind of silicon power budget that you have basically processing the input from these sensors in order to make it so that when you're in VR and mixed reality and eventually augmented reality, your representation of yourself will have realistic expressions. So I mean a lot of companies I think might, I mean I'm interested to see what happens, but I think other folks in the space, you look at like Sony's coming out with a new headset this year, I mean this isn't like a thing that I think that they're prioritizing. - I think Apple's headset is gonna look and work a lot like this actually. - Well, we'll see. I mean it's, I don't know, it's been very hard for us to have any sense of what they're doing so I find it best to just- - I think we'll know soon. - Well, yeah, that'll be interesting too. But I think that this really gets to the mission of what we're doing around this. - Yeah. So in terms of tradeoffs too, this is an expensive device. This is a lot more expensive than the Quest 2. You've been very clear that you want to make these devices as cheap as possible to get them in the hands of as many people as possible. I think in 2017 you said you want a billion people in VR, that was your goal. - Well, it's a good start. - I think the Quest 2 has done over 10 million sales to date. Does that sound accurate to you? - I mean I'm not, we haven't shared any numbers. - Why not? Why not just share? - That's a good question. I think we tend to not share numbers until things are a lot bigger. - A lot bigger. So you're waiting for a certain number? - I don't actually have a number in mind but I- - Just when it feels right? - Yeah, I'm not sure- - Well, so the estimates are that you've done over 10 million with Quest. I'm sure it's higher than that. You're obviously far from a billion. But who is this device for at this price point? Because I think, you know, the Quest 2 is considered kind of a gaming device, there's a lot of social stuff starting to happen, there's fitness with supernatural. Who is the target customer for this? - So there are really two sets of folks. One are just people who want the best VR device that anyone has made. So I think if you want that, then this is it. It is better than the Quest 2, it's a lot more expensive so it won't be for everyone, but there's some group of people who want that. The second is people who want basically a device that's for productivity. And when I think about the market, I think that there are gonna be two basic different kind of tiers and price segments. I think that there's gonna be a kind of consumer oriented segment that is maybe $300, $400, $500 devices, right that people widely can afford sort of in the price of an Xbox or a PlayStation, that a lot of the use cases there will be entertainment focused, whether it's gaming or social and kind of hanging out with people or things like fitness. And that list of use cases will just continue growing but it's been pretty cool to see how that's expanded so far. If you think about how you use computers, there's also clearly a market for people who want to pay or are willing to pay $1,500, $2,000, kind of high end professionals for their workstations. - And that's what you imagine being the means for this? - Well, yeah I mean for this and for the future of the pro line overall. I do think that there's going to be a market for people who want to get, the people who are really interested in VR being able to be their primary workstation over time. I think that that's, there's gonna be a market around that and people who are sort of high end professionals there, you're already paying thousands of dollars for your workstation so I think that's pretty clear that the ability to get more technology into there to make that even better, you'd do it. Right, if I could give all of our engineers a device and have them be 3% more productive, I'd give them a $1,500 device for sure. So it's just, in terms of, so that's kind of in terms of the market segmentation, what we expect to happen. There's also this advantage in developing both of them, which is that we can introduce new technology. - First in this one. - In this before we can get it into the price point for the consumer one. And being able to work on it and developing it actually helps us get it into the consumer one faster and better. And by the time that it is in the consumer one, we already have a developer ecosystem and content around it because, and even if fewer people are buying the Quest 1 and it's more of a high end device, it'll be enough to kinda get the developer ecosystem going. So of course we're working on more devices in the consumer line too, there will be a Quest 3 at some point, not this year, but I'd love to get some of these features into future devices, whether it's Quest 3, Quest 4. And the fact that we're building Quest Pro and have that and people can start building for mixed reality. And I think it'll be just a pretty big advantage on that too. - You've been pretty open that on the Quest 2, you are not making money on the hardware. Are you making money on this like on a unit basis? - I mean I'd have to look. There are lots of different ways to basically do the accounting on this. - I guess is this a profit generating device for you? - The strategy overall is not to make money on the hardware, but to make it so that it can help develop the ecosystem and then over time the business model will be based on software and services. So that remains the approach. - I wasn't sure because I, you invest so much in hardware, you have so many people working on this, you're spending so much money on hardware, I wasn't sure if you had landed on a hardware margin business or not. - It probably depends on how exactly you account for it. So like if you're just saying what is like the materials that go into the device, maybe we're charging a little bit more for that, for the device than the materials that go into it. But if you account for all the R&D and everything, then no. But no, the strategy is not, we're not trying to have premium device prices and make a profit on that. Our whole approach as a company is get as many people as possible to be able to access these tools and then over time, you build a better ecosystem that way. - Got it. - I think that this is like a pretty deep part of our philosophy around this overall, which is we also want to help build the open ecosystem around all of this. So rather than being kind of insular and trying to do everything ourselves, a big part of the theme for this year's Connect is all the partnerships that we have, the partnership with Microsoft, which is gonna be fundamental for- - Which I want to talk about. - We're not an enterprise company. So making it so this can basically succeed with enterprises. - Yeah, well let's talk about the Microsoft partnership for a minute 'cause it's a big sweeping partnership. You know, you've got sat Satya Nadella speaking at Connect and it's across all their services. You've got Teams, you've got I mean Azure, Windows. What's in it for you and what's in it for Microsoft I guess in this dynamic? Because it's unusual to see companies this large, I think, you know, partner on such a kind of a broad way. - Yeah, I'm not actually sure how unusual it is, but I agree it's a very big deal for the development of this because I think both companies are building important pieces of technology for the next generation of computing and I think we'll just be able to unlock more together. And one of the things that I'm really excited about, I mean Teams is obviously great, the Microsoft 365 announcements, you can basically have a Windows PC in the cloud and as part of your virtual workstation, you can just stream that. So you can have at the virtual desk that we were talking about a while ago, you can have three huge monitors that are basically streaming things from your Windows PC in the cloud, but also the announcement around Intune and Azure Active Directory, which are basically the tools that Microsoft sells to enterprises so that way the CIOs know that like everything on the device is gonna be kind of secure for that enterprise in an enterprise environment and only the people who are supposed to have access to things get it. That's a pretty big deal and Microsoft has just been building this stuff for, I mean decades at this point. So while we're building some of the basic tools around this, and maybe in a decade from now we'll be in a somewhat different place, even though I don't think we're ever gonna be primarily an enterprise company, it really jump starts this if we're selling this as a work device. Work doesn't just mean enterprise. You know I don't know if you would consider your job like within an enterprise but you're clearly a high end professional. But enterprises are a big part of us. There are a lot of people who work at very big companies and Microsoft is clearly going to help jumpstart that and also be able to help sell it as part of the solution. - That was gonna be my next question. So they send customers to you potentially and they benefit because Azure grows as your ecosystem grows? - Well, I think you can imagine an environment where, or something where a company goes to Microsoft and asks how they can empower their employees in the metaverse and Microsoft has, among other things that they're basically working with that company on, one of the options that Microsoft has is to put all the Microsoft suite of services on a Quest Pro and make it easy for enterprises to adopt that. I think that that's pretty compelling for both Microsoft and us and the enterprises that now have a turnkey solution to use all the Microsoft software that they're used to inside their enterprise. And so that's gonna be pretty powerful. At the same time, I mean it's not just Microsoft, we also announced a bunch of software that Adobe is bringing. I mean, they do a lot of high end creative work. - You've got Autodesk as well. - Autodesk. Accenture, which I think is, in this industry, they're not necessarily seen as like a massive technology company necessarily, but they do a ton of integration and are one of the big kind of technology integrators and creators for that do all the last mile work for all these companies. They're an incredibly important player in the ecosystem. If you're, whatever industry you're in, if you want to help train your employees or help people troubleshoot, you're kind of training people, whether they're in a factory or on an oil rig or something, and it's like you want that software to basically be able to work not just in virtual reality for training, but mixed reality. I mean, that's awesome, right? The way you can see the environment around you, you can overlay the training modules on it, someone has to build that. Accenture is basically a great company to do that that's trusted by all these other enterprises to do that. So I think it's this suite and kind of set of partnerships that I think lays out that our philosophy on this is that we're not trying to do this all ourselves. And I think that this actually gets to a more general philosophy about computing that I think is gonna be pretty important over the next 10 years, which is that as we see this play out, is that in each generation of computing that I've seen so far, you know, PC's, mobile, there's basically an open ecosystem and there's a closed ecosystem. So in PCs, it was Windows and Mac. In mobile, it was Android and iPhone. And the closed ecosystem, very tightly integrated, relatively insular, a lot of the value basically just flows towards the closed ecosystem over time. - Listener, he's talking about Apple but yes. - Well, yeah I said, Macintosh and iPhone. The open ecosystem, basically you have much broader partnerships. Right, so Microsoft didn't build the chips, they didn't build the PC's, they didn't build the app store. Like all this key stuff that was kind of developed around the ecosystem similar with Android. And that's basically what we hope to build here is the open ecosystem for the next generation of computing around virtual and augmented reality in the metaverse more broadly which means that there are gonna need to be all these partnerships. And one of the interesting things that I just think about in the history of computing is it really isn't predetermined which type of ecosystem ends up succeeding more. In PC's, I think you'd say that Windows during the '90's and 2000's especially was really the primary ecosystem in computing, the open ecosystem was kind of winning. In mobile, I think you'd probably have to say that iOS is the winning one, even though there's technically a bunch more Androids than iPhones. - From a profit perspective. - I mean I think Apple has something like 80% of the profits and in countries like the US I think that they have 60% market share and growing. So I think the closed ecosystem has really won in mobile. But I think from that mix over time, it's really it's not clear, it's not predetermined that one model has to win out over the other. And I think we're kind of gonna get a reset in the next generation of computing. And so our goal in how we approach this is not just to help build the open ecosystem in partnership with all these other companies, but to make sure that in this generation of computing, the open ecosystem wins again. - Yeah, I mean I think that's interesting. So is it fair to say you're taking more of an Android approach then than an Apple approach here? 'Cause you do a lot of custom silicon work, you do a lot of hardware, you build the hardware, you build the software, you build services. - Yeah, I mean, I think we're still early in the story. So I think that there are pieces of this that we've had to build just because there's no ecosystem yet. But our goal is to basically be able to spread that out over time and to not, like in the future, do I expect that great companies like Samsung are gonna be building VR devices? Of course they are. And would I love to work with them? Yeah, of course, at the right time. So I think that things like that, we'll need to kind of figure out how exactly that would work. But yeah, I mean we're very early in the ecosystem. I think Quest 2 is really the first mainstream VR device. And I think before Quest 2, most of these other companies weren't even taking it that seriously. And now I think people are more open to it and there's more interesting conversations happening. - Yeah, and I have this theory that when Apple comes out with this headset they've been working on, I think everyone will see this dynamic playing out a lot more clearly that you're talking about. I think right now you're out there leading and there's gonna be more entrants that come in, specifically Apple with their approach. And I'm actually wondering while we're on that topic, you know, Apple's done quite a number on you on mobile with that ad tracking prompt. Right, you said it cost you like $10 billion or something like that in the last earnings call. - Yeah. - And I see what they're doing in headsets. They haven't obviously acknowledged it, but it's coming. Do you think those two are related at all? Because what I see is they've really hurt your ads business, their ads business is also growing pretty dramatically at the same time, and they're about to compete with you in headsets. Do you see those things as connected? - It's really hard to know. So it's hard for me- - You have to have an idea though. - I mean I don't know, I think to some degree it's hard to know what documents or conversations they have over there that either connect or don't these different parts of the strategy or what whatever. I mean, it's certainly plausible that they kind of see this competition in the future and want to hinder us. I mean I do think that, I think one thing that's been pretty clear is that their motives in doing the things that they're doing are not as altruistic as they claim them to be. You know, I'm sure that they believe at some level in the things that they're doing and think that they're good for their customers, but it can't just be a coincidence that it also aligns very well with their strategy. - Right. - But honestly, I don't wanna, it's hard for me to go too deep on this because I mean I don't work at Apple, I don't know them that well. And at the end of the day, I can't really control what they do. - Right and they may not let you on their headset, your apps on their headset, that may be the dynamic that plays out. And so I guess what I'm trying to connect the dots here is do you feel a necessity to build this stuff because of how the platform dynamics have shaped out on mobile? - That's not the main reason, but I think it certainly is one consideration. - Sure. - My belief in this, in the notion of the metaverse and in these platforms dates back to before I started Facebook. I mean I told the story last year around how I like remember when I was in middle school and I used to like be in math class and would just like not be paying attention to my teacher and just be like writing code in my notebook or ideas for things that I wanted to go code or build when I went home from school that day. And one of the things that I was really excited about was this idea of, you know, basically a kind of social environment where you could like be present and immersive and like a 3D environment around that. At the time, it's like I was a middle school kid, I didn't necessarily have the math background or the computing power available to build a bunch of that stuff but I've been, pretty much my whole life, I've been interested in kind of the intersection of technology and how people relate to each other. You know, in college, I studied psychology and computer science. And this has obviously been kind of the full history of the company has been building this kind of social software. I think that more of the motivation for this is it's this longstanding notion that basically this will unlock, in my view, the ultimate expression of kind of social technology, the ability to be present and feel like you're there with another person no matter where you actually are. I don't know. I mean, just think about this, it's like we're doing this podcast live in person. You mentioned the other day that you kind of hadn't done a ton of in person stuff since COVID started, but we don't have the technology yet to basically do something like this and have it feel, there's some reason why you want to do the podcast in person, there's a connection that you have in person and there's a reason why you didn't want to do this over Zoom. - Sure, we've done it over Zoom. It's not the same. - So I just think that like when this gets developed, I really think it's, like the ability to have this conversation where in the future, like I'm just a hologram sitting here. If we can't actually be here together, or if I'm in another country around the world or you're a hologram or, but it feels like we're physically there together. I just think that there's like a real magic to that that's gonna enable really great experiences. And you can kind of get some of that in VR today. But unfortunately, there's this dynamic that we've seen that things that feel really neat and present when you're in VR, they don't yet translate that well to 2D. Right so if you take a video of us kind of sitting there in Workrooms, we might feel like, oh wow, this is actually pretty amazing, it's like we feel like we're right there, but then you put it in 2D and you like put a video online. - [Interviewer] It collapses it, yeah. - It's just like oh that kind of looks, that just looks flat or it doesn't look that interesting which I think is part of the reason why we're not doing this in VR right now, even though I think we very well could. But I think we'll get there over the next few years too in terms of the graphical fidelity and kind of photo realism around more of this stuff. - It's very, hearing you talk about it, I mean you're obviously so passionate about it, you have such a deep conviction about it. Do you feel the kind of outside people still doubting this strategy and doubting that this is actually gonna be a thing at the scale that you seem to just have deep conviction that it will be? I think there's a lot of people that still don't A, understand what the metaverse even means, but B, also see the appeal of why they should even try one of these headsets. And do you just think it's gonna be kind of a slow gradual, like more people, network effects will come in over time? - Yeah, it'll start slow and then it'll get faster and faster and faster. - So you're not seeing some like aha killer app moment that really like catches on like wildfire? You really see this as being a gradual thing throughout this decade? - Well, I think if you're trying to build something of the scale of billions of people, that doesn't happen overnight. - I mean Facebook grew really fast. - It took eight years to reach a billion people. - I mean yeah in hindsight when you say it that way. - I actually think, I saw someone saying that this week or today is the 10 year anniversary of us reaching a billion people, which I think is kind of an interesting thing but it took a while and it's a lot easier to grow software on top of a platform that someone has already built than to basically ship atoms around. So, yeah, but I think, so this, I think it happens more in step functions, but it's like all these little s-curves that add up to getting there over time. I don't know, I kind of, I enjoy being doubted. - You do? How do you still enjoy it? Why do you enjoy it? - I don't know. If too many people kind of get or think that what you're doing is obviously gonna happen, then, I don't know, I just think it gets a little comfortable. - So you feed off the hate a little bit? - Hate is different from doubt. - Right, haters. - Well, I actually think one of the difficult things about running one of these companies or just being like a public person on the internet now is separating out people who are constructive about trying to build something versus people who are just haters. I mean there's a lot of people who are not trying to help anything. - And you probably have more haters than just about anyone in tech? - I mean, I think once you reach a certain scale, I think you get saturated, so I'm not sure. - You have to separate that out for your own sanity too, I have to imagine. - But also just like you're trying to find useful signal. I mean if you tune out everyone who thinks that you're not doing something right, then you're gonna miss a lot of really valuable signal to do stuff better than you're doing it today. So you want to not ignore critique. But at the same time, I just think that there are a lot of people who actually aren't trying to help and aren't trying to make things better. So I do think that that's sort of an art and I think it's a continual struggle for I think a lot public people on the internet, not just me. - Yeah, I wanted to talk about what's happening on the family of apps on the social media side a little bit 'cause you've got this big change happening with this discovery engine approach that you're undertaking in feed. And I mean the elephant in the room is TikTok, right, and kind of what they introduced to the world where Facebook and Instagram were built on these friends and follower models showing you content from them mostly, you call it connected and internally versus unconnected. TikTok was like, we're just gonna show you what we think our AI thinks you'll like. And it turns out people really like that. And you're currently rearchitecting the feeds to be more like TikTok's For You page in the sense that it's gonna be content that you maybe necessarily didn't even know you wanted to see, right? - Yeah. - And you said that this is a huge AI challenge, it's a huge technical undertaking. I think you said internally it'll take a while for you to like be where TikTok is in terms of how good. - Very technical term. - Yeah, I'm wondering what is the actual, what is the AI challenge that you're currently having the teams go through to make this discovery engine as compelling as you want it to be? - You know, when we got started with newsfeed, I don't think we had, we were years away from having the technology to be able to do the content understanding on each post in the system, understand what they're about, understand what you care about, and then be able to recommend to you like in real time basically with very low latency content that you might be interested in from across tens of millions or hundreds of millions of posts that are out there. If you think about it, it's actually a lot easier of a problem to basically take the several hundred things that your friends and the accounts that you follow have posted today, and just to rank them in the order that you might want to see them. And we're not necessarily recommending you content, you've chosen to follow those people, and we're just making sure that okay, if your cousin has a baby, you're not gonna miss that whereas like if someone who just posts a ton of stuff and you always ignore it posts again, maybe that's like a little further down or something. So the big shift, I think that there are really two major innovations recently, and I think you're right, that TikTok really showed that a bunch of these things were possible. So one is the emergence of like really short form video. Right so when YouTube first came about people kind of called YouTube short form compared to TV shows. Now YouTube is kind of long form form, right? Which is kind of crazy and we're old. But I think that partially what TikTok has shown is that basically there is a medium, which is even more short form video that's really powerful, which I think builds on some of the stories formats that we've seen over the years but I mean that's a thing. Then there's, that's one trend that I think is just pretty clear. Like video is becoming bigger across the apps. I think it's something like 50% or more of the time spent on Facebook now is watching video. - And you've been calling out this video trend for years, that's a known thing. I think the ranking thing and the focusing on unconnected is the big unlock. - The AI technology to now not just be able to rank the content that you're following from friends, but also really be able to actually do a very good job of showing, of basically recommending content from the whole corpus of content that's out there and making that be good. That's something that I think has only really started being possible in the last few years to do very well. And the thing is, that doesn't just apply to video. Right so while TikTok might just be doing that for video, Facebook and Instagram are a lot of formats, right? So on Facebook, you have, obviously there's photos, text, links, news, groups, long form video, all these different kinds of things, stories. On Instagram, there aren't all of those formats, but you have photo, long form video, stories, a bunch of different things and hashtags. And the same basic discovery engine technology that makes it so that you can understand what a person might be interested in and understand the meaning of all these posts and then match that up so that way you're showing a person something that they might be interested in, even if they never expressed an interest in that thing directly, that's gonna apply to all these different formats. I know that's a really interesting problem and a really interesting opportunity that I think we uniquely have to be able to go build because it's over the history of our company, we've had, you know, a number of competitors that focus on a single format. And one of the things that I think we've done well is taken on the challenge of blending the different formats together into a single feed that basically can make it so that you can get all of the different content that you're interested in because it's not all gonna be video that you wanna watch with sound on. - Yeah. And you clearly can't just flip a switch on this, like turning, focusing on this changing feed into this discovery engine, it sounds very complex. - Yeah but it's also, it's not a binary thing. So to your point about flipping a switch, we don't have to. What's basically gonna happen is that over the next year or two, what you're gonna see is just we'll start showing more recommended content in the feed and we'll know that we're doing a good job because we'll basically be able to test if we, 'cause the content in the beginning is gonna displace some other content. And either displacing that content is going to lead to negative feedback from people and lead to people connecting with each other less and all the metrics that we focus on or it will actually lead to people connecting more and being more satisfied with the product. So in the beginning, we'll start off with, whether it's 10, 12% of the content will be recommended, but I actually think we'll get to a future in the next couple of years where, I don't know, you might have 30, 40% of the content is recommended. The people who you care about are always gonna be really important to this. So I don't think that, that's not going away, right, you'll always really want to get that content too and I that that'll be an important differentiator for our services is being able to do that in addition to the recommended content, but I do think the amount of recommended content will ramp up. - While we're on TikTok, you were very early onto saying, you know, TikTok, there's problems with the Chinese ownership, we should be concerned about this. You gave a speech a few years ago about this. Now everyone's- - The speech wasn't about that. The speech was about- - No, but you talked about it. - Yeah, the speech I think was broadly about how people were, how I felt like some of the calls to censor more content were getting to a zone that I felt was kind of dangerous and too much. And I'm not a complete absolutist on this. I think that there are a lot of things that are problematic that need to be moderated and dealt with, but I also think that there's a line and I think we need to make sure we- - Well, where I was gonna go is that I think that the TikTok fear has only grown stronger, it's being talked about in D.C. all the time. What do you think the US government should do about TikTok? Are you in favor of a ban? Are you in favor of a spinoff? I think you said that a ban would be problematic at one point, but what's your view on that? Is this an area that the government should get into? Obviously, it would help you competitively, but do you have other concerns about it? - I don't know what the solution is, even though I do think it's a real question. I mean, I think in the US, one of the things that I think is sort of interesting is in the US, there's such a clear distinction between the private and public sector and the companies here operate independently and I think people understandably get upset if the integration is too much or if there isn't good separation there. But when I travel overseas one of the things that's surprising to me is in most other countries around the world, those sectors are blended so much that they almost don't believe that America operates the way it does. And China more so than any other country that I've been to, it's very integrated, right? Where the notion that like an American company wouldn't just like obviously be working with the American government on every single thing is completely foreign there, which I think does speak to at least sort of how they're used to operating. So I don't know what that means. I think that that's a thing to be aware of. - That sounds like you haven't formed a real opinion on what should happen. - I try to spend my time on things that I can make an impact on. - Sure. Well okay, so on the feed, I haven't heard you talk about this or reflect on this. The last error of the feed was this thing you called meaningful social interactions and you were really prioritizing content that your close friends commented on and engaged with. Discovery Engine feels like a departure from that in that you're introducing content that's not from your friends into the feed. Is that a fair distinction? - So I think it's a different loop. The way that people interact in the past was someone would post something and then there would be a lot of comments in feed. I think the way that social services have evolved is that most of your kind of real interactions at this point are in messaging. So the way that feed is primarily creating value at this point is showing people content that then you go find and you send to your friends in messaging and have real interactions in messaging. So from that perspective, it used to matter more who posted the content that you saw in feed, because if you're commenting on it, in line, you were interacting with the person who posted it. Now I think it still matters in the sense that you want to know what's going on in your friends' lives. So if you're not getting updates from them in feed, there's a set of people who maybe aren't your closest friends and maybe it's your second or third ring of people that you care about but they're not gonna personally message you to kind of update you on everything, that you still want to know what's going on with them, feed is important for that. But increasingly what we're seeing is in the flywheel around Discovery Engine is whether it's content from a creator or content from a friend, you see something interesting, you send it to a group of friends or a friend and then you're kind of interacting there. And that actually does facilitate real interactions between people. But I don't know, I'm sure you've seen this in your own usage. - Absolutely. I think everyone has this feeling about how their feeds has changed and I guess what I'm trying to get from you is do you feel like that MSI, the meaningful social interactions era, what's your take on how it went? Because I think you said at the time, if it works, it's gonna lead to less time spent on Facebook, and I'm okay with that, I want it to be time well spent. And now you're shifting into video, which is a lot of consumption and a lot of viewing. - Yeah well so you're conflating a few, there are a few different things there. The meaningful social interactions shift that we made was when we started seeing this trend that basically people were starting to comment less. At the same time, people were watching more video and especially longer form video was displacing a bunch of content from friends and people were actually writing it and saying, \"Hey, I'm missing stuff for my friends because I'm watching all these videos.\" So we're like, okay, two things that we want to do. One is we want to make sure you're not missing content from your friends 'cause that's what we're here to do. You can find some entertaining videos here and you can do that in other places too, but you're not gonna find the content from your friends in other places so we want to make sure we're doing that well. So that was the comment that I made around, even if we show less video and time spent goes down, which it did, that still seems like a good thing over time 'cause we're here to help you interact. We did put in place a set of changes around, and we're constantly evolving the algorithm, the way that feed works. But at the time, we wanted to make sure there wasn't changes that we were making that were basically leading to this decline in commenting in line. So we wanted to make sure that we were building feed and optimizing for people interacting, not just viewing content and passively consuming it. - And do you feel like the discovery engine will get people to consume more passively? Is that a concern for you? - Well, no, because of the thing that I'm saying, which is that most of the meaningful interactions at this point are shifting to messaging. Right so what we see is if we build feed in a way that isn't necessarily trying to optimize the amount of time in feed, but the kind of engine that's driving that thinks that okay, if I show you a piece of content and you think it's interesting, and let's say you don't do anything in feed, but you send it to a friend and then have a message throughout there, like if that's good. - You can goal towards that. - Yeah and I think that that is good. So I think that the initial push towards I think what is kind of technically in the press called the MSI chain, from my perspective, was more of this sort of directional shift in feed that we've evolved towards and continue pushing on. No, I think that that like reflects the values of the company. It's like, of course we want to have feed lead to more interactions between people and not just passive consumption of content. But I think you also want to make sure that we're being dynamic about like what are the ways that people are actually interacting? - Yeah, I have a couple quick questions if you're cool. I would love to know what you think of BeReal. They're growing very fast. Have you tried it? What do you think about what they're doing? Focusing on close friends. - I think it's interesting. - Yeah, interesting. Is it something that you think like your products could use more of or you feel like that's more the messaging component? - Well, so my basic sense of the way the ways that social media are is evolving is basically there's a kind of whimsical, fun element of it, and then there's like a professionalized element of it. So if you look at like the whimsical fun element, it's basically this constant pursuit of finding new things that feel authentic, whether it was initially just being able to update your profile at college or be able to have a status update or be able to take an ephemeral photo or post a story. It's like these things I think, just in the beginning, they feel so fun and whimsical and people feel like they can be authentic doing it. But then over time it just kind of, you get used to it and then it sort of gets a little bit more professionalized. - The brands come in, et cetera. - Yeah and then you need a, so I think that there's just a constant need for innovation of new things like this. And I think what they're doing is an interesting example of it. But I think what's gonna be challenging is that those things have a time limit and then basically the companies that continue doing well, don't just do one, but basically are able to kind of build a bunch or implement a bunch. So I think that'll be an interesting thing to see. But I think what they're onto is certainly interesting. The other direction that I think is, we're also seeing more and more is just the professionalization. And that's, basically, I mean the other way to talk about this is the creator economy, which is I mean creators, like a lot of them really look at it this as it can be very business focused, right? You're trying to create content that you think is awesome and connect with an audience that you care about and express your values. So it's not cold, and it's kind of this important thing. But at the end of the day, a lot of the creators also care about where am I actually gonna be able to most effectively reach the people in my community? Where am I gonna get the most engagement and kind of have the highest quality engagement? And then ultimately, how am I gonna be able to support myself and make a good living doing this? And I think as those tools get built up more, the kind of professionalization and the creator economy around social media is growing to be a bigger and bigger part of what social media is. And that obviously has a pretty big flywheel with the discovery engine too, because without a creator economy that is robust, you don't have a lot of content to recommend. So you kind of need that kind of base of good content in order to kind of have the discovery engine go well too. - Yeah. All right last question, it looks like Elon might actually be buying Twitter after all. Any advice? - Oh. - Do you think Twitter's gonna be better off? I mean this has been such a wild saga and I'm really curious what you make of it. - I don't know. I think it's, this is another one of these things that it's really unclear how it'll actually turn out. Obviously, it's out there and I think it's interesting as a saga like you're saying. But I think even at this point, it's not actually clear what's gonna happen. - All right. Mark, thanks for doing this. - Yeah, happy to. - Thanks. - Is this like your signature look, these fatty microphones? - We don't really have a look. We're just rolling with it, I guess.",
    "transcript_keywords": [
        "people",
        "kind",
        "lot",
        "things",
        "basically",
        "Yeah",
        "thing",
        "time",
        "Quest",
        "content",
        "build",
        "Microsoft",
        "device",
        "feel",
        "make",
        "ecosystem",
        "pretty",
        "reality",
        "year",
        "feed"
    ],
    "transcript_entity_values": [
        "Azure",
        "American",
        "Android",
        "Autodesk",
        "Elon",
        "three",
        "Quest 2",
        "the next year",
        "the last few years",
        "the end of the day",
        "a few years",
        "the other day",
        "CPU",
        "this last week",
        "Quest 1 to Quest 2",
        "tens of millions",
        "Meta",
        "VR",
        "five years from now",
        "2,000",
        "200 million",
        "several hundred",
        "50%",
        "One",
        "hundreds of millions",
        "MSI",
        "Azure Active Directory",
        "TikTok",
        "thousands of dollars",
        "YouTube",
        "Microsoft",
        "80%",
        "D.C.",
        "500",
        "$10 billion",
        "Quest",
        "VR",
        "30",
        "this week",
        "third",
        "the Quest 2",
        "maybe $300, $400",
        "60%",
        "Twitter",
        "the next 10 years",
        "2000",
        "2017",
        "later this decade",
        "Samsung",
        "YouTube",
        "Connect",
        "40%",
        "iOS",
        "eight years",
        "this year",
        "Xbox",
        "China",
        "Redmond",
        "Azure",
        "decades",
        "first",
        "Quest Pro",
        "Instagram",
        "Quest 2",
        "about a year ago",
        "Windows and Mac",
        "a year ago",
        "a ton",
        "Chinese",
        "Twitter",
        "Mark",
        "10",
        "last year",
        "2D",
        "two or three years",
        "Quest 3",
        "AI",
        "Accenture",
        "VR",
        "Androids",
        "US",
        "this decade",
        "12%",
        "Adobe",
        "Intune",
        "Metaverse",
        "VR",
        "the first few months",
        "10 million",
        "Facebook",
        "the Quest Pro 'cause",
        "billions",
        "second",
        "the Quest 2",
        "the next couple of years",
        "PlayStation",
        "all 200 million",
        "the year",
        "1,500",
        "a minute",
        "First",
        "thousands of miles",
        "one",
        "Apple",
        "Quest",
        "iPhones",
        "the next few years",
        "Quest 2",
        "Macintosh",
        "today",
        "the next decade",
        "a decade from now",
        "year",
        "a few years ago",
        "years",
        "the years",
        "a year",
        "Discovery Engine",
        "America",
        "two",
        "Satya Nadella",
        "Workrooms",
        "Sony",
        "3%",
        "iPhone",
        "Metaverse",
        "10 year anniversary"
    ],
    "transcript_entity_types": [
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "LAW",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "LAW",
        "CARDINAL",
        "ORG",
        "FAC",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PERCENT",
        "GPE",
        "MONEY",
        "MONEY",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "MONEY",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "GPE",
        "PERSON",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "EVENT",
        "DATE",
        "ORG",
        "DATE",
        "QUANTITY",
        "NORP",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "ORG",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORG",
        "LAW",
        "CARDINAL",
        "ORDINAL",
        "EVENT",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "MONEY",
        "TIME",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "NORP",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "LOC",
        "DATE"
    ]
}