{
    "id": "gW4uSlUYVdE",
    "title": "AMD Mastered 1080p Gaming With THIS! - AMD Radeon RX 6600 XT",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-08-06T13:38:31Z",
    "video_url": "https://www.youtube.com/watch?v=gW4uSlUYVdE",
    "category": "Science & Technology",
    "tags": [
        "AMD",
        "Radeon",
        "Graphics Card",
        "AMD Radeon RX 6600 XT",
        "RX",
        "6600 XT",
        "Performance",
        "Graphics",
        "1080p",
        "60 FPS",
        "low end",
        "gaming",
        "games",
        "PC",
        "DIY",
        "Copmonents",
        "VGA",
        "GPU",
        "Unboxing",
        "Anthony",
        "Triple fan",
        "RGB",
        "ASROCK",
        "Phantom"
    ],
    "views": 372788,
    "likes": 19187,
    "comments_count": 1464,
    "description": "Start your build at   AMD will be releasing their AMD Radeon RX 6600 XT soon, and while it's not the most powerful card, they have produced. It might be something you can actually buy if everything goes well! Anthony explains in today's video on today's unboxing, sorry, no performance numbers today!  Check out the AMD Radeon RX 6600 XT at   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.buildredux.com/linus",
        "https://lmg.gg/6fman",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- All right, let's use this little piece of foam here. Not that I need to. - [Jono] Doesn't the foam conduct static electricity? Aaah! - What's the resolution of the display you're using right now? (calm music) Is it 1080p, 720, 1440p, 4K, something different? If it's 1080p, then maybe what we're looking at today is for you. This is AMD's latest and, well, not necessarily greatest attempt at cornering that particular market, which is currently, I think, cornered by the GTX 1060. So what does AMD thinks they can do when they can't really make enough GPUs to satisfy existing demand? Well, that's kind of the point, the RX 6800 XT and the 6900 XT, you know, the big boys that are always sold out, those have a die area of over 500 millimeters squared. This has a die area of 234, I wanna say, 234 millimeters squared. That's less than half. And because of that, you can squeeze way more of these dies onto a single wafer. That is huge for supply and hopefully, it'll mean that supply will be better for these cards. Unfortunately, that means that you're kind of stuck with a 1080p class card like this one. So, I mean, it kind of feels like we've been spinning our wheels for the past how many years? How many years has it been? When did 1080p gaming start? It was like Kepler. Wasn't it, like the 600 series? And here we are still doing 1080p. And it's been almost 10 years. Anyway, the point is, we can do 1080p at faster refresh rates than we ever used to be able to. And that's kind of what AMD is going for here, is 1080p max quality at higher refresh rates, or at least that's kind of their, I don't know, their overarching theme. I'm guessing, I haven't really put this on the bench yet, I did unbox it earlier, sorry. But I'm guessing that it'll be able to do probably around, well, minimum 60, I'm hoping, for any game that I throw at it, but probably closer to 100 or so. So yeah, maybe it will be a pretty good addition to the armory for any, you know, gamer that wants a graphics card. So this particular model is ASRock's Phantom Gaming D edition. - [Jono] Wait, did you say Phantom Gaming D? - Yes. - [Jono] Gimme me the D. - Oh my god. Okay, Jono. This video is gonna be weird. I mean, especially since I can't, I can only unbox this today, I can't actually run it. The OC edition part of his card is going to have some interesting implications for the review, it's about five-ish percent faster, I think, than the base clocks. So it's not that much faster, but we'll have to see. Eight gigabytes of memory, that's actually also pretty important for availability, we talked about this a little bit in the announcement video, but the eight gigabytes of VRAM is actually pretty important, it's GDDR6, but it's using 16 gigabit chips. And that means that they're not competing with Nvidia, at least not directly, for supply, because Nvidia uses eight gigabit chips. They are competing with the consoles, so that's a thing. But honestly, I feel like the consoles probably have a similar allocation, they can probably take whatever they want because it's AMD, they have ultimate control over the consoles' chips. So maybe it'll be fine. There's not much else going on in the box here, I mean, it's telling us all about the product specifications, which is common across most of the RX 6000 series. So we've got three DisplayPort 1.4 ports with Display Stream Compression, HDMI 2.1 with Variable Refresh Rate, we've got RDNA 2 architecture, of course, DirectX 12 Ultimate, of course. Seven nanometer, yay. PCI Express 4.0, I mean, that's been a thing since the 5000 series, like none of this is really mind blowing or anything like that. You've got your Radeon Image Sharpening, you've got your Radeon Anti-Lag, you've got Radeon Software, which may or may not be a good thing depending on who you are. Actually, it's got more features now that I think it ever has. And it may have more niche features than NVIDIA's GeForce Experience does, although the hardware encoder is still not so good in my opinion. That, apparently, is not a universal opinion, so take that for what it is. Anyway, let's get this out of the box and see what it actually looks like. Thanks to Build Redux for sponsoring today's video. Redux builds PCs for gamers that deliver high frame rates without breaking the bank. You pay the same price as if you built it yourself plus a $75 build fee. Through their online builder, you can select your budget, pick your games, see how they perform, then let them build your PC. All builds come with a two year warranty even if the parts don't. Click the link in the description and start building your PC today. - Good old box in a box. That's it. - [Jono] Oh really? - That's all that's in the box. - [Jono] Oh, interesting. - Yep. Pro tip for those of you playing along at home who want to do your own kind of unboxing experiences, don't talk over this. (package rustling) It makes it kind of difficult for people to understand what you're saying. All right, let's use this little piece of foam here. Not that I need to. - [Jono] Doesn't the foam conduct static electricity? Aaah! - So this is the card. It's actually a lot beefier than I expected, I like, I saw this big chonker of a box here and I'm like, that's a giant box for a tiny card, huh? 'Cause I figured like, it'll be like a single slot, like one fan kind of thing. But no, this is ASRock we're talking about, so their Phantom Gaming D card has three fans and just as many heat pipes. I know because I already looked at it. Yeah, it's pretty substantial. I'm actually kind of surprised. Is this part of our contract with dbrand, do we have to show this off every time? - [Jono] No, I just like it. - All right, let's see how heavy this thing is. Almost two pounds. For those of us in the rest of the world, that is about 905 grams. Like I said, it's pretty substantial, for a 1080p card, at least. There are heavier cards, of course, like the RX 6900 XT and the 3090, but this is pretty beefy, although one thing I've noticed. The backplate is really kind of thin and there's not really much that's touching it. Like I think there's a heat, there's like a thermal pad in here where the GPU is. But that's about it. And the thermal pad is thick because this thing is like, you can see through there, it's offset quite a bit from the cooler and from the card even. You can see right through it. So I think it's mostly for aesthetics, but there, I think there is actually a thermal pad right here. I don't know, we'll have to see how that works out. The bulk of the cooling is gonna be this double stack tower thing that they've got going on here. Like the card itself ends right here. Like the rest of this, this rest of this is just cooler. Like they could probably have gotten away with just that if it was not a factory overclocked card. - [Jono] Oh man, that's a clear fan in the middle? - Oh yeah. That fan lights up. - [Jono] Wha? - It's RGB. - [Jono] Dayum. - That's part of the Phantom Gaming D. See? See, on the back here. Right there, you get the D. Zero decibel silent cooling, striped axial fan. Yeah, I guess that's what it is. Stylish metal backplate. I mean, at least, okay, they do say, okay. So they say that the stylish metal backplate makes the graphics card fancy, cool, and solid. So depending on what your definition of cool is, this actually does work. - [Jono] Does it say fancy? - Yes. (Jono laughs) It literally says fancy right there. And they've got their polychrome sync, which is addressable RGB, so you can actually have, I'm pretty sure there's like at least four, maybe five dedicated RGB zones for that fan. So yeah, make your fancy graphics card even fancier. Just strike your fancy. - [Jono] How come we couldn't get a founder's, oh, never mind- - Yeah, there isn't a reference card this time around, this is actually all you get. There is a reference board design and I'm kind of disappointed that they didn't give us one for review because that means we can't give anyone a baseline for performance for this thing. But they say, oh, well, you know, most of the cards that are gonna be released are gonna be overclocked anyway, so we wanna give something representative of the market. So I can kind of see that, but I kind of feel like they wanna make the numbers seem a little higher than they really should be. We'll see how that goes. Anyway, I can't take this thing apart because it's under embargo still. All I can do is show it to you, I can't prove that it's like smaller than a 6900 XT's GPU, although I think, I'm not sure if we have an aftermarket 6900 XT, but this pattern seems kind of small. You might think, well, oh, let's just take off this backplate with these few screws here. No. There are actually screws going the other way on the other side that you have to take off the heatsink to get at. Why? I don't know. I'm not mad. It's not that it's difficult to take apart. I could take it apart. But I don't want that you take it apart until it's time to actually take it apart after the review, after I got all the performance numbers that I need, I don't wanna mess with the stock thermals of this thing. I figured, you know, I could take the backplate off and see if that was a thermal pad and if it was, and that's no big deal. If it wasn't, then it's even less of a big deal. But no, I can't really do anything like that because, well, I need to get performance numbers. It's a difficult launch to sum up as it is right now, especially without any performance data. Would I recommend getting this card? I don't know. I don't know yet. However, I do know that it should at least help a little bit with supply. You might not think it because you're like, well, why don't they just keep producing 6700 XTs and 6800 XTs? But the smaller dye does make a difference. Many, many more of these can be produced per wafer than any of those other cards. Hopefully, if you've been waiting for a GPU and like maybe your 1060 is dying and you need something to go to, but there's nothing, maybe this is what you're gonna go for. As for pricing, AMD says 379. That's for the reference, reference, there's no reference, but that's for like the stock version of the card. But of course, that's where the price starts. This thing, if I had to look into a crystal ball and tell you what the price of it is, I don't actually know yet, I would say it's probably gonna be 429 just based on the fact that it is overbuilt and overclocked. But you never know, I might be completely wrong, it might be 399, it might be 419, might be 409, might be $500. So thanks for watching and make sure you get subscribed to see more like or unlike this in ShortCircuit, we do all kinds of stuff.",
    "transcript_keywords": [
        "card",
        "kind",
        "Phantom Gaming",
        "thing",
        "AMD",
        "gaming",
        "box",
        "pretty",
        "yeah",
        "cards",
        "Phantom",
        "graphics card",
        "make",
        "fan",
        "backplate",
        "fancy",
        "reference",
        "thermal pad",
        "Radeon",
        "ASRock Phantom Gaming"
    ],
    "transcript_entity_values": [
        "Phantom Gaming D edition",
        "6900 XT",
        "500",
        "PCI Express 4.0",
        "GeForce",
        "GTX",
        "Radeon Image Sharpening",
        "three",
        "1.4",
        "ASRock",
        "409",
        "60",
        "Kepler",
        "4",
        "1060",
        "one",
        "399",
        "NVIDIA",
        "about five",
        "less than half",
        "5000",
        "about 905 grams",
        "almost 10 years",
        "Phantom Gaming",
        "720",
        "100",
        "3090",
        "6700",
        "379",
        "the eight gigabytes",
        "429",
        "Eight gigabytes",
        "6900",
        "600",
        "Almost two pounds",
        "max",
        "234",
        "over 500 millimeters",
        "Jono",
        "Build Redux",
        "DisplayPort",
        "AMD",
        "at least four",
        "AMD",
        "Nvidia",
        "16",
        "234 millimeters",
        "two year",
        "1080p",
        "RX 6800 XT",
        "Seven nanometer",
        "Radeon Software",
        "XT",
        "6800",
        "GPU",
        "419",
        "Display Stream Compression",
        "GDDR6",
        "12",
        "RGB",
        "75",
        "ShortCircuit",
        "2.1",
        "five",
        "2",
        "eight",
        "today",
        "Radeon Anti-Lag"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "FAC",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT"
    ]
}