{
    "id": "Gwc8nPJ-Q18",
    "title": "Apple iPad 10.2-inch 2019 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-10T22:03:27Z",
    "video_url": "https://www.youtube.com/watch?v=Gwc8nPJ-Q18",
    "category": "Science & Technology",
    "tags": [
        "new ipad",
        "apple ipad",
        "ipad",
        "apple",
        "2019 ipad",
        "2019",
        "apple pencil",
        "10.2 inch ipad",
        "bezel",
        "Touch ID",
        "ipad pro",
        "tablet",
        "iphone 11",
        "iphone 11r",
        "11r",
        "11 pro max",
        "apple watch 2019",
        "watch 2019",
        "watchos",
        "price",
        "release date",
        "sleep tracking",
        "heart monitor",
        "new phone",
        "apple phone",
        "apple update",
        "apple rumors",
        "apple leaks",
        "hands on",
        "first look",
        "supercut",
        "the verge",
        "verge",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "google",
        "microsoft"
    ],
    "views": 405224,
    "likes": 3955,
    "comments_count": 361,
    "description": "Apples new 10.2-inch iPad was announced today at the annual iPhone event, replacing last years entry-level 9.7-inch iPad. It adds support for the first-generation Apple Pencil (the one with the fiddly cap and silly charging), the Smart Keyboard case, and an A10 processor.  Read more about the new iPad:  Top event announcements:  iPhone 11 Pro and 11 Pro Max hands-on:  Watch Series 5 hands-on:  iPhone 11 hands-on:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2k8B7WY",
        "http://bit.ly/2lKAeEv",
        "http://bit.ly/2lP1TE8",
        "http://bit.ly/2lIt7wm",
        "http://bit.ly/2kDQzL2",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- This is Apple's seventh generation iPad. It's an update to the entry-level 9.7 inch iPad that's so familiar. Big changes here. A new 10.2 inch display, support for the first generation Apple Pencil, and a keyboard connector for the Smart Keyboard case that Apple makes for its other iPads as well. The way I'm thinking about this is it's all of Apple's best stuff from years past packed into a very familiar case for just $329. So you've still got a Lightning port. You've got a Touch ID, home button. You've got the first generation Pencil, the silly charging and the fiddly cap, and you've got Apple's older Smart Keyboard case, not the new flippy one that comes with the iPad Pro. You've got an A10 Fusion processor instead of the newer A13X in the iPad Pro. A lot of older stuff from the Apple catalog, but stuff that reviewed really well at the time and for $329 it's a lot of bang for the buck. You can pre-order the new seventh generation iPad today. They'll start shipping at the end of September. So there's a lot of iPads now. The iPad mini starts at $399. This 10.2 inch iPad is $329. The iPad Air is $499 and the iPad Pro starts at $799. That is a huge spread of price points. You can kinda see what Apple's doing. Wherever you are, however much money you have to spend, there's an iPad for you. This iPad in particular seems very targeted at somebody who might buy a Chromebook or a cheap Windows laptop instead. You get the full set of iPad apps, the whole ecosystem. You get the Pencil support. You get things like Apple Arcade, which let's you play an enormous amount of games for $4.99 a month. That's stuff Chromebook can't do. It's a pretty big, aggressive move from Apple. Again, some older specs but compared to those cheap Chromebooks or a cheap Windows laptop, it seems like a very interesting product. We have to review everything. We're gonna do that. We're gonna come back and let you know.",
    "transcript_keywords": [
        "Apple",
        "iPad",
        "Smart Keyboard case",
        "generation Apple Pencil",
        "iPad Pro",
        "Smart Keyboard",
        "Apple older Smart",
        "Apple Pencil",
        "Keyboard case",
        "older Smart Keyboard",
        "Pro",
        "Pencil",
        "seventh generation iPad",
        "keyboard",
        "generation",
        "Apple seventh generation",
        "generation iPad",
        "inch iPad",
        "generation Apple",
        "iPad Pro starts"
    ],
    "transcript_entity_values": [
        "A13X",
        "Apple",
        "499",
        "The iPad Air",
        "Chromebook",
        "seventh",
        "Apple Arcade",
        "just $329",
        "today",
        "399",
        "10.2 inch",
        "the iPad Pro",
        "Smart Keyboard",
        "iPads",
        "Pencil",
        "years",
        "iPad",
        "the end of September",
        "iPads",
        "9.7 inch",
        "329",
        "A10 Fusion",
        "Apple Pencil",
        "first",
        "799",
        "4.99"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "MONEY",
        "DATE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "MONEY",
        "MONEY"
    ]
}