{
    "id": "GwL-COqlauA",
    "title": "Galaxy Buds Live review: good beans, no compromises",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-08-12T13:30:01Z",
    "video_url": "https://www.youtube.com/watch?v=GwL-COqlauA",
    "category": "Science & Technology",
    "tags": [
        "galaxy buds live",
        "samsung galaxy buds live",
        "samsung galaxy",
        "galaxy buds",
        "buds",
        "buds live",
        "galaxy buds live review",
        "galaxy buds review",
        "samsung galaxy review",
        "review",
        "compromises",
        "samsung",
        "galaxy",
        "mic test",
        "audio quality",
        "price",
        "specs",
        "features",
        "AirPods",
        "AirPods pro",
        "apple AirPods",
        "samsung galaxy buds",
        "sounds quality",
        "active noise cancellation",
        "noise cancellation",
        "bixby",
        "wireless earbuds",
        "earbuds",
        "headphones",
        "becca farsace",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "verge",
        "the verge"
    ],
    "views": 518757,
    "likes": 15545,
    "comments_count": 1088,
    "description": "The Galaxy Buds Live are Samsungs latest true wireless earbuds and for $169.99 the Buds Live have a style all their own, well actually they share it with a damn kidney bean. But bean jokes aside, although these wireless earbuds come in a unique shape, they retain the solid hardware and audio quality we have come to expect from the galaxy line.   Read the full review:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Order the Galaxy Buds Live on Amazon:   Listen to Beccas playlist here: YouTube Music   Spotify    Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3izyUfK",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/342CVFN",
        "https://bit.ly/3iAbfvS",
        "https://spoti.fi/3gQMTNX",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- So when I told a few buds that I was reviewing the beans, they were really excited for me because if you know me, you know that I love the word bean and I love the word buds and well buds, these are beans. - Roll that beautiful bean footage. (upbeat music) - Nice pot of pinto beans in the crock pot. (upbeat music continues) - Could everybody please leave so I can eat my beans? (upbeat music continues) - It's rare in tech to get such a fresh form factor these days. Most phones are skinny rectangles, earbuds are stemmed or they're circles and laptops are well laptops. So when I opened up the poorly named Galaxy Buds Live, it was a total breath of fresh air. And with any first gen form factor, I was excited for the new experience, but I was definitely expecting some compromises. Like maybe the audio quality was going to be a bit off or the build quality would be weird or the mic would be scratchy. But these beat, buds, these buds, they managed to be something completely new without compromises. Let's get into it. (upbeat music) Buds come in mystic bronze, mystic white, or mystic black, but Samsung gave me the bronze to test out. And to be honest, I don't think this bronze is doing these buds any favors in that these are not beans, these are buds department. This is almost the exact color of a kidney bean. Oka, besides my love of this hardware, there was one feature I was shocked to hear these $169 buds had, and that was active noise cancellation or ANC. So I knew one place I was definitely going to test them out. So we're on our way to the Brooklyn Heights Promenade because it is a beautiful location to film, especially at sunset. Oh, here she is. But it also has one fatal flaw that makes it perfect for testing this active noise cancellation. The promenade is located directly above a double-decker highway. So although beautiful, it is not quiet. (highway noise) The Buds Live have what Samsung is calling open type active noise cancellation and open it definitely is. The Buds Live were able to cancel the lowest level hum out of the city but I'm sad to report that they did very little in canceling pretty much any other background noise, especially the saxophone that was being played a few benches down. The Galaxy Buds Plus do more in canceling out background noise simply by their in-ear design. And then the AirPod Pros take that a step further with their in-ear design and true active noise cancellation. So if you're looking to really block out the world around you in a bud, well, don't look to the Buds Live. (upbeat music) The Buds themselves are glossy on the outside and matte on the part that sits inside your ear. They sit in a clamshell case and when I saw the renderings of the case, I thought for sure it would be huge much like the clamshell case of the Powerbeats Pro. But now this is surprisingly small and it's easily pocket-able. It's about one and a half times wider than the AirPods case and it's a little bit lighter than the Pixel Buds case. Now the hinge on the case is stiff and that's probably a good thing because the buds, while they do have a bit of a cradle, it's not very deep. And yes, there are magnets that hold them in, but they're not the strongest magnets in the world. (Becca gasps) Dropping buds is a very scary experience. Case charges wirelessly or via USB-C port round back and it holds 21 hours of music playback while each bud can last for around six hours with ANC audio turned on. For context, the AirPod Pros with ANC turned on last about 4.5 hours. A five minute quick charge in the case, will get you an hour of listening time back though. In case you missed the Samsung Unpacked event last week, which was so beautiful in its own way, there was this moment. (dramatic sound) - Wow. There it is. The Galaxy Note 20. - Okay, that has nothing to do with this video, but I just love that so much. But then there was also this moment. - We compared Buds Live with the pair of wireless earphones from another company. - Can you hear me? Can you hear me? - Wait, did Samsung just do a mic test? You love to see it. But also you hate to see that they don't tell you who the competitors were. So let's get to the kitchen. So going head to head today are the AirPods, the Pixel Buds, the Galaxy Buds Plus, and the Galaxy Buds Live. So the Pixel Buds, I love having the Google assistant always listening and ready because in my home I use it all the time. But I must admit the dropouts are real. And moving on, we have the Galaxy Buds Plus and in the second generation of these buds, the microphone got so much better. And here are the AirPods with that nice long stem and typically very good mic quality. Here are the Galaxy Bud Live and I'm going to run the water, but I'm going to save the water this time because I'm actually in the most Brooklyn way, watching all of my friends' plants at the moment. Water time! Oh man, I'm going to fill up so many pitchers of water I just realized. I'm going to the top of this pitcher. I only have so many pitchers in this house. Okay, I truly underestimated how much water I was going to be using. Wow. Okay. Can you hear me? How does this sound? Oh my god, the Chemex, we'll fill the Chemex. There we go. All right. So the Galaxy Bud Live. How does these sound? Is it all right? Okay, that was actually super interesting because although the Galaxy Buds Live sound a little bit more mechanic or robotic, when there wasn't background noise. When there was background noise, it like completely canceled it out. Like that last clip, the water was running and you couldn't hear it at all. Whereas in the AirPod sound maybe a little bit more natural and they kept a little bit of the water sound in. It didn't, it didn't mean that you couldn't hear me, but you could hear the water running, but that might just be our closest competition yet. Please sound off down below. Which one do you think was the best? So audio quality on these buds, it's really good dudes. I most closely compared them to the AirPods 'cause they have that same open ear design and it was hard to tell a difference. The buds themselves have 12 millimeter drivers and overall it's just a really full sound. Now the bass isn't bumping, but in the wearable apps, I always go in there and I turn on bass boost, which actually helps a lot. Past Bec is going to tell you about hardware while I go dance a little bit more. The shape is weird and it's definitely the most exciting part about them. In my ears it fits really well with the small wingtip on, and there's also a large size tip included in the box. The lack of an AirPod-like stem allows me to wear these buds without them getting caught on like my bike helmet strap, or while taking off a sweatshirt. And you almost can't even see them sitting in my ears when you look at me head on. The Bluetooth connection on these buds is also really strong. I almost always leave my S10 up here on a wireless charger and I could move freely throughout my house without losing connection. And within my week of testing and using it mostly with my S10 and my MacBook Pro, I only lost connection once while I was on a call. I also tested it with an iPhone 11 Pro and a Pixel 4A and it worked well with those two. There's no noticeable lag when playing games or watching YouTube. And there's one more feature that's new to these buds, which is a hand-free Bixby option. It works. Yeah, it listens. It hears me. It responds. How well it responds, well. Bixby is Bixby. So it responds as well as Bixby can respond. (upbeat music) So the Galaxy Buds Live. They're $169 beans with great audio quality, a solid mic, all packed into a surprisingly functional small form factor. But I love when tech gets new and fresh and like exciting again and low key weird. Like I'll never forget being in Barcelona for MWC 2019 and filming this shot of Huawei's Mate X. We were in the basement of some random hotel and they brought out the Mate X and they unfolded it. And, oh my gosh, the excitement in that room. And sadly in tech, we just don't get that experience much anymore. So when this crazy bean looking earbud was released, it felt like that breath of fresh air to me. It felt like I was finally going to test out something new. And as new as these may look, what's actually exciting about them, is that it didn't lose sight of the fundamentals, like audio quality, a solid mic, Bluetooth connection. And that, that makes them a pretty good bean. You ever just like, forget to roll audio? Has that ever happened to you? For that I would say like once a year it happens and every time it does, it's incredibly disappointing. Anyway, my name is Becca Farsace, thank you for watching. I'm going to go re-record this whole thing. (Becca laughs)",
    "transcript_keywords": [
        "Galaxy Buds Live",
        "Buds Live",
        "buds",
        "Galaxy Buds",
        "Bud Live",
        "Pixel Buds",
        "Galaxy",
        "Live",
        "Buds Live sound",
        "word buds",
        "Pixel Buds case",
        "named Galaxy Buds",
        "compared Buds Live",
        "bud",
        "case",
        "noise",
        "water",
        "beans",
        "hear",
        "word bean"
    ],
    "transcript_entity_values": [
        "the Galaxy Buds Live",
        "ANC",
        "Past Bec",
        "one",
        "The Buds Live",
        "the Galaxy Buds",
        "Becca Farsace",
        "the Galaxy Bud Live",
        "Bixby",
        "S10",
        "USB",
        "169",
        "today",
        "last about 4.5 hours",
        "the Galaxy Buds Live",
        "Galaxy Buds Live",
        "the Galaxy Buds Plus",
        "Google",
        "Chemex",
        "The Galaxy Buds Plus",
        "12 millimeter",
        "Becca",
        "Barcelona",
        "Bixby",
        "Oka",
        "Buds Live",
        "Samsung",
        "21 hours",
        "the Buds Live",
        "AirPod",
        "YouTube",
        "two",
        "AirPods",
        "an hour",
        "Buds",
        "2019",
        "Brooklyn",
        "last week",
        "these days",
        "second",
        "the Powerbeats Pro",
        "my MacBook Pro",
        "my week",
        "MWC",
        "first",
        "the Brooklyn Heights Promenade",
        "five minute",
        "Huawei",
        "the Galaxy Bud Live",
        "around six hours",
        "about one and a half"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "FAC",
        "GPE",
        "PRODUCT",
        "ORG",
        "MONEY",
        "DATE",
        "TIME",
        "FAC",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "ORG",
        "DATE",
        "GPE",
        "DATE",
        "DATE",
        "ORDINAL",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "FAC",
        "TIME",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL"
    ]
}