{
    "id": "Gy9I_eYzXDs",
    "title": "Why Netflix canceled your favorite show",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2019-09-12T14:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=Gy9I_eYzXDs",
    "category": "Science & Technology",
    "tags": [
        "netflix",
        "netflix shows",
        "netflix series",
        "tuca and bertie",
        "oa",
        "the oa",
        "grace and frankie",
        "orange is the new black",
        "elite",
        "drama",
        "stranger things",
        "oitnb",
        "house of cards",
        "television",
        "streaming",
        "streaming service",
        "trailer",
        "watch movies",
        "stranger things season 3",
        "seasons",
        "millie bobby brown",
        "netflix 2019",
        "2019",
        "eleven",
        "movies",
        "hasan minhaj",
        "patriot act",
        "witcher netflix",
        "witcher",
        "elite netflix",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "verge",
        "the verge"
    ],
    "views": 154929,
    "likes": 4279,
    "comments_count": 509,
    "description": "Netflix was never considered a traditional TV service. Canceling shows that arent performing well is an understood and necessary part of being a TV network, but Netflix has started canceling shows faster than ever before. Whereas older Netflix originals like House of Cards, Unbreakable Kimmy Schmidt, Grace and Frankie, and Orange is the New Black were given five or six seasons, beloved newcomers like The OA and Tuca and Bertie dont have the same opportunities. The company is still invested in original series, but expect to see more international shows and titles from big showrunners.   Read more:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   Why'd You Push That Button Podcast:  The Vergecast Podcast:  More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://bit.ly/2kJxAyL",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/1295289748",
        "https://pod.link/430333725",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Like a third season of a Netflix show. - There's a good chance that one of your favorite shows on Netflix is already canceled. Netflix is facing a series of issues that they didn't face even five years ago. They've got looming competition from some of the biggest players in entertainment today. They also just announced that they lost subscribers in the United States for the first time in nearly a decade. And because of all this Netflix has to do something that it really didn't have to up until now, start acting like a cable network and cancel shows. Remember when Netflix was like super exciting? Every show that came out felt like a blockbuster release because everything about it felt really cool and unique. Netflix came in and essentially Beyonced the heck, can I say hell? Beyonced the hell out of TV by dropping entire seasons at once. This is something that only a network on the internet could do, no one else could. By 2015, Netflix was like this hotbed for creators. Everyone wanted to work with them 'cause Netflix was doing some cool things. - Orange is the New Black. - Orange is the New Black, House of Cards, and even Unbreakable Kimmy Schmidt were being nominated for and winning Emmy's. The company's content budget grew every single year, which let them take chances on weirder projects. The Wachowski sisters, best known for The Matrix, had a Sci-Fi series, which reportedly cost Netflix nearly nine million dollars an episode. That's on par with some of Game of Thrones episodes. Netflix had one major advantage, it was the only player in the game. Most importantly, if Netflix was winning Emmy's, it proved to everyone, including major networks with ABC and CBS, and also prestige networks like HBO, that internet TV was actually a thing people should pay attention to. But that's simply not good enough anymore. By 2020, Netflix is gonna have major competition from some of the biggest companies in the world. Apple, Disney, Comcast, NBC Universal, and AT&T's Warner Media are all launching streaming services. And in order for them to compete with Netflix, they're removing their own content from Netflix, meaning if you wanna watch Friends, you have to go to HBO Max, Warner Media's streaming service, in order to do it. - I can't even begin to explain to you how much I am gonna miss you. - With less licensed shows, Netflix has to invest in more original content in order to keep subscribers. Netflix relies on something called the efficiency metric. Basically, Netflix puts more of an emphasis on shows that can bring in new subscribers or keep those who are at risk of canceling. That makes it harder to justify renewing a series. How many people are gonna subscribe to Netflix for a third season of the OA if not many people watched the first two seasons? The way executives see it that money would probably be better spent on a new series, particularly in an emerging market that's not the United States. Basically, the United States is over saturated. Everyone in the U.S. who's going to have Netflix probably already does. But there are huge markets in East Asia or South America that are clamoring to sign up for the service. That might explain why you're also seeing more Bollywood films or South American soap operas on your service. But Netflix's investment in other series doesn't stop fans from hurting when their favorite show gets canceled. Take Tuca & Bertie. That show is critically adored and had a dedicated fan base, but unfortunately it just wasn't big enough. Creator Lisa Hanawalt even tweeted that it just didn't have the sizeable viewership it needed for Netflix to renew it. What's interesting and unique to Netflix is that Hanawalt blamed the algorhithim. It's unclear just how many people were actually served the show on their homepage. Unlike traditional cable, which slots shows into one specific spot every week, Netflix is more like YouTube. There are so many shows, movies and specials that Netflix relies on a recommendation algorhithim to try and pair viewers with things they'd be interest in. It doesn't always work. It's not like Netflix isn't interested in investing in creators or original shows, it's just about to get much more focused. The company's investing hundreds of millions of dollars into specific creators that they think can deliver guaranteed hits. You've got David Benioff and D. B. Weiss, who created Game of Thrones, coming to Netflix for $250 million. Ryan Murphy, the creator of American Horror Story, he's coming over for $300 million. And Shonda Rimes, the creator of Grey's Anatomy, one of my favorite shows, is coming over for $150 million. So it's not all bad news. Netflix still needs new shows and is clearly still willing to pay for them. There's a good chance that weird niche TV is still going to wind up on Netflix, it's just that based on everything we're reading and seeing, it's likely that it's gonna come from someone like J.J. Abrams. There are still shows that can make the case for renewal past the third season, but those are increasingly becoming the exception to the rule. One of those shows is Stranger Things, which third season saw more than 40 million people watch it in just four days.",
    "transcript_keywords": [
        "Netflix",
        "shows",
        "United States",
        "show",
        "Netflix relies",
        "Warner Media",
        "series",
        "million",
        "people",
        "United",
        "States",
        "Netflix show",
        "season",
        "Game",
        "things",
        "Game of Thrones",
        "Unbreakable Kimmy Schmidt",
        "Black",
        "service",
        "winning Emmy"
    ],
    "transcript_entity_values": [
        "HBO",
        "2015",
        "entire seasons",
        "HBO Max",
        "one",
        "third",
        "Warner Media",
        "Apple",
        "AT&T",
        "OA",
        "Comcast",
        "$250 million",
        "$150 million",
        "Unbreakable Kimmy Schmidt",
        "today",
        "Hanawalt",
        "Tuca & Bertie",
        "more than 40 million",
        "just four days",
        "five years ago",
        "David Benioff",
        "Ryan Murphy",
        "CBS",
        "Disney",
        "South America",
        "NBC Universal",
        "Warner Media's",
        "2020",
        "D. B. Weiss",
        "the first two seasons",
        "nearly a decade",
        "ABC",
        "every week",
        "the New Black",
        "the United States",
        "YouTube",
        "every single year",
        "American Horror Story",
        "$300 million",
        "One",
        "Sci-Fi",
        "The Matrix",
        "Emmy",
        "Stranger Things",
        "Grey's Anatomy",
        "Game of Thrones",
        "Shonda Rimes",
        "Netflix",
        "nearly nine million dollars",
        "first",
        "a third season",
        "East Asia",
        "J.J. Abrams",
        "Wachowski",
        "Lisa Hanawalt",
        "hundreds of millions of dollars",
        "U.S.",
        "South American",
        "Game of Thrones"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "GPE",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "LOC",
        "GPE",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "MONEY",
        "ORDINAL",
        "DATE",
        "LOC",
        "PERSON",
        "PERSON",
        "PERSON",
        "MONEY",
        "GPE",
        "NORP",
        "WORK_OF_ART"
    ]
}