{
    "id": "Gzp-OML-4lY",
    "title": "💜 New Purple iPhone 12!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-04-22T13:00:07Z",
    "video_url": "https://www.youtube.com/watch?v=Gzp-OML-4lY",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 1500801,
    "likes": 49590,
    "comments_count": 2706,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Look what we've got today, the brand new iPhone 12 in purple. They just announced this at their Spring Loaded event. I'm so excited about this because do you know what my favorite color is, other than pink and black, purple. They did have a purple phone previously. It was the iPhone 11 which we have here and not gonna lie to you. I forgot which phone this was. I was like, was this a 10R? Is this a 10 what? It is the 11, I did in fact confirm with Google. So I'm excited to see what this color looks like in comparison to this one. Oh, Oh, Oh, okay. It's kind of a very similar purple to our other purple friend. It's like a little bit more saturated. Like if you were in Photoshop and you just, you know opened up the saturation and you were just like, \"oop\" that's what you get. Okay, inside the box, we've got the usual suspects. We've got our USB-C to lightning cable and SIM card ejector and a little Apple sticker. And here's our little phone. Here we go. Like a brand new phone. Like there's nothing better than a new iPhone. I liked that the iPhone 12 went back to the squared edges. So you guys can see here on the iPhone 11 the difference between those edges. I like the squared off edges so much more because I do feel like you get a little bit more screen real estate and they were able to kind of make it a little bit thinner. Like this just feels kind of like a little chunky. This feels slim and nice, but I really, really liked this color. Look at that. Look at the difference. This could quite possibly be my shortest YouTube video that I've ever posted. - [Tyler] That phone's like it wants to be purple but it's not like committing to be purple. - You're right. But the thing is this fit in sort of with the theme of all the rest of the colors. Cause they were more of like the lighter pastel colors but this one also kind of fits into the theme of all of the colors that we have now. So we've got the purple, the blue, the green, the product red, white and the black. Actually, I happened to have the green here. Like they kind of just keeping them all on sort of that same color family. Here's the black iPhone 12. You can't even see it on my desk, but it's there. This purple also comes in the iPhone 12 mini which this has been a really fun phone for me. If I'm going on a hike or something, this is always the phone that I take unless I want to have some zoom photos. But if I know I'm just going on a hike just purely for exercise, not to create content, this is the phone that I take. It's just such a small device that it fits in my pocket. And it's almost like I don't even have it there, but I do. So here it is in size comparison, to the 12, it really is significantly smaller. Then let's show you guys what this looks like in comparison to the 12 Pro Max. Like this is such a big phone. So to go from this phone, to this phone when I'm going on a hike or something is significant. Look at you guys. You guys are like a happy little family. So I'd love to know from you guys what do you guys think of the new purple color? I think it's really, really beautiful. I like the fact that it is way more saturated than the previous iPhone 11 color. I hate when your buzz gone. It's like. So this is the purple case that they came out with. I love MagSafe. The MagSafe cases, everything about them are awesome. Let's open this up. I love the color. It matches my body. This was of course, I planned this. I coordinated. Oh yeah, look at that. I like that it's a darker, kind of purple too. So it's a little more contrasty. Hey Tyler, can you see me? - [Tyler] No. - Look what I got. This is the MagSafe duo charger. This has been one of my most favorite little accessories in a really long time. I love that it just folds up just like that. I take this with me pretty much everywhere I go. I haven't been traveling as much as I used to but I did do a three week road trip. And this has been amazing because I take this, I bring my lightening cable charger and I'm set to go charge my phone. Charge my Apple watch. I don't know. It's like, I don't like it like a big like wafer cracker or something that you just, don't do that COVID. Also this has absolutely nothing to do with this video but I just bought this. This is an Aura band and this is something that will allow you to be able to track your body composition. It'll tell you if you're dehydrated and it's kind of just an added little bonus to be able to get more metrics about what's happening with your body. So I'm super excited about this. I just got it. I'll put a link in the description if you want to check it out as well. And I even tested it out on a recent episode of our podcast. If you want to check that out, it's youtube.com/samebrain. I've been enjoying this. And I think one of the most important things, especially in this day of not being able to get into doctor's offices just to be able to kind of monitor your own health. So in case there is something going on you'll be able to have this backlog of data to be able to take to your doctor and be like, look, this is what's normal. This is not normal. Help, something's wrong. Anyway, I do plan on doing a video about this entirely but I kind of want to just test it out a little bit more and I don't know get more data about this, this vessel of mind. Well thank you guys for watching. This was just a quick video. I wanted to show you the new iPhone 12 in the purple with this beautiful new purple case. I love this color. I love the color of the case. And I guess that's the end of the video. If you guys enjoyed this video, or if you want to see some more videos about some cool Apple tech that's coming out, be sure to hit 'subscribe', like this video and leave a comment and let me know what your favorite iPhone 12 color is currently. And I will see you guys in the next one. Buh-bye. (upbeat music)",
    "transcript_keywords": [
        "purple",
        "Spring Loaded event",
        "phone",
        "color",
        "iPhone",
        "Spring Loaded",
        "kind",
        "guys",
        "video",
        "love",
        "Loaded event",
        "colors",
        "bit",
        "Apple",
        "case",
        "purple case",
        "purple color",
        "excited",
        "purple phone",
        "edges"
    ],
    "transcript_entity_values": [
        "iPhone 11",
        "10R",
        "Aura",
        "12",
        "USB-C",
        "Apple",
        "Spring Loaded",
        "iPhone",
        "MagSafe",
        "Pro Max",
        "Buh-bye",
        "Google",
        "iPhone 12",
        "today",
        "Tyler",
        "this day",
        "10",
        "11",
        "three week"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "EVENT",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE"
    ]
}