{
    "id": "h-sqrU18Fjw",
    "title": "The Huawei Mate 9 Is Here To Solve Your Problems",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-11-03T13:30:29Z",
    "video_url": "https://www.youtube.com/watch?v=h-sqrU18Fjw",
    "category": "People & Blogs",
    "tags": [
        "huawei mate 9 hands-on",
        "huawei mate 9 review",
        "huawei mate 9 hands on",
        "huawei mate 9 camera",
        "huawei mate 9 unboxing",
        "mate 9 review",
        "mate 9 hands on",
        "mate 9",
        "huawei mate 9",
        "mate 9 plus",
        "michael fisher",
        "mrmobile",
        "android central",
        "emui 5.0",
        "huawei"
    ],
    "views": 376467,
    "likes": 7029,
    "comments_count": 575,
    "description": "The Huawei Mate 9 is more than just another superphone out of China. Its a smartphone meant to solve three of the biggest problems facing users today: bad battery life, slow performance, and poor camera quality. Join Michael Fisher for a quick look at the Huawei Mate 9!   [SUBSCRIBE]     [ABOUT THIS VIDEO]  MrMobile's Huawei Mate 9 Hands-On was produced following three hours of usage with preproduction Huawei Mate 9 units in Shanghai, China and Boston, MA. This video contains initial impressions only; final conclusions will arrive with the full Huawei Mate 9 review.   [PRODUCTS IN THIS VIDEO]  Huawei Mate 9   [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"You Like It,\" available in YouTube Media Library:    [SOCIALIZE]         [DISCLOSURE]  This video was made possible by a visit to Huawei's corporate campus in Shenzhen and a Kirin 960 briefing in Shanghai, for which Huawei provided travel and lodging expenses.   This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "https://www.youtube.com/audiolibrary/music",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Voiceover] If you're like most Americans, you probably don't know the name Huawei, and you've never heard of smartphones called the Mate Seven or Eight, much less the Mate Nine. But this is more than just another super phone out of China, it's a device meant to solve three of the biggest problems facing smart phones today. I'm Michael Fisher, here with a quick look at the Huawei Mate Nine. Bad battery life, slow software performance, and poor camera quality. Those are the three main problems Huawei set out to solve with the Mate Nine. I'll report on whether it succeeds in my full review, for now I'll just tell you how the phone tries to solve them. First up, battery life. The Mate Nine packs a 4,000 milliamp hour power pack, that's about 30% larger than most of the Android smart phones I've reviewed this year. Plus, the display here is a modest full HD resolution. Now that means it's not as sharp as some of its super high end competitors, but it also means that there are fewer pixels for the processor to drive. While I still would have preferred an ammoled panel over the LCD here, this screen is more than servicable. And if it does allow for increased endurance, then I'm all for it. There's also a new fast charging protocol here called Huawei Supercharge, with the inbox adapter the company claims you can get from zero to 58 percent in a little over half an hour. And in the shadow of Samsung's Note Seven recall, Huawei was sure to tell me several times how safe an cool the charging system is. Next on the check list, slow performance. Every Android phone is pretty quick out of the box these days, but over time performance erosion sets in. The phones slowing down as app junk piles up and weighs down the system. Huawei's mantra with the Mate Nine is \"born fast, remain fast,\" which I like despite its clunkiness. At the heart of the phone is the all new Kirin960 system on a chip, which includes a bunch of speed improvements, but Huawei puts a lot more emphasis on software. The Mate Nine uses machine learning algorithms to essentially figure out how you use your phone over time, and then it uses that information to optimize the performance of your favorite apps. There's also stuff like GPU acceleration and memory compression that Huawei says it does differently than stock Android. It even uses a different file system all together, which explains why the company has stuck with its own user interface. With EMUI5, Huawei thinks it can deliver a better software experience than Google can, especially in terms of keeping the phone speedy as it ages. Now only time will tell when it comes to that, but all I can say today is that the new interface looks pretty nice and gives you the typical Huawei customizations. Knock on the glass for a screen shot, use the fingerprint scanner as a track pad. Put custom buttons in your nav bar. My favorite, you get to keep the traditional Android app drawer if you want. And yes, I want. Finally, there's the camera, which has been completely reworked since the last Mate. We've now got a recommended two camera system featuring a 12 megapixel color sensor and a 20 megapixel monochrome shooter. The spec sheet says the color camera is optically stabilized, but there's a lot of questions I still have on that and also where the second camera factors in is alien to me, I didn't get to use the Huawei P9, so this is uncharted territory for Mr. Mobile. And a little worried about the F2.2 aperture, it's not the largest around, so image quality in low light is an open question. On the other hand there's plenty of toys to play with in the view finder here, so we'll just have to see how this performs out in the real world. The rest of my impressions span the spectrum. Nice surprises like an IR transmitter, and old favorites like a headphone jack, and \"meh\" moments, like boring bottom firing speakers. And as for how it feels, it feels like a Mate Eight, or a Mate Seven, or a smoother Nexxus 6P. In other words, it's a big yet thin aluminum phone. Huawei isn't exactly reinventing the wheel here. The interesting question to me is whether it manages to fix those three big problems it sets out to fix, and when it will be made available in North America. Stay tuned to Mr. Mobile and Android central for the answers to those questions, which we hope to come very soon. In the mean time, check out my other big phone reviews, and be sure to subscribe on YouTube so you don't miss more mobile tech media from Mr. Mobile. Until next time, thanks for watching, and stay mobile my friends.",
    "transcript_keywords": [
        "Mate",
        "Huawei",
        "Huawei Mate",
        "phone",
        "heard of smartphones",
        "Android",
        "problems Huawei set",
        "Android smart phones",
        "Americans",
        "called Huawei Supercharge",
        "Mobile",
        "Michael Fisher",
        "time",
        "main problems Huawei",
        "system",
        "problems Huawei",
        "Huawei Supercharge",
        "camera",
        "smart phones",
        "Android phone"
    ],
    "transcript_entity_values": [
        "Huawei",
        "GPU",
        "First",
        "IR",
        "4,000 milliamp hour",
        "about 30%",
        "Seven",
        "Michael Fisher",
        "58 percent",
        "inbox",
        "20 megapixel",
        "Nine",
        "Samsung",
        "12 megapixel",
        "YouTube",
        "three",
        "China",
        "Mobile",
        "this year",
        "today",
        "Eight",
        "jack",
        "these days",
        "Google",
        "Nexxus",
        "North America",
        "two",
        "EMUI5",
        "zero",
        "second",
        "a little over half an hour",
        "Americans",
        "LCD",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "GPE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "LOC",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG"
    ]
}