{
    "id": "H1N1x9kt-pY",
    "title": "CML 2.0 is here! Quick Start Guide.",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2020-05-12T16:07:15Z",
    "video_url": "https://www.youtube.com/watch?v=H1N1x9kt-pY",
    "category": "Science & Technology",
    "tags": [
        "cml",
        "cml-p",
        "cml-e",
        "cisco modeling labs",
        "cisco modeling labs 2.0",
        "virl",
        "virl 2",
        "cisco virl",
        "cisco virl 2",
        "ccna",
        "ccnp",
        "virl ios",
        "virl gns3",
        "gns3 virl",
        "eve-ng",
        "eve-ng virl",
        "ios download",
        "cisco ios download",
        "cisco virl images",
        "virl cisco",
        "virl images",
        "download virl",
        "gns3 virl ios",
        "cisco ios",
        "gns3",
        "cisco virl ios download",
        "gns3 vs virl",
        "ios virl",
        "cisco virl ios",
        "download cisco virl",
        "cisco ccna",
        "virl windows 10",
        "virl install",
        "cisco labs",
        "virl2",
        "cml windows",
        "cisco cml",
        "cmlp"
    ],
    "views": 51591,
    "likes": 1011,
    "comments_count": 285,
    "description": "Cisco have released Cisco Modeling Labs - Personal (CML-P) today. In this video I show you how to get CML running on a Windows 10 computer and create Cisco topologies.   I'll cover all the steps in this video: 1) How to download CML 2) How to download and install VMware Player (free hypervisor software) 3) How to import CML and properly configure VMware Player settings 4) How to configure CML initial settings such as usernames and IP addresses 5) How to access the CML server using the CLI and Web UI 6) How to license the CML server 7) How to build a Cisco topology consisting of Cisco routers and switches  This is a full demonstration showing you how to get CML working on your computer.  Cisco CML-P (VIRL 2) is here: Learn how to download, install and configure Cisco CML-P (VIRL 2) using VMware Player and Windows 10. The new version of Cisco VIRL allows you to create virtual Cisco networks using just your Web browser. You don't have to use a thick client or any other software - everything is included and everything is easy to use.  The new version of Cisco VIRL 2 is one of your best options for CCNA,  CCNP and CCIE Labs. VIRL 2 has multiple advantages over other platforms such as GNS3 or EVE-NG. VIRL 2 supports an HTML5 web client and contains all the Cisco IOS images. You don't have to use a thick client like you do with GNS3. You don't have to follow a convoluted process to get Cisco images working like you do with EVE-NG.   You don't have to try to find images as they are all included as part of your VIRL subscription and by simply mapping an ISO drive to your virtual machine you can immediately start using all Cisco IOS images in your topologies. Both EVE-NG and GNS3 require that you provide your own IOS images - typically they recommend that you buy a VIRL subscription anyway. That means that you are already paying for VIRL.   VIRL2 is also an official Cisco product - that means that you don't have to worry about any gray legal issues with regards to running Cisco IOS images on your laptop. This is an official Cisco product that is supported by Cisco. By paying your yearly subscription fee of $199, you can use Cisco IOS images such as IOSv, IOSvL2, ASAv, NX-OSv and others without any worries. VIRL 2 has everything you need to get started.  Disadvantages include the requirement to license your installation. That however has been simplified dramatically from previous releases. There is also a 20 node limited in topologies. However, for most of us that is fine for a lot of labs.  Is VIRL better than GNS3 or EVE-NG? In many ways it is. But, all platforms have advantages and disadvantages. If you are studying for your ccie, you many prefer gns3 or eve-ng as they don't limit the number of devices in a topology like virl does. VIRL-PE limits you to 20 devices - so your topologies cannot be massive like they could with gns3 or eve ng. However, if you are studying for your ccna or ccnp, VIRL may be more than enough.  Cisco have made massive changes to their certification programs and it is fantastic to see the new version of VIRL in action.   Menu: Overview: 0:00 Documentation: 0:56 Download CML-P: 1:12 Download VMware Workstation Player: 5:38 Install VMware Player: 6:13 Import CML-P into VMware Player: 8:05 Start CML-P: 11:23 CML Initial Setup Wizard: 11:48 Login to CL: 15:04 Login to Web UI: 15:25 License CML: 15:52 Create and test Cisco topology: 16:54  Videos mentioned: VIRL 1 installation:   ====================== Special Offers: ====================== Cisco Press: Up to 50% discount Save every day on Cisco Press learning products! Use discount code BOMBAL during checkout to save 35% on print books (plus free shipping in the U.S.), 45% on eBooks, and 50% on video courses and simulator software. Offer expires December 31, 2020. Shop now.  Link: bit.ly/ciscopress50  Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  GNS3 Academy: CCNA ($10): bit.ly/gns3ccna10 Wireshark ($10): bit.ly/gns3wireshark  DavidBombal.com CCNA ($10):  Wireshark ($9): bit.ly/wireshark9   CML-P CML-E Cisco Modeling Labs Personal VIRL VIRL 2 EVE-NG GNS3 Packet Tracer CCNA Cisco Devnet Associate  CCNP Enterprise CCNP Security CCNP Data Center CCNP Service Provider CCNP Collaboration Cisco Certified Devnet Professional Cisco Certified Network Professional  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #cml #virl2 #devnet",
    "description_links": [
        "https://youtu.be/Ie5GwqtUVc8",
        "http://bit.ly/yt999ccna"
    ],
    "transcript": "- In this video I'm gonna show you how to get CML up and running on a Windows computer. Today 12th of may, 2020, CML personal edition has been released by Cisco. So in this video I'm gonna show you how to download VMware Workstation Player which allows you to run CML on a Windows computer. I'm gonna show you how to download CML, how to do the integration with the ISO, how to make sure that you've set up your VMware settings properly, how to go through the initial configuration of CML, how to boot it up and build a Cisco topology and get it working. The fantastic thing about CML is it's very easy to use, it's got a great interface, I highly recommend that you use CML if you wanna learn Cisco technologies. Okay, enough said, let's get started. (upbeat music) First place if you wanna get information is developerscisco.com/modeling-labs, there's a whole bunch of documentation that you can read here. So if they refer to CML documentation, this is the place to look for documentation. But rather than going through that, I'm gonna show you once again how to get this working very quickly. First place to go to is virl.cisco.com. Click on Get VIRL. Now lemme warn you, the price Is $199 a year. If you don't have a license you'll have to purchase CML, I'm already logged in though, so I'm gonna go to My Account and I'll be able to download CML. Notice please that I purchased the VIRL software on the 3rd of September last year. If your license is still active, you'll be able to download CML. So like I did here, if you had purchased VIRL personal edition previously, as long as your subscription is still active, you'll be able to download CML. So I'm gonna click Download to download the CML. Now there are two files that you wanna download, you wanna download both the OVA, this is the actual virtual machine that we're gonna import into VMware Workstation Player, and then you wanna download the ISO which contains all the images. And please note what they say here, Cisco modeling Labs Personal. Virtual machine for deployment on VMware hypervisors. See quick start guide for details, version 2.0 does not support bare metal deployments. So the documentation they're referring to is the documentation on developer.cisco.com. Here's the quick start guide, which shows you how to install CML, how to set it up, how to use it. So if my videos don't cover the details of what you need, once again, have a look at this documentation. Okay so two important points to make here, you can only run CML on VMware hypervisors. So VMware Workstation Player, VMware Workstation Pro, ESXi, VMware Fusion if you've got a Mac as an example, it's not supported on bare metal, it's not supported using VirtualBox. They tell me it's not supported in the cloud but you should be able to run it in the cloud. So you could try and run it on AWS or Azure. Now when it comes to support, you're only gonna get community support with this product. That's one of the differences between CML enterprise and CML personal edition. With personal edition you only get community support, with enterprise you get TAC support. So you could try running this in the cloud, but you're on your own basically if you try that. Make sure that you download both of these files once again because this file, the ISO contains all the images that you require. So click on the download links to download these files to your local computer. Now I've actually pre-downloaded these because the Internet here is quite slow, so the OVA is 700 meg in size, the ISO is 6.3 gig in size. So it might take you a while to download these depending on how fast your Internet is. Okay another thing is the license, you get the license by simply clicking on this button here and you can copy the license to a text editor as an example. So I'll simply copy this to Notepad. So there's my license which I'm going to need to add to CML before I can start up devices. You can't boot up devices without this license. So make sure that you get your license, make sure that you download your software. So click on the download link, click Accept License Agreement and the download will now start, do that once again for both the OVA and the ISO. So I can click Save to save this to my hard drive. I've once again pre-downloaded this just to save time, especially on this ISO image which is very, very large, 6.3 gig. But once again, click on the download links, accept the license agreement and those downloads will start. So I'll save that to my hard drive as well. You can see it's gonna take a long time for these files to download. So what I'll do is I'll simply cancel these downloads and I'll use the files that I previously downloaded. So again, there's my ISO, here's my OVA. Now you need a hypervisor software. Once again, VMware hypervisor software is supported. So I'm gonna go to vmware.com, go to Downloads, go to Free Product Downloads, and I'm gonna download Workstation Player. VMware Workstation Player is free for personal use. So as long as you're doing this for studies or your own personal use, you can download this and use it for free. So I'm gonna click Download Now, click Save to save it to my local computer. Software is now downloading, it's about 138 meg in size. Okay so once VMware Player has downloaded, double click on the executable to install the software on your computer. Windows complains that I didn't download this from the Windows App Store, I'm happy with that so I'm gonna click Install anyway. And as you can see the VMware installation starts. Now before I complete the VMware installation, I'm gonna go to Control Panel, go to Network and Internet, Network and Sharing Center, Change adapter settings, and I want you to see that there's no VMware adapters at the moment. I do have a VirtualBox network adapter, because I have VirtualBox installed on this laptop, during the VMware installation a new network adapter will be added, that's normal behavior. But let's go through the wizard, it's very simple. I'm gonna click Next, I'm gonna agree to the terms of the license agreement, make sure that you read through this and that you're happy with it, and if you are click Next. I'm gonna go with the defaults so I'm gonna install VMware Player in the default directory, click Next. I'm not gonna join to the Customer Experience Improvement Program, but I will check for product updates on start, click Next. I'll use the default shortcuts, click Next, and I'll click Install. That's how you install VMware Workstation Player, very simple installation. What you'll notice is it's installing virtual network drivers at the moment, and as you can see here, Ethernet adapters have been installed, installation will continue, and there you go, installation has completed, I'll click Finish. Okay so I'll start up VMware Workstation Player. When you start this for the first time, you'll have to agree that you're using this for non-commercial use. Now because I've installed VMware Workstation Player previously on this computer I didn't get prompted to agree to the license agreement, but you would need to do that if it's a brand new installation. As you can see here I've got a whole bunch of virtual machines including VIRL 2. I previously demonstrated the installation of CML, I had a pre-release version of CML, and I demonstrated how to install it on this computer. But now that it's been officially released, I'm doing this quick start installation video again. To import the OVA, go to Player, File, Open. Go to the Downloads directory and select the CML OVA, and click Open. I'm gonna stay with the defaults, so I'm gonna leave this name as it is, you could change that, I'm gonna leave the installation folder and click Import. VMware Workstation Player is now importing the CML virtual machine. As you can see the process is very simple. This is one of the advantages I think of CML. It's very simple compared to other virtualization software. Now before you start the virtual machine up, go to Edit virtual machine settings. The CML developers recommend at least eight gig of RAM for CML, and four processes. You also need to have Intel VT-x enabled or AMD-V enabled in the BIOS of your computer. Now if you haven't got that enabled, or you don't know how to enable VT-x in the BIOS of your computer, please go and look at this video which shows you the full process of installation. In this video I'm assuming that you've got that enabled. Now if you don't have enough RAM on your computer which I don't have, so if I go and look at My PC, you can see I've only got eight gig of RAM in this computer. So physically I've only got eight gigs of RAM, I can't allocate all that RAM to CML, what I'm gonna do is reduce the memory to four gig. But please note that's not recommended. I'm running now with less than the required memory for CML. That means that I can only create small topologies, that means that my devices may run slowly, you should have at least eight gig of RAM allocated to CML, you must have full processes otherwise it won't boot up. It will boot up with four gig of RAM, but it won't boot up with less than four processes. Okay one more thing you must do here is you wanna connect an ISO image at boot. So we wanna to browse to our Downloads directory and select the ISO image that we downloaded. Make sure that you select that, if you forget to do that, CML will warn you during the initial installation but you need that to get all the images, so all the Cisco images as an example. I'm gonna click OK, and now what I'm gonna do is start my virtual machine. Now you can download and install VMware Tools, the developers have told me that that's already been done, so don't need to do that. So I'm gonna click Remind Me Later, but you may wanna install that right now. But as you can see, CML is booting up. And there you go, we've got our initial installation wizard. So I'm gonna click in the virtual machine and press Enter to continue. You need to accept the end-user license agreement, so read through that, press Tab to jump from one option to the other. So I'm gonna accept the end-user license agreement by pressing Enter. Now two accounts are created when you install CML, you've got a web GUI account and you've got a CLI account. So the first account is the Linux system user account and the second account is the web UI user account. I'm gonna press Enter to continue. We're given some tips with regards to keystrokes so as an example Tab allows me to jump from one option to another. Various other keystrokes can help you, I know these already, so I'm gonna press Enter to continue. Now which version are we going to install? I'm going to install CML personal edition, not CML enterprise edition. These products are basically exactly the same, your license determines what you get, so you get more devices with CML enterprise than you do with CML personal. I've purchased CML personal edition, so I'm gonna press Enter to continue. I'm gonna use the default usernames that they give me, sysadmin is the user account for the CLI. I'm gonna set my password, in this example I'll just use Cisco one, two, three, you obviously wanna use a better password than that. But this account allows you to connect to the CLI and also allows you to connect as they say here, to a special UI called the Cockpit system management user interface, which uses port 9090. I'm gonna press Enter to continue. I'm told my password is bad, I'm okay with that, press Enter to continue, password is bad, Yes to continue. Admin account is the web UI account. This is the account you're mostly gonna use. I'll set a password here of Cisco one, two three once again, press Tab, press Enter to continue, I'm told the password is bad, I'm okay with that, I'm warned once again about the password, I'm okay with that, say Yes to continue. Now CML allows you to use either a DHCP IP address or a static IP address. The advantage of DHCP is if you've got a laptop like I have and you move from one wireless network to another, the IP address of CML will change based on where you're at. So I'm happy to use DHCP, it's actually recommended, so I'll continue with the default of DHCP and press Enter. A confirmation screen is displayed to show me my user accounts, I'm okay with that so I'm gonna press Enter. CML is now set up, notice how simple this process is. You can see it says restarting Virl 2 controller, the old name was VIRL 2, so you'll sometimes see that name even though it's now been renamed CML. NGINX is also being restarted, and there you go, it's finished. I'm gonna press OK and notice CML has booted, and I could log in using my sysadmin account, You don't have to do this, but I'll just show you the process. I can now log in to CML and use Linux commands like IP address to see my IP address, but it is actually displayed here. My IP address is 10.0.0.125. Now in my web browser I'm gonna browse to that IP address, 10.0.0.125. I'm told that the connection is not private, that's okay because CML is using a self-signed certificate. So I'm gonna proceed to the server and I'm gonna log in with my username and password. And there you go, I'm logged in to a newly installed CML system. Now I'm told that there's a health issue, I need to edit my license settings, as you can see here, the system is unregistered, It's in evaluation mode, 90 days. That doesn't mean that you can boot up topologies. That just means that you can see the interface. So I'm gonna register my system, once again you can get your license from your account, click on 2.0 License and then copy that and paste that into this window. So all you need to do to register is copy your token, paste it in here and click Register to register the token. Okay as you can see, I'm now registered, registration was successful, what I'll do is refresh this page and notice I'm now authorized. So my account has been authorized, I can now go to Lab Manager and create topologies. So let's create a topology, Add Lab, I'll give it a name, first CML lab, click in this white space, the lab has now been opened, I could change the lab name here if I wanted to. So as an example, first CML 2.0 lab, what I can do now is drag some devices to my topology, so I'll drag a switch, IOSv layer two switch, I'll drag two IOSv routers to the topology, I'll zoom in here, I can move them around by simply dragging the topology, I'll zoom in some more. And then what I'll do is hover my mouse over the router, and then while I'm over the router, click and drag that connector to the switch and then select the interfaces. Hover my mouse over the switch, click and drag that connector to the router, select the second Ethernet interface, first Ethernet interface of the router, topology has been built. I'll click Simulate and click Start Lab. Notice these little icons showing me that the devices are booting up. If I click on Nodes, I can see that the devices are starting. So they started, you can see the CPU utilization is very high at the moment, but what I could do is click on the switch and click on the console icon, click Open Console and press Enter to activate the console, and as you can see, I've got a Cisco switch booting up, click on Auto here to autosize the interface, notice press Return to get started, I've already got a Cisco IOSv layer two switch booting on my little laptop with two little RAM in it. Just make this a bit smaller, I'll click on the router, Open Console, press Enter, routers may take a bit longer to boot up, second router, press Enter to activate the console. So while I'm waiting for the routers, let's go back to the switch, and as you can see here it says insert name here, that's because you can create a configuration of a device. So you can specify the hostname that it's gonna boot up with. So you may wanna do that before your device boots, but for the moment, I'll just set the name to switch one. Show CDP neighbors, can't see any neighbors at the moment. I need to now shut the interfaces on the routers, notice this router has booted up, that little green check. I'll say no to bypass the initial configuration dialog, I'll do something similar on this router. So back on the first router, you just need to wait for it to display the console, again I'm running with two little RAM in this laptop. Things are running a bit slower. I found with a small topology like this it actually worked okay, initially it was very slow. You get a lot of these messages saying CPU hog. So CPU utilization is very high, but later on it gets better. Okay so enable conf t, host router one, interface gigabit is zero, zero, no shut, IP address 10.1.1.1, slash 24 mask. Try that again, slash 24 mask, save the router configuration, go to the second router. Enable conf t, host router two, interface gigabit is zero, zero, no shut, IP address 10.1.1.2 slash 24 mask, can router two ping router one? So ping 10.1.1.1, and there you go, ping is successful, I can ping from router to router one, on router one, can I ping router two? Yes I can. I mean we could run OSPF here so let's create a loopback on this router, enable OSPF on all interfaces, in area zero as an example, on router two do something similar, so interface loopback zero, IP address, quadruple two slash 32 mask, router OSPF one, enable OSPF on all interfaces, show IP OSPF neighbor, neighbor relationship is a two-way at the moment but you can see a neighbor relationship is being formed between these two routers. It's as simple as that to get CML up and running on a Windows computer. In this case I used VMware Workstation Player, free software for personal use from VMware. Can I ping the loopback of router two from router one? Yes I can, show IP route. There's my routing table. Show IP OSPF neighbor, full relationship to router two, here's my routing table. It's as simple as that once again to get CML up and running on a Windows computer. I showed you how to download VMware Workstation Player, I showed you how to download CML, I showed you how to get it up and running in this video, there you go. Fantastic product from Cisco, I highly recommend CML. If you're new to Cisco, you may wanna use Packet Tracer. But if you're serious about learning Cisco technologies, I'd highly recommend that you get CML. (upbeat music)",
    "transcript_keywords": [
        "CML",
        "VMware Workstation Player",
        "Workstation Player",
        "download CML",
        "Click",
        "VMware Workstation",
        "download",
        "press Enter",
        "CML personal",
        "CML personal edition",
        "download VMware Workstation",
        "download Workstation Player",
        "router",
        "VMware",
        "Player",
        "install CML",
        "Enter",
        "Workstation",
        "license",
        "Cisco"
    ],
    "transcript_entity_values": [
        "first",
        "the 3rd of September last year",
        "Linux",
        "three",
        "Network and Internet",
        "Mac",
        "VirtualBox",
        "32",
        "VMware Workstation Pro",
        "90 days",
        "VMware Tools",
        "199",
        "Cisco",
        "Finish",
        "CML",
        "Ethernet",
        "two",
        "four",
        "AWS",
        "Player, File, Open",
        "eight",
        "Control Panel",
        "VT",
        "Cisco modeling Labs Personal",
        "CPU",
        "zero",
        "second",
        "Tab",
        "Add Lab",
        "2020",
        "the Customer Experience Improvement Program",
        "Downloads",
        "Workstation Player",
        "Virl 2",
        "IP",
        "Packet Tracer",
        "AMD-V",
        "Register",
        "VMware Workstation Player",
        "one",
        "VMware Player",
        "OSPF",
        "VMware Fusion",
        "ISO",
        "9090",
        "VMware",
        "Today 12th of may,",
        "6.3",
        "Start Lab",
        "RAM",
        "GUI",
        "700 meg",
        "Cisco",
        "Intel",
        "Cisco",
        "the Windows App Store",
        "NGINX",
        "24",
        "First",
        "at least eight",
        "Windows",
        "TAC",
        "DHCP",
        "Azure",
        "less than four",
        "CLI",
        "UI",
        "Next",
        "2.0",
        "CDP"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "MONEY",
        "ORG",
        "LANGUAGE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "QUANTITY",
        "GPE",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}