{
    "id": "h1P0fRUyX-s",
    "title": "Windows 11 Install and Test Run - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-06-17T02:45:11Z",
    "video_url": "https://www.youtube.com/watch?v=h1P0fRUyX-s",
    "category": "Science & Technology",
    "tags": [
        "Windows 11 Install and Test Run - Krazy Ken's Tech Misadventures",
        "Windows 11",
        "Windows 11 Leak",
        "Microsoft Windows 11",
        "Windows 10X",
        "Windows 10",
        "Microsoft",
        "PC",
        "Computer",
        "MacBook Pro",
        "Mac",
        "macOS",
        "iMac",
        "Apple",
        "VMware Fusion",
        "Virtual Machine",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Computer Clan",
        "Tech",
        "Start menu",
        "Taskbar",
        "Microsoft Event"
    ],
    "views": 138083,
    "likes": 5290,
    "comments_count": 1048,
    "description": "Microsoft Windows 11 leaked ahead of the June 24 announcement, and it's up to Krazy Ken to install it, test the new user interface, and experience multiple inconveniences as he tries to overachieve.   Check out our rare tech playlist   Support our channel and get cool stuff   Download our epic wallpapers   Subscribe and listen to our podcast    Follow us on Twitter   Like us on Facebook    Windows 11 Leak (Installation Sensation) - Krazy Ken's Tech Misadventures  0:00 - Introduction 1:16 - Failed Install Attempts 3:50 - Successful Attempt (Just Use a VM!) 5:12 - First Boot! 7:16 - Test Run: New UI and Features   Patrons got to see this episode early. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #Windows11 #KrazyKen #MicrosoftEvent",
    "description_links": [
        "https://bit.ly/clan3zlKXX9",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/wallpapers",
        "https://applekeynotechronicles.transistor.fm",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "(logo whooshing) - So Microsoft has a big announcement coming up on June 24th regarding Windows 11, but it looks like there was a leak online. So we're gonna take a look at it right now with a new installation sensation and you're coming with, lets go. (upbeat music) Hey guys, how are you all doing? If you're new here? Welcome, my name is Krazy Ken and what I love to do sometimes is what I'd love to call an installation sensation where we install a new operating system that we've never tried before and then we test it out. We like to look for bugs, we like to test features and of course, I like to use my handy dandy flash drive that I've had with me for like a million years doing this stuff. So we're gonna plug this in and this is the leak build of Windows 11. So we may not see everything in this particular build. We might see more on the June 24th announcement, but we still have some cool stuff to explore. I've never tried this before. This is my first time, you're all witnesses and we're doing this straight up. We're installing this directly onto a 2013 Intel MacBook Pro, no virtualization, none of that, we're doing it straight up. So as we can already see the logo looks different. Ah! I feel like it was just yesterday that I released the Windows 10 technical preview episode of my old show, TidBytes. Actually, no, it doesn't feel like yesterday. It does feel like it was like six years ago. I lost track of time but we are using English, English, and US. So let's do that. And I love clicking on the old school buttons. That just seems to be a pattern that Microsoft does, the newer systems are always using older like previous version UIs for their installers, that's typically how it goes. I don't have a product key, at least not yet. So now we have a version selector here. It looks like Windows 11 home, N and I don't remember what end means in this case. We have Education, Education N, Pro, Pro N. There's a lot of different versions here, I'm gonna choose pro and see what that does. And it should start up. Oh! No, wait, we need to, this PC doesn't meet the, Oh! my gosh, seriously. This PC doesn't meet the system requirements, what. It is an almost eight year old computer. So let's try Windows 11 home. Oh! Crap, we can't run Windows 11 on your, all that sucks. I can bust out my ginormous iMac and we can try it on there. Okay, change of plans. And here we are, we have transitioned to a 10 core, i9, something gigahertz iMac with a 5,700 STG GPU. Hopefully this is good enough for the Windows 11 leaked build. So lets boot it into that. Let's try the whole Windows 11 pro thing again. We'll do next, Oh! This PC doesn't meet the system, I wonder if a driver issue. Yeah, I just, maybe this thing just straight up cannot interpret the hardware properly. So I think we're gonna have to go to a virtualization solution. Hey, this is tech misadventures, there would not be a tech misadventures episode without problems. Thus is the Krazy Ken curses mission to make my life a living dow. Okay, so we are now on plan C of this installation sensation. Hopefully, it works, third time's the charm. I'm just gonna use VMware Fusion, I've used their stuff a bunch before, I put the ISO into their wizard. I don't know, man, what do you think? Give it at least four and RAM it does 192, we'll give it eight gigs. Hopefully this all works and you are running this virtual machine with side channel mitigations enabled. What are we in court? I've never seen them. I don't even care anymore. All right, let's do that, see if it works. Boot from the CD and Boom! We have some windows, which is good when you're installing windows, you wanna see those. It's gonna be a little fuzzy and I'll square because we do not have all the display drivers and everything installed right now. So it really doesn't understand the capabilities of this computer yet. We're going to do windows 11 pro cause it sounds pro, okay? We did not get this far last time and we got to read every word of this, done. It's not an upgrade, we've got to do a custom install. So we have our unallocated space here, we'll make a new partition on their full size to ensure when Windows features work correctly, whatever. Okay, so it's got all of its partitions, I guess it has to make some reserved things. So we'll say, yep, install on drive partition three primary and Boom! Okay, well this is already going a billion times more smoothly than installing it straight up. I tried to be a cool kid and not use a virtual machine but whatever virtual machines are so much easier when you have a life and you want to get back to it. And it's just cruising along 35, 38. So now we're in the installing updates already. Okay, we're restarting. So we'll click restart now. It is going super fast, but it is coming from a fast SSD just onto itself, it's not coming from a slow DVD or anything. And we're rebooting, getting devices ready, starting services, hold up, slow down. I can read. And we're restarting again. (logo whooshing) Ooh! Okay, we got a new sound. Oh! Okay, this is new animations and graphics everywhere. Okay, the sound was okay, I kind of want something maybe a little more exciting than that, but whatever, it's all good. But yeah, all of this looks completely new. It looks like we have that initial scrolling there and a different scroll bar look. Lot of rounded corners, it looks like they're pushing the rounded corner thing. We have rounded corners on the Windows, rounded corners on the highlights and the fills and on the buttons, pretty sweet. Steve jobs would be happy. So, we have a cool little loading thing there too, little different, nice animations there, Wow! Looking pretty cool. Is this the right keyboard US? Absolutely, you wanna add a second? No fricking way. I've never done that in my life. Again. We still need to wait to see what happens on June 24th. We might see more features in bigger under the hood changes on that date. So subscribe and stay tuned because I want to cover that news as well. As of right now, I can't expect anything major aside from UI tweaks. It's probably still a lot of the same underlying code which has been around for a long ass time but maybe that'll be changing on the 24th, we'll find out as soon as we can. So set up for personal use, yes. Boom! Security questions, really? What is this? 2002, okay, what was your first pet's name? None of your business. What was your childhood nickname? I can't believe it's not blubber. So location, no. Find my device, no. diagnostic data, no. Anyway, advertising, no screw you. And accept, now let's see what's new from Windows. I wonder if they leaked this on purpose. You ever think about that? Do you think they did that to like drive up the hype? Ooh! wait a minute. (beep) Sorry, it almost knocked my phone off the table. This like a ethereal blurry glow in the background is new. I'm digging it. Ooh! Nothing new sound there. I'm guessing the whole soundscape has been... Oh! Okay, all right. We're just jumping right in. So yeah, I'm guessing the themes and everything had been tweaked as well. New wallpaper that looks pretty smexy. So first glance. Yeah, we're gonna get the drivers installed so we can actually like use the pixels that I paid for. But at first glance, icons look refined and new, they are center aligned by default, kind of reminds me of macOS, which is sweet. And we have this new rounded corners start menu and it looks very inspired by Windows 10X which was a system made for dual screen devices but it looks like... And I don't know if this was the plan from the beginning that Microsoft is actually pivoting or maybe this again was intentional. Pivoting to make that dual screen device aesthetic actually be the mainstream look for their desktop iOS. So yeah, okay, good start. We do need to get drivers and other things Bob's on here. So, but I am liking the colors of this however, the inconsistency of square corners here and rounded corners here is weird, but this isn't really official yet, this is a leaked build. So we'll see what happens. Any, who's all set up 64 bit and we do have rounded buttons here. So it looks like that's working. So let's see. Okay, so far so good. So welcome to the installation. We'll do that, we'll do complete. Oh! Wow, that threw me for a loop. I did not think the radio button was selected. Usually when I click a radio button that fills in this system, it just kind of highlights the rim. That was really confusing at first, but I guess that's just what they wanna do. Okay, so now we are installing and now we have rounded corners on here. That's interesting. So I wonder if it needed a driver to put rounded corners on these Windows here. You must restart, okay. Yes, now we have rounded corners on the file explorer. Okay, so yeah, that was clearly a driver issue, but as we can see rounded corners there, rounded corners here, animation is working. This is cool. Okay, do we have like frosted Glasgow? Oh! Yeah, we got like the frost glass look in the task bar. Oh! Hello, hello, nice frosted animation there. Okay, I had a feeling, we'd see something like this. This is kind of like in Mac iOS when you hover over the green button, you get a pop-up menu, but of course it's okay. It doesn't really matter who came first with the feature. I really couldn't give a crap, but Microsoft, they really made the whole snapping feature like mainstream from the beginning. That's one teacher, they do really well. So now it looks like we can trigger it from clicking like that, which is pretty sweet and we can pull it out. Let's actually take a look at the settings. And again, as part of an installation sensation, we're just experimenting, I have never used this before. So, it looks like we have some of that fluent design inspiration there. You can see like as I hover the cursor around, it kind of like triggers like a highlight fade around the buttons, interesting. Let's see if we can get a dark mode. Yeah, I know, we need to activate that customize. That's gonna be interesting. How do you activate a leak build of windows? I mean, I'm sure people have customized. Well, I do have a product key from like a million years ago, can I just type that in? Actually I wonder, hang on. Windows activated, hell yeah dude, like fricking key from nine years ago, still fricking works, dark mode. Oh! Yeah, need change my pants, just kidding. That looks really cool in dark mode. I am a dark mode sucker. I am all for dark mode. We can get the nice transparency going on in the task bar there and in the start menu there, look at that. Okay, that is hot. And it looks like we can turn the transparency off if we want it to be more opaque or we can keep it on and get that like frosted, glossy and blur. Lets go to themes, let's just see what the, okay, here we go Windows dark. Yeah. Oh! Yeah baby, that's what I'm talking about. I love me some dark mode. So we have Windows light, Windows dark, glow, captured motion, sunrise and flow. A couple of different themes going on here. Okay, pretty cool. Let's see flow here, not from progressive. Very nice, very cool. I'm gonna stick with windows dark. I really liked this wallpaper here. I don't know really... It's abstract, it looks like maybe like paper or something but looks really cool. Okay, so now let's see, we have search here. Ooh! You see that, when you click at highlight, kind of animates around the icon. That is fascinating. All right, we got here, this is probably the task view. Oh! Dude, the icons have their own custom animation, look at that. Oh! That's a little touch, I really like. What do we got here? So we have widgets. Hello, that's a name I haven't heard of in a long time in the windows space. You need a Microsoft account to use windows dashboard? Screw you dude, I don't want. No, fine you win, I'll sign in. Okay, so for the fourth try, widgets, there we go. We have weather, stocks, NBA. I don't really care about news stuff, if I can find a way to get rid of that, I would love to get rid of that. I don't need to be bombarded with that. But whether in stocks, I guess I'm cool with that's pretty cool that we know have like a kind of like the old Windows 7 or even Vista days with the sidebar. Remember that, those widgets? That was fun. So yeah, now we have that little thing that pops up there, okay. So it looks like we have like a bit of a bevel highlight here and on the tool tips as well, very cool. And again, custom animations for what you click on. But another thing I noticed is when you quit an application, the icons kind of just like bumped down, take a look, see what I mean? They kind of just like shuffled down and if I open it up, they kind of just animate kind of playfully. I think that's pretty sweet. Got the right click menus, rounded corners, pretty sweet. Oh! That one does, there's no rounded corner there. That's interesting, the right click. Okay, the right click menu here. You still get these cool shortcuts. This has the rounded corners, but if you right click on edge, you don't get the rounded corners. But if I right click on these other apps, I do. Now, there's no rounded corner for when these pop out. I forgot what the formal name of these little sheets are. Nice sound, but yeah, there's no rounded corners there yet, but it looks like we do every rounded corners in most other places. And it looks like the contextual menus here too also have rounded corners. So that's interesting. So, let's see if we can summon the old stuff. So it looks like we still have the old school control panel in here, if we want. Let's see, Oh! Let me see phone dialer, might be hidden somewhere. You can still go to run, type in dialer and you get the phone dialer, that's so freaking cool. It just looks so out of place. Yeah, this is a masterpiece right here. Anyway, there we go. Windows 11, Windows 11 Pro, OS build 219960.1. I am really curious to see if they're gonna do any significant underpinning changes. The one thing that's tricky for Microsoft, is they have so many users that rely on backward compatibility. They can't really do what apple does and burn the past and move on. That would be a disadvantage to their business. So I don't know how they're gonna pull off underlying code changes because I'm guessing just like Patreon certainly to joke about, you still have DLLs, the registry. - DLLs is a registry, disk defragmentation, no end user should ever have to know about that. (audience laughs) - You could probably still pull up the registry editor and have this old school looking thing but like there's pros that need this stuff and actually circling back to the Windows 10X thing I mentioned before, someone did notice there were mentions of Windows 10X inside of Windows 11 here. So yeah, I don't know, I guess this stuff is just always gonna be in here or maybe there's gonna be like a, I don't know, some sort of rollout of this stuff, getting phased out. Okay. So let's see what else we got in here. This is the new start menu design. Looks like live tiles are gone which I'm personally okay with, I thought like it was kind of goofy so it looks like alignment we can Oh! that's nice. Nice animation, we can move it back to the left if you are used to it being on the left and we can also trigger on and off widgets. Man, I love these little like kinetic animations. I don't know if that's the physics term for them, but they're just really playful looking. Let's take a look here, go away macOS dock, we don't need you. They just pop up, they slide over and kind of like have a little bit of inertia and momentum on them. Just very cool little touches like that. Let's take a look at sounds really quick. So we have in our themes here sounds which still comes up in the old Wind 32 control panel, but hey, wouldn't expect anything different. I'm not sure how many of these are really new. Again, I haven't used one in a long time and when I use windows, I don't really have sounds on. Device connect, or no sounds. Oh! They still got the old like, that was a Vista sound, that goes way back. So as Microsoft teased on Twitter, this is just the start. So I'm sure we'll see a lot more news on June 24th. So feel free to subscribe and stay tuned for that because I'd love to cover the news as much as possible when I can. Also, I do other episodes on this channel, in addition to new technology stuff. I love making episodes about rare technology, retro technology and of course I love doing tech scam busting. So feel free to check out all of those other episodes on the channel and there's more coming. Feel free to drop a comment down below and let me know what you think about Windows 11. Thanks for sticking with me. Catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "Windows",
        "rounded corners",
        "rounded",
        "corners",
        "Yeah",
        "cool",
        "kind",
        "Windows dark",
        "Pro",
        "Microsoft",
        "thing",
        "dark",
        "love",
        "click",
        "stuff",
        "pretty",
        "dark mode",
        "time",
        "nice",
        "rounded corner thing"
    ],
    "transcript_entity_values": [
        "third",
        "eight",
        "the 24th",
        "diagnostic data",
        "32",
        "Windows",
        "a minute",
        "Windows 11",
        "SSD",
        "ISO",
        "Vista",
        "Windows",
        "TidBytes",
        "192",
        "Glasgow",
        "Windows 7",
        "six years ago",
        "Education N",
        "Education",
        "38",
        "2013",
        "Patreon",
        "Krazy Ken",
        "11",
        "fourth",
        "NBA",
        "English",
        "US",
        "Windows 11",
        "UI",
        "Bob",
        "first",
        "RAM",
        "nine years ago",
        "VMware Fusion",
        "Windows",
        "one",
        "Microsoft",
        "10",
        "the June 24th",
        "Windows 10",
        "iMac",
        "64",
        "June 24th",
        "yesterday",
        "at least four",
        "macOS",
        "219960.1",
        "second",
        "Twitter",
        "35",
        "5,700 STG GPU",
        "three",
        "Steve"
    ],
    "transcript_entity_types": [
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "NORP",
        "TIME",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "GPE",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "LANGUAGE",
        "GPE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PERSON"
    ]
}