{
    "id": "H3_mVryqXpU",
    "title": "Homemade Off Road Electric Wheelchair - She had NO Idea!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-10-17T13:54:20Z",
    "video_url": "https://www.youtube.com/watch?v=H3_mVryqXpU",
    "category": "Howto & Style",
    "tags": [
        "Off Road Wheel chair",
        "Wheelchair",
        "Accessible",
        "Handicapped",
        "Electric Wheelchair",
        "DIY Wheelchair",
        "Bike chair",
        "Bike Wheelchair",
        "Cambry Kaylor",
        "JerryRigEverything",
        "Outdoor wheelchair",
        "Extreme Wheelchair",
        "disability",
        "spinal injury"
    ],
    "views": 11998854,
    "likes": 291006,
    "comments_count": 30302,
    "description": "Do you want one of these?!:  Watch how we built this Off Road Wheelchair contraption HERE:  Building this Off Road Wheel chair out of two electric bikes was a super fun challenge, and ended up being much easier than I anticipated.  With a few minor adjustments to the electric bikes, I was able to mount a seat 'chariot style' right between the two e-bike frames.   See our updated version HERE:   We need help choosing a name for this electric off road wheelchair! Let me know in the comments.   Ill post all the build details and dimensions in the construction video tomorrow. This off road wheel chair goes 20 miles per hour, and should have a range of 20-30 miles. It cost me about $3,000usd (mostly the price of the bikes). About 50 dollars worth of metal for the seat, and about 3 full days to design and assemble the whole wheelchair.   Splicing two electric bikes together to build a powerful off road wheel chair was super fun, and a sweet surprise for Cambry.  Check out Cambry's instagram here:   Awesome Smartphone Tool Kit:  LARGER tool kit:  Green Pry tool:  Metal phone opening tool:   Customize your own Tesla Here:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:  Music is from HERE:    *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://notawheelchair.com/",
        "https://youtu.be/V6kJOXr3HzA",
        "https://youtu.be/vuMg0QwKAGI",
        "https://www.instagram.com/cambrykay/",
        "http://amzn.to/2idLGDi",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://ts.la/zack10701",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://share.epidemicsound.com/pcGGf",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Cambry] Nothing like this exists. I've been restricted to pavement for most of my adult life. I feel like way more free in this than like my wheelchair even. [Zack] So I met a girl named Cambry a couple months ago, who is paralyzed, which means she doesn't have the use of her legs. Normally, people who are paralyzed get around in in a wheelchair. But even with the wheelchair, it limits the amount of places you can really go...especially when the wheels are small and it's operated with your hands. I saw this problem and realized that I could take two electric bikes and splice them together with a seat in the center, so she could get around easier and go more places all electrically powered. Cambry has no idea this thing exists or that I built it, or that she's going to get it today. This baby can go 20 miles an hour with a range of about 20 miles. We'll have to put it to the test a little bit later. So come along with us and see what happens. I hope she likes it. Let's get started. [Intro] So Cambry is on her way here right now, but she thinks we're going to make a video about this bike, which I built her a couple weeks ago, which has adult training wheels on the back. We currently have Cambry riding a bike. [Cambry] Yeah I am! [Zack] All by herself. [Cambry] With it's training wheels. [Zack] Check it out! It worked out pretty well. We could strap her feet to the pedals. We went, you know, 5 or 6 miles down the trail with it. But it's not as safe as I want it to be, which is where the new contraption comes into play. My buddies right now are hiding behind this building over there with the bike. So after Cambry and I film the video about the adult training wheels, they'll ride out and we'll do the reveal. Hopefully it works. [Cambry] I'm nervous! You do this every day! [Zack] Okay. You ready? [Cambry] Yeah. [Zack] So this is the bike, and this is Cambry! And she is in a wheelchair. [Cambry] Here's the frame of my chair. [Zack] So normally when Cambry gets out of her car, she sets the frame out. And then each of the wheels are independent of each other, and just kind of like get on each of the sides of the chair. How long have you been doing this? [Cambry] Thirteen years. [Zack] And how do you get from the car into the chair? [Cambry] Very carefully. [Zack] Ha ha! [Cambry] And...now we're ready. [Zack] We've taken this bike out a couple times. What is something you like about having this bike? [Cambry] Man! This is hard for me! [Zack] Right?! It's hard being in front of the camera! [Cambry] How do you do these every day?! Okay, you can edit all of this. [Zack] Yes I can. [Cambry] I like the freedom that it gives cuz I'm on the road with everyone else on their bikes and it's not like I'm strapped down and disabled. Like I'm just on top of a bike like everyone else. I have to balance a little bit with my upper body. And it's a lot faster than a recumbent bike. And my shoulders don't get tired, so that's fun. [Zack] But if you could change something about it, what would you fix? Because I know when we took it out the one time, I was nervous that like if you were to tip over, you'd be kind of like stranded. [Cambry] I just want to go faster. [Zack] You want to go faster. [Cambry] That's all I'd change. [Zack] So she wants to go faster. [Cambry] What would you put on for an upgrade? [Zack] What would I put on for an upgrade? There are a couple ways I would upgrade this actually. I am super glad you asked. There's something I haven't told you yet about the bike. So, come on over here. So you know when I've been at my office welding stuff? [Cambry] What?! You've got to see this! This is unreal! What is happening right now?! [Spencer] Hey Cambry! [Cambry] Uhhhhh, okay. This is really cool. [Zack] How do you like it? [Cambry] I'm stoked! This is really cool! I don't even know what to say. Can I just like crawl in? [Zack] Yeah. [Cambry] This is why you were asking so many questions! [Zack] Yeah...about your wheelchair and stuff. [Cambry] Okay, I should probably put this cushion on it. [Zack] Yes. [Cambry] Thank you. [Zack] Feet go there, obviously. I'll put some Velcro straps to keep them down a little bit later. You have your miles per hour and everything just like the other bike. And it's already on, but then you just turn this a little bit. So breaks are these things up here on the top. So I just operate with my thumb but you can just let go of the throttle and then... [Music playing] [Cambry] Take this. [Zack] Got it. [Cambry] Nervous?! [Zack] For you! [Cambry] Can this go on curbs? Okay, I'm nervous. Did it! It worked! That was awesome! [Zack] What do you think? [Cambry] It's unreal. Like nothing like this exists. It's amazing! Uh, yeah...I'm just like...you guys are awesome. Ummm. This is why you didn't show my anything that you were welding, you were showing me other stuff. [Zack] Uh huh. [Cambry] Yeah...I just don't know what to say. Do you guys want some pumpkin bread? [Zack] Ha ha! [Music playing] [Cambry] Ooo, should we go through there? I've been restricted to the pavement for most of my adult life. [Music playing] [Cambry] That was like nice and calm. [Zack] So you were like doing a victory lap around this track, and there were two boys over there and they were talking. One was like, 'dude, how is that accelerating?' And then the other guy was like, 'yo bro, it's solar powered.' So maybe that's a feature we can add for the next one. So how was it? [Cambry] Phenomenal. [Zack] That's good. [Cambry] It's a whole new level of freedom. I love it. I like that I can go down curbs and up curbs. [Zack] Yeah, cuz in your regular wheelchair that would be a lot harder. [Cambry] Yeah. I don't always make it up one curb. [Zack] Could you have made it up the grass hill on your regular wheelchair? [Cambry] No. Heavens, no. And the best part of it is, we went 11 miles today and my shoulders aren't sore at all. And it can go on like grass, wood chips, gravel, and I think whatever else I wanted to drive it on. [Zack] So if you could change anything about it besides adding solar panels, what would you do? [Cambry] Um, I'd put some like shock absorbers in the seat because I like going up and down the curbs. [Zack] Yeah, so when we built the bike, the front shocks are intact, so she has a little bit of absorption. But when the back tires hit, there's really no padding from her seat to the ground. Adding in some more shocks would probably be a good thing. Or like a read suspension. That would probably add enough cushion to the seat. We haven't decided a name for this yet. So if you can think of a name for this off-road, pod racing, chariot wheelchair contraption, leave it down in the comments and help us out. [Cambry] Go Kart from Heaven. [Zack] I'll have more details listed in the video description like the dimensions of the seat. Obviously every single person is going to be a little bit different. And where I got the bikes from and stuff. If you have any questions, leave them down in the comments. Thanks a ton for watching. Huge thanks to Cambry for being my test driver for this thing. And we'll see you around. [Music playing]",
    "transcript_keywords": [
        "Cambry",
        "bike",
        "Yeah",
        "wheelchair",
        "bit",
        "wheels",
        "put",
        "miles",
        "training wheels",
        "bikes",
        "adult",
        "couple",
        "faster",
        "nervous",
        "adult training wheels",
        "seat",
        "exists",
        "built",
        "training",
        "chair"
    ],
    "transcript_entity_values": [
        "Zack]",
        "about 20 miles",
        "Cambry",
        "the next one",
        "6 miles",
        "two",
        "Velcro",
        "Thirteen years",
        "20 miles an hour",
        "Spencer",
        "11 miles",
        "5",
        "Zack] Feet",
        "a couple months ago",
        "a couple weeks ago",
        "today",
        "Zack",
        "One",
        "one"
    ],
    "transcript_entity_types": [
        "PERSON",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL"
    ]
}