{
    "id": "h3BKjZMGoIw",
    "title": "iPhone 16/16 Pro Unboxing: End of an Era!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2024-09-18T12:01:27Z",
    "video_url": "https://www.youtube.com/watch?v=h3BKjZMGoIw",
    "category": "Science & Technology",
    "tags": [],
    "views": 6283445,
    "likes": 186468,
    "comments_count": 12441,
    "description": "iPhone 16 and 16 Pro have 1 change to the boxes. Goodbye, stickers.  Protect your smartphones screen perfectly and effortlessly at   MKBHD Merch:   Tech I'm using right now:   Intro Track: Jordyn Edmonds  Playlist of MKBHD Intro music:   Phones provided by Apple for review.  ~",
    "description_links": [
        "https://dbrand.com/store/prism",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "https://lnk.to/jordynedmonds",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(groovy hip-hop music) - So it's a bit of a tradition around here to unbox the newest iPhones on the day they come out. And we're upholding this tradition this year to find one single difference versus last year's unboxings. So we've got four iPhones here in new colors: iPhone 16 and iPhone 16 Plus, which the boxes show the back of the phones. And then iPhone 16 Pro and iPhone 16 Pro Max, which show the front. And I'm totally gonna start with the base phones, the crowd favorites this year. Finally, some colors back in the iPhone lineup. So, I'm gonna call this one the flagship color. This is the Ultra Marine iPhone 16. And in the box, you get the USB-C cable, again, braided and high quality, and then a tiny little bit of paperwork in this pill shape. And then you'll notice no SIM card tool, same as last year, and no stickers this year. There are no stickers included in the iPhone 16 box at all. Truly the end of an era. They just can't stop removing things, they can't help themselves. But let's get a look at the pink plus-sized phone, too. These phones are the same sizes as last year: 6.1 inches for the base, 6.7 inches for the Plus. But with the bigger batteries inside, that's something I'm really happy to hear about and very curious about in my testing. But really, I'm just happy we finally have colors back. So the back of the phone, it's a little more pale, but the glass around the camera is a bit darker, the rails of the phone are a bit darker, so this is nice. Same stuff in the box. Now, with these Pro phones, I think there's a reason they show the front of the phone on the box because, if they showed the back, you literally could not tell the difference versus last year. But hey, at least this one has slightly thinner bezels they can show. And yeah, this year is gonna be the Natural Titanium iPhone 16 Pro. And aside from the lack of stickers in the box, it's gonna look and feel basically exactly like a titanium iPhone 15 Pro. Same USB-C cable as the base phone, as well. Great. But then, this is the new flagship Pro color. The renders we saw at first were kind of weird, but this is the official Desert Titanium color. And you know, all of Apple's phones are, again, a bit more pale on the back, but they have more color on these rails, and that's definitely true again here. It's kind of like a light sand color but also feels similar to the gold of the past. But there you have it. That's the iPhone 16's unboxing experience. So, by the time you see this uploaded, that means I am deep into my iPhone 16 testing and working on the full review. So, definitely, get subscribed to see that when it drops. But if there are any things that you specifically wanna see talked about more or that haven't been talked about enough for the review of the phones, let me know in the comment section below. But I can still give you now some quick things that I've noticed in my first couple days, my first week of testing, some FAQs. So, first up, there is a size difference versus last year. The base phones are the same sizes, like I said, 6.1 and 6.7 inches in the same body sizes. But the Pro phones are both bigger. The iPhone 16 Pro goes from 6.1 to 6.3 inches, and even though it has thinner bezels, yes, the phone is slightly taller and slightly wider. And then, the iPhone 16 Pro Max goes from 6.7 inches to 6.9 inches diagonally, which is now just an absolutely gigantic phone. I mean, it was already huge, but it's now even taller and wider. Biggest phone they've ever made. If you look at it next to the Galaxy S24 Ultra, that's another absolutely huge phone for some context, and that phone has a stylus in it. So obviously, Apple's put more battery in this phone, which is great to see. I'm glad they're not going the opposite direction of, like, making it thinner or shrinking the batteries. But yeah, just it's definitely good to know if you're going with the new Pro Max this year, you are getting a truly huge, like, borderline tablet-sized phone. Also, random tidbit: Thanks to these new cameras up in the corners, these new iPhones are big-time table rockers. Like, big-time uneven camera on the back. It's annoying to me 'cause I type on the table sometimes. Anyway, I've also been taking some pictures and videos with the new cameras. I'll be taking and posting many, many more. If you wanna follow me on Instagram, that's where you'll see some more in the next couple of days, but I'll link that below. My first impression is it's kind of remarkable how consistent Apple's image processing pipeline is to get the same look every year. Like a lot of times, we see companies switch sensors. Even the Pixels switched sensors after using the same old one for a while, and the whole look kind of changed. But it really feels like year over year, no matter how many hardware changes, no matter how many sensor changes these phones go through, they still just very much have the iPhone look, which, I mean, makes sense. This just shallower depth of field from the larger physical sensor. I have also run some benchmarks. So these are the new Geekbench 6 scores for the new A18/A18 Pro in these phones, which are new versus last year. Really not noticing, like, a huge difference in performance with these brand-new phones. Obviously, you're gonna feel that more at the very high end and in the long term as these phones age. But what Geekbench also did reveal is all of these phones across the board have eight gigs of RAM now. So, there's typically been different amounts of RAM in the Pro phone versus the regular phone. Now, there's not. Now, they all have eight gigs of RAM. So Apple was giving us a lot of talk in that keynote about how these are the first phones built from the ground up for Apple Intelligence. Is that what this means? I mean, you clearly need a lot of memory to run these AI models, and there's also a more powerful neural engine on all the phones versus last year. So maybe that's a part of it, too. But all that talk and these phones all launch with iOS 18.0, which has exactly zero Apple Intelligence features on them at launch out the box. But that's a rant for another day. But clearly, the biggest physical new change on these new phones is this added button here. And Apple refused to call it a button in the keynote and then doubled down. They also did a bunch of, like, executive interviews on various YouTube channels that you can go watch from that day, and even in those interviews, they continue to refuse to call it a button. It's so weird. - To just put out the biggest burning fire, right up front, in the discourse. It is a real button, right? - Ah! (group laughing) - It's a physical thing that depresses, right? - I think it's a first of its kind. There is a tactile switch, that gives you that final click. - So, just to clear it up, it is an actual moving clicking physical button that is called Camera Control. (laughs) But it's more than a button. It's also made it to all these phones, not just the Pros. So, let me jump into that. This Camera Control button, as the name implies, only controls camera-related things. So it's not like another Action button, it's a Camera Control button. You can hit it once it opens up the camera, you can hit it again to take a photo, and then you can hold it down to start recording a quick video. But it's also a large capacitive touch-sensitive surface with a vibration motor underneath. So it doesn't actually half-press, but with that vibration motor, it can mimic the feeling of a half-press, like a real camera would have. And you can double-tap to flip through various camera controls like zoom or photographic styles, or tone. It takes some getting used to. I mean, these swipes, they also you can see have momentum physics too, so you can swipe too fast or too far and go past what you were aiming for or zoom past where you thought you would. So it can feel a bit finicky and silly as you start using it, especially since you can literally do all this stuff with the buttons already on the screen. But when you use Camera Control, all of the rest of those buttons just fade away and disappear, kind of encouraging you to continue using the Camera Control to find what you're trying to do. It's really interesting. The placement feels like it was made with landscape in mind, but landscape ideally would've been at the corner. But they also know a lot of people take photos and videos like this, so it can't be all the way at the bottom. So they moved it up. So, it's kind of splitting the difference here. And also, third-party apps will be able to plug into it if they use the camera. So this is already working with Kino, and it's supposed to start working with Snapchat pretty soon as well. And you can imagine other apps that use the camera will just decide what they wanna do with it. I was also curious, though, and I said this in that original impressions video, how cases would deal with this new button surface thing. So it turns out there's basically two options. Option number one is just a cutout in the side of the case. Just cut it out, expose it to the finger. So it's fine. That's probably what most cheap cases will do, but that also means it's no longer gonna be flush with the side of the case. But then there's option number two, which is what Apple's first-party cases do, which is putting in this little insert, which has glass and transfers the capacitance from the button outside of the case to the Camera Control of the phone itself and maintaining that flush feel. And it feels like it works pretty well. The half press still works fine, the swiping still works fine, the vibration motor transfers through. And the Beats by Dre cases also already have this. Yeah, I'm just gonna say that again real quick in case you were just phasing out for a second. There's Beats by Dre iPhone cases now. (chuckles) Like, since when does Beats make cases? Like, why does Beats make cases? I thought, I don't know, there was a theme of, like, Beats being audio products, but there's something new going on here. Maybe now they're just iPhone accessories? I don't know. But yeah, they've got a nice little Camera Control button thing on their new iPhone cases, which is nice. I kind of wish, and I'm not alone, that this was also Touch ID, but then they couldn't call it Camera Control, I guess. I wonder if that's in the future of this button. But anyway, speaking of third-party accessories, that's where dbrand stepped in to sponsor this video. So, for this sponsor segment, we're gonna be doing something a little bit different. See, screen protectors, not my favorite thing. They're kind of a chore to install, between the dust and the alignment and getting it perfect. That's a big part of why I don't use them all the time. But that's where channel sponsor dbrand comes in. They seem to believe that I can install their Prism 2.0 screen protector blindfolded. So that's what I'm gonna try to do. Instructions that I've been told are pretty simple. To just get the screen protector, get the phone, and then line it up. Which is like that. (fingers tapping) And then pull the tab like that. (plastic tab rustling) And then just swipe down the middle to press it down. Give it a couple seconds. And then that should be it. Let's see. Take this off. (installation frame clunking) And that doesn't even look like it's installed. But it is. It totally is. And it's perfect. Nice. Okay. Yeah, every Prism comes with two of these, so if you get the first one wrong, you can get a second try. But if you wanna check these out for the iPhone or any number of phones that they make for it, I'll have a link below. All right. That's been it. Thanks for watching. Catch you in the next one. Peace. (groovy hip-hop music)",
    "transcript_keywords": [
        "Camera Control",
        "Camera Control button",
        "phones",
        "phone",
        "Pro",
        "iPhone",
        "camera",
        "year",
        "Pro phones",
        "Pro Max",
        "button",
        "Pro phone versus",
        "Control",
        "Apple",
        "Control button",
        "Pro phone",
        "kind",
        "cases",
        "back",
        "bit"
    ],
    "transcript_entity_values": [
        "Pixels",
        "AI",
        "Apple",
        "the Natural Titanium iPhone 16 Pro",
        "one",
        "Desert Titanium",
        "6.1 to",
        "four",
        "the next couple of days",
        "my first week",
        "Kino",
        "6.3 inches",
        "the day",
        "third",
        "15",
        "my first couple days",
        "eight",
        "this year",
        "Pro Max",
        "SIM",
        "Geekbench 6",
        "that day",
        "USB-C",
        "first",
        "Camera Control",
        "half",
        "Dre",
        "last year's",
        "6.9 inches",
        "6.1 inches",
        "iPhone",
        "zero",
        "Pros",
        "the Camera Control",
        "the Galaxy S24 Ultra",
        "Snapchat",
        "Geekbench",
        "Action",
        "a couple seconds",
        "second",
        "6.1",
        "Apple Intelligence",
        "YouTube",
        "RAM",
        "iPhone 16 Plus",
        "Pro Max",
        "18.0",
        "A18/A18 Pro",
        "another day",
        "Instagram",
        "16",
        "two",
        "last year",
        "6.7 inches",
        "iPhones",
        "Dre iPhone"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "QUANTITY",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "GPE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "NORP",
        "PERSON"
    ]
}