{
    "id": "H3TABd_nBJU",
    "title": "NFTs and the $13B marketplace, explained",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-02-02T16:16:51Z",
    "video_url": "https://www.youtube.com/watch?v=H3TABd_nBJU",
    "category": "Science & Technology",
    "tags": [
        "nft explained",
        "what is an nft",
        "nft",
        "nfts",
        "opensea",
        "nft crypto",
        "verge",
        "nft art",
        "what is nft",
        "how to make nft",
        "snl nft",
        "nft marketplace",
        "bored ape",
        "nyan cat",
        "Paris Hilton nft",
        "cryptocurrency",
        "art",
        "non fungible",
        "blockchain",
        "non-fungible token",
        "marketplace",
        "first look",
        "hands on",
        "review",
        "technology",
        "gadgets",
        "tech",
        "latest",
        "tech news",
        "the verge"
    ],
    "views": 199803,
    "likes": 2831,
    "comments_count": 347,
    "description": "NFTs can be hard to grasp. What the heck is a non-fungible token? While most of the world grapples with understanding what they are or how they work, one company has taken the lead as the most successful NFT marketplace in the world. How did OpenSea, a company now valued at over $13B  billion!  become the defacto marketplace for buying and selling NFTs? The Verges Russell Brandom explains.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(classical music) - [Narrator] At this point, you've probably heard about NFTs. And if you haven't, you've been living under a rock. In the past year alone, they've become a cultural phenomenon. - And I want to give one to everyone in the audience. - Everyone gets an NFT? - Yes, everyone. - Everyone gets an NFT! - [Narrator] Some people hate them. Others think they're going to be the future of everything. But no matter where you fall on this divide, there's a lot to unpack here, including a booming $13 billion marketplace that's trying to become the Amazon of NFTs. But first let's get on the same page about what an NFT actually is. Essentially, an NFT is a one-of-a-kind digital file, like these here Bored Apes, but it could also be a photo or a song. - Largely they are digital files stored somewhere on the internet. - [Narrator] Mitchell Clark is a news writer at the Verge and he wrote the Verge's NFT explainer. He helped me, who until a few weeks ago knew little to nothing about NFTs, grasp the subject a little bit better. - Most of what people think of as an NFT are actually the digital files, not what the NFT actually is. So the NFT is the record on the blockchain that stores the information about that digital file, who created it, who linked it to the blockchain, and then who bought it, and who has owned it throughout its history. And that is what the actual NFT is. - Those transactions are noted on the blockchain, which is essentially a public digital ledger that records transactions on the decentralized web. The fact that all the changes are made publicly and there are so many computers working on validating them all at once makes it really difficult to hack or cheat the system. Talk to me a little bit just about some of the most ridiculous NFTs that you've seen during your reporting. - There's so many. I think the first one that I thought (sighs) was Logan Paul did trading cards of NFTs. You'll find just things that look like they were done in Paint by a child, which generally people don't buy those. Let's be clear, just because you've put an NFT up for sale doesn't mean that people are going to buy it. And then there's been the ones that are just downright offensive, like they're capitalizing on civil rights icons or artists who are now passed away. It's just like, I don't like that very much at all. - On the flip side, have there been any that you've seen and you're like, if I had a $100,000 to spend, I might actually buy that? - I don't think that there are any of the art ones that I've been particularly interested in, but I have kind of enjoyed some of the programmatic ones. - [Narrator] This includes NFTs that actually get you something a bit more tangible than just an entry on a blockchain, such as video games or even access to elite members-only clubs, and there are even more sentimental NFTs. - There was also kind of a heartwarming story of these two cryptocurrency exchange employees who got married and they had an NFT wedding ring. Their wedding ring was written to the blockchain. I thought that was cute. - [Narrator] This is all well and good, but how exactly do you give someone $69 million for a JPEG on the blockchain? While there are many marketplaces for NFTs, including Rarible or Foundation, there is one that is now valued at over $13 billion, OpenSea. - OpenSea's catch phrase for it is they want to be the Amazon of NFTs. - [Narrator] Russell Brandom is Policy Editor at the Verge. He walked me through how OpenSea became the defacto NFT marketplace and some of the growing pains that came with such tremendous growth. - The difference between OpenSea and the other ones, and I think part of what's made it so successful, is a lot of the others kind of have this art gallery model, where they have particular NFTs that they like and you go there because you want this particular type. And so it's very curated, it's very controlled. Whereas OpenSea, it's basically this is a representation of what's out there, this is everything on the blockchain. And if it's on OpenSea, you can use these special ordering tools. So everything kind of eventually migrates there and the fact that something's on there doesn't really mean anything about it. It doesn't have the OpenSea stamp of approval. It's just the easiest place to buy and sell. This is really the appealing thing about it is maybe investing in NFTs themselves is kind of like making the speculative bet, but they're the casino, they're the place where all of these bets are happening. And the fact that there are a lot of bets happening right now, that's just a very good position to be in. - Yeah and of course the house always wins. - Right, right, yeah. - [Narrator] But with OpenSea's growth came some bumps. Since its inception, there have been a lot of issues, ranging from security flaws to scams to users allegedly purchasing their own NFTs to artificially inflate their value. - It's hard to put the insecurity on OpenSea specifically, but you get a lot of these situations where it's a totally unregulated marketplace. There are lots of new things that people are finding out how to do. I don't know if that's a security problem exactly, but it's a moderation issue in this very chaotic marketplace that, because OpenSea is kind of the broker of record, they end up at the center of. - [Narrator] Growing pains aside, investors are betting on OpenSea moving beyond hyped up pictures of Bored Apes, although Russell isn't too sure. - Put it this way, I think for any specific use case, the case for NFTs is pretty weak for me. I'm not convinced that it'll take off in this particular area. But then there's this other will it take off for something? Will we find some reason or some thing that this stuff is useful for? I'm sort of a little bit more credulous on that, where it's like, okay, all these people that are looking for something that this will be good for and there's a ton of hype and a ton of energy, so hopefully they find something at some point. Which I don't know if I want to bet on that, but it's at least plausible to me. - But regardless of what NFTs could actually be good for in the future, we might continue to see people splurging on digital goods for months or years to come. Do you think it had anything to do with the pandemic and people just being stuck at home and just not spending their money on normal other things that they normally would have been spending it on? - It's very possible. Another kind of angle to it is that they were being pitched and sometimes thrown out by some people as an investment. And everyone had a rough 2020 and we're all trying to get to a better place and if there's some possible way that we can do that using this NFT, we buy an NFT and we can flip it in four months for so much money, what if we could sell a million-dollar NFT? That would be life-changing for almost everyone. So it might be a little bit of, wow, this is an interesting thing coming along that's kind of hard to understand technically, so you can get caught up in the sales pitch of it. And then also kind of the gambling aspect of this thing could soon be worth millions of dollars if you're lucky, and for some people it has worked out that way, which only throws more fuel on the fire. - With you, Russell. I assume the answer is going to be no, but are there any NFTs that you've seen where you've actually said, yeah, this could actually be like kind of fun to own? - No. No.",
    "transcript_keywords": [
        "NFTs",
        "NFT",
        "OpenSea",
        "kind",
        "people",
        "blockchain",
        "Verge NFT",
        "digital",
        "Verge NFT explainer",
        "lot",
        "bit",
        "buy",
        "Bored Apes",
        "NFT marketplace",
        "Verge",
        "thing",
        "marketplace",
        "good",
        "Amazon of NFTs",
        "NFT wedding"
    ],
    "transcript_entity_values": [
        "Russell",
        "over $13 billion",
        "a few weeks ago",
        "one",
        "100,000",
        "Foundation",
        "four months",
        "million-dollar",
        "OpenSea",
        "Verge",
        "millions of dollars",
        "NFT",
        "$13 billion",
        "Rarible",
        "Russell Brandom",
        "2020",
        "JPEG",
        "Mitchell Clark",
        "months or years",
        "two",
        "the past year",
        "Amazon",
        "Logan Paul",
        "first",
        "$69 million",
        "OpenSea. - OpenSea's",
        "Bored Apes",
        "a ton"
    ],
    "transcript_entity_types": [
        "PERSON",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY"
    ]
}