{
    "id": "H56t8nBw4zw",
    "title": "I'm no longer upset - OnePlus 8 Pro Unboxing & First Impressions",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-04-14T19:38:40Z",
    "video_url": "https://www.youtube.com/watch?v=H56t8nBw4zw",
    "category": "People & Blogs",
    "tags": [
        "OnePlus",
        "8 Pro",
        "HDR",
        "Hole Punch Camera",
        "Selfie",
        "High refresh display",
        "Curved Screen",
        "Video",
        "Snapdragon",
        "4K",
        "60 FPS",
        "120 Hz",
        "90 Hz",
        "Wireless Charging",
        "30W",
        "Power",
        "Performance",
        "Affordable",
        "DDR5"
    ],
    "views": 498439,
    "likes": 17445,
    "comments_count": 974,
    "description": "Finally, OnePlus released the Pro version of their phones in our region and we're able to unbox it today!  Check out the OnePlux 8 Pro at   Buy OnePlus Smartphones On Amazon (Paid Link):      On NewEgg (Paid Link):    On BHPhoto (Paid Link):      Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:   Twitter:  Instagram:  Facebook:",
    "description_links": [
        "https://lmg.gg/c5VZN",
        "https://geni.us/allJJ",
        "https://geni.us/A5BP",
        "https://geni.us/ZYfbcCW",
        "http://www.LTTStore.com",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- This is the closest you guys are ever gonna get, to the real unboxing experience for me, because I know basically nothing about the device that's inside here. Other than that, it is the OnePlus 8 Pro, and I'm actually pretty jazzed this time around. I was a little upset with OnePlus last time, when they only launched the OnePlus 7, and not the OnePlus 7 Pro, in my region. Here I've got a couple of options for bumper cases. This guy right here, is equipped with the Snapdragon 865 SoC, with 8 to 12 gigs of LPDDR5 memory, so I'm expecting this to be snappier than any OnePlus device that we have ever seen before, and, more importantly, it's got a 120 hertz display, along with a 4510 milliamp hour battery. Now, when I say I don't know anything about it, I don't mean that I don't know what the specs are supposed to be. I know that it's got quad cameras, amoled display, but what I didn't know, was what it was going to look like, I hadn't paid attention to any of the leaks for this thing, and man, every time, these guys just do, such a great job of the looks of their phones. Don't they ladies and gentlemen? I also didn't know, that it was not going to have their pop-up selfie camera. I have to confess, I am a little bit disappointed to see the hole punch display up there. So, we've got our volume rocker over on the left-hand side here, SIM tray on the bottom, along with a Type-C port. That supports their Warp 30T charging, which gives you, I think it's, about 26 minutes, half of your battery life. Got a speaker grill down there. The four cameras I mentioned before, with quite a pronounced camera bump. On the top you've got nothing, so there's no headphone jack, we've got their 3-way switch right here, ring, vibrate, and silent, super nice to have. My son actually rocks a OnePlus phone as his daily driver, he uses this all the time, because he takes it to school, and this is a lot easier than trying to fumble around with the buttons. And then finally, you've got your lock button over here. Let's go ahead and get this puppy set up. I'm going to have a look at what else is included in the box. Got a nice little, clear bumper case, that'll take care of your camera bump for you, I guess. One of OnePlus's classic white and red charging cables, and another OnePlus staple, is an included Warp Charger. One of the most exciting things about the OnePlus 8 Pro though, is not the phone itself, so this is an accessory that is not included in the box, but that you can get, and this is the OnePlus Warp Charge 30 wireless charger. They're high-speed is coming to wireless, for the first time. This puppy can handle up to 30 watts, giving you, I think it's, half of your battery life, in about 30 minutes. Is that a cooling vent back there? I would say that, I don't know, that may actually be possible, yeah it does appear that they have got a vent back here, cause that would kinda solve the problem wouldn't it? If you just put a cooling fan in your wireless charger. That takes away a lot of my concerns about wireless charging. Feels great in the hand, reminds me a lot of the Galaxy S8 series. I think some people are gonna be disappointed to see such a significant curve to the front glass here, it's the kind of thing that I could easily switch back to, and it wouldn't bother me in the slightest. Making a return, is OnePlus's super fast in-screen fingerprint sensor, at least I'm expecting it to be fast, cause that's kinda their jam. So, dynamic wallpapers are included with the Android 10 that ships with the OnePlus 8 Pro. They went straight to 120 hertz, in fact they've completely skipped 90. It's going to be 60, or 120. I will say, there's a sorta point of diminishing returns, once you start to increase refresh rate, but, what is really cool about this one, is that they're allowing you to run 120 hertz with QHD+ resolution, that's something Samsung does not allow on the S20 Ultra. The best guess I have for that would be, because they're not confident in the battery life of the device, running at the full 120 hertz at full res. Full res 120 hertz, man, that is butter smooth, it's the kinda thing you get, unfortunately I can't easily show you guys on camera, but it really is something else. Aside from the higher refresh rate of the display, it's supposed to be their most color accurate display yet, with HDR10+ support, so I'm expecting the movie watching experience on this phone to be out of this world. Comes pre-loaded with Netflix, so, they expect people to go ahead and get right on that, apparently. HDR is working immediately, which is really nice to see. All right, expectations met, and they've got the correct behavior for the display notch here, so they're not just kind of stickin it through the image that I'm trying to look at. One of the other big technologies they're pushing on this phone, is like a frame interpolation technology, that's supposed to make sports better to watch, so, pretty similar to what you see full-sized TVs. This is a pretty good experience for trying to be outside, watching HDR content on a phone. I'm gonna play around with the camera a little bit. Wow! It is, pumping those reds. Okay it looks like after processing the image, it tones things down a little bit. Video is somewhere where Android phones tend to struggle in general. Interesting, there's support for up to 4K 60fps, but it actually chooses 4K 30 as the default video recording resolution. My initial camera impressions are pretty good, they're not over saturating things, so in, sort of, OnePlus fashion, what you see, is pretty much what you get. Stabilization on that 3x optical zoom actually looks pretty good. Ultra wide is definitely noticeably not as nice of a sensor as the others. General phone snappiness as you would expect from a OnePlus device, is awesome. - [On Phone] This! 100 of their-- - They're a little harsh sounding at full volume, but they're really loud, wow. - [On Phone] Sound system, that you guys have ever seen, these things have got-- - Like that's louder than me talking loud at the camera, trying to project. - [On Phone] Water resistant, they last for 12 hours-- - And this has been fun, but I think that's about it for the first impressions, guys. It's looking pretty promising, the only thing holding me back at this point, and I know I sound like a broken record, is the headphone jack, other than that, I mean, compared to Samsung's flagships, which all have like hole punched displays now too, I'd really hoped that there wouldn't be a hole punch, but, its not like they have disadvantage compared to anything else I'd consider to be usable, and unlike a lot of the other brands out there, I know people say Huawei's cameras are great, that has not been my experience, I do like OnePlus's approach to their processing, so, it's a contender, it's a contender. Make sure you subscribe to Short Circuit, contender for your, you know, technology video needs.",
    "transcript_keywords": [
        "OnePlus",
        "real unboxing experience",
        "real unboxing",
        "camera",
        "pretty",
        "Pro",
        "phone",
        "display",
        "OnePlus Warp Charge",
        "time",
        "guys",
        "kind",
        "OnePlus device",
        "hertz",
        "thing",
        "things",
        "Warp",
        "battery",
        "OnePlus Warp",
        "included"
    ],
    "transcript_entity_values": [
        "3",
        "half",
        "up to 4",
        "4510 milliamp hour",
        "OnePlus",
        "One",
        "OnePlus",
        "8",
        "60",
        "4",
        "90",
        "about 26 minutes",
        "the OnePlus 7",
        "100",
        "Huawei",
        "about 30 minutes",
        "the OnePlus Warp",
        "Samsung",
        "daily",
        "first",
        "Netflix",
        "120",
        "Android",
        "3x",
        "30 watts",
        "four",
        "30",
        "Short Circuit",
        "12",
        "OnePlus 8 Pro",
        "jack",
        "HDR",
        "Warp 30",
        "Warp Charger"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "EVENT",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PRODUCT"
    ]
}