{
    "id": "H5EwXUmsLow",
    "title": "Bluetooth Star Trek Communicator Review: A Trekkie's Dream Come True",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-06-24T16:00:20Z",
    "video_url": "https://www.youtube.com/watch?v=H5EwXUmsLow",
    "category": "People & Blogs",
    "tags": [
        "star trek communicator",
        "star trek bluetooth",
        "bluetooth communicator",
        "the wand company",
        "wand communicator",
        "star trek tos",
        "star trek",
        "mrmobile",
        "captain2phones",
        "michael fisher",
        "pocketnow",
        "android authority",
        "android central",
        "communicator",
        "star",
        "trek",
        "bluetooth",
        "star trek (fictional universe)",
        "oneplus 3",
        "mobile nations"
    ],
    "views": 273066,
    "likes": 7596,
    "comments_count": 468,
    "description": "Star Trek has brought us some of the coolest gadgets seen on TV  the most iconic of which is the Communicator. Various toy replicas have cropped up over the years to let every kid play Captain Kirk, but it took Star Treks 50th anniversary (and a company obsessed with detail) to bring a working Communicator to the mainstream. Join MrMobile, a.k.a. Michael Fisher, for an in-depth review of the brand-new Star Trek Bluetooth Communicator by The Wand Company!   [SUBSCRIBE]     BUY IT: You can pick up a Star Trek Bluetooth Communicator of your own here:    ABOUT THIS REVIEW: This video was published after 11 days of usage on a demo device provided by The Wand Company. It was tested with a OnePlus 3 and iPhone 6S.    SOCIALIZE:         MUSIC: \"Fashionista\" by Olive Musique, available at Premium Beat:    DISCLOSURE: This post may contain affiliate links. See our disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://phon.es/38tja",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] The original Star Trek series from the 1960s brought us some of the most iconic gadgets ever seen on TV, the coolest of which, in my opinion, is the communicator. Various toy replicas have cropped up over the years to let every kid play Captain Kirk and Nokia even built a few lookalike smartphones in 2008, but it took Star Trek's 50th anniversary and a company obsessed with detail to bring a working communicator to the mainstream. I'm Michael Fisher, and this is the Mr. Mobile review of the Bluetooth by The Wand Company. (electronic music) Before we make our first phone call, you need to understand just how much care went into building this replica. The cheesy holograms, chintzy plastics and bad proportions of older toys are gone, replaced by stamped aluminum and electroplated steel. The dimensions of the ABS chassis are unassailable. They come from a 3D laser scan of one of the original props used on the show. Even the grain of the casing material gets close to replicating 1960s era Kydex. Flip it open to see a screen-accurate mesh texture on the microphone and meticulous reproductions of the original Swarovski crystals over the indicator lights. They're plastic, but they look great. The animated moire over the speaker uses the same simple optical illusion produced for the show, except here, the spinning disk is driven by a tiny electric motor instead of a stopwatch. The communicator is presented beautifully in a stylized case alongside a wireless charging dock and a soft carrying pouch, all of it decorated with Starfleet branding, circa 2265. The only major inaccuracy on the prop is the government-mandated license plate, and even here, Wand has snuck in a couple Easter eggs to soften the blow. Before today, this level of quality would have run you hundreds of dollars, just for a static replica, but this communicator actually communicates. Pair it to any Bluetooth enabled phone and any call you make will be routed through it. The first day I had it, I took it on a walk across town for a half hour phone conversation, and while the other party said they could hear the sound of passing cars and the occasional gust of wind, the background noise wasn't bad enough to prevent me from being understood. On my end, the communicator speaker was loud enough, but just barely. If I have one gripe about the communicator, this is it. In a world where relatively thin smartphones can kick out some super loud sound from their speakers, I expected more oomph from a handheld this beefy. That said, if you confine your conversations to your quarters, it'll do you just fine. And you should be able to talk for a while too. I usually got at least two days of moderate to heavy use between recharges. It's impressive how much functionality Wand crammed into a device with no display, no companion app and only two buttons. The right hand knob hides a five way jog switch. Short clicks trigger memorable phrases from the show. - [Communicator] Scotty here, Captain. - [Michael] While long presses up or down control volume and side clicks let you skip tracks in your music player. The buttons can also be used to answer calls, but as with the old clam shell cellphones, it's much more fun to flip to answer and to hang up. And you don't have to stick to boring old voice calls either. If you use the communicator with an Android device or iPhone pressing the right button triggers the voice interface and I was surprised to discover just how much I could do without ever touching my phone. Is Boston Burger Company open right now? Note to self, get more dilithium. Wake me up at 7:45 AM. What's the forecast for tomorrow? Read me my text messages. Play Pinback on Spotify. - [Communicator] The Boston Burger Company is open until eleven PM. Saving note using Evernote. Setting your alarm. You've got several text messages. Here are the five most recent. (soft music playing) - [Michael] Alright, let's come back to Earth for a sec. Carrying a second device to do all that is much less convenient than just pulling out your phone to do the same thing, I know. And also, this isn't like a 4G smart watch that lets you leave your smartphone at home. To use the communicator's more advanced features, you need to have your phone on you and you need a fairly quiet environment to be able to hear and be heard. With a price tag of 150 bucks, those limitations will give mainstream buyers pause and rightfully so. But then, of course, the communicator isn't for them. It's for the hardcore Star Trek nerd who's wanted a working communicator his or her whole life. And Wand hasn't just delivered on that dream. It's raised the bar for every novelty gadget maker out there by creating a nearly museum quality replica in the process. If you're a Trek fan like me, you won't regret laying down some latinum for the Wand communicator. And even if you're not, you've gotta admit, it's a very cool reminder that we're finally living in the future. Mr. Mobile, out. (electronic music)",
    "transcript_keywords": [
        "Star Trek series",
        "Star Trek",
        "original Star Trek",
        "communicator",
        "Boston Burger Company",
        "hardcore Star Trek",
        "Star Trek nerd",
        "Kirk and Nokia",
        "Star",
        "original Star",
        "Wand",
        "Trek series",
        "play Captain Kirk",
        "phone",
        "Burger Company",
        "Michael Fisher",
        "Wand communicator",
        "Captain Kirk",
        "Trek",
        "company"
    ],
    "transcript_entity_values": [
        "Evernote",
        "Easter",
        "sec",
        "Michael Fisher",
        "150 bucks",
        "tomorrow",
        "7:45 AM",
        "eleven PM",
        "the years",
        "The Boston Burger Company",
        "2008",
        "the 1960s",
        "Mobile",
        "Trek",
        "today",
        "at least two days",
        "first",
        "The Wand Company",
        "five",
        "Kirk",
        "Star Trek",
        "Michael",
        "4",
        "Earth",
        "Michael] Alright",
        "Boston Burger Company",
        "Nokia",
        "second",
        "The first day",
        "hundreds of dollars",
        "Starfleet",
        "1960s",
        "only two",
        "Star Trek's",
        "Spotify",
        "Wand",
        "Kydex",
        "one",
        "Android",
        "50th",
        "Swarovski",
        "a half hour"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "GPE",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "TIME",
        "TIME",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "LOC",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "DATE",
        "MONEY",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "TIME"
    ]
}