{
    "id": "h9CmdPt30v8",
    "title": "AMD and Intel Chipset Names Explained",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2022-02-01T19:01:11Z",
    "video_url": "https://www.youtube.com/watch?v=h9CmdPt30v8",
    "category": "Science & Technology",
    "tags": [],
    "views": 514721,
    "likes": 30485,
    "comments_count": 570,
    "description": "Check out AMP by CubeCoders at   Confused by all those random letter/number combos AMD and Intel use to describe their chipsets? Don't be - we explain it all in this video.  Leave a reply with your requests for future episodes, or tweet them here:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:",
    "description_links": [
        "https://www.cubecoders.com/AMP/TQ",
        "https://twitter.com/jmart604",
        "https://lttstore.com",
        "https://lmg.gg/tqsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech"
    ],
    "transcript": "- B550, X370, Z690, F150. If you're shopping for a motherboard... (laughs) If you're shopping for a motherboard and you wanna make sure it has features that are bit more substantial than the tacky heat sink and tons of RGB, you should pay close attention to these names because they tell you what chipset the motherboard has. Which is a chip that determines which CPUs you can use? How many ports in PCI Express slots your system supports? And whether you can overclock? Vroom, vroom, you know what I mean? (laughs) But Intel and AMD each use their own cryptic series of letters and numbers to designate what kind of chipset a board has, kind of like they do with their CPUs. So today, let's decode what these chipset names mean for consumer motherboards, starting on the Intel side. Intel chipset names consist of a letter followed by three numbers. Let's start with that letter. Currently, Intel uses one of four letters for normal desktop chipsets: H, B, Q, and Z. Hubba kazoo. If you wanna overclock, make sure to get yourself a Z chipset. These are the only ones that allow multiplier overclocking on your CPU. Other chipsets will limit you to only adjusting the base clock, even if you buy an unlocked K-Series CPU. Z chipsets also usually feature more connectivity than cheaper options, so you get the most PCI Express lanes that Intel platforms offer, as well as more and/or faster USB ports than you do down the product stack. H, B, and Q chipsets are all different varieties of budget or mainstream skews. They don't support multiplier overclocking, but mid-range options often allow you to at least overclock your RAM at the very least. Q chipsets support remote management and have enhanced security for businesses. But if you're just a home user looking to save some money, you'll probably end up with an H or B chipset, which are virtually the same thing these days, which is why differentiating them requires us to explain what those numbers mean. The first number tells you what generation the chipset is. Alder Lake CPUs use 600 series chipsets. 500 series is for Rocket Lake. And 400 series is for Comet Lake, with lower numbers corresponding to older generations. Remember, though, that a BIOS update can sometimes make a newer CPU work with an older chipset. The third number is always a zero, but the second number is what's going to tell you important information about the chipset's features compared to others within that generation. If the second number is a one you're getting the lowest end chipset in that generation, such as the H510 or the H610. You get no RAM overclocking, only two memory slots, fewer USB and SATA ports, and no support for Optane or RAID. It sucks. Higher numbers like a six or seven mean it's a mid-range chipset with RAM overclocking, four memory slots, extra USB and SATA ports and Optane and RAID support. I mean, Optane guys. (laughs) We love it. But what about AMD motherboards? We'll tell you about their naming right after we thank Cube Coders for sponsoring this video. AMP by Cube Coders is a self-hosted game server management panel for Windows and Linux that focuses on ease of use and a highly refined user experience. It supports dozens of games, including Valheim, Minecraft and more. Plus, it's super easy to install with no command-line knowledge required. Like on Linux, it is installed with literally a single command that takes care of everything. There are no monthly fees for the standard additions, and it starts at just 10 USD as a one-time cost with free lifetime updates. Learn more at cubecoders.com/AMP/TQ. So AMD motherboards use a similar letter followed by three numbers, scheme. Though, the way they're named is different. AMD only uses three letters, A, B and X. Abax. If you want CPU multiplier overclocking, go for a B or an X chipset. As the cheaper A chipsets are the only ones that don't support it. X chipsets also give you the most and the fastest USB and SATA ports with B giving you fewer and A the least. If, for some reason, you're still using CrossFire or SLI, A series chipsets also don't support CrossFire. And if you want SLI, you'll need to specifically, buy an X chipset. This is also a good time to mention that if you're using the newer NVLink, you don't need a specific chipset. Just two PCIe x16 slots, which you can find on most ATX or Micro-ATX motherboards. Fortunately, AMD's numbering scheme is a bit simpler than Intel's, but it can be a little confusing in its own way. The only number that really matters here is the first, as this tells you, which generation of processor is compatible with the chipset. First-generation Zen, so your Ryzen 1000 and 2000 chips used 300 and 400 series chipsets. Second-gen or Ryzen 3000 used 400 and 500 series chipsets. And Zen 3 or Ryzen 5,000 used 500 series only. Though Zen 3 can use an older chipset too with an appropriate BIOS update. The other two numbers currently don't really mean anything. A series chipsets always end in 20, B series in 50, and X series in 70. It's almost like they just added these numbers in to make the names closer to Intel's. Why would they do that? But with Zen 4 coming out later this year and a whole new CPU socket to boot, we'll do a follow-up episode if AMD decides to change its naming schemes. So there you go. Hopefully, we've demystified the alphabet soup of chipset names for you. Now, if you'll excuse me, I have a sudden hankering for some Campbell's. That's it for this video, guys. Thanks for watching. Like the video, if you liked it. Dislike it If you disliked it. Check out our other videos and comment below with video suggestions. Oh, and don't forget to subscribe and follow. (laughs) You almost missed it. Good thing I caught you.",
    "transcript_keywords": [
        "chipset",
        "chipsets",
        "Intel",
        "series",
        "series chipsets",
        "AMD",
        "numbers",
        "CPU",
        "USB and SATA",
        "PCI Express",
        "support",
        "USB",
        "number",
        "SATA ports",
        "Zen",
        "AMD motherboards",
        "CPUs",
        "ports",
        "overclocking",
        "SATA"
    ],
    "transcript_entity_values": [
        "3",
        "Optane",
        "seven",
        "Intel",
        "three",
        "CrossFire",
        "RAM",
        "Micro-ATX",
        "one",
        "USB",
        "Campbell",
        "70",
        "later this year",
        "Minecraft",
        "K-Series",
        "ATX",
        "second",
        "SLI",
        "600",
        "Z. Hubba kazoo",
        "monthly",
        "PCIe x16",
        "F150",
        "Linux",
        "X. Abax",
        "300",
        "Valheim",
        "third",
        "Second",
        "Ryzen 5,000",
        "50",
        "X370",
        "first",
        "AMD",
        "Comet Lake",
        "these days",
        "PCI Express",
        "H510",
        "two",
        "four",
        "400",
        "Cube Coders",
        "500",
        "dozens",
        "Rocket Lake",
        "only two",
        "SATA",
        "RGB",
        "Ryzen 3000",
        "Alder Lake",
        "CPU",
        "six",
        "Just two",
        "Z690",
        "NVLink",
        "20",
        "today",
        "zero",
        "2000",
        "H610"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "GPE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "LOC",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "ORG",
        "ORG",
        "FAC",
        "GPE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}