{
    "id": "H9YehsIaILc",
    "title": "Trying the Tesla Model 3",
    "channel": "Austin Evans",
    "channel_id": "UCXGgrKt94gR6lmN4aN3mYTg",
    "subscriber_count": 5580000,
    "upload_date": "2017-07-29T11:46:41Z",
    "video_url": "https://www.youtube.com/watch?v=H9YehsIaILc",
    "category": "Science & Technology",
    "tags": [
        "tesla",
        "model 3",
        "tesla model 3",
        "model 3 tesla",
        "tesla model s",
        "model s",
        "tesla motors",
        "mkbhd",
        "marques brownlee",
        "electric car",
        "car",
        "tech",
        "austin evans"
    ],
    "views": 1736863,
    "likes": 30280,
    "comments_count": 2735,
    "description": "Test driving the 2017 Tesla Model 3 with MKBHD! Inside the Future of Cars:  Check out Marques and Dan:     Subscribe!  Instagram:  Twitter:  Facebook:",
    "description_links": [
        "https://www.youtube.com/watch?v=8jQQ2r7d07I",
        "https://www.youtube.com/MKBHD",
        "https://www.youtube.com/whatsinside",
        "http://www.youtube.com/austinevans",
        "http://instagram.com/austinnotduncan",
        "http://twitter.com/austinnotduncan",
        "https://www.facebook.com/austinnotduncan"
    ],
    "transcript": "- So, I'm officially Ken-less and on my own. But, it's time to drive the Model 3. Hey guys, this is Austin. The Tesla Model 3 is a big deal. So, this promises to be one of the first mass market electric cars and I spent tonight at the launch event here in Fremont. First of all, huge shout out to Dan. He's the only reason I'm actually here right now, 'cause he gave me a call like a few days ago, he's like, \"Yo, do you want to come \"and check out the Model 3 event?\" - I needed somebody that has a good tech background. - And somebody who can vlog? - Somebody that can vlog, that's a good hand, holding that. - [Austin] It's easy to forget just how big of a deal this is. So, unlike something like the Model S, which starts at around $70,000, you can pick up a Model 3 for about $35,000. And that's before the tax breaks which can bring it down even cheaper. They announced two models today. The Standard, as well as a Long Range option. So, the Standard model will get you about 220 miles of range, where the Long Range gives you a pretty impressive 310 miles. So, what's interesting is, they're no longer branding it just like the Model S with the actual kilowatt hours, but most people are guessing that the base model is going to be around 50 kilowatt hours and about 70 for the Long Range, quite a bit smaller than the Model S, but this is also a smaller and lighter car. - 'Cause like Model S, is already and Tesla's made it clear, a superior car. So, there's almost no reason for someone to go from a Model S to a Model 3. - Right, the Model 3 is the lower end, entry level version. - It's the entry level for people who wanted a Model S couldn't quite get there, but now have this $35,000 option. - It does however look very, very similar to the Model S. Personally, I like the look. It's sort of like a mix between a shrunken Model S, mixed with a little bit of Porsche Panamera. It's a little bit awkward in photos and even video doesn't totally do it justice, but in person, I've got to say, especially from the rear sort of three quarter view, it is a really nice looking car. I only wish it was maybe dropped like an inch or so, but we'll see. Inside things are fairly basic. So, my test drive was about 10 o'clock at night, so, it was kind of hard to see everything. But one thing you can very easily see, is the fact that the dash is basically just a single 15 inch screen. Now, don't get me wrong, it's a nice looking display and you do get pretty much all the information, like your speedometer, you get your nav, all your climate controls but that's pretty much it. There is no speedometer or anything in front of the driver. Now on stage, Elon was talking about the idea that as things become more and more autonomous, that it doesn't really matter if you're actually looking at all your gauges and stuff because the car will be driving itself. But as of right now, I'm not so sure how well that's going work. You got to drive the Model? - I did. - I unfortunately just got a ride. What'd you think? - I really liked it. I got really used to comparing all these cars I've been trying the last couple months to my car and they're all super different. - Yeah. - Model 3, I've sat in it and it felt like a Tesla. It felt very familiar. - It is so quiet, I feel like it's quieter than the Model S and the Model S is super, super silent. - They're both very quiet and these have smaller wheels so the rides a little smoother, a little quieter. - Yeah. - Yeah. - I unfortunately did 19 miles an hour in my test drive, so. - I think I hit 65? - So you drove it? - I drove it. - It's obviously not as fast as the Model S. - Right, it's not as quick but like, the weird thing is, when you stomp on that pedal, you still get that lurch forward, that immediate torque of an electric car, because it's electric, that's the benefit you get. So, it still feels quick. - [Austin] We don't have an exact spec on how much power it provides, but essentially they're quoting somewhere between 5.2 to 5.6 seconds to 60, which is quick. At launch, they're only selling two wheel drive cars but in the not too distance future, you should be able to get a dual motor car with all wheel drive, which I would assume is going to be a lot faster. However, don't expect this to be able to out run a Model S anytime soon. That is still going to be over the double the price and I'm sure that they do not want it to get too close. The Model 3 does support autopilot, just like the Model S as well as the Model X, which means that essentially right now, it can drive itself on the highway. But in the future, you should be able to upgrade it to nearly fully autonomous experience. They weren't showing off autopilot tonight and the full autonomous version is definitely going to be a little ways out. But in theory, a Model 3 that you buy today has all the hardware that you need that you can drive from point-to-point without even having to touch any of the controls. - Sitting behind the wheel you see more. Like the nose gets down and out of the way. Where in Model S, the nose is very much in your frontal peripheral. - And this is way smaller than a Model S, way smaller. - It feels like 25% smaller on the outside. But on the inside, - It's not so bad - It's not that bad. - Not that bad. - Not so bad. - [Austin] I only got to spend a little bit of time with the Model 3 tonight, but they are well on the way to shipping them. So, Elon Musk claims that they're going to be shipping about 20,000 Model 3s a month by the end of the year. So, if you've got that pre-order in, they're actually going to be coming fairly soon. So, what do you guys think about the Tesla Model 3? Let me know in the comments below and I will catch you in the next one.",
    "transcript_keywords": [
        "Model",
        "officially Kenless",
        "Tesla Model",
        "Long Range",
        "Standard model",
        "drive",
        "car",
        "Kenless",
        "Tesla",
        "Range",
        "smaller",
        "drive the Model",
        "models today",
        "Long",
        "base model",
        "shrunken Model",
        "models",
        "bit",
        "Long Range option",
        "cars"
    ],
    "transcript_entity_values": [
        "Model 3",
        "about 20,000",
        "65",
        "the Model S",
        "Model S",
        "three quarter",
        "the Model S",
        "15 inch",
        "about 220 miles",
        "first",
        "the Model S",
        "Model S",
        "Long Range",
        "Ken",
        "Austin",
        "Elon",
        "19 miles",
        "two",
        "around $70,000",
        "Tesla",
        "35,000",
        "Dan",
        "310 miles",
        "one",
        "Fremont",
        "the Long Range",
        "Porsche",
        "between 5.2 to 5.6 seconds",
        "the last couple months",
        "about $35,000",
        "Model",
        "the Model S. - Right",
        "Panamera",
        "the Model S.",
        "Elon Musk",
        "about 70",
        "25%",
        "a single",
        "a few days ago",
        "Yo",
        "the end of the year",
        "about 10 o'clock at night",
        "tonight",
        "around 50 kilowatt hours",
        "today",
        "First",
        "Standard"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "FAC",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "LOC",
        "LOC",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "MONEY",
        "PRODUCT",
        "FAC",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "QUANTITY",
        "DATE",
        "PERSON",
        "DATE",
        "TIME",
        "TIME",
        "TIME",
        "DATE",
        "ORDINAL",
        "ORG"
    ]
}