{
    "id": "h_-hCzh2N24",
    "title": "I couldn't WAIT to unbox this - Segway Ninebot Gokart PRO",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-10T19:31:52Z",
    "video_url": "https://www.youtube.com/watch?v=h_-hCzh2N24",
    "category": "Science & Technology",
    "tags": [
        "Ninebot",
        "Segway",
        "Electric",
        "GoKart",
        "Go Kart",
        "go-kart",
        "drift",
        "Linus",
        "Unboxing",
        "fun",
        "track",
        "sport",
        "driftable",
        "drifting"
    ],
    "views": 1233252,
    "likes": 59950,
    "comments_count": 2521,
    "description": "Head to  and activate Honey for free to start saving today! Thanks to Honey for sponsoring this video.  So four electric Gokarts from Segway Ninebot showed up at our warehouse for an upcoming Channel Super Fun, but I couldn't wait to try it. Also, it's built for drifting!  Check out the Segway Ninebot Gokart PRO at  (no longer on sale)  Buy DJI Osmo Action Camera On Amazon (PAID LINK):  On Best Buy (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Purchases made through some store links may provide some compensation to Linus Media Group.  Timestamps:  0:00 - Sweet GoKart spin-out 0:06 - Unpacking and introduction 3:16 - Assembly and product highlights 6:00 - Smartphone App setup 6:29 - Linus forgets the most important item 6:41 - Sponsor - Honey! 7:10 - Test drive 10:01 - Linus learns how to drift 10:44 - Ending  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://joinhoney.com/shortcircuit",
        "https://lmg.gg/cbo49",
        "https://geni.us/OMn8vjv",
        "https://geni.us/QckYeL",
        "https://geni.us/lmIJE",
        "https://geni.us/AFXJ1Kr",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(engine roaring) (screaming) - Andy are you seeing this? Not one, but four of the Ninebot go-kart pro these things will do 37 kilometers an hour. They will go 25 clicks on a charge. They actually disassemble into a Ninebot S max like mobility scooter magic thing. Aaaah! Get out of my way! I'm trynna open it! Aw! That really hurt Ninebot sent us four of these for our channel super fun but rather than wait for the channel super fun. I figured I just, I just can't wait. So we better do a short circuit opening one of these puppies up. I am so stoked right now. This is basically exactly what I have wanted to like tool around with my kids. I even went as far as modifying like an old power wheels thing with a better motor, better battery, all that kind of stuff. But I mean, realistically, these are track freaking ready and you can, wow, this is really heavy. There is nothing that would prevent you from just like ripping around the neighborhood. I mean, other than laws, I guess, John can I get a hand gross weight about 150 pounds and it can carry a rider up to 220 pounds. You good? Oh my God. (screaming) I've actually looked into purchasing go-karts before but it's a little challenging because a lot of places will only sell to like go-kart facilities and stuff like that. I have no idea what Ninebot's policy is, but anyway we managed to get our hands on some Whoaaa, (laughing) Get out of my way. If you were wondering whether this thing is serious business. Okay. Age 14 plus for the go-kart and the S max that's interesting 16 to 60. You don't want senior citizens on that thing. And they're like, yeah, okay. Correct dress code, ladies and gentlemen, flat shoes. And honest though they didn't say anything about socks and sandals. So it seems like I'm all right. Two grand on sale for 1600. Okay. Ooh, Oh my God! It has one of those cute little flags. I need it (laughing) Oh wow! There's, there's some accessories. Okay, this is hilarious. Hey, they come with a Bluetooth speaker that can either be used to listen to music while you're ripping around or can be used to simulate different types of engine noises. Wow, the charger is actually a little less intense than I expected. Okay cool. Okay this is part of the assembly into the scooter thing, self-balancing thing It comes way more assembled than I could have possibly hoped. This thing is gonna be ready to rip in like basically fricking no time. (paper rustling) Boohoo, this is not gonna be as quick as I might've hoped (speaking in foreign language) Okay. Get, get, get over here, Andy? Come on. You gotta be as excited about these as I am. If not more so. Okay, we just gotta, just gotta (grunting) get that thing out. Woooooo! Now these things don't have any kind of suspension to speak of but what they do have is what looks like a fairly if nothing else, modifiable wheel housing here that perhaps could be used to put like kinda, you know fatter, juicier tires on the actually that's not bad. Oh my God, what just happened? Did I break it yet? Oh, okay. This is for adjustment. You can adjust the length of it depending on the length of your rider. So you can do everything from four and a half feet. I think it is up to like six foot something. These things are apparently drift monsters. So should be yeah, they they're extremely slick. So these should be a ton of fun to, Oh, hi how are you doing? Wow that really whooooaa! That hugs the hips boys. (metal clanking) Hopefully this like locks in placement. Okay let let's look at the documentation. Step one. Find the Allen key. We're gonna be riding with adults. So I get the feeling that we're just gonna go straight to the max. You know what I mean? Like (man screaming) But just, you know, to the max, (gentle music) Look, it's hard. I don't don't get it. Six AA fricking batteries in it. The heck is that for I'm (indistinct) about a thousand horsepower but apparently it has 90 Newton meters of torque. And that's about 76 freedom pounds. Is that right? 70 freedom pounds. Sorry. One G of acceleration. - That's that's pretty crazy. And they claim it offers performance that is on par with 150 cc Go-karts. Activate? Install the app? I just wanna go-kart. Oh hold pull the handbrake. Oh, it has a handbrake. (metal clanking) Cool. Walking me through the guide and everything. It's got some you know, real important tips in here now it says step on the pedal to go for.. It's apparently on When they go-kart has stopped double press the brake to switch to reverse mode. Okay and here it is. We've got 17 kilometers of range. That's 57% battery. So I'm in safe mode. Oh my God. It has a headlight. Is it on? (beeping) (laughing) Oh no! I didn't put on my flag. Oh Oh no, no. Sorry, the test drive cannot proceed. This video is brought to you by honey. Honey is the free online shopping tool that searches for the best promo codes whenever you shop online at specific sites. It is free to use and installs in just two clicks, and it works on lots of your favorite stores including Amazon, eBay, Newegg, Razer, Best Buy, Walmart and many more. All you have to do is click apply coupons while you're at the checkout page and wait for honey to search for the best working coupons. So don't wait. Get honey for free right now. They're going to join honey.com/ short-circuit. Here we go. So I gotta, I gotta secure all my loose objects like this LTT store lanyard here. Gonna put that away. That was in the guide. All right. Got my seatbelt on. Okay. And then you can see it doesn't let me go. Cause it's in lock mode right now. Okay. So I'm gonna unlock it. So this is safe mode, all right. We're gonna start with safe mode, safety first. (soft upbeat music) Okay, that's pretty safe. This is 10 out of 10 definitely safe, but not really a lot of fun, so, okay we're gonna try a new rider mode. This has a maximum of 18 kilometers an hour. This should have a little bit more snap. Oh, hi. Whoaaaaa! Okay, all right. It goes ladies and gentlemen. (soft upbeat music continues) Okay. Got a little bit too much grip here to really like drift anything though. I got it floored right now. Like this is it this is 18 kilometers an hour. Brakes another... Ah, the steering's a little, there's some there's some gib in it, you know? Yeah, it's a little plasticy steering wheel feels all right though. Okay we're going to sports mode. 28 kilometers an hour. I might actually want to put my phone in my pocket this time. Okay. Now we're going (wheels rumbling) (upbeat music) (man laughing) (upbeat music continues) That's pretty fun. I desire more. Now we got track mode. Now we going 37 kilometers an hour max. That was not max. Okay. Here we go. (soft engine rumbling) Okay. (screaming) (upbeat music) (screaming) How y'all doing? (engine rumbling) Oh my God. This is sick Okay, I got to control that. (screaming) I'm gonna need two hands on the wheel for this mode ladies and gentlemen. (laughing) Oh man. I think the e-brake is intended to be an emergency break. I don't.. No, it's pretty, it's pretty rubberized. I have never drifted with an e-brake. I mean, Jake, do you want to do the honors? Yeah do we have any other helmets? Okay. Just explain to me in as little time as possible how you do it. What's that? That's it. All right. (laughing) Just a little, okay. Oh no I spun out. I got to practice. Okay. Oh, hi (laughing) Okay here we go. Okay there we go. Oh my God. These are way too much fun. All right. Enjoy short circuit. Sorry I'm done filming the Oh, we haven't even tried the Bluetooth thing. You know what, whatever. we're gonna do Channel super fun with these things in all likelihood or maybe an LTT review. I don't know what we're doing with them yet, but that's it that's a short circuit. It's an absolute fricking blast. Subscribe. (man screaming) (man laughing)",
    "transcript_keywords": [
        "thing",
        "God",
        "mode",
        "Ninebot",
        "fun",
        "Ninebot gokart pro",
        "max",
        "kilometers",
        "gokart",
        "kilometers an hour",
        "things",
        "safe mode",
        "safe",
        "hour",
        "pretty",
        "Ninebot gokart",
        "channel super fun",
        "wow",
        "wait",
        "pounds"
    ],
    "transcript_entity_values": [
        "Six",
        "Newton",
        "17 kilometers",
        "70 freedom pounds",
        "Jake",
        "a ton",
        "One",
        "one",
        "14",
        "220 pounds",
        "Newegg",
        "90",
        "about 150 pounds",
        "57%",
        "Amazon",
        "Andy",
        "150",
        "28 kilometers an hour",
        "John",
        "LTT",
        "16 to 60",
        "Walmart",
        "max",
        "10",
        "first",
        "the S max",
        "18 kilometers an hour",
        "two",
        "about 76 freedom pounds",
        "Razer",
        "six foot",
        "four",
        "37 kilometers an hour",
        "four and a half feet",
        "eBay",
        "just two",
        "Two",
        "Ninebot",
        "Best Buy",
        "25",
        "1600"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}