{
    "id": "HAH-mvJ5JMs",
    "title": "SCORPION ISLAND!! Animal Crossing New Horizons",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-04-03T16:50:51Z",
    "video_url": "https://www.youtube.com/watch?v=HAH-mvJ5JMs",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 240449,
    "likes": 7604,
    "comments_count": 545,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and guess what, we're playing \"Animal Crossing\", and I had zero intention of recording this right now. I actually didn't even plan on playing, but I had a Nook Miles ticket, and I thought okay, it's after 7:00 PM, so maybe I'll make it to Tarantula Island. Well, guess what? No. I'm on Scorpion Island. So you can usually get to either Tarantula or Scorpion Island after 7:00 PM. So it's like between 7:00 PM and 4:00 AM local time. I didn't actually think this was gonna be something that happened. And there's bunny events happening. So there he is, but he usually ends up going and jumping into the water, but I'm gonna give him a little, \"Hello, friend.\" No, shoot! I didn't want him to run into the water, so I was just haunting him. This is gonna take me hours. So I just wanna like haunt him a little. So he sees me, you sneak, he raises up, sneak, oh gosh, it's terrifying. (net thuds) Okay, we're gonna be here for a while. But here we go again. I've already caught a couple. I'm gonna have to get rid of all this garbage. I'm gonna leave it all here, 'cause I am going to pull up my inventory... No! I am getting bit at the same time as catching one. Oh, wow, this it... Oh my god, can I catch two at the same time? They actually seem to have merged into one. (net thuds) (character cheers) The good part though about continually dying is they all just respawn. Oh, come on now! Strike. How much more do I need? Oh my gosh. I don't wanna leave my wooden fence. It's my favorite fence. I wasn't ready to do this. I guess I can leave everything except my fence. (character cheers) I'm so upset, I brought a Nook Miles ticket. I don't ever expect to make it anywhere that... Oh, come on. You're mine. (character cheers) Look at that guy back there. He's gonna get me! He's gonna get me! He's gonna get me! He's gonna get me! Oh my gosh, I have so many of them! They're after me! They're after me! Oh my gosh. (net thuds) Oh, did you see? That's skill. Oh my god, I'm so talented. (net thuds) Oh, stupid idiot. I need to see if I can craft this fence, I'm gonna look it up first, because it's one of my favorites. I don't have the simple wooden fence recipe. I came here to collect eggs, and now I'm... Uh uh. Shoot, shoot, shoot, shoot! Oh my goodness. (net thuds) Look at my outfit, I look like a freaking mess. Come on, I didn't even do anything. I just... Oh, geez. (character cheers) (character thuds) (Justine sighs) (net thuds) Yes, I'm so slick. (character cheers) Gotcha. At this point, I'm just letting it sting me, just so I respawn and I wanna make sure that there's scorpions available. Shoot! (character cheers) My inventory's now full, so I'm gonna drop everything. I'm so upset about my Nook Miles ticket. Okay, bye, simple wooden fence. I am like having heart palpitations, because I'm feeling so nervous. Are you kidding me? Where did you even come from? Oh gosh, there he is, there he is. And we're on the hunt again. (net thuds) (character cheers) The other dude jumped in the water. I hope there's another one. Oh, there is. Hello, come chase me. Shoot! (net thuds) (Justine gasps) It's shocking every time. (net thuds) This may come as a surprise, but we only need two more. And it only took me 30 minutes. (net thuds) That's absurd. (character cheers) (net thuds) And my pockets are full. (character cheers) So this is amazing. I'm going to swap it. Wait, I can't swap it with my net. Here it is, my simple wooden fencing. See you later, Scorpion Island. See you later. Oh my gosh, how much are these all gonna be if I were to sell them all right now? I'm not quite sure if I'm ready to sell them. I kind of just want to hold on to them and think about my new friends. Let's just see what they would be. Mommy's getting a new house tomorrow. So I'm not going to sell them yet. But I am going to donate one to my museum. He's gonna hate it. Don't wanna hear more about it. Not quite ready to give them up. Maybe we make them a part of the welcome committee. I wonder if you can stack these. I'm so afraid I'm gonna hit release, and then they all are free. Is there anything better than being welcomed by this? Yeah, I'll tell you what's better, we're selling them. Let's sell these and upgrade my freaking house. Because I owe a lot of debt, and nothing has really been accomplished I feel like. I don't actually know how much I have left on my house. I probably can't even pay for it. I wanna sell. (Timmy chattering) I'd like to sell. Let's do it. (Timmy chattering) Shopping. I can just pay from pockets, because guess what... Yes, oh, thank you, I'm so excited. Let's talk about my house. I wanna expand. Add another room. 540,000 bells, that's a lot of money. I want black, it looks good. (Tom Nook chattering) All right, well, that concludes today's episode, that wasn't even supposed to ever be filmed. I guess I can go to sleep now. My wallet is so full with cash. Okay, well, in that case... Remember when I said I was gonna go bed? This game is ruining my life. It definitely is, there's no doubt about it. (Lloid chattering) I'm gonna help you out. So as much as possible. I don't have a single bell. I can't give you anything. I have nothing, I have given you it all. I can't wait to show you my house, I haven't even got a chance to do that yet, but this my outside, things are looking good. Swap meet has been upgraded, the bunny event is happening, so I've got a very bunny festive outside. I got some brick fencing now. All is going well. All right, that's it. (gentle music)",
    "transcript_keywords": [
        "Animal Crossing",
        "Scorpion Island",
        "Nook Miles ticket",
        "Tarantula Island",
        "intention of recording",
        "Nook Miles",
        "Island",
        "shoot",
        "gosh",
        "Animal",
        "Crossing",
        "Justine",
        "fence",
        "Miles ticket",
        "sell",
        "guess",
        "wooden fence",
        "Justine and guess",
        "house",
        "Tarantula"
    ],
    "transcript_entity_values": [
        "zero",
        "Tarantula Island",
        "30 minutes",
        "hours",
        "Lloid",
        "Justine",
        "Animal Crossing",
        "7:00 PM",
        "4:00 AM",
        "540,000",
        "Shoot",
        "today",
        "Scorpion Island",
        "two",
        "Tom Nook",
        "first",
        "tomorrow",
        "Nook Miles",
        "between 7:00 PM and",
        "Timmy"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "LOC",
        "TIME",
        "TIME",
        "PERSON",
        "PERSON",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "DATE",
        "FAC",
        "TIME",
        "PERSON"
    ]
}