{
    "id": "hAiIM7CBozo",
    "title": "Exploring One of the First iPads Ever Sold - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-05-17T20:02:09Z",
    "video_url": "https://www.youtube.com/watch?v=hAiIM7CBozo",
    "category": "Science & Technology",
    "tags": [
        "Exploring One of the First iPads Ever Sold",
        "Exploring One of the First iPads Ever Sold - Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Krazy Ken's Tech Misadventures",
        "iPad",
        "iOS",
        "Apple",
        "Apple Store",
        "Launch Day",
        "First-Gen iPad",
        "App Store",
        "Google Maps",
        "TV Shows",
        "Comedy",
        "Funny",
        "Tech",
        "Demo",
        "Humor",
        "Steve Jobs",
        "Scott Forstall",
        "Skeumorphic",
        "iSlate",
        "MacRumors",
        "iProd"
    ],
    "views": 52118,
    "likes": 1378,
    "comments_count": 241,
    "description": "The iPad was released on April 3, 2010, and Krazy Ken was FIRST in line to buy one of the first ones ever sold. Today, he tells you his launch day story, then candidly explores the ancient remains of the iPad.  Want more videos like this?   Subscribe for new content!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #53 - Exploring One of the First  iPads Ever Sold  Cat Noir Easter egg by:   Contact the CC    Get film gear Ken uses   On a lower budget?    Want music for your videos?   (We use these guys a lot. They're good.) Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "https://sparks220stars.deviantart.com",
        "http://thecomputerclan.com/contact-us.html",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL",
        "http://bit.ly/clan2LBaKov"
    ],
    "transcript": "- [Krazy Ken] Boom! I went inside, tired as I could be. Let's, Notes, let's see what's in the notes. One. Well, that's a list someone forgot to finish, 1610 days ago. Oh, yeah, the old doorway animation. Oh my gosh. You couldn't camp out in front of the store, because the mall would close, the security would kick your ass out. (machine gun firing) (electronic beeping) (upbeat music) Hey, guys. How you all doing? Really? That's great. You know who else is doing great? I actually am, because today, we're not gonna stress ourselves out fixing some overly complicated tech project. We're just gonna have a little story time. It's story time with Krazy Ken today, and we're gonna go back in time to when this baby came out. This is the first generation iPad. And now, you might think, Krazy Ken, what's so special about a first generation iPad? I mean, it's only like what, eight years old? That ain't special. Well, this one kind of is. This was one of the first iPads ever sold. I actually recently, well, I loaned it to my brother, and he used it throughout high school and college, but he finally got a new one, and he gave this back to me. That was super nice. Bonus points. So I now have this old tablet, and it's probably a museum of old iOS and old applications and stuff, so I wanna go through 'em with you, and just kinda see what we find on here, kinda like a time capsule. But I also wanted to share the story of me buying this on launch day. Again, it was one of the first iPads ever sold in history. I was there. Now before I get into the story about launch day, I just wanted to talk about how so much hype was going on around this tablet, people were wondering what's the name gonna be? You know, I remember iSlate was one of the big names that was rumored out there, and there were loads of concepts and rumors going on out there. It was, honestly, really fun and exciting and I remember on that day, during that Apple special event, \"Come See Our Latest Creation\", they revealed this device, and there were a lot of people that were excited for it. I was one of them. And then there were people that were like, it's just a giant iPhone. (laughing) Well, obviously, it succeeded, because millions of them have been sold, but yeah, there were some, yeah, you know, there was some skepticism at first, but I think in the end, it worked out. Oh, and remember iProd? That product code name that showed up in like Apple developer plist or something, and people were freaking out about it. There was so many misconceptions about it. I think a few people even said it's like gonna be a new Apple exercise device. I have no idea. It was iProd. I think it was just short for iProduct, but people saw that show up, and they were like, oh my gosh. Apple is introducing a new iProduct, and now we come to that April 3rd launch day. And here is my story. It was probably a little after 5:00 in the morning, I think? Now I wasn't a crazy guy that camped out ahead of time for this. In fact, I don't think you could even do that, because the particular Apple Store I got this at during launch day was inside a mall. You couldn't camp out in front of the store, because the mall would close, the security would kick your ass out. (machine gun firing) This was so long ago, I couldn't be in a mall by myself. I wasn't allowed to, because of my age. I also couldn't drive, so I had to lug one of my poor parents along with me Thankfully, a Krazy Ken mother unit was able to help me out and she went to the mall with me at a quarter after five in the morning. 6:00 AM, I get there. I arrive, and I am first in line for the on site orders. I feel like I owned a little piece of history right there. Now there were already three people in line for the pre-orders, but I didn't do that. When I decided to actually buy an iPad ahead of time online, they sold out at the location I was at. There was a reserve limit. I missed it. So I went there on site, and I was like, oh please, I hope I can get one, and I was first in line. However, I was a little concerned, because I thought the people that reserved ahead of time would get the iPads first, but by the grace of Steve Jobs, I was informed that they were gonna alternate. They were gonna get some reserve people in them, and let some on site people in during the launch day, which was great, because that means I was likely gonna get one. Now a very nice woman actually stood behind me, and she said, \"Man, you're so fun. \"Even if I got the only iPad they had here, \"and I was in front of you in line, \"I'd let you have it,\" which I thought was really nice. I got to meet some nice people there. It was actually really cool to be there, at the first launch of the first iPad like super early in the morning, at the front of the line, boom. I went inside, tired as I could be, and got myself a tablet, the first generation iPad. Man, I remember that day really vividly. Heck, I remember what I was doing, even before that day. I was just counting down the minutes until launch. I remember working on a 3D project for the Computer Clan. I was modeling the Computer Clan Headquarters. Any of our longtime viewers remember that? I was working on that model, which watching probably my favorite Canadian sitcom, Corner Gas. I was just binge watching it while modeling. That's what I was doing the night before the iPad launch. I remember vividly, and I was a little nervous, but it worked, and that iPad is this iPad, and it still works. So come on. Let's take a look at what's on this first gen iPad. So before we continue with the magical time capsule of software that is on this device, after all these years, I just wanna admire the design of this. I still do like the old design quite a bit. You know, the kind of rounded back, you know, the one speaker grill thing, no cameras or any of them. The 30 pin connector. I still like this old design. What do you think? Speaking of the 30 pin connector. Oh yeah. This almost threw me for a loop for a second. The charging sound. (iPad charging beep) Yeah. It's like a nice like \"blung\" now. Back then it was like a (screeching) Just like a pterodactyl in a garbage disposal or something. All right. Time to unlock this bad boy. Now remember, even though it was mine originally, this was also used by someone else for awhile, but it was someone in my family, in the wonderful Krazy Ken family tree, and we shared an iTunes account. So oh, yes, the water droplets. Oh my gosh, hang on. Trivia question. Who remembers what this button does? You have five seconds. Time's up! You don't see this button anymore. This was the freaking photo frame button, but I don't, I don't think there's a lot of photos on here, so we might come back to that later, but yeah, that was the photo frame button. Wow. Slide to unlock. You don't do that anymore. Ah. Back when iOS had an unlock sound. Oh, dude. Hang on. (clicking) Man, these sounds are making me nostalgic. The old lock noise, you don't have that anymore, either. It's like a, it's kind of like a door sound now. But yeah, the unlock sound. Ah, dude. That was so satisfying. (laughing) Anyway, yeah. So notifications center. The Daily, oh my gosh. The Daily. What? Wasn't that like a news thing that did something with Apple? It was like a news app? Apple's been obsessed with news. I don't know what their obsession with news is. But yeah, I don't think that lasted very long. The old linen. This was the notification center, yeah. It didn't really take up the whole screen. It was just kind of a little thing there. (laughing) Yeah, I think this is iOS5 dot something. Let's see, double tap. This was the multitasker. You didn't have the full screen apps. You'd have the little apps which are down here, and your playback and volume and brightness over here, with the Linen, yeah. That skeuomorphic stuff was kind of everywhere. Game Center, iBooks, oh man. The wooden bookshelf newsstand. Yeah, there's The Daily. Nice. Well, let's take a look at what's on here. Let's have some fun in Safari. Oh, the old keyboard that was always in caps. Okay, so this did have the split feature, so I think this is iOS 5 something. We could probably check that later. But yeah, the keyboard was always in caps. Let's see. thecomputerclan.com Let's see if this browser loads our website. Well, it kinda does. Yeah, it's not too bad. I mean, our vector on top is a little effed up, but the rest of the vectors actually load really well. Yeah, this actually loads our website decently. We'll put some wallpapers on here, through the wallpaper gallery. Let's take a look at photos. I also swung by my DeviantArt, which was on there. Just a little Aggretsuko fan art of Resasuke, because why not? He looks good. You know, it fills the screen quite well. Look at that. The old, this was the Photos app. Oh, yeah, it used to be dark. Yeah. You know, the little pinch, I think you can still, can you still pinch the albums on the current system? I don't think you can. But yeah, you used to be able to pinch them open. And you couldn't swipe down to close. Like that gesture didn't exist. You had to, I think, pinch to do that. So yeah, the Photos app looks good. Looking good. Got some photos from the Computer Clan Wallpaper Gallery. Oh, yeah, I'm naturally trying to swipe down to close. Let's set one as our wallpaper. See, I like this one I shot of Chicago, so let's go to the little share button. Oh, man. The old glossy menus. This is all coming back to me. Use as wallpaper. It looks kind of blurry. I don't know if it's just, it downloaded a low res copy or it's just the non-retina display that's throwing me off. Yeah. Check it out, man. Oh, we got, oh, shoot. We got like folders of games. Yeah, Games 1, Games 2, Games 3, 'cause you could only have like 20 items in a folder or something like that. Oh, man. There's a lot of old games we're gonna have a lot of fun with on here. Oh, yeah. Notes, let's see what's in the Notes. One. Well, that's a list someone forgot to finish, 1610 days ago. (laughing) Oh, man, the old marker felt and everything, the old marker felt typeface, the marker icons, wow. Well, let's fiddle around in some old iOS apps. Let's see. What's some games on here? Plasma Globe. I wonder how many of these apps still exist. Oh, yeah. (laughing) Look at that frame rate. (electricity buzzing) I don't know. Oh, I triggered the multitasker. (electricity buzzing) Well, that was fun. Let's see. Is there Spotlight on here? Spotlight. Let's look for, I think we used to play an old bowling game on here. Hyperbowl, yes. Hyperbowl Classic. How do I abort mission? Oh, I'll just roll the ball, whatever. Hit the pocket, hit the pocket. Oh, that sucked. It's hard to do it on an angle. How do I abort mission? I can't keep listening to that. Those sounds are so annoying. Let's do Hyperbowl Rome. Check out the performance of that A4 chip. Single core, 1GHZ, 32bit. I think this a Unity game. It's driving the 3D. It's hard to do this on an angle, but I will certainly try. Oh, what the? That sunflower hit my ball. Oh. Get away from me. Nine seconds left, come on. Yeah, I hit the head pin. That's not a smart idea. Oh, dude. The old YouTube app that was like a Tube TV icon. Remember this? Yeah, this used to be, YouTube not available. Well, isn't that a darn shame? Yeah, this was a built-in app. Now you have the YouTube app from Google right here, and then the built in Apple app there. Yeah, it, I guess, just doesn't work anymore. Tap Tap Radiation. This is probably a landscape game. Oh, well, no. It opened that up in portrait. That's a start. Oh yeah. I think this was one of the first apps I played with on the iPad. Man, the old folder animation, oh my gosh. Yeah. Oh. Let's look at the other skeuomorphic stuff. There's quite a bit of skeuomorphic stuff in the old system. Like, I think the calendar had a, yeah. Like the paper, and this leathery look. There was a lot of leather. Scott Forstall, I think, was in charge of those design choices. Not that it was terrible. It just maybe went a little far, and they kind of ditched that. Oh, yeah, oh yeah, the page turning. Yes. Look at that. Oh, it's all coming back, man. Let's see. This was before Apple Maps, as well, I think. So this was Google Maps that was built in. Let's see, is there Maps? Yeah. Oh, wait, hang on. Press the button and there we go. Oh, that looks, oh. Oh, hey, oh shit, hang on. Yeah, we got Street View going. Cool. Oh, the moon's out. It's a beautiful, moony night on Street View. (laughing) Oh, wow. I am impressed. I don't even know where are we? Is this the Eiffel Tower? What happened here? There we go. That's our Eiffel Tower. Nice! Street View works. You know, as much as I, honestly, I like Apple Maps. As much as I like Apple Maps, I do miss Street View. That's a cool Google feature. Look at that awesome lenticular halo going on there. Beautiful. Yeah, that was Maps before Apple Maps. No turn by turn directions yet built in, either. This predates that. Any videos on here? Oh, dude, it's a Scrubs episode. Someone was in the middle of watching Scrubs. Oh, I freaking love this show. Is this the small one pump mocha bit? - Hey, Turk. I'm gonna go up the street and get some coffee, want one? - Get me a small, one pump mocha. - [Krazy Ken] Okay, how the (beep) did I do that by looking at a still frame? Like I seriously, I don't know how I memorized that. I guess it just kinda comes with the territory of being in video. You memorize things like that. Oh, yeah, the old doorway animation. Oh my gosh. And it folds behind. Oh, I miss this stuff. Oh, Drake and Josh, yes. Ah, the old animations, dude. Oh, man. I'm having too much fun with this. Oh, I can't believe I memorized that scene. Holy balls. All right. Let's go back to that picture frame thing we were talking about. I put some photos on here from the wallpaper gallery on the Computer Clan website. Press it, and you have a digital photo frame. I think they killed this feature in iOS 6 or 7. Someone might have to remind me on that. But it was one of those. But yeah, you could have the origami effect going on here. It was kind of cool but I guess no one used it. They got rid of it after a couple versions. Sweet. Wow, this is a trip down memory lane, for sure. Oh, let's look at the felt and wood in Games Center. Mm, it's like golf course. Well, time to check out iBooks. This was one of the cool features that debuted with the iPad. Ah, the old bookshelf. The Apple logo up there. It spins around. Nice. It doesn't seem to want to, oh there it goes. It loaded. All right, Objective-C for Dummies. Let's learn some Objective-C. Ah, yes, because this is before Swift. Yeah, programming is not my thing. I did a little bit of it, but no, it's a little beyond me. I admire people that can do it. You guys are geniuses. Keep doing that. Sound Drop, yes. This is still cool. This is still a cool app. I don't know if it still exists on the app store, but it's cool. (musical pinging) Oh, there's presets? What? (discordant grinding) Well, that's a terrible preset. It doesn't do anything. I don't know. (laughing) That was, you know, it was cool stuff back then. Tablets were rather new. That was new stuff. The old iFunny logo, wow. Wow, man. This was a trip down memory lane. Like, sorry, I'm just getting all nostalgic over here. Anything in the reminders? Like did you forget to do something from like five years ago? Nope, nothing in here. Nothing important. Oh, and before I forget, I'm open to ideas. What do you think I could use this for? Do you have any suggestions for what an old iPad like this can be used for? Jailbreak? Do people still jailbreak? I don't know. I could probably jailbreak this thing. I'm open to ideas. Also, since I have you here, feel free to share your own product launch stories with me, whether you camped out, stood in line, or just woke up at 4:00 in the morning in your underwear and ordered something on the computer, I don't care. Feel fee to share your stories with me about your product launch experiences. But today was an easy day. For once, I like having an easy day. I'm calling it a win, and I appreciate you guys sticking with me during this trip down memory lane. So catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "yeah",
        "Apple",
        "Apple Maps",
        "iPad",
        "people",
        "Man",
        "Krazy Ken",
        "kind",
        "time",
        "day",
        "remember",
        "launch",
        "launch day",
        "Computer Clan",
        "back",
        "Maps",
        "app",
        "games",
        "cool",
        "Street View"
    ],
    "transcript_entity_values": [
        "Plasma Globe",
        "Game Center",
        "iFunny",
        "6:00 AM",
        "Drop",
        "20",
        "a little after 5:00 in the morning",
        "2",
        "YouTube",
        "iPad",
        "1GHZ",
        "Street View",
        "the launch day",
        "one",
        "32bit",
        "Corner Gas",
        "iProd",
        "5",
        "millions",
        "Josh",
        "Resasuke",
        "Come See Our Latest Creation",
        "eight years old",
        "iBooks",
        "Drake",
        "launch day",
        "iPads",
        "a quarter",
        "Apple",
        "that day",
        "DeviantArt",
        "Google",
        "first",
        "Turk",
        "Scott Forstall",
        "an easy day",
        "three",
        "five in the morning",
        "Canadian",
        "Nice",
        "Krazy Ken] Boom",
        "Chicago",
        "iTunes",
        "Tube TV",
        "Games Center",
        "some Objective-C. Ah",
        "iPad",
        "today",
        "YouTube",
        "Krazy Ken",
        "April 3rd launch day",
        "the Computer Clan Wallpaper Gallery",
        "iOS 6 or 7",
        "five seconds",
        "about launch day",
        "Safari",
        "Steve Jobs",
        "iPhone",
        "iProduct",
        "the Computer Clan",
        "Hyperbowl Rome",
        "the Computer Clan Headquarters",
        "iPads",
        "30",
        "like five years ago",
        "Unity",
        "Time",
        "Apple Maps",
        "Nine seconds",
        "1610 days ago",
        "Notes",
        "One",
        "A4",
        "iProd",
        "Aggretsuko",
        "second",
        "the minutes",
        "Google Maps",
        "4:00 in the morning"
    ],
    "transcript_entity_types": [
        "ORG",
        "FAC",
        "ORG",
        "TIME",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "FAC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "CARDINAL",
        "TIME",
        "NORP",
        "GPE",
        "PERSON",
        "GPE",
        "NORP",
        "ORG",
        "FAC",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "EVENT",
        "TIME",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "NORP",
        "ORDINAL",
        "TIME",
        "ORG",
        "TIME"
    ]
}