{
    "id": "Hd-I9NswW0Y",
    "title": "Microsoft Surface Go 2 and Surface Headphones 2!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-05-14T18:06:29Z",
    "video_url": "https://www.youtube.com/watch?v=Hd-I9NswW0Y",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 463446,
    "likes": 13580,
    "comments_count": 907,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And we are back with some more tech. It has been such a crazy quarantine, as far as tech is concerned. So many products have been launched and announced, and today I'm checking out the new Surface Headphones 2, the new Microsoft Surface Go 2, and of course, one of the Surface Type Covers to go with it. I've covered the previous version of the Microsoft Go, and what I loved so much about the original version was, it is just such a small portable little tiny device, and now, more than ever, if you're someone who is trying to do a bunch of conference calls, zoom calls, Microsoft teams meetings, whatever it is that you're doing, this is a really great device for that and I will show you why I would prefer using this over the iPad. I know, it's shocking, shocking. What do I have? A little knife or something? Oh, I don't have a knife, but I have a screwdriver! There's a few different models of the Surface Go 2, but this is the 8th Gen Intel Core m3 processor with a 128 gigs of storage, and 8 gigs of go RAM. Put my screwdriver away, I think we're done with that now. This is the Intel Core m3 version, here it is. I love that they label everything for you, it's like do you need to know where the camera is? Check. Microphone? Check. Audio? We've got you covered. (plastic scrunching) The Surface is such a great, small, little device. Like you just, I, I really really like this thing. It's got its nice little hinge here, which is super sturdy. See what else we have in the box, I already know. This is gonna be the power adapter, spoilers! And since this is the LTE version, this gives you a nice SIM card ejector. Let's get this thing turned on, and open up our keyboard. This will work as a perfectly fine stand-alone device without a keyboard. But having this really does change the game. I really like this color a lot, it's so thin. The type pad covers are about a $150 extra, and they do come in two colors this is the ice blue, it also comes in a poppy red. Seems more like a gray and a blue. This also has a micro SD card slot for expandable storage, (mumbles) pc, we have a headphone jack. And also has the built-in camera on the front and on the back. So, what I love about this is I've been doing so many Zoom calls and conference calls, Microsoft team meetings, the camera configuration is on the front here. The problem with the iPad that I've run into is the camera is actually over here, it definitely is a much better placement if you're doing those types of thing. So, I do really like the way that this is set up. Now, I will have a nice little cute small device. - [Computer] Hi there, - For, I'm Cortona, and I'm here to help. - For friendship. (chuckles) - A little sign-in here, a touch of WiFi there, and we'll have your PC ready for all you plan to do, and if you'd like me to stay quiet, just select the little microphone i, - Yup, you're done, we can be friends later. (the computer assistant speaks) Oh my gosh, no now you're talking to me. So, before I finish setting this up, let's open up the headphones so that we can test these out with the Surface Go. New Surafce 2 headphones have improved sound quality plus battery life, they say that yo can get about 20 hours of usage. And it also has adjustable noise cancellation. Look at that, it'll work with your iPhone. And it's Bluetooth, so basically it will work almost with anything that, is Bluetooth. I really like the previous version of these, and I like that these black version, these are really light. (rhythmic music) First tests, they're actually quite comfortable. Let's continue setting this up and test out the headphones and the Surface Go. (upbeat music) Surface is all set up, the headphones are currently synced, and what's cool about this is these have dials on them, so I can adjust the volume over here, and I can adjust the amount of noise cancellation over here. So, this has three different settings. So when I turn it, it will go to maximum noise cancellation and then when I turn it a little this way, it will allow some pass through sound, is she's talking to me right now? And then when I turn it all the way, it will allow me to do an ambience sound amplification, so I can hear everything around me, just a little bit better, which I need because my hearing is absolute trash. Anyway, these headphones are awesome. The one thing that I do like that they did update, is that these turn so that they can rest very nicely on your shoulders, it's like a, it's like a nice hug. So, these sound great. Plus having 20 hours of battery life is pretty awesome. So I'm gonna put these back on, and I'm gonna watch one of my YouTube videos. So, you can also see, it's controlling the volume, when I turn it on my head. You guys can't hear this, I also can't hear myself talking, wow, wow. Sounds really good. Wow, I, like I honestly can't even hear myself. And I'm loud. So one of the reasons I really wanted to show you guys this is to give you another option because I feel like a lot of people right now are trying to find devices to get work done, if you do need something that is super simple and cost effective, just this simple model would be enough to do some calls, to take notes. The keyboard is an added extra, but depending on what you're doing with this, like you could just use this, just like this as a tablet. It does have a full keyboard. So I've been using an Excel spreadsheet a lot recently for tracking and cataloging items animal crossing and also tracking turn up prices. If this doesn't make sense to you, that's okay. If it does make sense, you know that animal crossing life is real. Anyway, all things considered, I can now use this as my animal crossing tracking device for all of my Excel spreadsheets. And I look forward to using this more for doing some calls. I do wanna show you guys what I was talking about as far as the camera placement, so what I'm gonna do is I'm gonna show you guys just recording directly from the camera on the iPad and on the Microsoft Surface Go 2. And it's really crazy because the eye line is so incredibly different that it really makes me think that Apple is going to have to figure out some sort of a solution to this, 'cause most of the time, when I'm using my iPad, especially this docked now to the magic keyboard, this is the way that I'm using it, I'm using it horizontally. So, we do my little video test. First up, I've got my Microsoft teams meeting here on my Surface Go. And I'm not gonna look directly at the camera, I'm gonna look kind of below the camera, where the people would be. Hi, it's Justine, checking in here for our meeting, I have arrived, propped as always. Yeah, that's, that's cool so I'm gonna send you the document as soon as I get off of this call right now. I'm currently doing really important things, like I'm trying to find a 600 plus turn up island, so, I don't know if you can just like hold off on asking me to do anything for like the next four days. So, right now, I'm gonna show you what it looks like if I'm looking directly at the camera, so I'm looking at the camera directly now, and now I'm looking down, slightly to myself. I'm looking over here to the left to one of my friends over there, and I'm looking over here to one of my friends over here. It's really great (mumbles), it's really really great. So now, it's time to do a group face time call with all of my friends, so I'm gonna hit record here, so you can see what this looks like. I have pushed this so far forward so that I'm actually in the shot. It's such a strange camera placement for doing things like this. So, this is me looking at, up here, kind of where the apple pencil is, where the Microsoft Surface Go camera actually would be, so if I'm doing calls with people, I'm now looking around the screen, wondering if anybody wants to talk to me. I'm looking off to the top right, this is the top left, kind of looking down, and this is me looking at the center of the screen. Does anybody having anything that they wanna say to me, any friends that are here? No? Okay. But I will say that if I do flip this thing around, this is perfect placement. So, if I'm doing a call like this, because I'm fully in the frame, this looks great. But I'm then using my iPad like this and how am I to, how am I gonna type? I'm not. Now that our conference calls are over, we can have a chat. I think the Microsoft Surface Go 2 checks a lot of boxes for a lot of people on a lot of different levels, this can be used for word processing, it could be used for simple apps and games, and it can also be used for doing all of those conference calls. And if you are getting the base model, it is a really great price. Obviously, the iPad and this are two very different devices, I feel like the iPad is definitely geared toward doing more things like drawing, video production, and of course it is an IOS device. I know a lot of you guys out there are windows users and android fans, so something like this might be perfect for you. So, thank you guys for watching this video. If you guys have any questions about this device, or anything in general, free feel to leave those in the comments below. And I will see you in my next video. Bye.",
    "transcript_keywords": [
        "Microsoft Surface",
        "Surface",
        "camera",
        "Microsoft",
        "calls",
        "device",
        "guys",
        "turn",
        "lot",
        "iPad",
        "great",
        "Headphones",
        "Surface Type Covers",
        "version",
        "Intel Core",
        "conference calls",
        "Gen Intel Core",
        "thing",
        "Surface Headphones",
        "Microsoft teams"
    ],
    "transcript_entity_values": [
        "600",
        "one",
        "iPad",
        "the Microsoft Go",
        "2",
        "the Surface Go",
        "the Surface Type Covers",
        "Apple",
        "Justine",
        "Excel",
        "the Microsoft Surface Go",
        "Gen Intel Core m3",
        "LTE",
        "Cortona",
        "iPhone",
        "Microsoft Surface Go",
        "three",
        "Bluetooth",
        "jack",
        "8th",
        "8",
        "about 20 hours",
        "Surface Headphones 2",
        "SD",
        "Surface",
        "two",
        "128",
        "YouTube",
        "Microsoft",
        "the Microsoft Surface Go 2",
        "20 hours",
        "the next four days",
        "Intel Core m3",
        "150",
        "First",
        "IOS"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "TIME",
        "DATE",
        "ORG",
        "MONEY",
        "ORDINAL",
        "ORG"
    ]
}