{
    "id": "hECCGJVAs08",
    "title": "Apple Watch Series 6 and SE Unboxing and first impressions!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2020-09-17T13:02:50Z",
    "video_url": "https://www.youtube.com/watch?v=hECCGJVAs08",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 2101479,
    "likes": 54280,
    "comments_count": 3351,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and guess what we've got today! Brand new Apple Watches. We have the Apple Watch Series 6 and the Apple Watch SE to check out. Plus some new bands. So the Series 6 that we have today is the blue aluminum case with the deep navy sport band. And the SE is the space gray aluminum case with the charcoal sport loop. (box clatters) Let's unbox. Tyler do you. So I don't have a child. And would you mind acting as though you were a child today? For the sake of this video. You're gonna have to do your math. - [Tyler] Put me in time-out. (laughs) All right, Let's let unbox starting with the Series 6. (hatchet clinks) (upbeat music) The Apple Watch unboxing process is beautiful. Like, just look at this. It's so graceful. Maybe that's me. (box scrapes) Smells so good and fresh and new and fast. Smells like we're gonna get a faster charge time out of this watch. I hope this is a little hint of what's to come in the iPhone because this color is amazing. You've all seen the sport bands that this comes with, but let's open it anyway. Give you another look. Oh wow, oh this is nice. It matches it perfectly. Oh my goodness. I'm gonna just put it on because I can't wait any longer. I will say the one thing that I am gonna miss. The ceramic Apple Watch cases. These are so nice. Like it's just, ah, it's beautiful. Beautiful but we all have to move on sometime. Does have an integrated infrared sensor now, which will assist with the blood oxygen readings. I will be doing a follow up video so make sure you guys are subscribed and hit the bell so you'll be notified when that video comes out. This is more of an unboxing and kind of an overview of these watches and a first little test to see how it works. I'm gonna a pair this up. Look it's asking if I'm setting this up for myself or for a family member. I am left-handed So I wear my Apple Watch on my right wrist. A lot of you guys always are making fun of me 'cause you think that I'm wearing it backwards or upside down. But I do flip the orientation so that the buttons are in the front, on my right wrist. So here it's asking me which wrist do I wear my Apple Watch on? Right. Next up, SE. It's crazy you don't even need an ax to open this. (relaxing music) Oh this blue sport loop is very nice. These are review units, that I ordered is the graphite stainless steel so that will be arriving very shortly. It's so cool. The one thing I did notice is they didn't really put any big identifying features on this. Do you guys remember when they had the red dot on I think it was the Series 4 maybe? They now have just sort of the little red ring around there. It's asking me if I want to check my blood oxygen. Yes. Your Apple Watch is almost ready you'll get an alert when it's done. So now it's going through the final stages of setup and it's showing me all of the Apple Watch basics. But we know the basics. But if you don't, this is really great because it will give you a quick tutorial. This is the charcoal sport loop. Let's open this. Take a little look. So if you are getting this blue Series 6, this is one that you should definitely consider checking out. Now it's time to check out some of these watch bands. They sent a few different sizes to test out. So the sizes that I have here are a two and a three. But when I did measure my wrist with their little paper measuring thing, I did get a size five. So the number between the arrow is my band size. Looks like I'm a five. So hopefully these fit, if not that's okay, because I do have my size five ordered, and it will be here hopefully within the next week or so. Oh, wow this is so nice. Oh my goodness. There's no way this is gonna fit on my wrist. Okay, it might. But that's really small. Oh, it's stretchy. Holy moly, maybe it will fit. Okay is might actually fit. Oh no, this fits perfect. Oh shoot, I did a very poor job measuring. Oh no, it fits. It's a perfect fit. Actually I might be a two. Oh no. I'm gonna try the two and see what that feels like. I can't believe how comfortable this is, first of all. This is even more comfortable than the sport loop. It's nice and stretchy. I think I'm a two. I think I'm a two, I gotta tell Jenna. - [Tyler] When I measured I got 10. So I'm probably like a six or a seven. - Do we still have that piece of paper? I think I did something wrong. (paper rustles) Okay I thought that it was supposed to be between the arrows. If I'm making it pretty tight, it's saying a four, but the end of this is hitting around two. So if you're like me and has very poor judgment of measuring, make sure you do a better job of measuring. And make sure if you do print this out, there is a little credit card thing that will show you if it's the right scale or not. But I will tell you that this is by far my favorite Apple Watch band of all time, hands down. (hands bang) Look at this, where are my hands? They're down. It's perfect. We have one more that I wanna show you. Okay so since this size two fit, I'm gonna open up the size two. The silicone fitted band. This is the Solo Loop. Oh! It's so stretchy. (gasps) Okay this reminds me of like a Fruit by the Foot. I'm gonna put this on this dude. (gasps) Oh my gosh, I think it's almost ready! I'm not ready yet, hold on a second. I'm gonna put you. I'm gonna put this on here, I'm gonna put this on here. This is so exciting, this is so exciting. I'm so excited, I'm so excited. If anybody tries to rain on my parade of my excitement, I will mute you. Maybe I'll block depending upon my mood. This is my parade. Look how small that is. It's like, wow. All right, let's put the on! It fits perfect It's also comfortable. It's so comfortable. I don't know why it's so comfortable. There was never really a time that I thought, \"Wow, my Apple Watch is uncomfortable\" before. I would normally take it off sometimes for a nap. Stress to you guys enough how awesome this is. I don't even know how to explain it in the words that are coming out of my mouth, other than there's a huge difference. It's like the material is super light. And because it's stretchy, it doesn't feel like it's constricting my wrist. But man, this is gonna be so great for workouts. For actually tracking your sleep. Probably would use this one more often for workouts or hikes or things that I probably would be sweating. Because I don't usually like the feeling of the sweat in these silicone bands. Really, it's not a good feeling. And these ones are easier to clean. I will sometimes throw these bands in laundry. And then I have to go have a scavenger hunt trying to find it when I'm putting clothes away. Set up noise notifications. Yes. This is actually my first time trying watchOS 7. I didn't install the beta just because I didn't install the beta and I didn't. So that's really the only reason. So here we are. This is my first watchOS 7 experience. All right, we're gonna set up the SE. We're gonna set this up for Tyler. He's going to be acting as my son today. The setup is happening now. So here are the new Apple Watches, the Series 6 and the SE. We're first gonna start talking about the Apple Watch Series 6. So it has a new updated gold. A stainless steel graphite, which is the one that I ordered. And this is the aluminum blue. And the product red is also a new color. So you can also now measure your blood oxygen level right on your wrist. And it only takes 15 seconds if you want to check it manually. But it will automatically be taking readings throughout the day in the background. It also has a new improved always on display that is two X brighter and includes an always on altimeter. The battery life is around 18 hours with an improved, faster charge time. And this is gonna be great if you plan on using this for sleep tracking at night. So you'll be able to charge it up faster in the morning as soon as you wake up and will be ready for the rest of your day. So they want showed a demo of being able to unlock and start your car with your phone or your Apple Watch. So this does have a U1 chip installed in it. So that feature will be enabled if your car does support it. The back of the watch has also been redesigned with a new sensor to incorporate the new O2 readings. It's made up of four led clusters. And four photodiodes in the back sapphire crystal window. Green, red and infrared LEDs shine light onto the blood vessels inside of your wrist to measure the amount of light that's reflected back. This then uses algorithms to calculate the color of your blood, which will give you your O2 reading. Generally, you wanna be within the 96 to 99% range. In watchOS 7, the new sleep tracking will help you establish a regular bedtime routine. Which I think is almost impossible for me because of my editing, shooting, and gaming schedule. But I will definitely be giving that a try as soon as I get longer than a day to spend with it. So look for the full review. Apple also announced Fitness Plus that will launch later this year. Which is an on demand fitness program with treadmill, HIIT, rowing, dance, cycling, yoga, core strength, and mindful cooldown exercises. This will all integrate right into your Apple Watch. Giving you all of your metrics right inside the Fitness Plus app. While you're working out alongside of it, This will be 9.99 a month, and you'll get three months free when you buy a new Apple Watch. There's also new watch bands. There's a seamless Solo Loop band without clasps or buckles. And you would actually print out a chart to measure your wrist to make sure you get the correct size. Now I love my current watch face, but they also released some new ones as well. And they even have some for different categories of interests. Like ones for photographers or adventurers. And even the Memoji one, which I think is my favorite. Family setup is an amazing new addition for people who want to get an Apple Watch for their children. Before you would need an iPhone to set up an Apple Watch. So with this feature, you'll be able to set them with Apple Watch without having a phone. They'll still be able to make calls, text message, use walkie-talkie, play music, find apps, and even close their activity rings. Each account will have their own Apple ID and phone number. The Series 6 is starting at 499 for GPS and cellular, and 399 for GPS. The SE is 329 for GPS and cellular and 279 for just GPS. So the SE is basically the Six, but without the ability to take an ECG, blood oxygen. It doesn't have it always on display. And it does only come in aluminum, silver, space gray and gold. Either way, there is now an Apple Watch for everyone. And I love the fact that they have brought the cost down. So that everyone can be able to have some of these incredible features while still making it affordable. My watch is set up. My son's watch is set up. Tyler picked a Toy Story watch face for his watch face because he's acting as a child. And I've already restricted his access all day he's in Schooltime mode. (laughs) There it goes. So here's our conversation so far. I have messaged Tyler, my son, have you done your homework? And said, \"Sorry, can't talk right now.\" So what's cool is when I synced up his account. We basically made an Apple ID. He now has an entire separate account that he's able to receive messages. But for the most part He has a full fledged Apple Watch that he can use. And do things. The one thing that's really cool about the kids account is instead of Activity Tracker tracking calories, it tracks activity minutes. Because I feel like most kids, you don't want to get them like super obsessed with calorie counting. And instead get them just hyped up about activities and keeping track of things that way. Hello, my son, this is absolutely not your mother. Okay this is weird. I cancel, I cancel. (screen beeps) So the biggest new thing in the Apple Watch Series 6 is being able to test your blood oxygen level. So I have my watch face all set up. This is kind of carrying over from my previous gen watch face. I love to be able to have access to my activity, my messages, my fitness, to quickly add a workouts. And now the blood oxygen level. I also like to be able to take my heart rate at any point of the day. Which is why this is nice and centered, so I can just be able to see it at any point. Are you ready to take my blood? I gotta go like this. This only takes 15 seconds to test. And my last one was 98%, and it was an hour ago. Here we go. (relaxing music) (watch beeps) (gasps) Oh my goodness. Somebody has achieved a perfect 100% blood oxygen score. Oh wow, I'm printing this out. And you guys might think that this is a little bit crazy, but I actually do test my blood oxygen level at least once a day. I do have this little tracker to try out because I did a video previously talking about some health tech that I have. And a lot of you said to try this. So this one. It's saying it's 97%. We're having a discrepancy. Alright, I'm gonna take this one more time. I'm gonna have both of these on. So the Apple Watch is still saying 100%. And the ring is saying 99%. And one of the things that I actually read online before. This was like months ago when I was doing blood oxygen research about different devices. That normally there is a 2% chance of error in a lot of these devices. So I think the real key thing here is if it is extremely low, then maybe you should seek some sort of medical advice. I think these are really just supposed to be gauging some averages. But as far as accuracy, the ring is still saying 99. And my watch is saying 100%. So normally I do find myself ranging between 98 and 99. The most important thing for a lot of people is just to know what is normal for you and kind of go from there. And if you are actually physically not feeling well, don't rely on your Apple Watch. Don't rely on some sort of medical device. Do go to the doctor's and seek help. That's just, that should be common sense but something that needs to be said. so we've tested our O2. I'm gonna just take an ECG just to really get an overall gauge of my wellbeing today. So for the ECG, you just hold your finger right on the crown for 30 seconds. And it should give you a pretty accurate reading. This ECG does not show signs of atrial. (Justine mumbling) I like that all of this does integrate right into health app. So here's my activity. I did a run this morning, Forgot what I was doing. Respiratory. Blood oxygen. And your VO2 max for the past 30 days. I've actually never looked at this before. A higher VO2 max indicates a higher level of cardio fitness and endurance. This is actually quite fascinating because December, 2019, it was lower. And then I started running a lot more this year. So that's really crazy because you can actually see it. I am seeing my fitness. Look at all this freaking data. Well I'm glad that this now has added blood oxygen because that is just another added level of being able to quantify your health. They've also added in some new watch faces. I have mine all custom set up here now. I like the Memoji Apple watch face, that's cool. I wonder if you can change the color? Oh yep. Look at this. So if you guys watched the announcement, I did post a video that has everything covered that they talked about. So I'll put a link in the description if you wanna go into more detail about everything. The new iPads. All of the things that are launched in the new Apple Watch. But I can not wait for Fitness Plus. Fitness Plus is really cool. If you guys haven't seen this yet, it's gonna be Apple's on demand fitness classes. And it's amazing because it syncs directly to your Apple Watch. So you'll be able to see all of your metrics onscreen. And if anybody has a Peloton out there, I'm a huge fan of Peloton. What they do with being able to quantify your metrics and the integration with the Apple Watch. I do wish that they would integrate with the treadmill but I will keep my fingers crossed that there's some sort of firmware update. Because I do feel like you could just connect it to Bluetooth and be able to do that. But the fact that Apple is offering this on-demand service for 9.99. If you've never worked out before, this is gonna be a really cool way to start. Because you can work out on your phone, on your Apple TV, on all of the devices. Your iPad. So if you do have an Apple Watch, you'll be able to sync it up and be able to track all of your progress. It was kinda crazy though 'cause actually just looking at my data, I was really able to see the progress that I've made. And I haven't actually looked at that in a while. But it's really cool to see that all of the work that I've put in to trying to be healthier and work out is actually making a difference. I mean, I feel better. The data is here. I saw it with my own eyes and you guys saw it as well. We were gonna try to squeeze in a whole review but we realized that this is basically just one day with the Apple Watch. And I wanna really do this justice and kind of show you guys all of the scenarios. So we're gonna be spending the next couple of days testing this out. I'm going to test out the sleep. Test out the fitness. Test out the always on altimeter. I'm gonna take my sister hiking. And we're gonna really put this thing through the paces. One, two, three. Team! I love this thing so much already. I love the Apple Watch. I'm very excited. (jazz music)",
    "transcript_keywords": [
        "Apple Watch",
        "Apple Watch Series",
        "Watch",
        "Apple",
        "Apple Watch band",
        "Memoji Apple watch",
        "Apple Watch cases",
        "Watch Series",
        "Apple watch face",
        "watch face",
        "Apple Watch unboxing",
        "Apple Watch basics",
        "favorite Apple Watch",
        "ceramic Apple Watch",
        "fledged Apple Watch",
        "blood oxygen",
        "Justine and guess",
        "Series",
        "blood",
        "Apple Watches"
    ],
    "transcript_entity_values": [
        "all day",
        "one",
        "the next couple of days",
        "Foot",
        "2%",
        "between 98 and 99",
        "279",
        "SE",
        "329",
        "499",
        "100%",
        "the Apple Watch Series 6",
        "30 seconds",
        "the Apple Watch SE",
        "HIIT",
        "December, 2019",
        "five",
        "around 18 hours",
        "6",
        "Tyler",
        "first",
        "SE",
        "the next week",
        "One",
        "iPad",
        "ECG",
        "Peloton",
        "the 96 to 99%",
        "Fruit",
        "an hour ago",
        "The Series 6",
        "today",
        "an Apple Watch",
        "97%",
        "U1",
        "Apple TV",
        "O2",
        "Your Apple Watch",
        "second",
        "the Series 6",
        "399",
        "Justine",
        "Schooltime",
        "Memoji",
        "this morning",
        "Fitness Plus",
        "iPhone",
        "three",
        "GPS",
        "the day",
        "Activity Tracker",
        "the Apple Watch Series 6",
        "7",
        "VO2 max",
        "99%",
        "later this year",
        "ECG",
        "this year",
        "The Apple Watch",
        "10",
        "Apple Watch",
        "ECG",
        "the Solo Loop",
        "the Apple Watch",
        "98%",
        "Solo Loop",
        "Apple",
        "15 seconds",
        "iPads",
        "99",
        "the past 30 days",
        "Six",
        "four",
        "night",
        "max",
        "two",
        "Apple Watches",
        "six or a seven",
        "three months",
        "9.99",
        "Jenna",
        "the Apple Watch"
    ],
    "transcript_entity_types": [
        "DATE",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "TIME",
        "EVENT",
        "DATE",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "EVENT",
        "CARDINAL",
        "PERSON",
        "GPE",
        "PERSON",
        "TIME",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "PRODUCT",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "PERCENT",
        "DATE",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "LOC",
        "ORG",
        "FAC",
        "PERCENT",
        "ORG",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG"
    ]
}