{
    "id": "HeMIZC2rkMo",
    "title": "M2 MacBook Air Review: More Than a Refresh!",
    "channel": "Marques Brownlee",
    "channel_id": "UCBJycsmduvYEL83R_U4JriQ",
    "subscriber_count": 19600000,
    "upload_date": "2022-07-18T23:10:57Z",
    "video_url": "https://www.youtube.com/watch?v=HeMIZC2rkMo",
    "category": "Science & Technology",
    "tags": [
        "MacBook Air",
        "M2 MacBook Air",
        "M2 MacBook Air review",
        "MacBook Air M2",
        "2022 MacBook Air",
        "MacBook Air 2022",
        "MacBook Air review",
        "MKBHD"
    ],
    "views": 7219698,
    "likes": 178404,
    "comments_count": 6453,
    "description": "2022 MacBook Air M2: Impressively thin. Deceivingly expensive  Buy Apple Air M2 MacBook Pro on Amazon at  Prevent fingerprints with dbrand skins at    Dave2D:  Brian Tong:   MKBHD Merch:   Tech I'm using right now:   Intro Track:  Playlist of MKBHD Intro music:   Laptop provided by Apple for review.  ~",
    "description_links": [
        "https://geni.us/Xyfj",
        "https://dbrand.com/m2-air",
        "https://youtu.be/gqYaqBVT5vM",
        "https://youtu.be/0sGCstrkA5E",
        "http://shop.MKBHD.com",
        "https://www.amazon.com/shop/MKBHD",
        "http://youtube.com/20syl",
        "https://goo.gl/B3AWV5",
        "http://twitter.com/MKBHD",
        "http://instagram.com/MKBHD",
        "http://facebook.com/MKBHD"
    ],
    "transcript": "(upbeat music) - All right, what's up? MKBHD here. So tick-tock. That's what just happened to the MacBook Air. Not TikTok, not the short form video website. But two years ago, we had a thin, wedge-shaped, Intel-powered MacBook Air, super popular laptop. But that was also the beginning of the Apple silicon transition. And that transition to designing their own silicon would mean they could unlock levels of optimization and streamlining that were never before possible when using an off-the-shelf chip from Intel. So first, they replaced the Intel chip with an M1 chip in the wedge-shaped MacBook Air, tick. Now they've redesigned the entire computer around apple silicon with M2, tock. So theoretically, this is more than just a refresh, this is our first look at what's possible with Apple in a thin and light form factor, now that they finally designed the silicon and everything around it. And it's also deceivingly expensive but we'll get to that in a second. So with Apple's most popular Mac, I fully expect a level of, if it ain't broke, don't fix it. But to their credit, they have changed and updated mostly everything about this design and for the better. The wedge shape used to taper to appear and feel thinner at the edges, but now the whole thing is flat, it's 11 millimeters all the way across, which is actually thinner overall and I really like it this way. This is one of those shapes that you just feel like you can pick up and take everywhere, truly ultra portable. They've thinned out the bezels around the new display, which let them bump it up a bit to 13.6 inches diagonally. There's a notch in the top middle, which has become a part of Apple's design language at this point, but that quickly fades away to invisible when you're actually using the laptop. And it's housing a new 1080p webcam, that looks fine. I mean, for sure better than the old one. Also, the display is way better, it has a higher 500 nit max brightness and a lower minimum brightness for working in dim environments, which I actually found really useful when publishing the Nothing Phone review at five o'clock in the morning here. They also added MagSafe, plus the color-matching braided cable, which is a nice touch. By the way, they do include the Midnight-colored stickers with the Midnight-colored laptop, that's another nice touch. But the MagSafe charger also just means you freed up another USB type C port, and you also get that fast charging at up to 67 watts, which is nice because the battery, again, makes this a very long-lasting laptop. I'll still say the M2 MacBook Pro, which is thicker, is still gonna be an overall battery champ. But I mean the 15 hours of claimed web browsing translated for me to an entire workday of use with 20 plus percent left. It was awesome, and if I had several light days in a row with it, I needn't even really think about charging, it's great. It's not perfect though. I do still wish that they'd put USB type C on both sides. But, as of right now, it's two USB type C Thunderbolt 3 on the left, headphone jack on the right. And so, it only supports one external monitor, and if you do have an external monitor, it'll probably have to be to the left. And then, when I first got hands-on with this thing, I was very curious about the speakers, 'cause as you can see, they are pretty much invisible, unless you know where to look. But they are right up in the hinge of this laptop so I was curious if they'd be any good. And I guess I shouldn't be surprised but turns out they sound really good, they sound great. Not as much bass and thump as the bigger laptops, like the MacBook Pros, but still very, very loud and more than enough for media consumption, that type of thing, music, watching videos, all that sort of stuff. The one thing that turns out to be a downer here, as much as I've wanted to love it, is this new color. So the M2 MacBook Air now comes in Silver and Space Gray, like before, then there's a new Starlight color, which is a very faded gold. And then, this, which is Midnight. Midnight is a very, very dark blue and it absolutely changes how much blue it shows based on the environment you're in, like if the light hits it just right, it can look like a blue laptop, but in some environments, it just looks like a matte black laptop, which I think is sick. But we were right in the first impressions, this one is an absolute fingerprint magnet the instant you start using it, and it's impossible to keep clean. But then on top of that, there are some durability concerns. The normal wear and tear on the trackpad area seems fine and I've only had this for a week so I can't really test a long time use. But what we saw on the review unit that I had a couple weeks ago or the first impressions unit was around those ports, the USB-C port and MagSafe ports, if you miss plugging it in enough times, you're gonna scratch the paint and it'll be most noticeable on this dark laptop because it has silver underneath. So I guess there's three solutions. One, don't get this color, two, if you do get this color, maybe protect it with a case or a dbrand skin, that's my personal preference, there's lots of great dbrand skins to make the back of the laptop, especially, not look so ridiculous. Or three, take really, really good care of it. But overall though, the new design, I like it a lot. It is remarkably thin, it's not the thinnest and lightest laptop in the world, but it's one of those like I could carry it everywhere type things. I love using it every day. It makes me kind of jealous because I, in my normal workflow, regularly do video editing on a laptop now, so I carry around this huge 16 inch laptop. But yeah, if I didn't have to do that, I would love to carry this around. So it's fantastic. But speaking of workflow and horsepower, we've now also seen already what the new M2 chip inside this thing is truly capable of because we also took a look at the M2 MacBook Pro, and we love it, we love the CPU improvement, the GPU improvement is even more substantial, and the new higher end media engine coming down to M2 is awesome for video workflows, especially in Apple's optimized apps, it's just better than M1 across the board. But now the most popular thing that everyone's been wondering, that the most common question I got when I asked on Twitter, Instagram, I asked you guys what you wanted to know about this laptop is, what's the difference in performance between the M2 chip in a fan-cooled system, like the M2 MacBook Pro, and in the fanless system, that is the MacBook Air? Because in the short bursty stuff, it keeps up with the MacBook Pro just fine. They are very similar in performance with short, repetitive quick stuff, up to a couple minutes. But at some point, with a sustained workload, this laptop is gonna get so hot without a fan that it has to throttle to not overheat. And this one with a fan will keep going at its normal performance. Where is that point? And so, I tried it with some benchmarks, I've done it with some real world applications. And it turns out that that point is somewhere around five minutes. Seems pretty short, but when you think about it, that's a lot of sustained load. So that's not photo editing, that's not web browsing or even like coding or short bursty like benchmark stuff, a two minute benchmark won't show that difference here. I'm talking about like video editing or long renders when you have background rendering on for 5, 10, 15 minutes in a row, gaming even, things that light up all of the cores all at once for several minutes in a row sustained. And that is where the MacBook Air really gets tested. I noticed it actually heats up quite a bit right in the middle. So if your laptop's on your bare legs on your lap, you're gonna feel that. But yeah, that's where you hit the difference between the M2 MacBook Pro and the M2 MacBook Air. But this is also kind of hilarious and impressive to me because we can't forget what this machine actually is, which is it's a MacBook Air, it's the baseline, it's the entry level of their laptop lineup. So the fact that we're considering if it can handle maybe four strings of 4K video editing at once, or like big, long renders, or projects over a certain size is kind of amazing. Like, I saw Brian Tong, shout out to him and his videos, he did a giant 45 minute 20 video track 20 audio track 4K export in Premiere to really see the difference between the MacBook Air and the MacBook Pro. By the way, the difference was like 10 minutes. So thank you for going through that for us, Brian. But yeah, that's incredible because that's clearly not what this machine is really for, it's for the everyday use of 30 Chrome tabs or 15 apps open at once but not really rendering or doing any sustained loads, just like a bunch of normal stuff going on. So basically, the one thing going against this MacBook Air for me is the price. Okay, so this laptop starts at 1,199, so $1,200, which is already $200 more than the M1 MacBook Air is, which stays in the lineup, by the way. It was a pretty good laptop when it came out, still is. That's a thousand, so this is 1,200. But the baseline version also has the same SSD issue that the baseline M2 MacBook Pro had. Meaning the 256 gig version, which uses a single SSD module instead of two smaller ones, is significantly slower than the rest of the lineup. Literally half the speed and that's not insignificant. Remember, the base version also has just eight gigs of memory, right? And the M2 system on a chip means that shared memory is for the entire system. So if you're doing enough, you can actually fill up that memory pretty quickly, which is when it starts to swap over and use the SSD. And when that happens, things actually start to feel slower on this base model. So it costs another 200 bucks to upgrade it to 512 gigs, that's the version I've been testing and that's what it should have started at in the first place. Now you're sitting at 1,400 bucks. And 1,400 bucks is not the same, like super easy, magical $1,000 price point like we had with the last generation, that's a lot more. So here's how I think about this. If you are someone who's actually considering buying the new MacBook Air, I would just consider this a $1,500 laptop. Any less, if you don't wanna spend that much, then you probably should be looking at the M1 MacBook Air, it's still a $1,000, still in the lineup, still a great laptop. But if you're looking higher up for certain reasons, just know that the 14 inch MacBook Pro is just sitting right there waiting for you at $2,000. Obviously, this is very strategic by Apple and the way they've priced all this is well thought out, I guess you could say. But the point is if you're planning to do a lot more of that creative stuff, higher end workflows, sustained loads, the 14 inch MacBook Pro is a way better laptop. If I wanna spec up this MacBook Air up to a way where I think it'll be very comfortable for a couple of years doing this creative stuff, so you're gonna add the 10 core GPU, you're gonna go up to two terabytes of storage, you're gonna max it out, let's say 24 gigs of memory, which is the new max for the M2, that's already over $2,000. And that'll be a really, really nice MacBook Air and a lot of people who get it are gonna love it. But the 14 inch MacBook Pro runs circles around this laptop at the same price, and it has a way nicer screen, for that creative stuff, it has ports for that creative stuff, and it has an SD card slot, which is what most of that creative stuff is gonna need if you're doing that. So I would suggest considering it. So it's a little bit deceivingly pricey, but the sweet spot for this MacBook Air is right around $1,500, and I think if that's the one you're considering, that's the one you should go with. There's gonna be lots of people around that spec that I think are gonna really love it. But other than that, that's been my review of the fingerprintiest laptop we've ever seen, aside from all the other matte black laptops. Anyway, that's been it. Thanks for watching. Catch you guys in the next one, peace. (upbeat music)",
    "transcript_keywords": [
        "MacBook Air",
        "MacBook Pro",
        "MacBook",
        "Air",
        "laptop",
        "inch MacBook Pro",
        "Intelpowered MacBook Air",
        "Pro",
        "nice MacBook Air",
        "Apple",
        "wedgeshaped MacBook Air",
        "stuff",
        "inch MacBook",
        "thing",
        "creative stuff",
        "MacBook Pro runs",
        "Apple silicon",
        "love",
        "video",
        "USB type"
    ],
    "transcript_entity_values": [
        "45 minute 20",
        "Apple",
        "the MacBook Pro",
        "Starlight",
        "14 inch",
        "four",
        "One",
        "another 200 bucks",
        "1,400 bucks",
        "MacBook Air",
        "1,000",
        "2,000",
        "200",
        "half",
        "first",
        "two minute",
        "several light days",
        "five o'clock in the morning",
        "TikTok",
        "a couple minutes",
        "24",
        "M1",
        "5",
        "13.6 inches",
        "M2",
        "one",
        "1,200",
        "10",
        "this MacBook Air",
        "a thousand",
        "two years ago",
        "a week",
        "the MacBook Air",
        "a couple weeks ago",
        "Twitter",
        "M2",
        "over $2,000",
        "1,200",
        "two",
        "SSD",
        "Premiere",
        "around five minutes",
        "three",
        "10",
        "15 minutes",
        "Nothing Phone",
        "this MacBook Air",
        "Mac",
        "MacBook Pro",
        "M1 MacBook Air",
        "C Thunderbolt 3",
        "eight",
        "Intel",
        "16 inch",
        "Brian Tong",
        "1,199",
        "1,500",
        "11 millimeters",
        "Midnight",
        "around $1,500",
        "Silver and Space Gray",
        "SD",
        "GPU",
        "MagSafe",
        "second",
        "Chrome",
        "jack",
        "M2",
        "20 plus percent",
        "512",
        "several minutes",
        "10 minutes",
        "a couple of years",
        "256",
        "15",
        "the MacBook Pros",
        "20",
        "4",
        "Brian",
        "MacBook Air",
        "the 15 hours",
        "M2 MacBook Pro",
        "CPU",
        "Instagram",
        "500",
        "USB",
        "up to",
        "30"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "ORG",
        "MONEY",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORDINAL",
        "TIME",
        "DATE",
        "TIME",
        "ORG",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "TIME",
        "MONEY",
        "FAC",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "TIME",
        "TIME",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL"
    ]
}