{
    "id": "HemWKwd2AvM",
    "title": "Your path to success || Network Engineer in 2021",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-03-23T20:07:39Z",
    "video_url": "https://www.youtube.com/watch?v=HemWKwd2AvM",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "cisco",
        "ccnp",
        "free ccna",
        "ccna 200-301",
        "ccna training",
        "ccna certification",
        "cisco ccna",
        "ccna full course",
        "new ccna",
        "ccna course",
        "ccna exam",
        "devnet",
        "cisco devnet",
        "jncia",
        "juniper",
        "aruba",
        "devnet associate",
        "devnet cisco",
        "devnet certification",
        "python",
        "linux",
        "aws",
        "azure",
        "gcp",
        "cloud",
        "networking",
        "api",
        "vmware",
        "docker",
        "david bombal",
        "ccna study",
        "ccnp training",
        "ccnp study",
        "cisco devnet associate",
        "ccna routing and switching",
        "certs worth it",
        "network plus",
        "ccna 2020",
        "cumulus linux",
        "ccie",
        "arista",
        "cumulus"
    ],
    "views": 208187,
    "likes": 7449,
    "comments_count": 361,
    "description": "What should you be learning in 2021 to be successful as a network engineer? Which skills and trends are most important.  Menu: Top 5 to 10 technologies for learn in 2021: 0:00 Learn the fundamentals: 0:41 How do I learn the fundamentals: 2:05 Important content in CCNA: 2:34 Cumulus Linux: 3:00 Deep Work: 3:30 Do honest work: 4:50 Practical Skills: 5:10 Learn how the cloud works: 5:43 It's all free: 6:22 Learn how to automate: 6:35 Learn Git: 7:28 Cisco, Juniper or Arista: 8:42 Learn the technology: 9:30 Waves to ride: 11:52 Cisco Devnet: 13:13 Advice for younger self: 15:59 I am the smartest person: 18:25 Think first: 18:51 Skills in addition to technology: 19:20 Ivan's dumb decisions (BGP): 20:35 Another story of Ivan's mistakes (EIGRP): 22:21  ============== Book mentioned: ============== Deep Work:   ================ Previous Videos: ================ Any future for Network Engineers:  The top 10 skills Network Engineers need to learn in 2019:   ================ Connect with Ivan: ================ Website:  Twitter:  LinkedIn:   ================ Connect with me: ================ Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    ================ Support me: ================ DavidBombal.com: CCNA ($10):   Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   ====================== Special Offers: ====================== Boson software: 15% discount Link: bit.ly/boson15 Code: DBAF15P  ccna devnet cisco cisco devnet associate future of networking networking jobs ccna jobs ccnp jobs cisco jobs aws azure ccnp cumulus arista ine ccna exam ccna certification  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #ccna #devnet #cisco",
    "description_links": [
        "https://amzn.to/3f7Or85",
        "https://youtu.be/LzooeiGxKis",
        "https://youtu.be/grS__DS3v7c",
        "http://bit.ly/2Hci4oL",
        "https://twitter.com/ioshints",
        "https://www.linkedin.com/in/ivanpepelnjak/",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10"
    ],
    "transcript": "- [Announcer] Previously... - But like, if I'm starting today is there any kind of path that you would recommend someone take based on what you've seen like do I become a CCNA? Do I go and do DevNet? Is that...what are the sort of the technologies we did this before but I'd like to get an updated list. Are there any top five top 10 technologies that you think are really important and are there any...is there any path to get there? - Well, you see, it depends on whether you're looking short term or long term. Short term today, I would go with automation cloud. These are the things that will be probably in greatest demand in the next three to five years. Long-term learn the fundamentals. IP routing hasn't changed in 40 years. Ethernet hasn't changed in 40 years. Everything we did was up the speeds. 400 gig Ethernet is still ethernet. - [David] Yeah, yeah. - It's still running IPv4 and IPv6 on top of that. And it's still transporting more IPv4 than IPv6. TCP is slowly changing with quake and things like that but OSPF is there, BGP will not go anywhere. ARP will be there forever because you know if you have layer two and layer three you have to map them somehow. So regardless of what pays the bills learn the fundamentals cause eventually you will need them. - [David] Yeah. - And eventually every environment will get to a point where the network will be down and who will it troubleshoot that? The Python guys? The cloud guys? Or someone who took time and learn the fundamentals? (high upbeat music) - Okay, so what are the skills that you reckon are important? And when you say fundamentals, how would I learn that? - CCNA is not bad. Yep. - But look at CCNA not as cert. Well, yeah, we're cert It's, you know, just to prevent being thrown out of the huge pile of CVS. Yeah, just go for it and get the cert and you'll learn something, but more importantly, figure out what are the things that you should get out of CCNA. How does Ethernet at work? How does routing work? What is IP subnetting? Do they do port channels? - Yes. - Port channels, Spanning Tree, OSPF that stuff. And then, you know what? Built a lab with Cumulus VX boxes and do that same thing on Linux, just for the giggles. And then you will learn how, It's different CLI, is different approach. It's monolith versus multiple processes. But in the end you will get OSPF running between a Cisco box and a Linux host. And then you will understand how things work a little bit better than before. - So when we spoke about, it's a year ago already you mentioned like some skills like you need to learn Linux. You've kind of mentioned that again. So for the short term. So, I mean everything's short term these days, but let's say in the next two to three years, what...or five years even, what do you think are the top skills that I should learn If I'm trying to get into this industry. You've mentioned CCNA kind of like get you the basics of networking, but do you have any other like, sort of high-level skills that you think are really important? Like if you had to choose five things or 10 things what would you pick Linux perhaps? And then? - Well, we mentioned learning, right? - Yeah Yeah. Deep work. I read the book Deep Work by Cal Newport, I think? - Yeah, it's good book. - It's an awesome book. And it sent me thinking, so, your brain is your most valuable muscle. And if people are willing to spend time in the gym and train the other muscles you should train your brain as well. Which means that you should be able to take a problem and focus on that problem and work on that problem for like three to four hours uninterrupted. And if you can't do that, you have a serious problem. The other thing is just do honest work in the evening look yourself in the mirror and ask yourself did I do everything I could do today to get the job done? And if the answer is, nah, then you have a problem. - I'm gonna push you Ivan, because you've mentioned like a it's more philosophical type stuff which I think is really, really important. But are there any practical skills that you think I should, like you mentioned cloud, should I like, and I don't... if you're not happy with the question, that's fine. But like you mentioned CCNA should I go into do AWS, like associate cert? What do you think are the big trends or the certs or the knowledge that I should try and get in the next few years? - Well, definitely still don't ask me about the certs because honestly I don't care about them. - Yeah, that's fine. So give us like, sort of the technologies. - Yeah, I told you. You need some basic networking fundamentals. - Yep. - So how do networks work? Then clouds works slightly different than the traditional networks. So learn how cloud networking works. Don't only focus on networking because once you get to the cloud, it's all intermixed. - [David] Yep. It's VMs, it's storage, it's containers. It's Lambdas, it's networking, it's Load Balancing. It's security, Packet filters, application, firewalls. And you know what? It's all free. All three big cloud providers have a free tier, use it. The only thing it's costing you is your time. And then the next thing obviously is figure out how to automate stuff. So for example, you're studying for CCNA, for God's sake don't use GUI to set up your lab. (David laughs) Use Ansible, use CLI, use API, use anything but GUI. - [David] Yep. - You want to set up your OSPF lab. Don't even think about logging into five routers and typing IP addresses. What have you learned? Typing skills. Hooray, we're really need that. Automate that, learn Ansible, learn how to build configs, push configs to the boxes. You'll master CCNA, you'll master networking. You'll figure out how things work. Plus you'll learn something else. Once you start doing that don't have scribd.1.1.a.3.z on your folder. Use Git branches. Figure out how you can experiment and test things out. And destroy failed experiments and accept successful experiments with... for example Git branches. Everything you do, there is always something extra you can do to learn something else. Not just the one thing that you are working out. And you know what it's all free. Git is free. Ansible is free. Linux is free. Baseline cloud theory is free. Cumulus VX is free. Juniper vSRX 3.0 is free. Arista EOS is free. Well the Vagrant box. - Yeah. - Cisco is not free. Who cares? Oh yeah, Nexus 9000v is. iOS is not free. Forget iOS, let's move on. Sorry Cisco. Gets your house in order. - That's funny that you mentioned that cause one of the questions I wanted to ask you Ivan is Cisco, Juniper, Arista what should I learn? I mean, you've mentioned Cumulus quite a few times so you- - All of them. - All of them. - It doesn't matter. It really depends on, do you want to be a CLI jockey or do you want to be an engineer? - Yeah. - Do you have a brass mechanical engineer and an iron mechanical engineer and a steel mechanical engineer? I don't think so. - [David] Good point. - So why do we have a Cisco-CLI jockey and a Juniper CLI jockey and Arista CLI jockey they all run OSPF is just configured differently. Well, no I Arista is using industry standards CLI. (both laugh) - So in other words, you're saying learn the technology like OSPF don't worry so much about the CLI. Is that what you're saying? - Yeah. No, honestly, what I did was probably two months ago now I said, well, now I want to build a tool to set up my automation labs. - [David] I saw that, yeah. - Yeah, so I build that Python tool that takes the left topology and creates device data models. And now I can do initial config and the next step I'll do for example, OSPF or BGP or what have you. But as part of that experience, I built boxes for as many different platforms as I could get my hands on. NX-OS is downloadable, VSRX 3.0 is downloadable VMX I think isn't but it's a mess to set up anyway because they want to have two VMs one for data playing, one for control plane so just go with VSRX. - [David] Yeah. Arista is downloadable. Nexus 9000v is downloadable. Cumulus is downloadable. The problem I had was that I wanted to do this on KVM cause learn a new stuff. - [David] Yeah. - Vagrant on the MacOS or Windows. It works out of the box, you can just pull down the boxes. It all works. It's all crap, but it works and you learn nothing new. So I built all those boxes myself. And now I have a running a lib variety environment on a Linux box with automatic provisioning. And I just build the left topology and bam it goes up and now I can really test anything I want between like four different vendors. That's totally different than trying to learn the CRI commands for a single vendor. And it's not harder because they are similar. Well, ignoring Juniper, Juniper is special. But even Cumulus, once you get it up and running it's a Layer 2 stuff is special, interfaces are special. But once you get to OSPF and BGP is free range routing which is Quagga, which is really Cisco syntax. - Ivan, what do you think are the next big trends? What do you think is a good trend or trends to look at if you're just starting in this industry? So are there any waves that I can ride if I've just started? - For a young person going into IT, I would say focus on the cloud. - [David] Okay. - Because everyone will have to do something with the clouds eventually. And traditional environments will have no idea whatsoever how to do that. So, it's like when we went from Cobalt to JavaScript 30 years ago or what era it was. Or was it Java, probably more Java and JavaScript. There were tons of people familiar with the old technologies and no one familiar with the new ones and everyone wanted to be hip and use the new stuff. And probably cloud is the new stuff at least in some geographies, obviously not for Silicon Valley, obviously not for startups but for traditional IT. Do you think they can spell cloud? - [David] So something up there in the sky, isn't it? - Yeah, exactly. It's rains right? - Yeah. So Ivan you've mentioned get ready. So it's interesting. What's your opinion of Cisco DevNet and that those kinds of certifications - They can't hurt. So you see, it's always the question of where you're coming from and why you need certain things. So if you are an existing networking engineer and you think that you have to become a programmer which is a wrong idea but we can go there some other time. Then yes something like DevNet is the right thing to do because you already have networking expertise, you know nothing about Python and REST API and Git and all that stuff, you have to learn those things. If you're a developer, then you already know all those things. And if you want to be a network automation developer then maybe you should focus more on understanding how networks really work. Because you have the developers that can develop anything and are not good at anything. And then you have people who have actually worked in some industry for ages. So for example you might have a mediocre developer who has been working in chemical industry for the last 20 years. He will beat any whiskey because he knows all the dirty details. All the requirements, all the regulations, all the audits you have to go through. Whereas, someone who might be a brilliant programmer has no idea about the industry and the same thing if you want to be a good developer in network automation space then maybe it's more than Python. Maybe you should know how networks really work. - Do you think there's going to be a trend where network engineers, the traditional network engineers are replaced with guys who do automation? Is it... are we kind of all forced to do automation now? - Well, you see the way we've been doing things in the past is crazy. - [David] Yeah. - I mean, just configuring the same crap on thousands remote office routers manually and using Excel to replace the IP prefixes in your configuration- - Is the future. - What stone age are we living in? - [David] Exactly! - So, yeah, we need to clean up the crap that we're in. And one way of cleaning it up is through network automation. - You've been in this game for a long time. What would you suggest someone do if they starting out? So in other words, if you could go back in time or let's say you were 18 years old and you started today what would you tell your younger self? - Oh, my younger self, okay. - Or, anyone in the industry what would you advise? - Well that's probably a bit different, but let's start with my younger self. - Okay. - The most important lesson, technology doesn't matter as much as you think it does. So honestly, when you're young and brave and stupid you think that you can solve all the problems with throwing technology at them, it doesn't work that way. Then you play MacGyver and you solve impossible problems by configuring stuff in the way it was never designed to be configured. It works in a lab. It breaks in production. You're called at 2:00 AM. on a Sunday morning, you have to rush off to the customer to fix your crap. You learn. Then, sometimes it might work for a year or two and then you install a new software release. And of course it crashes because no one ever used the same box in the same combo with the same config. And you felt so smart. And now you feel utterly stupid and mad at the bloody vendor for sending you the bug forgetting that you are the only idiot in the world using that particular code path. So minor things like that. Oh, there's one more. Old people aren't stupid contrary to what all the youngsters believe. And I'm not like defending myself. I was in that position. If they do something and you think it's totally stupid, it might be. I mean, after all, they might have stopped thinking after a while and just do things the way they do things because they've always done things that way. But there usually is a reason behind that the reason might be irrelevant or it might be wrong or whatever. But you have to find out the reason first before you're trying to fix stuff. There's this English saying Ken I always forget what it is about not moving a fence that you encounter if you have no idea why the fence is there. - Yes, I mean basically you were like that when you were younger. I think most of us were- - Oh yeah, off course - You knew better than other people,- - Everyone else, of course. - Especially if they were older- - I was the smartest person in the universe. - Of course. So, I mean, the running joke today is like boomers get out the way. So, you basically telling yourself if you were younger, that's a mistake. Is that right? - Well, think first. That's the most important message. There's a reason people are doing things figure out what the reason is. Don't just rush in and take over and do your stuff thinking you know best. Sometimes you do know better. Sometimes they do stuff for stupid reasons. Sometimes they really are boomers, but sometimes there's something behind it that you just don't get. - So even if... my counter to you would be like technology's changing the world. I mean, when we were kids, Facebook didn't exist Instagram, all these massive websites. So surely technology is really, really important. Or what are you saying to your younger self that you should learn apart from technology - Listening. That's a good one. - People skills, communicating, listening. Did I say listening? - You did. (both laugh) - Listening. The most important thing is listening to what people are telling you and trying to understand what they're really saying, not what you're hearing. Cause sometimes, a lot of times we have a problem because they're using their terminology and you think it means something else and in the end you do something or you implement something that is total crap. Like my favorite one, you know it's stretching VLANS across two data centers. - [David] Layer 2 your favorite - Layer 2 into the cloud. - Yep, that sounds like a great idea. - Yeah, it's awesome. I mean, earth is flat, right? What could go wrong? - I've heard this a lot. People talk about people skills and doing things differently. But the question I wanted to really ask you is give us an example of where you really messed up where if you had your wisdom and the experience that you have today you wouldn't have perhaps gone and done something. So it's always nice to get a story of where you made a mistake. - Like...things like debug, IPBGP on the core router that connected a country to the wider internet. - [David] That sounds like a good example. So tell us a bit about that. - Well, we were setting up a BGP feed with the upstream provider, and we already had a number of production customers on data box that was the router. That was the hub of the commercial internet in Slovenia and BGP. We were getting some prefixes and I got the route maps wrong or something. So of course, what do you do? Debug IPBGP. Let's see all the updates. Well, yeah, a hundred thousand updates later on a console port of a Cisco router. The real problem is for the youngsters who don't know that in the good old days, I don't know whether that still works today. You were able to break into iOS on the console port until you would send the brake signal and you would be in a debugger. - Yeah. - Which means that console must be the highest priority interrupt on the system. Otherwise, something could lock it out. Now imagine that you are generating thousands of highest priority interrupts per second just because someone is printing debugging messages to the console. Obviously they router just goes like, ah I don't want to live anymore. - You know it's great to hear stories like that because you very respected. And I mean, these days, people look at you and think, this guy can't make a mistake. So it's great to hear that. You are actually human - No, Designing a network with 20 parallel ERG processes. - You did that. - Yeah, It worked. - Is that an example of you, like you said earlier you taking your technical knowledge and trying to fix a bad design. Like, I mean I think you've mentioned this in other videos where you talk about like OSPF craziness and just trying to sort out mad stuff because you can. - Yeah, when you're young and crazy, you think that you can solve every problem out there with technology. - Yeah. - And yeah, my ERPG design was one of those things. Effectively, the customer needed MPLS VPN and we told them how to do stuff and install the core routers and then install the routes filters on the core router so that the edge routers will only get certain prefixes. They had a shared address space for everyone and MPLS VPN wasn't even on the drawing board. So we couldn't use that. And the customer said, no, no, no, no. For political reasons, it has to be framed relay in the middle from company X and routers at the edges bought from our company. The pie chart diagram, every supplier has to get certain percentage of the business so no one will a complain. Layer nine or 10th, right? - Yep. - In the OSI model. And so we had to do something and they wanted... think they wanted to implement the whole thing with Frame Relay DLCI so that every tenant would have its own partial mesh of Frame Relay Circuits. But there was this still this problem of the web. There were two problems. One was that they had the central site and everyone had to connect to that central site. And then you get route leaking and isolation is gone. And even more interestingly they had multiple tenants sitting in the same building and they were not keen on buying a router per tenant. I don't know why. I mean, after all, they wanted to have Frame Relay and you know, anyway, so we solved that thing by running, yeah. One EIGRP process per customer. - [David] Men! - Yeah, and I even asked the friends at Cisco TAC what they think about that. And they go like, yeah, it should work, but do remember that you are the only one in the world doing that. So you might encounter a few extra bugs. - Oh wow. And I'm assuming that's what happened, yeah. - No, actually that thing worked, it was too successful. - Too successful. So you can like solve every problem now. - Well, yeah, they thought so. So what happened was that the customer took that ran with it and then they figured out that they needed to provide internet access to those locations and central services and something else. And Oh, and they had the regional hubs. So in the end it was this orthogonal matrix of EIGRP processes per regions and EIGRP processes per tenant. It's two way redistribution between them. - But at least you had a job security, didn't you? - Well, someone, another consulting company took over that design and they were milking the customer for years - I could imagine. - But yeah, they had job security. (high upbeat music)",
    "transcript_keywords": [
        "Yeah",
        "things",
        "learn",
        "work",
        "thing",
        "stuff",
        "OSPF",
        "CCNA",
        "free",
        "cloud",
        "Cisco",
        "problem",
        "mentioned",
        "years",
        "people",
        "CLI",
        "works",
        "things work",
        "Linux",
        "skills"
    ],
    "transcript_entity_values": [
        "these days",
        "Linux",
        "three",
        "nine or 10th",
        "Java",
        "the next two to three years",
        "Cisco",
        "the last 20 years",
        "three to four hours",
        "two",
        "Arista CLI",
        "Instagram",
        "Juniper, Juniper",
        "second",
        "Juniper CLI",
        "Python",
        "MacOS",
        "2:00 AM",
        "English",
        "NX",
        "Linux",
        "thousands",
        "18 years old",
        "OSI",
        "a year ago",
        "Cisco DevNet",
        "20",
        "Cisco-CLI",
        "CRI",
        "Facebook",
        "Ivan",
        "EIGRP",
        "Cumulus",
        "API",
        "Cumulus VX",
        "today",
        "30 years ago",
        "a hundred thousand",
        "Spanning Tree",
        "Frame Relay Circuits",
        "between like four",
        "one",
        "Cisco TAC",
        "five years",
        "Cisco",
        "Frame Relay",
        "Nexus",
        "Sunday",
        "first",
        "the good old days",
        "Juniper",
        "Cobalt",
        "- Ivan",
        "two months ago",
        "VPN",
        "Juniper vSRX 3.0",
        "CCNA",
        "AWS",
        "CCNA",
        "years",
        "KVM",
        "VSRX",
        "David",
        "Git",
        "IP",
        "Slovenia",
        "Linux",
        "Ansible",
        "two VMs",
        "Ken",
        "CCNA",
        "the next three to five years",
        "10",
        "Ansible",
        "the next few years",
        "MPLS",
        "Arista",
        "Cal Newport",
        "40 years",
        "five",
        "One",
        "2",
        "BGP",
        "Excel",
        "Ansible",
        "DLCI",
        "Arista EOS",
        "400",
        "Deep Work",
        "OSPF",
        "JavaScript",
        "Silicon Valley",
        "a year",
        "GUI",
        "Cisco",
        "CCNA",
        "MacGyver",
        "VMs",
        "CLI"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "LANGUAGE",
        "ORG",
        "GPE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "PRODUCT",
        "ORG",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "LOC",
        "DATE",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG"
    ]
}