{
    "id": "her8pgQq2tU",
    "title": "HOW does this make sense!?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-02-27T03:17:32Z",
    "video_url": "https://www.youtube.com/watch?v=her8pgQq2tU",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Valve",
        "Steam",
        "apple",
        "epic games",
        "lawsuit",
        "data",
        "sales",
        "judge",
        "subpoena"
    ],
    "views": 710841,
    "likes": 42031,
    "comments_count": 1874,
    "description": "Dr.Fone WhatsApp Transfer Tool:  Whatsapp Transfer step to step guide:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 WUZ HAPPENIN 0:11 RTX 3060 launch 1:34 Valve forced to give Apple data 2:36 Chip shortage getting worse 3:45 Dr. Fone 4:18 QUICK BITS 4:22 Stadia reports 4:53 Australia passes link tax law 5:30 Cyberpunk 2077 update delayed 6:01 Twitter Super Follows 6:35 Hey Facebook  NEWS SOURCES  GPUS? THEY ARE ONLY LEGEND RTX 3060 launched     Nvidia CMP GPUs are Turing, not Ampere    RELEASE THE VALVE Judge orders Valve to give some info to Apple        THE BIG VERY BIG SHORT Shortage is gonna get worse  shortages to persist   Biden    QUICK BITS  GOOGLE USED MONEY! ITS NOT VERY EFFECTIVE Stadia revelations       GET STUFFED, YA BOGAN Australia passes news law anyway    I CANT JACK IN CD Projekt devs locked out of workstations following hack    WELL THATS JUST SUPER Twitter announces Super Follows, tipping, and groups, wheres the effing edit button     OH HI MARK Oculus Quest 2 and Portal devices respond to Hey Facebook    ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "http://bit.ly/2KZ2SPl",
        "http://bit.ly/2YvivRr",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://youtu.be/kAJAViPWR_8",
        "https://www.theverge.com/2021/2/25/22301391/nvidia-rtx-3060-launch-supply-demand-newegg-shuffle",
        "https://hexus.net/tech/news/graphics/147473-nvidia-cmp-40hx-cmp-30hx-confirmed-turing-gpus/",
        "https://linustechtips.com/topic/1309663-valve-ordered-to-give-apple-information-on-436-steam-games-as-part-of-epic-games-legal-case/",
        "https://www.macrumors.com/2021/02/25/valve-apple-data-request-for-epic-games-case/",
        "https://www.gamasutra.com/view/news/377970/Valve_ordered_to_comply_with_Apples_request_for_Steam_data.php",
        "https://www.reuters.com/article/us-taiwan-drought-semiconductors/chipmakers-in-drought-hit-taiwan-order-water-trucks-to-prepare-for-the-worst-idUSKBN2AO0G3?utm_source=reddit.com",
        "https://www.tomshardware.com/news/chip-shortages-to-persist",
        "https://venturebeat.com/2021/02/26/ai-weekly-biden-calls-for-37-billion-to-address-chip-shortage/",
        "https://www.wired.com/story/google-stadia-games-entertainment-collapse/",
        "https://twitter.com/jasonschreier/status/1365375468594167816",
        "https://twitter.com/jasonschreier/status/1365376842765651970",
        "https://arstechnica.com/tech-policy/2021/02/australia-passes-law-to-force-facebook-and-google-to-pay-for-news/",
        "https://apnews.com/article/australia-law-google-facebook-pay-news-959ffb44307da22cdeebdd85290c0cde",
        "https://www.extremetech.com/gaming/320326-cyberpunk-2077-patch-delayed-as-cdpr-employees-cant-use-their-pcs",
        "https://www.bloomberg.com/news/articles/2021-02-24/cd-projekt-hack-severely-disrupts-work-on-cyberpunk-game-updates",
        "https://www.engadget.com/twitter-test-communities-tipping-super-follows-183101868.html",
        "https://www.gsmarena.com/twitter_announces_super_follows_and_communities_features-news-47950.php",
        "https://www.iphoneincanada.ca/news/hey-facebook/",
        "https://www.theverge.com/2021/2/25/22301697/oculus-portal-smart-display-hey-facebook-wake-word-quest-headsets",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Today's the day. It's actually happening. In fact, it already happened. Well, isn't that cool? I've never seen anything like it. - [Man] What happened? What what? - Hey, want some tech tips? - [man] what happened? - NVIDIA launched the RTX 3060 graphics card yesterday, and by launched, I mean, shuffled a few boxes through their doggy door, where they were promptly set upon and devoured by the starving hoards of gamers. Of course, it's no surprise that the cards sold out almost immediately given the ongoing stock shortage which is a shame since it's actually a decent mid-range card and a worthy successor to the GTX 1060. As I said in the full review, online at tech tips. Newegg is now raffling off chances to buy cards, which is just bonkers. - [Man] But overall But overall. It seems like invidious plan to cripple the 3060s mining power and introduce mining specific cards down the line. Didn't do basically Jack all for availability. However, according to a new leak in video's first two mining cards, the CMP 38 checks and 48 checks appear to be based off of Turing 12 nanometer GPUs instead of ampere eight nanometer GPUs, which is of course what the RTX three series is built on. So maybe they do have our best interests in mind after all. Stay tuned for later in the year when we find out that the 50 X is built on ampere and NVIDIA stole eight nanometers GPUs from the RTX division to make them ha ha or maybe not but maybe they will, - [man] Oh but I'll definitely make a video about it. A judge has ordered Valve to comply really? - [man] Ha ha ha That's so stupid. - [man] Oh I love it A judge has ordered valve to comply with Apple's subpoena asking for steam game sales data after Valve initially refused to provide it. But then instead of submitting data from as early as 2015 Valve will only have to go back to 2017 with the judge remarking that Apple has salted the earth with subpoenas in its quest to repel attacks from Epic games over the iOS apple stores, monopolistic practices. - [man] You get some dinner, you get us some dinner - Thanks for that. Apple says that their request is perfectly reasonable. I mean, they only asked for data on 436 games instead of 30,000 Steam Games. They totally could have done that. So you should be grateful. Valve, Valve apparently has until mid-March to comply with the order or else the company's conflict will be decided with a one V one between Team Apple and gave in, in that's right, there on it - [man] Neutral ground. - And the semiconductor shortage affecting every product that uses chips, which is basically every product is reportedly going to get worse. Thanks in part to another type of shortage in Taiwan. The country is experiencing a massive drought, so chip makers like tsmc are buying truckloads of water in an attempt to get out ahead of the national water supply restrictions, so they can continue production. Because you see, their plants run on hydrogen fuel cells. - [man] Wow, - Wow, just kidding, the people who work there need to drink water ha ha and also you need water for other stuff for manufacturing. Anyway, aside from that, market analysts believe that it will take three or four quarters. So a year before semiconductor supply meets demand. The situation is so bad that US president Joe Biden signed an executive order this week launching a review of the supply chain, and committing $37 billion to addressing the chip bottleneck, right? I mean, we're a little late there, Joe - [man] Yeah - where was the executive order a year ago where he's getting rid of the tariffs, but - [man] Yeah - whatever, sup Riley - now it's time for quick bits brought to you by Dr. Fone, the seamless way to move your chat app message history between iOS and Android devices. It's like you're getting an organ transplant except the organs, are your messages and attachments from WhatsApp, WhatsApp business, line, Viber, Kik or WeChat. and you can backup those organs too, nice. The good Dr. Fone also lets you preview and check any item you want and export it to your computer as an HTML file for reading or printing all while being completely secure. So check out Wondershare Dr. Fone by clicking the link below. - Thanks Riley. Hey, did you ever hear of BitQuicks - [man] Woo - Bloomberg and Wired have both published deep dives into just what the heck happened to Stadia? Well, it turns out despite a lot of big talk the service received drastically lower sales than expected, and spent tens of millions of dollars per title, really? just to port major games from publishers like Ubisoft and Take-Two. Stadia's leaders were presumably shocked that such a strategy could lead to overspending. But I mean, I don't know what were they supposed to do with that money pay news publishers - [man] Hey - Australia has gone ahead and passed legislation designed to force Google and Facebook to pay for links to news articles, even after the two tech giants spent the last two weeks frantically making deals with publishers. The law is a bit Tamer than its original version. Now giving tech companies a longer window of time to make such deals before being forced into arbitration. But, it's there now. So let's just hope that Google doesn't make the Koch brothers, Is that really how you pronounce this Ko Koch? I'm going to go with Koch brothers. Let's hope it doesn't make them go out of business when they suddenly realized this is costing a lot of money, which I, yeah but I guess would be fine. Cyberpunk 2077 won't be getting its next update until mid-March, thanks to the notorious ransomware hack that struck developers CD PROJEKTRED. The companies developers are reportedly, still locked out of their workstations. Oh no, we can't run good heavens because the hack which makes well, patching to gain a little Trixie - [man] Have you tried? - Although the source code might actually be out there somewhere on the internet. So maybe the, maybe the devs could like hack it back from the hackers hack exception. And Twitter announced that they're testing a community's feature similar to Facebook groups, as well as other features that could help monetize the social platform including tipping options and super follows Which would give paid subscribers access to special super tweets, from it's coming. Super tweeters - [man] There it is - Question though, I mean, would any of you pay for photos of me with it like (smooth music) half of my clothing removed? - [man] Oh no - Hey hey don't don't tell anybody - [man] No - it's only for the fans. - [man] Yeah it is superman. And Facebook's portal device as well as the Oculus Quest too will soon respond to the phrase hey, Facebook and execute voice commands. Oh, goodie. Um, how about this? Hey, Facebook, let Oculus go, let them go, Oculus if you're in their blink twice. - [man] Oh you're a good singer - Hey Facebook, if you're listening this episode is over by the way. So we'll come back on Friday for more tech news. The rest of you. Hey, you're not Facebook. Go celebrate. - [man] Hey you're not Facebook - Woo - [man] Okay",
    "transcript_keywords": [
        "Hey",
        "Facebook",
        "Today the day",
        "Valve",
        "Apple",
        "make",
        "Hey Facebook",
        "cards",
        "tech",
        "ordered Valve",
        "games",
        "Yeah",
        "RTX",
        "singer Hey Facebook",
        "Hey hey",
        "Fone",
        "Koch",
        "water",
        "Facebook Woo",
        "Oculus"
    ],
    "transcript_entity_values": [
        "half",
        "30,000",
        "yesterday",
        "tsmc",
        "CMP",
        "Stadia",
        "the day",
        "GTX",
        "a year ago",
        "Wondershare",
        "3060s",
        "Trixie",
        "Facebook",
        "three",
        "Viber",
        "Valve",
        "$37 billion",
        "one",
        "US",
        "1060",
        "Newegg",
        "Riley",
        "NVIDIA",
        "Google",
        "Fone",
        "Jack",
        "eight nanometer",
        "mid-March",
        "WhatsApp",
        "RTX",
        "the last two weeks",
        "436",
        "2077",
        "Twitter",
        "Joe",
        "38",
        "Friday",
        "Joe Biden",
        "48",
        "tens of millions of dollars",
        "as early as 2015",
        "50",
        "2017",
        "three or four quarters",
        "WeChat",
        "first",
        "Koch",
        "Australia",
        "two",
        "Ubisoft",
        "later in the year",
        "Facebook",
        "Android",
        "Team Apple",
        "BitQuicks",
        "iOS apple stores",
        "Turing 12 nanometer",
        "Taiwan",
        "this week",
        "3060",
        "Ko Koch",
        "Apple",
        "Kik"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT"
    ]
}