{
    "id": "herYV5TJ_m8",
    "title": "LG Gram 15 TEARDOWN - Drop Test Followup!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-06-07T13:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=herYV5TJ_m8",
    "category": "Howto & Style",
    "tags": [
        "LG Gram durability test",
        "LG gram Drop test",
        "LG Gram teardown",
        "Upgrade",
        "RAM",
        "M.2",
        "SSD",
        "Hard drive",
        "LG",
        "Gram",
        "LG Gram",
        "LG Laptop",
        "laptop durability",
        "LG ultrabook",
        "Laptop",
        "Notebook",
        "Ultrabook",
        "Battery",
        "15-inch",
        "test",
        "durability",
        "drop test",
        "durability test",
        "smartphone",
        "ssd",
        "m.2",
        "ram"
    ],
    "views": 364009,
    "likes": 11796,
    "comments_count": 1338,
    "description": "LG Gram 15 current Pricing:  During my LG Gram Durability test video, I dropped the super light weight laptop several times from desk height onto the carpet floor. Several people mentioned in the comment section that I needed to be a little more extreme with the drops, and I agree! It is time to add concrete into the mix. Concrete stairs.   Watch as I follow up on the LG Gram durability test video, AND then take apart and tear down the high end laptop from LG to see how it works from the inside. The RAM is modular as well as the internal hard drive.   I used this tool Kit:  Green Pry tool:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://www.lg.com/us/laptops/lg-15Z970-AAAS7U1-ultra-slim-laptop",
        "http://amzn.to/1XdJPuA",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "[Intro] So I did a durability test on the 2017 LG Gram and it went pretty well, but there were a few suggestions. A few people wanted to know what the camera lens was made out of. It looks like its made out of plastic, but since this isnt like a portable, in your pocket device, I dont think thats too big of an issue. Another person wanted to know if the charging port still worked, which it does. You can see it charging here in the corner. Surprising to me, though, was that some of you said the drop test wasnt violent enough. So lets try it one more time on some concrete stairs. Check it out. Looks like we got a little damage on the edges here on the corner. Lets see if it still works. And it is still functioning! Looks like were still in one piece. We got a small bend right there on the corner. But everything else still works. Thats pretty impressive. Dropped it down about 8 stairs there. So now that we know the laptop can survive a 200 pound guy standing on it, being dropped normally on a carpeted floor, and being dropped down a flight of concrete steps, lets take it apart and see whats inside. Im curious to see how big the battery actually is inside of this thing. This laptop was given to me by LG to durability test and teardown, which is rather brave of them. Opening up the laptop is actually pretty easy. It needs to be turned off first. And then all of the Philips head screws are hidden under these circular tabs and rubber boots. There are 8 screws total. Even without the screws in place, the back is still very solidly snapped into the frame so it takes some pretty heavy prying to remove it. And look at the size of that battery. Ill talk more about this in a second, but its a 60 watt hour battery with an advertized life span of 17 hours - pretty darn impressive for a laptop. Its got a copper heat pipe system over the processor similar to what we saw inside the LG G6, except for this one also has a fan attached to it. Speaking of cool, the ports are detached from the motherboard and on a separate PCB. I imagine this is to help keep the laptop super thin, but its also good for reparability. If one of your ports breaks, you dont need a new motherboard, you can just swap out the less expensive smaller boards. We have two USB ports, the headphone jack, and a micro SD card slot on this side. And on the far side we have a charging port, another USB port, an HDMI and a USB-C port. This laptop needs zero dongles in order to be useful its ready to rock right out of the box. Speaking of useful, LG has upgradability, longevity, and reparability in mind when designing this laptop. The RAM is modular. If you were to buy an Apple laptop, this would be soldered onto the large motherboard which is not replaceable or upgradable. But with this LG Gram, in a few years when the specs are outdated, you can just plop in a higher capacity RAM stick and continue being productive. Same thing with the hard drive. This laptop comes with 512 gigabytes, but a few years down the road as games and video files keep increasing in size, you might want to upgrade. This M.2 slot allows for upgrading hard drives. If you were to buy a new MacBook from Apple a few years from now, youll be left high and dry with no upgradable hardware, so Im super glad that LG is still looking out for consumers. Thumbs up for that. On to the battery. There are 6 screws around the edge of this gigantic thing. I can unclip it from the motherboard and the 60 watt hour battery comes loose. It looks like it has 4 separate quadrants inside of it which is interesting. Looks like the touchpad is replaceable. And another cool thing I noticed when I tossed it down those concrete stairs is that there are super strong magnets in the base and the lid holding it together. Since this laptop is so lightweight, the magnets make sure that the lid doesnt fall open on accident. And lastly, if your screen does break somehow, the hinge connectors are here, along with the attachment to the motherboard. The Whats Inside YouTube channel dropped one of these laptops from 25 feet onto concrete and it still lived. So a broken screen is going to be pretty rare. Ill clip that battery back in with its 6 screws. And then that back panel made from the special nano carbon magnesium alloy snaps into place with 8 screws for extra security. Overall, this laptop is a solid and durable build with ports and replaceable components. So it gets a thumbs up from me. As with all electronics, the price is always changing so Ill add a link in the video description for the most current up to date pricing on this laptop. Huge thanks to LG for sending me this one to review. And let me know in the comments which laptop you want to see me review next. Thanks a ton for watching. Ill see you around.",
    "transcript_keywords": [
        "laptop",
        "pretty",
        "battery",
        "screws",
        "inside",
        "motherboard",
        "port",
        "ports",
        "charging port",
        "made",
        "Dropped",
        "Ill",
        "concrete",
        "thing",
        "charging",
        "test",
        "corner",
        "Apple laptop",
        "durability test",
        "stairs"
    ],
    "transcript_entity_values": [
        "a few years from now",
        "HDMI",
        "6",
        "8",
        "MacBook",
        "SD",
        "RAM",
        "2017",
        "60 watt hour",
        "two",
        "512 gigabytes",
        "jack",
        "Philips",
        "4",
        "zero",
        "a few years",
        "Apple",
        "first",
        "second",
        "PCB",
        "17 hours",
        "M.2",
        "G6",
        "YouTube",
        "USB",
        "25 feet",
        "one",
        "about 8",
        "200 pound",
        "LG"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG"
    ]
}