{
    "id": "HFFVIalG_nk",
    "title": "iPhone 11 Recap",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-09-12T15:52:34Z",
    "video_url": "https://www.youtube.com/watch?v=HFFVIalG_nk",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "iphone 11",
        "iphone 11 pro",
        "iphone 11 pro max",
        "apple event",
        "new iphone",
        "new iphone camera"
    ],
    "views": 993371,
    "likes": 32010,
    "comments_count": 3559,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- I am just getting back from the Apple Event and I had such an awesome time, and thank you guys so much for subscribing. I also just hit six million subscribers, so this has been a really awesome and a crazy week, and I could not do it without you guys. So a huge thank you to everybody who followed along on this iPhone journey and adventure this past week. And I cannot wait because the iPhone and the Apple Watch, it'll all be here before we know it. So now that I'm back, I've had a little bit of time to decompress and think about the Event. The main highlights, of course, in case you did miss it is they announced three new iPhones. There is the iPhone 11 which comes in five different colors. And the iPhone Pro and the iPhone Pro Max. The iPhone Pro comes in four colors now, a silver, a gold, and a Space Gray, and this new color which is a Midnight Green. And seeing the Midnight Green in person was actually really cool, because the color that they showed during the keynote, it was kind of like a muted color, sort of washed out. But when you see it in person, every single time that I've moved it around in different lighting, it always looks different. And I really actually like the color a lot. Although for me personally, even though it's not Friday yet, I haven't done my pre-orders, I think I'm gonna go with the silver because I did order the white ceramic watch, so I would like for my phone and watch to match. The main difference between the iPhone 11 Pro and the regular iPhone 11 is the cameras and the display. So the iPhone 11 has an LCD display, whereas the iPhone Pro has a Super Retina OLED XDR display. There was some crazy long term that they called it. The iPhone 11 also only has two cameras. Only, it's like, okay, it only has two cameras? It has two cameras because the XR still only had one, so this is an addition and an upgrade. The iPhone Pro has three cameras. It has an ultra-wide telephoto and a wide-angle lens. And the front-facing does 4K. It's also been bumped up to 12 megapixels, so you're definitely getting better photos. You're also able to do slo-mo video front-facing. And I do shoot a lot of front-facing video when I'm vlogging. So the Pro's three cameras are the ultra-wide, the wide, and the telephoto lens. So being able to have those three cameras gives you a lot more flexibility when you're filming. And it's cool because when you are filming, you'll still be able to see the outside frame of whatever else would potentially be in-frame if you switched lenses. So that's something that a lot of these other phones don't do. They may have these multiple cameras, but they're not really using them all at the same time. And that brings us to FiLMiC Pro. I've used this app before, but it's kind of something that really lets you take advantage of your iPhone camera. But this new version of FiLMiC Pro, you are able to see all of your cameras at the same time. And this is really cool, because that's something that I've never seen before. And something that I think is gonna be fun for vloggers and content creators, you'll be able to film using two of those angles at the same time. So if I want to film a front-facing but also a rear-facing camera at the same time, you can. So I can't wait to try that out. I'm not sure when the release of the new FiLMiC pro will be out, but when it is, I'll definitely be doing some extensive coverage of that. The introduction of the new ultra-wide is something that is not new, that we've seen that in films before and it has been something that I've been really wanting on the iPhone. He also talked about this new Deep Fusion photography, which is like a computational math, scientific, mad scientist. I don't remember his exact precise words. So it's basically using AI to generate a more detailed photo. So that will be a software update later this year. But I can probably sit here and talk for the next like five hours about everything that they discussed. I just wanted to do a quick little recap, and this doesn't seem to be so quick, is it? Being able to shoot in the ultra-wide is gonna be so fun for video and vlogging, and doing landscape photography. So I cannot wait to get my hands on this thing and really test it out. I think the big question for a lot of people is do I need to spend the extra money to get the Pro, or will I be perfectly happy with the 11? Do I need to upgrade if I have a XS? Do I need to upgrade if I have a X? I think really I would just encourage you to go to the Apple store if you are on the fence and test it out. Do the photos look different than the phone that you already have? Is this something that is going to make a huge difference in your life? Is this something that you have the extra money to spend? If you are a content creator, I definitely think that it is something that you should consider, because a lot of the stuff is investing in your future, in your career, and in your content creation. They also announced a new iPad which I tested out at the event. And I was playing Apple Arcade on it and I'm kind of really excited about Apple Arcade, mostly because it is something that you can play across all platforms. You can play on your phone, you can play on your iPad, you can play on Apple TV, you can play on your Mac. Like, it's really cool how this is all just integrated into the Apple ecosystem. And it's also really cool because you can use a controller, yes, a freaking Xbox controller, or a Playstation controller on your Apple TV, or on your Mac, or on your phone, or your iPad. That is something that I never thought in a million years would ever happen, and when they announced that at WWDC I was like, yeah, that's cool. So Apple Arcade is 4.99 and also, Apple TV+ is 4.99. I thought that they would announce some sort of a bundling service, but I feel like maybe later on down the line they will. But both of those prices was way less than I thought it was gonna be. But that also could be is they wanna keep those costs a little bit lower because if you do buy an iPad or an iPhone, you're gonna want things to do on it. So keeping you in that ecosystem and keeping those prices down, I feel like more people will have access to it and be willing to spend those extra dollars. But the good news is they said that you will get a year free when you buy a new iPhone or an iPad or a Mac, or anything like that. So that is a nice little added bonus. They also announced an Apple Watch Series 5, which I was very excited. I kinda didn't think they were going to. I'm not sure why I thought they weren't. But it doesn't matter what I thought because they did. They announced a few different new watch faces. They have a new titanium, and also a brushed black titanium. They have a new ceramic which is the one that I ordered, and I can't wait. 'Cause they obviously have the cellular and GPS in the aluminum versions. They have some new Nike ones. They have a new Hermes black band, which is so cool. It looks amazing. But yeah, I went back to the ceramic. I had the ceramic years ago and it still is just my favorite look, especially if I get the silver phone. They're gonna match perfectly, and I just, (breathes deeply) I said I can't wait because I, well, I guess I have to wait, I don't have a choice. But either way, it's gonna be here so soon. I would love to hear from you guys, though. What did you think of the Event? Which phone was your favorite? Are you going to upgrade? Are you not gonna upgrade? Leave me all of those comments below and I'll be chatting with you guys in the Comments. So we've got new phones on the way, we've got new watches. We got a new iPad. We have Apple TV, we have Apple Arcade. I'm trying to think if there's anything that I'm missing. I probably should've took some notes, but I didn't. Anyway, we're back on the white wall for iPhone season. I just wanted to kinda give it a nice little throwback, especially for the six million sub milestone. A lot of you guys said you guys missed the white wall, so I thought let's bring it back for a bit. There will be plenty more iPhone and Apple Watch and Apple content coming up this month, so make sure you guys are subscribed. And I will see you soon. Make sure you're following me on Twitter and Instagram too. 'Cause if you're not, I'm gonna be sad.",
    "transcript_keywords": [
        "iPhone Pro",
        "Apple",
        "iPhone",
        "Pro",
        "Apple Arcade",
        "iPhone Pro Max",
        "Apple Watch",
        "cameras",
        "FiLMiC Pro",
        "Apple Watch Series",
        "lot",
        "Watch",
        "time",
        "cool",
        "Midnight Green",
        "guys",
        "phone",
        "Apple Event",
        "wait",
        "Pro Max"
    ],
    "transcript_entity_values": [
        "12 megapixels",
        "WWDC",
        "Nike",
        "the Apple Watch",
        "iPad",
        "Apple TV",
        "XR",
        "Apple",
        "4.99",
        "Apple Arcade",
        "Deep Fusion",
        "Mac",
        "iPhone",
        "Instagram",
        "three",
        "XS",
        "Apple Arcade",
        "this month",
        "LCD",
        "Hermes",
        "slo-mo",
        "Xbox",
        "Playstation",
        "iPhones",
        "four",
        "this past week",
        "five",
        "a million years",
        "those extra dollars",
        "later this year",
        "two",
        "the next like",
        "the Apple Event",
        "AI",
        "Twitter",
        "a crazy week",
        "11",
        "The iPhone Pro",
        "Apple Watch",
        "the iPhone Pro",
        "Mac",
        "six million",
        "Friday",
        "the Midnight Green"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "FAC",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "FAC",
        "FAC",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PRODUCT",
        "NORP",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "WORK_OF_ART"
    ]
}