{
    "id": "HfnQfO9p5EE",
    "title": "About That Pixel 4...",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2019-03-27T20:28:11Z",
    "video_url": "https://www.youtube.com/watch?v=HfnQfO9p5EE",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "pixel 4",
        "pixel 4 XL",
        "google",
        "hole punch",
        "samsung s10",
        "galaxy",
        "smartphone",
        "best pixel",
        "best android",
        "leak",
        "huawei",
        "pixel 3 XL",
        "pixel 3"
    ],
    "views": 647351,
    "likes": 18386,
    "comments_count": 1427,
    "description": "An early look at leaked details of the Google Pixel 4 XL. The best smartphone from Google with the Samsung Galaxy S10 Hole Punch Pixel Phone for Cheap -  Phone Skin -   Background Music Fili - Daydream  Leak From:   Concepts from:    If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2OrPT65",
        "https://www.dbrand.com",
        "http://www.slashleaks.com/l/alleged-pixel-4xl-design",
        "https://twitter.com/PhoneDesigner",
        "https://twitter.com/VenyaGeskin1",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Recently, there was an alleged leak as to what the Pixel 4 XL would look like. And it was a very primitive leak. It wasn't particularly revealing. It was just a line drawing of some sort. But, the internet ate it up. We all loved the idea of what that leak suggested. A couple renders were made of it and a lot of websites were making articles about this thing. But, it was the idea of what this thing represented that was so special. So, what that leak suggested were three, kind of, stand out features. The first is the disappearance of the GIANT notch on the Pixel 3 XL. This is one of the biggest notches in the industry, it's one of the ugliest notches right now. And they removed that and replaced it with a pill shaped cut out which is similar to the screens that we see on S10 devices. Those phones have an exclusive on the Samsung OLED punch hole screens, but that exclusivity is supposed to end some time this year, which would line up nicely with the Pixel 4 launch in October. The second feature that kind of stood out was the removal of the fingerprint sensor on the back. Again, this is based on an alleged leak, but the removal of that fingerprint sensor will imply there's an in-screen fingerprint sensor. And the third feature is the presence of a dual camera system on the back of the phone. This is the first time a Pixel phone would ever have a double camera on the back. So, it's not that this leak is super unique or super cool Because, like, leaks are leaks right? We have no way to really judge the validity of that leak BUT It is what that leak represented and the way internet acted to this that kinda speaks volumes about Google Pixel Phones in general. See... There is always been problem with Pixel devices They have excellent software like literally the best software In my opinion on Android Phones... but, their hardware is so lackluster. They have had underwhelming hardware on their phones every single year. And to see a shift like that what that leak would suggests would be a very big shift in what Google Phones are all about. See, their software is so good it's it's good to the point where... it can alleviates some of the pressure of that poor hardware. They have amazing camera software, they have good AI features, they have a really clean UI, really simple",
    "transcript_keywords": [
        "leak",
        "Pixel",
        "Google Pixel Phones",
        "phones",
        "Pixel phone",
        "Google Pixel",
        "leak suggested",
        "alleged leak",
        "software",
        "fingerprint sensor",
        "Google Phones",
        "phone",
        "kind",
        "leaks",
        "back",
        "fingerprint",
        "sensor",
        "camera",
        "hardware",
        "Recently"
    ],
    "transcript_entity_values": [
        "October",
        "XL",
        "every single year",
        "Google Phones",
        "Google Pixel Phones",
        "Samsung",
        "three",
        "this year",
        "S10",
        "third",
        "first",
        "GIANT",
        "second"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL"
    ]
}