{
    "id": "hgEja-VKmb8",
    "title": "Sony's Gold Walkman & Crippled Compact [Hands-On]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2016-09-09T00:12:53Z",
    "video_url": "https://www.youtube.com/watch?v=hgEja-VKmb8",
    "category": "People & Blogs",
    "tags": [
        "sony gold walkman",
        "sony x compact",
        "sony walkman",
        "walkman review",
        "sony x compact hands on",
        "MDR-Z1R",
        "Walkman NW-WM1Z",
        "IFA 2016",
        "MIchael Fisher",
        "Captain2phones",
        "mrmobile",
        "android authority",
        "sony mobile",
        "xperia",
        "android central",
        "pocketnow"
    ],
    "views": 504486,
    "likes": 10386,
    "comments_count": 829,
    "description": "The first music player I ever owned was a Walkman, so I was excited to go hands-on with the newest one  until I learned it costs $3,200. Horrified, I scrambled across the Sony booth at IFA 2016 to take in the latest installment in my favorite Sony smartphone line, the Compact  ... but with a hobbled feature set and a chintzy casing, this is like no Compact that's come before. So as I walk away from Sony's booth on the final day of IFA 2016, my overwhelming sense is that of a company whose motivations I no longer understand ... and whose products I no longer identify with. Here's hoping that changes come CES 2017; for now, check out the MrMobile hands-on in the video above.   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Sony Xperia X Compact   Sony Walkman Signature Edition NW-WM1Z   Sony MDR-Z1R Premium Headphones    [ABOUT THIS VIDEO]  This video was produced after an afternoon at Sony's booth at IFA 2016 in Berlin, where I spent time with the Walkman NW-WM1Z and Sony Xperia X Compact. It is not a full review and should not be construed as such.    [SEE ALSO]  I didn't spend time with Sony's true flagship smartphone, the Xperia XZ, but my colleague Alex Dobie of Android Central did. See his full review here:     [MUSIC]  \"The Ballad of MrMobile.\" Mobile Nations, 2016  \"Killing Time\" by Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 3.0 License    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/19",
        "http://mrmobile.tech/1a",
        "http://mrmobile.tech/1b",
        "http://www.androidcentral.com/sony-xperia-xz",
        "http://creativecommons.org/licenses/by/3.0/",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Narrator] Sony had a lot to show off at IFA this year, including a new-ish flagship smartphone and some impressive acoustic accessories, but what stuck with me after leaving Berlin was a pair of very peculiar products that made me wonder just what Sony is doing. I'm Michael Fisher and this is the last Mr. Mobile video from IFA 2016. Big Walkman, small phone. (electronic music) To be clear, I'm not bashing Sony here. Like every red-blooded and lucky American teenager, I had a Walkman growing up and when I went off to college, I went full Sony with a MiniDisc player that I loved. But you know what they say, never go full Sony, man. This is the company's latest bit of extravagance, and it's exactly what it looks like. It's a gold-plated Walkman. It weights a full fricking pound. It stores as much music as the highest capacity iPhone. It has dual audio outputs to accommodate the equally elaborate headphones with their sheepskin air pads and helix woven wires. Pushing the chunky buttons recalls the Walkman of yore, while operating its laggy Android-based software recalls cheap smartphones of yesterday too. Inside the thing, the analog audio components are separated from their digital counterparts for better interference attenuation, and the copper body itself is meant to reduce magnetic interference. It's the most lovingly crafted music player I've ever laid hands on, and it costs $3,200. The headphones, $2,300. Look, I love aspirational technology. I even love stunts done just for the sake of proving a point, and for a tiny sliver of consumers with good enough ears and a willingness to back up the money truck for a Walkman, this thing is probably appealing. But luxury technology isn't my bag, and my ears, frankly, aren't good enough to discern the probably amazing sound this thing puts out, so I wandered over to the smartphone side of the Sony booth, where I came upon a murder scene. See, Sony used to hold a special place in my heart as the last phone maker who did small phones right. While many manufacturers build miniature versions of their flagship phones, they almost always hobble the specs in the process and make them worse. With the Compact series, time and time again, Sony shrunk down its full size flagships to a manageable footprint, and left almost all of the high end specs intact. The result, most of the time, was a small phone that was still a great phone. Not anymore. The X Compact continues a slide that you could argue started with the Z5 Compact. It's small, yes, and it's camera packs impressive features, but make no mistake, it's a compromised Compact. The processor driving it is a Snapdragon 650, not the high end 820 of its bigger sibling. And the water resistance that's characterized high end Sony phones for years is gone too. Even more damning, the buttons are chintzy and the metal-backed construction of the XZ didn't make the jump to the X Compact, so we're left with a glossy, smear-prone casing that doesn't make me wanna spend over 450 bucks on the thing. Are there reasons you could come up with to buy the X Compact? Sure, I like what Sony's doing in software these days, finding a nice bridge between stock Android and its own upgrades. There are nice hardware features like expandable storage. The size is quite nice if you have phablet fatigue. And if the camera is anything like the one in the XZ, you'll probably have a good time with it. I didn't get to spend time with the XZ, but my colleague, Alex Dobie, did. His Android Central review is linked below. Point is, you can justify anything if you hedge hard enough, and look, if Sony stuff is your passion, I'd never tell you to take a pass. Go for it. But there's no escaping that the two lasting impressions I took from the Sony booth were a $3,200 Walkman and a deluded compromised version of a smartphone I'd admired for years. Sony hasn't had a big presence in the North American mobile markets for a while now, and with products like this, I don't really expect that to change anytime soon. Here's hoping next year's CES trade show proves me wrong. This is Mr. Mobile's final hands-on from IFA 2016 in Berlin, folks. Next week, we'll be back in the Boston studio for more mobile tech videos. Subscribe so you don't miss them, and thanks for watching. Until next time, stay mobile, my friends.",
    "transcript_keywords": [
        "Sony",
        "impressive acoustic accessories",
        "Walkman",
        "Michael Fisher",
        "including a newish",
        "acoustic accessories",
        "IFA",
        "Compact",
        "full Sony",
        "end Sony phones",
        "Sony booth",
        "time",
        "Mobile",
        "newish flagship smartphone",
        "leaving Berlin",
        "Sony phones",
        "high end Sony",
        "phone",
        "full",
        "small phone"
    ],
    "transcript_entity_values": [
        "MiniDisc",
        "3,200",
        "Next week",
        "Berlin",
        "2016",
        "American",
        "the X Compact",
        "The X Compact",
        "Mobile",
        "this year",
        "Android Central",
        "2,300",
        "North American",
        "Walkman",
        "iPhone",
        "Boston",
        "these days",
        "IFA",
        "the Z5 Compact",
        "two",
        "years",
        "Alex Dobie",
        "820",
        "next year's",
        "yesterday",
        "CES",
        "450 bucks",
        "XZ",
        "Big Walkman",
        "Sony",
        "Michael Fisher",
        "Android"
    ],
    "transcript_entity_types": [
        "ORG",
        "MONEY",
        "DATE",
        "GPE",
        "DATE",
        "NORP",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "NORP",
        "PRODUCT",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORG"
    ]
}