{
    "id": "Hh_XgrcQ9oo",
    "title": "OnePlus 3 Teardown, Screen Replacement, Battery fix",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-06-21T20:27:13Z",
    "video_url": "https://www.youtube.com/watch?v=Hh_XgrcQ9oo",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 3 teardown",
        "How to repair one plus 3",
        "Screen repair oneplus 3",
        "Battery replacement one plus 3",
        "1+3",
        "op3",
        "repair",
        "battery swap",
        "screen cracked",
        "broken oneplus",
        "screen replacement",
        "fix",
        "how to",
        "android",
        "smartphone",
        "One plus three",
        "teardown",
        "disassembly"
    ],
    "views": 825397,
    "likes": 10603,
    "comments_count": 1071,
    "description": "Awesome Smart Phone Tool Kit:  Green Pry tool:  Phone opening metal tool:   Screen is HERE:   I will link replacement parts when they become available. Leave a comment if you need something specific. I respond regularly.   Want to see the guts of the brand new OnePlus 3 android smartphone?  Lets open it up.  This phone is surprisingly easy to open.  There is no glue, so you wont need a heat gun.  Just a screwdriver with a small Philips head and a T2 head.  Once the One Plus 3 is opened up, almost everything inside can be replaced.  The phone is pretty modular. The USB C charging port can be swapped out, along with the black battery (Its not red :-(  sad day.)    The 16mp rear camera and the 8mp front camera can be replaced as well. The SIM card tray can not be replaced. That is soldered onto the main board.   OnePlus 3 durability test:  OnePlus 2 teardown:   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "http://amzn.to/28QrceL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://ebay.to/2czyswl",
        "https://youtu.be/8PZ8W_g6Vvk",
        "https://youtu.be/MHkBjBWc_EU",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Today were going to be taking apart the OnePlus 3; the new flagship killer from the company OnePlus. Luckily the phone is not that hard to take apart. Lets get started. First thing were going to do is remove the dual SIM card tray from the side. Then there are 2 screws along the bottom of the phone, similar to how an iPhone works, except for these are a T2 screw. I will link all of the tools and replacement parts that you need down in the video description. I found it was easiest to start on the side of the phone. If you remember during my durability video the screen popped out of the frame just a little bit along that center line. So I put my metal pry tool between the edge of the screen and the edge of the frame and then pry it up a little bit. And I switched to my plastic pry tool as soon as possible because metal on metal doesnt work out so well for electronics. Screen lifted out relatively easily once it was up. And here is the single slab of aluminum that OnePlus talked about. You can see the mill lines so they werent joking around when they said it was a solid block of aluminum. The alert slider has the little contact points up at the top that also connect to the vibration motor. I will show you the contact points on the motherboard here. And this is how those get their signal from the phone itself. There is one screw holding down the two little clasps over these extension ribbon cables. Well work on those in a second after we remove the battery connection. This disconnects the power from the board so its safe to work on. I will unclip the two extension ribbon cables just like little Legos. Same thing with the bottom. You can see that thats really all this is is just an extension ribbon cable from the charging port up to the top of the motherboard. Theres one little piece of tape along the top of the battery. Remove that and then I can just pry the battery out from the phones little pull tab on the side. Similar to how the iPhone 4 and 4S batteries werevery easy, no heat necessary. The biggest disappointment of this phone is just that the battery is not red. The OnePlus 1 and the OnePlus 2 phones had a bright red battery which was fun for repair guys like myself to open up and see something a little bit different. But they went back to being the original boring black batteries. There are 7 screws for the charging port. Remove those. They are Philips head. And then we are going to remove the wire cable and then two ribbon cables with that Lego like connection. And then the charging port will just pop out from the bottom side of the phone. Here is the charging port; it comes with the headphone jack, the loud speaker and the USB type C connection. Ill try to find replacement parts for these and link them down in the video description. Here is the tamper evidence screw on the top motherboard and the water damage indicator. Were going to remove the wire cable first from the side; be careful with that connection. Then theres the screen ribbon cable from the side as well. 8 screws hold it down. These screws are all different sizes; make sure to keep them organized. It is very important to put them back from the same hole they come from. The volume button and power button have little contact points just like the vibration motor does; those just rest up against the motherboard here. Thats how it receives its signal. So if your phone gets wet and those button stop working, its because theres a little bit of corrosion or something on the contact points. The front facing camera can just pop out. Theres a little bit of tape on the back so peel that up. This is an 8 megapixel camera. Well set that off to the side. The rear camera also unclips from the main board; it has the same Lego-like connection. This one here is a 16 megapixel camera and it does have OIS image stabilizing. So the camera itself compensates for the shaking of your phone while youre holding it. Pretty cool. So this is the screen. Its got the glass layer, the AMOLED layer, and the plastic frame that gives the phone its rigidity. So when you buy a replacement screen it will most likely just come with the glass and the AMOLED and youll have to pry it out from the plastic frame. But this kills the old screen so only do it if its absolutely necessary. Im not going to transfer mine over because it does sacrifice the screen and I want to keep on using my OnePlus. The square around the battery is what I imagine gives this phone its strength. The battery presses up against the sides of the plastic to give it rigidity. Very cool design. Lets reassemble this phone. Well put back that 8 megapixel front camera and clip it into the board, put the tape down along the back again. You can just transfer the tape from your old camera to your new camera if youre replacing it. The 16 megapixel rear camera gets pressed down into place and then the whole motherboard can just be pressed down into the frame of the screen. We got the ribbon cable for the screen and the wire cable. And then we have the 8 screws that go in around the outside. Make sure they go into the exact same hole they came out of. Get the charging port set down into place; wire cable; and then the two ribbon cables bend those around the extension cable and then clip those in. There are 7 screws that hold this in place. Remember they are different sizes as well so keep them organized. And then put the boring, black colored battery back into the frame. I really hope to see a red battery for the OnePlus 4. Now the two pieces of tape along the top are not super important, but since they were there in the first place I will put them back on anyway. And then Ill clip on the extension ribbon cables that connect the charging port to the top motherboard as well as the little metal bracket. Pinch one side in first and the screw goes in the other side to hold it down. And the last thing you want to do is just stick in the battery connector. That makes sure there is no power going through the phone while youre working on it. Before I put the screen into the back metal panel Im going to turn it on and make sure its working. Looks like everything is fine. You should turn your phone off before inserting it into the back panel but Im going to do it anyway. Put the top in first and then pinch down the sides and the bottom. Remember that you are working with a piece of glass here so dont put too much pressure on it or youll crack your screen. Im going to put the bottom two T2 screws into placethat was a tongue twister. And everything is good. If you have any questions leave them down in the comments below. Thank you so much for watching. I did do a behind the scenes snap story on this tear down if you want to check out my snapchat. I do a lot of behind the scenes stuff on Twitter as well as Instagram. Thank you so much for watching. Hope to see you around.",
    "transcript_keywords": [
        "phone",
        "screen",
        "ribbon cables",
        "battery",
        "side",
        "cable",
        "put",
        "extension ribbon cables",
        "camera",
        "back",
        "ribbon",
        "screws",
        "charging port",
        "wire cable",
        "OnePlus",
        "top",
        "cables",
        "extension ribbon",
        "remove",
        "port"
    ],
    "transcript_entity_values": [
        "OnePlus",
        "iPhone",
        "8 megapixel",
        "OnePlus 1",
        "8",
        "OnePlus 2",
        "Lego",
        "Instagram",
        "two",
        "the OnePlus 4",
        "Philips",
        "4S",
        "T2",
        "first",
        "second",
        "First",
        "Today",
        "16 megapixel",
        "USB",
        "OnePlus 3",
        "one",
        "7",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}