{
    "id": "hIs6vLdHHKI",
    "title": "iPhone 7 Screen Replacement shown in 5 minutes",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2016-10-19T06:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=hIs6vLdHHKI",
    "category": "Howto & Style",
    "tags": [
        "iPhone 7",
        "iPhone 7 screen repair",
        "iPhone 7 screen replacement",
        "Iphone 7 fix",
        "How to fix iPhone 7 screen",
        "LCD replacement iPhone 7",
        "Iphone 7 glass only repair",
        "Glass only",
        "Apple iPhone 7",
        "iPhone 7 home button not working"
    ],
    "views": 3827342,
    "likes": 27422,
    "comments_count": 2063,
    "description": "BLACK iPhone 7 Screen:  WHITE iPhone 7 Screen:  Here is the Y000 zero bit:  Pentalobe screw drivers:  Green Pry tool:  Phone opening metal tool:   Let me know if any of those links stop working!!! or if you need another part.   IF YOU NEED THE iPHONE 7 PLUS screen repair video:   Phones break. Cant always avoid it. This video shows I replace the screen on my own iPhone 7. Its always easier to repair something after you know what to expect, and you've seen it before. Remember you attempt ALL repairs at your own risk.   The iPhone 7 is a tricky phone to work on. It opens up from the side, instead of the top, and the ribbons are SUPER fragile. The Home button is also fragile, as many people attempting this repair have not been successful in swapping the home button to a new device. I will keep you updated on what causes that here in this video description.   The camera I used to film this video:  The Lens I used for this video:  And this Metabones adapter:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://goo.gl/Qv6Blh",
        "https://goo.gl/bv0skt",
        "http://amzn.to/2efbH2U",
        "http://amzn.to/2e3p9uP",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://youtu.be/gH2Uok-9Y8A",
        "http://amzn.to/1IjlaCD",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/1R7Ltic",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "Today I will show a screen replacement on an iPhone 7. Remember, this is harder than it looks so make sure to watch the video all the way through before you decide to dive into your own repair. As always, you attempt this project at your own risk. Turn off the phone and at the bottom of the screen there are two pentalobe screws the same ones Apple always uses. Since there are copious amounts of adhesive under this screen I found it easier to use a thin metal pry tool instead of a suction cup. Slipping it in-between the metal frame of the phone and the plastic frame of the screen. Then gently twisting the tool to pry up on the screen in a controlled way. There are a few ribbon cables along the right side of the phone that are extremely fragile so do not put any stress on them whatsoever. A little bit of heat will help soften the screen adhesive, so if youre struggling bust out your moms hairdryer and warm the screen up. The trick is the releasing the top edge of the screen enough that you can un-tuck it from the top edge of the metal frame thats what is holding it in place. The adhesive you see stretching is structural, it is only for keeping water out. Your phone will not be water resistant anymore after replacing the screen, but a cracked screen isnt water resistant either. After releasing that top edge the phone unfolds like a book and you can see those incredibly fragile ribbon cables I was talking about earlier. This metal plate protects the connections to the main board. It is held down by 4 Y shaped screws called a tri-point or Y000. Ill link all the tools that I use in the video description. I unplug the battery ribbon first and then unclip the two screen ribbons right next to it; they just unsnap like little Legos. Up here at the top of the phone we have another metal plate held down by two screws. This is protecting another ribbon cable so pop that off and the screen comes loose from the phone. The screen is made up of multiple components and these components need to be transferred over to your new, unbroken replacement screen. If you need a replacement screen I will link them down in the video description along with everything else. To start transferring components we need to remove the huge metal plate from the back of the screen. There are 3 tri-tip screws on either side. Make sure you keep all of your screws organized throughout this project. It is incredibly important because nearly all the screws are different sizes and you do not want to mix them up. One more screw is at the top holding down that big metal back plate, and two more screws above that holding down the earpiece bracket. Once that earpiece bracket is set off to the side, the earpiece speaker can pop out and you can see the little spring contact points that rest on the little golden circles; this is how it receives its signal. The front camera ribbon cable is just lightly glued into the frame so be extremely careful. Pry that out making sure not to kink or tear it. Here is the ribbon itself. It has the front camera and all of the other front sensors attached to it. On to the home button. Im going to explain a few more things about this little guy at the end of the video so stick around for that. There are a total of four screws holding it in place. Remember, keep them organized. The home button bracket can then be removed and the metal back plate itself can lift off. It has a little bit of adhesive holding it down to the ribbon cables and even if your old screen is broken to bits its still a good idea to go slow while removing this so you dont break anything new. And Ill just reiterate that the ribbon cables are extremely fragile; they can tear like paper. Now that the big back metal plate is off, the home button or touch pad can be removed by unclipping the little Lego like connection and then dropping it out of the hole in front of the screen. Now I grab the new replacement screen and I start installing the original components on the screen that isnt broken. Line the metal back plate up with the little screw holes on the sides and then tuck your original home button from your old phone up through the hole and plug it in. Get the bracket screwed back onto the back of the home button making sure to put it over the little circular tabs on the metal back plate. And then those 4 screws on the back go in the same holes they came from originally. Then the metal back plate has 6 screws to tighten it down; all of them those same little tri-tips. Then we have the front camera ribbon. Fold that back into place like an origami master. The earpiece with its springs will sit on top of the little golden circles and it will be held down with two screws. Then the top bracket will go down on top of the earpiece with its own two screws. Now to reconnect the screen. The funky looking ribbon cable at the top clips in like a little Lego. And then the bottom two ribbons plug in next to the battery connection. Remember these ribbons are like paper so do not kink or rip them. Get the battery plugged in and then Ill test the screen out before I screw all the metal plates back in. If your screen is dark or has lines running through it or doesnt respond to touch, it either has a bad connection with the main board or it is just a bad replacement screen. Everything looks good on mine so I turn the phone back off and screw the metal plates back in with their original screws that I kept organized from earlier. Remember that the top edge of the screen goes in first and the rest of the screen gets gently placed down after that. So if your frame has been bent by a drop you might have to unbend it a little before your screen will fit into place so watch out for that. Dont press too hard and crack your new one. Ive seen it happen. Now back to the home button. Since this phone is so new, this video is showing literally one of the first few times the iPhone 7 has been taken apart in the wild. After reading online several other people are complaining that their home button does no longer function when attached to a replacement screen. Apple has played dirty in the past with Error 53, not allowing people to fix their own phones. So it wouldnt be super surprising to me to see Apple pull more anti-repair shenanigans against their own customers. But obviously we have to wait until we get a larger sample size of broken phones. If you have repaired an iPhone 7 leave any tips down in the comments below. Remember, if Apple really is disabling the home buttons of repaired phones, you can get around it by using the on screen home button located in your settings. And if you enjoyed seeing tech reviewed from the inside, hit that subscribe button; Ive got a lot more videos coming. Bonus points for following me on Instagram and Twitter and I even post an occasional behind the scenes Snap Story on Snapchat. Thanks a ton for watching. Hope to see you around.",
    "transcript_keywords": [
        "screen",
        "metal back plate",
        "back",
        "metal",
        "screws",
        "metal back",
        "replacement screen",
        "home button",
        "back plate",
        "phone",
        "metal plates back",
        "ribbon",
        "metal plate",
        "top",
        "plate",
        "button",
        "home",
        "ribbon cables",
        "screen home button",
        "back metal plate"
    ],
    "transcript_entity_values": [
        "the iPhone 7",
        "two",
        "53",
        "Y000",
        "un",
        "3",
        "One",
        "Apple",
        "Snapchat",
        "four",
        "6",
        "one",
        "first",
        "Lego",
        "Twitter",
        "Instagram",
        "4"
    ],
    "transcript_entity_types": [
        "EVENT",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}