{
    "id": "HjXXDv0VI34",
    "title": "DJI Mavic 3 - First look 👀",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-11-05T07:13:25Z",
    "video_url": "https://www.youtube.com/watch?v=HjXXDv0VI34",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Dji",
        "Mavic 3",
        "Drone"
    ],
    "views": 215910,
    "likes": 8874,
    "comments_count": 723,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine, and today we are unboxing the brand new DJI Mavic 3 in this mysterious box that has no photos or labels or names because the version that I'm testing out is currently not out yet. So this is very exciting to open up this secret mystery to show to you guys. And of course, by the time you see this, you'll obviously know what it is. So at the time of filming this, it's a secret. Shh. So there's going to be two versions of the Mavic 3, so there's going to be the regular version and then there's the Cine version, which will allow you to record directly to the drone with a one terabyte solid state drive and you'll be able to record ProRes 422. The other thing to note is these will now fly for about 46 minutes. It's kind of crazy to think about where we started from with DJI drones and drones in general. Battery life was such a crucial part of it. And the fact that we can now get all of this technology inside of this drone and be able to fly for about 46 minutes, I'm excited. Oh, this looks like it's got like a nice little case. Whoa, look at you. This is a big case. This is nice. Hello. Like, this is a nice fabric. What the heck? Look at you. This has got like these nice little clips on the side. This is premium. What's in here. There's all kinds of secret little compartments. Oh my god, oh my, this... Hold the roll. This turns into a backpack. What in the world? What kind of magician nonsense is this? Oh, and this even has this little zip right here so you could put this onto like your luggage. I'm already impressed with the bag. I haven't even gotten to the drone yet. Oh, whoa. Look at this. What the heck? This is so... This looks like something out of \"Star Wars.\" Like this looks like Darth Vader, like if he had a pet, this would be his pet. It's got this cool little interlocking system to keep the blades all in place for travel. Okay, we've got a couple more boxes here. Just gonna take out everything. Oh, look at this incredible bag. I'm so impressed with this bag. I can't get over it. Controller. Looks like we have a new battery design. All right, that is everything out of this incredible modular bag. What a great idea. Wow. Whoever designed this, freaking give them a raise. Let them know that they did a great job and I appreciate them. And if you are a part of that team that worked on the bag, I need you to send this to your boss and be like, \"Justine says we need a raise.\" And if they're not gonna give you a raise, at least demand they buy you dinner, pizza, something, anything. Give them a gift. Give them a trophy. Send me their address. I'll send you a trophy. Oh, look at this new little charger. I like this a lot. It has the built-in adapter, just like so. USB-C. This is freaking nice. I feel like DJI is killing it recently with all of their new innovations. Keep up the good work. (upbeat music) What the heck? Why does this look so good? Look at this. It's like got a little, it's like a little belt, like a little suspenders, like little overalls. This thing looks vicious. Look at this beast. Mavic 3, you have really outdone yourself. Oh my goodness. This has two cameras on it. Look at this. Okay, this has a dual camera system. This is wild. So the 4/3 sensor is the Hasselblad camera, which can shoot up to 5.1K. But then you have the telephoto lens, which can shoot 7X optical, 28X with digital, and 4K 30. Holy moly. I'm not even sure how to process this, but I'm currently processing it, and I cannot wait to take this thing outside and fly. (chill music) We also have a few other accessories here in this box. Oh my gosh. We've got some extra props just in case. You never know. Additional cables depending upon what type of phone you have. We've got the Micro USB and the USB-C, an additional USB-C cable for charging, and the multi-battery charging dock. And here's what the new batteries look like. I feel like these are kind of closer to what the FPV drone batteries look like. Love that they have a nice little docking station. Oh, look at this. I almost threw this away. There's ND filters. Don't forget about those. These are crucial to your droning experience. In wonder what these look like, because we have the dual cameras. Like, look at that. Freaking color me impressed. I forgot. I can't wait to go outside. The one thing that I wish that they would've done with this controller, I actually really do like this newer controller design, but man, they really had a missed opportunity to match these dark grays. It's okay. No fault. Just, you know, maybe for the future, like a darker gray version. Awesome, wow. All right. Time to charge and let's get out there. (bright music) So we're out here for the first flight. I cannot wait. There's a lot of surfers and I know that surfers don't really like drones, so I'm gonna try to stay away from them. But the morning is perfect, I love it, I'm so hyped. And this thing just looks like a beast. Like, look at this. This is vicious. It's so cool. This one does come with some ND filters. This whole piece will come off and I'll be able to pop on a new filter. Here's the little filters, like look at this cute little case. You got 6, 4, 32, 8. We're gonna do 32. In you go. Oh man, oh, the first flight is always so exciting, but also terrifying. (bright music continues) Oh my god, it's so pretty out. (gasps) This makes me wanna go out on a drone adventure so bad. The fog is rolling in over the mountains. Oh shoot. The best thing about this is the flight time. We've got about 46 minutes. Like that's just absurd. (bright music continues) So now I'm going to test out the C4K. We're gonna be shooting also at 24 frames a second. Let's take off. (bright music continues) I think I'm gonna switch actually into the Explore mode. This is going to go back into 4K, but I wanna test that zoom. Oh my god, okay, this is crazy, this is wild. (bright music continues) I get so nervous like flying through things, even though I know I have so much room. What's in there? Oh, there's all sorts of trash. (bright music continues) GPS signal weak. I don't like that. (bright music continues) It's so crazy, 'cause I have not been concerned with battery life at all. I mean, right now I'm at 30% and I'm like, \"Hmm, I guess I'll come back.\" But I don't have to, like I haven't been worried about it. This thing's a beast. I'm so excited. Let's go to a new location. (chill music) So we just went and filmed at a second location, and this time we decided to shoot in the Pro setting. So when we filmed this morning for sunrise, we were just shooting on Auto, wanted to see how everything worked, watched that playback, and then made some changes. This time, we switched up the ND filter to an ND8 and then we also alternated between the 32 just to see how they would play, changed a bunch of settings, and I'm so happy with the footage. Like, everything looks incredible. I've been having so much fun with this drone, but the one thing that I will say, at launch some of the features aren't actually readily available, which honestly like I'm upset about, but I would rather them hold off on launching these features and then they're terrible and everyone's complaining like, \"This doesn't work. Something has failed. Why did you guys launch this?\" Well, they launched it because you were complaining about it not being there and then it wasn't ready. So the fact that they are holding back on it, I feel like actually says a lot. So I'm just double checking some of the features that aren't gonna be available at launch, but they will be available in January, 2022. The Hyperlapse, MasterShots, the FocusTrack including Spotlight, ActiveTrack 5.0, Point of Interest, QuickShots, Panorama, QuickTransfer and 4G transmission. That's a lot of features that aren't ready, but honestly, shooting with this thing, I was very impressed with the footage. We ended up just shooting at the best possible quality, shot in D-Log, and it's pretty awesome. The one thing that I am excited to see, I know some of my friends have the Cine version of this, is being able to shoot in ProRes and having an internal one terabyte solid state drive inside of your drone recording internally. Pretty freaking awesome. So the Cine package does come with some additional ND filters, but for what we were shooting, going all the way up to 32 seemed to be perfect. Also the battery life on this thing, when you're flying a drone, you don't wanna be like up in the air for literally two minutes and by the time you get to get your good shot and then you got to come back again. I didn't even think about battery life. It never even gave me an alert. By the time I got all of the incredible shots that I wanted to get, I was like, \"I'm bored, I filmed everything that I needed to film, and I brought it back.\" I did get one notification that said that the wind conditions were really, really windy and I ignored it and continue to fly and never once did I actually notice that it was windy at all. This thing kept stable. It was flying like a champion. And even just flying felt so smooth. I've also been used to flying the DJI FPV drone, so I've been very used to flying just super fast, erratically, and wild, so it was kind of fun to go back to sort of a cinematic drone and get some really fun, slow shots and really kind of focus on getting something that looks cool. Two freaking lenses on this, okay? Can we just go back to that? It was very shocking because when I was flying with this thing zoomed in, I was like, I don't even know how to explain it. It was such a weird feeling 'cause it felt like I was so close to things and I was afraid to even fly, but then I would zoom all the way back out and realize that I was absolutely nowhere near the thing that I was filming was kind of cool. It can go all the way up to a 28X zoom, and some of that is digital, so you are gonna be seeing some quality loss, but what's so cool is you're able to kind of just go and see is that somewhere that I wanna go? Are there any obstacles? And then you could actually fly the drone there and get that crisp shot. But the telephoto was actually pretty impressive. The fact that you're able to get these crisp shots when you're really nowhere near what you're trying to film is pretty cool. So this is really just the first look at this drone since a lot of the features aren't really ready, but a lot of those features I have used in previous drones and I'm really excited to test them out in this one. This is definitely the higher end as far as prices are concerned. So the Mavic 3, which is the basic package, is 2199. And then if you want to get the Fly More combo with extra batteries, that's 2999. And the Mavic 3 Cine Premium package is 4999. And I'm honestly pretty excited about this drone just because it is so light, and being able to shoot in 5.1K, I'm so used to shooting at such a lower quality with my drones because I usually prefer a smaller drone to take with me, but this is still a small drone and I'm not going to have to sacrifice the quality. So thank you guys for watching. I look forward to testing out these features when they finally launch. So if there's anything that you would like to see me test out, please leave it in the comments below. And I will see you guys in my next video. As always, if you haven't subscribed, click that Subscribe button, hit the bell so you'll be notified when I post a new video. And I think that girl over there needs to subscribe. I'm gonna go ask her if she's into drones. (chill music continues)",
    "transcript_keywords": [
        "drone",
        "thing",
        "drones",
        "time",
        "back",
        "kind",
        "fly",
        "features",
        "Mavic",
        "nice",
        "unboxing the brand",
        "photos or labels",
        "flying",
        "DJI FPV drone",
        "DJI",
        "lot",
        "shoot",
        "shooting",
        "pretty",
        "cool"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "two minutes",
        "ND",
        "second",
        "one",
        "DJI",
        "Subscribe",
        "the Micro USB",
        "USB-C",
        "2999",
        "24",
        "MasterShots",
        "28X",
        "4/3",
        "Justine",
        "32",
        "Two",
        "32",
        "30%",
        "this morning",
        "Cine",
        "4",
        "January, 2022",
        "4",
        "QuickTransfer",
        "Star Wars",
        "DJI FPV",
        "Point of Interest",
        "Mavic 3",
        "Darth Vader",
        "5.1",
        "8",
        "Auto",
        "Shh",
        "7X",
        "FPV",
        "5.0",
        "2199",
        "about 46 minutes",
        "ND",
        "DJI Mavic 3",
        "ProRes 422",
        "6",
        "3",
        "Hyperlapse",
        "today",
        "D-Log",
        "two",
        "Cine Premium",
        "4999",
        "Hasselblad",
        "first",
        "ProRes",
        "QuickShots, Panorama",
        "FocusTrack"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "NORP",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "EVENT"
    ]
}