{
    "id": "HKCYs-UKU4Y",
    "title": "How to Connect to a Cisco Router Using Putty (CCNA)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2021-05-03T15:27:26Z",
    "video_url": "https://www.youtube.com/watch?v=HKCYs-UKU4Y",
    "category": "Science & Technology",
    "tags": [
        "ccna",
        "cisco",
        "packet tracer",
        "ccna 200-301",
        "ccna certification",
        "ccna training",
        "free ccna",
        "cisco ccna",
        "ccna exam",
        "new ccna",
        "ccna full course",
        "ccna study",
        "ccna course",
        "best ccna",
        "ccna routing and switching",
        "ccna 200-301 full course",
        "ccna study guide",
        "jeremy ccna",
        "cisco ccna 200-301",
        "ine",
        "udemy",
        "cisco certifications",
        "cisco training",
        "cisco certification",
        "ccna 200-301 full course english",
        "ccna jeremy",
        "networking",
        "200-301 ccna",
        "200-301",
        "cisco ccna full course",
        "200-301 ccna exam"
    ],
    "views": 45014,
    "likes": 1366,
    "comments_count": 144,
    "description": "How do you connect to the console of a Cisco router? Do you need a physical router or is Packet Tracer enough for the CCNA exam? This video is part of my Cisco CCNA 200-301 course.  Need help for your CCNA exam? Join my Discord here:   This is video #18 of my FREE CCNA Course 200-301 - a complete CCNA course for the new Cisco CCNA exam. I am going to be covering all the topics in the exam blueprint in this course.   I want to make this content practical and it will include a lots of labs and demonstrations to help you better understand topics on the exam.  The course will contain: - Videos - Labs using Cisco Packet Tracer - Quiz Questions - And more!  Menu: 0:00 Introduction 0:32 Connect console to Cisco router  0:56 COM port on Windows computer 1:08 Putty connection to router 1:50 Cisco Router modes 2:34 Use packet tracer 3:01 Physical router vs Cisco Packet Tracer 4:52 How to connect a console cable to a router in Packet Tracer 5:22 Aux port vs console port 5:35 Terminal on PC in Packet Tracer 7:41 Testing real switch vs Packet Tracer switch 10:07 Real switch / router vs Packet Tracer  Previous video:  Packet Tracer Installation:  CCNA 200-301 Playlist:   Buy the CCNA course and support me: DavidBombal.com: CCNA ($10):  Udemy CCNA Course:  GNS3 CCNA Course: CCNA ($10):   Get Packet Tracer here:   ======== ITPro.TV: ========  30% discount off all plans Code: DAVIDBOMBAL   Boson software: 15% discount Link: bit.ly/boson15 Code: DAVF15P  putty console cisco switch cisco router ccna free ccna 200-301 ccna 200-301 free ccna course network networking new ccna david bombal  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   #ccna  #console #putty",
    "description_links": [
        "https://discord.com/invite/usKSyzb",
        "https://youtu.be/jIRRsIgfHU8",
        "https://youtu.be/fnQB6cN3UWo",
        "https://bit.ly/freedbccna",
        "http://bit.ly/yt999ccna",
        "https://bit.ly/ccnafor10dollars",
        "https://bit.ly/gns3ccna10",
        "https://www.netacad.com/courses/packet-tracer",
        "https://itpro.tv/davidbombal"
    ],
    "transcript": "- [Illustrator] Previously. - Okay. So you've just got your new Cisco router a switch. You need to configure it. So how do you configure a brand new Cisco router a switch? I specifically, once again bought this router because it's available in packet tracer. Now you don't just click on a router in the real world to connect a console connection to the router. (soft music) Okay. So I could use this console cable. So let's try that once again hopefully it won't blue screen. So on the PC, I'm gonna connect the USB console cable, and then I'll connect this to the console of the router. So basically connected to the console of the router and to the USB of the PC. Okay. So once again, right click on windows, start, go to device manager, I've got a additional COM port now. It's now showing up as COM4. So the whole process, once again, is to start petty, select a serial, serial port that I'm going to use is COM4. Click open . And what I've got now is a connection to a router. If I type show version, this shows me that the rod is running Cisco IOS XE Software version 16.03.03. Pressing space bar, I see a whole bunch of additional information, and I can see that this is a Cisco ISR4321, BK9 router. So that is an example of a Cisco router. I can type enable once again, I can type conf t to go to global configuration mode, type end to go to privileged mode, type disabled, to go back to user mode. So user mode, type enable to go to enable or privileged mode type conf t to go to global configuration mode. You have to configure the device in configuration mode or global configuration mode, and they all sub modes off to that. And I'll show you those later. And then end takes me back to enable mode. Disabled takes me to use a mode, and then I can type exit to exit out of the router. I am connected to console 0 of the router. but now let's get you to do this. So what I'm going to do is start Packet Tracer. Please make sure that you've downloaded Packet Tracer and that you've got access to Packet Tracer, because I'm going to show you how to do something very similar using Packet Tracer. So when Packet Tracer boots up, I've got to login. I've shown you in separate videos, how to do this. Okay, So the physical router that I'm using is a Cisco. Type enable here. Show version allows me to see what type of router it is. It's a Cisco ISR router. Once again, show Ver for short will show version, full command. This allows me to see what type of router I'm using. It's an ISR 4321. In Packet Tracer, they have ISR 4321 routers. So if I click on the router, you'll notice that this looks very similar to the physical router that I'll have right here. And if I click on CLI, you'll notice that once this boots up that it's very similar to the router that I'm using. Now, when a device boots up once again and it doesn't have a saved configuration we'll see this initial configuration dialog. I'm gonna type no to bypass that. And on this router, if I type show version, and press space bar, you'll notice this looks very similar to my physical router. So here's the physical router. and here's the Packet Tracer router. Notice how that looks very similar to this. Slight difference in output, but very, very similar. Now we'll talk about configuration registers late in the course. This has actually been changed to two one four two. The default is 2102, but again we'll talk about that later. So don't worry about it now. We can see licensing information on the Packet Tracer router similar kind of information on a physical router. I specifically, once again bought this router because it's available in Packet Tracer. Now you don't just click on a router in the real world to connect a console connection to the router. What you actually need to do is have a console cable. So what I'm going to do is add a PC to my Packet Tracer topology, and then I'm gonna go to connections and notice this blue cable is a console cable. I'm gonna connect the RS-232 interface to the console of the router. Now router have what I call the Auxiliary port and Console ports. Auxiliary ports in the old days, we used to connect modems to a router. So you could phone the router to use an auto band connection to configure it. Not used that much these days. But notice now on this PC, if I click on the PC and go to desktop, and I'll just make this bigger I can select terminal. This is what's called the well-known defaults for a console port. On Patti as an example, if I right click and go change settings, connection serial, you'll notice these values are the same as these values in Packet Tracer. So this is the physical router, this is Packet Tracer. Now there is one difference you'll notice flow control is Xon Xoff. Generally that should be set to none. And that might be what's causing the problem. So these are the values that you generally want to use. So I'll click okay. So what you'll notice now, is I've connected to the router using Packet Tracer. And that looks very similar to patti. So this is patti show version but once again that's crushed. So flow control didn't help. So my laptop crashed once again. It looks like that USB connection isn't very good. But what I wanted to show you is once again, this is Packet Tracer show version looks very similar to a physical router. If I open up device manager, once again and look at my console ports, here are my various console ports. So COM4, if I remember right is the router. Open that up again, run patti again, go to console4 here is my router. So show version on the router. You'll notice it looks very similar to Packet Tracer. Back in Packet Tracer, looks very much the same. So the great thing about Packet Tracer, and what I'll do is I'll just turn off this physical router right now, so that the room becomes quieter and that we don't have it crushing my windows laptop again. The great thing about Packet Tracer is you can test the stuff as if you connect it to real devices. So let's add a switch that you can see the switches. Here is a 3650 switch. Again in patti, I'll open up a new session and I'll connect to let's say COM3. So COM3 one of my USB connections. This is a 3560 C switch sh version. That went a bit quick but notice at the bottom here 3560. In Packet Tracer, here is a 3560. So what I could do as an example, is add another PC to my typology, and then go to connections select console cable, and connect the RS32 cable to the console port of the switch. On the PC go to desktop, go to terminal, select the default. And what you'll notice is we see a switch booting up and you can see the full process. I'll go right to the beginning. Can see here the switches starting up, and that looks very similar to a real physical switch booting up. And then we get the initial configuration dialogue. I'll say no to bypass that. And notice I'm on the Packet Tracer switch which is the 3560 24 port switch going to my physical switch. This is a slightly different switch and what I want you to see and I'll put these side by side is, Packet Tracer is very very similar to a real switch. So on a real switch I'll type exit. We get console port is available. Packet Tracer type exit, we get console is now available. Press enter in Packet Tracer, press enter on a real switch, type enable, type enable, type conf t, type conf t, type end here, type end here, press question mark, on this side, press question mark. You'll notice that it looks very much like a real switch. Real switch gives you the real thing. It's the best way to do things. But not everyone can afford to buy a bunch of switches. So Packet Tracer, all you need. You can connect to the consoles of multiple devices by adding pieces to your typology, but you don't have to do that. On a switch like this you could just go to the CLI. Now it has to be powered on. So I have to add a power module to this specific switch. But if I click on CLI now, I can see the CLI of the switch without having to actually connect a console cable to the switch. So Packet Tracer gives you two options. You can either do it this way, or you can simply click on the switch, go to CLI, and see the CLI directly without using a console cable. But this replicates or simulates what happens in the real world. In the real world you can't just click on a device to access the console. You have to physically connect to it either via the console or remotely using Telnet SSH. Okay. That was a long video, but hopefully I've now shown you how to you connect to the console of routers and switches using multiple options. I've shown you how to use the old way of doing it, a rollover cable. I've shown you how to use USB to rollover cable. I've shown you USB cables directly two switches. USB obviously much easier and much better today. And that's a preferred way to do it. But if you come across an old router switch, you may need to use one of these. Not as good as USB, but there you go. Okay. But make sure that you can get this working, make sure that you can connect your PC in Packet Tracer to the console of a router and a switch and gain access to the device.",
    "transcript_keywords": [
        "packet tracer",
        "Packet Tracer router",
        "packet",
        "tracer",
        "router",
        "Packet Tracer type",
        "console",
        "Packet Tracer switch",
        "switch",
        "type",
        "Packet Tracer show",
        "Tracer router",
        "start Packet Tracer",
        "Cisco router",
        "physical router",
        "Packet Tracer boots",
        "notice",
        "connect",
        "Cisco",
        "downloaded Packet Tracer"
    ],
    "transcript_entity_values": [
        "these days",
        "USB",
        "Cisco",
        "Packet Tracer",
        "Patti",
        "two",
        "Cisco IOS XE Software",
        "Auxiliary",
        "today",
        "Packet Tracer",
        "Cisco ISR",
        "console4",
        "Packet Tracer",
        "3650",
        "2102",
        "Ver",
        "one",
        "16.03.03",
        "the old days",
        "Tracer",
        "RS-232",
        "Xon Xoff",
        "0",
        "Cisco",
        "patti",
        "3560",
        "24",
        "COM3",
        "CLI"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "NORP",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG"
    ]
}