{
    "id": "hM7ad8oZp6A",
    "title": "Sony, you played yourself - Sony ZV-1 MKII",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-06-05T19:31:51Z",
    "video_url": "https://www.youtube.com/watch?v=hM7ad8oZp6A",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Sony",
        "ZV1",
        "ZV1 Mark 2",
        "Camera",
        "Sony Camera",
        "Point and shoot",
        "video camera"
    ],
    "views": 135593,
    "likes": 4384,
    "comments_count": 193,
    "description": "Thanks to Secretlab for sponsoring today's video! Check them out at   Sony's new iteration of the ZV-1 is here. The Mark II has a bunch of extra goodies, but does David think it's worth the price tag? Let's find out!  Buy a Sony ZV-1 MKII Camera:  Buy a Sony ZV-1 MKI Camera:  Buy a Canon G7X MKIII Camera:  Buy a Panasonic LUMIX G100 Camera:  Buy a Sony Alpha ZV-E10 Camera:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   PRODUCTS WE USE ON THE SHORTCIRCUIT SET:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 Intro 0:20 What's in the box 1:05 Exploring the outside of the camera 6:38 Secretlab! 7:01 Turning the camera on 7:14 Different shoot modes 7:43 Moar settings 9:44 David's footage 10:15 The sensor 11:40 Image stabilization testing 12:44 Resolutions and frame rates 14:10 The price and closing thoughts 16:13 Outro",
    "description_links": [
        "https://lmg.gg/secretlab",
        "https://geni.us/hAXF",
        "https://geni.us/hAMHQy",
        "https://geni.us/hUdA",
        "https://geni.us/5HCim",
        "https://geni.us/kll6Wx",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/scset",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- Cameras are amazing and I love being invited to unbox them on \"Short Circuit\" 'cause I get to be made aware of cameras that aren't normally in my wheelhouse. Like the ZV-I Mark II. This little vlogging monster from Sony is quite the impressive little machine. I'm excited to get to this, but let's see what else is in this box. To be fair to Sony, this is not a retail box, so although the items are the same, it won't look quite like this. We get a little BX1 battery, a type C to A cable, our little charging block. How about the paper. Little windscreen. I am very grateful that they sent us the wrong color because more than ever it now looks like this camera has a haircut. Actually, when I was using this camera on the weekend, I got a lot of comments of like, \"Oh, that's the cutest camera I've ever seen,\" and I can't deny that. It is the cutest camera I've ever seen. I'm not a big fan including a wall wart and a USB cable to charge your camera. I much prefer having an external charger, 'cause then you can charge a battery while you're using your camera. But this is how they save pennies and make this camera an affordable price. Let's explore the body of this camera starting with its general feel and weight. Sony says that this camera with the battery and the SD card in is nine ounces, which is 255 grams. That's 300 grams. It's not even close. Okay, cool. I'm guessing they chose ounces as it's a much less precise unit of measurement and they can round up a little bit. The bottom has a pretty premium feel. It's that plastic finish. It feels pretty hefty for its size, although not too bad. It's a little small in my hand. I'm having a hard time utilizing the rounded edge of the grip. I just kind of end up pinching right beside the lens. It's fine and everybody this small kind of has the same issue. Overall, not a bad-feeling body. Can't really complain for this category of camera. On the top we have our hot shoe mount, which is our primary audio interface and you can use other accessories. Although it is still currently locked to Sony audio accessories, which is a bit of a bummer. If you want to use the internal mic, there's a three-capsule mic and you can actually change the setting so that it's an omni-directional or forward-backwards facing, depending on the stuff you're shooting. We have our power button, we have our mode switch button. We can switch between photo, video, and slow motion, or other interval shooting modes. We have our video record button, we have our shutter button, and we have our background bouquet button, which is an essential piece to how Sony wants you to utilize this camera. We also have our zoom switch. I think the buttons feel a little mushy. The shutter button is the only one that has any real click. The zoom rocker has a decent amount of resistance. That feels okay. On the back we have our very angle LCD, which is my current favorite implementation of an articulating screen. It means you can shoot in all kinds of different angles. The most important, especially with this kind of camera, is facing yourself so you're able to kind of hold the camera at an arm's length and kind of see what you're shooting. Big fan of that. On the back we have our function button, which is also sent to a smartphone button. We have our menu, we have our control wheel, which has different settings on each axis, as well as a select button. We have our playback button or just like look at what's on your card button, and our trash. Or if you're in shooting modes, our product showcase button. Another quick menu thing to help you access the camera's full feature set as easily as possible. On the bottom we have our quarter-20 mount and our battery and SD card compartment. On this kind of camera size, you're only gonna get one camera slot. I'm not a big fan of this battery type. The BX1 is just a little too dinky for me. On this camera the BX1 will get you about 260 photos, whereas a bigger battery like the one on the ZVE-10 gets you 640. That's a huge difference. And 260 photos goes pretty darn fast, and so you'll need to carry a bunch of these batteries if you're planning on doing a full day. The nice thing, as we come to the side, is that there's a USB port, which is how you charge it, but you can also use battery banks for that bad boy. One of the features that's really nice about having a type C is you can actually use this camera as a webcam. And an upgrade over previous models is that you don't need to use Sony's software as an intermediary to do that. You'll need a computer of foam that is UVC or UAC compatible. The downside is that it's limited to 720p 30. That's fine if you're a Twitch streamer and your little small window in your screen, and even at almost full screen, that would be fine. But it's a little disappointing when you have a 4K camera that can only output 720p through USB. That said, it can output 4K through its HDMI, but this is... Little HDMI ports are the worst. I hate them so much and I want them to die. I'm serious, man. I'm serious. You have a microphone jack, which is nice. You can use external mics that utilize that connector. One thing that's still missing on this is there's no headphone jack for you to monitor your audio from. For solo shoots, that's not super unexpected, but that's definitely something I'd like to see on future revisions, especially as this camera really has one main update and it's the lens. On the previous model ZV-I, it had a 24 to 70 equivalent lens that was 1.8 to 2.8 in terms of f-stop. This one, smartly in my opinion, this is an 18 to 50 equivalent lens, f1.8 to f4. That might not seem like a huge difference, but when you're holding it at just over a meter away from your face, 18 and 24 is a huge difference, especially if you're using stabilization in the camera that will introduce additional crop. I think it's a really smart upgrade in terms of a camera that's designed to just be your running gun camera and kind of fit all purposes. But what I found is that the 50 mill long end is just a little too short. There is digital zoom to compensate, 1.5 times zoom in 4K mode or two times in 1080p, but that doesn't really mean anything. You can just crop and post and have basically the same result. And while it's nice to have f1.8 at the wide end, f4 is a little bit closed, especially when you compare the previous models. 2.8 at the long end. One thing that's really cool about this lens is it has great macro distance. So at the wide end at 18 mill, you can actually focus five centimeters away and at 50, 15 centimeters away. That's quite good in terms of focusing distance. And so you could actually get some very close up of some small things, although you would definitely not be able to get close ups of far away things. Oh, this camera's excited to see you. Just like I'm excited to tell you about our sponsor, Secretlab. Thanks to Secretlab for sponsoring today's video. Secretlab chairs are engineered to keep you incredibly comfortable for long hours at work and play. Their TITAN Evo 2022 chair keeps you feeling comfortable for longer. It's got four-way lumbar support and ultra comfortable line of different seat materials, and more. All chairs come with an up to five year extended warranty and a 49-day return policy. Head to the link in the description below and check out Secretlab today. The first thing you'll notice when you turn on the camera is that the UI is heavily touch based. Sony says that they're aiming to make it similar to using a touch phone. Really intuitive, really simple, and in my experience, it's mostly been like that. So right away you can switch between your different shooting modes. First off, we have intelligent auto, which is our full AI mode. Every processing trick, every compensation that the the processing can do, it does. We have our different priority modes. We have full manual and we have different modes that you can kind of customize. If I'm shooting professionally with this thing, I would probably switch to manual. But I actually had pretty good experience using the intelligent auto. I much prefer keeping my shutters speed the same and letting the camera compensate using ISO and even the aperture. Next we have our drive mode. You can do single shooting, burst shooting timers, and different brackets so that in post you can combine the photos, kinda get this really intense HDR look. We have our focus modes. The default was zone, but you can set a point and kind of have it tracked through your image. You have your beauty filter on and off, which is gonna stay off. Next we have our record and stop record buttons. We have our soft skin effect, which is gonna be off. Although I found the low setting to be fine, some of the footage from this camera can be a little grainy and some of the processing can soften some skin. I didn't find it too bad. There's also a zoom preset button so you can go right to one time or two times zoom. We also have our waveform monitor and our camera settings at the bottom. A lot of these settings can be accessed through the buttons on the top and the side, but it is nice, especially if you're a new shooter, to be able to just look at something, touch it, and manipulate it. I'm a big fan of touchscreen interfaces that are really simple to use, and I think they've done a pretty good job. Another thing I think Sony has done really well is they've made the menu a lot more like an alpha camera. A lot of the layout is the same, and I found as someone who's used to an alpha camera, it was really easy to navigate. We have our different image quality settings, our media settings, our file format and structure. We have our shooting modes, drive modes, our shutter settings. A lot of these again are available through the touchscreen right away. We have our exposure settings, we have our focus settings, our playback settings, our network settings, which is cool. Like previous ZV cameras, you can connect to a smartphone or the My Creator app on a PC and unlock kind of extra features. And then our general camera settings. One of the strengths of Sony cameras for a long time has been its autofocus, and this camera is no different. Sony says that using autofocus this camera can get focus in 0.03 seconds and that's because it's using 315 phase and 425 contrast detection autofocus points on 65% of the sensor. That's not the most comprehensive I've seen, but for a camera this small, that's very impressive. In my use over the weekend, I found that it was quite excellent at tracking subjects at many different distances, switching between catching faces, and those focus points are supplemented by AI face detection, multiple face detection, where it'll actually stop down the aperture to give you a wider depth of field, and so it can keep multiple faces in focus. It also has object detection so you know you can set like dog or car, and it's done a really good job in my experience of tracking those subjects through video, through photo, and that's definitely one of the big strengths of this camera. Speaking of sensor, this camera has the same sensor as the Mark I, which has the same sensor as the RX100 Mark VII. It's a little bit disappointing, although sensor technology advancements have kind of slowed not a huge deal. It's a one-inch type, 20.1 megapixel sensor. It does ISO 125 up to 12,800, and even 25,600 in certain modes. All in all, a pretty great sensor, especially when you consider the target audience for this camera. And that's for people that may not know how to fully utilize all the fine controls of a higher-end camera. And to that end, like I mentioned before, Sony has two modes easily accessible by a button. One is a background bokeh setting, which will open up the aperture as wide and compensate using other settings, so that you can have your subject in focus and a background bokeh. Bo-kah? I don't know how to say it. I read it more than I say it. You also have your product showcase button, which does a similar thing, opens up the aperture, but it changes the auto-focus speeds. That's a little smoother of a transition. Like recent ZV cameras, this has the CineVlog setting. You turn it on, you get an anamorphic crop, and you switch to 24 frames a second. You can also change the color very easily. I don't think I would be using this, but I can definitely see the use for someone who's just running and gunning and needs to shoot a skit and add a little texture and color to their work. Another strength of an all-in-one camera like this is that it's image stabilization is built to utilize every part of the camera to its maximum potential. That being said, there's no in-lens stabilization, there's no in-body stabilization, there is just electronic stabilization. Your options are off or on. When you turn it on, your crop is about 1.5 times, so what was 18 mil becomes about 24 mil. That's fine and that's better than starting at 24 and becoming like 33. But in my short experience using this camera, the stabilization doesn't look super good, and that's pretty common of electronic stabilization. There's just like a little bit of blur on everything and sure, the points of the camera are staying mostly stable, but the things inside it kind of have that unnatural look to it. I'm not a huge fan of electronic stabilization and the stuff in this camera is definitely not the best, but if you are running around, doing a travel vlog, it would be fine. The nice thing about image stabilization is that it works with both photos and video. And speaking of video options, which is definitely the focus of this camera, it does 4K 30 or 24, or 1080p up to 120, and you can even do higher frame rates at these kind of like interlaced modes, up to 960, which is pretty high, but it looks real bad. The highest bit rate it can do is a hundred megabits at 420, not the best, but for a camera this size and for the target audience, that's fine. Although it doesn't have any 10 bit modes, it does have S-Log 3, S-Gamma 3, and Hybrid Log Gamma. And so this is pretty full featured for a camera this size, and I was pleasantly surprised by that. And if you wanna shoot the a hundred megabits but also shoot proxies, that is available to you. The camera does have picture profiles, which is nice. It's not as fully featured to some of the higher end ones, but it's there and that's nice. If you turn off the picture profiles, you get access to the creative look, which can be nice. You can find people that have ideal settings to match a certain look and customize it that way. And there's also the pre-built ones that are okay. This camera obviously has a rolling shutter. It was fine. I didn't really like the look of motion when I was shooting and I generally found all the video I was shooting with it had that digital look of like a 2011 camera. It wasn't bad, it was sharp, and the photos I took were pretty decent, especially for a camera this size with a built-in lens. Man, we have come so far with little point and shoots. It is insane. That being said, this camera costs $900, and that is a very saturated price point. There is a lot of competition, even from Sony themselves, at less than $900, that I think I would probably consider before this. This is a good camera, and if you already have a higher-end camera that you shoot primarily on and you want something you can just keep in your backpack and just pull it out when you need to, this thing is more than sufficient and will definitely do the job, especially if you're someone that's shooting selfie vlogs. Having that extra wide angle lens is a huge boon and there is no other point and shoot that has that wide of an angle equivalent at any price point. For $150 cheaper you can get the previous model I that is essentially as good minus that extra wide lens. If you don't need that extra wide angle lens, I would suggest getting the Mark I. In terms of direct competitor in this category, there's the GX 7 Mark III, which is pretty good and has a longer throw, up to 120 mil with a wider aperture. There's also the Panasonic G100, which I've seen for around $550 online, which is pretty good. Of those three, this is probably the one I would pick if I was doing selfies, but I would pick the Mark I for general use. That being said, for less money than this thing, you can get which is kind of unarguably the step up in the same model line, the ZV-E10. Right now from B&H you can get a ZV-E10 with a kit lens for a hundred dollars cheaper than this thing. It has a bigger sensor, it does better video. That kit lens isn't the best lens in the whole world. 3.5 to 5.6 aperture is not ideal, and it's a 16 to 50. So when you add the crop, is less wide than this. But then you have a camera you can upgrade into the future, you can buy more lens, you can buy a wider lens. And in my opinion, if having the built-in lens isn't the killer feature, I would definitely recommend the ZV-E10 over the ZV-I Mark II any day. And if you wanna check out more camera content, I recently unboxed a ZV-E1, and that was quite the camera.",
    "transcript_keywords": [
        "camera",
        "Sony",
        "button",
        "kind",
        "lens",
        "settings",
        "modes",
        "thing",
        "shooting",
        "pretty",
        "Cameras",
        "Short Circuit",
        "Mark",
        "camera settings",
        "nice",
        "fine",
        "good",
        "stabilization",
        "shooting modes",
        "Sony cameras"
    ],
    "transcript_entity_values": [
        "24",
        "640",
        "S-Gamma 3",
        "long hours",
        "4",
        "USB",
        "25,600",
        "18",
        "50",
        "5.6",
        "ISO 125",
        "10",
        "LCD",
        "0.03 seconds",
        "15 centimeters",
        "16 to 50",
        "Hybrid Log Gamma",
        "today",
        "just over a meter",
        "20.1 megapixel",
        "24",
        "the weekend",
        "425",
        "about 260",
        "255 grams",
        "70",
        "2.8",
        "120 mil",
        "five year",
        "about 1.5",
        "first",
        "Sony",
        "18 mil",
        "two",
        "1080p",
        "BX1",
        "2011",
        "SD",
        "a hundred megabits",
        "65%",
        "UI",
        "49-day",
        "one",
        "one-inch",
        "300 grams",
        "260",
        "second",
        "nine ounces",
        "selfie",
        "S-Log 3",
        "UVC",
        "3.5",
        "120",
        "around $550",
        "1080p",
        "Secretlab",
        "jack",
        "First",
        "1.8",
        "three",
        "One",
        "420",
        "ZV",
        "33",
        "Panasonic",
        "12,800",
        "less than $900",
        "900",
        "315",
        "ISO",
        "18 to 50",
        "Evo 2022",
        "a hundred dollars",
        "Short Circuit",
        "a full day",
        "G100",
        "RX100 Mark VII",
        "150",
        "four",
        "Twitch",
        "five centimeters",
        "1.5",
        "960"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "DATE",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL"
    ]
}