{
    "id": "hnMk-Fl-_SA",
    "title": "FrontRow Review: A Camera You Can Wear [But Should You?]",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2017-09-07T21:07:41Z",
    "video_url": "https://www.youtube.com/watch?v=hnMk-Fl-_SA",
    "category": "Science & Technology",
    "tags": [
        "FrontRow camera",
        "Frontrow camera review",
        "wearable cameras 2017",
        "wearable camera",
        "frontrow review",
        "mrmobile",
        "lifelogging",
        "narrative clip 2017",
        "michael fisher"
    ],
    "views": 153068,
    "likes": 5273,
    "comments_count": 308,
    "description": "For years, Ive had the nagging desire to review a wearable camera. But none of the boxy designs on the market has really spoken to me, and as cool as Snapchats Spectacles are, they have a lot of limitations. Whats more, lifelogging, or the practice of digitally documenting your daily life, hasnt exactly taken the world by storm since it hit the mainstream a few years back.  So I was surprised to find out, earlier this summer, that a company best known for making WiFi routers has waded into the wearable waters to redefine the camera. The device in question is FrontRow, a pendant that comes across as a blend of pocketwatch and Android Wear wristwatch, but is actually a very sleek  and very pricey  wearable camera. Ive been wearing FrontRow between Boston and Berlin for a little under two weeks; this is the MrMobile review!   [SUBSCRIBE]     [PRODUCTS IN THIS VIDEO]  Snapchat Spectacles:    FrontRow Wearable Camera:    Bose QC35:    SCOTTeVEST RFID Vest:    Moto 360 v2:    Galaxy Note 8:    TYLT Energi Pro Charging Backpack:     [ABOUT THE FRONTROW CAMERA REVIEW]  MrMobile's FrontRow Camera Review was produced after twelve days with a FrontRow Camera review device on loan from Ubiquiti Labs. The device received no updates during the test period, and was exclusively used with a Galaxy Note 8.    [MUSIC]  Robot Town by Phil Gardiner, available at Premium Beat:   \"Urban Odyssey\" by Jake Silver, available at Premium Beat:    [SOCIALIZE]         [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:",
    "description_links": [
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/3c1",
        "http://mrmobile.tech/3c2",
        "http://mrmobile.tech/3c3",
        "http://mrmobile.tech/3c4",
        "http://mrmobile.tech/3c5",
        "http://mrmobile.tech/3c6",
        "http://mrmobile.tech/3c7",
        "https://www.premiumbeat.com/royalty_free_music/songs/robot-town",
        "https://www.premiumbeat.com/royalty_free_music/songs/urban-odyssey",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "https://www.snapchat.com/add/mrmobilesnaps",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] Wearable cameras are weird. I've been looking for an excuse to try one for years, but none of the boxy designs on the market has really ever spoken to me, and life logging hasn't exactly taken the world by storm, either. So, I was surprised when a company best known for making wifi routers waded into the wearable waters to redefine the camera. So, I asked to try it out. I've been wearing Front Row between Boston and Berlin for a little under two weeks. This is the Mr. Mobile review. (techy music) What initially attracted me to Front Row was the fact that I'd never seen anything quite like it. Part stopwatch, part Android wear, part Flavor Flave accessory, it's a teardrop shaped talisman meant to be worn around your neck or clipped to a pocket when you're life logging, or it mounted on a stand when you need a tripod. Everything about it is almost perfectly designed. You just press a button on the modular top mount to pop off the fabric neckband and snap on the included kickstand. This doubles as the pocket clip and it's magnetic, so you can stick it to something metal for an impromptu live stream. I mainly kept it pendant mode for my review period and the camera is lightweight enough that I often forgot it was there, not that anyone else did. This is a decidedly unsubtle accessory. Front Row has two cameras, a five megapixel selfie shooter and an eight megapixel wide angle for the primary. That sensor is the same one that Google Pixel uses for its front facing camera. And while the Pixel takes okay selfies, that wasn't exactly an encouraging sign. I'll dive into samples in a second, but first, here's how you work the thing. Front Row's entire face is a two inch touchscreen running a super simple custom build of Android. You swipe left to open the camera app, swipe right to open the gallery, and swipe down for quick settings. Front Row has bluetooth and wifi to talk to either your phone or direct to a wireless access point, and the out of box apps include the three most popular live streaming services. Once you sync your accounts, starting up a live stream is literally a two touch operation. Just like everything on the software side, this is almost foolproof in terms of its simplicity. Keep in mind that there's no cellular radio here, so if you wanna go live on the go, you do need to have your phone with you. I'm not much of a live streamer, so I mainly used Front Row for its still and camcorder features. And, this is another good example of how well engineered it is. To take a photo, you don't even need to look at it. You just click the stopwatch button once and about three seconds later, you get a little haptic buzz on your sternum to tell you the shot's been taken. You press and old the same button to start and stop video. You can also do this remotely through the Front Row app on your iPhone or Android, but I love the no look simplicity of just hitting a button, getting a little vibration to tell you it's rolling. If you double click that button, you get to Story Mode. In this setting, Front Row takes a photo every few seconds to give you a time lapse look at your day. And, the camera knows when not to take a picture based on the accelerometer data. If it detects that you're moving all around, it'll wait a few seconds to see if you steady up before it actually takes that scheduled shot. You could still take stills and video when the Story Mode is active, and you can pause the story at anytime with a double click of the button. Pro tip, remember to do that before you go to the bathroom. Is that icky and weird? Yep, welcome to wearable cameras! Actually, after about 10 days of using it, I very quickly learned why live logging never really took off. In a world of carefully curated photos taken by ever more capable smart phone cameras, a lot of Front Row's footage looks kinda dreary. Like a lot of these tiny cameras, it struggles in low light. Even moderately dim settings get grainy and washed out. And since you're wearing it around your neck, you're not exactly catching people at their best angles, either. The camera uses both optical and electronic stabilization, which is great, but, well, it's not always obvious that it's there. Front Row cites enough battery life for only about two hours of continuous video recording and watch out because it gets hot after a while. If you switch over to Story Mode and do a time lapse, you'll get much more endurance up to 16 hours by the book. I ended up running the battery dry in about 6 hours of Story Mode one evening. But to be fair, I was also shooting a lot of video. It does recharge very quickly via the included USB cable, though. In terms of storage, I managed to fill up almost three quarters of the camera's 32 gigs over seven days. Of course, you're meant to periodically offload media to your phone or Dropbox, so this isn't that big a deal, but it is a compromise, as is the lack of waterproofing. At IPX3, you can get rained on while you're wearing it, but don't take a dip and don't drop it in the dust. Compromises like that aren't what I expect from a device that costs $400, especially in a category that seems all but dead. Now, yeah, I'm referring to life logging there and Front Row would probably argue that this is much more than a life logging camera and they're totally right. It's a live streaming device, camera, and camcorder all in one, with third party app support and at least one big name, Spotify, is joining the ranks soon. Not really sure how Spotify fits into a camera, but okay. Now look, as a lover of quirky gadgets, I'm enamored of its beautiful design and intuitive interface and I genuinely want to see it succeed. Maybe the simple fact that it's wearable and has built it live streaming will be enough for people who do daily Periscopes or Facebook Live sessions. Oh, and Front Row is working on new apparel to give you more mounting options. But to me, it doesn't pack the image quality or do enough better than a smartphone to justify that price tag. At $199 or even $249, I'd be all over it. For now, I think it's probably best to sit tight, wait and see how that third party app platform develops, and see if the price comes down at all for the holidays. Most of my Front Row footage in this video comes from IFA 2017 in Berlin. Folks, go check out the other videos from that show and subscribe to the Mr. Mobile on Youtube to see more videos like this every week. Until next time, thanks for watching and stay mobile my friends. (techy music)",
    "transcript_keywords": [
        "Front Row",
        "Row",
        "Front",
        "Front Row footage",
        "Front Row app",
        "Story Mode",
        "wearing Front Row",
        "camera",
        "live",
        "Front Row entire",
        "Front Row cites",
        "mode",
        "Story",
        "cameras",
        "Row footage",
        "button",
        "life logging",
        "video",
        "logging",
        "life"
    ],
    "transcript_entity_values": [
        "seven days",
        "third",
        "2017",
        "eight megapixel",
        "32 gigs over",
        "about three seconds later",
        "at least one",
        "Berlin",
        "about 10 days",
        "Spotify",
        "400",
        "Story Mode",
        "a few seconds",
        "a little under two weeks",
        "Dropbox",
        "USB",
        "199",
        "selfie",
        "Google Pixel",
        "Front Row",
        "Facebook Live",
        "Mobile",
        "Periscopes",
        "Boston",
        "iPhone",
        "first",
        "two inch",
        "one",
        "five",
        "Front Row",
        "Front Row's",
        "this every week",
        "two",
        "Pixel",
        "about 6 hours",
        "years",
        "16 hours",
        "every few seconds",
        "almost three quarters",
        "the Front Row",
        "only about two hours",
        "second",
        "the Story Mode",
        "Flavor Flave",
        "249",
        "three",
        "one evening",
        "Android",
        "Youtube"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORDINAL",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "MONEY",
        "WORK_OF_ART",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "PERSON",
        "PERSON",
        "GPE",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "DATE",
        "TIME",
        "TIME",
        "CARDINAL",
        "FAC",
        "TIME",
        "ORDINAL",
        "WORK_OF_ART",
        "ORG",
        "MONEY",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG"
    ]
}