{
    "id": "hNmuGMPIfMQ",
    "title": "The Insta360 X4 is in its GoPro Hero era",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-04-16T12:45:06Z",
    "video_url": "https://www.youtube.com/watch?v=hNmuGMPIfMQ",
    "category": "Science & Technology",
    "tags": [
        "Insta360 X4",
        "X4",
        "Insta360",
        "Insta 360",
        "Insta360 X4 review",
        "insta360 next camera",
        "insta360 go 2",
        "gopro hero 11",
        "360 camera",
        "insta360 tutorials",
        "best insta360 camera",
        "insta360 x3 accessories",
        "cameras",
        "best action camera",
        "insta360 go",
        "wearable camera",
        "tech",
        "the verge",
        "full frame",
        "becca farsace",
        "8k camera",
        "360-degree action camera"
    ],
    "views": 64293,
    "likes": 1694,
    "comments_count": 128,
    "description": "This is the new $500 Insta360 X4. It is capable of 360 video at 8k, 30fps, 5.7k, 60fps, and 4k, 100fps. It can take 72MP 360 degree photos. It is waterproof down 10 meters. It has great stabilization, a battery rated for 75 minutes of 8k footage, and it has a much improved removable lens guard system. But unlike previous X series cameras there are no fancy software tricks or large hardware overhauls in the X4. Which begs the question: has the X series hit its peak?  Read more:   0:00 Hello Insta360 X4 0:28 New specs you should know about 1:29 The story of the GoPro Hero lineup 3:05 Where Insta360 currently stands 3:41 The story of the Insta360 X lineup 4:13 One X vs. X2 vs. X3 vs. X4 4:51 Insta360 X4 comments 5:55 The real question about the X lineup  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:   If you buy something from a Verge link, Vox Media may receive a commission without exerting any influence on editorial content. For more information about our ethics policy, visit:",
    "description_links": [
        "https://www.theverge.com/e/23895536",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz",
        "https://www.theverge.com/ethics-statement"
    ],
    "transcript": "- Insta360's X series. It is the company's most successful camera lineup to date and it's their flagship 360-degree action camera. The X3 sold over 1 million units since its launched in September 2022. But as a whole, they're starting to look a lot like a camera series that we all know real well. I'm Becca. Welcome back to Full Frame. Let's talk about how Insta360 is gonna solve the Hero problem. (gentle music) This is the new $500 Insta360 X4, and there are really only two things you need to know about it. It's capable of 360 video at 8K 30 frames per second, so clear some space on your hard drives, and it has a new removable lens guard system. Spec bumps can be a big deal and 8K is no small feat, but the X4 is a unique product for Insta360 because that's pretty much all they gave us this year. There aren't any fancy software tricks like the Me Mode that we got on the X3 that uses both lenses to create a POV from the bottom of the camera for use with a selfie stick. And there aren't any fancy Shot Lab features that started rolling out with the X2, like the AI Warp that puts an artistic look onto your footage. And lastly, the design language stayed almost the same from the X3, except for the fact that the X4 is a bit bigger, which is a first for this lineup. All of this is starting to signal to me that the X4 might represent the final form of the X series lineup. Sort of how in 2016 when the GoPro Hero5 was launched, well, that kind of became the final form of the GoPro Hero lineup. In the first half of 2012, GoPro was responsible for 21.5% of all digital camcorder shipments in the U.S. And later that year, when the GoPro Hero3 launched, it was the highest selling POV camera on the market. This was because of a few things. First, GoPro was at the right place at the right time. More typical point and shoot cameras were rapidly being replaced by the cameras on our phones, while GoPro's offered folks a unique POV from a camera that could take falls and go underwater, so long as it was in its housing. And second, GoPro's marketing was incredibly strong. By 2013, GoPro logos were seen all over action sports. Take for example, the 2013 X Games Aspen. You can see GoPro logos here, here, and even here on Shaun White's helmet when he landed the first triple cork in X Games Slopestyle history. But GoPro marketing wasn't only on our TVs and on our favorite athletes. Anywhere a GoPro was sold, there was a TV next to it, showing all of the amazing things you could capture with it. But by 2016, sales of the Hero camera were down and the infamous Karma drone was literally falling out of the sky. But I don't need to talk about Karma or how big this drone is. Oh my God. I don't need to talk about any of this to continue talking about how the Hero lineup, ah, God, how the hero lineup plateaued. The bigger problem with GoPro's Hero line was that it oversaturated its own market. I mean, everyone had of these cameras and they had nothing more to do with it or to learn from it, and this is the GoPro problem. How do you keep people's attention when innovation starts to slow? In a lot of ways, Insta360 has already begun solving this problem for itself by taking its camera tech and putting it into other products. This includes a webcam, the tiny Go Cams, a 360 drone attachment, and even a gimbal. But I wanna talk about the X series specifically in relation to the Hero series because, I mean, for starters, it's Insta360's most successful product, and also, it's whole launch and beginning and the way it's continuing mirrors the Hero lineup almost to a T. So first, Insta360 launched a camera that most folks had never seen before and one that was far more versatile than our phones. Then the company showed people what they could do with it, not by putting it on screens in stores, but instead paying a lot of money to influencers who then made videos about it and flooded our algorithms. And now, in a real full-circle moment, there's a Shaun White partnership with the Insta360 X3 camera snow kit, which is simply a camera bundle with mounts and such. In this time, the cameras in the X lineup have been improving in both hardware and software. Here's each camera in the lineup recording the same 360-degree scene with the One X on the far left all the way to the X4 on the right. (gentle upbeat music) The good news is Insta360 has seemingly found what works best in a consumer 360-degree action camera. The software is easy to use and footage is easy to edit. The hardware looks and feels great. The footage is punchy without looking like bad HDR, and it is super steady. The problem with all that is we've been saying most of that for at least two generations, but we definitely said all of that with the X3. There are a few new pieces of information I can add to the story this year with the X4. First, 8K creates heat, and this camera does get warm. It even overheated on me while filming this Hyperlapse on a plane that was supposed to be a view out the plane window, but since that was overexposed, it became a Hyperlapse of me sleeping. Second, the battery life is solid despite the 8K. Even after overheating, the camera cooled down a bit, and I was back filming with a battery that still had plenty of juice. And third, the mics are so good and they do a great job of picking up on voices. Okay, wait, this is my favorite run. And I opened it up, but I don't know when I opened it up. It's gonna be mad sketch. Here we go. Okay, sick. Sick. Yaw. Yaw. Lastly, if you'll be viewing this footage on anything larger than a phone, 8K is great and certainly crisper than the 5.7K on the X3. That being said, if you won't be viewing it on anything larger than a phone, save yourself the 100 bucks and stick to the X3. So the question that remains for me is that if the X4 is in fact the final form of this lineup, and like the Hero lineup, we're just gonna see small spec bumps year over year, Insta360, what are you gonna do next that is as successful as this? This is a company that doesn't sit still. This is a company that will surprise you and put out, I don't know, a webcam randomly. This is a company that wants to disrupt markets and wants to keep outpacing itself. This is not a company that puts out a camera with a small spec bump. And so I know that their resolve will be doing something that none of us expect, and I'm excited to see what that product is. (Becca whistling)",
    "transcript_keywords": [
        "Hero lineup",
        "camera",
        "GoPro",
        "Hero",
        "GoPro Hero lineup",
        "lineup",
        "GoPro Hero",
        "Hero camera",
        "cameras",
        "company",
        "series",
        "GoPro Hero line",
        "successful camera lineup",
        "problem",
        "action camera",
        "year",
        "Hero series",
        "POV camera",
        "hero lineup plateaued",
        "camera lineup"
    ],
    "transcript_entity_values": [
        "2013",
        "100 bucks",
        "360",
        "X3",
        "third",
        "Second",
        "GoPro",
        "September 2022",
        "X2",
        "Go Cams",
        "later that year",
        "Shot Lab",
        "year",
        "8",
        "GoPro",
        "GoPro Hero",
        "Shaun",
        "X4",
        "Becca",
        "at least two",
        "2016",
        "X4",
        "GoPro",
        "Shaun White's",
        "One",
        "5.7",
        "this year",
        "Hero",
        "second",
        "Yaw",
        "the first half of 2012",
        "over 1 million",
        "first",
        "X3",
        "500",
        "the AI Warp",
        "the Me Mode",
        "POV",
        "21.5%",
        "Hero",
        "Hyperlapse",
        "U.S.",
        "First"
    ],
    "transcript_entity_types": [
        "DATE",
        "MONEY",
        "CARDINAL",
        "FAC",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "FAC",
        "DATE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "DATE",
        "FAC",
        "FAC",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "PERSON",
        "GPE",
        "ORDINAL"
    ]
}