{
    "id": "hQ3GW7lVBWY",
    "title": "Fans; High is next to Off on purpose",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2020-05-12T14:54:01Z",
    "video_url": "https://www.youtube.com/watch?v=hQ3GW7lVBWY",
    "category": "Science & Technology",
    "tags": [],
    "views": 4480988,
    "likes": 147863,
    "comments_count": 9408,
    "description": "This video is absolutely fantastic. Ever wonder why it goes Off-High-Medium-Low? Well, it has to do with motors and the ways we cheat with them.  Are you wondering what the heck a selection accumulator is? Well, it's the brain of an electromechanical jukebox!   Do you have the rumblies that only links can satisfy? Technology Connextras (the second channel that stuff goes on sometimes):  Technology Connections on Twitter:  The TC Subreddit   You can support this channel on Patreon! Thanks to contributions from viewers like you, Technology Connections can continue being as weird and unpredictable as it is. If youd like to join the absolutely magnetic people who bring these videos to you, you can find out how at the link below. Thank you for your consideration!   And thank you to the following patrons! Vince Batchelor, Peter Sarossy, Tracy Cogsdill, Matt Allaire, Guy , Will Hayworth, Benjamin Gott, Zach Le, Sean Fyles-Duggan, Fredrik strem, Anil Dash, Simon Safar, Michael Wileczka, William Matthews, Fred Leckie, Kenneth Morenz, Andy , Adam Merolli, Bendegz Gelln, Greg Stearns, Robert L LaBelle, Chris Satterfield (Compgeke), Jerrod Putman, Cameron Benton, Samuli Suomi, Keith McCready, Jeffrey Glover, Marcus Langendorff, Hsin-Kuei Chen, HenryD , David Anez, Josiah Keller, Conall  Maiti, Struan Clark, Keeb , Alexander Karlsson, Tarrien , Jason Viterna, DrMoebyus , Chris Larsen, JH , Michael Romero, Aram Hvrneanu, Jonathon Mah, Jonathan Polirer, Marc Versailles, Arthur Zalevsky, John Fruetel, Cupcake , Andrew Diamond, Cole Campbell, Christopher Beattie, Paul Bryan, Samuel Kirzner, Daniel Pritchard, Brandon Tomlinson, Eric Loewenthal, Jeremy Samuels, Malcolm Miles, Matthew Lloyd, David L Jones, Matthew Burket, Mike Burns, Noah Corwin, Andrew Roland, Luke Whiting, Smith8154 , Lars Jacobsen, David Groover, Michael Wehner, Kenneth Siewers Mller, jacob kamphaus, Slysdexia , Alex Hurley, D.z , Tommy McCarthy, Andrew Bobulsky, On Ice Perspectives, Brian Wright, TheGreatCO , Petteri Hjort, Daniel DeLage, Nathan Obuchowski, Sam Tran, Shaun Puzon, Bret Holmes, Vlycop , Lucas Beckmann, Casey Blackburn, Devon Hodgson, Zimpan , Loc Esch, Filmmaker IQ, Jan Houben, Bren Ehnebuske, T.J. Zientek, Vernon , Ton Brands, Scott Wright, Kory Howard, rezonant , Thanasis Dimas, Marc Grondin, Hex , Craig Kollai, Daniel Barrera, Erkin Alp Gney, Mark Stradling, Peter Sodke, joseph , Kristian Scheibe, BigMcLargehuge510, Andrew Liendo, Nick , The Masterpiece, Seanvdv , Chris Cody, Jason Portwood, Chad Fertig, M Shrimptoast, Joseph Houghtaling, Ben Tucci, Dave Stares, Josh Braun, Joe Johnson, Daniel Dugger, Christopher Lowell, Oleg , Michael Sacchi, Ali Elam, Dan Allen, Trent Crawford, Zhenbang Xiao, Jason Watson, Markus Towara, Barky doggo, Ectra , Dylan Taylor, Martin , Reid Fishler, Daniel Meagher, Joel , Clemens , Bill Bates, Centronias , Dennis Walsh, Alex Warren, Paul Robins, CanyonMID , Les , Keenan Finucan, Ian Clanton-Thuon, Ryan Pratt, Paul Newton, Greg Golds, Theo Keeler, Tyler Alberico, Benjamin Ratner, Doug Davenport, Paul Sharp, Craig Brickey, Zidy , Justin Trout, Brandon , Karl Kornel, Danila Fediashchin, Adam , Zach Rose, Arvin Prasetya Wiranata, Patryk Majewski, Ryan Kamphuis, WB , AmbientCyan , Sam Calandra, Wolfgang Gschwendtner, Jzef Sokoowski, Will Preston, Stuart Stanfield, Hammerchuckery , Christopher Olson, Kor Nielsen, Jacob Ford, Stephen Amar, Bryce , Andy Holzhammer, Ethan Mears, Jon Clegg, David Jeroslow, Ian Hills, Charles MacDonald, Andrew , Tim Jones, Crisco762 , Phil E, AnsulFolf , Roy Burns, Raymond Coutts, Ian Spence, John De Witt, Mike A, Alex Dodge, hipp1eguy , Justin Derleth, El Jefe, NEON725 , Emily Eisenberg, Mark Christian, Dylan Leblanc, Bard , Megan Lovett, LGR, Jeffrey Frasure, kn0tsin , Michael Gooden, David Wulff, Max , Fredrik Lindroth, Michael Riegel, Paul Kavanagh, finacious , Isaac Clarke, Sean Hearrell, Christopher Macdonald, Selectric , Xzandreth , Keithius , Snke Schlter, Julian Haldenby, Seb Bacanu, Mauricio , Hunter Thor, Austin C Borger, Gabe Cook, Anapan, S0N0S , Michael Patron, Sonic Ether, mike quick, Adam , Lucas , microserf , Daniel Kraut, Andr Gil da Costa, jacob topkok, Luka Sanzin, Peter Hillier, PeterH , William Holt, Ethan Hamel, Grant Campau, Else , Michael Dunn, Rin , Richard Hicks, Matthew Foulks, Levi Maaia, Mike Roach, Simon Janssen, Jorge Caballero, Kyle Messner, Matthew Schwartz, gs , ashka , Mr. Yan, Matthias Feist, RedR0ze , adan c, Thomas Fuchs, Alan Holland, Dan Boulden, Phiroze Dalal, Devin Rosenthal, Avalon Hamakei, Ray Hardman, G Cowell, Dan Coulson, Kevin Hamilton, Chase Tarson, Christopher D'Arpa, Marshall Kurtz, Matt Goldman, Hurf Durr, shaun morris, David Bell",
    "description_links": [
        "https://youtu.be/o1qRzKuskK0",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Fans. What would we do without them? Even before we figured out that air is a fluid, weve been pushing it around at our whimsy. And thanks to electric fans, things are better than ever! They keep us and our things cool by speeding up the transfer of heat energy. They make your voice all funny when you talk through them. [said all-funny-like] And if theyre old enough, they are a clear and present danger to anything with fingers. Yes, the worlds a better place thanks to fans. Fans. Its whats for dinner. But the common electric fan has a, depending on who you ask, mildly perplexing to intensely irritating design quirk. You see most fans run at multiple speeds (most commonly three), and nearly all of them have a speed selector switch with the order of Off, High, Medium, Low. Why are they in that order? It may seem more logical for the speed to increase, as after all things like volume knobs and dimmer switches tend to increase intensity the more you turn it. But fans? Theyre, like, the opposite. Why? Well, there are two basic reasons for this. The first is that this is just how it is and were all used to it by now so why bother changing it? And the second more real answer is that this protects the motor inside the fan and increases customer satisfaction by reducing the likelihood of a stall condition. Whats a stall condition? Im glad you asked! Electric motors are weird. I mean, theyre also amazing and wonderful but theyre also weird. At their core, its really just some sort of magnet that we figured out how to make go all spinny. Then we put some sort of output shaft on the spinny magnet and we can make other things spin, like paddles which push air forward and thus create a constant stream of moving air. Or the little dish at the bottom of your microwave. Or a train or a car or really anything at all! (probably should have said \"wheels of\" but you get it) But getting the magnet to spin isnt as easy as you might think. Obviously we can create a magnetic field that attracts something to it. Coils of wire make excellent electromagnets. But we cant simply create a magnetic field around a magnet and get useful motion. Sure it will attract the magnet to itself, but once its done that... well then it wont spin, will it? It will just sort of move a bit and then get locked in place. So, we need the magnetic field itself to spin. Then the magnet in the core of the motor is being attracted to a continuously moving target, and not a stationary one. There are a whole bunch of ways we can do this. And we dont even need to use magnets at all. In fact we usually dont, instead the spinny bit (which, I should probably add, is called the rotor) can itself be another electromagnet, or if we want to get real fancy can be made of steel and copper and thanks to our friend Electromagnetic Induction, fields from the stator induce currents in it and it becomes its own electromagnet, attracted to the very fields which created its attraction in the first place. And yes I'm oversimplifying. So anyway, to make a motor spin, we need a rotor (which may or may not contain a permanent magnet somewhere) which is attracted to a spinning magnetic field induced by the stator which surrounds it (thats the stationary electromagnety bit). Now this is all well and good except for one thing. Household electricity doesnt spin. It just pulses. Three-phase electricity does spin, though! Grid-scale electricity generation and transmission is done as three-phase power. Thats why you always see transmission lines in multiples of three. We do this because thanks to math and stuff it allows us to transmit more power with a given amount of conductive material. Going from two wires to three allows you to transmit triple the amount of energy, and thats economical right there! The three phases are staggered 120 degrees apart from one another. Each phase on its own is just pulsing on and off, but in sequence they chase each other, just like the lights on a movie theaters marquis. If your name is Tesla (or, ironically, Ferarris (no relation)) and you design a motor with a three-phase stator, and ensure theyre in the correct order, youll get natural rotation of the field thanks to the chasing effect of the phases. Lots of big industrial motors are built like this, and so are the motors in modern electric cars. With a motor on the grid, it will have a fixed speed thanks to the fact that the electric grid itself has a fixed frequency, but in an electric vehicle, the motor is hooked up to some fancy power electronics which turn the DC power from the battery into three-phase AC power at whatever frequency and voltages you like. This is called a variable frequency drive, and theyre not exclusive to electric vehicles (and in fact in EVs theyre usually not called that), but thats a story for another time. Wasnt this video about fans? Ah, well, I promise were getting there. Three-phase power is generally not found in the domestic environment. The closest youll typically get (in the US anyway) is in a situation like an apartment building where the building has a three-phase supply, and there might be things like elevators or large HVAC units with three-phase motors in them, but youll only have two of the three phases in your personal breaker panel, and large appliances like electric stoves will be put across two of them giving you 208 volts rather than the standard 240. Our electrical system in the US is weird, but thats a story for another time. So anyway, with only a single phase, ya aint getting rotation. Youre just getting power (and thus a magnetic field) which pulses on and off (and changes polarity with each cycle). Now, you can design a motor to work with that just fine. The universal motor is one such design. Here, a commutator and brushes are used to provide its own spinning field by switching the polarity of that field as the rotor (which typically is itself also an electromagnet) spins, therefore always creating attraction in one rotational direction. They even work on DC power, which is why theyre called universal. But the carbon brushes which carry current through the commutator wear out over time, theyre not usually super efficient, they create a lot of electrical (and often audible) noise, theres usually some arcing going on, and so theyre typically only used in certain applications which dont run them for long periods at a time. Like power tools. Or food processors. For something like a fan which may run for days at a time youll want to use an induction motor. These dont have brushes that wear, and will generally last as long as their mechanical bearings do. And you can make an induction motor work with a field that isnt rotating because the rotor itself rotates. Keep in mind that from a spinning motors perspective, the stator is whats spinning. So the electromagnetic field itself is, too, even if its not rotating from our global perspective. But, of course, when you first turn on the fan its not spinning. And this is bad. See, the amount of torque an induction motor produces is a function of its slip. Slip describes the difference in speed between the rotating magnetic field and the spinning rotor. The rotor actually has to be moving through the field produced in the stator in order for it to react against it and produce mechanical force. And this means that single-phase induction motors are not self-starting. If both the field and the rotor are stationary, no torque is produced. In contrast, a stopped three-phase induction motor will immediately produce torque when it receives power because the field is rotating around the stationary rotor, and that means that the rotor is consequently moving through it even when its stopped. From a standstill, the rotation of the field around the rotor will induce the necessary currents in it for it to start moving and will accelerate until its almost, but not quite, to the same speed as the rotating field. It never reaches synchronous speed with the field because then it would not be slipping at all, and no torque would be produced. And this is exactly the reason a single phase induction motor cannot start itself. There is no slip when nothings moving. So now youve got a problem. How do you get the rotor to start rotating? Well, you cheat and create your own rotation somehow. There are a ton of different ways to go about this. You can use capacitors. You can use shaded poles. You can use a separate out-of-phase start winding which gives a temporary kick-start. You could just give it a push. The specifics dont really matter, but what does matter is that youve got to generate a rotating field at least temporarily to produce enough torque to get the motor going, after which point the rotors movement relative to the stator produces the necessary currents within the rotors windings to keep itself going and were happy. And yes, I am still oversimplifying. Well talk about Flemings rules and Lenzs laws when youre older. One of (if not the) simplest ways to create rotation with only one phase is with a shaded pole motor. Lets look at one! Its a good thing I still havent put the selection accumulator back in the jukebox because its got one of these! [various thuds as it's placed on the table] Now this is a C-frame motor. These look a lot like transformers, and indeed operate a lot like transformers, but theyre actually decepticons. Instead of another coil on the other side of the iron core for [said all-snootily] converting voltages, its got a squirrel cage rotor. This is the bit that has currents induced in itself, producing electromagnetic fields which react against the field created in the stator (which, in this type of motor, is the hole in this side of the core). But thats not whats important right now. Instead, its these little bits of copper. These are called shading coils, and their job is to react to the flux created by the field coil over here, and slightly delay its phase in these two locations. Electromagnetism is weird and complicated and Im getting deeper than I need to really (as always) but heres the upshot; these coils break the uniformity of the magnetic field produced in the stator, causing a very slight delay in flux in these locations which will in effect produce a bit of rotation in the field overall thanks to that shifting in time. These shaded poles provide just enough rotation in the field to get the rotor spinning from a standstill, and once it has enough speed the induction currents in the rotor become quite substantial as it moves through the bulk of the pulsing field and now it really takes off. So what does this have to do with fans and their switches? Well, everything! You see, the shading coil isnt really that great of a way to start a motor. It it works, but the amount of starting torque it creates is quite small. They are after all completely passive components, sort of stealing a bit of the output from the stator. That weak sauce starting force means that this style of motor is really only suitable for loads like... well, a fan where the force required to start it spinning is relatively low, and the load increases as rotational speed does. To start, it really just has to overcome static friction. But once its spinning it can really induct. And thats the main reason that high is typically the first setting next to off. While a shaded pole motor isnt super great at producing starting force, its cheap and entirely passive. You dont need a component like a capacitor or a centrifugal switch to disable a start winding. You just give it power and it goes. But the amount of starting torque you get depends on what speed the fan is set to. The different speed settings are usually accomplished with different windings within the motor that produce varying amounts of power, and thus torque. And since the shaded pole affects all the windings equally, on lower speeds you get proportionally less starting torque. Making the first selectable speed high will ensure that the motor will, at least briefly, produce the maximum starting torque it can whenever its switched on. That way its more likely to successfully start. This hand-chopper is nearly a hundred years old. And it, too, has its switch in the order of Off, High, Medium, Low. Now its probably got a shaded-pole induction motor. That design certainly isnt exclusive to C-frame motors, but this motor is literally an antique and I would rather not take it apart to find out for sure. Anyway, since I can just easily reach out and grab the fan blades, I can demonstrate how weak the starting torque is. Its surprisingly easy to hold the blade back, [faint hum as motor is switched on] even set to high. This little fan moves a lot of air on high [faint wind noise is in the audio] and that obviously produces much more force than it is exerting on my fingers right now. This is seriously much weaker than you might expect. Now, if I dared to reach in and grab the blade while it was spinning, I would regret it. But also Id find it would be producing much more torque than it is right now. Because, well, thats just how induction motors work. But you do not want to find a motor in this stalled condition. Why? Well because current is still flowing through the stator windings when its stalled. I mean, you can hear it! [faint humming] And in fact, theres more current flowing through it right now than would be if it were spinning. This fan uses about 42 watts when it's on high. and right now with the motor stalled it's using more than 70 Thats getting dissipated as heat in the motors windings, and before too long it could burn itself up. If the fan switch were designed with low in the first position, you could turn on the fan and find that the blades didnt start spinning. This would not only be annoying but could hurt the motor. And in a fan like this, potentially start a fire. Now to be clear, modern fans are required to tolerate being stalled for indefinite periods of time without burning your house down. After all, you could have left it on low, had a power interruption, and not get the benefit of the starting kick. New fans will either have some sort of thermal protection or simply have a stator design which cant possibly pass enough current through it to get dangerously hot. Sill, though, you dont want a stalled motor. Its bad. And also just annoying. Now I should add that its not like most fans cant produce enough starting torque on low. If I have this set to low and then plug it in, it gets going just fine. But it doesnt hurt to play it safe. And, fun fact! I have encountered a ceiling fan on a fan control which was in fact stalled on low. I had switched it on, and you could hear it humming, but it wudn turnin'. I needed to increase the speed to medium, which produced enough torque to get it spinning, and then I could move it back to low. And it turns out that these modern, electronical smart fan controls I installed because I couldnt help myself are designed to prevent that very thing from happening by always initially switching the fan to high. This here is my biggest fan, and I last had it set to low so when I turn it on it will go back to that same setting. But, for about two seconds, the fan control gives it full beans to make sure it starts spinning, and then it switches to low power. [pronounced hum] [hum gets quieter] Pretty neat, huh? In fact, these fan controls are themselves pretty neat just because theyre bypassing the fans internal speed controls and creating its own. And I should also add that ceiling fans often use capacitors as part of the speed control schema. Really there are just a gazillion types of electric motor out there, and you can lose your mind trying to keep track of all of them and the ways we control them, but thats a story for another time. Now it could very easily be argued that this high comes first positioning isnt really required anymore. After all, how frequently would a fan motor stall anyway? At least, one like this. And you could argue it was never required anyway. I mean things thing's a hundred years old and it starts fine even on low. And there could very well be fans that dont use shaded pole motors. In fact, there are certainly exceptions out there, and even fans which do in fact put low first. Whether thats because they use a different motor design or just because someone did the math and realized weve been worried about a very unlikely thing is unclear, but one thing is certain; the fan switch isnt (or at least wasnt) designed like this just to annoy you. There is in fact a method behind this madness. When you take an already not-great method of starting a motor and weaken it with lower power settings, it doesnt hurt to give it a kick-start first. Maybe at this point its more tradition that it is actual need. As a matter of fact, Ive had this very fan on a separate switch for years with it always set to low, and it never once stalled. It clearly produces enough torque on its own to get going in any speed. And it's almost a century old! But the fact that these modern fan controls always kick the fan on high from a stop is, I think, a sure sign that putting high first is very intentional. Besides, even if stalling werent likely, well how else are you supposed to know how many times you're gonna need to pull the ceiling fan chain to get to the speed you want? electromagnetically smooth jazz Theres something with the delivery of that line that I dont partickalurly like Did that say ehhhrr, I better re-record that cause asked might have sounded a little different... The three phases are sta--- bleuh hi can... eh fiddedibuh With a motor on the grid [Ding-dong from phone] I should silence that, shouldnt I? I should remember to do that before I start filming. Anyway, were getting euhh well be back. Theres usually some arcing going on and so theyre typically not used in most only used, not used, only used. Thats fine. Thats fine just go ahead and. Thats fine. If I have this set to low and plug it in but I need to turn the cord around Are designed to prevent that very thing (said as if concluding the cadence) uh, from happening. Wasn't this video just fantastic? There certainly was a kick to it. Also I've been informed decepticons are still transformers. I apologize for making that joke with zero real knowledge of the Transformers franchise, but hey. Couldn't resist.",
    "transcript_keywords": [
        "motor",
        "fan",
        "field",
        "Fans",
        "induction motor",
        "speed",
        "Low",
        "motors",
        "torque",
        "power",
        "spinning",
        "rotor",
        "magnetic field",
        "start",
        "High",
        "stator",
        "Induction",
        "fact",
        "starting torque",
        "starting"
    ],
    "transcript_entity_values": [
        "almost a century old",
        "208 volts",
        "zero",
        "Ferarris",
        "about 42 watts",
        "Three",
        "Sill",
        "only one",
        "about two seconds",
        "years",
        "more than 70",
        "Slip",
        "two",
        "120 degrees",
        "HVAC",
        "Tesla",
        "Electromagnetic Induction",
        "Flemings",
        "electronical smart fan",
        "a hundred years old",
        "AC",
        "US",
        "first",
        "one",
        "One",
        "DC",
        "Ding-dong",
        "a ton",
        "gazillion",
        "240",
        "second",
        "nearly a hundred years old",
        "days",
        "Transformers",
        "Off, High, Medium, Low",
        "three"
    ],
    "transcript_entity_types": [
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}