{
    "id": "hQfT2mFbg7E",
    "title": "These are OBJECTIVELY great! - Bose QuietComfort Buds 2",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-21T01:21:05Z",
    "video_url": "https://www.youtube.com/watch?v=hQfT2mFbg7E",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "Bose",
        "Quiet comfort",
        "Buds",
        "TWS",
        "Apple",
        "Airpods",
        "Labs"
    ],
    "views": 302970,
    "likes": 10060,
    "comments_count": 610,
    "description": "Pitaka is giving 15% off iPhone 14 cases to the first 100 people to go to:  or  and use code ShortCircuit15.  Pitakas Black Friday Sale:   Resident earbud connoisseur James is here with the help of Labs to take a look at the new Bose QuietComfort Buds to see if Bose can take the crown for Best TWS buds or if Apple is still undefeated.  Thanks to Headphones.com for providing these earbuds, check out Headphones.com at   Buy a pair of Bose QuietComfort Earbuds II:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 oof.mp3 0:18 Unboxing 1:03 Putting them in and calibration 1:35 Case impressions 1:50 Using the app 2:50 Sponsor - Pitaka 3:29 Tap controls 3:51 Different ANC modes 6:30 Audio testing from Labs 10:45 Battery life and pricing 11:32 Outro",
    "description_links": [
        "https://lmg.gg/0xbK3",
        "https://lmg.gg/JZYvA",
        "https://lmg.gg/yyo51",
        "https://lmg.gg/EE6it",
        "https://geni.us/UV9A",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(clapperboard clapping) (moderate music) - Ow, my little finger got caught in there. What are the two best truly wireless earbuds on the market? AirPods Pro Gen 2 probably. And the second one, the Bows QuietComfort Earbuds II. We tested them, we're gonna show you some graphs about how they sound objectively. And we're also gonna open this box up and see how they work. Start here at this QR code. Not doing that. (plastic ripping) Case is kind of weird shaped. It's like a badge, like a sheriff's badge. And here are the buds themselves. A cable, USB A to C and some extra tips and fins. Small and large, medium's already equipped. And then you've got large and large. (laughs) I guess they're not small, medium, large, they're just different. Bigger bump on these ones. A lot of the time, they're fitness oriented to try to keep them in your ears better. But these fins are really low profile, especially, the ones that are presently equipped. So I probably would just keep these on. And actually I wonder if... Yeah, they kind of look incomplete without them. I peeled that back and there's just like a little missing empty track now. So how do they look? - [David] Pretty normal. - Oh, they just made a noise, went zroomph. The noise is actually a sort of calibration for your ear canal. It's called Bows CustomTune. And when that noise is being played, it's kind of like, you can think of echolocation, it's measuring how long it takes the source signals that it sends out there to bounce back and return and making a map of your ear, and then tuning the sound based on that. I like that there's no user interaction. It's not a part of the app where you have to go to, and say like, \"Test my hearing.\" It's just part of using them and it sounds pretty cool. Not a great lid sound. (earphone case clapping) Not a really satisfying hinge or snap open either, for the fidgeters among you. But it's a pocketable case, I'd say. Not as tiny or smooth as this. Apple just kills it. But this isn't a Bows versus AirPods video. (earphone case clapping) There's an app and I am going to try to add these earphones to it and hit this little button. There they are, connect. The magic experience. Okay, battery levels on the left and right are exposed here. But what about the case itself? It doesn't tell me. There's an EQ, which is nice. I don't believe the AirPods have that at all. But other than presets, this gives you actual control up to what do they call plus and minus 10. It's only three different levels. So you get your lows, mids and highs. Not as nice as having a full matrix where you can do it in different discreet jumps of frequency range. Left shortcut, touch and hold the left earbud to use your shortcut. So that's the only button that you can adjust, hey. Play and pause. The thing with these is it's always either on, or Transparency is on, you can't just turn it off, which you can with the AirPods. You go ANC on, ANC off, Transparency on. I wanna find out what it feels like to adjust the ANC and the Transparency levels. But before that, I gotta just listen to these things. Thanks to Pitaka for sponsoring today's video. Pitaka makes MagSafe compatible, armed fiber phone cases, and accessories. Their light and thin design comes in black, gray, or a fusion weave design for those that want a little more personality. They offer a whole ecosystem of MagSafe products, from their four-in-one MagEZ Slider, the MagEZ Car Mount Pro. Use their slider to charge your iPhone, Apple Watch, and AirPods all at the same time. And with the strength of Pitaka's magnets, there's no need to worry about your phone slipping from the car mount, even if you're driving over bumps. They didn't say that part, I put that part in. Don't run people over though. So check out Pitaka in the links in the video description. (mellow music) All right, the music's playing and I tap to pause, I kind of missed it. (music stops) Pause. (music continues) Play, doesn't matter which one you use. Next track. Oh that's registered as volume. Volume is swipe but that double-tap registered as volume. (music stops) Next. I just nexted right into an ad. (upbeat music) Oh now I'm in Aware mode, okay. So this is, Transparency's on, but I can obviously still hear the music. I'm in Relax mode. It's like the closest thing to off maybe. Focus, that's pretty similar to Relax. I don't know, it's very ambiguous. That's the default interface. You can change the press and hold to not cycle through modes but instead hail the assistant, and I believe that's just on the left. But here's an explanation of what the modes are. Quiet has a little information guide beside it. Mutes the world around you, so you can better hear and feel. Right, okay, so it's ANC on. But Aware doesn't have that little info thing. It has a Settings button. Hear your surroundings and your music at the same time. It has ActiveSense. If things get too loud, Bows automatically adjust the amount of noise cancellation, so that you can enjoy music comfortably. That's the same thing that AirPods have. So basically there's a decibel limit. I believe it's 85 decibels on the AirPods. And anything that's louder than that just gets brought down. You can turn that on and off on here. Well, obviously, you don't have a choice on AirPods. Everything is just the way that Apple thinks you want it. (laughs) You can't set anything. In Relax, there's no verbal explanation, or written explanation of what it is. But you can switch up the noise cancellation aggressiveness. My voice is very isolated. All the hissing that was around me went away. Now, it's like there's a distant highway, or white noise generator somewhere. As far as whether or not turning this up and down makes it more like cabin pressure feelingy. Not really. You kind of feel like it when it's maxed, but it might be just an illusion, because of the other things that change. Now, what happens when I look at Focus mode? Same deal, different starting point maybe. So for both Focus and Relax, where you have the ability to change this, if you go below middle, that's like amplifying the Transparency mode. And if you go above the middle, that's like amplifying the active noise canceling. If you're in the middle, I guess you get a bit of both. You can kind of hear the world around you, but engine noise and air conditioning are kind of blocked out. That's cool. And you can save these presets too. You can actually rename them. Oh they give you some things to choose from, like Walk and Workout. I don't see how I can type my own, that's... Why not, you guys? (David chuckles) Whatever. But that's nice. You know, you could go from a preset I like when I'm in the office versus the preset I like to have when I'm walking to the office. Kind of annoying that there's four, I wish I could disable some of them, so that when I'm cycling through, it's just two or three. Ah, that's so annoying. If I tap here, it should turn it up to that point. Shouldn't have to swipe. What you can see here is how the headphones measured, which is the green line versus the Harmon Kardon Target Line. So why isn't it just zero? Zero being a flat frequency response where nothing is above or below the artist's intent basically. Well, the reason is, your ears are imperfect. Your ears are actually more sensitive to different frequency ranges than others. So for example, you can see that the Harmon Kardon curve says that you should probably crank up the bass and the high, because we're less good at hearing those sounds. We're better at hearing mid-range, 'cause that's where human voice is, and lots of other sounds in nature that are relevant to us. (boxes thudding) Like those boxes falling. - [David] I'm sorry. (David shouts) - I love you so much. So as you can see, this follows that target curve really nicely. Almost the whole way, except for around 2.5 K, there's a little bump. So to some people, by default these might sound a little bright. You can use the EQ that we saw in the app to turn that down a little bit. So on this chart what you're looking at is what we call curves of equal loudness. So because your ears are less sensitive to bass, when you turn your music to a low volume, a lot of times we just can't hear the bass anymore. So on your stereo AVR or on either of these pairs of earphones, they'll actually compensate for that. So you can see in this chart, they bass the boost quite a bit, and when you turn up the volume, green's a little louder, orange is louder than that. This stuff mostly happens on the low-end, the bass, which is the left side. Now, Dynamic Range Compression is not something that's happening on purpose on the earphones. This is, basically, you turn up your music really loud, and the load that you're putting on the headphones starts to exceed their capabilities. It just requires too much power or they're gonna clip, or something. They will actually play certain frequencies more quietly, 'cause they just can't deliver. So you can see on the right side of this graph, if you turn them up really loud, which is the red line, under 2K, it starts to drop off. And then above 12 or 13K, it hits a cliff. And so if you're listening to a really- (host starts singing) High delicate violin (host stops singing) It'll be quieter. So like that, as you turn up the music, the prominence of that violin may be sounding like it's in the foreground, nice and clear and loud. It'll just start to kind of back away, and be quieter and quieter. And you can see the orange is lower volume than red, and green and blue are lower still. So it's really only when you crank it pretty loud here. If you're looking at the left side of the graph, don't pay attention to that. It's not that you're getting less bass as you crank these loud, this is actually just a vestige of the curves of equal loudness. So it's just kind of like a measurement problem. Another interesting thing is, if you turn it up really loud, and the headphones can't deliver it, you might actually hear this as pumping, like the music is kind of surging and then getting quieter. And the reason for that is that music isn't of equal loudness as a song plays. Like every bar, there could be a kickdrum, and then that could be more load than the quieter parts of the bar in between kickdrums. So that means that the load imposed onto the headphones, every bar, varies. And when it's a lot of load, that's when the headphones can't hack it anymore. And that's where you're gonna see drops on the graph, because when those impedances hit, they just can't deliver all the power that they need to. But then an instant later in the song, there's not as much music happening, and they can deliver and the volume kind of picks up again. So you get this surging effect in volume. The next graph is a comparison between the Bows and the AirPods for noise cancellations. So lower is better here. You can see that in general, the AirPods have better cancellation, especially in the mid-range. But there is a one spot where the Bows do a lot better. It's around five kilohertz, there's like a 10 DB difference. All sounds that you hear have a mix of frequencies. It's not just engine noises all low, even engine noise is gonna have some high bands in it as well. So it's hard to say that five kilohertz spot is where you're gonna hear this instrument, or something like that. It's all kind of like in general. But you can see that both of these things don't really do much until you hit around 60 hertz. And that's kind of where you're going to from sub-bass to bass. Because the sub-bass stuff is stuff you're not gonna hear. It's stuff you're gonna feel, and obviously the noise cancellation isn't gonna really affect that. But in terms of noise you're gonna hear on a plane, it looks like the Bows does just as well. But the AirPods appear to do better with voices. That's where you can see that mid-range. People talking, babies crying, AirPods might be a little bit better. But these are both doing pretty well. For battery life, they're advertising six hours, that's on the buds. They actually don't tell you what they expect to get out of the case. They do tell you that you can charge the case in three hours, and you can charge the buds in one hour, and 20 minutes of the charging gets you two hours of playback. So, oh, they're okay, pretty standard. The price though, they are $300, which is $50 more than the AirPods. So if you're an iPhone person, I feel like these are pretty neck and neck in a lot of ways. But that price and that Apple magic you're gonna get, you might want the AirPods. For everybody else, you're not gonna get any Apple magic on your Android device and these are very good. So maybe that extra 50 bucks will be worth it for you. They definitely sound great, and both of these are great earbuds. Christmas is coming, I don't think anyone can really be mad if they get either of these. So thanks for watching ShortCircuit. If you like this video, hit Like and hit Subscribe, and hit up our back catalog where we review other earbuds, or not review, we unbox other earbuds. This, now that we have these graphs and stuff, is it a review? Is it still just unboxing? Let us know in the comments what you think.",
    "transcript_keywords": [
        "kind",
        "AirPods",
        "noise",
        "Bows",
        "turn",
        "hear",
        "music",
        "volume",
        "AirPods Pro Gen",
        "Transparency",
        "bass",
        "loud",
        "Apple",
        "Pretty",
        "finger got caught",
        "thing",
        "things",
        "left",
        "hit",
        "ANC"
    ],
    "transcript_entity_values": [
        "the MagEZ Car Mount Pro",
        "AirPods",
        "Apple Watch",
        "AirPods Pro Gen 2",
        "Bows CustomTune",
        "60 hertz",
        "around five kilohertz",
        "just two or three",
        "Focus and Relax",
        "20 minutes",
        "one",
        "USB",
        "iPhone",
        "six hours",
        "MagEZ Slider",
        "Bows",
        "ANC",
        "Focus",
        "three hours",
        "second",
        "Harmon Kardon Target Line",
        "13",
        "Dynamic Range Compression",
        "David",
        "two hours",
        "only three",
        "10",
        "85 decibels",
        "Walk and Workout",
        "Zero",
        "2.5",
        "two",
        "Harmon Kardon",
        "four",
        "just zero",
        "EQ",
        "Bows",
        "300",
        "ActiveSense",
        "12",
        "one hour",
        "ShortCircuit",
        "Pitaka",
        "five kilohertz",
        "50",
        "2",
        "50 bucks",
        "Christmas",
        "minus 10",
        "Apple",
        "today"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "TIME",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}