{
    "id": "HRBR8uAbvg8",
    "title": "OnePlus 8 Pro Teardown! - Big where it counts!",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2020-04-17T13:15:00Z",
    "video_url": "https://www.youtube.com/watch?v=HRBR8uAbvg8",
    "category": "Howto & Style",
    "tags": [
        "OnePlus 8 Pro teardown",
        "OnePlus",
        "Oneplus 8",
        "OnePlus 8 review",
        "OnePlus 8 unboxing",
        "oneplus 8 pro",
        "oneplus 8 pro design",
        "oneplus 8 pro camera",
        "oneplus 8 pro price",
        "oneplus 8 specs",
        "one plus 8 take apart",
        "disassembly",
        "repair",
        "battery replacement",
        "30 wireless charger",
        "fast wireless charger"
    ],
    "views": 3049621,
    "likes": 99033,
    "comments_count": 5300,
    "description": "Its time to Teardown the OnePlus 8 Pro! Snag your Teardown Skin HERE:  The flagship killer has become the flagship, and I aint even mad. OnePlus has come out swinging with this higher price point. Massive camera sensors, and Big wireless charging pads make this $899 dollar phone worth a look. Directly comparable to its thousand dollar counterparts like Samsung and iPhone's. Make sure you're subscribed so you dont miss my OnePlus 8 giveaway with T-Mobile!   Check out the durability test here:",
    "description_links": [
        "https://dbrand.com/teardown",
        "https://youtu.be/dNTwVB3C9io"
    ],
    "transcript": "OnePlus just dropped the 8 Series. This new fleet of phones include the fairly fiscally responsible flagship: the OnePlus 8 Pro. Frequently we facilitate the fixing of fancy phones with a factual, yet forceful forensic frolic. Let's get started. [Intro] One new thing that OnePlus has added this year is an official ingress protection rating on their phone: ip68. And the strength of this back adhesive is much stronger than usual. As always, heat and sharp metal objects are our friends. Gently lifting up the glass just enough to slice the adhesive, but not enough to crack anything, cuz as we know, glass is glass. Once we have all the adhesive sliced and diced, the back panel can twist away, revealing quite possibly the best looking phone guts we've seen in a while. First thing I noticed is this copper wireless charger, brand new this year from OnePlus, and can charge at 30 watts using OnePlus's proprietary charger. But also, take a look at the size of this 48 megapixel main camera. It has the same sensor footprint as the 108 megapixel camera from inside the Samsung Galaxy S20 Ultra, which costs $500 more. I'm looking forward to those camera comparisons from this guy. Marquez and SuperSaf both do a great job with those. There are 10 screws up top, and another 7 screws at the bottom, with an additional 2 screws hidden up underneath the charging coil flap. Once those Phillips head screws are removed, the top plastics and charging coil can come away from the phone, and this guy just looks good. Talk about matte black everything. I have my Galaxy S20 Ultra here. He's been involuntarily donating organs for different videos. Now we can take a look at its much smaller wireless charging coil. Remember, the OnePlus 8 Pro is a 30 watt. And the Ultra has a 15 watt wireless charger. Both are capable of reverse wireless charging, just at a much slower rate. Wireless charging works by having a copper coil in the charger that's generating an electromagnetic field, which the copper coil in the phone can then receive through induction. It's slightly less efficient than just plugging your phone in, but still pretty cool. The OnePlus 8 Pro has more copper and more windings than the S20 Ultra, which might just be a coincidence, but it's also probably why it's more powerful. I guess bigger is better sometimes. I'm not an expert on wireless charging, but it is super cool to see the two different coils side by side. Down here at the bottom of the phone we can pull out the loudspeaker. And peeling off the little black sticker we can see it has little white foam sound dampening balls inside that allow the speaker to sound bigger than it actually is. We also found these inside of the Galaxy S20 Ultra speaker. The battery can unplug next, just like a little Lego. It's interesting though that the battery says 'battery not removable' yet there's also very clearly written 'pull up from this side'. With that many mixed messages, this battery would do very well in politics. It is removable though, which also correlates nicely with politics. I still have people messaging fairly often about what happens when they put their tiny tool in the wrong hole for the SIM card ejection. OnePlus did put both holes really close together. The microphone and the SIM card tray. But even if the SIM tool does go all the way back into the microphone hole, nothing bad happens. I'll show you in just a second. Down here at the bottom we have the little circuitboard. I'll unplug a few of the wire cables and the ribbon cables, and remove the 2 screws holding down the charging port. Even though this phone has an ingress protection rating, there is still white water damage indicators all inside of the phone. No phone is waterproof. Removing the board we can see that the water resistant mesh over the microphone hole is still unpunctured since it's off to the side of the shaft, along with the microphone itself. Most phones are built this way so don't stress too much if you ever get the hole wrong. This little board just includes the dual SIM card reader. The charging port board can peel up and out of the phone next. It's all on it's own down here and easily replaceable. It also has it's own little red rubber ring around the tip. The motherboard has a plethora of it's own Lego style connectors, most surrounding the camera units. Speaking of which, the front facing selfie camera is 16 megapixels, and there's another one of those water damage indicator stickers up here at the top corner. White on the top, red on the bottom, and when it gets wet, the red bleeds through to the top changing it's color. There are two more wire cables to remove and an additional two motherboard screws holding everything in place. Once those are out we can remove the motherboard. Interesting to see that the motherboard has two dollops of thermal paste on the back instead of just one. Taking a close look at the camera units, we can see that the top 48 megapixel ultra-wide camera has no optical image stabilization. Then we have the 48 megapixel main camera that does have OIS. And down here at the bottom we have the 5 megapixel color filter depth camera that also does not have OIS. The 3x megapixel telephoto zoom lens off to the side though does have optical image stabilization. It looks like the motherboard thermal paste rests in two locations, one on top of the copper heat pipe that is obscured by the frame of the phone, and the other is using the blue aluminum frame as the heat sink. Now, this does pose a problem to us. On one hand, I really do like keeping phones alive when I take them apart. But on the other hand, I also really like seeing the heat pipe and optical fingerprint scanner. But pulling off the screen to see them is certain death for the phone....well, certain death for the screen at least. The rest of the phone will still be fine. I say let's do it. It's rather smart of OnePlus to put the bulk of the heat pipe on the opposite side of the metal frame. It's easier to dissipate the processor heat through the thin screen than it is to try to go through the frame and the screen. There's one less layer to go through when it's built this way. Even if we do have to destroy the phone to see it. Peeling back the 10 bit 120 Hertz flexible AMOLED display, we get our first look at the rectangular underscreen optical fingerprint scanner. It's in the exact same spot as the haptic vibration motor on the reverse side of the frame. There's also a lot of this thick graphite tape stuff which will also help the heat dissipation. The copper heat pipe itself is average size, just resting between the screen and the frame instead of the motherboard and the frame. If we do slice him open, we indeed see liquid inside, along with the copper wicks that make the whole thing work. Quite honestly though, I think this is the best looking phone we've been inside of so far this year. Definitely worth the teardown. We took some liberties with the Teardown Skin and added back that vibrant red battery. There are 2 options this time around: the Original which I like because it looks like the glass is still installed. We also have Ultra Matte which has more of a grip to it and less gloss. Installing the Teardown Skin is infinitely easier than performing a teardown. I just line up the camera hole with the camera cutout in the skin and drop it in place. Now all the glorious insides are on the outside for everyone to see. Nailed it. Link is down in the description for these Teardown Skins. We cover all the major phones, iPads and MacBooks. And even some of the not so popular phones. Check it out. Dbrand.com/teardown. OnePlus might not be the low priced flagship killer that it used to be, but it's still definitely giving all the other flagships a run for their money. I'll be giving away a few OnePlus 8's with T-Mobile in a future video, so make sure you're subscribed so you don't miss that. Let me know what phone you want to see torn down next in the comments, and come hang out with me on Instagram and Twitter. Thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "OnePlus",
        "camera",
        "Ultra",
        "phones",
        "charging",
        "wireless charging",
        "heat",
        "teardown",
        "copper",
        "side",
        "top",
        "frame",
        "charging coil",
        "Series",
        "wireless",
        "inside",
        "megapixel",
        "screws",
        "back"
    ],
    "transcript_entity_values": [
        "30 watts",
        "OnePlus",
        "an additional two",
        "MacBooks",
        "Original",
        "ip68",
        "T-Mobile",
        "these Teardown Skins",
        "Lego",
        "Instagram",
        "two",
        "120",
        "108",
        "SuperSaf",
        "Marquez",
        "Galaxy S20 Ultra",
        "Samsung Galaxy S20 Ultra",
        "Phillips",
        "SIM",
        "a few",
        "10",
        "30 watt",
        "this year",
        "5 megapixel",
        "Hertz",
        "first",
        "second",
        "Ultra Matte",
        "500",
        "15 watt",
        "iPads",
        "First",
        "the 8 Series",
        "16 megapixels",
        "One",
        "48 megapixel",
        "the Teardown Skin",
        "AMOLED",
        "one",
        "Ultra",
        "7",
        "3x megapixel",
        "Twitter",
        "2"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORDINAL",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "EVENT",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL"
    ]
}