{
    "id": "hrHf6XQpmk0",
    "title": "The OnePlus 6T is the best phone value right now",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-10-29T16:04:27Z",
    "video_url": "https://www.youtube.com/watch?v=hrHf6XQpmk0",
    "category": "Science & Technology",
    "tags": [
        "oneplus",
        "oneplus 6t",
        "oneplus 6",
        "one plus",
        "oneplus 6t review",
        "oneplus 6t unboxing",
        "oneplus 6t release date",
        "oneplus 6t official",
        "oneplus 6 unboxing",
        "phone",
        "smartphone",
        "specs",
        "oneplus 6t launch date",
        "6t 2018",
        "release date",
        "verizon",
        "tmobile",
        "new phone",
        "best android",
        "android",
        "technology",
        "hands on",
        "first look",
        "new phones 2018",
        "2018",
        "review",
        "new tech",
        "top 10",
        "gadgets",
        "tech",
        "tech news",
        "unboxing",
        "tech review",
        "latest updates",
        "mkbhd",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 533035,
    "likes": 8962,
    "comments_count": 1000,
    "description": "The OnePlus 6T is a big deal for OnePlus: it's the first phone from the company that can work on Verizon. In addition, it will be the first one sold by a U.S. carrier -- T-Mobile. On top of that, it takes everything good about the OnePlus 6 and makes it a little better, and introduces the first in-screen fingerprint reader to the U.S.  Subscribe:   Here's a link to buy the OnePlus 6T:   Note: we sometimes place affiliate links directly to the best deals in our video descriptions, so we may earn a commission if you buy something.  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://fave.co/2RWT3Pn",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "(upbeat electronic music) - Here it is, the OnePlus 6T. It looks a lot like this, the OnePlus 6, but with a couple of significant changes. You'll be able to buy it, starting on November 1st, for $549 and up. Now, before I get into some of the other changes that are on the 6T, there's a big one that a lot of you have been waiting for. The 6T is the first OnePlus phone that can be used on Verizon. This is huge, you can finally use a OnePlus phone on the biggest carrier in the US, complete with LTE and VoLTE service. In addition, the OnePlus 6T will be sold directly by T-Mobile in the US, making it the first OnePlus phone sold by any carrier here. You'll be able to find it in every T-Mobile store and use T-Mobile's device payment plan, combined with your phone bill to purchase it. This is a big deal for OnePlus, which has only sold it's phones online in the US. And, they'll continue to do so, so if you want to order it online, you can. And if you're in the UK, OnePlus will be selling the 6T on every major carrier, plus on Amazon and at John Lewis Stores. Okay, so, let's talks about the phone itself. There aren't a ton of changes from the 6 that was just released in May of this year. But there are a handful of new things that are pretty significant. Let's start with the display, it's still an edge to edge OLED screen, but now it's even larger at 6.4 inches. The bottom chin is one millimeter smaller, and the notch at the top is way smaller than before. It's got this little teardrop kind of shape. If you hate notches, this is probably the only one that you'll be able to tolerate. But even more significant, is that under this screen, is a fingerprint scanner for unlocking the phone. OnePlus has removed the traditional fingerprint scanner that was on the back of the 6 and completely embedded it inside the 6T screen. That makes the 6T the first phone in the US to offer this kind of feature. Now, you can use it to unlock the phone, log into apps that support fingerprint logins like your bank account app, or something like that. Or, authenticate locked data and apps. OnePlus says that it works through screen protectors, and through small scratches on the screen, and it's just as secure as the traditional style scanners. Now, the company claims that this scanner is the fastest in-screen scanner in any phone. But, I don't really have a bunch of other phones with this feature to compare it to. But, I can tell you that it's not as fast as the traditional fingerprint reader that you're probably used to. There's a little pause or beat each time that you use it because the light has to illuminate before it scans your finger and then the phone unlocks. I don't think this is a huge problem. It's still fast and it still works reliably most of the time, but it is noticeable. Now if you do want a faster more convenient, but way less secure way to unlock your phone, the 6T has the same face unlocking system that uses the front camera and is wicked fast. Inside the 6T has the same set of specs as before. It's a Snapdragon 845 processor, six or eight gigs of RAM. Up to 256 gigs of storage. What's different is you can't buy a 64 gig model anymore. The base model of the 6T starts at 128. OnePlus has also bumped up the battery capacity, up to 3,700 milliamp powers, which it says provides 20% more battery life than the 6. I haven't been using the 6T long enough to test this, but it's a significantly larger battery pushing the same processor and same screen resolution. So, it's safe to assume that, it will probably last longer than before. That bigger battery does change a couple of things with the body of the phone. It's a little thicker and a little heavier than before, and the back has more of a curve than the 6. I actually find it to be nicer to hold than the 6 though, it fits my hand better and it just feels more substantial. But, this is still a big phone and if you find big phones to be hard to use, you're gonna have a hard time with this one. The other big thing that OnePlus changed is that it removed the headphone jack that was on the 6. Now, it's just as annoying here as it is on the Pixel or the iPhone, or any other phone without a headphone jack. But, OnePlus is including a little adapter in the box, so you can use your 3.5 millimeter headphones with it. You might also miss the notification LED at the top, which has been removed in pursuit of this tiny little teardrop notch. And OnePlus still isn't offering wireless charging, which is a bummer when practically every other phone has it now. And it still doesn't have proper water resistance certification. But, it does have OnePlus's extremely fast wired charging, provided you use the included charging brick and cable that come in the box. The 6T's camera is exactly as before. It's got a 16 megapixel main camera, with a 20 megapixel second sensor for portrait effects. Plus a 16 megapixel front camera. But OnePlus has added a bunch of software tweaks and a couple of new features, including a better portrait mode, better low light shots, and a new night-scape mode for nighttime landscapes and cityscapes. And if you have a OnePlus 6, all of those new camera features will be coming in a software update. So, look out for that. The 6T is launching with OnePlus's Oxygen OS, on top of Android 9 Pie. It does have a couple of new features, it has improved gesture control system and some better memory management tweaks. So there you go, that's the new OnePlus 6T. Just like the 3T and the 5T before it, it takes the phone that OnePlus launched a few months ago, tweaks it, refines it, and makes it a better overall device. It's a really good phone and it still has a really aggressive price. Especially compared the new phones from Apple and Google. And this time around, Verizon users get to join the fun. Hey, thanks for watching, for more on the OnePlus 6T including our full review with camera samples and all that fun stuff, be sure to check out the verge.com. And if you haven't seen our new science channel, go check it out, youtube.com/vergescience.",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "OnePlus phone",
        "OnePlus phone sold",
        "phones",
        "screen",
        "camera",
        "big",
        "scanner",
        "fingerprint",
        "John Lewis Stores",
        "fast",
        "couple",
        "time",
        "battery",
        "big phone",
        "big phones",
        "find big phones",
        "phone sold",
        "carrier"
    ],
    "transcript_entity_values": [
        "May of this year",
        "Apple",
        "845",
        "Verizon",
        "128",
        "20%",
        "T-Mobile",
        "Snapdragon",
        "16 megapixel",
        "LTE",
        "VoLTE",
        "November 1st",
        "Google",
        "eight",
        "a few months ago",
        "US",
        "six",
        "5",
        "UK",
        "549",
        "6.4 inches",
        "T-Mobile's",
        "20 megapixel",
        "3",
        "3,700 milliamp",
        "OnePlus 6",
        "jack",
        "one millimeter",
        "Amazon",
        "256",
        "6",
        "the OnePlus 6",
        "64",
        "second",
        "OnePlus",
        "first",
        "iPhone",
        "3.5 millimeter",
        "RAM",
        "Android 9",
        "John Lewis Stores",
        "OnePlus"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "MONEY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT"
    ]
}