{
    "id": "Hs3sKe8NqYU",
    "title": "Motorola One hands-on: a budget iPhone X clone",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-31T16:51:53Z",
    "video_url": "https://www.youtube.com/watch?v=Hs3sKe8NqYU",
    "category": "Science & Technology",
    "tags": [
        "motorola",
        "motorola one",
        "moto",
        "android",
        "ifa 2018",
        "motorola one power",
        "moto power",
        "apple",
        "iphone x",
        "iphone",
        "qualcomm",
        "snapdragon",
        "2018",
        "features",
        "specifications",
        "review",
        "hands on",
        "first look",
        "ifa",
        "technology",
        "top 10",
        "gadgets",
        "new tech",
        "tech news",
        "new technology",
        "tech",
        "latest updates",
        "upgrades",
        "how to",
        "unboxing",
        "diy",
        "mkbhd",
        "marques brownlee",
        "google",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 380141,
    "likes": 4213,
    "comments_count": 464,
    "description": "Motorola officially announced the Motorola One and Motorola One Power at IFA 2018, a pair of mid-range Android One phones that offer a sleek, budget-friendly spin on Apples iPhone X design. But theyll only be available in Europe, Latin America, and Asia  sorry, U.S. customers.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Hey, it's Chaim with The Verge. I'm here at IFA 2018, with Motorola's new phones. We have the Motorola One, and the Motorola One Power. They're new bezel-less, mid-range Android phones. They run Android One, and the big thing is that they have an iPhone 10 style notch display, but, at, like a much lower price point. The Moto One is gonna be more widely available. It'll be available in Europe, Latin America and Asia, starting in October, for 299 euros, which works out to like, $350 U.S., which is really cheap for a phone where you're getting this kind of form factor. And, at that price, it's honestly pretty great. The two phones are pretty similar. The Motorola One is smaller, with a 5.9 inch screen, and the design is a bit different. It has Gorilla Glass 2.5 on both sides of the metal frame. On the other hand, you have the Motorola One Power, which will, again, only be available in India. It's bigger, with a 6.2 inch screen, that's a bit of a higher resolution, and it swaps out the frame from the glass on both sides, to metal on the back, and top, has a headphone jack, which is unfortunately a little rare to see on phones these days, and extremely welcome here. The rear cameras on the Motorola One are dual, 13 megapixel shooters. The front camera is an eight megapixel selfie cam. The Motorola One Power, for India, bumps those both up a bit. The rear cameras are upgraded to 16 megapixel lenses, and the front-facing camera is 12 megapixels. Both phones will be shipped with Android 8.1 Oreo, running the Android One version, which Google promises security updates for, for at least three years. Being Motorola phones, they're also running pretty close to stock Android, with a couple of enhancements here and there. But, both phones should be getting Android 9.0 Pie in the near future, which should have additional software enhancements especially for those notch bezels on top. In terms of processor, the Android One has a Qualcomm Snapdragon 625, while the One Power has a Qualcomm Snapdragon 636. Again, these aren't quite top of the line processors, but for a mid-range Android phone, at the price points that these are reaching, it's pretty much in line what you expect with the rest of the market. Storage and memory are also pretty good. Both phones come with four gigabytes of RAM, 64 gigabytes of storage out of the box, which can be expanded up to 256 gigabytes with Micro SD cards. So, I'm holding the iPhone 10 and the Motorola One, and honestly, I'm really impressed with the Motorola One. Again, it's not quite the same level of fit and polish that you'd expect from the iPhone. The screen isn't quite as seamless with the sides, the screen on the iPhone obviously has much higher pixel density, it's brighter, it's an OLED screen, the colors are a little better, but, for the price that this costs, which is again, 299 euros, around $350 in America, it's a really impressive piece of hardware, for a mid-range Android phone, that has this kind of design and polish, Motorola seems to have something really impressive on its hands here. And when you add in the fact that it's running Android One, which is again, nearly stock Android, with just a couple of Motorola's enhancements here and there, it's really just a great experience that you don't usually see from Android phones at this price range. There's no extra, you know, bloatware installed, it's just Android the way you want it, and right now, just quickly, it does feel pretty snappy. The Motorola One is set to come out in Europe, Asia and Latin America, starting in October for 299 euros. The Motorola One Power will only be available in India, at a later date, and, honestly, if it came to America, I'd probably buy one. On the back, you have also a fingerprint scanner, which is useful. The right side of the phone, you have your useful volume and power buttons. Bottom is speaker, USB-C charging, which is great. Right side is where the SIM card slot is, and top is a headphone jack.",
    "transcript_keywords": [
        "Motorola",
        "Android",
        "Motorola One Power",
        "midrange Android phone",
        "Android phones",
        "phones",
        "midrange Android",
        "Power",
        "Motorola phones",
        "Verge",
        "Chaim",
        "stock Android",
        "Latin America",
        "pretty",
        "America",
        "phone",
        "screen",
        "Qualcomm Snapdragon",
        "price",
        "Motorola enhancements"
    ],
    "transcript_entity_values": [
        "Android",
        "256 gigabytes",
        "Android 9.0 Pie",
        "Oreo",
        "2.5",
        "16 megapixel",
        "13 megapixel",
        "Latin America",
        "October",
        "SIM",
        "Google",
        "Chaim with The Verge",
        "Europe",
        "12 megapixels",
        "299 euros",
        "selfie cam",
        "6.2 inch",
        "around $350",
        "64 gigabytes",
        "at least three years",
        "Qualcomm",
        "America",
        "two",
        "jack",
        "Motorola",
        "One",
        "350",
        "Micro SD",
        "India",
        "polish",
        "USB-C",
        "four gigabytes",
        "2018",
        "these days",
        "Motorola One Power",
        "Asia",
        "iPhone",
        "Android One",
        "5.9 inch",
        "RAM",
        "eight megapixel",
        "U.S."
    ],
    "transcript_entity_types": [
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "LOC",
        "QUANTITY",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "GPE",
        "NORP",
        "ORG",
        "QUANTITY",
        "DATE",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "GPE"
    ]
}