{
    "id": "Hse-noIHKcE",
    "title": "All HDMI Cables Are NOT The Same!",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2020-06-19T17:26:58Z",
    "video_url": "https://www.youtube.com/watch?v=Hse-noIHKcE",
    "category": "Science & Technology",
    "tags": [],
    "views": 901180,
    "likes": 35818,
    "comments_count": 1307,
    "description": "Learn through problem solving, and the first 200 people can save 20% today on Brilliant at   Here's what to look for when buying an HDMI cable - and what NOT to worry about!  Leave a reply with your requests for future episodes, or tweet them here:   Buy a GOOD HDMI Cable On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "https://geni.us/7iJ9z",
        "https://geni.us/iik5",
        "https://geni.us/woT3qHS",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- There's an oft-repeated piece of advice among AV enthusiasts. If an HDMI cable is built to spec, and it functions properly, there's no reason to spend extra money on something fancy, because a digital transmission isn't nearly as susceptible to interference as an old school analog connection. In other words, it basically works or it doesn't. Indeed, we did a video on our channel a while back that showed how silly certain over-engineered HDMI cables can be. But that doesn't mean it's always a great idea to buy the cheapest, most bare bones cable either. So to find out what actually matters when buying an HDMI cable, we spoke to UGREEN, a manufacturer of HDMI cables, and we'd like to thank them as well as Philips AOC, and David Hsieh for his translation services. So it turns out that using the correct material inside an HDMI cable, can make a big difference. But that doesn't mean that you should go and find cables with Platinum unobtainium alloy or whatever other nonsense. Cheaply made HDMI cable, sometimes use steel, which isn't particularly good conductor. Meaning it's something that you should generally avoid. You might see cables that are made of copper-coated steel, but these aren't really any better. Instead, go for cables with pure copper wiring inside. The good news, however, is that copper cables aren't super-expensive, and you don't need to get anything higher grade such as silver-plated copper. What then becomes important is how thick the wiring is inside, which is measured by something called a gauge number. And counter intuitively, a lower number means a thicker wire. As a general rule of thumb, your cable length shouldn't exceed 1.5 meters with a thin 32 gauge wire. But as you go thicker and thicker, you can safely have a longer and longer cable run, without having to worry about signal attenuation or interference, because your cables are too thin, as indicated by this helpful chart. However, you won't find much thicker than 24 gauge since at that point, the cables simply become too thick and difficult to bend. Another thing to consider is the connectors on the end the cable. Gold plating is better if you can find it, but take note that I'm not talking about the large part on the outside that manufacturers often color gold, to give the cable a more premium look. I'm talking about the actual contacts on the inside of the connector. Gold plating won't really affect your performance, but it will give you better longevity, as the gold is an effective barrier against wear and corrosion, especially if you're unplugging and re-plugging the cable quite often, which I don't do because my TV is too close to the wall. Once you found a cable made with good materials, try and find out if it's been tested to work with a wide variety of equipment. Some cheaper cables are only tested with a couple of monitors so they might not, play very nicely with your gadgets, if you're running them in any kind of setup that isn't super-straightforward, such as with an HDMI splitter. If the manufacturer doesn't list testing methods on their website, read reviews and find out if any other customers have had problems with compatibility. And on the subject of compatibility, make sure you're buying a Premium High Speed cable, if you want 4k at 60 hertz or HDR. These have a speed of around 18 gigabits per second as opposed to the 10 gigabits of the more standard high speed cable, not Premium High Speed. And you'll need the extra bandwidth to enable higher frame rates and deeper colors. Interestingly, manufacturers actually made these faster cables not with exotic materials or radical design changes, but simply by improving the manufacturing process to minimize small defects in the copper that can hurt the signal, increase latency, and introduce interference. However, faster speeds still mean a smaller margin for error. So if you're trying to use Ultra High Speed 48 Gigabit cables to get the most out of HDMI 2.1 for example, you probably don't want to get a cable longer than three meters. Just remember, generally speaking, shorter and thicker is better. Just ask Kim K, or Colton. This video was brought to you by Brilliant. If you're a student, a professional or just someone who wants to understand the world better, check Brilliant, the website that helps you, reach your learning goals by working just a little bit every day. Brilliant offers interactive explorations and a mobile app to help you master concepts in math, science, and computer science. The courses take complex concepts and break them up into bite-sized chunks. Over time, you will be amazed at what you can accomplish. We suggest checking out their Mathematical Fundamentals course, which has been redesigned with interactive features to help you with the foundational concepts behind algebra, number theory, and logic, which makes it a great resource for STEM students. The first 200 people that head to Brilliant.org/techquickie will get 20% off in annual premium subscription. So thanks for watching guys. If you liked this video, give it a thumbs up, hit Subscribe, and be sure to hit us up in the comment section, with your bright ideas of topics that we should cover in the future.",
    "transcript_keywords": [
        "HDMI cable",
        "HDMI",
        "cable",
        "cables",
        "High Speed cable",
        "High Speed",
        "Premium High Speed",
        "made HDMI cable",
        "oftrepeated piece",
        "piece of advice",
        "overengineered HDMI cables",
        "Speed",
        "Speed cable",
        "find",
        "Premium High",
        "High",
        "thicker",
        "premium",
        "Ultra High Speed",
        "made HDMI"
    ],
    "transcript_entity_values": [
        "Kim K",
        "24",
        "32",
        "around 18 gigabits",
        "David Hsieh",
        "1.5 meters",
        "HDMI 2.1",
        "60",
        "4k",
        "20%",
        "Colton",
        "AV",
        "200",
        "Subscribe",
        "three meters",
        "10 gigabits",
        "Platinum",
        "Mathematical Fundamentals",
        "48",
        "annual",
        "first",
        "HDMI",
        "UGREEN",
        "Premium High Speed",
        "Ultra High Speed",
        "Philips AOC"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG"
    ]
}