{
    "id": "ht8vSX82PyM",
    "title": "…And I LIKE it!!! - nreal Light AR Glasses",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-12-27T19:44:17Z",
    "video_url": "https://www.youtube.com/watch?v=ht8vSX82PyM",
    "category": "Science & Technology",
    "tags": [],
    "views": 533421,
    "likes": 20425,
    "comments_count": 839,
    "description": "Give the gift of repair this holiday season at   The nreal light AR glasses have been around for a while now, but it's starting to come out to regular consumers. Of course, it's nothing new, but it's something you might want to consider trying out.   Check out the nreal light AR glasses at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Check out our podcast gear:  Private Internet Access VPN:  Our Official Charging Partner Anker:  Secretlabs Gaming Chairs:  MK Keyboards:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:   CHAPTERS --------------------------------------------------- 0:00 - These glasses are nreal! 1:21 - Unboxing 2:30 - Exterior overview and first impressions 5:27 - Sponsor - iFixit! 6:12 - Trying out the nreal glasses 7:05 - Screen impressions 8:50 - Trying out \"apps\" 10:40 - Interface and video resolution impressions 12:37 - Pricing 13:04 - Closing thoughts",
    "description_links": [
        "https://www.ifixit.com/LTT",
        "https://lmg.gg/zexuG",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://kit.co/linustechtips/lmg-podcast-gear",
        "https://lmg.gg/PIASC",
        "https://lmg.gg/AnkerSC",
        "https://lmg.gg/SecretlabSC",
        "https://lmg.gg/MKShortCircuit",
        "https://lmg.gg/NerdorDieSC",
        "https://lmg.gg/GMGSC",
        "https://lmg.gg/AmazonSC",
        "https://lmg.gg/AudibleSC",
        "https://lmg.gg/vfGlT",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I'm a little confused about the name. Is it like Nreal? Are you just trying to say real with N in front of like Nreal? Or are you trying to say en real or is it like unreal and they took the U off and so Epic Games was justified in like suing them for using a name that's very similar to Unreal Engine? Mark any thoughts? (beep) I can't even believe that it's here, which is actually a fair thing to say because I've been kinda following these things since they just got announced in 2019 I think. I think I did a segment on CES about the dev kit. Cut to the segment. The Nreal Light glasses have 10 ADP laser projectors that display images at 60 FPS with a 52-degree field of view. But this is not the dev kit, okay? This is exciting. I'm excited because this is the Nreal Light. People in Asia have had access to this for a long time. But now it's finally rolling out. I'm teasing you. See, I'm taking it halfway as I'm talking. Now it's finally rolling out and I think the US, Canada and Europe, I think it rolled out in November. The Nreal Light is here. They've already announced the Nreal Air, which is a more advanced version. And that's only rolling out in like Germany, Japan, South Korea, another place? So we're not getting that yet, but we're getting the light. And this is a way to unbox. Hey, should other people do this? - [Mark] Hurry up. - I kind of like this. And there it is. Okay. But look at that box. That's kinda nice, hey. They put a tiny bra in here for some reason, scandalous. It's one of the many nose pieces. So I can try that out. Are you up for some nose piece try-ons later? - [Mark] Yes. - I'm the worst unboxer. Why do they keep letting me do this? How are you supposed to... What? So this is not how... Oh, it just pops out. I guess these are maybe like the frame for like prescription lenses that you can have instead of putting the glasses on top of your existing glasses which is what I'm gonna do? We'll see how that goes. So it's nice to see, I mean, right off the bat that like, you know, it's not just like a thing and they just give it to you and it's like, if it fits, it fits. There are going to be some options for customization it looks like. Okay, is there a cable? Do you need to keep this connected to your phone all the time? Oh no. I mean, that's fine. It's early days. Okay. Here are the glasses themselves, Nreal Light. I mean, from a certain angle, you could maybe be like, oh, there's just a pair of sunglasses on the table over there. Oh, what? They're a portal to another world? This is interesting. This is the default position. And then there's like flex to it 'cause they hook around your head a little bit more than normal sunglasses. Yeah. It's a little bulky. I mean, this is a little more streamlined than I remember them being when I took a look at CES. But it still is like, I dunno, it's pretty bulky. I'm kind of scared to put them on. And this is interesting. Here's like the glass. And normally when you put on a pair of sunglasses, you have, this is your field of view, right? You can see the whole thing. But on the light, the machinery, the electronics obscures half the lens. So when I put them on, I'm only gonna see, oh no, I can't do this with my glasses. I'm gonna have to take my glasses off. It's touching my eyelashes. Oh, it's 'cause I don't have the nose piece on. Oh dear. That's not good. I mean, if I kind of like put it up. So yeah, this is interesting. I mean, with the HoloLens too, it also has that issue where it looks like you have this big field of view and then you put it on and you only have like a little square. I haven't turned it on yet. So I don't know how much is actually happening, but we're gonna find out I guess. Quick overview of the outside. Got a number of cameras on the outside. So one over here and one over here and then one in the middle. I think these might be for like recording or this one might be for recording and this one is for like the actual experiences. We got maybe some sort of rocker here. That might be volume although there's no speakers integrated. Oh no, yes there are, there are integrated speakers. So this might be volume, some sort of sensor here that I've already greased up with my forehead. 'Cause you wanna be lubricated when you slide into the metaverse. It's like Tim Allen in the Santa Claus when he goes down the chimneys that are too small. You've seen that movie? - [Mark] Yep. - Okay, good. There's a hook over here. That is for something. Maybe you put the cord there. Oh. So is that how you keep it on your face? You put it on your face and then you take the cord and now it's not going anywhere. Okay. Wow. I've never had my concerns with the product addressed so quickly. Now that's customer support. So what I'm supposed to do is plug this in to this phone that they've graciously provided that has all the apps available on it. They do have like a list of compatible phones on their website. So, if you are thinking about checking this out, make sure your phone is compatible first of all. I'm supposed to plug this in and then we'll get things really going. But before we do that, I gotta tell you about our sponsor. That's right. Thanks to iFixit for sponsoring this video. iFixit is the perfect gift for the techie in your life. iFixit wants to help you repair or upgrade almost anything in your home. Their Pro Tech kit has 64 bits and iFixit has the most popular opening tools all rolled up in one package. The kit also includes suction cups, anti-static wrist straps and more. Plus, everything is covered by iFixit's lifetime warranty. Save time and money and repair your own electronics using iFixit's step-by-step guides. For a limited time, get free shipping on orders over $50 with the code, for you and give the gift of repair this holiday season at iFixit.com/LTT. And now for the main event, you ready for this Mark? - [Mark] Born ready? - We're entering the metaverse. It's happening. I can't read that because I have to wear my glasses. That's not bad. That looks pretty good actually. I gotta say though right off the bat, the field of view, I don't know what the horizontal limits of it are, but it's taking up the entire field of view that I have, which is about like your whole body Mark. Oh, that is brightness control. So that rocker on the right, it's brightness control. My laptop has Windows Hello on it and it unlocked from this. It could recognize me. Turns out there is a screen recording limit of 30 seconds. So I won't be able to record the whole thing and show you guys, but I will give you snippets. Are you ready? So like, things don't look too bad. I mean, like, you know, this is probably like one of the sharper VR screens I've seen. So it seems like there are a couple of different experiences here. Right now I'm on like the MR or mixed reality space where you have access to like apps that you can open. Like I can open the photos app and then you can reposition windows. So I can move this over all the way to where Mark is and make the app inside his mind. Do you see all the photos now Mark? This is so weird. The screen is drifting. Like it it's like confused by the surroundings and so it like, it gets confused about what to do with the screen and it's like, tilts of like drifts away. As I move my head around, I can still see the edge of the menu, but it's being occluded by, I guess where the field of view ends on this thing. So the other mode is air casting. So if I go over here to say, switch to air casting, then I can mirror my phone's display on the Nreal Light display. So if I click that, it'll stop the screen recording. So I don't know how I can show you guys that, but trust me, that's what you see. It's like the phone. What is the use case for this? Like I understand HoloLens, you know, because it's like hooked into the Microsoft ecosystem and you're like, hey, send this person a message on Teams and it comes up and it's like all into the ecosystem. But like, I dunno what, we've got some games over here that we're gonna try out in a second. We've got regular apps like Twitter, I guess let's open Twitter and see what's up. So I'm going to open Twitter. I'm gonna reposition the window to the point where I can see most of it. And this is not the app. I opened the Twitter icon and it's switched to the app. We don't, enter theater mode. I'm so confused. So it looks like all these apps over here on the left side are basically just, they'll open up like windows. So you can use like, it's like using a desktop app. Yeah. So I opened up YouTube and here's the YouTube homepage. I can scroll with my phone screen. It's like I'm using a tablet I guess. And I have like, my phone is the cursor. I don't understand why you would ever do this. Okay. We got Spatial here. So that is an app that I know works on other VR and AR ecosystems as well. I'm not sure if it's on HoloLens. I think it is. But it definitely works on Oculus and other VR headsets. Oh, there's like a little animated thing going on. And it turned into a real person. Are you from BTS? I wish you could see this right now. People are dancing on the flat surface of the table that is extended halfway to the camera as well. Do I need to be here for this? They're just dancing. And now people are fighting. There's a little elf fighting a big tiger guy. And they're both wearing like samurai futuristic armor and they're using energy swords. And we won that round. I will say that if you've played VR or, I mean, I guess if you've played, I haven't really tried HoloLens to any significant extent. I did try, you know, a demo of these at CES as I said. If you played any sort of VR games or sort of like AR games on your phone, it's very similar except it's like having the phone here because like the field of view that I'm actually seeing is around this big. So it's like having a phone right here, but I will say that their Nebula interface which I will record here to illustrate, I will say that their Nebula interface here where you can kind of like open up apps and reposition windows, you can make it so that it's a pretty big screen you're looking at. Like, this is like looking at probably like a 70-inch TV right in front of me. And it looks pretty sharp. Like I gotta say, that's pretty impressive. So like looking over here, I moved the screens over here. As you can see, it looks way better on like a blank wall instead of a, you know, and I can get rid of the home screen. Instead of like looking at the cameras and Mark in the background. No offense Mark. So if I play a video here, - Finally in which means... - Wow. - They're ripping down the walls, they're wiring up the networking. - The video looks pretty sharp. So like, it's supposed to be a 10 ADP. I'll turn the volume down now 'cause that's too loud. Okay. So like that's great news. The speakers can get kind of loud. They sound like cheap phone speakers. Like what are you gonna do? But, I'm actually quite impressed by how sharp this video looks. Okay. You know what, Mark? This is a decent use case. Like maybe you put these on and you're watching a video and you got headphones plugged in and it's like watching it on a giant screen. There's the test. I don't know if this'll show up on the video or not. But if you watch movies like this, huge, huge, negative. But like, if you manage to put your head in a vice and remain completely still, baby shark. I was able to play the games a little bit and they're like, you know, it's like a little VR game. You know, if you like playing like the fun little VR demo games, that's basically what they have so far. There are more apps and games that are available on the play store from what I understand. This thing's 5 99, which is not horrible for like early-ish AR hardware. For consumers, if you are like not super in to like the technical side of augmented reality and virtual reality and you're like, oh, I want a fun device. No, do not. They're kind of marketing it like that, which is, I feel like a mistake. Now this is for people who are like tinker and they're really interested in augmented reality and they kind of wanna like play around and experience the jank for themselves. They've already developed the Nreal Air, which is a more advanced device. I'm interested in taking a look at the Nreal Air when it comes out. It's out like I said, in like Germany and Japan and stuff right now. It'll probably roll out in North America like this one did a year later. I don't know. But it's good to see multiple companies working on augmented reality solutions. I just wish that, you know, I didn't have to review them until they're ready to party. This is cool. It's fun. I don't wanna complain, but also catch me with the air. See you next time. And see you next time on the next episode of Short Circuit. That's what this video is. It's a channel. Subscribe if you want more of this, but also more importantly subscribe to their movie podcast and also to the Tekla, okay? Don't tell John I told you that. You cannot use this product. You are too greasy. I wish I could see what just happened, but I'm in the metaverse. Oh why don't you please tag me How do I look when I do this? Do I look like a not insane person? - [Mark] Kinda like Pewdiepie. - (laughs)I look like Pewdiepie?",
    "transcript_keywords": [
        "Nreal Light",
        "Nreal",
        "Nreal Air",
        "Nreal Light glasses",
        "phone",
        "Light",
        "Mark",
        "field of view",
        "put",
        "Nreal Light display",
        "kind",
        "screen",
        "thing",
        "Games",
        "apps",
        "app",
        "field",
        "view",
        "Air",
        "glasses"
    ],
    "transcript_entity_values": [
        "CES",
        "half",
        "over $50",
        "Tim Allen",
        "Germany",
        "5 99",
        "early days",
        "this holiday season",
        "Nreal Light",
        "US",
        "one",
        "Tekla",
        "iFixit",
        "the Nreal Air",
        "Mark",
        "Japan",
        "Nebula",
        "2019",
        "64",
        "Pro Tech",
        "second",
        "John",
        "November",
        "HoloLens",
        "Epic Games",
        "Twitter",
        "Microsoft",
        "Asia",
        "30 seconds",
        "a year later",
        "North America",
        "Nreal",
        "10",
        "first",
        "ADP",
        "South Korea",
        "Pewdiepie",
        "Canada",
        "60 FPS",
        "52-degree",
        "70-inch",
        "Short Circuit",
        "Oculus",
        "VR",
        "YouTube",
        "VR",
        "Unreal Engine",
        "the Nreal Air",
        "Europe"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "PERSON",
        "DATE",
        "GPE",
        "EVENT",
        "ORG",
        "ORG",
        "LOC",
        "TIME",
        "DATE",
        "LOC",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "GPE",
        "PERSON",
        "GPE",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "LOC"
    ]
}