{
    "id": "HubbDiz0nsc",
    "title": "Eluktronics Mech-15 G2 Review",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2018-08-30T16:03:06Z",
    "video_url": "https://www.youtube.com/watch?v=HubbDiz0nsc",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "barebones",
        "custom",
        "gaming laptop",
        "cheap gaming laptop",
        "best gaming laptop",
        "best keyboard",
        "best gaming keyboard",
        "best laptop",
        "cheapest gaming laptop",
        "fortnite",
        "gameplay",
        "doom",
        "laptop for gaming"
    ],
    "views": 600456,
    "likes": 16955,
    "comments_count": 1142,
    "description": "Dave2D review of the Eluktronics Mech-15 G2. A thin and light gaming laptop with a mechanical keyboard that isn't crazy expensive Available Here -    This is one of the only barebones laptops i like. It's a custom Gaming Laptop with clicky switches on the keyboard. It can be equipped with up to a GTX 1060 currently. It can also be loaded up with a 144hz screen, 32 gigs of ram, the i7-8750H all packaged in a thin and light chassis.  Background Music: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "https://amzn.to/2MXKgy2",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey hows going Dave2D here, this is a device that isn't from your standard kind of name-brand laptop company It's from a company called Eluktronics now. It's not a unique device to them this is a bare-bones computer that they sell and I normally stray away from Bare-bones laptops because I usually find just kind of boring. There's nothing really special about them. But this one has a unique feature that is Well, it's a mechanical keyboard and it's a good mechanical keyboard. So the keyboard has a really nice feel to it I'm someone that enjoys mechanical keyboards. I prefer that tactile switch from like the blue switches and stuff. I like it However, I don't feel like it brings if it doesn't make you a better gamer I feel like it if you're if that's what you're looking at this for like will this make me a better gamer because it's a mechanical keyboard? I wouldn't say that it does but it does give a more tactile typing experience and that's something you can't get on most laptops Regardless of what the keyboards are like you do need like that clicky swish to really get this feel and that's what this laptop Delivers now the layout of this keyboard is a little bit strange like the arrow keys and the number pad are all clustered together There's no negative space between them, but it's something you can get used to quite quickly And if you're looking for a tactile typing experience this thing definitely delivers. The trackpad uses Windows precision drivers There's nothing I really dislike about it and there's lighting in this whole keyboard area So there's lighting on the keys as well as a light strip. That's kind of facing you. I do like this light strip This isn't the first one we've seen But yeah, I like that kind of personal glow that it gives so the rest of the device is also quite good So the screen is your standard high-end gaming panel for 2018. So 144 Hertz 1080p good color accuracy and brightness It's a really nice looking screen. It's actually the same screen I believe as the aero 15 now to make use of the screen you have to have good gaming performance and this one delivers pretty good performance It's a 1060 and an i7 8750H and you're not gonna be able to get like killer performance, right? It is just a 1060 But you will be able to make use of that 144 Hertz screen in competitive titles like you can't hit that kind of frame rate in which are three but most First-person shooters are gonna look really smooth on this panel. The thermal performance is actually really good as well And this is something that I'm kind of shocked by like this is a boutique laptop company they sell way less of devices to someone like I don't I'm not gonna name names but there's other computer companies out there that make Laptops I just have terrible thermals and something like this from a small company is just like so much better really good thermals with lots of ventilation on the bottom and the sides and I think they could have put like a 1070 Max-Q in here if they really wanted to so the ports on this device are well, it's a good selection The only thing I have knock on is that there's no Thunderbolt 3 port there is a USB C in the back But there's no Thunderbolt 3 port so that's the other thing. I like the ports on the back It's something small But it's something that I enjoy like when you have your AC adapter connects into the back of a laptop it just kind of gets it out of the way and you have your display ports in the Back as well. It's just a well-designed series of ports another thing I like in terms of the design is that there's a dedicated button for the turbo mode on the fan So it's something that you can often control through software on other laptops But this thing has like an actual button right beside the power when you hit it and the fans crank up It's something I think a lot of gamers would use it is loud Like the turbo mode on this thing is very loud, but it does give you some incredible cooling when you need it These speakers are located in the bottom. They don't sound particularly great or anything They're more of a generic sound, but they're okay in terms of the build quality There's some good parts on there some not-so-good parts. So I looked at the top and the keyboard deck are aluminum They're actually quite sturdy It's well made in terms of just you know, the fact that it's got aluminum on the important parts The bottom panel is plastic, but it's a it's a well made plastic. There's no like play and a flex on this device it's well made but there's one thing I don't like about this whole device and it's the Edges it's not that they're sharp or rough, but they just feel unfinished compared to a lot of other aluminum devices out there it lacks that polish or finish that some of the more kind of premium devices would have And I feel like I'm nitpicking on this thing, but it is something that bothers me personally it probably doesn't bug most people but I wish that the finishing on the Edges was a little bit better. Now the design of this laptop feels a little dated to me Not that it's ugly or anything But if you look from the profile, it's just not a sleek or modern looking and some of the other devices out there But it's a I guess a personal preference thing. Um Oh internals pretty easy to get into and you have access here two RAM slots your two NVMEs as well as your two and a Half inch SATA the battery down here is pretty small It's 45 watt ours and I'm only getting like 2 and a half hours of battery life with the screen at 215 nits point being if you need to bring this to school or work and need to last the full day You're gonna need the charger with you. Now the question is whether or not this is worth it, right I think that's like the million dollar question with a laptop like this if you value the Tactile keyboard experience. There are very few devices out there. That'll fit the ticket. And this is one of them I do want to leave you with one note of caution. If you use this it's allowed keyboards you kind of keep in mind where you plan on using this like if you want to bring this to a library or Like a lecture hall and you want to tap away on this thing at? 90 words per minute People are gonna hate you because it's loud, but if you use your laptop in a more like personal environment And you don't really care too much about the sound that you're giving off to the other people around you It's a good keyboard. And I think it's a really good laptop Especially for the money now boutique devices like this are normally a little bit cheaper than like no ultra premium name-brand stuff So I don't think the pricing is amazing like it's not like a steel or anything like that But it's fairly priced and I think the device is good if you're looking for a pretty neat tactile keyboard ok Hope you guys enjoyed this video thumbs if liked it. Subs if you loved it, see you guys next time You",
    "transcript_keywords": [
        "company called Eluktronics",
        "called Eluktronics",
        "good",
        "keyboard",
        "thing",
        "laptop",
        "kind",
        "mechanical keyboard",
        "device",
        "good mechanical keyboard",
        "devices",
        "feel",
        "Tactile keyboard",
        "screen",
        "Eluktronics",
        "Barebones laptops",
        "laptops",
        "laptop company",
        "tactile",
        "make"
    ],
    "transcript_entity_values": [
        "Eluktronics",
        "1060",
        "three",
        "Edges",
        "1070",
        "Hertz",
        "Bare",
        "one",
        "AC",
        "First",
        "215",
        "2018",
        "two",
        "3",
        "first",
        "polish",
        "RAM",
        "the full day",
        "90",
        "2 and a half hours",
        "15",
        "45 watt",
        "144"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORDINAL",
        "NORP",
        "ORG",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL"
    ]
}