{
    "id": "hUdcurtyY4A",
    "title": "Apple killing the Touch Bar?!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-16T02:58:29Z",
    "video_url": "https://www.youtube.com/watch?v=hUdcurtyY4A",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "Apple",
        "Mac",
        "Ming Chi Kuo",
        "leaks",
        "macbook pro",
        "16",
        "14",
        "inch",
        "16 inch Macbook PRo",
        "Apple Silicon",
        "M2",
        "M1",
        "chip",
        "processor",
        "iMac redesign",
        "Mac Pro",
        "Intel",
        "ARM",
        "touch bar",
        "magsafe"
    ],
    "views": 461884,
    "likes": 27133,
    "comments_count": 941,
    "description": "Remotely monitor and manage your server or PC with Pulseway at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps: 0:00 Linus STAHP 0:05 Mac leaks 1:14 Whatsapp delaying policy change 1:59 QHD Gaming Laptops at CES 2021 2:51 Pulseway 3:29 QUICK BITS 3:35 RTX 3080 Ti delayed 4:05 Exynos 2100 faster than Snapdragon 888? 4:44 Xiaomi added to US entity list 5:03 Google acquires Fitbit 5:26 Microsoft to fix W10 NTFS bug  NEWS SOURCES  AND THE MAG CAME BACK Next Macbook Pro 16 inch info leaks Kuo   Gurman  iMac, Mac Pro  New Intel CEO says they have to be better than Apples lifestyle company   OK OK HOLD ON WAIT Whatsapp delays privacy policy amid confusion   Signal, Telegram get huge boost    LAPTOPS READ A SELF-HELP BOOK CES trend: 1440p laptops  Lenovo Legion 7 16 QHD gaming laptop   thinner, stealthier gaming laptops   QUICK BITS  RAYS DELAYED RTX 3080 Ti delayed indefinitely  RX 3050 Ti also spotted   MAKE YOU MISS YOUR EX Exynos 2100 might actually be more powerful than Snapdragon 888    OH WERE NOT DONE Few more Chinese companies added to U.S. blacklist  Communist Chinese military company    FINE, WERE ELOPING Google completes acquisition of Fitbit despite not having DOJ approval    THE MEDUSA OF COMPUTER BUGS Microsoft will fix hard drive-corrupting Windows 10 bug   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ces2021",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1294286-kuo-new-macbook-pro-models-to-feature-flat-edged-design-magsafe-no-touch-bar-and-more-ports/",
        "https://www.macrumors.com/2021/01/15/new-macbook-pro-models-magsafe-ports/",
        "https://www.bloomberg.com/news/articles/2021-01-15/apple-macbook-pros-with-magsafe-return-in-the-works?srnd=technology-vp",
        "https://www.macworld.com/article/3603414/imac-redesign-in-the-works-half-height-apple-silicon-mac-pro-coming-this-year.html",
        "https://appleinsider.com/articles/21/01/15/incoming-intel-ceo-demands-better-chips-than-lifestyle-company-in-cupertino",
        "https://techcrunch.com/2021/01/15/whatsapp-delays-new-data-sharing-policy-enforcement-to-may-15/",
        "https://thenextweb.com/facebook/2021/01/06/heres-what-that-whatsapp-privacy-policy-pop-up-means-for-you/",
        "https://www.nytimes.com/2021/01/13/technology/telegram-signal-apps-big-tech.html",
        "https://gadgets.ndtv.com/apps/news/signal-is-down-globally-after-huge-influx-of-users-2353231",
        "https://www.theverge.com/2021/1/14/22217171/gaming-laptops-qhd-screens-display-fast-refresh-rate",
        "https://hexus.net/tech/news/laptop/147293-lenovo-legion-7-worlds-first-16-inch-qhd-gaming-laptop/",
        "https://youtu.be/AKYYEeE5hM4",
        "https://www.cnet.com/news/at-ces-2021-gaming-laptops-arent-what-they-used-to-be-and-thats-a-good-thing/",
        "https://www.kitguru.net/components/graphic-cards/joao-silva/nvidia-has-reportedly-delayed-the-rtx-3080-ti-indefinitely/",
        "https://videocardz.com/newz/palit-submits-geforce-rtx-3080-ti-rtx-3050-ti-and-rtx-3060-to-eec",
        "https://linustechtips.com/topic/1294233-exynos-2100-might-be-faster-than-snapdragon-888/",
        "https://www.xda-developers.com/samsung-exynos-2100-specs-features/",
        "https://linustechtips.com/topic/1294108-more-us-china-tradewar-company-restrictions-including-xiaomi/",
        "https://mashable.com/article/xiaomi-chinese-military-company/",
        "https://www.bbc.com/news/business-55671629",
        "https://arstechnica.com/gadgets/2021/01/google-closes-the-fitbit-acquisition-pledges-to-not-use-data-for-ads/",
        "https://twitter.com/ceciliakang/status/1349730614958845953",
        "https://twitter.com/jonasLyk/status/1347900440000811010",
        "https://www.bleepingcomputer.com/news/security/windows-10-bug-corrupts-your-hard-drive-on-seeing-this-files-icon/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- [Man] Why'd you have to address it? - Linus took my seat. Ming-Chi Kuo, the Apple leaker known for his pretty good accuracy, claims to have some details about Apple's next Apple Silicon Macs. Apple debuted a new version of MagSafe in the iPhone 12 lineup. But according to Kou's sources, Apple will be bringing magnetic charging back to the MacBook line in the next MacBook Pro, which will come with 14-inch and 16-inch versions. Now, this might seem like just a rumor, but Mark Gurman, a slightly more respected Apple leak guy, said his inside sources had the same information, and additionally, James, don't get too excited, Gurman claims that a redesigned iMac is on the way this year, along with two Mac Pros. One with a smaller design and an Apple Silicon processor, and one's that's essentially an update to the existing Mac Pro, which will use Intel processors. Now, whether these turn out to be rumors or not, there's no question that Apple is making big moves, something that's recognized by Intel's new CEO, Pat Gelsinger, who told employees recently that Intel has to deliver better products to the PC ecosystem, than a lifestyle company in Cupertino. - [Man] Oh. - Dang, Pat, get them! - [Man] Go and try that. - The shade, I love the energy, keep it up. WhatsApp is delaying the plan to update to its terms of service agreement that caused mass confusion among its users. In case you're out of the loop, last week, WhatsApp pushed out a notice to users notifying them that they'd have to agree to the new terms and privacy policy, which included updates to how WhatsApp processes user data, and how they integrate with Facebook by February 8th, or stop using the app. That led to tens of millions of people downloading Signal and Telegram, two messaging apps that, like WhatsApp, offer encrypted messaging. The difference being, of course, that they're not owned by Facebook, the Smog of the data hoarding world. It's not a perfect analogy. (upbeat music) Google also hoards a lot of data. Also Smog doesn't sell his treasurer, and in doing so, hurt other people's privacy. Anyways, the important thing is Facebook sucks. And we saw lots of cool stuff at virtual CES this year, but arguably, one of the coolest trends we've seen in the realm of laptops. 1440p displays have been conspicuously absent from the notebook industry for a long time but, we saw them pop up in a number of laptops this week, including the Razer Blade 15, Acer Nitro 5, and the Lenovo Legion 7, the world's first 16-inch QHD gaming laptop. QHD is kinda perfect for high-powered gaming laptop, since it's sharper than 1080p, but not as demanding as 4K, which is kind of pointless on a tiny little screen anyways, IMO. We can thank NVIDIA's RTX30 mobile lineup for this, which is also giving us a bunch of thin, stealthy gaming laptops that will look more normal when you can actually go out in public again. You won't have to explain to that cute server why your computer's shaped like a dragon. - [Man] He understands. - Or she. Maybe they're just all into dragons. Now it's time for Quick Bits, brought to you by Pulseway, the software that lets you manage your systems from wherever you are, like a boss. You'll have complete real-time monitoring and control of servers, workstations and network devices, like printers and routers. You'll automate security patching on all your devices. You will have full access to real-time status, logged in users, and network performance. You'll laugh maniacally as you create and deploy automated custom scripts to complete IT tasks, like this (laughs maniacally), - [Man] That's maniacal. - Not maniacal enough. (upbeat music) Become the Pulse Master. Try Pulseway for free at pulseway.com, or through our link in the video description. Some bits are slow, and that's okay. But these ones are fast! - [Man] Whoa. (glass shattering) - Ah, whoa! Sources of apparently told GamersNexus, we're reporting on GamersNexus now, that Nvidia has delayed the release of the RTX 3080 TI from its initial launch window in February, and it may be that the community's intense response to the ongoing GPU stock shortage is the cause. VideoCardz reports that there's also an RTX 3050, and 3050 TI in the works at Nvidia, but who knows when we'll see any of those? Well, if this ordeal has given us anything, it's patience. Also crushing anxiety. - [Man] We need a vaccine for PPU. - It's expected that Samsung will, as usual, use Qualcomm Snapdragon chips in some of its Galaxy S21 phones, and its own Exynos chips in others, but- - [Man] Boo. - Hold on. But users with an Exynos model might not be so disappointed this time around. Specs for the two new mobile chipsets reveal the Exynos 2100 might actually be more powerful. - [Man] Still boo. (laughing briefly) - I don't want that. Then the Snapdragon 888, thanks to higher clocked components. It could also be too powerful, overheat, and explode in your pocket. But maybe it gets caught on video, and that will get you on the news. And Stacy would think you're a bad-ass for surviving it. Lots to think about. On their way out, the Trump administration is adding nine Chinese businesses, including Xiaomi, to America's entity list of firms that are Communist Chinese military companies. Xiaomi doesn't sell a ton of products in North America, but the list just kind of felt weird not having him in there. - [Man] I know, right? - Just felt kinda empty. - [Man] Yeah. - It's like this is where they belong. Google has completed their acquisition of fitness wearable company, Fitbit, for $2.1 billion, even though the US Department of Justice hasn't actually cleared the deal. In fact, Google is still under investigation for antitrust regarding that very acquisition. Google says the DOJ's waiting period expired, and they haven't texted in a while, so they just like went and did it. - [Man] That'd be gross. - We actually have a thing to get to, so. And Microsoft has said they're working on a fix for a Windows 10 bug that corrupted hard drives, super easily. A user would just have to open a system folder containing a one-line command that could be hidden, in a zip archive, a batch file, or even just a shortcut icon. Until the fix rolls out, I'd play it safe and just not open any folders. How will you upload your homework, though? You're gonna have to go inside the computer. (mimics slurping) Time for us to go to the weekend, guys. Come back on Monday for more tech news, during a normal week with only three \"TechLinked\" episodes. I know. This has been fun, but there is a thing as too much tech news. Trust me (sighs), it's not pretty.",
    "transcript_keywords": [
        "Apple Silicon Macs",
        "Apple",
        "Apple Silicon",
        "Apple Silicon processor",
        "existing Mac Pro",
        "Mac Pros",
        "Mac Pro",
        "Silicon Macs",
        "Intel",
        "Apple leaker",
        "Apple debuted",
        "Apple leak guy",
        "Facebook",
        "users",
        "Google",
        "WhatsApp",
        "Mark Gurman",
        "MacBook Pro",
        "respected Apple",
        "Apple leak"
    ],
    "transcript_entity_values": [
        "America",
        "4",
        "NVIDIA",
        "PPU",
        "$2.1 billion",
        "Google",
        "this year",
        "the Lenovo Legion 7",
        "February",
        "Mac Pros",
        "Razer Blade",
        "Samsung",
        "Quick Bits",
        "a normal week",
        "Ming-Chi Kuo",
        "Chinese",
        "Mac Pro",
        "Nvidia",
        "Windows 10",
        "Kou",
        "Stacy",
        "Linus",
        "February 8th",
        "MacBook",
        "Mark Gurman",
        "15",
        "a ton",
        "the weekend",
        "Acer Nitro 5",
        "MagSafe",
        "Xiaomi",
        "only three",
        "first",
        "two",
        "the Pulse Master",
        "GamersNexus",
        "Monday",
        "GPU",
        "this week",
        "3050",
        "Apple Silicon",
        "Fitbit",
        "Cupertino",
        "Pat",
        "14-inch",
        "one",
        "iPhone",
        "iMac",
        "3080 TI",
        "nine",
        "Pat Gelsinger",
        "last week",
        "Galaxy S21",
        "TechLinked",
        "tens of millions",
        "Microsoft",
        "North America",
        "the US Department of Justice",
        "Trump",
        "12",
        "Apple Silicon Macs",
        "Apple",
        "CES",
        "Exynos",
        "Signal",
        "Intel",
        "Telegram",
        "Qualcomm",
        "One",
        "Gurman",
        "WhatsApp",
        "MacBook Pro",
        "TI",
        "Pulseway",
        "Facebook",
        "DOJ",
        "Communist",
        "James",
        "16-inch",
        "QHD"
    ],
    "transcript_entity_types": [
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "DATE",
        "PERSON",
        "NORP",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "FAC",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "WORK_OF_ART",
        "CARDINAL",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "EVENT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "QUANTITY",
        "ORG"
    ]
}