{
    "id": "hvZIayO0bdE",
    "title": "What Car Do I Drive?! -- AskJerryRig #3",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2017-10-13T19:37:59Z",
    "video_url": "https://www.youtube.com/watch?v=hvZIayO0bdE",
    "category": "Howto & Style",
    "tags": [
        "Question and Answer jerryrig",
        "AskJerryRig",
        "Twitter",
        "Q&A",
        "JerryRigEverything",
        "About me",
        "cell phone repair",
        "Do it yourself",
        "how to videos",
        "youtuber",
        "youtube",
        "how to make youtube videos",
        "modivation",
        "JerryRig"
    ],
    "views": 609925,
    "likes": 23759,
    "comments_count": 2687,
    "description": "'Moh is my Bro' Shirts are HERE:  Here is the knife I talk about from Kobolt:  Its been almost a year since my last question and answer video. So its definitely time for another one. Lets talk, and answer your questions, everything from headphone jacks, to what kind of car I drive! Ask away. Ill be jumping back into the comments below, so feel free to keep asking new questions as they come to you! Find me on Twitter:   DRONE HISTORY VIDEOS: Illegal Mountain in Hawaii:  Hitlers Terrible Tower:  Neuschwanstein Castle:  Worlds Largest Waterfall: Cancun Underwater Museum:   Awesome iPhone Tool Kit:  Green Pry tool:  Metal phone opening tool:   T-SHIRTS:  The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://jerryrigeverything.com/product/moh-is-my-bro/",
        "http://amzn.to/2ymhkYh",
        "https://twitter.com/ZacksJerryRig",
        "https://youtu.be/Lm9M0YMuqRI",
        "https://youtu.be/fF2X6gcuZXU",
        "https://youtu.be/nA_f3sjyzbE",
        "https://youtu.be/8XZ9UfAbPy4",
        "https://youtu.be/WWvSw-HUksI",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "https://jerryrigeverything.com/product/moh-is-my-bro/",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice"
    ],
    "transcript": "So this is my third question and answer video. The last one was about a year ago, so it's high time for another one. I asked on Twitter a couple days ago what questions you guys have for me, and today I'm going to answer some of them here on camera. [Intro] The first one is from my buddy Super Saf, and he says, Do you even lift, Bro? I actually do enjoy going to the gym. I go pretty much every single day. Since I'm self-employed doing this whole YouTube thing, it's kind of like my only social interaction throughout the day, and so it's kind of important. More than lifting though, I like running. I've done two marathons, I've done quite a few Spartan races, I think like 8 or 9, and then a ton of Ragnar races as well. It's kind of like a relay race where you have 12 people and you run for like, a day and a half straight. But yeah, to answer your question, I think the gym and exercising is a very important part of a well rounded life. And I try to have a well rounded life in as many areas as possible. The next question is from Candice Navarro and it says, Is it true that Apple took the headphone jack off because they ran out of screws over the years they've been screwing people? I think you and I would get along very well. Speaking of Apple philosophies, we have Deke asking, Will you ever start buying phones without a headphone jack? Is it really a must have for you? To answer that question I would say that everything I have in my life is useful in one way or another. I pick the most useful things for me. One example would be that I've carried a pocket knife with me every day for like the last 10 years, give or take. It's this pocket knife right here, and I choose that this one's the most useful for me because it has swappable razor blades. So when one gets dull I can just swap it out really easily, pop it back in my knife and it's good to go. And so for me personally, this knife is the most useful. It's cheap, efficient and effective. And in my daily driver, like my vehicle, my truck, I have a tool box in the back that is constantly prepared with a bunch of different tools that I could use in any kind of situation. Now a cellphone is the exact same way. I want my cellphone to be equipped with all the tools that I might need, even if I don't actually need to use them that same day. Like I personally own a ton of wireless Bluetooth headphones and I love them. Like running on a treadmill with a cable attached to your ears is kind of dangerous. I've seen people whack that cable and their cellphone goes flying across the room. I've even done that a couple times. So wireless headphones are a must at the gym. But I have left my headphones at home a couple times and I'm not going to buy a brand new $70-$100 pair of headphones at the gym. I would much rather buy a $10 corded pair of headphones that I can leave in my truck or leave in a car, leave in your backpack, just to have whenever you might forget your expensive pair of headphones. A headphone jack is also useful when you're driving around in someone's car and they have an AUX cable that you can just plug into your phone to listen to music. Don't have a headphone jack can't plug your phone in. Or if you're an entrepreneur and you need need one of those Square readers to plug in to take credit cards with your phone you need a headphone jack for that. Or if you're on a long flight, 10 or 15 hours, and your battery dies in your wireless headphones, it's nice to have a cable to plug into your phone and use. So for me personally, right now, while there are still phones out there with a headphone jack installed, like the LG V30 or the Samsung Galaxy Note, or the Galaxy S8, I'm going to pick one of those phones because it's useful more often than not. My daily driver is going to have a headphone jack because I like useful things. Alright we have another question from Zach, good name by the way, If it wasn't for YouTube, what would you be doing? I would say if it wasn't for YouTube right now, I would probably still be fixing stuff and working on things. When I first started my YouTube channel, I was actually working on jeeps. Like my first 50 or so videos was me doing CV axle swaps. I did an engine swap in a Grande Cherokee. Working on big tangible objects. I mean don't get me wrong, cell phones are great, but they're really small and I would prefer to work on something bigger. So if it wasn't for YouTube, I would probably either be doing construction somewhere or being an auto mechanic, but still focusing on the business aspect of it and not just being a technician. I'd probably own my own little shop somewhere. And also, I probably wouldn't be that big into social media, and my phone would probably be 2 or 3 years old and broken several times over. Not sure how to say this one...Kvaju says, Do you put dbrand skin on your phones or do they come preinstalled? Because they are pretty hard to install. So actually my job right before I started YouTube was working as a cell phone sales rep for one of the major carriers here in the United States. And so I've put on over thousands and thousands of screen protectors on customers phones. So putting on a dbrand skin is actually pretty easy for me, and I've installed all the ones you've seen on my channel myself. But it does take a little bit of practice and patience to get it right. One trick if you're installing a screen protector and you get like a little piece of dust or something underneath, lift it up, I know a razor blade is probably not the tool of choice for most everybody, but lift it up with something sharp like a toothpick or a needle or something like that, and then you can stick a piece of clear Scotch tape underneath and grab that dust speck, pull it out and let the screen protector fold back down over the screen again. Little trick of the trade. Elliot Cardwell asks, How frequently do you change your daily driver? And what's been your most used phone ever? Switching my daily driver...I hate switching my phone actually, even though I have a lot of phones available to me (that have all been damaged slightly), I don't switch my phone that often. I use my tested Galaxy S7 Edge for about a full year before I switched to the Galaxy S8 Plus. And that's the phone that I'm using right now- the Galaxy S8 Plus. I do have the Note, but I haven't switched to that. I don't feel like there's that much of a benefit from me switching from this phone, which is about the same size, all the way to the Note. I would like that second camera, having that telephoto lens would be pretty cool. It's not worth the effort for me to switch over to that phone for just that one small increment of improvement. So I'm going to stick with the Galaxy S8 for a while. If I wasn't a YouTuber though, like I mentioned before, I would probably keep my phone for 2 or 3 years before switching. But to answer your question, I switch about once a year. So there were actually a couple of these questions. DiamondGuy asks, Do you have a car? If yes, what type is it? Let me show you. So I drive a 1998 Toyota Tacoma. This thing has 242,000 miles on it. It's held together with a little bit of duct tape. Over here on this light, I hit a fence a couple years ago, and this light I've never been able to get back in the right spot, so I just have some tape holding it in place. I scratched a little bit of the backside right there. Added the light bar a couple years ago. So one of the bad things with Toyotas is that they never die. This thing has 242,000 miles on it. I replaced the muffler actually a couple days ago because it was wearing a hole through the center of my bed. So you can actually see down into the ground below my truck. There's that toolbox I was talking about. There's actually a hole right there in the bed as well. And this has working out really well for me for a really long time. I'll probably get a new one here in the future, probably another Tacoma. I've had good luck with them in the past, but this one's doing just fine. The next question is from Runstairs and he says, Why is your Tacoma so old and beat up? I'm sure your YouTube money could buy you a new one. I think she's beautiful. What was your favorite video on your channel so far? So I had to think about this one for a second. I have over 500 videos on my channel and I've enjoyed every single one of them, but if I had to pick my favorite videos, they would be my drone history series. I only have 4 of them right now, but I would choose them because one, I get to travel, two, I get to learn something which is kind of like the whole point of life, and three, I get to show something from a a unique perspective that hasn't been seen before from an aerial shot of a drone. I've done Hitler's anti-aircraft tower in Germany. I've done an illegal Stairway to Heaven hike in Hawaii which is pretty intense as well. Done another castle in Germany. And I've done the world's largest waterfall in Africa. I've done another one that doesn't quite count. It's an underwater drone that did Cancun at the Underwater Museum. It's a bunch of statues that are buried under water to help facilitate the plant and animal life below the ocean. So it's not quite like an aerial drone review but it's still pretty sweet. I'll link all 5 of those videos down in the video description of this video if you want to check those out. They're my favorite. Allen Porter says, What is the most common rookie mistake people make when trying to fix a phone? I would say...so I get a lot of comments on my videos, a lot of people who have been successful with their repairs and some who have not. And I would say the consistent factor in those people who haven't been successful with their repair is that they weren't gentle enough, they used too much force, or they put their screws back in the wrong hole. So go slow, and be gentle, and make sure you put your screws back where you found them. Remember that these phones are incredibly fragile and expensive. And if it's your first time repairing a phone, it's a pretty difficult project. The good thing though is that once you've repaired one phone, that same skill set applies to all the phones, and it gets easier as you go along. Dennis says, What's the best tip you could give for someone just starting out with YouTube videos (doing tech reviews or similar)? I would say the biggest tip I could give is to just get started. That seems to be the biggest hurdle with everyone I've talked to and I've talked to hundreds of people. I think most people are surprised at how much work it is after uploading one or two videos. But the biggest thing is just people not starting. You don't need to wait for the perfect moment, that'll never arrive. And you don't need to wait till you have an expensive camera or tools or setup. I think my first 100 or so videos were all shot with my cell phone. And this was back 5 years ago when cell phones weren't even shooting in 1080p. I think 720 was some of my first videos. That was the maximum resolution that phones could shoot at. And cellphones nowadays are pretty incredible. So it's important not to let your dreams just be dreams and actually do something about them. I'll so a new set tour here in a couple weeks. I am in a new space, so my setup tour from 2016 is incredibly outdated. I'll make sure to have that up before the end of the year for sure. And the last question is, Do you have a website? And yes I do actually. I have a website that talks about some of the conferences that I've spoken at. It also has a little bit more about me. And, I also sell some of these shirts Moh is my Bro. I can pretty much guarantee that no one who doesn't watch this channel is going to know what this shirt even means, so it's kind of fun to wear it around. I'll have these shirts and everything else I've talked about in this video linked in the video description, and I'll be hanging around in the comments section for about an hour after this video has been posted, so if you have any more questions, let me know and I'll answer them down there for ya. Once again, thank you so much for watching. I could not do whit channel without you. I really do appreciate it every time you come back and watch something else that I've made. Thanks a ton for watching and I'll see you around.",
    "transcript_keywords": [
        "phone",
        "headphone jack",
        "phones",
        "videos",
        "headphone",
        "headphones",
        "question",
        "Galaxy",
        "video",
        "pretty",
        "people",
        "YouTube",
        "couple",
        "years",
        "back",
        "kind",
        "jack",
        "answer",
        "day",
        "couple days ago"
    ],
    "transcript_entity_values": [
        "2 or 3 years",
        "the Galaxy S8",
        "a couple weeks",
        "the Samsung Galaxy Note",
        "two",
        "two marathons",
        "YouTube",
        "DiamondGuy",
        "a ton",
        "Super Saf",
        "CV",
        "the United States",
        "YouTube",
        "first",
        "the last 10 years",
        "Toyotas",
        "Cancun",
        "the day",
        "a couple years ago",
        "the years",
        "Runstairs",
        "9",
        "about a year ago",
        "about a full year",
        "jack",
        "Africa",
        "YouTuber",
        "5 years ago",
        "the Galaxy S8 Plus",
        "70-$100",
        "Apple",
        "daily",
        "10",
        "Kvaju",
        "2016",
        "third",
        "Square",
        "one",
        "a couple days ago",
        "LG",
        "Ragnar",
        "the Galaxy S8",
        "the end of the year",
        "the Underwater Museum",
        "Hawaii",
        "8",
        "1080p",
        "Spartan",
        "three",
        "V30",
        "Galaxy S7 Edge",
        "Moh",
        "10 or 15 hours",
        "720",
        "2 or 3 years old",
        "1998",
        "5",
        "second",
        "Germany",
        "12",
        "One",
        "Tacoma",
        "Twitter",
        "Dennis",
        "over thousands and thousands",
        "242,000 miles",
        "Candice Navarro",
        "Hitler",
        "4",
        "Toyota",
        "hundreds",
        "about an hour",
        "500",
        "Allen Porter",
        "Elliot Cardwell",
        "YouTube",
        "Grande Cherokee",
        "Zach",
        "Deke",
        "every day"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "TIME",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "GPE",
        "GPE",
        "ORDINAL",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "DATE",
        "DATE",
        "LOC",
        "CARDINAL",
        "DATE",
        "DATE",
        "PERSON",
        "LOC",
        "ORG",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE",
        "FAC",
        "GPE",
        "CARDINAL",
        "DATE",
        "NORP",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "TIME",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "GPE",
        "PERSON",
        "DATE"
    ]
}