{
    "id": "hWn6QAcm-94",
    "title": "OnePlus Buds Review: new buds, who dis",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-07-24T13:00:12Z",
    "video_url": "https://www.youtube.com/watch?v=hWn6QAcm-94",
    "category": "Science & Technology",
    "tags": [
        "oneplus buds",
        "oneplus earbuds",
        "oneplus buds review",
        "earbuds",
        "wireless earbuds",
        "oneplus",
        "earbuds oneplus",
        "wireless oneplus buds",
        "wireless earphones",
        "headphones",
        "audio test",
        "mic test",
        "ear buds",
        "wireless",
        "apple AirPods",
        "AirPods",
        "apple",
        "airpods apple",
        "letscom",
        "letscom buds",
        "true wireless earbuds",
        "earbuds review",
        "review",
        "hands on",
        "first look",
        "becca farsace",
        "price",
        "sound",
        "features",
        "audio",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 639549,
    "likes": 16864,
    "comments_count": 1107,
    "description": "OnePlus Buds are here. The new $79 earbuds look similar to Apples AirPods with a rigid, hard plastic design. They offer good battery life, decent sound, and a cheap way for OnePlus owners to get into true wireless earbuds. Becca Farsace has the full review for the OnePlus Buds.  Read the full review here:   If you buy something from a Verge link, Vox Media may earn a commission. Seeour ethics policy:   Here are the earbuds Becca featured in the review  Letscom Buds on Amazon:  Apple Airpods on Amazon:  OnePlus Buds on OnePlus:   Listen to Becca's playlist here:    Subscribe:  Subscribe to Verge Science:   Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "https://bit.ly/3f4MJ3X",
        "http://bit.ly/2TQsqjB",
        "https://amzn.to/3jyjGZH",
        "https://amzn.to/39uWxD6",
        "https://fave.co/3fVUGJT",
        "https://spoti.fi/2WRBTaS",
        "https://bit.ly/3eXvW2y",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Tell me that's what I think it is, tell me that's what I thought, new buds who dares? (bright upbeat music) Come on. (sighs) (bright upbeat music) (keyboard typing) - [Man] The next day. Let's just play a quick game. Okay, which one of these earbuds cost $20? Which one cost $80? Which one cost $160? The $80 ones are the OnePlus Buds and the point is OnePlus made an AirPod alternative, it looks just like every other AirPod alternative on the market and like, of course they did. I mean, this stem design has proven to be hello functional. The mic is close to your mouth, the fit fits most people, and the amount of ambient sound that went through is just enough to still feel part of the world around you, but also be able to hear your music. Okay, so the question for the OnePlus Buds is not about fit and form, but instead it's did OnePlus make an AirPod alternative for half of the price that is as reliable and as functional as AirPods? Let's get into that. (bright upbeat music) So the OnePlus Buds, they come in a pretty plasticky oval case, that is a bit wider than the case of the Google Pixel Buds and thicker than the AirPod's case. On the bottom, there's a USB-C port, on the back, a pairing button, on the inside magnets hold the buds snugging the case. They come in black, white and this kinda crazy teal color that I think is a little bit too much of a purple color but I have about Andrew who like is totally gonna take these. On a full charge, the buds get you around seven hours of continuous music playback and the case holds 30 hours of music playback, which is around four full charges. It takes around 80 minutes to charge the case from zero to a hundred and I have had zero issues with battery life while using these and I am a bud's power user, but I'm also a wireless charging super fan and there's no wireless charging in these. OnePlus claims that these buds, hold on, I wanna quote this, I wanna get this right, \"These buds have unique noise reduction algorithm and three microphones on each bud to improve clarity.\" That sounds like a hell of a claim and it also sounds like we need to do a mic test. And we're doing kitchen again, because I really think that (tap water running) this is a hell of a background noise to try to get rid of. First up we had these headphones from Letscom, they were $20 on Amazon, I bought these because they were the cheapest I could find that looks like AirPods and also have pretty decent reviews. And for $80, we have the OnePlus Buds. These have three microphones on each bud so it should really be picking up my voice and I mean, of course these long stems absolutely help. And for $160, these are the AirPods and we say this every time we do a mic test, this is the gold standard, blah, blah, blah, blah, blah but usually it is pretty good. Run the water. (tap water running) Can you hear me now? We have the sink running, maybe when you're washing your hands, washing the dishes. Life cannot stop 'cause you gotta wash your hands we're gonna be like this for a long time folks. And here are the AirPods standing next to you this small waterfall that is my kitchen sink. Can you hear me over this small waterfall? Wow, never so clearly have I been able to hear a price difference. These AirPods blow these other two pairs out of the water and yikes, these OnePlus Buds do not sound much better than this $20 pair, but let me know what you think down below. Okay, I understand my quality is very important to me and maybe not as important to you, so let's talk audio quality. (bright upbeat music) Buds, they sound pretty good like I sat on my couch for a very long time trying to differentiate these from the AirPod Pros, the first gens and I could not. There's a song by JAWNY called \"Anything You Want\", it has like this subtle shaker in the back of it's chorus and I was really trying to like see who could differentiate that sound better and I couldn't find a difference. I mean, you're not gonna get a crazy amount of bass with this open-ear design, but there are 13.4 millimeter drivers in here that can actually kick and compared to these like $20 ones I got off Amazon, I mean the audio quality on the OnePlus Buds is much better than the $20 version and very comparable to the $160 AirPod. Yeah, these $20 buds, they sound like $20 buds. The words I would use to describe their audio quality is tinny, very small, $20, the end of story. (chuckles) The OnePlus Buds are IPX for water and sweat resistant. These buds will be good in the rain and definitely protected from sweat. A big downfall to these buds though is that you cannot use one bud independently, and as soon as you take one out, your music will pause, and when you put it back in your music will resume. There's also no app for these buds and the tap control out of the box are limited. Double tap a bud to skip to the next song or hold down on a bud for three seconds to switch between synced devices and that's it. OnePlus claims that when these buds start shipping in late July, OnePlus phones will be pushed a software update, allowing them to choose their preferred action for double tapping, including pausing music, jumping to the previous track or activating the Google Assistant. But that's only for OnePlus devices and dudes, (sighs) our $20 faves off of Amazon have more touch controls than the OnePlus do at this moment in time. On the $20 buds, tap once to pause, double tap to skip a track and triple tap to go back to the previous track, which I think are great controls and should just be standard amongst all buds, but you know, to each their own. (bright upbeat music) So are the OnePlus Buds, a half-priced AirPod alternative that are reliable and functional? Yes, yes they are, and if you're a OnePlus user, you're gonna have full control over these. But for everybody else, there is a massive market of AirPod alternatives out there that range from $20 to $160 and beyond. And (sighs) there are other options that maybe have a little bit more functionality than these do. If you'll allow me to be in my feelings for just like two seconds more, (sighs) from a company whose slogan is \"Never settle\", I was just like hoping, yeah, like really, really hoping, hoping for a little bit more innovation.",
    "transcript_keywords": [
        "buds",
        "OnePlus Buds",
        "OnePlus",
        "bud",
        "AirPod",
        "Google Pixel Buds",
        "AirPod alternative",
        "case",
        "AirPods",
        "music",
        "sound",
        "blah",
        "tap",
        "Pixel Buds",
        "Amazon",
        "alternative",
        "OnePlus claims",
        "hear",
        "pretty",
        "bit"
    ],
    "transcript_entity_values": [
        "zero",
        "a hundred",
        "the OnePlus Buds",
        "one",
        "just like two seconds",
        "the Google Pixel Buds",
        "around 80 minutes",
        "the OnePlus Buds",
        "three",
        "OnePlus Buds",
        "20",
        "Google",
        "AirPod",
        "Letscom",
        "three seconds",
        "Anything You Want",
        "Buds",
        "AirPod",
        "13.4 millimeter",
        "half",
        "two",
        "around four",
        "JAWNY",
        "Amazon",
        "160",
        "around seven hours",
        "AirPods",
        "30 hours",
        "$20 to $160",
        "late July",
        "first",
        "The OnePlus Buds",
        "80",
        "First",
        "Andrew",
        "OnePlus"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "MONEY",
        "TIME",
        "PRODUCT",
        "TIME",
        "MONEY",
        "DATE",
        "ORDINAL",
        "ORG",
        "MONEY",
        "ORDINAL",
        "PERSON",
        "PRODUCT"
    ]
}