{
    "id": "hXdLpnvbixs",
    "title": "Corvette E-Ray Test Drive!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2023-10-13T14:51:20Z",
    "video_url": "https://www.youtube.com/watch?v=hXdLpnvbixs",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "Justine Ezarik",
        "iJustine Tech",
        "iJustine Tech Reviews",
        "iJustine Reviews",
        "iJustine Apple Review",
        "iJustine iPhone",
        "iJustine Apple"
    ],
    "views": 57190,
    "likes": 2430,
    "comments_count": 154,
    "description": "Got a chance to check out the new Corvette E-Ray!    PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "https://www.youtube.com/watch?v=U0LfqfMGd-4",
        "https://www.youtube.com/watch?v=DNQGoAzBOUQ",
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Today is gonna be so exciting. Next to me is the brand new Corvette E-Ray. Now, I've done a few videos about this in the past, most recently because this is the brand new cover car for the new \"Forza Motorsport.\" But, I've never actually got to get behind the wheel and drive it. But today, that's all gonna change. So, let's hop in! (upbeat rhythmic music) I really wanna go through a drive through, like maybe a Starbucks or a Wendy's, McDonald's, In-N-Out. I don't know, whatever., it doesn't matter. (energetic electronic music) (E-Ray engine rumbling) (E-Ray accelerating) (energetic electronic music swelling) I need one of those. (pretzel crunching) - It's just gonna be us eating pretzels. (laughing) (energetic electronic music continues) - So now that we're inside, this interior is called Artemis. And this exterior is also a new color, it's called the Sea Wolf, and it is so beautiful. If I was gonna get this car, I would definitely do the Sea Wolf, I am obsessed with it. For the interior though, if it was my car, I would definitely get a little wild and do some fun colors. You can customize so many different things on their website. And the first time that I looked, I was like, \"Okay, this is overwhelming,\" but I love that there's so many different options that you can choose from. So the interior of this does have a very similar feel to a Stingray, but because this is an E-Ray, that's where the electrified boost comes in. So, I wanna give you guys a demo of Stealth mode. So, this will allow you to jump into the battery mode, so you basically will not hear a single engine. So, this is great if you're pulling out of your garage at like 6:00am, and you don't wanna wake your neighbors. So now, we're popping it into Stealth mode. So we have Normal, we've got Shuttle, and then we just cruise over here to Stealth. Now when I actually start the motor, you're gonna hear nothing. Nothing's gonna happen. (gentle rhythmic music ending) Silence. Here we are. Okay, let's drive away. It's so quiet! Oh man, (laughing) wow! So now I'm gonna turn off Stealth mode, and you can hear what this actually sounds like. (E-Ray engine revving) (upbeat rhythmic music) Can I do a chicken nugget Happy Meal? (upbeat rhythmic music continues) What toy do you think that we're gonna get? It looks like it's Pokmon. - You love Pokmon. (laughing) - Where's the toy? Oh my God, they're Pokmon cards. No way... Thank you, that's so good. First, I'm gonna feast on my nuggets. I'd offer you one, but you don't eat meat. So far, this has been so much fun. We've also had a lotta strangers coming up and asking about the vehicle because technically, as of now recording this, not really very many of these on the road because they are just going into production. So, making some friends. Where should we go next? - Anywhere we want. - Sounds good. I gotta move on (electronic oscillating music) I gotta move on (electronic oscillating music continues) So one of the things that makes this car so unique is the fact that it does have this electrified boost. Now, I haven't driven that many Corvettes to really be able to give you (laughing) like some sort of side-by-side comparison. But I did recently go to Spring Mountain Resort, in Vegas, and drive the Stingray around a track. So for me, just coming off of that and then taking this car out around the street has been a really cool comparison. But what I really like is that electrified booth. Now, I would not call this car... Technically, I guess it's a hybrid because it does have a battery, but this is not something that is made to be driven as an electric car. Now, it has that electrified boost just to really give you that extra power, which is pretty impressive, especially right off the line. (E-Ray accelerating) What's interesting about the battery is there is a little button right here on the side that you can press, and as you're driving, it'll automatically regenerate the battery for you. So you don't have to plug it in, you don't have to charge, it'll automatically do that while you're driving. So when you're in the electric mode, you can drive up to about four miles, or when you reach 45 miles an hour, it'll automatically engage the engine. So it's definitely not something that you're gonna be driving around town in electric mode. I mean, you can, but again, only up to four miles or when you hit 45 miles an hour. So now, this car will go zero to 60 in 2.5 seconds, which is the fastest Corvette so far in history, which is pretty impressive. Now, having just recently driven the Stingray, I do feel like this has a very similar feel to it, so if you are someone who doesn't wanna stray too far away from something that you're comfortable and familiar with with Corvette. I mean, I don't have a ton of experience driving these cars, but for me, having raced this around the track and now racing around Los Angeles, it does have a very similar feel. Like the interior, the seats, like everything just feels cozy and comfy. Another thing that's really fun is you can record your rides. Now, this isn't new to the E-Ray, you could also do this on the Stingray as well. But you have the ability to go in and record to an SD card, and you can put the SD card right here in your dashboard. And right now, it says I can record up to 1,000 hours just on this 128GB SD card. And it does record 1080p, and you can choose what type of layover you wanna have. So right now, I have my in Sport mode, you can change it to have none, and this will give you different types of specs depending upon what mode you have. (gentle rhythmic music ending) Goin' up! It's like a transformer. - It's really cool. This is very nice. - I would like to do an unboxing of our Pokemon cards. (Justine laughing) - Here we go, this is the good stuff right here. - Okay, we're driving again. - So, I'm not unboxing? - Hold on, let's pause. - [Walkie-Talkie] Just get a little closer, and then pass us. (low rhythmic music) Oh man, that was so much fun. Alright, Jen, what did you think? - It's so much fun. I'm very jealous that I didn't get to drive it. You literally were like, \"Hey, look out your window,\" this morning- - Yeah! - And I look out my window, and I'm like, \"Pick me up.\" - Check this out, we've got a frunk. - (gasping) You didn't show me the frunk. (frunk popping) Oh! - Yeah, so it does have a trunk and a frunk. Look how much space we have. - [Jen] That's actually pretty decent. - Yeah. Look at this, we've got a snack net. - You do have a lotta snacks back here. - But since this is the convertible version, the trunk is a little bit smaller because you do need kinda a place to put the top. - Thanks for the ride though, Jus. - Yeah thanks, see you later, bye. - Oh, okay- - Great chat. - I'll guess I'll go home now. - See ya later. Thank you guys so much watching. I had so much fun driving the E-Ray around today. And even though I do have to give this back, I'm really, really sad. But thankfully, \"Forza\" is now out, so I can at least play a virtual version. I definitely look forward to hopefully driving this around again, I would love to take it to the track. And hopefully, we'll have some more car content here 'cause I'm obsessed now. See you guys in the next video. Bye! (gentle rhythmic music fading)",
    "transcript_keywords": [
        "car",
        "Stealth mode",
        "mode",
        "driving",
        "Sea Wolf",
        "Stealth",
        "drive",
        "fun",
        "Stingray",
        "give",
        "Corvette",
        "interior",
        "Pokmon",
        "Yeah",
        "feel",
        "Forza Motorsport",
        "electrified",
        "ERay",
        "miles",
        "battery"
    ],
    "transcript_entity_values": [
        "zero",
        "Shuttle",
        "one",
        "Corvette E-Ray",
        "Corvettes",
        "four miles",
        "Justine",
        "Forza",
        "Artemis",
        "Wendy's",
        "Pokmon",
        "a ton",
        "Corvette",
        "45 miles an hour",
        "Los Angeles",
        "GB SD",
        "Jen",
        "Jus",
        "Starbucks",
        "SD",
        "today",
        "128",
        "about four miles",
        "60",
        "Spring Mountain Resort",
        "Pokemon",
        "Vegas",
        "first",
        "Stingray",
        "the Sea Wolf",
        "Pick",
        "First",
        "Forza Motorsport",
        "2.5 seconds",
        "up to",
        "McDonald's"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "QUANTITY",
        "PERSON",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "QUANTITY",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "LOC",
        "PERSON",
        "GPE",
        "ORDINAL",
        "PRODUCT",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "ORDINAL",
        "WORK_OF_ART",
        "TIME",
        "TIME",
        "ORG"
    ]
}