{
    "id": "HXSZurzYWGc",
    "title": "I've HAD IT With Samsung - Z Flip 4",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2022-08-11T18:07:56Z",
    "video_url": "https://www.youtube.com/watch?v=HXSZurzYWGc",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 299427,
    "likes": 9141,
    "comments_count": 999,
    "description": "Are Samsung's new Zflip 4 and Zfold 4 a big enough upgrade?   The WEIRDEST Japanese Dollar Store Tech:  Apple Has a BIG Problem:  The WEIRDEST Products at Costco:  Tech We Wish Would Come Back:  Ranking the WORST Controllers of All Time:   Subscribe!  Twitter:  Matt:  Instagram:   Chapter Titles ------------------------------- 0:00 Hello and- 0:32 The Galaxy Z Flip 4 is Official 1:47 Those Improvements Dont Matter 2:44 Austins Many Broken Z Flips 3:42 2-Month Old Z Flip Also Broken 4:38 Foldables are Good, But 5:48 If it doesnt last a year, it doesnt matter 6:48 Credit Where Credits Due 7:25 Austin rips his screen off 8:37 Did it help? 9:12 Someone has done foldables better.. 10:33 What do you think?",
    "description_links": [
        "https://youtu.be/ldg1XtSnVFM",
        "https://youtu.be/C0GWWNAoJlU",
        "https://youtu.be/Uw6OsPUbR7I",
        "https://youtu.be/zIj2tK2lJOI",
        "https://youtu.be/xJBcNbS-uTM",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel"
    ],
    "transcript": "- Matt- - Hello, it- - No, no, no, Matt. - You keep trying- - I gotta do this, I gotta do this. - You keep trying to take- - I have a problem. I need to sit down, I need to talk with my buddy, Matt, 'cause something is bothering me. And that something is Samsung's so close to perfection - I think I know where this is gonna go. - You do know where this is going. There's a brand new Z Flip and I'm mad about it. - [Matt] Anyone who's ever watched a video of ours in the last three years knows that Austin's been on the Z Flip train. - Can I tell you what's new about the Z Flip 4 and then I will rant for hours at a time about why I- - We're not gonna rant for hours at a time. - Here's the good news. The Z Flip 4 and the Z Fold 4, if you're a big Fold-y boy, are now official. We have some lovely updates. I'm gonna talk about Z Flip because generally speaking Z Flip is what I've been using for the last two and a half years. If you look at the Z Flip, there are, in my opinion three major problems with it. Number one is camera. This is using a camera from, I think the Galaxy S10e it's from the Z Flip 1, Z Flip 5G, Z Flip 3, they finally updated at least the main camera to be better. Maybe not a world class, amazing camera but it's going from okay to hopefully pretty good. Step two: battery life. Battery life is actually okay for me on Z Flip 3, but I would say this is borderline barely acceptable for most people in 2022. Certainly worse than almost any other regular phone. I mean, everything can last a day, day and a half. I can make it through a day on Z flip 3, but it's always like I'm getting close toward the end. Now they've improved. Not only is size of the batteries are gone from 33 to 37 hundred milliamp-hours. And it is a more efficient Snapdragon 8 gen + 1 whatever processor, basically they claim you'll get a couple extra hours of battery life out of the Z Flip 4. Both are meaningful, real updates. - And I will tell you that when it comes to foldables, I really don't care about either of those. - Well, no, you need a good camera. You need decent battery life. And they, it would for me- - But neither of those matter, because one super, super, duper glaring flaw of foldables, you can have the best goddamn camera in the world. You can have 12 day battery life, but guess what? This thing can't last a year. - The third issue with the Z Flip, and I had to double check my spec cause I wasn't gonna get it wrong, is durability. Now with the Z flip 4, Samsung claimed that it has a 45% tougher screen. Now we are recording this before the official announcement, but we've been given some information. Ken actually went to the event, got hands on with it. Now I don't know exactly what definition they're using for that, because when you went from the Z Flip 1 and Z Flip 5G to the 3, they did improve the screen. And it does feel better on this, - But - Great, great, no, no. - 45% of nothing is still nothing. When companies are like, oh, it's 45% axis, 10%, whatever, I always take that with a grain salt, because one, you have no idea what they're actually basing that off of. - Can I give you a part of my therapy session? A little bit of a history of my Z Flip screen issues? Keep in mind, we're over two and a half years into me daily driving the Z Flip. I had my first Z Flip, the very first one, which was the one that probably had the worst screen. And yet I actually never had a problem with the screen on that. Largely because, a little while afterward they update with a 5G model. So I did switch over to that, and I ended up using that one for a little longer. I would say maybe eight months into the life cycle of Z Flip 5G, I did start to have a crack along the- - That's not even the whole story. The 5G came with a screen protector on it. That was their way of saying we're gonna improve the durability of the screen before us. - That's right - They had a pre installed screen protector - It bubbled up. - And that didn't- - The entire like crease, the screen protector bubbled up. So I peeled the screen protector off. It was fine for a while, but now fast forward to today where the Z flip 3. Now this phone is just under a year old. I got it I think August or September of last year. And I am on screen number two and a half. I was actually starting to have some intermittent screen flickering issues with this phone. I ended up sending it into Samsung, who I will give them full credit were terrific with service. I got straight on the phone with someone, I shipped it into them, and I think inside of a week, I had my Z flip 3 returned to me with a brand new screen. And then two days ago, look at my crease right there. - Like just looking at an angle, I can see the crease along here- - Which the crease is fine- - Crease is one thing. - That's okay. That's part of the design. - But the bubbling... - My screen/screen protector has started to bubble, and keep in mind that this is a replacement screen that I have been using for, I would say a month? Maybe not quite a month, but it's very, very new. Samsung just put a brand new screen on this. - I mean, this bubble's so big I could fit a fit a 1996 Ford Focus on this. - Literally since last night, that's about twice as big as it was. - Every time that that snags on something in your pocket or whatever, it's gonna get exponentially worse. - Oh, you know what, actually maybe realizing it's even worse than I thought. For no reason whatsoever, I'm gonna pull out and get some footage of this right now. - I wanna make it clear. I'm not shitting on Z Flip and Z Fold. I love the idea of folding phones. I love the idea of this new technology. However, there's so many problems with it that have happened from you, who's the biggest proponent of this. - No one else on the planet Earth has used the Z Flip as much as me. - I actually think that that's a somewhat real statement. - I've owned every Z Flip, I've used them every single day short of when this was in for service, and when I was trying to fiddle with it, I did use an S22 for a little bit. - I wanna catch fans up. Cause we've been talking, like we said, we've been talking about these foldables for a couple years now. And the first thing we said was all right, how do these get how do these become mainstream? Samsung has made good strides for that. I wanna give credit where credits due. - It has. It has. - It was like what? 1500, 1400, $1500 when they first came out? - Yeah. So the Z Flip 1 and the Z Flip 5G were both 14, $1500. And that's part of the reason why I think with the Z Flip 4 specifically, it looks almost the exact same, but I don't think that's necessarily a bad thing because the Z Flip 3 was a major upgrade, hit the $1000 price point. It added water resistance. It added a much, much more usable outer display. It had a more durable design generally speaking, in addition to the- - Durable. - No, no, no. On the exterior and everything- - Like I say, like, I don't think any of that matters because you still can't get a full year out of your phone. I think you're glossing over major facts of like- Again, ignore your experience for this. - Sure. - When you send this in under warranty, yeah you pulled out another phone immediately. Imagine you're like a regular consumer which is what we're talking about for this video. We're not talking about the power user. We're not talking about someone who can afford a $2,000 phone, blah, blah, whatever. If you can't rely on your phone to last you at least a year- Remember, most people upgrade their phones every 2, 3 years. And that's just, there's no scenario where these things are lasting 2, 3 years, which makes them impossible to recommend to someone as a daily driver. I think you often have blinders on. You have two phones in your pocket. So when that one stopped working and did all your screen flickering, you're like, oh fine, I guess I'll just have to use my iPhone right now. That's not a luxury that most people have. - Absolutely. - So while that may not have been a super pain point for you that would've been a major pain point for someone where that's their only phone. So while I'm happy that Samsung keeps increasing, improving everything like that, I wanna give them credit where credits due, they've come a massive amount in the short time that they've released these these folding phones. However, the 4 is disappointing to me in the sense of like, it's a super incremental upgrade, that's not what I'm disappointed for. That 45% durability does not instill confidence in me, because that's still not two years. - Here's the thing. - That's barely a year! - The 45%, we don't know what the 45% means. So Matt here's, here's my big question: So this started happening, this is again a one month old screen. Now the screen seems like it could be okay underneath, but I really can't tell. So live on camera, it's a one time deal. I'm never gonna be able to undo this again. I'm gonna actually try to peel off the screen protector and see if this is just the screen protector starting to bubble up or whether I actually have a real issue with my screen. - Mark, my words after this, you're gonna peel this off, and then a month later, you're gonna have a TikTok saying: \"I pressed a little too hard on my tweet button, now I have a nail print in my screen.\" - Can you film this live? I just wanna make sure that everyone can see. Can you just get that? Okay. I'm gonna peel it off live, okay? So I'm gonna do it in one shot. Either I'm about to ruin my Z Flip 3 or I'm about to peel off the screen protector and it's fine underneath. And I am actually immediately having problems even getting it started. So far, I've actually not damaged the screen it looks like. All right, we are officially removing screen protector. I'm just gonna say so far so good. As I come up to the crease its gonna decide whether or not I have ruined the screen or not. Ready? Here we come. Here it comes. Here it comes. And... It's the screen protector. Wait, let me take a close look. I think it's just the screen protector. It's gonna be kind of hard to see that, maybe on the macro mode, you can see the screen protector has actually just warped. No, I fixed it, Matt. It's safe now. - But this is what was protecting the folding screen. I think you're gonna start leaving marks on that thing. That's why I don't like the argument of I fixed it by taking off the screen protector. It's on there for a reason. - To Samsung's slight credit, I do believe they will actually reapply a screen protector at least once for you if you go into a store. I think the correct move for longevity would be to immediately- Or actually, I shouldn't have done that myself. I should actually gone to a store and had them remove and replace the screen protector. That being said, the way that was bubbling up I was legitimately fairly sure that it was the screen, not just the screen protector. - What have we learned today? Austin- - The Z Flip journey continues. - That someone has done it better. - What? Oh, good Lord, you're not- - When you talk about the functionality of a folding phone I've been a proponent of the Microsoft Surface Duo. This is definitely not without its flaws. This is the Surface Duo 2, which did fix a lot of those. Still way too expensive. This is one of my favorite devices. No person should ever buy this. This solves all these problems of the folding phone at the moment, where battery life on this is pretty great. Cause there's two batteries. We don't have to worry about creases. We don't have to worry about any of that on the inside here. I think this is what the Fold should be, and not a crease down the middle, because a lot of the benefits of the crease, like, yeah, this year, it's not one screen, but most people who are using this thing, aren't probably watching media with full screen. The multitasking is what's actually the benefit of these folding devices. So if you can't get a screen that is not gonna be destroyed by itself within a year. If the technology's there. This is a better design. - And it's smaller. - I'm not gonna argue with that. - That's that's my big thing. - I just don't think that is ready. And I think they pushed it out too fast, too soon. And then the product is dead, dead on arrival because they pushed it out too fast. And I think that that's what Samsung is dangerously close to doing. I think they're dangerously close to ruining all foldables in the future because everyone's gonna get the stigma of, those things last only for about five minutes. - The only way to find out is for me to keep using the Z Flip. So subscribe for Austin's video in a year where I've found the Z Flip 4 fatal flaw or I do an update saying, \"Hey, everything's great, everything's fine, the water's warm jump right in.\" But make sure that you do subscribe and ring-a-ling the ding-a-ling bell 'cause otherwise Matt is gonna throw me out the window if we have to do another foldable video and he does not get to talk about the Duo. - I look forward to your TikTok in a month saying you scratched your screen.",
    "transcript_keywords": [
        "Flip",
        "screen",
        "screen protector",
        "protector",
        "Flip screen issues",
        "Flip screen",
        "phone",
        "Samsung",
        "year",
        "years",
        "crease",
        "Matt",
        "thing",
        "battery life",
        "camera",
        "life",
        "battery",
        "good",
        "folding",
        "phones"
    ],
    "transcript_entity_values": [
        "Ford",
        "Flip",
        "hours",
        "the last two and a half years",
        "1996",
        "a couple extra hours",
        "1500",
        "the Galaxy S10e",
        "one",
        "third",
        "a couple years",
        "a month",
        "33",
        "Earth",
        "three",
        "one month old",
        "14",
        "10%",
        "today",
        "the Surface Duo 2",
        "Fold",
        "eight months",
        "1500",
        "1400",
        "2",
        "5",
        "last night",
        "3 years",
        "Matt",
        "two years",
        "37 hundred milliamp-hours",
        "Z Flip 5",
        "the Z Fold 4",
        "a year",
        "daily",
        "3",
        "Austin",
        "Samsung",
        "two days ago",
        "at least a year-",
        "1000",
        "a full year",
        "two",
        "2,000",
        "Z Flip",
        "about five minutes",
        "two and a half years",
        "every single day",
        "4",
        "this year",
        "TikTok",
        "the Microsoft Surface Duo",
        "12 day",
        "first",
        "Ken",
        "iPhone",
        "Snapdragon 8",
        "a month later",
        "45%",
        "August",
        "the last three years",
        "September of last year",
        "2022"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "LOC",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "MONEY",
        "PRODUCT",
        "TIME",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "ORDINAL",
        "PERSON",
        "ORG",
        "LAW",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "DATE",
        "DATE"
    ]
}