{
    "id": "HxxzdWsvwV0",
    "title": "Apple’s Secret 2006 Fail",
    "channel": "Snazzy Labs",
    "channel_id": "UCO2x-p9gg9TLKneXlibGR7w",
    "subscriber_count": 1170000,
    "upload_date": "2021-07-15T13:00:16Z",
    "video_url": "https://www.youtube.com/watch?v=HxxzdWsvwV0",
    "category": "Science & Technology",
    "tags": [
        "snazzy labs",
        "quinn nelson",
        "snazzyq",
        "ipod hifi",
        "ipod hi-fi",
        "homepod",
        "homepod pro",
        "homepod max",
        "homepod studio",
        "airpods pro",
        "airpods max",
        "homepod mini",
        "homekit",
        "hey siri",
        "siri",
        "hifi",
        "fidelity",
        "resolution",
        "$350",
        "speaker",
        "apple fail",
        "apple failures",
        "worst apple products"
    ],
    "views": 667908,
    "likes": 19969,
    "comments_count": 1394,
    "description": "The HomePod failed spectacularlywith just 5 million units sold. But that wasn't the first $350 speaker Apple released on deaf ears. Check out the Roborock H7 on Amazon -  Official Website:   Get AirPods Max -  Get AirPods Pro -   Subscribe to my podcast Flashback! -  Follow Snazzy Labs on Twitter -  Follow me on Instagram -   It's pretty rare that Apple releases a product to market nowadays that doesn't perform well. Even niche products sell in the tens of millions; however, the HomePod released in 2017 is estimated to have sold around just 5 million units during its product life cycle. The product is discontinueddeadbut still continues to get new updates with iOS 15. Why? Is Apple doing something behind the curtain that we just can't see? Today, we take a look at Apple's other failed hi-fi speakerone that launched over 15 years ago at the exact same $349 price point. Why do they keep screwing these speaker systems up? What might they be planning for the future? Have they given up and settled on HomePod mini? I don't think so...  #retro #apple #roborock #roborockh7 #cordlessvacuum",
    "description_links": [
        "https://cli.fm/RoborockH7-SnazzyLabs-YT",
        "https://cli.fm/RoborockH7-SnazzyLabs-Official",
        "https://amzn.to/2UH9PJf",
        "https://amzn.to/3i9UCIR",
        "http://relay.fm/flashback",
        "http://twitter.com/snazzyq",
        "http://instagram.com/snazzyq"
    ],
    "transcript": "So check this out I got this on Facebook Marketplace for $15 (with an iPod)! What is this? In February of 2006, Steve Jobs held a press conference at Apples Town Hall theater to announce a new dual-core Mac mini but more importantlyperhaps less importantlythis: the iPod Hi-Fi Look, by 2006, to say that the iPod was absolutely dominating the portable MP3 player industry would be an understatementat the beginning of 2006, Apple had over 78% marketshare. And with the overwhelmingly popular iPod, came the billion dollar accessory market. Apple didnt mind this industry existing as they charged a 10% tax for MFi or Made for iPod certification which was required for accessory makers to advertise iPod compatibility in retail locations. An increasingly popular accessory was the iHome and its derivatesa dock for your iPod to charge it and playback music through a built-in speaker. These never really sounded very good, but they were affordable and often integrated secondary features like alarm clock functions. Jobs called these products out on stage saying that they served the purpose of playing music in the home but they fell short of in his words, home stereo quality. This video is brought to you by the Roborock H7, and excellent new handheld vacuum at just 3.2 lbs thats easy to maneuver, transport, and operate. With an ergonomically designed handle, you can clean for up to 90 minutes thanks to a sizable LiPO battery. With up to 160W of suction, youll be easily lifting dirt and reaching deep into carpets with the powered surface brush that features an auto-carpet boost mode. The awesome throttle lock button now doubles as a child lock to ensure the vacuum isnt used by those that shouldnt. The H7 features a larger dustbin with the same awesome 5-stage filtration with HEPA support but now also supports optional bags! This is ideal for allergy suffers or anyone wanting effortless dust disposal. When its time to charge, you can fill from 0-100% in just 2.5 hours and the awesome MagBase allows you to store the many included accessories effortlessly while charging and storing. The H7 is a vacuum you dont want to misspick it up today with the link below. Steve Jobs: You know, what what is home stereo quality you could ask? Well, if youre an audiophile what youd say is four things: (1) if you close your eyes, theres a soundstage around the speakers. You don- the speakers disappear acoustically and theres like a stage around the speakers where you can hear the performers performing thats much larger than the speakers, right? So, a large soundstage. The second thing, maybe the most important in some ways is precise imaging and separation. Each instrument can be placed in space individually. Right? Each instrument you can imagine where it is in that sound stage. Theyre not all muddled together, right? Theyre separate, theyre clear, and you can almost ima- you can almost see where they are if you close your eyes in that soundstage. The third things is a wide frequency range. You know, you want to be able to have great bass but you also want to be able to hear you know, the highest frequencies as well. And lastly, you do want room-filling sound, but without distortion. The product they believed worthy of home stereo audio quality was thisthe iPod Hi-Fi. Up top, it has a 30 pin dock connector to fit your iPod and while mine are missing (I bought this used, afterall), it came with 10 snap-in cradles to fit your specific Pod model and then theres two touch-sensitive volume up and down buttons. Now, around back was a detachable power cable that is 10 feet long, a 3.5mm auxiliary input that accepted both analog and digital Toslink cables, and then there was a door wherein you could put 6 D-cell batteries to power the iPod Hi-Fi on the goboombox style. Okay, here we go Gosh! lol The batteries would last 5-15 hours of playtime but would continually drain in standby since there was no power switchsound familiar? Oh! What are these doing here.? I want to talk about this in detail but not before I clean it up because its disgusting. Powering the system are two 80mm mid-range drivers and a 130mm dual voice coil woofer with a bunch of bass porting. This thing has no screw holes in sighttheyre hidden under this aluminum front plate thats glued into place and while you might say ah, ha, ha, classic Apple, airtight design in speaker cabinets is pretty important. Steve Jobs: And again to make great sound, youve gotta have a sealed enclosure that doesnt vibrate. This is a sealed resin enclosure and its really, really good. This sealed resin chamber is a double-hulled polycarbonate ABS with a honeycomb interior to defeat resonance and the mid-range drivers are in their own sealed acoustic chambers as well. There are a lot of Apple-istic attention to details. And the front grille doesnt buzz either since the pins are spring-loaded which is ridiculously clever. Ive seen loudspeakers many times the price of these things where at certain frequencies youll get a slight vibration (from the grill). Doesnt. Happen. Here. Clever. I dont want to fanboy about it too much but this thing is gorgeous Theres no sign of draftingtheres no seams, the built in handles are actually perfect with a radius just wide enough still look good without them feeling uncomfortable, and a single green LED radiates through the fabric grille. The battery cover is insanely thickprobably so that it wouldnt warpbut it feels stupidly over-engineered. So, I guess the big question is, uh, how does it sound? Lets find out. Okay, so hm this thing *can* sound good; however, it's very picky. The whole idea with Apple's more modern hi-fi venture, the HomePod, is that it was omnidirectionalsound emitted from everywhere. The iPod Hi-Fi is *not* that and like a more traditional audiophile loudspeaker, it has a sweet spot and the iPod Hi-Fis is quite stingy. In my experience, it's from about 10-12 feet away with the speaker facing you head on at eye level. If you're too close, the mids and trebles completely wash out and it sounds like your body is inside a subwoofer. If you're too far away, the speaker sounds too thin. You gotta be right... here. When you're in this sweet spot, it still sounds too bassy for my liking but it's pretty tight and the ports move an insane amount of air. Mids are very suppressed and trebles sound okay when not washed out by the low-end. Its basically a pair of Beats by Dre but in a speaker. Jobs said audiophiles looked for 4 thingsremember? A wide sound stage, precise imaging, a wide frequency range, and room-filling power without distortion. The HomePod really only fulfills the last one. Don't get me wrong, it's not a bad speakerthere are a number of tracks like Kanye West's Heartless and The Internet's Stay the Night that were standouts. In fact think in *most* (but not all) tracks, it sounds better than the HomePod. Despite all of the cool computational audio happening in HomePod, a lot of what makes something sound good comes down to displacement and the iPod Hi-Fi has the definite advantage. A fun aside, when you plug the iPod in, a Speakers tab in the main menu pops up that lets you change the EQ and backlight settings. This the fat Nano that came out in September 2007 after the iPod Hi-Fi was discontinued (spoilers) and weirdly didnt ship with a feature demoed at the press event which I thought was kinda cool: the iPod would display the album art full-screen. Anyways, it failedas did the HomePod. Why, is the question The obvious answer is that they were too expensive, but I think the opposite: they were too cheap. Apple has evolved into a luxury brand and a lot of consumers will spend insane amount of money on their productsif theres hype. If theyre good. AirPods Max? These headphones are $550thats insane when compared to the competition. But, theyre good. Great, even. The HomePod and the iPod Hi-Fi were not great. They were fine. And unfortunately, fine wasnt going to get the audiophiles raving about how amazing they were. iPod HiFi had near universal negative reception amongst the audiophile crowd and the HomePod wasnt much bettersee my old review if you havent already. Apple made the exact same $349 mistake twice. I think we can tell with the HomePod mini outselling the HomePods lifetime sales after mere weeks that most people just want a cheap iHome-esque speakerit doesnt need to sound good. However, I think there *is* a market for a really high-end speaker system and it doesn't need to cost thousands of dollars, but the've demonstrated they can't do it for $349. Here begins my hope for a HomePod Studioa vengeful successor to Apple's failed speakers of yore.",
    "transcript_keywords": [
        "Facebook Marketplace",
        "iPod HiFi",
        "Apples Town Hall",
        "iPod",
        "Town Hall theater",
        "sound",
        "HiFi",
        "HomePod",
        "Town Hall",
        "Apple",
        "Steve Jobs",
        "sound good",
        "good",
        "speaker",
        "speakers",
        "Jobs",
        "Apples Town",
        "Facebook",
        "Marketplace",
        "sounds"
    ],
    "transcript_entity_values": [
        "iPod Hi-Fi Look",
        "5-15 hours",
        "MagBase",
        "Kanye West's",
        "third",
        "HomePod Studioa",
        "EQ",
        "thousands of dollars",
        "10 feet",
        "1",
        "mere weeks",
        "30",
        "Facebook Marketplace",
        "10%",
        "two",
        "Apple",
        "78%",
        "iPod Hi-Fis",
        "15",
        "just 2.5 hours",
        "about 10-12 feet",
        "Apples Town Hall",
        "iPod",
        "6",
        "Nano",
        "2006",
        "the beginning of 2006",
        "LiPO",
        "HEPA",
        "3.5mm",
        "iPod HiFi",
        "Mac",
        "today",
        "HomePod",
        "Dre",
        "349",
        "up to 90 minutes",
        "February of 2006",
        "iPod Hi-Fi",
        "four",
        "0-100%",
        "4",
        "Speakers",
        "Steve Jobs",
        "10",
        "iHome",
        "5",
        "H7",
        "two 80mm",
        "the Roborock H7",
        "AirPods Max",
        "550thats",
        "second",
        "billion dollar",
        "just 3.2 lbs",
        "130mm",
        "Toslink",
        "September 2007",
        "160W"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "TIME",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "PRODUCT",
        "MONEY",
        "TIME",
        "CARDINAL",
        "FAC",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "MONEY",
        "TIME",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "PRODUCT",
        "PRODUCT",
        "MONEY",
        "ORDINAL",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "CARDINAL"
    ]
}