{
    "id": "hyT7EupLAhQ",
    "title": "Leica’s $9,195 M11 Monochrom camera lives in a gray area of expensive minimalism #shorts",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-04-13T15:34:09Z",
    "video_url": "https://www.youtube.com/watch?v=hyT7EupLAhQ",
    "category": "Science & Technology",
    "tags": [
        "camera",
        "photography",
        "leica",
        "monochrome",
        "black and white",
        "gadgets",
        "tech",
        "leica m11 monochrom"
    ],
    "views": 55161,
    "likes": 1523,
    "comments_count": 60,
    "description": "The latest black-and-white-only camera from Leica gets the 60-megapixel sensor of the M11 and some incremental feature improvements. Plus, a new close-focusing fast-50mm lens is launching in tandem.  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "It's easy to fall in love with the Leica M11 Monochrom. It's classic. It's lovely. It's dramatic. The latest M rangefinder camera takes the guts of the M11, removes the color filter from its full frame sensor, blacks out the design, and offers a few upgrades like a crystal sapphire LCD cover instead of gorrilla glass. And Leica charges more for less here. What you're paying for are some technical advantages like increased sharpness and better low light performance, and ultimately, vibes. You gotta really love black and white photography to own this camera. You have to also part ways with a ton of money, as this one will cost you over $9,000. You're paying top dollar for the luxury of thinking in black and white, when frankly any camera can be turned to black and white mode. It's not exactly the same though, because shooting the Monochrom is just as much about the experience as it is the results. But this camera is Leica in a nutshell. They are not logical purchases, especially when you consider what other cameras offer at a fraction of the price. But this freaking guy right here can really tug at your heartstrings. Just those heartstrings gotta be attached to a fat wallet.",
    "transcript_keywords": [
        "easy to fall",
        "Leica",
        "camera",
        "black and white",
        "black",
        "white",
        "Monochrom",
        "easy",
        "fall",
        "fall in love",
        "Leica charges",
        "love",
        "sapphire LCD",
        "LCD cover",
        "paying",
        "crystal sapphire LCD",
        "sapphire LCD cover",
        "love black",
        "heartstrings",
        "LCD"
    ],
    "transcript_entity_values": [
        "LCD",
        "Monochrom",
        "over $9,000",
        "Leica",
        "Leica",
        "M11",
        "the Leica M11 Monochrom",
        "a ton"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "MONEY",
        "ORG",
        "FAC",
        "PRODUCT",
        "FAC",
        "QUANTITY"
    ]
}