{
    "id": "hYymRU-bfpQ",
    "title": "Linda Yaccarino defends Elon Musk, X, and herself at Code 2023 [FULL INTERVIEW]",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2023-09-29T00:09:18Z",
    "video_url": "https://www.youtube.com/watch?v=hYymRU-bfpQ",
    "category": "Science & Technology",
    "tags": [
        "linda yaccarino",
        "elon musk",
        "twitter",
        "code confernce",
        "code 2023",
        "code conference linda yaccarino",
        "code conference 2023 linda yaccarino",
        "new twitter ceo",
        "elon musk twitter",
        "twitter ceo",
        "twitter elon musk",
        "elon musk twitter ceo",
        "elon musk linda yaccarino twitter",
        "linda yaccarino twitter ceo",
        "business news",
        "linda yaccarino elon musk",
        "social media",
        "kara swisher",
        "julia boorstin",
        "tech",
        "the verge"
    ],
    "views": 359604,
    "likes": 2211,
    "comments_count": 1744,
    "description": "One of the most captivating moments of the Code 2023 conference was when Linda Yaccarino, current CEO of X, took the stage just an hour after Yoel Roth, former Head of Trust and Safety at Twitter appeared as a surprise guest opposite Kara Swisher. He spoke about death threats, Xs current engagement, and said Yaccarino should be worried. Yaccarino used part of her own interview to respond. #Twitter #Technology #Code2023   Read more:   0:00 Intro 0:26 Response to Yoel Roth's interview  7:30 Is engagement on X/Twitter declining?  12:05 Daily users and profitability 17:35 Elon's X/Twitter subscription plan  20:14 Linda Yaccarino's role at X/Twitter  23:00 Elon Musk biography by Walter Isaacson 25:52 Response to Elon threatening to sue Anti-Defamation League 33:51 Trust and safety  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://bit.ly/3LEqpBb",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "- Please welcome Linda Yaccarino. (audience cheers) - Where am I going? - I think this way, yeah, for our microphones. Linda, thank you for being here. Before we dive in, I have so much to cover. I probably have hours worth of questions, but I wanna make sure to get, to give you an opportunity to respond to Yoel Roth, and his comments about an hour ago. - Chuckles, chuckling. - Just for full context. You joined Twitter in June, and Yoel did leave long before you got there. He was at Twitter for about five weeks after Elon Musk took over the platform. So, you did not overlap, but he's describing, you know, terrible things that happened to him, and also his experience at a company that months later you have come to run. I wanna give you an opportunity to respond to him. - I'd be happy to respond. I think I've been given about 45 minutes. - Yes, and also, full disclosure, as many of you saw, he was a very late addition to the schedule, a surprise, both to me and Linda, that he was added here. So, not something that either of us were fully prepared for. - I think many people in this room were not fully prepared for me to still come out on the stage. (audience cheers) But, here we are. So, thank you for asking the question. And, Julia's right, we have known each other for a very long time, and have had a very long, deep, strong relationship. So, when situations like this happen unexpectedly, maybe they were unexpected. We stay strong together. So, we're gonna move on. But, I do wanna address, Yoel and I don't know each other. He doesn't know me, I don't know him. I work at X. He worked at Twitter. X is a new company, building a foundation based on free expression and freedom of speech. Twitter, at the time, was operating on a different sets of rules, as said by himself, different philosophies and ideologies that were creeping down the road of censorship. It's a new day at X and I'll leave it at that. (audience claps) - When asked what his advice to you was, Kara asked him what his advice to you was, and he made a comment about the death threats, or the threats to his physical self that both you and he have experienced, and him wanting to make sure that you were taking any protections or precautions on the platform seriously. - The team at Twitter is fantastic. If you're talking about my own personal wellbeing, and safety, I feel great. I'm well protected. What I, he made a comment about the FT interview, I guess as he was preparing to come on the stage that the public scrutiny weighs heavy on me, my kids, my family, my parents. I think that's just a human emotion when you get thrust into such a public spotlight, in conjunction with the nature of the platform itself, when you're automatically a recognizable public feature, public person, 24/7, globally. And, with the ability for, or the inability for anyone to control other humans actions, comments, recognizable. And, I'm an identical twin, think how she feels. (all laugh) I actually made the security team a dollar bet, 'cause I only ever bet a dollar, by the way, because the reason I only bet a dollar ever is because it's really only about winning, right? So, I told them I had a security concern and I bet that they had never been confronted with it. And they're like, \"there's no way. We've seen it all.\" Said, \"what are you gonna do for my identical twin?\" (audience laughs) So, I won the dollar. But, to get back to the serious, serious situation, I appreciate Yoel's comments. And I, you know, again, we don't know each other. I assume they were authentic. But, that is something that all public feature, public people, and a lot of times CEOs have to confront because of the public nature of their position, compromise in security. So, again, some people, some other people, CEO friends of mine, peers, have reached out to me. I said, \"Reach out to me if there's anything I could do to help you on the platform.\" But, according to Yoel's words, himself, they were platform wide. He wasn't specifically saying it was just coming from X. So, I wanna be clear about that. - We did Google, and did see that there were threats to him that were still up there. That was really the one surprising thing to me. And, it does seem like that is in violation of the policies of X, Twitter. - I'd be, if he'd reach out to me directly, I'd be happy to. If in fact those comments are true, I would be happy to help him out, as I would be happy to help anyone in this room, or anyone who's listening. But, I also want to take a moment, and again, I hope we can get to pivot. - Yeah, I wanna talk about that. - And to talk about all the momentum that's going on at X, but I wanna, it's very hard for me to refute, or sift through, the combination of opinions of Yoel's experience, and the positioned-as-fact that were presented. Because, again, let's rewind. Yoel was there for five weeks post acquisition. One of the things he talked about, which was so surprising, is that 75% decline in content posted to X. That, in fact, is not true, and is inaccurate. And, there are many days, weeks, months, where there's actually more content posted to X. And, that is in spite of our aggressive efforts to fight spam and bots. So, think about that net of our aggressive efforts that uniquely started happening at X that other platforms have followed suit. - Okay. - Content posting up. So, that's one thing. - But, but Linda, because I wanna shift gears from Yoel's interview to a conversation about the business. - Yoel had 25 minutes to talk about it. - You have a lot longer if you want, you have all the time that you have for us. I wanna talk to you about the business, in that, and the issues of engagement, because I see a lot of data as a reporter at CNBC, and Apptopia, which tracks app usage, says the actual time spent on Twitter, did get a post Elon bump after that acquisition, but has tracked down all year since then. A new report out from Apptopia just this month, says app downloads have sunk to new lows. It's in 96th place. And, when it comes to usage, X is now 25th in active users behind Telegram, and even Samsung Clock. So, how can we reconcile what Musk has said about engagement, the numbers you just cited, with all of these different data points here? - Well, you know, with over 540 million global users, the, I'd love to sift through, you know, the data points that you picked out. - And, they're really just tracks of app downloads. - Yeah. - And engagement. - Yeah, but when you look at the length of time spent, the engagement on X right now, the key metrics are trending very, very positively. So, if we wanna talk about all the initiatives that have been put in place, like was covered in the previous interview about all the brand safety and content moderation tools that exist now within my first a hundred days at the company that didn't exist for the eight years prior, formerly known as Twitter. I think those are the type of things we could be, we should be focusing on in terms of progress that has been made. Because, in the just short, hundred days-ish that I've been at the company, what had to happen was for me to, you know, kind of, get in look under the hood. And, when I realized, and I looked at, because it's still a lot of learning. I mean, come on, it's a hundred days. There's a lot of learning that's still gonna go on. But, the velocity of change, the scope of the ambition at X, really does not exist anywhere else. Forget the other platforms, at any other company likely on Earth, there is no analog for the book that is being written right now. So, if you look at infrastructure changes, over a hundred products shipped since acquisition, brand safety and content moderation tools that didn't exist, advertiser products that did not exist, that are now wrapped up in brand safety, third party verification partners that did not exist. The company that was described about an hour ago, no longer exists. And, I would argue pretty aggressively, no matter if you want to, I don't know the stat. Did you say Telegram? Does anyone say telegram? - No, you're behind Telegram. - No, no, I know. I have to, I have to scrub your numbers. But, that being said, that when you put in context what has happened in the last 10 months, and specifically the last 12 weeks of listening to our employees, listening to our customers, those advertising customers that you reference, that I was given such great advice, that I could prove from a data-driven standpoint, and they'll come back. The great news is another fact that was inaccurate. In June, actually, I did an interview with one of your colleagues at CNBC, Sarah Eisen, and. - I think in August. - Was that August? - It was a hundred days, yeah. - Oh yeah. I started in June. It's all a blur. Yeah, because, again, the pace of innovation is unlike anything you could ever imagine. Think about it, it's exhilarating to the point of intoxicating. That's why when you get inspired and pushed by Elon Musk to do the things that you would never normally think were possible, you land on a day like today, you show up, you tell them the mountain high of accomplishments that were made in just 12 weeks, and you don't look back and compare yourself to a legacy company that doesn't exist anymore. - But, so Linda, I wanna get some of these stats. So you mentioned you're. - It's been a day, so I brought my card. - You're welcome to. I have my cards. - I was supposed to put an X on it, but I was watching the interview, and I didn't have time. - Okay. So, one question I have is, what are the daily active users that you have, because that is the metric that Twitter was using before Elon Musk came over, and you mentioned the Sarah Eisen interview. What are your daily active users? And, then also, you told Sarah you were nearing profitability. - Yeah. - How close are you? - Yeah, well that's so exciting. I'll get back to your first question. But, what's so exciting is that from an operating, cash flow perspective, we are just about break even. So, the, a kind of, other emotion that was painted in the previous talk, we feel pretty good about where we are. And, when I did the other talk that you said was in August, it was too soon. I think it was about five or six week in, I couldn't have eyes on, even the rest of third quarter, let alone fourth quarter. So, now that I have immersed myself in the business, and we have a good set of eyes on what is predictable and what's coming, is that it looks like in early '24. - For profit? - We'll be turning a profit. So, that's exciting. I wanna get back to another stat about 75%, or I think he said 60% of advertisers had left the platform or something. - Well, that's what Elon Musk said. - No, he said 60% of advertising revenue. He didn't say advertisers. But, again, another point of distinction when you're talking about months and months old information. So, 90% of the top 100 advertisers have returned to the platform. In the last 12 weeks alone, about 1500 have returned. So, whether it is small business, or big brands, right? Like AT&T, VISA, Nissan, all returning. Why are they returning? They are returning because of the power and significance of the platform, the place that X has in this world. Why? - So, do you have a stat on daily active users? - Yeah, I'm going to. - Okay. - Probably, it, 200-250, something like that. - Okay, so the stat one must took over. - Did Joe leave his fax? - No, this was when Musk took over. There were 237 million monetizable daily active users. - Yeah. So, listen to this. One of the reasons that I'm in the chair I'm in today, and in the chair I am at X, leading the company, is because I knew for the last decade, and you knew this, part of my old remit was to oversee not only the advertising revenue for the company, but to look after all of our enterprise relationships. Our, I still say \"our,\" the, all of the NBC enterprise relationships. And, Twitter was one of them. I specifically use the name Twitter, by the way, purposefully. And, that's when, for 10 years, and how, I fell in love with the platform, because I knew, first of all, we all knew the trajectory of where broadcast cable television, and usage, and consumption was growing, going. But, this powered by, now, X was the only mechanism that could take the premium content business, live global events, news. When you, when I used to sit in my office and watch you on television, it was the only thing that could put you live, in culture, where it happens, in the moment. So, the users of X, our community of ferociously loyal user base shows up. You, everyone who's in marketing in this room, what you wanna get to is that you're a habit. It's habitual that you're checking this. FOMO, morning, noon, and night. - I'm guilty. - And, do you have any new engagement numbers you could share with us? 'Cause those stats from Apptopia, other sources show a decline. - What sources were they? - It was Apptopia, and I have the whole, the list here. Some, the whatever source I just cited, but. - Well, I'd love to. - But, we could go. - I'll give you, almost like, a more personal, specific number which demonstrates part of the growth at X. If you take our communities, 50,000 curated environments and conversations of communities on X, okay? The engagement numbers and time spent is up dramatically just since June. - [F] Okay. - Right? So, hold on. I wanna. - No, Linda. We're running short on time, so I gotta get, we have so much to cover here, so. - Okay. Where do you want to go? - Okay. I wanna talk about your role running the company. - [Linda] Okay. - And, Elon Musk just announced a new monthly fee for users. - Yep. - And, my question for you is, do you wanna start charging all users of X, as he said, and how many users do you think you'll lose as a result? - Can you repeat. - Elon Musk announced you're moving to an entirely subscription based service. - Yeah. - Nothing free about using X. Do you? - Did he say we were moving to it specifically, or is thinking about it? - He said that's the plan. - Yeah? - So, did he consult you before he announced that. - We talk about everything. - Did you, your background is in advertising. I would be surprised if he wanted to get rid of. - Of course, - Get rid of a free version. - Why wouldn't we? - To not, to have no free version of X. - Okay, so, do you think Elon brought me to the company to be the head of advertising, which I appreciate Kara's comments that said I'm such a fantastic advertising executive. Or do you think he brought me to run the company and to deliver to our users the best possible experience? And, one of the biggest struggles I had in my previous career at the other companies I worked for was I was known as a provocateur. I was called a heretic a couple of times because I constantly tried to push legacy media companies to change, to iterate, to innovate. Why did I do that? I did that to keep up with consumer behavior, and X will become the best, most useful platform to what the consumers want. You gotta admit, it's not boring. It's one of the funniest places on Earth. And, when you think about how users are able to communicate to now watch video, soon to be able to transact, that is a whole experience where there is no surrogate today. There is no surrogate for X. - But. - So, hang on, hang on. So, it's continually, you know, I could sit here and use the, answer your questions about 540 monthly active users, 225 daily active users. But, I'm not sure you are even asking me the right questions because we're so caught up constantly in the noise or the post of the moment. And, what's going on under our nose is a platform in transformation, where there is no surrogate. - But, so then talk to me about this comment that Elon Musk made just a week ago, saying he wanted to make it all subscription to fight the army of bots. And, when I heard that news, I thought two things. Number one, I would be surprised if you, whose background is in free ad supported content on all the programs. - I think my background is being a very senior executive, - It's a Senior Executive, but I would be surprised if you didn't wanna have some free version of X. And, I'm curious if you agree or if you think it all should be subscription based. And, my question for you was, the two things I thought was, I would be curious to know if you thought that was a good plan. And, second, how much he consulted you. Because, yes, you were brought in as CEO, that is your title, but you don't cover product. - Right. - All of the product teams. - Right. - Report to Elon Musk. And, as a result of that, there's been a lot of. - Anyone in this room. - Can I finish, please? Wait, Linda. - Sure. - Lemme finish, please. - Sure, sure, sure, sure. - As a result of the fact that the product team does not report to you. - Yeah. - The product team at Meta reports to Mark Zuckerberg. Because the product team does not report to you, there has been speculation that you are more of a COO role or a CINO role, a CEO in name only. - You know what's funny is that we talk about that a lot at X. As you know, it's a very flat organization, and the teams are very empowered to perform at their highest levels. So, I'm not sure what your definition of, or how you wanna, kind of, wiggle me into an answer of, are you really just a COO, or a, I don't know? - CINO, COO in name only. - Oh, C-O, oh oh, okay. Yeah. Isn't that nice? But, that being said, that being said, I think what Elon and I talk about a lot, number one always starts with the user experience, and that has to be primary. But, I want to go back to your, he runs product, he runs technology, he leads a team of exceptionally talented engineers. And, who's kidding who, I don't care what the structure is at Meta, but who wouldn't want Elon Musk sitting by their side running product? (audience laughs) - I see a show of hands. - I, there may be a few show of hands to get the cute chuckles you're getting, but I would say the percentages in this room are about 99% who would say no to that, and 1% of maybe personal opinion or feelings. - So, in, notably last week, Walter Isaacson came out with a book. - Did you read it? - I have not read. It's very long. I've not read it all. (Linda laughs) So, no, I've not read it. - Watch his interview on CSPAN, sorry for the competitive network, but his interview, he was interviewed on CSPAN. I thought it was excellent. - I have read many excerpts. I've, I mean, it's a very long book for those of you have read it. In this book, and interviews that Musk has done and his tweets, Musk comes off as I will say mercurial. I think that is a fair description of him. And, Walter Isaacson describes him as having a, quote, demon mode. When was the last time you saw the demon mode and how's it like to work with someone who has that? - I've been there 12 weeks. I am still somewhat in awe of his availability to me. So, the moments where you think we don't talk, we talk, his unbelievable availability. It's stunning. I've never experienced any of that. He's been consistently and completely supportive of me. Now, this also is not my first rodeo. I've had, I've reported to a lot of CEOs. You go through highs and lows because you have differences of opinions and you have a different scope of experiences. But, one thing Elon always talks about, or actually the whole teams talk about is the feedback loop that exists. Just think about the nature of the platform. I mean the feedback loop is incredible. And, also, we always talk about the value of that negative feedback loop. So, the opportunity to state an opinion based on your scope of experiences and point of view, is always encouraged. If you don't have that push and pull, when does the innovation happen? When do you, when you question what used to exist, or you question the challenge that lies ahead, if you don't debate and there's not a friction there, how does the next happen? I mean, if the car industry wasn't questioned, would we have the electronic car industry? I mean, I could go on and on about the list of accomplishments, and I'm not here to go down that road, or to represent that. All I'm saying is that the idea of the inability to have a debate or feedback, I haven't experienced, or I'll say I haven't experienced it yet. 'cause you all go through different turns in your relationship, and, you know, all good 12 weeks in. I wish that we could have spent more time talking about the scope of accomplishments. - Can we talk more? I'd love to talk to you about the media business that you're building. I know that it says we're out of time, but if you're okay to keep going, I would like to keep going. - I'll wait till they come give me the hook. - Well, they're not gonna give you the hook, Linda. - I have hours more of questions here. I know you have places to be, but I would like to keep going. And, I think specifically, when it comes to why you are at X, I know it is to rebuild the relationship with advertisers. And, I know I would be remiss not to ask about the ADL, and we've had the head of the ADL on CNBC multiple times. He reported, first he talked about how much he respected Elon Musk, once Elon took over Twitter, and more recently, he talked about how he had a great productive meeting with you. - We did. That is in fact true. - Which was followed by Elon Musk saying he was threatening to sue the ADL. - I wish that would be different. We're looking into that. - So do you. - I, let me. - I wanna be clear about the situation, okay? So, shortly after, maybe a day after the transaction and acquisition of the company, the ADL under Jonathan's leadership, came out with a letter ecosystem wide, suggesting that advertisers pause on the platform. - Well, was this the coalition of 60 civil rights groups? 'Cause there was, what I remember covering in November 2022, was 60 civil rights groups, including Color of Change, Media Matters, Free Press, and yes, the EDL, they did launch a campaign called Stop Toxic Twitter. But it was, they were releasing data. - You asked me specifically about the A D L. - Yeah. - So, the ADL has been very consistent about suggested pausing of advertisers on then Twitter, continues into X. Those were related to Elon's comments about advertisers being down so significantly. The productive conversation I had with Jonathan, and I would hope that there will be productive conversations in the future, was about the need for the ADL to acknowledge all the progress that has been made now at X. And, therein lies the moment that we're living in today. And, when Jonathan continues to question the progress as it relates to antisemitism, it is disappointing that there is not equal time given to all the progress. As a matter of fact, did you get an alert on your phone about the spaces that Elon is doing tomorrow night? - I did not, but admittedly have not been on my phone today. - Okay. Well, Elon is co-hosting, and lead participating in, a Spaces tomorrow night with, I believe, it's nine. It could have grown more very influential Jewish leaders in the world to discuss antisemitism, the current state of the impact on culture, and how X can help. - So, just. - So, I will leave you with that. - But, Linda, is this in response to the a hundred Jewish leaders, including prominent rabbis and academics. - Realizing they deserve better? You know, I don't believe so. I don't believe so. And and again, what you're referencing. Yeah, I was just made aware of it today. I think It was today. - [Julia] I think it came out yesterday. This, it. - [Julia] or Monday. - I don't believe so. As you know, last week Elon also met with Prime Minister Netanyahu. So, that in conjunction with open conversations that we have with a lot of these groups, right? So, whether it's the AJC, or the Foundation to Combat Antisemitism, we have an open, honest partnership relationship. And, if there's something that comes up that we were not perfect and we didn't catch, they DM me directly, they contact me so I could alert the trust and safety team, and we invite all of our partners to participate for the solution, to create a solution to benefit the people who are being harmed when things are negotiated in the press for headlines. So, imagine if we were able to take the conversation from a proactive, from a reactive one, when some of the damage has already been done, and enable us to be proactive as partners to focus on the real solution. And, I wish everybody would have that as their priority focus, 'cause some of these groups have moved beyond the scope, of their original mandate into activist organizations. - But, Linda, to me, the way I saw you at NBCUniversal is very conciliatory. That was part of your job. And, the way I saw you meeting with Jonathan Greenblatt and having these meetings, very conciliatory. That is your reputation. It is how I've known you. Well, I'm a nurturer and a solution provider. So, let me finish the question. The fact that days after that meeting with Jonathan Greenblatt, Elon Musk threatens to sue the ADL makes me wonder if he's working in opposition to what you're doing. And, it makes me wonder if you think that the ADL is defaming Twitter, and if it's a good idea for your partner, and your company to be threatening a lawsuit. - Well, I'll repeat what I said. The conflation of two different issues of what's going on at the ADL, which is the continuation of focusing on an advertiser ecosystem to pause at x, without acknowledging progress, is the situation. When you reference my style of being very partnership oriented, or use your word, conciliatory, is because I've built a career on partnerships, knowledge, and hard work, right? That continues at X, okay? And, I've also spent my entire career being candid, and completely transparent, ask anyone who's ever done business with me. And, sometimes that creates tough, candid conversations, but I'm always going to stand up for the truth. And, that's what you're hearing from me today, and is that this is about the truth. - And, but do you think that it is better to have these conversations, and these meetings as you're describing, or to threaten a lawsuit? Is, are there times when you wish that Elon Musk would not tweet, and would instead let you do your job? - The foundation of X is based on free expression and freedom of speech. Everyone deserves to have that opportunity to speak their opinion, no matter who they are, including Elon, including you, Julia. We can't just decide who doesn't get to post or have their opinion because we don't like it. It's actually what we talk a lot about. Free expression is only successful, freedom of speech, only successful if someone you disagree with says something you disagree with. And, on that note, I have got to run. - Can I get two more minutes with you on your trust and safety work that you've been doing? Because this is something that Yoel Roth referenced. I'd like you to get to. - Oh, yeah, I'm kind of glad you brought that up 'cause he said there was one person on the election integrity team. - Well, today there was an article out in The Information that pointed out. - [Linda] I saw it. All these people had been fired. - I think they referenced three, and that isn't entirely accurate. - [Julia] And then, Elon. - But, he also said there was only one person at the company. - But so, just to reference what Elon Musk tweeted in response to the information article, he said that \"Yes, the team that was the, Global Election Integrity Team, it was the disinformation election fraud.\" This was the team focused on that, \"must confirm that they had been fired.\" And, he said that this team had previously undermined election integrity. Over a billion people are gonna vote in 2024. It's not just in the US election, integrity is an issue all around the world. - And, it's an issue we take very seriously. And contrary to the comments that were made, there is a robust and growing team at X that is wrapping their arms around election integrity. And, it is a spectrum of skillset and discipline from operations to brand safety. And, it fights platform manipulation, disinformation, right? It captures everything that we need to protect on our platform. It's not only one person that was referenced, it's not only three people. We are, as a matter of fact, today, I added two people to the team. So, I can't, I can't argue a portion of an article that manipulates information, but I will tell you. - Are you saying the information article about the layoffs is manipulating information? - I, no, I said that it was partial information. - [Julia] So, one of the other articles today. - I don't, I, again, I think it only said three people, so it was partial information, - But, there have been. - And, I really got to go. - And. My last thing is I know there were a lot of layoffs before you came. - I'm sorry? - There were a lot of layoffs at the company before you came. - Oh my gosh. - [Julia] Dramatic layoffs. - This this goes back to the velocity of change and the scope of the ambition at X with roughly 25% of the original team. So, it does speak to maybe what was going on prior to acquisition, because as one of the biggest advocates of then-Twitter, at my old job, the biggest frustration always was the complacency, or lack of change, or new product shipment. I remember one time I called one of my contacts there and said, I got approval at NBCUniversal for resources because I really want you to build this video product for me, okay? So, it existed back then. But I get back to your question. You go from 8,000 to a little less than 1500 or whatever that percentage is, 25% of the staff, you ship a hundred product updates, the overhaul of the infrastructure updates, you have brand safety tools, content moderation tools did not exist. - But, so are you hiring in this category? - Yeah, hiring this, in this category as I said, we just hired two people to the brand safety team today. And, I have to say I just brought in a partial new leadership team that have exquisite resumes who just joined the team from really pristine backgrounds, who bring with them, not only in the network, - In the electric security or which network capital? - No, no, broadly for the company. I said leadership team. - And, it seems like some of those people are in the sort of content business, which I wish we had more time to talk about, but because. - Well, you'll be hearing some of those announcements in the next week or two. But thank you so much everyone, I gotta go. I really appreciate it. - Linda Yaccarino, Thank you for making the time for us today. - Thank you, thank you. (audience applauds)",
    "transcript_keywords": [
        "Elon Musk",
        "Elon",
        "Musk",
        "Twitter",
        "talk",
        "team",
        "yeah",
        "Elon Musk made",
        "company",
        "time",
        "Linda",
        "Yoel",
        "platform",
        "users",
        "Elon Musk announced",
        "ADL",
        "lot",
        "today",
        "Elon Musk threatens",
        "active users"
    ],
    "transcript_entity_values": [
        "hours",
        "96th",
        "Elon",
        "three",
        "- Elon Musk",
        "yesterday",
        "morning",
        "Netanyahu",
        "fourth quarter",
        "12 weeks",
        "about 99%",
        "Kara",
        "Meta",
        "X.",
        "200-250",
        "24/7",
        "2024",
        "June",
        "less than 1500",
        "One",
        "75%",
        "two more minutes",
        "Yoel Roth",
        "all year",
        "the last 10 months",
        "early '24",
        "Sarah Eisen",
        "DM",
        "third",
        "Foundation",
        "VISA",
        "225",
        "60%",
        "Twitter",
        "Apptopia",
        "Joe",
        "90%",
        "Google",
        "Color of Change",
        "just 12 weeks",
        "about 75%",
        "daily",
        "1%",
        "Linda",
        "25%",
        "Elon Musk",
        "25 minutes",
        "AJC",
        "weeks",
        "10 years",
        "just this month",
        "first",
        "8,000",
        "that days",
        "Elon",
        "the rest of third quarter",
        "Musk",
        "AT&T",
        "about five weeks",
        "Sarah",
        "ADL",
        "Walter Isaacson",
        "Telegram",
        "nine",
        "US",
        "about 45 minutes",
        "hundred days-ish",
        "EDL",
        "237 million",
        "CNBC",
        "five weeks",
        "CSPAN",
        "Samsung Clock",
        "a hundred days",
        "the last decade",
        "about five",
        "months later",
        "last week",
        "Jewish",
        "Yoel",
        "second",
        "Elon",
        "Media Matters",
        "about 1500",
        "Monday",
        "about 540",
        "Linda Yaccarino",
        "a week ago",
        "Global Election Integrity Team",
        "tomorrow",
        "FOMO",
        "August",
        "over 540 million",
        "one",
        "Julia",
        "NBCUniversal",
        "Said",
        "Earth",
        "today",
        "60",
        "NBC",
        "number one",
        "months",
        "night",
        "monthly",
        "Jonathan Greenblatt",
        "Nissan",
        "two",
        "roughly 25%",
        "50,000",
        "Stop Toxic Twitter",
        "a day like today",
        "hundred",
        "the last 12 weeks",
        "about an hour ago",
        "a day",
        "Mark Zuckerberg",
        "noon",
        "only three",
        "100",
        "Jonathan",
        "the eight years prior",
        "November 2022",
        "the next week"
    ],
    "transcript_entity_types": [
        "TIME",
        "ORDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "PERCENT",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "PERCENT",
        "PERSON",
        "PERCENT",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "GPE",
        "TIME",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "DATE",
        "DATE",
        "NORP",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "TIME",
        "DATE",
        "PERSON",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "DATE"
    ]
}