{
    "id": "hz_mMLhUinw",
    "title": "The Superheterodyne Radio: No really, that's its name",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2018-12-25T13:19:31Z",
    "video_url": "https://www.youtube.com/watch?v=hz_mMLhUinw",
    "category": "Science & Technology",
    "tags": [
        "superheterodyne",
        "superhet",
        "AM radio",
        "amplitude modulation",
        "philco",
        "vacuum tube",
        "valve radio",
        "radio technology",
        "broadcasting",
        "history of radio"
    ],
    "views": 854930,
    "likes": 37491,
    "comments_count": 2078,
    "description": "You can support this channel on Patreon! Link below    The superheterodyne receiver may seem like a radio with a silly name, but in fact its a completely logical name that describes the key action these radios take to become excellent radios. The superhet solved a tricky problem in a clever way, and using our friend Algebra (as well as wave phenomena) proved to be the most effective way of tuning in a radio signal.  Technology connections on Twitter (Im just as weird on the social Internet as I am here on YouTube):   The TC Subreddit (warning: Im not good at Reddit)   Technology Connections 2 (my second channel where I upload weird stuff from time to time)   You can support this channel on Patreon! It has been amazing what Patreon has done for this channel, but also for me (your dorky host) personally. Through the support of people just like you, Technology Connections has become my job and I am so excited and thankful for it! If youd like to join the fine folks in a pledge to help the channel grow, please check out my Patreon page. Thank you for your consideration!   And thank you to the following Patrons! Charlie Quigley, Dakota Williams, Adam Erickson, Kevin Terrell, Tommi Hares, Trevor Smith, Callum Brieske, Tomas, Chuck Floyd, Emil Gilliam, Andy Copsey, Bitcore, Filip, Per 'Zapro' Jensen, Ward Sutherland, rn Arnarson, Alberto Amatucci, etho624, Tomasz Kolinko, Carles Codony, Samuel Plainfield, Jason McMillon, Michael Pacheco, Jason Ganiatsas, Mike Gerow, Marc Schroth, Andrew J Thom, Samuel Blakey, Mrpirate707, Frank Harris, Joseph Spiros, Patrick Meister, Sergey Kiselev, Clara Latter, Ashley Grant, Scott Emmett O'Donnell, Tianyu Ge, jeekl, rozboris, Paul Fisher, Stephen Vrazel, Applied Science, Peter ford, Sophie Haskins, James Id, Brendan Sheehy, Jay Foreman, Rich Theobald, Kyle Olson, Bryan Reid, Quinton Wilson, Jeremy DeGuzman, Sean Spark, Lucas Hartbarger, Taylor Cuzela, David Lastres, Granger Meador, Jeremy Kitchen, Jason Wellband, Shane Belaire, Paul Emmerich, Matthew Rossi, Paul Craigie, Alex Smith, Nick, Tyler, Paul Williams, Steven Hidy, Fredrik Grufman, Kollin O'Dannel, RJ Kent, Yona, Kevin Strehl, Tony DeSimone, Mike Bailey, Maggie Brown, Howard Kraut, T.J. Steckbeck, Pavlo Pravdiukov, Marco Anastasi, Peter Byrd, Trix Farrar, Matthew Razza, Mitchel J. Mullin II, Jakob Strande Langgaard, Jan Staval, Paul Walton, Matt Falcon, Steven First, Denver Alexander, Conor Hennessy Sykes, FinaleGrande, Christopher Dickey, OnlyOneSolutionTBHFam, Tim Juchcinski, Wayne Marsh, Ernie Smith, foophoof, Stein Strindhaug, Brady Brown, Giacomo Scaparrotti, Winfield Trail, Marc Ethier, Joseph Hill, John Semander, Bill Basch, Robert Toth, blouerat, PK, Richard Lindsey, Lars JJ, Patrick Musson, Matt Taylor, Johan Schoeman, Thomas Jew, Josef Citrine, Marcus Schwartz, Ryan Cozzubbo, Christopher Bassett, Julian Rapoport, Ed Hall, Jason Portwood, Jesse Cardone, Michael Snowden, Drew McClain, Boh00711, Jon-Andr Haraldstad, The8TrackKid, Daniel J Schless, Sebi Jecklin, Casey Kikendall, Craig Leverenz, Charlie Hankin, Andres Plaza, Revenge, Matthew Baron, Andr, Gerald Monaco, Tab Patterson, Jason Weathered, h.drew foy, Gantradies, Chris Hartl, Steve Stone, Brian G. Shacklett, Colton Aubrey Hooke, Paul Mills, Christopher Luna, Kotanu, Brendan Terrett, Techmoan, Mike Mason, Elijah Reeds, Christopher Jett, Justin Talbot, Steven Metcalf, Lolucoca, John McLusky, Ashleigh R, Stephen Bell, Logan Beenken, Eric Wood, Stephen Pick, BlancoGrande, Matthew Giraitis, James Ryan, Robert Joscelyne, Francis Fisher, Kedar Deshpande, Lukas Komischke, Dave Anderson, Felix Freiberger,  Dont see your name?  Dont worry!  To keep this little perk alive, the $5 patron shoutout is now on a rotating basis!  If youre not here, you should be here in one of the next two videos.  If youve slipped through the cracks, dont hesitate to send me a message via Patreon and Ill fix it!",
    "description_links": [
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.youtube.com/channel/UClRwC5Vc8HrB6vGx6Ti-lhA",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "Yeah. Its a great word, isnt it? It may not seem like it, but even an antique radio like this has to overcome a pretty significant problem before it can become a radio. See, like any radio, I can choose to listen to different stations by just touching that dial, and just like that the radio is able to zero in on a single frequency and allow me to listen to just that station. But have you ever stopped to think about how its doing that? Right now the radio is being bombarded by electromagnetic radiation, the vast majority of which it cant do anything with. Sure, when it was made, it just had to deal with AM radio signals for the most part, but soon came FM, Television, microwave transmissions, cell phones, WiFi, and the list goes on. And yet, it still functions perfectly as an AM radio. [various stations tuning in and out] Its able to toss out all of that nonsense and focus on just what I want it to focus on. To do that - and to do that well - its being a lot more clever than at first you might imagine. Obviously it has the ability to tune into one frequency - and thus tune out the rest. But you might be surprised to learn that it goes beyond being selective in the frequencies it receives. What its actually doing is creating a second frequency of its own, mixing that with all the incoming signals, and the resulting composite signal is then filtered and amplified. Thats what superheterodyne means - its not just a flowery marketing term like \"Spectrohydramagnetic,\" it actually comes from supersonic heterodyne. Supersonic means that its above the human hearing range. Today wed be more likely to call it ultrasonic but it was the 1900s and radios were getting CRAZY! Hetero means different, and dyne means frequency. So its a super (ultra) sonic frequency thats different. OK, how does that help? It helps through creating an intermediary beat frequency. A beat frequency is what happens when two dissimilar frequencies cause interference with one another. To demonstrate, Ive placed these two speakers in front of me, facing each other. This one is playing a 400 hz tone, and the other is playing a 401 hz tone. Notice how the sound appears to fade in and out once per second. [a solid tone with a throbbing undulation] On their own, they sound pretty much exactly the same. But together, that slight misalignment of their frequencies is producing a beat. And the frequency of that beat is determined by the difference between the two frequencies. The beat occurred once per second because there was a discrepancy of one hertz. Hert? Increase the frequency from 401 to 404, and the frequency of this speaker could not be found. Im just kidding, Internet humor! Now, since theres a difference of four hertz, that beat frequency becomes four hertz. [the same tone with much faster undulation] To see whats happening, Ill make the same tones in Audacity and put them next to each other. If we zoom in on the waveforms, we can see that theyre not quite aligned. If we were to add them together, at some points they combine to make a larger amplitude. Thats constructive interference. At others they combine to actually zero out the signal. That's destructive interference. When I actually combine them, we end up with a new waveform that is pulsing 4 times per second. [the same throbbing tone] The real fun comes when we get into higher frequencies. This speaker is playing a tone at 5,000 hertz or 5 kilohertz. This one will play at 5,400 hertz, or 5.4 kilohertz. low-fidelity guitar music [ an ear splitting tone ] [ a lower tone appears ] The principle of constructive and destructive interference producing a new signal at a different frequency also applies to radio waves. If you inject a signal that is, say, 100 kilohertz offset from another, it will produce a beat frequency of 100 kilohertz. Can you see how that might be useful? Lets go back to the radio. Say we want to tune to 780 AM, thats 780 kilohertz. One way to do that would be to create a filter which can block out every frequency that isnt 780 kilohertz. Now, we can do that, but to design a filter that can shift which frequency it lets through (and thus allows you to tune the radio) is tricky. It was done before, and until the invention of the superheterodyne radio receiver in 1917/18/20, that was essentially how all radios worked. But the trouble was that these filters werent that precise, and because of that the radio wouldnt be all that sensitive. Competing signals at similar frequencies might blend together, and the signals themselves would have to be pretty strong in order for the radio to pick them up. It was always a tradeoff between the precision of the filter, and the strength of the received signal. Further complicating things, these early radios also had trouble processing the signals themselves. The amplification circuitry of the day didnt like dealing with the (at the time) very high frequency of radio signals, as it was hard to design a vacuum tube that could effectively amplify these signals in order to produce audible sound. But what if instead of trying to design a radio that works in radios frequency range, we take a completely different approach? What if we design a filter that looks for just one specific frequency, AND we put that frequency outside the normal broadcast range? That would solve the interference and signal strength problems, and if we were able to lower the frequency of the signal, the radio could amplify it and make sound more easily. Additionally, we could make the filter more precise because it is set to a fixed frequency rather than needing to move around as the radio is tuned. And thats what superheterodyne radios do. Take a look at the schematic for this radio, a Philco 42-PT-7, and youll notice it says intermediate frequency: 455 K. C. This stood for kilocycles, which is another word for kilohertz. I like these old schematics because they often contain outdated terms, like how what today we call capacitors were then called condensers. Anyway, what this means is that, in a way, this radio is always tuned to 455 kilohertz. Now that may seem pretty useless, but its actually genius. See, this tube here, which is a pentagrid converter tube, is able to generate its own sine wave output at whatever frequency we like. This component here, called the tuning capacitor, works with the tube to change the frequency it generates as the plates move in and out (which therefore changes its capacitance value). By turning the tuning knob, the capacitance value of this component changes, and this in turn increases or decreases the frequency being generated by the oscillator tube. If we want to tune to 780 AM, we can take all of the incoming signals, mix them together, and inject a sine wave at 1,235 kilohertz. The interference between our desired frequency, 780, and the frequency were injecting, 1,235, will produce a beat frequency at 455 kilohertz. And, since this tube here, the intermediate frequency amplifier, is tuned to only pass through signals at 455 kilohertz, this newly created composite signal will pass right through it. It then gets rectified by the detector tube, amplified by the output tube, and with the help of some other smoothing capacitors, the resulting output gets sent to the loudspeaker, and we get audible sound. See how cool this is? We dont have to change the frequency were looking for in order to change which frequency we receive. By modifying the frequency that we inject into the mix, we can single one out because the combined signals will produce beat interference which will pass right through our intermediary filter. Its science! Its math! Its fantastic! But, this isnt to say that we can just inject a signal and everything is fine and dandy. Theres one slight problem. See, if we inject our 1,235 kilohertz signal without doing any other filtering, well actually get beat frequencies from two incoming frequencies. One from 780 kilohertz, and the other from 1,690 kilohertz. Both of these are 455 kilohertz away from the frequency were injecting. So, the radio will typically need some other filtering on its input to block out one of these frequencies, and thus prevent the second signal from coming through. That second signal is often called an image, because its analogous to a mirror image of the intended frequency - flipped across the axis of the injected frequency. This first filter doesnt need to be precise, but it does need to move with the tuning dial. Otherwise, the radio couldnt receive the full frequency range. If you take a look at the schematic, you can see that the tuning condenser (slash capacitor) takes a role in two places - it functions both as a filter on the antenna and as a generator of sorts for the oscillator tube. But to be clear - that first filter is really sloppy. It just has to block out frequencies that are some 400 kilohertz or further away from the local oscillators frequency. Now some of you might be asking, how can we change the frequency of the signal without affecting the sound? Well, that has to do with the way the signal is actually encoded. Remember, the frequency of the radio signal is simply a carrier. For amplitude modulation, its the overall intensity of the signal over time that encodes sound. So we can shift the carrier frequency up and down, without actually changing the information that it carries. The beat frequency generated by the mixing of the signals will follow the same exact pattern as the original carrier wave. The superheterodyne radio receiver solved one of the fundamental problems of radio in a very clever way. It proved to be such a good method of isolating frequencies that it became the de facto tuner design for many decades, continuing into the television age and through the transistorization of radio, though these days tuning is largely done with software. It wasnt perfect though. The presence of a local oscillator in the radio meant that it created a bit of electromagnetic radiation of its own, which could interfere with other radios nearby. To be fair, nearby usually meant within the same room, but its only fair to say that there were downsides to this approach. Still, thanks to the Superhet as it's sometimes called, tuning to your favorite station became a piece of cake. Thanks for watching, and I hope you enjoyed this video. Ive been sitting on it for a long time, as my earliest videos dealt with the history of artificial sound. You can watch them if you like, but be warned--they are pretty cringetastic. And thats my assessment! As always, thank you to everyone who supports the channel on Patreon, especially the fine folks that are scrolling up your screen. With the generous support of people like you, Technology Connections has gone from my hobby to my job! And Im very grateful for your support. If you would like to support the channel and get perks like early video access, behind-the-scenes footage, as well as the inside scoop on the latest projects, please check out my Patreon page. Thank you for your consideration, and Ill see you next time! incomprehensibly smooth jazz It was always a trade-off betreen... See you cant think that things are going well because as soon as you think that, it falls apart. Nope. I missed a The I love these old schematics because they often contain outdated terms, like how we today call bweeeehhh, bweeeehhh Take a look at the schamat mouth noises! We need to restart. ...and one is playing a 400 Hz tone, and the other is playing a 401 Hz tone. The wires arent hooked up yet so youre gonna know Im faking this! Eurghhh! Because there was a discrepen. I mixed my tenses [clears throat, inhales as if about to start speaking] Oh yeah, lets move this over.",
    "transcript_keywords": [
        "frequency",
        "radio",
        "signal",
        "beat frequency",
        "kilohertz",
        "signals",
        "beat",
        "frequencies",
        "radios",
        "radio signals",
        "filter",
        "tube",
        "sound",
        "radios frequency range",
        "interference",
        "radios frequency",
        "frequency range",
        "tuning",
        "tone",
        "superheterodyne radio"
    ],
    "transcript_entity_values": [
        "5,400",
        "zero",
        "many decades",
        "Hert",
        "hertz",
        "455 kilohertz",
        "780 kilohertz",
        "two",
        "401 hz",
        "bweeeehhh",
        "Eurghhh",
        "1,235 kilohertz",
        "5,000",
        "5 kilohertz",
        "1,235",
        "bweeeehhh",
        "Audacity",
        "Patreon",
        "today",
        "780",
        "5.4 kilohertz",
        "Today",
        "455",
        "1,690 kilohertz",
        "Philco",
        "400 Hz",
        "first",
        "one",
        "four",
        "4",
        "these days",
        "Technology Connections",
        "780 AM",
        "Spectrohydramagnetic",
        "401 Hz",
        "One",
        "401",
        "404",
        "Supersonic",
        "some 400 kilohertz",
        "1900s",
        "Superhet",
        "FM, Television",
        "second",
        "100 kilohertz",
        "400 hz",
        "1917/18/20",
        "the day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "TIME",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE"
    ]
}