{
    "id": "HZiaHEmE9PQ",
    "title": "Buying a Chromebook was a BIG MISTAKE - Chrome OS Flex",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-10-02T16:57:35Z",
    "video_url": "https://www.youtube.com/watch?v=HZiaHEmE9PQ",
    "category": "Science & Technology",
    "tags": [
        "macbook",
        "chrome",
        "chromebook",
        "best",
        "macos",
        "chromeos",
        "chrome os",
        "chrome os flex",
        "old laptop",
        "new laptop",
        "kromebook",
        "crombook",
        "cromebook"
    ],
    "views": 2984827,
    "likes": 101293,
    "comments_count": 5234,
    "description": "Try FreshBooks free, for 30 days, no credit card required at   Create your build at   Your old MacBook is really chugging these days. But new computers with fancy Nvidia GPUs and AMD Ryzen chips are very expensive. Here's a way you could save a buck! Chrome OS Flex! Google will now let you install Chrome OS on your own device for free. But can it actually improve old devices? We tested to find out!  Discuss on the forum:   Buy a 1 TB Samsung 970 EVO SSD NVMe :  Buy a 240GB Crucial SATA SSD:  Buy a Crucial MX500 250GB SSD:  Buy Bush's Baked Beans:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 CrINgeTRO 1:45 The Laptops 3:05 How we tested 4:04 How slow are they? 5:25 Installing Chrome OS Flex 6:34 BIG CAVEAT 7:49 Chrome OS Flex Results 10:39 Can you run it? 11:53 Chrome OS Flex limitations 13:17 Alternatives 14:32 Outro",
    "description_links": [
        "https://www.freshbooks.com/linus",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1458378-buying-a-chromebook-was-a-big-mistake-chrome-os-flex/",
        "https://geni.us/WP3ETA",
        "https://geni.us/8sdi9Ht",
        "https://geni.us/XO5Dpj",
        "https://geni.us/QCj6V",
        "https://lttstore.com",
        "https://www.floatplane.com/ltt",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "(chants) Is your laptop old and crappy? Download chrome and make it snappy. Are you trying to be frugal? Bye, bye windows. O K, Google! - Why do I have to pick one? - What? - No, I'm tired of it. For years now, consumers have been stuck asking, do I go for a Windows laptop or a Chromebook? Knowing that niether of them can fully match the features of the other, and that once they pick a path they're completely locked in until they replace the whole machine. And, it's so frustrating, because the actual hardware in these computers, is especially in some cases, darn near identical! At least, that's how it has been. This summer, Google reversed course and released their cloud centric OS to the general public for free. Which means that you, yes, you James Smith, can install Chrome OS anywhere you want. That disgusting laptop used for cooking videos in the kitchen? Chromebook. Your great Aunt's anemic Windows PC she somehow manages to break every month? Boom. Now it's a Chromebook. But is Chrome OS the solution for an aging computer? To find out, we voluntold our team to bring in any old laptops they could find, to see if Google could breathe new life into their aging hardware. And, I gotta say it is looking pretty good. It can even play this segue to our sponsor. - Build Redux. Build Redux makes it easy to configure your new build with support guides to help along the way. They also offer competitive pricing as compared to building a PC yourself. So head to buildredux.com/linus and start your new build today. - [Adam] So you brought in this laptop for us to test out. Here's your laptop. Tell us about it, what is it? - It? It's an HP G56. It's a ThinkPad X230. I bought this, oh geez, when did I buy it? 2012? - Oh, it must be like 2014 or something like that. - Oh, I have no idea. Probably I got it in 2001? - [Adam] 2001? - Yeah. No? - (Adam) You mean 2011. - 11 oh, yes. 2011. 11. Yes. 2011. - I bought this laptop at the Best Buy that I used to work at back in like 2014. My wife and I were doing long distance at that time, and she had a real piece of (beep), (laughs) so, she needed a new one, and so I surprised her with this. Now this is a bit of a piece of (beep) too 'cause it's been so long. - I'm a distracted person and I was trying to do some writing and I, it was very hard. So my dad's like, I'm buying you a computer that won't be connected to the internet. But, it's so cumbersome and slow that it didn't help. - I bought it anticipating that I would do a lot more traveling than I've ended up doing. - This is like, my school computer. I got it because is like, it just so gigantic. - [Adam] So what we're gonna do is that we're gonna install Chrome OS on it. - I'm very curious if it's gonna help. - (Adam) Thank you sir. Appreciate it. - To quantify any gains that we might get from Chrome OS, we need to do some baseline testing before we install Google's operating system. And, that's gonna be a little trickier than usual because Chrome OS does not have the same robust suite of benchmarking tools, that PC enthusiasts have come to expect on Windows machines. But, we did find a few browser based benchmarks, and we were able to create some of our own real world benchmarks to fill in the gaps. First up, we measured how long it took to boot the device, open a browser, and start watching a YouTube video. You know the basics. We also timed waking up from sleep, tested the number of chrome tabs each could handle. We're calling 36 tabs a pass. And, counted how many concurrent 1080p streams we could get running without any stutters. We then followed this up a battery test, to see if Chrome OS can not only make your system faster, but also run longer. And, just how slow are these computers? (laughs) Pretty bad. Lloyd's old MacBook took almost 30 seconds to wake from sleep. Sleep? More like mostly dead. And, Horts's HP G56? That took over five minutes to reach YouTube thanks to its ungodly slow 3,200 RPM hard drive. Making matters worse, it only managed a single 720p stream before giving up the ghost. As for performance in a browser, in our tabs test, the HP and ASUS units almost got a pass crashing out right near the finish line, with Lloyd's pretty much blowing its engine right out of the starting gate. Failing at a truly pathetic four tabs. Then in our 1080p playback test, Jamie and Adam P's machines both managed four 1080p YouTube streams with no drop frames while Horst's and Lloyd's devices failed to play even a single stream at full HD. In the battery test, every machine sucked, frankly, but that's kind of expected given the age of the cells in these devices. The MacBook does take its first W here though at nearly three hours of time away from the wall. We also ran our canned benchmarks, but we're gonna talk about those a little bit later since it's already clear that some of these computers are struggling hard. Maybe Chrome OS is the medicine they need. So, let's get started. The Chrome OS Flex install process is less than elegant, but if you're chrome curious and halfway tech savvy, you should be able to grab a USB stick and follow along at home. When you Google Chrome OS Flex, you get taken to a Google Enterprise site you then click try Chrome OS flex and, it asks you to sign up and fill in your company's details? You can safely ignore that. What you actually want is this little link right here. Then, it takes you to an installation guide. Great. But, you need to download a Chrome extension to create the installation media. Seems kind of random, but there is a reason for it. It's because this is actually a Chrome recovery tool that's designed to repair your existing Chrome OS install on your Chromebook. They've just repurposed it. At this point, it confusingly asks you to choose from a selection of Chromebooks, and it's here that you select Chrome OS Flex, and then target your preferred USB drive. Note that this will wipe out any other data on that drive. Once you've created your installation media, you can plug her into your device and non-destructively boot from the USB drive to try out the OS. And, at this point I could see you thinking, this is super cool, maybe I'll dual boot it. Hold it right there! If you decide that you want to install Chrome OS to your SSD or your hard drive, rather than running it off of a USB stick, you need to know that for some, probably stupid reason, Google's Chrome OS Flex installer does not allow you to choose where to install it. So, even if you've set up one partition for Windows and one for Chrome OS, it will wipe out both of them. Eliminating all of your data, making matters even worse, if you have two completely separate physical drives, it might target the empty one, or it might target your main drive and completely wipe out its data. You've been warned. So, make sure you've iether backed up everything important, or as an alternative, you can whip out your handy dandy LTT screw driver, available in four colorways, and remove your main drive, so you can keep your data safe while you install Chrome OS on the spare one. That is not okay, ya bunch of Googlers. What is okay is our test results. Sorry, spoiler, but it's the truth. They're not great. Just, okay. Let's start with the canned benchmarks that we mentioned earlier. WebGL Aquarium, it's a bit of a mixed bag, with both our ThinkPad and our ASUS machine recording drops in performance. While Horst's HP took a huge leap forward. Then, in Whirple HTML 5, the story is the same, with only the HP improving in any meaningful way. In Speedometer 2.1, our story gets even less compelling, and we see a consistent drop in performance across all devices. Chrome OS isn't looking so hot. But, maybe this reigned in performance is one of the ways that Chrome OS manages better battery life? Well, if our testing is anything to go by, sorry Chief. Not really. The three laptops that we could measure, all performed similarly to Windows, but slightly worse. And, this was probably the biggest surprise for us, because anecdotes from around the web have suggested that Chrome OS Flex should have a huge, positive impact on battery life. With some people reporting 25 to 50% gains. Maybe on these models, Chrome OS didn't automatically kick on power saving mode? Or, maybe their battery life tests were run under different conditions. I can't say, all I know is that at the moment, Chrome OS Flex is feeling a little more like Chrome OS flacid. Fortunately, these lower scores that we've seen so far do not tell the whole story. The experience of using these devices improved massively across the board. And, you can see that in our real world tests. Look at these boot times. To be clear, a minute, it's still pretty slow, but it's a lot faster than five minutes and 45 seconds. We also saw more 1080p streams on every single device. Faster wake from sleep, more tabs, and just subjectively, less chugging while navigating the operating system. But don't listen to me, listen to our volunteers. - Whoa. Wow. It's like a different laptop. - Woo. Oh my goodness, that is fast. (laughs) - Oh, that's pretty fast. - The Q key has stopped working. That's fine. - [Adam] Yeah, there's something wrong with the keyboard. - Yeah, if you could fix the keyboard, then this would be a solid, like write your novel at Starbucks sort of computer. - Does the track pad work, too? Oh, so it does, cool. And, the nub works? Sorry, the track point works perfectly fine. - [Adam] Hey, look at that. It's running Chrome OS now. - It's the click work. - [Adam] I have unfortunate news for you. - What? - [Adam] Chrome OS does not work. - Oh (laughs) okay. - Ah, that. The keen item on you might have noticed that Lloyd's MacBook was conspicuously absent from our test results. And, this seems like as good a time as any to mention the minimum requirements for running Chrome OS Flex. You will need an X 86 64 bit compatible device, four gigs of RAM, and 16 gigs of internal storage. With the final caveat being, that components made before 2010 may result in a poor experience. But, all of that is well below the specs of Lloyd's old MacBook. So, what's the deal here? Well, the thing is, you might also have a poor experience if you install Chrome OS Flex on a non-certified device. Jamie's ThinkPad here, was actually our only device that happened to be on Google's list, and it worked so well that it might as well have been a Chromebook in the first place. Almost. We'll talk about that in a second. As for the others, we saw issues that ranged from mildly annoying, like mislabeled function keys or nonfunctioning volume controls, all the way to completely game breaking. Like, not handing off rendering to the dedicated GPU on Lloyd's MacBook, even though, we could tell that Chrome OS was totally still running behind that blank screen. - Do you want to activate Chrome Box the built in screen reader for Chrome OS? If so, press the space bar. - It's important to note, that even if you install Chrome OS Flex on a certified device, it doesn't quite have all the features of regular Chrome OS. And, the big one here is no support for Android apps. That reduces your options for non-web apps to basically zilch, and is a huge hit to the versatility of these things. Your zombie Chromebook also won't get features that are exclusive to Google certified devices like access to their Linux Shell. Of course, you tinkery types can remedy this by using something called the Brunch Framework. It's a community project that uses an official recovery image to install Chrome OS on any X 64 device, but without any of the limitations that Google imposes on Chrome OS Flex. So, at the very least, you get your Android apps back, which is a big plus, since it's honestly kind of confusing that Google locked it off in the first place. We didn't have a chance to give Brunch Framework a shot though. So, those of you who have, let us know what your experience was like in the comments down below. Bottom line, would we recommend Chrome OS Flex? Well, even with the installation caveats, actually, yeah. It really can breathe new life into an old device, and is great if you just need something that's easy to lock down to give to a child, or you want a device for light computing tasks around the house. If nothing else, it takes about 15 minutes to get the installer onto a USB to try out. So, it's at least worth giving it a shot. And, if Chrome OS isn't your thing, hey, there's lots of other options. You could go with a lightweight Linux distro like Lubuntu or antiX, or if you wanna stick with Windows, the single best upgrade for older devices is an SSD. Jamie's 10 year old ThinkPad felt like a totally different machine with a solid state drive in it. And, we're gonna throw a couple of super affordable options in the link down below where you will also find a link to our sponsor. - FreshBooks. Now I'm gonna go ahead and guess you're not an accountant which is why you're gonna love this software. It's built for freelancers and small business owners who don't have time to waste on invoicing in accounting and payment processing. In fact, FreshBooks users can save up to 11 hours a week by streamlining and automating pesky admin tasks, like time tracking, and following up on invoices, and expense tracking with features like the new digital bills and Receipt scanner. Over 24 million people have used FreshBooks, and they love it for its intuitive dashboard and reports. It's easy to see it at a glance exactly where your business stands and it's even easier to turn everything over to your accountant come tax season. 94% of FreshBooks users say it's super easy to get up and running. And with award-winning support, you're never alone. Try FreshBooks free for 30 days, no credit card required. Go to freshbooks.com/linus to get started today. - If you guys enjoyed this video check out our Steam on Chromebooks video. That's right, gaming on Chromebooks. It's a thing.",
    "transcript_keywords": [
        "chrome",
        "Chrome OS Flex",
        "install Chrome",
        "Google Chrome",
        "Flex",
        "Google",
        "install",
        "running Chrome",
        "device",
        "windows",
        "Chromebook",
        "Lloyd",
        "drive",
        "laptop",
        "test",
        "USB",
        "devices",
        "Chrome Box",
        "chrome tabs",
        "running"
    ],
    "transcript_entity_values": [
        "36",
        "ASUS",
        "Starbucks",
        "30 days",
        "one",
        "second",
        "Chromebook",
        "1080p",
        "Lloyd's old",
        "Windows",
        "four",
        "Google",
        "first",
        "2010",
        "SSD",
        "MacBook",
        "five minutes and 45 seconds",
        "Linux Shell",
        "10 year old",
        "HP",
        "MacBook",
        "Chromebooks",
        "First",
        "Googlers",
        "2001",
        "Horst",
        "over five minutes",
        "2012",
        "2011",
        "GPU",
        "Chrome OS",
        "Brunch Framework",
        "today",
        "Lloyd's",
        "Lubuntu",
        "16",
        "FreshBooks",
        "11",
        "Over 24 million",
        "RAM",
        "Chrome Box",
        "64",
        "every month",
        "Google Chrome OS Flex",
        "LTT",
        "Google Enterprise",
        "WebGL Aquarium",
        "25 to 50%",
        "Chrome OS Flex",
        "2.1",
        "three",
        "about 15 minutes",
        "Build Redux",
        "nearly three hours",
        "This summer",
        "Lloyd's MacBook",
        "YouTube",
        "almost 30 seconds",
        "Chrome",
        "Horts",
        "Jamie",
        "Adam",
        "3,200",
        "Adam P's",
        "USB",
        "the Brunch Framework",
        "ThinkPad",
        "Chrome OS Flex",
        "Linux",
        "2014",
        "two",
        "James Smith",
        "up to 11 hours",
        "94%",
        "years",
        "Android"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "DATE",
        "ORG",
        "FAC",
        "TIME",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "DATE",
        "PERSON",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "FAC",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "TIME",
        "PERCENT",
        "DATE",
        "ORG"
    ]
}