{
    "id": "i0PlML-q4Lo",
    "title": "How to Install a Game Boy Pocket Backlight!",
    "channel": "This Does Not Compute",
    "channel_id": "UCEp20NgOZHmgWdbQdHSxgjw",
    "subscriber_count": 414000,
    "upload_date": "2015-09-29T17:00:02Z",
    "video_url": "https://www.youtube.com/watch?v=i0PlML-q4Lo",
    "category": "Gaming",
    "tags": [
        "Backlight",
        "Game Boy (Video Game Platform)",
        "Game Boy Pocket",
        "Nintendo (Video Game Developer)",
        "Handheld Game Console",
        "Video Game (Industry)",
        "DIY",
        "screen",
        "LCD",
        "Hand Held Legend",
        "MGB-001",
        "retro video game",
        "Video Game Console (Invention)"
    ],
    "views": 174193,
    "likes": 3900,
    "comments_count": 356,
    "description": "The Game Boy Pocket fixed a lot of the complaints about the original Game Boy, except for its non-illuminated screen. Let's fix that by installing a backlight kit!  You can buy the backlight kit I used in this video from Hand Held Legend:    -----------------------------------------------------------------------------  Please consider supporting my work on Patreon:   Follow me on Twitter and Instagram! @thisdoesnotcomp  TDNC t-shirts and apparel can be found at   This Does Not Compute PO Box 131141 St. Paul, MN 55113  -----------------------------------------------------------------------------  Music by Anenon ( and BoxCat Games (",
    "description_links": [
        "http://handheldlegend.com/collections/products-page/products/game-boy-backlight-dmg-and-pocket?variant=4515813315",
        "https://www.patreon.com/thisdoesnotcompute",
        "https://www.redbubble.com/people/thisdoesnotcomp",
        "http://freemusicarchive.org/music/Anenon/)",
        "http://www.box-cat.com)."
    ],
    "transcript": "Hey everyone, it's Colin. How's it goin'? The Game Boy Pocket is a great console, but like its predecessor, it has one major drawback: Its non-illuminative reflective screen. This time, we're going to fix that by installing a custom backlight module kit provided by Hand-Held Legend. It's not a difficult mod, but does require some patience, so let's get going. Of course, we need to disassemble the Game Boy first. There are six tri-wing screws that hold the shell together. Two of them are hiding inside the battery compartment. Then, another three Phillips screws hold in the logic board. Next, we need to disconnect the display ribbon cable. You can do this by sliding up both sides of the white lock-in bar. It'll only move a little bit and shouldn't come out completely. Once it's unlocked, the ribbon cable can slide right out. Set the logic board aside for a while. We'll come back to it a bit later. Remove all the buttons from the front panel so they don't get in the way, If they haven't been cleaned in a while, now's a great time to throw them in a cup of soapy water or something. The screen needs to be removed next. I usually just gently pull the ribbon cable out of the way, and then pry it out from the top using a plastic spudger. Another way to do this is what I call the \"ice cube tray\" method. Hold the front panel in both hands and slightly twist it, like, well, you're trying to pop ice cubes out of a tray. Go back and forth a couple of times and the adhesive tape holding the screen in should let go. I like to use a piece of masking tape to keep the screen from getting scratched or dirty, though a sticky note would work well too. On the back of the screen, remove the piece of clear tape holding down the ribbon cable. From this point on, you need to be *really careful* because that ribbon cable is very delicate, especially where it connects to the screen itself. If you put too much stress on the cable, it could ruin the screen. Once that tape is gone, peel off the four orange foam blocks on each corner. This next step is where you need to have some patience. The reflective and polarizer layers need to be removed from the back of the screen. They'll be replaced with the backlight module. They're stuck on the glass like a big sticker, but the adhesive is pretty strong. With the screen face-down, start in the upper-left corner. Use a razor blade or craft knife to peel up the corner so you can grab it with your fingers. Don't use the blade to peel the whole layer off. You'll leave adhesive behind, and the blade might slip and cut either you or the ribbon cable. All these are bad news, so I find it best to just slowly and carefully peel it off by hand diagonally across the screen. You'll be fighting with that ribbon cable the whole time, but just keep your cool and you can do it. Usually, both layers come up together, but there may be some dust, fingerprints, or adhesive left behind. It's important to clean these off, and a cotton swab soaked in isopropyl alcohol works well. While that's drying, you can prepare the backlight module. Fiire up your soldering iron, and put a little bit of solder on the pads of the ribbon cable. Then, solder down the included pieces of wire. I used red for positive and blue for negative. The polarity is labeled right next to the pads. Also included in the kit is a piece of polarizer film. This is an important part of any LCD, and without one, you won't see anything on the screen. It does matter which way the polarizer goes in, and an easy way to figure this out is to hold it up in front of another LCD screen, like on your computer and then turn it 90 degrees. Make note of the orientation where the polarizer looks the lightest, then peel off the protective films from both sides and slide the polarizer under the backside of the screen. If you get it turned 90 degrees from what it's supposed to be, the screen won't show anything in the end. Okay, almost done working on the screen. Just remove the protective film from the backlight module, and lay it on top of the polarizer, with the wires coming out the bottom of the screen. Drop the whole assembly back into the front panel. I opted to put a small piece of electrical tape over the pads on the ribbon cable just to keep anything from shorting out. Route the wires from the backlight towards the bottom corner opposite the speaker. Most of the excess wire can be looped up so it won't get in the way, and don't forget to reinstall the buttons. You can put the logic board back in now, and it helps to put one of the screws back to keep it in place. Solder the blue negative wire to this point on the logic board. It's marked with the number 4. As for the positive wire, now you have a choice: The kit includes a 100 ohm resistor. If you use it, it'll decrease the brightness of the backlight, but also give you a little more contrast. Trim one of the leads of the resistor short and solder it to the red wire. I put a piece of electrical tape on this section of the logic board to prevent shorts, then soldered the longer lead of the resistor to this point. It's not really labeled, but it's closest to the capacitor. If you don't want to use the resistor, then solder the red wire directly to that same point. This is ultimately what I ended up doing, as I found the screen to be too dim when using rechargeable batteries with that resistor installed. Nearly there. Reconnect the ribbon cable for the screen at the top of the logic board, then button up the Game Boy. Drop in a couple of batteries and a game cartridge and admire your handiwork. This is perhaps one of the best mods for Game Boys. The backlight is a dramatic improvement to the screen that'll make you wish Nintendo had done it to begin with. There's also a lot of flexibility for customization because the kits come in multiple colors. Overall, if you're a fan of the Game Boy Pocket, I highly recommend doing this mod. I think all that care and patience spent installing it is well worth the results. I want to give a big shout-out and thank you to Hand-Held Legend for hooking me up with the parts necessary to make this video happen. A link to this kit on their site is down in the description. If you like the video, I'd appreciate a thumbs-up. Don't forget to subscribe and follow me on Twitter at thisdoesnotcomp. And as always, thanks for watching.",
    "transcript_keywords": [
        "ribbon cable",
        "screen",
        "Game Boy",
        "cable",
        "Game Boy Pocket",
        "ribbon",
        "logic board",
        "Game",
        "back",
        "backlight",
        "Colin",
        "wire",
        "tape",
        "Boy",
        "logic",
        "Boy Pocket",
        "board",
        "backlight module",
        "polarizer",
        "put"
    ],
    "transcript_entity_values": [
        "The Game Boy Pocket",
        "100",
        "90 degrees",
        "Colin",
        "Two",
        "Twitter",
        "Game Boys",
        "Nintendo",
        "six",
        "first",
        "one",
        "four",
        "4",
        "Phillips",
        "three",
        "LCD"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}