{
    "id": "i3V0RxGESo4",
    "title": "HTC U12 Plus Teardown - Can the 'buttons' be fixed?",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2018-07-06T17:30:03Z",
    "video_url": "https://www.youtube.com/watch?v=i3V0RxGESo4",
    "category": "Howto & Style",
    "tags": [
        "HTC U12 Plus",
        "HTC U12",
        "U12",
        "U 12",
        "Smartphone",
        "tech",
        "teardown",
        "repair",
        "squeeze phone",
        "durable smartphone",
        "repair video",
        "HTC U12 screen replacement",
        "HTC U12 +",
        "battery replacement",
        "How to fix U 12 plus",
        "HTC",
        "Mobile phone",
        "HTC U12+"
    ],
    "views": 562477,
    "likes": 13894,
    "comments_count": 1160,
    "description": "Here is the HTC U12 plus durability test video:  Current Pricing on the HTC U12+:  The Tool kit I use in this video:   HTC has made another squeezable Smartphone, this time with the HTC U12 Plus. Opening up the HTC U12 plus is easy enough after my durability test when the back adhesive came apart from the phone. There is not much adhesive there, and the phone flexes enough that the HTC U12 Plus adhesive seperated from the phone.  If you want to see a HTC U12 plus screen replacement, or battery replacement, this is the video to watch. I also show how the squeezable sides work on the U12 Plus and a close inside look at the 'power buttons'.   Colored Plastic Pry tools:  Metal phone opening tool:   The camera I used to film this video:  The Lens I used for this video:  Wide angle lens:  And this Metabones adapter:  This is the drone I use:   *Follow me for updates!* Instagram:  Facebook:  Twitter:  Snapchat:  GooglePlus:   TO SEND ME STUFF: See my P.0. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video.  JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video.  Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result.  Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://youtu.be/06aNfvIIl8o",
        "https://amzn.to/2u6TrAL",
        "http://amzn.to/2DURcr7",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "http://amzn.to/2joH00G",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://bit.ly/1UAb2Fq",
        "https://bit.ly/1YyKice",
        "https://www.youtube.com/user/JerryRigEverything/about"
    ],
    "transcript": "[Intro] It's time to tear down the beautiful, translucent backed HTC U12 Plus. It's had a rough day. It's buttons have come off and it's bend out of shape, but I found a nifty little trick using my metal tweezers. I apply pressure to both sides of the missing power button hole and it allows me to turn the phone off, which is important for a teardown. Then the back panel lifts up and away from the phone body. Normally, unless you want to drastically flex your phone in half, you should use heat and a thin metal pry tool to remove the back. I'll use a plastic pry tool to unplug the fingerprint scanner ribbon cable, and the translucent blue glass is released entirely from the phone. It has that gradient effect going on where it's more clear in the center than it is on the outside. This gives us a pretty good look underneath the glass into the phone, and it seriously looks awesome. HTC has added a decorative loincloth over the battery with a nice printed circular design. This is just a decoration and has no functional value. The NFC is functional though, and that wraps around the upper half of the phone above the plastic. There are 8 normal Phillips head screws holding that top plastic in place. I'll remove those screws and pull it away from the phone. It has the gold contact pads on the back that allow the NFC to communicate with the motherboard. The next thing is to remove the decently sized 3500 milliamp hour battery, unclipping the Lego-like battery connector from the motherboard, along with both of the charging port extension ribbons. Thankfully the whole battery can pull out and away from the phone body not a whole lot of effort is needed. No magic pull tabs, which is totally fine, as long as that adhesive doesn't have a death grip. Another thing that's removable is the SIM card tray, which conveniently has an expandable memory SD card slot. Bonus points for that. The little ribbons at the corner of the motherboard are for the super annoying pressure sensors along each side of the phone. I'll show you more of these in a second. The middle orange ribbon is for the display, and then we have the other pressure sensitive ribbon that includes the power and volume buttons over here. Before we get a good look at those strips though, we have to remove the motherboard. I'll pull off these little black wire cables. All of this might seem kind of complicated, but this is nothing compared to how unorganized UTC used to be. HTC's older phones were more unorganized than Picasso and a paper shredder. I unclipped the dual front-facing cameras and pulled the motherboard out from the frame. The little guy is built simple enough. It does have dual rear cameras plugged into the back, each with their own Lego style connector. The normal 12 megapixel camera comes with OIS, but the 2x zoom lens does not have any hardware stabilization...electronic, maybe, but nothing that's visible from the outside. HTC does always have to stick some weird stuff in their design, like this dual LED flash on it's own removable ribbon cable. It's probably built this way so that it would line up dead center on the back panel, between the camera lenses. But it still kind of feels like HTC forgot about it and had to add it back in last minute. I reattached both rear cameras into the motherboard like little Legos, and HTC is actually one of the first companies to put 4 cameras into a smartphone. Huge thumbs up for innovation, but my favorite was 2 years ago back with the HTC 10 when they added optical hardware stabilization to the front-facing camera, which was also a first. This year that front stabilization is no more, but we have 2 identical 8 megapixel cameras now. Win some, lose some. Down at the bottom of the phone we have these 6 Phillips head screws holding the loudspeaker and charging port. I'll remove the top plastics...and would you look at that. Instead of a circular coin vibrator like we've seen in the past on HTC phones, they're using a rectangular taptic engine like we saw inside of the Pixel 2 and basically all of the iPhones. Some people really care about their vibrations and taptic motors are top of the line for vibrator fanatics. Loudspeaker comes out next. This is one of the two stereo speakers, HTC counts the earpiece as the second one. It has the same gold contact pads on the back for communicating with the phone. And finally, the charging port. Super tiny little guy with a blue rubber ring around the tip to help with that ip68 water resistance rating inside the phone. It's fun that HTC has accessorized their internal coloring with the blueness of the back glass panel. Now let's talk about one of the biggest flaws in HTC's design: the pressure sensitive buttons and squeezable sides. If you remember, the buttons aren't actually buttons they are little unmoving protrusions in the phone frame that can come off if persuaded. And once that button is off, the button's functions is unusable on the phone unless, you know, you carry a spare pair of tweezers like I showed at the beginning of this video. Who doesn't have one of those? The pressure sensitive ribbons are the electronic components that capture each short and long squeeze of your hand through that soft aluminum. They run along each side of the phone. Each side is essentially the same. I'll pull off this long plastic protector, and then start working on removing the ribbon. The problem here is that it looks like HTC has permanently adhered the ribbon to the frame of the phone, making button replacements, or squeezed motion replacements, impossible without replacing the whole frame anyway. Even while attempting to be gentle, my ribbon was torn, and portion of the contact pads were left attached to the frame rendering my phone unusable. You never realize how often you use a power button until it's gone. Here's a closeup look at the contact points remaining on the inner side of that metal frame. Normally in a teardown video, I would assemble the phone so that it's working after I'm done. It's pretty annoying that something so inexpensive and common as a button is rendering my $800 phone useless. To make matters worse, the screen of the HTC U12 is permanently glued to the frame of the phone and would be very difficult to harvest for parts. So reclaiming any value out of this phone is going to be difficult since those buttons are gone. The HTC U12 Plus is currently in the lead for the least repairable phone of 2018...but at least the charging port rubber matches the back. Speaking of which, since my phone is now dead, if you own a translucent blue U12 Plus and end up accidentally breaking the back glass because, you know, a case interfered with your squeezy bits, tweet me a picture of the carnage and I'll trade you my back glass that's still in one piece I won't be needing it. The HTC 10 was one of my favorite phones of 2016 back in the day. I vote that HTC start heading back that direction and ditch the squeezies...but, that's just my opinion. Let me know what you think down in the comments. And thanks a ton for watching. I'll see you around.",
    "transcript_keywords": [
        "phone",
        "HTC",
        "back",
        "translucent backed HTC",
        "HTC phones",
        "backed HTC",
        "HTC older phones",
        "ribbon",
        "buttons",
        "button",
        "back glass",
        "frame",
        "time to tear",
        "motherboard",
        "phones",
        "cameras",
        "phone body",
        "remove",
        "pull",
        "pressure"
    ],
    "transcript_entity_values": [
        "HTC",
        "last minute",
        "8 megapixel",
        "ip68",
        "6",
        "8",
        "SD",
        "Lego",
        "two",
        "3500 milliamp hour",
        "Picasso",
        "800",
        "2x",
        "Legos",
        "12 megapixel",
        "half",
        "blue U12 Plus",
        "The HTC U12 Plus",
        "4",
        "Phillips",
        "HTC U12 Plus",
        "SIM",
        "This year",
        "10",
        "iPhones",
        "NFC",
        "2018",
        "first",
        "second",
        "2 years ago",
        "2016",
        "UTC",
        "one",
        "the day",
        "2"
    ],
    "transcript_entity_types": [
        "ORG",
        "TIME",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "WORK_OF_ART",
        "MONEY",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORDINAL",
        "DATE",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL"
    ]
}