{
    "id": "i4TCbc9oB1E",
    "title": "This splits in HALF!!! - Dygma Raise Keyboard",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2020-05-22T20:22:55Z",
    "video_url": "https://www.youtube.com/watch?v=i4TCbc9oB1E",
    "category": "Science & Technology",
    "tags": [
        "keyboard",
        "ergonomic",
        "health",
        "numb",
        "hurts",
        "gaming",
        "PC",
        "USB",
        "USB-C",
        "RGB",
        "Customization",
        "Modular",
        "Split",
        "Programmable",
        "Custom",
        "2-in-1",
        "healthy"
    ],
    "views": 540241,
    "likes": 18726,
    "comments_count": 1124,
    "description": "Get 20% OFF + Free Shipping at Manscaped.com with code CIRCUIT at   You finally have 3-4 hours to game, but your arms are feeling dead after the first 10 minutes. You should check out an ergonomic keyboard, but they usually aren't really made for gaming... or are they?   Pre-order the Dygma Raise Keyboard at   Buy Other Ergonomic Keyboard On Amazon (Paid Link):  On BHPhoto (Paid Link):  On NewEgg (Paid Link):   Build a custom keyboard at MechanicalKeyboards and use our affiliate code LTT at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Get Private Internet Access VPN at  Get a Displate Metal Print at  NEEDforSEAT Gaming Chairs:  Support a Creator code LINUSMEDIAGROUP on Epic Games Store:  Get a 30-day free trial of Amazon Prime at  Our Test Benches on Amazon:  Our Production Gear:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Techquickie:     LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://mnscpd.com/2ML8ni3",
        "https://lmg.gg/jceaB",
        "https://geni.us/woCNjSN",
        "https://geni.us/K2DF",
        "https://geni.us/uX1VmR",
        "https://geni.us/RecNBTI",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/displateltt",
        "https://geni.us/needforseat",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/HOx0z",
        "https://lmg.gg/4oPzt",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- I'm in a mood today. Look at this thing, it's a little suitcase. You can travel with it. It's hard, kinda like a headphone case. And what do you get inside? A keyboard. Not just any keyboard. A compact gaming keyboard that splits in half. It's an ergonomic gaming keyboard. Get used to it, this is the world we live in now. You also get Dygma stickers. I'm gonna probably stick this to the back of Jake's chair later. A combined key cap puller and key switch puller. And oh and it's branded too, that's cool. Little, jelly logo in there. More about this thing later. Wrist pads, they look like they're adhesive. The website says these are removable and washable. I don't know how removable they're gonna be if they're adhesive but we can try. We got a bunch of tester key switches because this puppy not only comes in one of seven different key switch varieties, but also has removable key switches. I don't really get why they included these though because as far as I can tell they don't sell key switches on their own and if you're testing these you already ordered one and kinda committed so, whatever it's still nice. Maybe they just put them in there for symmetry, I don't know. Then you've got the cables, They're USBC, they're braided. The reason there's so many is 'cause, you get one per side. Then you connect each of those to this little thing, which they call the neuron. Which I love, I love when products have like lore. That's sick, so it's basically a little splitter, it's USBC on all sides. This is a pretty decent case and it's easy enough to use, I might actually use this if I was on the go. Back to the neuron, you connect the keyboard, oh boy, I did it wrong. Thusly, then you've got a USBC to type A cable and I mean, C is great but your PC probably doesn't have that many C ports so it's probably good that this is A. If you wanted this to be a C to C cable then, why not just swap it out since this whole thing is modular. Oh and it's RGB. I'll tell you about that right after this message from our sponsor, naturally Manscaped, ha ha! Manscaped created the world's first all in one manscaping kit that makes manscaping safe and easy. Introducing the perfect package 3.0 kit which includes everything you need to take your grooming routine to the next level. It includes their new lawnmower 3.0 cordless waterproof body trimmer which too has an ergonomic design and quality ceramic blades with replacements. Anti tug trimmer guards and a built in LED light. RGB all the things, okay it's not RGB, but, it's got light. It also has a powerful 7000 RPM motor and a 600 milli amp hour lithium ion battery. You can get 20% off and free shipping on your perfect package 3.0 purchase when you use the code circuit at the link below or on Manscaped.com. Now back to the tech. It's full RGB on the top. You can cycle through different effects using this branded button over here. And the sickest thing, I love that can you see this? The neuron changes color too. Isn't that great? That is just one of those nice touches. You know, thank you, attention to detail. You can operate this keyboard either as a conventional cordy like that. Or split apart for more ergonomics so you can have it tilted like this so that you reduce what's called ulnar deviation in the ergonomic keyboard world there's basically three, three or four kind of nemesis that you're trying to squash. One of them being ulnar deviation which is when your wrists go like that. A lot of keyboards you'll find yourself kind of, I kinda ended up going like that a little bit. So splitting that apart totally reduces that. You can angle them if you want which is what I do a little bit. It also gets your arms to be in line with your shoulders more so instead of being really together you can go wide like that which is sweet. You could even be gaming and just pull one of these out of the equation and just have your mouse, wide open desk space and your keyboard like that. This, okay I think this is a table issue. This isn't a keyboard issue. The other enemy of ergonomics is extension which is when your wrist goes up like that. That would be flexion, this is extension, this is neutral. That's what you want. So that's where wrist pads come in. Oh yeah that's cool it says Dygma Raise right on it. Did I say this thing's name? It's the Dygma Raise keyboard. Welcome to the show. Get those borders lined up. It's a nice kind of leatherette, very firm. I don't see how this is removable. Like, yeah I'm sure I could remove it but could I put it back on and it would still be sticky? I don't know. This keyboard's also available in silver or white. So as far as extension goes, this is a really low profile keyboard. It's not very tall on the side. So, especially, especially with the wrist pads on my wrist it's pretty much totally neutral. So that's nice. The third enemy of ergonomics is pronation and this keyboard doesn't really address that at all. So what pronation is, this is supination, this is pronation. When you pronate your hand like this, you've got two bones in your arm, the radius and the ulna. When you pronate they actually crisscross each other, they scissor each other. When they do that they pinch tissue in your forearm and that can kinda make blood not go into it as easily. So you can get allegedly some kind of RSIs from pronation. I find that now that I do use a keyboard solution where I'm not pronated. When I go back, I actually feel it pretty soon. Pretty quickly so what other keyboards of this design do is they'll have like a tenting kit, some kind of legs on them either built in or screwed on where you can adjust the height this way. This doesn't have anything integrated into it and as far as I can tell there's nothing sold separately so you are left with flat. That is kind of the spirit of this thing. It's not a full on ergonomic keyboard. It is a gaming keyboard with ergonomic features built into it. So for example another thing that you don't see on this keyboard is an ortho linear layout. Instead you have the regular layout for the keys that are staggered. This just looks like a regular keyboard right? On lots of ergonomic boards, these rows of keys would be completely vertical. It's again, a portable keyboard so you don't have any F keys which is kind of the pain for me. You don't have any arrow keys. Some ergonomic keyboards will have arrow keys but they'll be split up. That's annoying to me, I want them all in one spot 'cause I've got years and years of training. Maybe you work in retail and you're used to just going bop, bop, bop, bop, bop on a numpad or on the arrow keys like an Excel, you don't wanna lose that. On this if you wanna maintain that you're gonna have to just use a different layer and probate them on top of other keys which we will talk about later. There's these thumb buttons over here. There are eight thumb buttons. I love ergonomic keyboards with thumb clusters. That's probably the strength of this keyboard. If it didn't have those rows, if this was just a split space bar, this keyboard would be way less cool to me. I like to use the thumb clusters for backspace and delete which are normally you know, backspace is way up here, deletes way over here. Instead on mine I just, I allocate them both to a thumb. I put an enter over here for my thumb, so that I can be using my mouse and hit enter with my left hand without having to move my hand way over the keyboard. That's awesome. I found that when you split it up, it takes longer to get accustomed to this keyboard and like you know, grope your way around the dark because these keys are just not the same. One's a little wider than the other one. And I get why, you've just got more buttons on this side than this side so they had to make up the room somewhere, but, a slight demerit. 0.3 off for that. You satisfied with that David, that make sense to you in your grading system? - [David] More granularity. - Yes. As far as the build quality goes, you can kind of even see that this is very convenient and functional, but it does sag. However, is that even a problem? Because when you put it on the table it's flat and the downward force it's not sagging as I, as I smash the middle compared to the outside. I think it's a non-issue. Normally I would pick up the keyboard and go like this to test the deck flex the fact that it has this rail system is kind of not really a fair test. And then if I was gonna test the deck flex of just one side, now it's so small that again it's not very fair. But, it doesn't flex much anyway because it has this nice like double anodized faceplate which is pretty cool, the back, this is also metal so yeah this is gonna be a rigid board anyway. The key caps are nice. The light shines through, ah. They appear to be, yeah they're double shot injected which means there's no way for this symbol to rub off because it's actually just a different layer of plastic, it's not printed on there or anything like that. The switches are removable which is wicked because if you're not a fan of the three different varieties of cherry that they put this board with or the four kailhs options you can get. You can put whatever you want in there. You can put tealios in there or tangerines or halos or any of those other awesome key switches that we tried in our blind key switch challenge back at LTT that was sick. But it comes with cherry reds on our board. Which I mean makes it hard for me to test this keyboard out 'cause I don't like linears. Key cap stability, I mean when I look, it doesn't feel too bad but when I look at it some of these ones especially these non-standard keys for which they probably had to build proprietary jigs they look a little off kilter some of them, like it's not perfectly symmetrical. Now let's talk about software. This is a big deal for ergonomic keyboards. Usually when I get a new keyboard like this, I spend the first two days trying to figure out how I want it configured. And so that means it's nice to have a tool that makes it easy for you to configure so that you can go through lots of iterations 'cause it'll probably take, for me it takes like 10 different tries. But Dygma makes it easy. They have a graphical configurator tool. You can go key config, it shows you all the different options and they're all organized in a logical manner. It's descriptive, I know what it's all gonna do. You can do all sorts of like there's a toggle switch to indicate whether or not you want this action to be something that toggles or has to be held. You can do up to 10 different layers or profiles which are all saved on device. So I even had this experience today, I unplugged this from my desktop where I was doing most of my testing, plugged it into the laptop, my layout was still there. And you really want all those layers, especially on a compact board like this where you're gonna be putting the numpad or the arrow keys right underneath existing keys. So it's nice to have the flexibility. Another thing that's cool is that you've, and I don't even know if I've seen this is there's, RGB functionality in the configurated tool. So you can actually click not only each key, but also each one of these little segments of the under glow, each one of these little puppies can be adjusted and you can pick any color from the rainbow of this color wheel over here. Or you can adjust them all globally. And then when I cycle through my lights, I have a new profile in here which I made that you can see where I did this half and half I got orange over here and purple over here, pretty cool. All right let's see how much this thing weighs. 824 grams, it's not the heaviest thing out there, it's not that light, not bad. So, how much does it cost? This thing is under $300 right now. $300 is a lot for a keyboard. It's not a lot for what you're getting here. You're getting a pretty decent count keyboard. You're getting RGB, you're getting this novel design. You're getting a lot of flexibility with this board. In terms of form factor, in terms of configuration. If you're the target customer of this board, a gamer who moves desks at least once in awhile and wants ergonomic stuff especially if you get shoulder pain then this might be the board you've been waiting for. There are other boards out there like this, for example Kinesis has a split keyboard I think it's called the Edge. I don't think that one has thumb clusters to this extent. And it's definitely not as cool and the fit and finish isn't as good. Their boards are just a little more Indy healing even though they're a big company. This, this feels like a course air board, you know? Pretty much there. So I do recommend this board, I think it's pretty cool. I wouldn't use because I don't want the F keys and I use Excel I like to use the arrow keys. But if I wanted a compact gaming board that I could take to H board tournaments I would get this board, it's pretty sweet. And it has a neuron! If you liked this video, hit subscribe. And check out our other keyboard videos like the one I did with that candy bar keyboard that really heavy pink keyboard, so cool. Who doesn't want it?",
    "transcript_keywords": [
        "keyboard",
        "keys",
        "key",
        "kind",
        "thing",
        "board",
        "ergonomic",
        "pretty",
        "ergonomic keyboards",
        "RGB",
        "arrow keys",
        "cool",
        "keyboards",
        "key switches",
        "nice",
        "gaming keyboard",
        "back",
        "put",
        "thumb",
        "Dygma Raise keyboard"
    ],
    "transcript_entity_values": [
        "USBC",
        "up to 10",
        "half",
        "seven",
        "0.3",
        "Excel",
        "eight",
        "Jake",
        "three",
        "One",
        "Dygma Raise",
        "one",
        "20%",
        "the first two days",
        "Dygma",
        "Dygma",
        "600 milli amp hour",
        "7000",
        "Indy",
        "LTT",
        "David",
        "Kinesis",
        "Edge",
        "third",
        "824 grams",
        "10",
        "first",
        "3.0",
        "two",
        "four",
        "F",
        "Manscaped",
        "Manscaped.com",
        "300",
        "RGB",
        "years",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "DATE",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "DATE"
    ]
}