{
    "id": "I6_PpdvUizM",
    "title": "Chromebook Restoration and Exploration - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-08-23T20:00:54Z",
    "video_url": "https://www.youtube.com/watch?v=I6_PpdvUizM",
    "category": "Science & Technology",
    "tags": [
        "Chromebook Restoration and Exploration - Krazy Ken's Tech Misadventures",
        "Chromebook Restoration and Exploration",
        "Chromebook Restoration",
        "Chromebook Powerwash",
        "Google",
        "Chrome OS",
        "Samsung",
        "Laptop",
        "Notebook",
        "Chromebook",
        "Software",
        "Hardware",
        "Demo",
        "Tech",
        "Computer",
        "Comedy",
        "Funny",
        "Humor",
        "Krazy Ken's Tech Misadventures",
        "KKTM",
        "Krazy Ken",
        "Linux"
    ],
    "views": 69607,
    "likes": 1688,
    "comments_count": 500,
    "description": "A Samsung Chromebook falls into the chubby lap of Krazy Ken. Coincidentally, Krazy Ken discovers someone in need of a computer, so he takes on a quest to restore this Chromebook, fiddle with Google's Chrome OS, and send it on its way!  Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #65 - Chromebook Restoration and Exploration  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen",
    "description_links": [
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- This is where the computer nerd in me is kinda freaking out. Like, I don't see like, a path. A user that's going to be using a Chromebook doesn't need to really have full access to a file system. I think it's a picture of a penguin. Okay, I'm a penguin people. Yeah, I'm a sucker for cute animals. So uh, that's my weakness. She spilled her ice cream. (beeping) (typing) (buzzing) (upbeat music) Hey guys, how you all doing? Really that's just great. You know I'm kinda great today too because Chromebook. Like what? I've never touched one of these things. I've seriously never used a Chromebook before. But there was this place that was just recycling a bunch of stuff like these Lenovo notebooks, that I threw some Linux stuff on If you want to check that out. And this was among the pile. I mean one man's trash is another man's treasure right? So, I thought I'd boot it up see what's on here maybe reset it if I have to and then explore it because I have not done so. But, before we explore the software which again I've never used before. Let's take a look at the computer itself. I mean just by looking at it, I mean I can tell it's definitely a cheaper kinda feeling thing but it was probably what like $300 bucks or so? Definitely has kind of a MacBook Air style. With the chiclet keyboard and the whole like, quazi-silver look it's looks like it's kinda like an aluminum but, no it's all plastic. But you know for the price, can't really go wrong with that right? We have a headphone jack and a little sd card door on the side there which is nice. Nothing on that side. And on the back it looks like plenty of I/O to go. Not sure if that's like a little light or something but that looks like the very tiny power port. That's smaller than what I'm used to seeing on computers But again not sure if that's a light or something. Full size HDMI, looks like we have USB, and under this door I noticed there was like um, again I just kinda glanced at this but it looked like there was another card in there. So I'm not sure if that's like, the main storage for the device. Like maybe there's not an internal SSD or anything, but instead its like this micro SD card that's on the back there. So if I remove that probably nothing would happen. Actually I'm curious. I'm going to remove this and boot it up Eh, okay it's kinda stuck. Maybe it doesn't come out. It looks a little bit bigger than a normal micro. Oh, it feels all rubbery. Okay so I'm really not sure what that is (chuckles) And uh, there's the top Samsung Chrome. Let's have a little peeky-poo. Oh. (laughs) The whole things just wanted to flip up. Yeah okay. Oh, it automatically turns on when you open it. Okay. Maybe that's where Apple got the inspiration for those new MacBook Pros. Where you just open them and I think they just turn on when you open them. Don't they? Okay so we have two users here and this person's labeled as the owner. That one person's not. So I'm guessing you have one owner and then you can add multiple other users on here. Add supervised user, huh alright. Again this is all new to me. (laughs) All new to me. Do we got brightness control here? Oh look at that, isn't that nice. So I guess I can add a person. Oh yeah I guess I can just sign in with my account here. But then I'm gonna have those other accounts on here still. So, I may have to wipe em out and there's also browse as a guest. So I guess you can have an owner, other user accounts in addition to the owner, or you can just browse as a guest. Pretty cool, okay. Well let's look at a way to just wipe this out. Oh, didn't mean to do that. I have no idea what happened there. And before I continue I just wanna say how impressed I am with the battery life on this thing. Because I just realized it's not plugged in. (laughs) And it's just been sitting in my junk pile for probably over a month. Still turns on. Okay I plugged in the power and it like shut down on me. I don't know why (chuckles) That was mean. Okay, so after a quick hit of the google machine I found out we're gonna do something called a power wash. Which I guess is a way to reset the factory defaults. So, we have to hold down Control+Alt+Shift+R. That's a lot of buttons. And... Well the instructions said click restart but I just see this. All user accounts and local data will be removed. I mean that's good. Alright well that's what we want. Confirm power wash? Yes this cannot be undone. Hmmm, was it really that easy? Control+Alt+Shift+R and then you click two more buttons or three buttons however many that was. Power wash in progress, okay. So does that mean I can just go up to any Chromebook owned by anybody and just wipeout their data that easily? Like it didn't even ask me for password or anything. I mean, hang on. I'm looking at this article and it says like, if you're on like a school network or probably something that's like registered with a domain kinda like, I don't know like a windows work station under like active directory or whatever. You know then you couldn't do it but maybe that's where the security kicks in. If you're on a domain you can't do it but, yeah this things definitely wasn't it was just all local data and yeah I apparently just reset it just like that. Hmm, I don't know if that's very secure. I mean ideally you stuff should be in the cloud or backed up somewhere and that stuff won't be touched obviously. But (laughs) In terms of local data, yeah I could just ruin your day. I just wiped your shit out. But oh well maybe its easy to get stuff back with everything being you know Google accounts and everything. So, yeah let's connect to deep thirteen. Oh and by the way, I should probably mention why I'm doing this. Just like with those Lenovo notebooks I've come across some people that don't have a computer. They might have a phone but they want a computer but they can't really afford anything. So, I've been taking these old computers that have been recycled or you know they've been wrapped up ready to get recycled. But I was able to get my hands on a few of them and I'm basically just cleaning them up and giving them away to people I know that are in need of a computer. But I'm going to sign in with my own Google account and just experiment with the system because again I have not used, I think it's called Chrome OS. I have not used that before so this will be new to me. Okay all I wanted to do was type in my email and something went wrong. Okay, ugh. Let's try that again. Okay I've been trying a few times and one time it let me type in my password but now it's just being kind of a bitch. (laughs) It is not letting me in. Um, not even past my email. Uh, okay, well. You know the definition of insanity is doing the same thing over and over again and expecting a different result. Well, I am the epitome of insanity. So I am going to do the same thing over and over again and expect it to just work. You just watch I will break the rules of insanity. You just watch. Haha told you it would work, Suck it insanity, and suck it dictionaries. Suck my dictionary. Please wait while I try to connect you. It's probably doing a bunch of stuff right now. But yeah this is the first time I've used my Google account with a Chromebook. Actually, how many Chromebook users do we have out there? Show of hands. And by user I just mean someone that owns one it doesn't have to be your daily driver but let me know if it is your daily driver. Like maybe it's all you need. Maybe you can get by just by using a Chromebook. White screen. Yes, you're signed in Chrome sync, bookmarks will sync. Well I don't really use Chrome but if I did it would do that. Yeah, accept and continue, sure. I agree to be turned into a Centipad. Howdy computer. Yes the account name is Computerclan. So the first name is just Computer. I'm looking at this screen kind of on an angle so you guys can see it and yeah the color is like totally lost. So not really a high angle of view on this thing, but again cheaper computer can't really complain, right? Let's take a tour. Get to your apps fast. Fabulous. Can't click it but okay, we'' just do next. Check your Chromebook status. I think it's a picture of a penguin. Okay, I'm a penguin people. Okay, so yeah, it looks like down here is a type of panel of sorts. I'm not sure if they technically call it a panel. It's called a shelf. Alright, I like shelf, shelf is good. Alright so we have a shelf, we have a Chrome, Gmail, looks like Google docs, Youtube and it looks like some kind of menu. Do they call this the menu? What do they call this? Let's see. Launcher. So this is the launcher and you can go full screen with that. Okay that looks cool. I dig that. And over here we have a notification area, and I'm not exactly sure what they call this but on Windows you'd typically call that a system tray. And it looks like we have some quick access to settings over there. Alright, do we have like an Alt+Tab feature? I'm actually curious about that. I just want to explore this thing now, let's see. Okay so yup, oh that's kinda cool. You drag the window down there the shelf goes semi transparent. It kinda snaps right there and then it fades away and when you're in full screen it goes opaque. And that's interesting Adblock is disabled. Wait a minute, I just did a power wash so was Adblock like installed by default? Oh you know what I think it, ahhh. It synced from back in the old days when I would stream Computer Clan live and we used Chrome. Just when we were doing live broadcasts so we had Adblock on so we didn't get a bunch of crap popping up while we were streaming. But yeah I typically don't use Adblock. I know there's websites that are full of clickbaity crap but I just stay away from that but I don't use Adblock. I don't recommend you use it because there's certain people maybe like the person you're watching that make part of their living off of advertising. Nervous Laughter, hahaha. Okay let's go to Youtube, my stomping ground. And let's see how this works. Oh look a Captain Disillusion episode. But yeah that is cool that like, I'm signed into like all my Google shit. Just automatically and even my bookmarks. I only had the two, you know, those sync. That's really cool. Actually I can just go to the channel right from here. I can see myself getting by just with using this like if I had to. Aside from the fact that I work in the video industry. Like I couldn't get by without Phonica pro and Photoshop and After Effects and stuff. But honestly if I wasn't into all that I could probably get by just with the Chromebook. Cause there's some good web based applications like Google docs and stuff. I use that at the office all the time and it works. I mean let's listen to how good the speakers sound on here. - [Narrator] The Computer Clan is a group of like minded people. - Very tinny but again cheap ass notebook. But it works, I mean the battery was lasting for like over a month and you know it's not a terrible product for what it is. So I think whoever ends up getting this, Uh yeah it'll be fine for them. But I'm guessing a lot of stuff just runs inside of Chrome here. It is an operating system itself but it looks like when you click things it just opens up inside of Chrome. Actually, I don't know. Are there other applications that run like on the system, like outside of the web browser? I'm guessing no. Maybe aside from small things like calculator. Yeah, that looks like it runs as a native application here. So this is what the interface looks like. Yeah, it's kinda Windows esque but it also has that material look. Little hamburger menu there. Appearance. Show home button. Minimize just kinda shrinks down like that. I mean the animation seems smooth. I mean I would expect this to preform decently because you know it's kind of like a hardware software made for each other solution. Let's see right click, set wallpaper. What kinda wallpapers you got here? Ooh dark mode, yes. Ooh surprise me. Okay. It's kinda like the I'm feeling lucky feature. Look at that guy looking for a Coca-Cola. Is that a fox? Or is it a... Looks like a fox. Yeah, I'm a sucker for cute animal so uh that's my weakness. Let's do what I like to do. let's throw one of my wallpapers on here. Let's go to thecomputerclan.com. I actually have a bunch of new photos that I shot that I like haven't even posted anywhere. I really should get to that sometime.(laughs) Um, but yeah, the wallpaper gallery still has some decent stuff in it. Let's see what we got. Um. Okay, here we go. Yeah that is really high res.(laughs) So I'm guessing I can just, let's see, oh search Google for image. You can do reverse search right from a right click. Not to shabby. Save image as, now this part is gonna be interesting cause a lot of this stuff I'm guessing is Cloud based. So yeah, there's my drive. But, is there like local storage? Like how does the file system work on here? That's a question I have. (laughs) So save. Okay, nice notification. Show in folder. Okay so there is like a file browser it look like. It's called Files and that makes sense. Oh, so we can Alt+Tab that pretty cool. Alright, right click. There you go. Set wallpaper. And bon appetite. Well that worked pretty well. Yeah still getting used to this so yeah. Google Drive shared with me my drive offline recent ad news service. So I guess you can have other Cloud services on here. Install from the webstore. Okay I gotcha. This is where the computer nerd in me is kinda freakin out. Like I don't like a path as to where this stored but again a user that's going to be using a Chromebook doesn't need to really have full access to a file system so. I just jabbed my elbow against my table. That hurt. Uh yeah, so that makes sense but let's see. Get info. Oh it has my metadata there. Oh you can press the space bar for that, So if you press space bar it gives you metadata and a larger preview. So it's kinda like Quick Look kinda, you press the space bar Sweet it's got my F stop. Yup I shot it at F3. 24mm ISO 100 Canon EOS 7d mark ii, actually, Right here sitting off to the side. That's exactly what I shot that photo with same lens and body. Well, let's see what's up in the web store cause I'm guessing you can throw other applications on here. Or as we called them in the old days programs. Keep which is there note taker. Ah yes, a speedtest, Grammarly. Yes I've used Grammarly before. That's good. Nimbus which is a type of rain bearing cloud, as I have learned. Ginger which is kinda like Grammarly it's interesting because their logos are also very similar. The G's. But yeah I'm recognizing a lot of these applications and I guess they just all run on Chrome through the browser and stuff which is interesting. It really actually is like a full circle scenario. Think about it for a while. Back in the day on our laptops on our desktops our third party apps, 99% of the time were native applications. We didn't really run third party apps in browsers. Software as a service was a totally foreign concept to most people back then. And web applications HTML5 like that stuff was nonexistent. And then on our phones like here comes along the iPhone. And then people start writing third party web applications for the phone. So in short, there was a time when most third party applications on computers were native and most third party applications on phones were on the web. And then it changed. And now it's like all the applications are native apps you install on your phone through the app store. And now it's like on computers so many things run the web now. It's like (clicks) everything flipped. Native apps which were once the go to on computers are now the go to on phones. And web apps which were once the go to on phones are now the go to on computers. So I was just scrolling through the web store and I happened upon a, I believe it's just a Chrome extension called Tabby Cat which is interesting, because I actually have a tabby. He's actually right next to me eating right now. So if you hear crunching, that's him. (laughs) Um, furry Pocky. Oh, I like Pocky. Pocky's good. Uh yeah let's add it to Chrome. So I guess each time you open up a new tab you get like a cute animal that pops up. (laughs) It's called Tabby Cat apparently. Um okay, so let's try it. Ooh it's animated. Oh my gosh it's adorable. Booby Cheerio, is that how you pronou... Oh, Dooby, yeah Dooby. (laugh) Back to the Dooby (laughs) Uh, that's kinda cute. I like that. Oh, Oh, Oh, he mean. Oh he mean. Lovely Cookie. Okay that's kinda uh. Scoopy Dinosaur. Oh, so there's a full screen button right on the keyboard. That's cool and oh, um. Oh, that's like an expose window switcher. Kinda like in Mac OS or Windows. That's cool you got like a little window switcher there and you got a full screen button. Cool. Here's those little keyboard shortcuts I was talking about earlier. And I must say I like how there's a little light on the power button here. Just a nice little touch. Oh man I can't handle the cuteness of Glittery Bella. Yeah that's a cute one she's spilled her ice cream. Aww. Gotta get your ice cream back. So yeah I'm calling this a win. It was pretty simple to reset this thing and get my own stuff on there so I'm sure the other owner will be able to do that easily too. Thanks Google for making it easy. Well let me know what you think guys about Chrome OS and Chromebooks in general. I'm kind new to them never used them before today. But I'm interested in your thoughts so feel free to drop me a line down below. Let's shut this bad boy down. Fade to white. That was pretty flawless and simple. I think we're really defeating the curse now. That was an easy one thanks for sticking with me catch the crazy and pass it on. (upbeat music)",
    "transcript_keywords": [
        "kind",
        "Yeah",
        "Chrome",
        "Chromebook",
        "computer",
        "google",
        "stuff",
        "applications",
        "computers",
        "full",
        "cool",
        "web",
        "thing",
        "people",
        "back",
        "things",
        "guess",
        "Adblock",
        "power",
        "user"
    ],
    "transcript_entity_values": [
        "USB",
        "Lenovo",
        "third",
        "Tabby Cat",
        "Glittery Bella",
        "7d mark ii",
        "the old days",
        "99%",
        "HTML5",
        "daily",
        "Computerclan",
        "a minute",
        "Chromebook",
        "Centipad",
        "Nimbus",
        "two",
        "Apple",
        "sometime.(laughs",
        "SSD",
        "Samsung Chrome",
        "Computer",
        "Grammarly",
        "MacBook Pros",
        "24mm",
        "Adblock",
        "Mac",
        "today",
        "The Computer Clan",
        "Google",
        "jack",
        "SD",
        "Youtube",
        "first",
        "one",
        "F3",
        "Windows",
        "Chromebook",
        "Chrome",
        "$300 bucks",
        "Canon",
        "100",
        "quazi",
        "iPhone",
        "thirteen",
        "Scoopy Dinosaur",
        "Cloud",
        "Linux",
        "EOS",
        "Coca-Cola",
        "MacBook Air",
        "Gmail",
        "Computer Clan",
        "three",
        "Google Drive",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "DATE",
        "PERCENT",
        "PRODUCT",
        "DATE",
        "PRODUCT",
        "TIME",
        "FAC",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "PERSON",
        "GPE",
        "GPE",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE"
    ]
}