{
    "id": "I6WSY1O-PsA",
    "title": "OnePlus 8 Review: Dying A Hero",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-04-14T15:53:08Z",
    "video_url": "https://www.youtube.com/watch?v=I6WSY1O-PsA",
    "category": "Science & Technology",
    "tags": [
        "oneplus 8 review",
        "oneplus 8 pro review",
        "oneplus 2020",
        "best oneplus phone",
        "best budget phone 2020",
        "best value phone 2020"
    ],
    "views": 393979,
    "likes": 13518,
    "comments_count": 1163,
    "description": "Sponsored by Raid Shadow Legends. Install Raid for Free  iOS:   ANDROID:   PC:  and get a special starter pack Available only for the next 30 days   [ONEPLUS 8 REVIEW]  OnePlus is a smartphone maker with a cool story. It started out by appealing to buyers who were price-conscious, yes, but more importantly: phone geeks. So OnePlus phones have always been fast and buffed up by a few cherry-picked features that actually make them more useful. At the same time, OnePlus has mostly resisted adding extraneous bloatware that doesnt improve the experience. The result has been years of products that I could recommend not just to fellow nerds, but to normal people who just wanted a really solid phone at a fair price.  The OnePlus 8 doesnt betray that legacy, but it also doesnt do much to push it forward. For that you need to look to the OnePlus 8 Pro, but then youre jumping to a $900 phone. The OnePlus 8 here? A buck under $700. That's more in line with the company's traditional year-over-year price hikes, but it's still more expensive than ever. With competition like the Pixel 3a selling for less than half the price, does the OnePlus 8 stand a chance even though it's about to be on more shelves than ever? Find out in my OnePlus 8 Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S ONEPLUS 8 REVIEW]  MrMobile's OnePlus 8 Review was produced following 13 days with a OnePlus 8 review device (model IN2015) provided by OnePlus. The device was carried alongside a OnePlus 8 Pro (model IN 2025) in Brooklyn NY and tested on Verizon and T-Mobile. It received a single software update during the review period.  MrMobile does not produce paid reviews; no company paid a fee or otherwise offered compensation in exchange for this coverage, and no company was offered copy approval or an early preview of this content. The lone sponsor of the OnePlus 8 review is Raid Shadow Legends.  MrMobile's parent company Future plc participated in a promotional arrangement with OnePlus to host a Q&A session on Twitter following the OnePlus 8 launch. While Michael Fisher answered some questions during that Q&A, neither he nor the MrMobile division was involved in the advertising or negotiation process, and the MrMobile division received no compensation for that participation.   [LINKS]  OnePlus 8 Review [Android Central]:   OnePlus 8 Pro Review [Android Central]:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #oneplus8 #oneplus8pro #oneplus #smartphone #tech",
    "description_links": [
        "https://clcr.me/FErJD7",
        "https://clcr.me/0kUQl7",
        "https://clcr.me/Ua65vU",
        "https://www.youtube.com/channel/UCSOp...",
        "https://www.androidcentral.com/oneplus-8-review",
        "https://www.androidcentral.com/oneplus-8-pro-review",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- Sponsored by Raid: Shadow Legends. I've started this script three times. On an optimistic day I called the OnePlus 8 the most exciting OnePlus ever, because it's now on two of the three largest carriers in America. On a darker day I called it the company's dullest generational sequel ever, because frankly it doesn't bring much new to the table. And finally, after nearly two weeks of using the thing, I realized that it's both. (upbeat music) OnePlus has a cool story, right? It started out by appealing to buyers who were price conscious, yes, but also phone geeks. So, OnePlus phones have always been fast and they've always been buffed up by a few cherry picked features that usually made them more useful. Like the physical, \"Do not disturb switch,\" that I've been begging any other manufacturer besides Apple, to pick off the old palm carcass. Same time OnePlus has mostly resisted adding extraneous bloatware, stuff that doesn't improve the experience. The result has been years of products that I could recommend not just to fellow nerds, but to normal people who just wanted a really solid phone at a fair price. The OnePlus 8 does not betray that legacy, but neither does it do much to push it forward. For that you need to look to the OnePlus 8 Pro, but then you're jumping to a $900 phone. The OnePlus 8 here, a buck under 700 to start. We'll come back to that price, but first let me show you something. This is what's called a reviewers guide. Manufacturers often package them with review devices to showcase what's new, and the thing is, this book could be a lot thinner. 6.5 inch HDR+ display at 90 Hertz, okay, same screen specs as last year's 7T, with the bonus that it's now more readable outdoors. Uh quote, \"Brilliant contoured design that seems to disappear in the hand.\" Okay, it's comfortable and this interstellar finish is fetching. But there's nothing really special about this rectangle. The return of the curved screen means the return of false taps with your thumb meet. And then a hole punch for the front camera is far uglier than the teardrop on the 7T. Don't add me, but if you're gonna there's my handle. Okay, let's see, we'll come back to the camera, crazy performance thanks to a not so spec sheet, like always. Oh, yes, 5G. Folks, by now you should understand three things about 5G: one, it doesn't cause coronavirus, so pleas stop burning down cell sites, two, it's the backbone upon which the future of communications is going to be built, so it will someday be very important, but three, today is not that day. I've tested 5G on the two carriers this phone will be launching on and the TLDR is, you'll get slower, but more reliable service on T-Mobile's lowband 5G and much faster, but also much less consistent service on Verizon's millimeter wave 5G. If you wanna know more check out my 5G explainer videos linked below. Oh, there's actually one more thing 5G does, increases the price of phones. That's partly because Qualcomm, which makes the Snapdragon 865 processor doesn't sell a version without 5G. And that in part explains the $100 hike in the launch price from last year's OnePlus 7T. Those extra bucks helped fund better haptics long a low point of OnePlus phones. And a slight refresh of OxygenOS, still the most fluid and restrained version of Android you can find. A little more complicated, dust and water resistant certification. I'll give you the scoop on that and the battery and camera, after a word from my sponsor about one of the first games you might wanna play on this thing. Gotta be honest with you guys I'm not typically the type for fantasy role-playing games, but today's sponsor combines great graphics with incredible vocal performances, and makes it so easy to use that even I got the hang of it. This is Raid: Shadow Legends and if you're into fantasy combat it's probably right up your alley. See, you don't have to play a cutesy game to customize your characters. I'm partial to this Dark Elf, because he kinda looks like a Romulan and I'm into that. But whichever way you go, your journey is a fully voiced battle campaign, with modes that let you fight a common enemy together, or go PVP against other players, and in my case lose badly. But don't worry if they're better than you to begin with, each time you play you pick up daily rewards that make you stronger. With mobile and desktop versions it's a great game. And there's a special offer for new players, join at the link below and you'll get a 100,000 silver, 50 gems, one energy refill, and one free Champion Adjudicator. Act fast though, this offer is only good for the 30 days after this video goes live. Find it at the link in the description. For years, one of the ways OnePlus saved money was by not paying for its phones to undergo the costly testing that certifies them IP 68 dust and water resistant. Well, the OnePlus 8 finally changes that. Now, I'm told that only the ones being sold by T-Mobile and Verizon have actually received the IP 68 certification. But I'm also told the hardware of the unlocked model is virtually identical. That's confusing, but it's good to see OnePlus finally fill this gap regardless. Speaking of gaps, how about the one that's always been there in terms of camera quality. Well, we've got some feature bumps. Not just 4K video, but now 4K video with stabilization. And while it's still noisier footage than I'd like, at least it's now exported in an easier to work with color space. See my 7T review for more on that. For still shots you've got the same 48-megapixel primary sensor and then identically spec 16-megapixel ultra-wide as that 7T. But the telephoto is gone, replaced by a dedicated macro shooter. Now, I love my extreme close-ups, but the resolution on that macro is very low. And last year's 7T could already shoot in macro using another method. So we can't really call this an upgrade, especially when you look at some of those rough zoom shots. On a whole the camera is fine, but if you really care about your photos this isn't the phone for you. You should either spring for the OnePlus 8 Pro, or save a ton of money and get a Pixel 3a. Just like with the OnePlus 7T, I found I can squeeze two days out of the OnePlus 8, with the kind of light use that comes from not being able to leave your house. Be advised, my review sample is an unlocked version, so those of you buying from a carrier should expect different results, particularly if you use this on Verizon 5G. And Warp Charging delivers on its name. From empty to 50% in 22 minutes. Eight, that's more than this phone's model number, it's how many times I've mentioned its predecessor the 7T in this video, and that should tell you something. When you put that phone in one hand and the eight in the other, it's really hard to see how the OnePlus 8 justifies its $200 premium. It is rare that I advise anyone to buy last year's phone, but if you're buying unlocked you really won't be missing out on much by snapping up a 7T. At the core of it all, things sure haven't changed. You're still getting one of the best Android experiences for less, sometimes hundreds less than the competition. And now, you can get it through two of the nation's three largest carriers. Objectively that's a win, both for OnePlus and American consumers. But with that Google Pixel 3a sold, just owning the Android value conversation and a Pixel 4a and iPhone 9 each on the horizon. Well, while it's never been easier to find a OnePlus phone in the States, it's also never had more potent competition. The OnePlus 8 goes on sale April 29th. If you wanna see what happens when OnePlus pulls out the stops, check out my OnePlus 8 Pro review on my channel. OnePlus did not receive copy approval rights, or an early preview of this video, nor did it pay a fee or provide other compensation in exchange for this coverage. That's how I do all of my reviews folks. Please subscribe, if that's the kind of video you'd like to see more of. Until next time, thanks for watching. And stay mobile my friends. (ethereal music) (singer vocalizing)",
    "transcript_keywords": [
        "OnePlus",
        "phone",
        "OnePlus phones",
        "video",
        "phones",
        "Shadow Legends",
        "price",
        "camera",
        "thing",
        "year",
        "review",
        "Verizon",
        "called",
        "Pro",
        "Pixel",
        "Android",
        "year OnePlus",
        "time OnePlus",
        "day",
        "time"
    ],
    "transcript_entity_values": [
        "200",
        "this Dark Elf",
        "a ton",
        "eight",
        "865",
        "last year's",
        "7",
        "48-megapixel",
        "OnePlus 8 Pro",
        "Verizon",
        "Qualcomm",
        "T-Mobile",
        "April 29th",
        "Apple",
        "IP",
        "16-megapixel",
        "6.5 inch",
        "American",
        "States",
        "millimeter",
        "90",
        "50",
        "America",
        "two days",
        "hundreds",
        "OnePlus",
        "OnePlus 7T.",
        "about one",
        "Hertz",
        "OnePlus",
        "today",
        "Snapdragon",
        "daily",
        "first",
        "100,000",
        "Eight",
        "50%",
        "two",
        "TLDR",
        "Champion Adjudicator",
        "4",
        "22 minutes",
        "4a",
        "OnePlus 7T",
        "an optimistic day",
        "years",
        "OnePlus 8",
        "5",
        "a darker day",
        "Google Pixel 3a",
        "700",
        "100",
        "the 30 days",
        "Verizon",
        "nearly two weeks",
        "68",
        "three",
        "T-Mobile's",
        "one",
        "Android"
    ],
    "transcript_entity_types": [
        "MONEY",
        "WORK_OF_ART",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "NORP",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "GPE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG"
    ]
}