{
    "id": "i77C31yv5O4",
    "title": "I tried 3D Printing with REAL GOLD......",
    "channel": "JerryRigEverything",
    "channel_id": "UCWFKCr40YwOZQx8FHU_ZqqQ",
    "subscriber_count": 8910000,
    "upload_date": "2023-08-01T15:14:18Z",
    "video_url": "https://www.youtube.com/watch?v=i77C31yv5O4",
    "category": "Howto & Style",
    "tags": [
        "3D printing",
        "best 3D printer",
        "Cheap 3D printer",
        "Inexpensive 3d printer",
        "best 3d printer for beginners",
        "best 3d printer for gift",
        "ankermake M5",
        "ankermake M5C",
        "wood filament",
        "iron filament",
        "copper filament",
        "gold filament",
        "real gold 3d Printer"
    ],
    "views": 441085,
    "likes": 19801,
    "comments_count": 14325,
    "description": "I tried 3D printing with REAL 14K Gold Dust, copper, iron and even wood.  Get $30/ 30/ 30 off with the code M5CJRE30 on M5C Order on Amazon:  Order on Ankermake:  AnkerMake M5C is a 3D printer designed to easily customize functions in one click. It is available for purchase for $399 in the U.S. Pre-sale availability starts today in the UK (399) and in the EU (449), as well. Huge thanks to AnkerMake for sponsoring this video. Previously 3D printing has been pretty difficult. Setting up a machine, leveling a print bed... but now - with the new 399 dollar AnkerMake M5C joining the fray with ultra fast prints and an auto leveling bed... a first timer can be up and running in as little as 10 minutes. I think this AnkerMake M5C is the best 3D printer for beginners. (or for anyone who loves making stuff, but hates setting things up...) While the gold filament failed - we did manage to 3D print with Copper, Iron, and even Wood filaments. It turned out better than I thought!   Get my JerryRig Razor knife HERE:   Follow me for updates!  Instagram:   Facebook:   Twitter:    LARGE tool kit:   Travel Tool Kit:   Mega Tool Kit:   Plastic Pry tools:   Metal phone opening tool:   The camera I used to film this video:  (GH6   The Lens I used for this video:   Wide angle lens:   And this Metabones adapter:   This is the drone I use:    TO SEND ME STUFF: See my P.O. Box on my 'About page':   JerryRigEverything assumes no liability for property damage or injury incurred as a result of any of the information contained in this video. JerryRigEverything recommends safe practices when working with power tools, automotive lifts, lifting tools, jack stands, electrical equipment, blunt instruments, chemicals, lubricants, expensive electronics, or any other tools or equipment seen or implied in this video. Due to factors beyond the control of JerryRigEverything, no information contained in this video shall create any express or implied warranty or guarantee of any particular result. Any injury, damage or loss that may result from improper use of these tools, equipment, or the information contained in this video is the sole responsibility of the user and not JerryRigEverything. Only attempt your own repairs if you can accept personal responsibility for the results, whether they are good or bad.",
    "description_links": [
        "https://ankermake.club/8110VDJA",
        "https://ankermake.club/8110VwxG",
        "https://www.jerryrigknife.com/",
        "http://instagram.com/zacksjerryrig",
        "http://on.fb.me/1U4bQqv",
        "https://twitter.com/ZacksJerryRig",
        "http://amzn.to/2DURcr7",
        "https://amzn.to/30LKXOY",
        "https://amzn.to/2OwequL",
        "http://amzn.to/1Tu57pI",
        "http://amzn.to/1WdOFv0",
        "http://amzn.to/2p7GtkX",
        "https://amzn.to/3LyfW8d)",
        "http://amzn.to/1QOXDw2",
        "http://amzn.to/2qiYM4u",
        "http://amzn.to/2iZ67Ty",
        "https://amzn.to/3JEuTXs",
        "https://www.youtube.com/@JerryRigEverything/about"
    ],
    "transcript": "The AnkerMake 3D printer has been described as an ultrafast machine that just works. Today we're going to put that to the test. AnkerMake sent me out a brand new $399 dollar M5C. And today we're going to put it to the test with the weirdest filaments that I could find, like iron impregnated, copper laden, and even wood. I tried making my own 3D printer filament out of real gold, but it didn't work. We almost have everything figured out. We have the high torque motor, an auger where the pellets go in and get extruded out of the hot end with a heatsink and a fan. We were super close, but not good enough to put gold inside. Apparently making your own filament is a much more complicated science than we anticipated. However, my loss is your gain since now we have $500 dollars worth of this gold dust that we can give away at the end of the video...after we finish testing out the rest of these filaments. Let's get started. [Intro] I've been tinkering with 3D printers for the last 10 years. And the hardest part with all of my previous machines has been the setup. With this new AnkerMake M5C though, within 10 minutes we're ready to start printing. The gantry fits right down into the aluminum die cast base, which helps keep the machine stable as the all metal print head zips around at super high speeds. And this printer has some ridiculously high speeds. Here in my shop we've been prototyping inexpensive manual rigid wheelchairs. And instead of paying thousands of dollars early on for plastic end cap molds for the aluminum tubes, we just 3D print them for pennies. Extremely helpful and efficient as we fine tune our design. The AnkerMake M5C moves at 500 millimeters a second, and accelerates at 5,000 - 80% faster than other 3D printers on the market. Seeing the printer move in real time is mind boggling. Speed is important for us because every second and every penny counts when we're trying to save money and time, making inexpensive prototypes. Speaking of pennies, let's see what happens when we feed the M5C with copper impregnated filament. If we take a look at the copper under a digital microscope we can see that it looks quite a bit more textured and shiney than a normal plastic filament. Little fragments of metal in there. We'll have to oxidize it later to differentiate between the materials. We'll make a Statue of Liberty. Starting a new 3D print is incredibly easy. I can take a 3D model, slice the G-code to a USB stick, and with one singular button get a three-dimensional shape turned into reality. This also works with the mobile app and I'll show that more in a second. As you might already know, the real Statue of Liberty over in New York City is made from copper. Copper is usually a nice reddish brown color, however when it's exposed to the outside elements and oxidizes, the outer layer turns a shade of green, which is the current color of Lady Liberty as we know her today. If we take some normal table salt and dissolve it in vinegar and spritz it on her to speed up the oxidation of the metals inside the filament, we can make that oxidation happen a little bit quicker. Looking at the 3D print through a microscope before the oxidation we can see that the print is extremely accurate. AnkerMake says the M5C is to precise within 0.1 millimeters. And just like a normal 3D printer, the nozzles are interchangeable depending on how thick or exact you want your layers. [Laughing] That is crazy. I had my doubts but that copper is hard core oxidized. That is amazing. And jumping in to take a look at that oxidation. Wow. Looks almost bluish under the microscope, but that's definitely green on Lady Liberty. There you have it real copper inside of 3D printing filament, oxidizing right where the salt comes in contact with the layers. Things have changed quite a lot in the last few years, and this is extremely impressive for a $399 dollar printer. Taking a look at the iron. Wow. Drying out the iron impregnated filament. I never thought I'd have to use slow motion footage to show off a 3D printer, but if we slow it down to a speed that the human eye can see, we can see the molten filament leaving the metal nozzle making contact with the print and through some pretty complex algorithms. The fans rapidly cool it to just the right temperature so it sticks to the print without warping or making spaghetti. Personally I leave on the 49 point self auto leveling feature just as an extra safety factor to make sure the print doesn't fail. And the 300 degrees celsius hot end works great for PLA, TPU, PETG, ABS, PA, and PC, making this printer pretty C-double O - L. Taking a look at the iron impregnated filament we can see once again that the print is very clean, even with metal inside. And after we oxidize it with the same vinegar and salt concoction...this is surprisingly heavy...probably because it has metal in it. We can see that the metal is definitely behaving differently than the plastic it's embedded in. A very difficult filament to print with and the AnkerMake M5C is handling it just fine. So cool. The copper definitely looks cooler than the iron. Very impressive. Now for 3D printing with wood. Again, just like with the copper and iron filament, the wood coming out of our hot end makes up about 20 or 30 percent of the filament enough to be sanded and stained like wood. And also enough to smell like freshly cut sawdust as it's making our box to store the gold dust...which once again is printing out surprisingly fast. With the print finished we can magnetically pop off the printing plate and get our real, genuine 14 karat gold dust situated within the container for safe keeping. The AnkerMake M5C does have a singular start and pause button on the front surface, but no display. All of the controlling for the printer happens within the mobile app or from your computer. And there you have it, a 3D printed wooden box with real gold inside a treasure chest, if you will. I'll be giving this away, It's worth about $500 dollars, to someone in the comments. Leave a comment about anything and I'll pick a random winner in a few days. And the final verdict is the AnkerMake M5C is a super inexpensive ultra fast 3D printer that just works and can handle some really weird stuff. I'll leave a link down in the description if you want to grab one for yourself. And thanks a ton for watching. I'll see you around. Oh the pain! Agony! Aw, but the shot looks so good. And now we're ready to print.",
    "transcript_keywords": [
        "filament",
        "print",
        "printer",
        "copper",
        "AnkerMake",
        "making",
        "iron impregnated filament",
        "impregnated filament",
        "metal",
        "iron",
        "gold",
        "real",
        "Liberty",
        "Lady Liberty",
        "end",
        "inside",
        "printing",
        "iron impregnated",
        "copper impregnated filament",
        "Statue of Liberty"
    ],
    "transcript_entity_values": [
        "0.1 millimeters",
        "10 minutes",
        "49",
        "a few days",
        "three",
        "Lady Liberty",
        "the last few years",
        "thousands of dollars",
        "TPU",
        "$500 dollars",
        "5,000 - 80%",
        "300 degrees celsius",
        "about $500 dollars",
        "PLA",
        "a Statue of Liberty",
        "second",
        "today",
        "the last 10 years",
        "Today",
        "500 millimeters",
        "$399 dollar",
        "about 20",
        "every penny",
        "USB",
        "30 percent",
        "M5C.",
        "14",
        "one",
        "New York City"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "ORG",
        "MONEY",
        "PERCENT",
        "QUANTITY",
        "MONEY",
        "ORG",
        "FAC",
        "ORDINAL",
        "DATE",
        "DATE",
        "DATE",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERCENT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "GPE"
    ]
}