{
    "id": "I_ah2lS-xVQ",
    "title": "Samsung Galaxy S21 Ultra Review: Moonshot",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2021-01-21T16:01:22Z",
    "video_url": "https://www.youtube.com/watch?v=I_ah2lS-xVQ",
    "category": "Science & Technology",
    "tags": [
        "galaxy s21 review",
        "galaxy s21 ultra review",
        "samsung ultra review",
        "samsung ultra 2021",
        "best smartphone 2021",
        "best phone 2021",
        "best camera phone",
        "best phone camera",
        "mrmobile"
    ],
    "views": 632550,
    "likes": 21805,
    "comments_count": 1758,
    "description": "Sponsored by dbrand. Skin your Galaxy S21 Ultra (and all your devices) here:    [SAMSUNG GALAXY S21 ULTRA REVIEW]  Fifteen years ago, when a then-nascent Samsung wanted to upset the status quo, it launched a family of phones bearing the brand name Ultra. Those being the days when form factors were in flux (and phones were more fun) maybe its no surprise that Samsungs 2020 resurrection of the designation fell a little flat. To me, last years Galaxy S20 Ultra was too big, too boring, and too blurry  with a camera system whose focus issues wouldnt be corrected until the Galaxy Note 20 Ultra hit the scene last summer.  Well, Ive never been happier to say that weve entered a new year  and like clockwork, Samsung is here with a new phone to help kick it off. While the Galaxy S21 Ultra might feature a familiar face, it packs new features that will send some over the moon  and sacrifices that will leave others foaming at the mouth. Join me to see some of the most impressive mobile photography this side of Huawei  and some of the most polarizing feature plucking seen on a Samsung since 2015  in MrMobiles Samsung Galaxy S21 Ultra Review!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S GALAXY S21 ULTRA REVIEW]  MrMobile's Galaxy S21 Ultra Review was produced following seven days with a Samsung Galaxy S21 Ultra review sample on loan from Samsung. Preproduction device running pre-release software. Tested on Verizon 4G and 5G in Brooklyn and New York City, NY. MrMobile does not produce reviews paid for by the subjects of those reviews; Samsung did not pay a fee or otherwise offer compensation in exchange for this coverage, and no company was given a preview of the content or offered copy approval rights concerning same. The lone sponsor of this video is dbrand.   [LINKS]  Samsung Galaxy S21 Ultra Real World Test [TheUnlockr]:   Samsung Galaxy S21 Ultra Review [Android Authority]:   Samsung Galaxy S21 Ultra Review [Pocketnow]:  microSD Returns to the Samsung Galaxy S7 Heres Why It Was Removed In The First Place [Medium]:   SAMSUNG QUIETLY REMOVES ADS MOCKING APPLE FOR REMOVING HEADPHONE JACK AFTER IT DOES THE SAME FOR GALAXY NOTE 10 [The Independent]:   Samsung deletes post mocking Apples charger removal now that it plans to do the same thing [9to5Google]:   Samsung used to mock Apple as idiots, now it hides the evidence [ZDNet]:   //  Device wallpapers by Marco Miranda [Patreon]:   Select elements of MrMobiles wardrobe provided by Volante Design:  Starfleet 2256:  Starfleet 2369: Volante Masks:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #galaxys21ultra #galaxys21 #samsung #galaxy #tech #smartphone",
    "description_links": [
        "https://dbrand.com/mrmobile-s21-ultra",
        "https://www.youtube.com/channel/UCSOp...",
        "https://youtu.be/5cWA9sxtDt8",
        "https://youtu.be/SyXDG0yF0S4",
        "https://medium.com/chip-monks/microsd-returns-to-the-samsung-galaxy-s7-heres-why-it-was-removed-in-the-first-place-f783d732cfba",
        "https://www.independent.co.uk/life-style/gadgets-and-tech/news/samsung-galaxy-note-10-headphone-jack-apple-ad-a9054256.html",
        "https://9to5google.com/2020/12/23/samsung-apple-charger-removal-post/",
        "https://www.zdnet.com/article/samsung-used-to-mock-apple-as-idiots-now-it-hides-the-evidence/",
        "http://patreon.com/lmarcomiranda",
        "http://bit.ly/2W8swBA",
        "https://bit.ly/3njp04T",
        "https://bit.ly/2INEQpp",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- 15 years ago when a then nascent Samsung wanted to upset the status quo, it launched a family of phones bearing the brand name Ultra. Those being the days when form factors were in flux and phones were more fun. Maybe it's no surprise that Samsung's 2020 resurrection of the designation fell a little flat. To me, the galaxy S 20 Ultra was too big, too boring and too blurry, with a camera system whose focus issues wouldn't be corrected until the Note 20 Ultra hit the scene last summer. Well, I've never been happier to say that we've entered a new year and like clockwork, Samsung is here with a new phone to help launch it. While the Galaxy S 21 Ultra might feature a familiar face, it packs new features that will send some over the moon, and it brings sacrifices that will leave others foaming at the mouth. (upbeat music) As you can see, there's no quantum leap in aesthetics this year from the S 21 to the plus to the Ultra. You're looking at a rounded rectangle, with a prominent camera protuberance. Welcome to the last 10 years. That said, the new satin finish on the Gorilla Glass Victus backplate is worlds better than last year's glossy smudge sheet. And I like what Samsung has done to integrate the optics module, blending it into the phone's lines rather than banishing it to its own isolated camera crater. That's easier to appreciate on the smaller S 21 with it's more playful paint job, as usual the color options on the higher end are less exotic. If you, like me, feel that a phone this fitted out deserves a flashy finish to match, dip on over to my sponsor dbrand. They probably didn't intend for me to mix and match their matrix and swarmed skins like this, but in my book, it's the most interesting way to matte black everything. dbrand your device at the link in the description below. Before we talk about the bulk of the Ultra's updates inside that camera crater, there are some small but important changes to the device itself. The ultrasonic fingerprint sensor beneath the Victus cover glass is nearly twice as large as last year, which means it's finally just as consistent and quick as the best optical scanners. The display has shrunk by a 10th of an inch, which you won't notice, and it can now shine it up to 1500 nits, which you might notice as the days start to get longer. That brightness boost is one of several speck bumps that are all as expected from the Qualcomm Snapdragon 888 on US units like my review sample, to Samsung's own Exynos 2100 in other regions, all the way down to the big battery and fast but not as fast as they used to be charging options. There's nothing earth shattering in either category, as with most phones that are this big, the Ultra lasts all day and then some, unless you're recording a ton of video, like I'm about to show you, in which case it'll hold up to about five hours of near constant use at max brightness, recording 4K at 60 FPS. Now most users won't be doing that so most users can count on having a little over 50% left in the tank when they turn in after a 16 hour day, as I did on the night before this review went to production. Probably the biggest story on the spec sheet is what for the first time since 2015 is not there. Seven years ago Samsung tried stripping the venerable micro SD card slot from its Galaxy S6. At the time reviewing the phone for Pocketnow I was unfazed by the change. And with the S6 available with up to 128 gigs of admittedly pricey, onboard storage, I don't think many people will miss micro SD. But apparently I was in the minority. So vocal was the feedback from those who prefer their memory removable, that the very next year, Samsung reinstated the vaunted micro SD slot and it'ss stayed there on every Galaxy S since, until now. (upbeat music) Now personally not much has changed since 2015. This still doesn't affect me practically because everything from my Google Photos backups to my Spotify playlists are streamed to and from the cloud. And when I do need to transfer files locally, large files, I use a USB thumb drive for that. But there are reasons, good reasons that some people are upset by this. The first reason is economics. It's always been cheaper to buy a micro SD card than to upgrade to the next level of internal storage. Another reason is flexibility. If you wanted to, you could carry around terabytes of storage to swap in and out of your phone without even feeling it in your pocket. And then there's the principle of the thing. There's no polite way to say it, when it comes to advertising, Samsung is probably the phone world's biggest hypocrite. It ruthlessly made fun of Apple for removing the headphone Jack from the iPhone, until it did exactly the same thing on its own phones. It made fun of Apple for removing the charger from iPhone boxes, until it did exactly the same thing with the S 21. And another feature that for generations has had Samsung apart is MST, which lets you pay with your phone even on older magnetic Stripe credit card terminals, well, at least in the US that's gone now too rendering Samsung Pay just another redundant feature with an annoying shortcut that gets in the way of Android gestures. It's back to Google Pay for me. Look, it's not that I'm against streamlining. It's just that for the past decade, Samsung has built much of its mobile identity on being a kind of anti Apple by giving you more for your money. When it comes to the company's foldables, which truly are groundbreaking devices, that's still true. But over here on the mainstream S line, I dunno it just seems like Samsung has decided that it's easier to ape Apple, and delete the evidence that ever stood for anything more. Fortunately, for Samsung, I very much doubt that the broader audience will care all that much, particularly once they see what the Ultra's five cameras can do. To put them through their paces, I met up with two Davids and a Jaime for a walking tour of the city, just across the river. (camera lens shutters) (upbeat music) Are we gonna ride on a boat today? Yes, say yes. Just say yes. - It's cold, it's winter, but sure. (boat engine revving) (upbeat music) - As you can see, this is another case of iteration. Now, while I love that Samsung has improved the video modes available with 4K 60 on all primary cameras and the director mode feature that lets you shoot with front and back cameras at once, I was a bit let down by the actual footage. I mean it's stable and it's colorful and it's crisp and the audio is surprisingly excellent. That's the kind of drink I'm here for. But the phone often takes the crispness to the point of over sharpening, which you can see on hard edges that appear pixelated while textured surfaces exhibit a distracting, buzzing, moire effect. I also think there's more digital noise in even well lit shots than I expected. Maybe it's a case of heightened expectations given how impressed I've been with the Note 20 Ultra's video last summer, or maybe shooting in the city I'm just seeing more textured surfaces than on my usually rural road trip reviews. And if you're like most folks and you spend your time shooting stills, you'll not find a more versatile camera phone this side of Huawei. Samsung gave you almost every tool imaginable here, flanking a giant primary sensor with 120 degree ultra wide, a 3 X and a 10 X telephoto, two separate cameras. You have so many options for composition here. You can snap an idealized golden hour photo of the city so nice they named it twice. Or you can paint an authentic picture of Brooklyn Brownfield remediation all without moving an inch from the Superfund site, you're standing on. You can press the ultra wide in to service as a macro lens to get a closer look at the past or the future. And even when you push the magnification past the optical limit of the 10 X lens Samsung's hybrid cropping keeps the image fairly clean all the way up to about 30 X light permitting. And the improved stabilization means you can get well into the 70 to 80 X region without the need for a tripod. And if you do happen to tote one of those around nothing, not even the moon is out of your reach. - You guys sure talk a lot about that move. - Yes - You gotta a problem with that? - Come on, let's go swimming. - I'm gonna let those dual speakers and this screen ease us into the outro, because they're the kind of foundational elements that make this phone the best for bingeing TV outside the Galaxy Fold and LG Wing, of course. I talked about Samsung's TV plus on my review of the company's frame television, it's literally free TV, with no subscription fees or sign in required and it's the first feature to make the left homescreen on Samsung phones legitimately useful. And if you don't like it, for the first time ever that I recall on a Samsung phone, you can swap it for the Google feed. In the past that would have been one of the first things I did on this phone, but now that I have free TV, just a swipe away at all times, it's a little tougher. And rounding out the added features, yes, the Ultra works with Samsung's S pen. Though you need to buy that, and the case to accommodate it separately. And the phone also supports ultra wide band, No, not the Verizon 5G branding but the new close range radio protocol that powers Samsung's smart tag trackers and as it matures will let you do things like unlock your car, your home, et cetera. And finally, yes, it works well as a phone in both the earpiece and speaker for notes. And if you're as fond of digging in the dialer for details as I am, you'll find a little extra with the 21, call to call background, an animated accompaniment to dialing or getting dialed that can take the form of traditional to well, terrible. Point is, it's nice to see a manufacturer putting a little extra thought into something as traditionally overlooked as the phone app. The Galaxy S 21 ultra starts at 1199, still well into the four figures, but a full $200 cheaper than the Galaxy S 20 Ultra debuted at. And that's before trade-ins and carrier incentives. Hardcore enthusiasts may never get past that micro SD betrayal. Those with smaller pockets literally and figuratively, will likely find the smaller S 21 a better fit, or it's cheaper cousin, the S 20 FE. And I'll still encourage anyone spending four figures, to at least consider the Galaxy Fold too. But if you want to stick with the slabs, and you want the most versatile camera on a smartphone and you're comfortable with its compromises the Galaxy S21 Ultra is a potent package. This review was produced following seven days with a Samsung Galaxy S 21 Ultra review sample provided by Samsung. As always Samsung was given no editorial input, copy approval rights, or even an early preview of this video, Mr. Mobile works for you and not the manufacturers. Until next time, thanks for watching and remember to stay safe and mask up while you stay mobile, my friends. (upbeat music)",
    "transcript_keywords": [
        "Samsung",
        "Ultra",
        "phone",
        "galaxy",
        "nascent Samsung wanted",
        "Samsung Galaxy",
        "nascent Samsung",
        "Samsung phones",
        "years ago Samsung",
        "Samsung phones legitimately",
        "ultra wide",
        "phones",
        "Galaxy Fold",
        "status quo",
        "launched a family",
        "bearing the brand",
        "phones bearing",
        "camera",
        "year",
        "Samsung Pay"
    ],
    "transcript_entity_values": [
        "last year's",
        "Ultra",
        "LG Wing",
        "all day",
        "Verizon 5",
        "the Galaxy S21 Ultra",
        "21",
        "miss micro SD",
        "Ultra",
        "15 years ago",
        "10 X lens",
        "this year",
        "Samsung Galaxy S 21",
        "iPhone",
        "max",
        "10th",
        "4",
        "two",
        "Seven years ago",
        "one",
        "Android",
        "10 X",
        "seven days",
        "the Galaxy Fold",
        "Qualcomm",
        "the night",
        "Victus",
        "Samsung",
        "Spotify",
        "20",
        "Galaxy S6",
        "Google",
        "S6",
        "Galaxy S",
        "Huawei",
        "Brooklyn Brownfield",
        "128",
        "1500",
        "Jaime",
        "the last 10 years",
        "60 FPS",
        "winter",
        "Apple",
        "four",
        "S 21",
        "the days",
        "the S 20 FE",
        "a new year",
        "1199",
        "3 X",
        "the Galaxy Fold",
        "SD",
        "120 degree",
        "2020",
        "the S 21",
        "16 hour",
        "a ton",
        "200",
        "the past decade",
        "Jack",
        "Pocketnow",
        "S 20",
        "a little over 50%",
        "70 to 80",
        "last year",
        "USB",
        "about 30",
        "Mobile",
        "Superfund",
        "today",
        "US",
        "first",
        "five",
        "about five hours",
        "next year",
        "last summer",
        "micro SD",
        "2015",
        "around terabytes",
        "Davids"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "LAW",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "DATE",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "DATE",
        "MONEY",
        "DATE",
        "ORG",
        "CARDINAL",
        "EVENT",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "ORG",
        "QUANTITY",
        "DATE",
        "EVENT",
        "TIME",
        "QUANTITY",
        "MONEY",
        "DATE",
        "PERSON",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "LAW",
        "DATE",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "TIME",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON"
    ]
}