{
    "id": "i_VTyG1Pcas",
    "title": "Apple's New XDR Display - Just Hype?",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-11-19T19:02:30Z",
    "video_url": "https://www.youtube.com/watch?v=i_VTyG1Pcas",
    "category": "Science & Technology",
    "tags": [],
    "views": 337935,
    "likes": 15621,
    "comments_count": 669,
    "description": "Get 15% off MeisterTask Pro & Business with coupon code: TECHQUICKIE15 Learn more at:   What does \"Liquid Retina XDR\" mean and does it actually offer anything exciting or useful, or is it just Apple marketing fluff?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Secretlabs Gaming Chairs:  Nerd or Die Stream Overlays:  Green Man Gaming  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  TechLinked:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://bit.ly/3FA6KN4",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/SecretlabLTT",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/GMGLTT",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Whether you love Apple, hate them or feel nothing at all, they do a great job of capturing the imagination of would-be tech buyers with sexy sounding branding like, Liquid Retina XDR. One of the major features that they're pushing with their new MacBook Pro lineup. But what the heck does Liquid Retina XDR mean? Is it just more marketing fluff, or is there more to it? Let's start by quickly talking about what a retina display is. You probably first heard the term quite a while ago, as Apple's been using it since the days of the iPhone 4. And all it means is that the display has a pixel density that is high enough, that you can't make out individual pixels at a normal viewing distance. So really, just about any display is a retina display, if you're sitting far enough away from it. Though of course, pixel density is still important if you're holding a phone close to your face or sitting arms-length away from your laptop. Apple then started using the term liquid retina in 2018 with the release of the iPhone 10R. But the iPhone 10R was actually a lower priced model within the iPhone 10 lineup. So, liquid retina was just a cool way of saying that the phone had a relatively bog standard liquid crystal or LCD screen. Similar to what you'd find in completely average TVs or monitors. So, is the new Liquid Retina XDR on the 2021 MacBook Pros and iPad Pros, just more marketing hype? It turns out the answer is, not quite. The XDR stands for eXtreme Dynamic Range. And after we get through the mandatory eye roll over the use of X for extreme, it turns out that Apple has put some really interesting tech into these new displays, for deeper blacks and crisper colors. MeisterTask is an easy to use intuitive visual collaboration tool for task and project management. You can get organized with a simple Kanban style overview of all of your tasks and users are able to collaborate and work together more effectively, as all files, information and documents related to the task can be stored in one centralized place. You can add as many users to your projects as you need, and naturally interact with them using comments, mentions and reactions. So, align your team like never before with Meistertask, using the link in the video description. Probably the most important improvement Apple brought to Liquid Retina XDR, is the array of mini LEDs that backlight the display. All LCD screens need a backlight to function, but nicer displays tend to have more and brighter LEDs for their backlights, that allow finer control over smaller areas of the screen. This allows them to be made dimmer to deepen shadows or to be made brighter, to make bright details pop. The Liquid Retina XDR display in the iPad Pro has more than 10,000 mini LEDs backlighting it, organized into nearly 2,600 individual dimming zones. And this is all fit into a relatively small tablet screen. Meaning, that Apple had to custom engineer its own manufacturing methods, because packing so many tiny LEDs into small space, is a pretty delicate operation. But the result is a display that can, for supported content, get to a thousand nits across the screen, and 1600 nits in smaller areas. That's a high number for any display. But it's especially impressive for a mobile device that has to run on battery. And it's something that might be a selling point for folks who want to watch HDR content on their laptop or tablet, assuming they have deep enough pockets. But mini led, as cool as it is, still isn't quite as good in terms of contrast, as an OLED display, which has individual pixels that produce their own light. And rumors are flying, that Apple may transition to OLED for some of its future iPad models, like they've already done on the iPhone. But considering that OLED is an expensive, difficult to produce technology that typically can't get as bright as mini led, not to mention the fact that OLEDs can suffer from burning if you leave UI elements on the screen for long enough, we might be seeing Liquid Retina XDR and it's mini LEDs on Apple products for quite a while. Maybe they'll sell it to us with a less gimmicky name down the road, but I wouldn't really bet on it. Thanks for watching. Like, dislike, check out our other videos. Leave a comment if you have a suggestion for a future Fast As Possible, and do not forget to subscribe.",
    "transcript_keywords": [
        "Liquid Retina XDR",
        "Liquid Retina",
        "Retina XDR",
        "sexy sounding branding",
        "Retina",
        "Retina XDR display",
        "Liquid",
        "XDR",
        "Apple",
        "term liquid retina",
        "wouldbe tech buyers",
        "display",
        "retina display",
        "great job",
        "job of capturing",
        "capturing the imagination",
        "imagination of wouldbe",
        "buyers with sexy",
        "sexy sounding",
        "sounding branding"
    ],
    "transcript_entity_values": [
        "MacBook Pros",
        "iPad",
        "MeisterTask",
        "Liquid Retina XDR",
        "thousand",
        "Liquid Retina XDR",
        "One",
        "one",
        "the iPad Pro",
        "iPhone",
        "2018",
        "the days",
        "2021",
        "Kanban",
        "Meistertask",
        "first",
        "iPad Pros",
        "XDR",
        "more than 10,000",
        "nearly 2,600",
        "LCD",
        "MacBook Pro",
        "Apple",
        "UI",
        "1600"
    ],
    "transcript_entity_types": [
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL"
    ]
}