{
    "id": "IawfrWLDN4U",
    "title": "The God of Computer Coolers - 5000W Industrial Chiller",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-03-08T18:55:38Z",
    "video_url": "https://www.youtube.com/watch?v=IawfrWLDN4U",
    "category": "Science & Technology",
    "tags": [
        "Industrial Chiller",
        "5000W Chiller",
        "PC Chiller"
    ],
    "views": 2394180,
    "likes": 87859,
    "comments_count": 3770,
    "description": "Check out Goliath today using the link below and save 20% today:   Create your build at   It is nearly impossible to cool Intels 13th gen CPUs.. so we got a 5000W industrial chiller!  Discuss on the forum:   Check out the Thermo Scientific NESLab ThermoFlex 5000 Chiller:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - Nothing can cool the i9-13900K 1:10 - Build Redux! 1:15 - How we got a 5000W Chiller 2:16 - Opening it up 4:02 - Positive Displacement Pump 5:45 - Flushing the Chiller 9:06 - Test loop 11:21 - Testing with Computer 13:19 - Other potential uses 14:20 - Overclocking 16:59 - Goliath Technologies 17:55 - Outro",
    "description_links": [
        "https://lmg.gg/Goliath-Technologies",
        "https://www.buildredux.com/linus",
        "https://linustechtips.com/topic/1492779-the-god-of-computer-coolers/",
        "https://lmg.gg/7IIR9",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- When I was a kid, this is all it took to cool a computer. Then came this, this and finally, oh my goodness. Intel succumbed to madness and gave us the 13900K, a CPU that cannot be tamed by any cooler. Challenge accepted. While most people would think it's pretty stupid to spend more on your cooling system than you did on your computer, most people are not these guys. Between the two of us, we've built not one, not two, but four separate water chillers. And this one is bigger than all of them combined. Meet, the chill pocalypse. A 5,000 watt beast that was designed to cool industrial lasers. This is one of our rare opportunities to use purpose-built equipment instead of just janking it with stuff that we get from Princess Auto. So we're gonna be getting into the meat of how this thing works, and of course, we'll be hooking it up to Intel's latest compact furnace unit to see if even this is enough. We'll laugh, we'll cry. We might even leak some coolant on the floor if you know what I mean. And we'll also tell you about our sponsor. Build Redux. Looking to level up your gaming experience? Build Redux is here to help. They'll create a custom gaming PC that is tailored to the specs you set out while offering competitive pricing compared to building your own. Follow the link below and start building your dream gaming rig today. While I could have paid 15,000 U.S. dollars to an industrial equipment supplier for this Thermo Flex5000, the story of how we got our hands on this chiller is actually a lot more interesting than that. It comes from John, an integration engineer and absolute legend who works in a large industrial plant. This chiller actually spent several years cooling a 5,000 watt fiber laser until recently it started throwing up errors. Except that after they replaced it with a new one, a kink was found in the hose, meaning this one was actually totally fine the whole time. But it was cheaper to just leave the new one in service and scrap this boy. So our hero, John, took it home to use on a CNC machine except the plan didn't work out, so he gave it to us so we could torture some computers. Huge thanks, John, because there's absolutely no way we would've bought one of these things new. Let's take a closer look at this baby and talk about some speeds and feats, shall we? Woo, hoo hoo hoo. Look at that. - [Alex] That's fun. - First up, it runs on 208 volt power so we need Alex's sketchy cord. No, not the sketchy cord. Fine. Bring the sketchy cord. And while there are multiple ways to chill water below ambient temperature, we've used evaporative cooling, Peltier cooling in the past. The most efficient is of course, phase change. So down here we find a large compressor, as well as a condenser unit with a fan on it. Yeah, I know, right? - [Alex] It's pretty big. - Look at the size of this condenser. And then, for the cold side, I guess the evaporator is over here embedded in the water tank. That is a smaller water tank than I expected. - [Alex] Yeah, there's a lot of not much in here. - Yeah, I sort of thought like, they boast temperature control of just 0.1 degree Celsius which is super important for lasers where a two degree difference can cause visible bending during an edge. But in order to achieve that, I kind of thought that they would have a very large reservoir so that they wouldn't have to cycle the compressor all that often. But if this had a 5,000 watt load in it with just that much water, I kind of feel like it would be- Oh, you know what? I bet it's one of those more efficient variable compressors like you find on modern AC units. At the cost, of course, that would make sense. This is not okay. I can't believe you still have this. He just made a completely non regulation cord that goes from this to this and just has this tape on it. And then we're just using a standard PC power cord. I hate everything about this. However they do it, it seems to be taken care of by the controller hardware in here where we also find power distribution. Everything we've seen so far is pretty similar to other chillers we've set up in the past. What isn't, is the pump. Now most pumps that you encounter in everyday life are centrifugal pumps, meaning that the water gets sucked into the middle and then an impeller accelerates the fluid toward the outside where it is kind of collected and channeled into an outlet. And it works great in most situations. The problem is that as either the pressure of the system or the viscosity of the fluid increases, the flow rate of a centrifugal pump decreases. - While a normal D5 computer pump can push about 1500 liters of water an hour, once you get up to about five psi, nothing is happening. The positive displacement turbine pump we have in here though, looks a bit more like this. No matter what you do, it's going to give you 1080 liters per hour. - Are you serious? Okay, no, but how does it wake? It looks like a centrifugal pump. Oh, so it just goes at a fixed speed. So if this motor is not completely overwhelmed by whatever it's pumping, it just goes. - [Alex] Yeah. - Period. - These are considered fixed flow rate pumps for the most part until you hit like, you know, horsepower. - And break it. - Or half horsepower. - Wow. What's one of these boys worth? - [Alex] $769. - I can see why companies who make equipment like this are so protective of their trade secrets because it's as simple as opening one up and you're like, yeah, with some sheet metal fabrication and a trip to Home Depot, I could pretty much put this together. - Yeah, this came with an anti corrosive thing in it. It's mostly been drained out, but there might still be some and I looked it up and it will absolutely destroy water blocks. - Okay. - Yeah, we just flush it out. We should be good. - Do not operate chiller unless fluid diffuser is installed. - [Alex] It's in there. - [Linus] What the devil's a fluid diffuser. - [Alex] You know the little sponge that you put in an EK pump? - [Linus] Yeah. - [Alex] It's basically that. - [Linus] So it's just to keep air bubbles from getting drawn back into the pump? - Well, and more so for just like vortex and (bleep)- - Ahhh. - [Alex] Ew. - oh, ew. That stinks. Is that the NALCOOL? Why are you doing that? You're not even wafting. - Well I wanted to see how it smelled. - Oh, did you smell this? - This right here smells pretty bad. It's like, ooh. Ooh, ooh. - I'ma go clean this. Off camera, Alex described the smell as spoiled Vaseline. Yeah. Is this paintbrush in here for scrubbing things or what? Now it is. What are you working on? - I took a little trip to the plumbing supply store to adapt this, which came on it with this down to like some computer tubing. - But these look like gas fittings and in fact they're color coated for gas. - I don't know. That's what was on there. - If it can hold gas, it can hold liquid, right? - [Tynan] Pretty much. - [Linus] You put a lot of Teflon tape on here, Alex. And I don't know if you wrapped it the right way. - [Alex] Yeah, that one's the wrong way. This one's the right way though. - Okay. Well- What are you doing right now? - Well, it's just not working cause I'm on camera and doing things on camera is hard. Is this correct? - [Linus] No. - Righty tighty. Oh yeah, that isn't. Damn it. (both laughing) Here's my thought. Tube into distilled water. - Wait, you haven't checked the manual? Like, you have no idea how to do this? Do you even know how to prime the pump? - We could definitely look at the manual. - Om nom, nom, nom, nom, nom, nom, nom, nom, nom, nom. Well it holds more water than I thought Alex, based on the size of that reservoir. There goes a gallon. - [Alex] Oh. - Oh no, it's not level. The bubble's on the one side, we gotta tip her over. No, I'm kidding, I'm kidding, I'm kidding. You can't do that cause there's a compressor. - Do you know what's fantastic, Linus? We cannot kill ourselves with this, mostly. - [Linus] Oh, that's good. Which way do these twist, clockwise, counterclockwise? Hold on, gimme a sec. Oh no, it just doesn't twist that much. Okay, fine. - Hello? - 16.9 degrees Celsius, nice. What is happening? Whatever it is seems really bad. - Yeah, that seemed really bad. - Whoa. She's going. - [Alex] Alright. Kill it. - I can't, you have it. - All right. It works. Works great. (laughs) - [Spectator] Oh my- - [Linus] Alex. - [Alex] What? - You know that momentum of water will cause that to like go erect, right? - Yes. Clearly. - You have it peeing and you letting it get away from you? - All right, okay. Get out. - [Alex] So what's your plan once you squeegee it? - I was gonna squeegee it out the door, but, okay, I'm just gonna spread it out. - [Alex] Yeah. - I mean that's basically what mopping does anyway. Now, instead of having a small very slippery spot, we have a large, somewhat slippery spot. I understand how the reservoir figured into all this but what I don't understand is why it didn't, oh wait, no, I do understand. - It did suck a bit and then it went back in. - What do we do now? What even is this video? - We have two options depending on what we want to do. I kind of wanna see what happens if we just attach it to like a block like this. But also we just saw what happens when the pump gets run, when the things are closed. It's only half horsepower. It's not as much as I thought. - Oh, okay. The original plan was for us to kink one of these tubes and like blow up the block with the pressure or something like that. We don't really think that's gonna happen, but we're gonna do this anyway because it gives us an opportunity to make sure the system works as we expect and maybe filter out some additional gunk before we hook it up to the Corsair loop over there. Not that that's a particularly smart way to do that, Alex. - It's more fun though. (chuckles) - Wow. Holy crap. She rips dog. - [Alex] Yeah. - And immediately everything is purged of all possible air bubbles because she rips. Did I mention she rips? I feel like this is gonna work. - Yeah, I think this is gonna work really well. - Yeah. Is there a minimum specified load on this thing? Like air conditioner units, for example, are expected to have a certain duty cycle. They're expected to turn on once in a while. Or like a car that sits in storage for 10 years, for example, just cause it has zero miles on it, that's not a good thing. - No, it goes down to zero. It's fine. - Like zero load? - Yeah. - Okay. Why don't we turn it down? She's going. - Okay, yeah it's going. - She's going. You know what? I think it just took a second for the compressor to kick in. She's going fast now. This volume of water, 0.1 of a- She's going now. I can feel the change now. Look at this thing go. Wow, this is unbelievable. - It's working now, that's for sure. - This is getting hard to hold my hand on now. This is getting cold. (chitters) We are below five, not a thing I was expecting to happen. Three degrees. Oh, low temperature. It goes down to three and then it gets mad, and then it turns off. - Yeah, there's a low temperature warning on it. It says in the manual. So it doesn't chill things more. - Yeah but I set it to five. Enter. See it's going down more. - Oh yeah. Why is it going down more? You think it would just stop. - [Spectator] Oh my goodness. - Oh, I'm spilling water. - [Alex] Oh, that's a really bad idea. - No, no, I got this. Hold on. - [Alex] Boom. - Here we go. Oh, geez, Alex. I mean, that computer doesn't need coolant, does it? There's a lot of copper in these blocks right? It can just absorb the heat. - We're going into Windows now. - Yeah. All right, so, I wanna see the temps in Windows. - The fans are getting mad. - Its spinning up the fans. Okay. I just, I wanna see these temps go down. CPU temperature. CPU package, a hundred degrees. Here we go. (laughs) - Yep, that's a pretty good graph. - Yeah, see you later heat. - I actually want to use this in some projects just to get the air out. Just (whooshes). - See you later air. Done. I think I know the answer to this question then, can it tame the 13900K? GPUs at 10 degrees. Nice. - Yep, so what we're looking for is to beat 36,6. 80 degrees was also the maximum recorded temperature before. - Mm-hmm, I don't think we're gonna get- Wow, we're still at 63. - It's the IHS. - Yeah, there's only so much you can do if the bottleneck is the actual dye transferring heat through the copper IHS. Wow. That's a substantial improvement. And that's over a water cooling system that has 320 millimeter fans on it and literally exactly the same block. 620 millimeter fans. - Yes. - And was that even a pre-warmed loop? - Nope. - Wow. There's two ways to look at this then. One, is Intel is actually shipping a CPU that nobody can run at its full potential. Or two, Intel is shipping a CPU that has so much for you to unlock. - Yeah. (chuckles) - That's another angle. I'm just not used to seeing graphs like that. Up, flat, down. No other cooling system we've used behaves like this. They ramp up and they ramp down. This has a ton of potential applications for us. Like imagine we were trying to test something like a water block, for example. Instead of sitting around and waiting for the system to reach equilibrium, we could just run a load, immediately collect the data because we have a fixed coolant temperature so we can calculate the delta, and that's it. Move on to the next thing. Now obviously, out of the box that wouldn't be applicable to PC water cooling because the pumps we use are much weaker. But what we could do is we could create a reservoir that has two inlets and two outlets so it's kind of like a water mixer. And then we could run a regular PC cooling pump on the one side taking this temperature controlled water and this could just circulate water in there. - Anyway, what I want to do is cool the whole lounge. - [Linus] You wanna cool 12 computers with it? - Yes. 5,000 watts of cooling. - I mean, I guess you could. So Cinebench. - [Alex] Ah, these can probably do like five, ah, let's try five, eight. - Wait, so what on earth are you doing? You're setting our best cores to six gigahertz. Oh my god. Alex. She crashed, Alex. - Oh, this has 6,000 mega transfer per second RAM in it, I believe. Memory controllers and overclocking on 13th gen, bad time. Yeah, let's try five, six. - All right, 0.14. Here we go. Some more voltage. Let's just do a quick run. - Huh? This might be a really bad CPU. - Let's try, just not as aggressive again. Apply. Whoa, okay. We're at a hundred degrees, Alex. 38,000 points. - That's not bad. So it's drawing 380 watts. So that would be why we're thermal throttling. - This CPU is literally uncoolable. - We have 39 now. - 39,000 points. I like this thing. - Yeah, this is a good chiller. - Especially relative to our previous attempts. 39,151. - We're thermal throttling, so we essentially just cannot get any more speed by increasing it here cause it's gonna go down anyway. So I think we just reduced the core voltage - [Linus] 0.12. - Okay, score's going up. - 39,785. Man. Now I wanna put one of these in my basement. Just chill the entire rack. I think I might be in love. - [Alex] Yes. Thank you, John. - We're not sending this back? - No, this is just ours. - Thanks, John. Okay, shout out John's side hustle with the light box things. Have you seen that? - [Alex] Yeah, it's really cool. - Yeah, it's pretty cool. Stop. No, no, no, no. Trust your first instinct. No, no. - [Alex] Okay. Okay. - [Linus] No, I don't want it to crash again. Let's give her more juice. I think I know how to use this now. - [Alex] Oh, we broke 40K. - Really? Hey, can we run a GPU load real quick here? I wanna see what the GPU runs at. Is this Forza Horizon 5 running at 130 frames per second at 4K absolutely cranked? - [Alex] Yes. With ray tracing. - 18 degrees on the GPU, which is turboing to 2.73. And to be clear, 4090s pretty much universally have way over specked coolers. This is without us even adjusting anything, which is wild. - [Alex] Oh, we gained four FPS. - Yeah. And we gained this segue to our sponsor. - Goliath Technologies. Goliath is a best in class end-user experience monitoring and troubleshooting software. It'll help you find the root cause of any IT issue in three clicks or less because Goliath is designed for troubleshooting. Even the most complex Citrix or VMware Horizon user issues can be addressed in minutes. You'll get a troubleshooting expert right out of the box so even level one service desk can resolve issues without escalating them further. And the technology comes with embedded intelligence and automation built-in so you can be set up and operating within minutes. All the policies are designed by experts and they tell you what to monitor for and how to interpret the data. So if you have Citrix or VMware Horizon and are having performance issues, Goliath can help. And if you're in healthcare, Goliath comes with industry only modules for Cerner, Epic, and Meditech. Sign up for a free trial and save 20% using the link in the description. - If you guys enjoyed this video why don't you go check out the last chiller Alex built. No, why don't you watch the one where they didn't actually chill anything. They just hooked a computer up to the sink. (Alex chuckles) (object rattles)",
    "transcript_keywords": [
        "Yeah",
        "water",
        "Alex",
        "pump",
        "nom",
        "CPU",
        "pretty",
        "thing",
        "cooling",
        "John",
        "temperature",
        "things",
        "degrees",
        "bad",
        "works",
        "computer",
        "Wow",
        "run",
        "Goliath",
        "pumps"
    ],
    "transcript_entity_values": [
        "5,000 watt",
        "one",
        "0.14",
        "130",
        "eight",
        "One",
        "63",
        "zero",
        "Corsair",
        "Teflon",
        "about 1500 liters",
        "5,000 watts",
        "GPU",
        "39",
        "Meditech",
        "John",
        "0.1",
        "0.12",
        "CNC",
        "6,000",
        "three",
        "Linus",
        "Linus",
        "39,785",
        "half",
        "Cerner, Epic",
        ". - 39,000",
        "first",
        "36,6",
        "Three degrees",
        "Alex chuckles",
        "208 volt",
        "NALCOOL",
        "about five psi",
        "two degree",
        "six gigahertz",
        "4",
        "769",
        "CPU",
        "13th",
        "six",
        "sec",
        "38,000",
        "2.73",
        "Intel",
        "only half horsepower",
        "320 millimeter",
        "gallon",
        "Linus] Alex",
        "AC",
        "four",
        "Windows",
        "minutes",
        "Vaseline",
        "a hundred degrees",
        "several years",
        "4090s",
        "hoo hoo hoo",
        "18 degrees",
        "Goliath Technologies",
        "10 degrees",
        "Alex",
        "five",
        "Cinebench",
        "Tynan",
        "a ton",
        "10 years",
        "16.9 degrees Celsius",
        "20%",
        "Build Redux",
        "12",
        "two",
        "IHS",
        "EK",
        "zero miles",
        "40K.",
        "Home Depot",
        "second",
        "D5",
        "today",
        "Goliath",
        "just 0.1 degree Celsius",
        "VMware Horizon",
        "Thermo Flex5000",
        "Princess Auto",
        "Citrix",
        "620 millimeter",
        "Horizon 5",
        "80 degrees",
        "380 watts",
        "1080 liters per hour",
        "15,000 U.S. dollars",
        "Windows",
        "39,151"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "PERCENT",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "EVENT",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "MONEY",
        "WORK_OF_ART",
        "CARDINAL"
    ]
}