{
    "id": "icQMelb7mKY",
    "title": "MSI GE62 VR (GTX 1060) Review - A Powerful Gaming Laptop",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2016-09-15T20:40:23Z",
    "video_url": "https://www.youtube.com/watch?v=icQMelb7mKY",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Review",
        "MSI",
        "Best Gaming Laptop",
        "GTX 10 Series",
        "Pascal",
        "Nvidia",
        "GTX 1060",
        "1070",
        "1080",
        "Most Powerful Gaming Laptop",
        "Cheapest",
        "Budget",
        "Best Laptop",
        "GE62",
        "GE62VR",
        "GE72",
        "GE72VR"
    ],
    "views": 653037,
    "likes": 8063,
    "comments_count": 927,
    "description": "Dave2D review of the 15\" MSI GE62 VR Apache Gaming Laptop with the powerful GTX 1060. Covering build quality, screen,  hardware, battery life and gaming performance. Current Pricing Here -   Be sure to check out my other GTX 10-series Laptop Reviews: Asus GL502 (1060) -  MSI GS63 ( 1060) -  Asus G752 (1070) -    Music Credits: Intro: Tyler Touch - Act Of God ft. Jason Gaffner (Robotaki Remix) Background: Fili - Smooth Ride  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2d1ecoN",
        "https://youtu.be/IDJd_9CMkEg",
        "https://youtu.be/lvkZRMPM8aQ",
        "https://youtu.be/VftseA5k7Zk",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going guys? This is Dave2D and today we're taking a look at the GE62 VR from MSI. This is their entry-level 15-inch gaming laptop, it's been updated with some nice features, including the GTX 1060. So not much has changed on the exterior. It's got the same black brushed aluminum top panel with a plastic chassis and a plastic bottom panel. The overall build quality on the laptop is ok, the screen is pretty flexible, you want to be careful about putting too much weight on the laptop. The screen hinge itself is also a little stiff. It's not easy to open one-handed. The chassis however is good. The keyboard area is aluminum and it's actually quite stiff. The keys are great to type on. MSI consistently has nice keyboards and this one doesn't disappoint. Good key travel with nice spacing. It has Steelseries lighting, it's not individually lit keys, but it's still cool to be able to customize colors. If you use your windows key a lot, keep in mind that it's on the right side, on this keyboard. The trackpad is mediocre, it's plastic, and it's textured to match the brushed metal of the palm rest. It doesn't use native windows drivers, it uses Elan drivers, so tracking is imperfect. But the texture is what gets me the most, there's friction going from side to side, but not up and down. So it's a little bit weird. The physical buttons are nice though. Good activation pressure, not too loud, good clickyness, I like them. For ports it has individual audio jacks, a USB-C, but there's no Thunderbolt 3 support, a pair of USB3s, display outputs, Ethernet and on the other side we have USB2 and an SD slot. The internals can be accessed by removing a bunch of screws, it has one of those \"warranty void if tampered\" stickers, but... Who cares, right? This unit has 16 gigs of RAM, a one terabyte hard drive and an m.2 SSD. Drive speeds are good. I was worried they drop a slow drive in here, but it's actually pretty good. The 51 watt hour battery is relatively small and it's partially because the optical drive takes up so much space in there and I get it, it's not something I use anymore, but there's still quite a few number of people in this world that use optical media for their games. But because of it, the battery life is relatively short as well. The CPU is a SkyLake 6700HQ, we've seen this chip a lot. It has very good mobile performance. This laptop is rocking a GTX 1060 and the performance is really nice, running at the native 1080P screen resolution, moderately demanding games like Rainbow Six Siege will break 100 frames per second on Ultra graphics setting. Overwatch has the same thing going on, if you're playing on Ultra at 1080p, you're hovering around 100 frames per second, basically any kind of light to moderately demanding title plays very comfortably on this card. Witcher 3 will still be around 60 frames per second on High graphics settings, but if you want to play it on Ultra graphics, it'll be closer to 45 frames per second. So, overall I think the GTX 1060 is a great fit for current generation gaming and of course it's VR Ready. So, if that's your jam, you're good to go. The display is a 15.6 inch IPS panel. There is a 4K option if you're a content creator. The 1080p panel is reasonably bright and the panel overall is nice. Matte finish, good color accuracy, great viewing angles. My unit has a little bit of light bleed on the top right, but it's very mild and it's not something I really care about. The previous generation of the GE62 had great performance, but it didn't have great thermal management. MSI has changed a couple things and now it has two extra heat pipes, and it makes a huge difference. This updated model has lower temperatures and it's a bit more comfortable to use on a table and on your lap. Fan noise is not bad. It's pretty quiet on idle and under load it's pretty average for a 15-inch gaming laptop. It's audible, but it's not super loud or anything. The speakers are unchanged from the previous generations. It's got a pair of speakers on each side and a small subwoofer. The audio stays clean when it's loud. The bass still isn't great. I mean it's a very small sub, but the overall sound is pretty good. Alright the MSI GE62 VR starts at around $1500 US. It's made with a mix of aluminum and plastics. Ok build quality. The 1080p screen is pretty bright and has a good image. The keyboard is really nice with customisable RGB lighting zones. The trackpad is not as nice. On the inside the SkyLake 6700HQ and the GTX 1060 deliver great performance and with the addition of the 2 extra heat pipes, they are properly cooled now. There are 16 gigs of RAM, a 2.5 inch drive bay and a single m.2 slot. All of them are easily accessed for upgrades. And lastly there's a 51 watt hour battery that'll get you around 3 hours of battery-life. So, if you're looking for a Pascal based laptop, the GE62 VR will give you great value. The GTX 1060 has great performance and the components all around are pretty good. The build quality is average, but if you're looking for the best performance for your dollar, this laptop should be on your shortlist. That's the end of this video. Hope you guys liked it. Thumbs if you did, subs if you loved it. It's been nice, see you guys next time.",
    "transcript_keywords": [
        "good",
        "nice",
        "great",
        "pretty good",
        "GTX",
        "laptop",
        "pretty",
        "performance",
        "great performance",
        "MSI",
        "side",
        "drive",
        "panel",
        "Ultra",
        "screen",
        "frames",
        "Ultra graphics",
        "keyboard",
        "plastic",
        "gaming laptop"
    ],
    "transcript_entity_values": [
        "2",
        "51 watt hour",
        "Ethernet",
        "1060",
        "around 60",
        "the SkyLake 6700HQ",
        "one terabyte",
        "4",
        "2.5 inch",
        "CPU",
        "Pascal",
        "Rainbow Six Siege",
        "one",
        "around $1500 US",
        "the GE62 VR",
        "15.6 inch",
        "Ultra",
        "Witcher",
        "second",
        "15-inch",
        "100",
        "RGB",
        "today",
        "Steelseries",
        "16",
        "USB2",
        "GTX",
        "SD",
        "Overwatch",
        "Elan",
        "the GE62 VR",
        "The 51 watt hour",
        "3",
        "two",
        "1080P",
        "IPS",
        "around 3 hours",
        "RAM",
        "45",
        "MSI",
        "1080p"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "FAC",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}