{
    "id": "Ido4AGPUukU",
    "title": "LG Gram 17 Review: Too Light To Be True",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-06-13T23:15:36Z",
    "video_url": "https://www.youtube.com/watch?v=Ido4AGPUukU",
    "category": "Science & Technology",
    "tags": [
        "lg gram 17 review",
        "lg gram review 2019",
        "lg gram 17 vs macbook pro",
        "lg gram 17 unboxing",
        "best large laptop 2019",
        "lightest laptop 2019"
    ],
    "views": 196663,
    "likes": 6760,
    "comments_count": 372,
    "description": "Sponsored by Surfshark VPN. Get Surfshark VPN at   enter promo code MRMOBILE for 83% off and 1 FREE month!      [LG GRAM 17 REVIEW]  The last time I used a 17-inch laptop in real life, it was the HP zd8000, a genuine monster I bought when I was still in college. Together with its power adapter and suitcase-sized carrying satchel, the zd8000 weighed a spine-bending twelve pounds when slung across my torso. The LG gram 17's net weight? A featherweight 2.95 pounds  light enough that everyone I've allowed to hold it has responded with the same incredulous reaction: \"Noooo.\" That makes the LG gram 17 one of the lightest laptops of 2019 ... even though it's also one of the largest!  But how much is too much to pay for the privilege of carrying such a delightful contradiction? Join me for MrMobile's LG gram 17 Review to find out!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S LG GRAM 17 REVIEW]  MrMobile's LG gram 17 Review was produced following two weeks with an LG gram 17 review device provided by LG. The device was shipped after retail availability and at presstime was running the latest Windows 10 software.    [LINKS]  LG gram 17 [Amazon]:   LG gram 17 [LG]:   LG gram 17 Review [Windows Central]:    [MUSIC]  Avatars by Yan Perchuk, available at Premium Beat:   Escapade by Vincent Tone, available at Premium Beat:    [SOCIALIZE]        [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #lggram17 #lggram #gram #laptops #windows10 #pc #tech",
    "description_links": [
        "https://surfshark.com/r/mrmobile",
        "https://www.youtube.com/channel/UCSOpcUkE-is7u7c4AkLgqTw?sub_confirmation=1",
        "http://mrmobile.tech/52b",
        "http://bit.ly/2KjSpMc",
        "https://www.windowscentral.com/lg-gram-17",
        "https://www.premiumbeat.com/royalty-free-tracks/avatars",
        "https://www.premiumbeat.com/royalty-free-tracks/escapade",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "http://www.mobilenations.com/external-links"
    ],
    "transcript": "- [Michael] This video is sponsored by Surfshark VPN. You ever have this thing happen? You're walking along halfway to work, and suddenly, you realize that your bag feels like almost too light, and that must mean you've forgotten your laptop. You know, this has been my life for the past few weeks except every time I've opened my bag, I've realized that my laptop actually is in there. It's just so light, I didn't even notice it. This is the LG gram 17, and it's not just the lightest laptop I've used in a long time. It's also the largest. (electronic music) The last time I carried a 17-inch laptop as my daily, it was this HP monster I bought when I was still in college, and I have to say, having that huge display back is a real pleasure. The gram's IPS panel offers gorgeous color though its glossy coating is reflective enough that you'll have to crank that brightness more often than you'd like. I found the picture plenty sharp even without 4K, but I do wish LG had included a touchscreen option, and I have the same complaint about the lack of discreet graphics. On some level, a 17-inch notebook that can't play intense games or handle heavy video editing just feels like a wasted opportunity. Oh, and the speakers? They're bad. (rock music playing clearly on computer) (muffled rock music playing on computer) Now, of course, adding those features would have also added weight, and the number one reason you buy an LG gram is because it feels like it's full of helium. At 2.95 pounds, it's 26% lighter than the MacBook Pro I usually carry every day, and the display is substantially larger, while not going so much bigger on the footprint that it can't fit in the same backpack. Better yet, unlike with the MacBook Pro, you don't have to listen to me complain about the lack of ports on the gram. You've got three USB-A ports, full-size HDMI, headphone jack, and Thunderbolt 3. Rounding things out is a microSD card slot, too, which comes in handy if you shoot on GoPros or you fly a lot of drones. True story. I was at a house party recently where a Parrot drone met an unfortunate end. No, I wasn't piloting. And once we got it back, the LG gram played a big part in the accident investigation phase thanks to that card slot. While that, once again, calls to light the unfortunate lack of a beefier graphics card at least there's solace to be found in the battery life. 8 hours of continuous use (digital beeping) per charge is my benchmark for acceptability in a laptop, and the gram hit that perfectly during a day's worth of my typical workload. For recharging, the gram ships one of those brick-on-a-string AC adapters that I'm not a big fan of, but fortunately, you also have the option of charging with USB-C, so now you can carry fewer chargers. The gram also has most of the expected accoutrements to slot nicely into the day to day for Windows 10 users: A fingerprint sensor built into the Power button, a webcam sharp enough (digital beep) to show off your exhausted sick face from the summer cold you picked up at that drone party, and despite it's lightness, it passes the one-handed opening test. Also, bonus-bonus time, the back-lit keyboard also packs a dedicated number pad. You don't realize how much you've missed this until you've got it back, whether you're running numbers in Excel or wasting imps in Doom. I do wish LG had built in a space or a divider between the numpad and the keyboard though. You end up with a lot of mistypes until you get used to it being there. Oh, and watch that keyboard deck when you're adjusting the volume or brightness. The nanocarbon magnesium casing is full of flex from here all the way up to the display corners here. Now, that flexibility is no accident. That's what makes it possible for this gram to take a fall just as well as the others I tested. (loud crash) Ew, that was a particularly brutal one from about four feet, and I had to pop a few tabs back in on the casing afterward. But what can I say? That and the somewhat flimsy feel in hand is the price you pay for the thing still working after a drop like that. To get the laptop healthy on the software side, please stick with me for a word from today's sponsor, after which I'll bring you my final verdict. If you're like me you do a lot of internetting in public places, like coffee shops, and you're not entirely comfortable passing your private data over those public pipes. That's where my sponsor Surfshark VPN comes in. It encrypts all the information sent to or from your computer and mobile devices, protecting you from attackers. If you're overseas and want to watch a show or game that's only available back home, the Surfshark makes that possible, too. Those irritating pop-up ads with their malware and trackers, toggle CleanWeb, and they're gone. And if there's a site you want to whitelist, well, that's easy, too. There are a lot of VPNs out there, but only Surfshark gives you all this at 83% off. Just click the link below, and enter the promo code mrmobile. And if that's not enough for you, the same code gets you one month free. Try Surfshark VPN today at the link in the description below. So, should you buy the LG gram 17? Well, after a couple weeks with this, I'm serious. Every other laptop out there feels like, in the words of my Android Central friends, an absolute chank. The gram seems to defy the laws of physics, and it'll keep up with most folks' day-to-day needs just fine. But, you know, so do a lot of other less expensive machines. At $1700, (cash register dings) you've got to be both (digital beeping) in love with the notion of a huge display and forgiving of the lack of graphics power to take advantage of it. At the end of the day, you're just paying for extreme portability, which as Mr. Mobile I'm of course all about, but you're laying out a lot for the privilege of carrying a little. Folks I've got more laptop reviews coming down the pipe, including a Dell that knows when you're looking at it. Subscribe to the Mr. Mobile on YouTube so you don't miss that. Be sure to check out Windows Central's review of the LG gram 17, linked right here. This review made possible by gram 17 unit on loan from LG. I don't accept money for reviews, and the LG also did not get copy approval. That means they're seeing it for the first time here on the channel just like you. Until next time, thanks for watching, and stay mobile, my friends. (light music)",
    "transcript_keywords": [
        "gram",
        "Surfshark VPN",
        "laptop",
        "Surfshark",
        "time",
        "lot",
        "day",
        "back",
        "feels",
        "mobile",
        "sponsor Surfshark VPN",
        "Surfshark VPN today",
        "lack",
        "gram IPS",
        "display",
        "VPN",
        "gram IPS panel",
        "light",
        "MacBook Pro",
        "Windows Central review"
    ],
    "transcript_entity_values": [
        "IPS",
        "Thunderbolt 3",
        "one month",
        "AC",
        "a couple weeks",
        "the MacBook Pro I",
        "Dell",
        "USB-C",
        "Windows Central's",
        "microSD",
        "the past few weeks",
        "YouTube",
        "8 hours",
        "17",
        "USB",
        "1700",
        "Mobile",
        "2.95 pounds",
        "Excel",
        "today",
        "Power",
        "GoPros",
        "first",
        "gram",
        "jack",
        "Michael",
        "day",
        "83%",
        "4",
        "26%",
        "Parrot",
        "the promo code mrmobile",
        "Surfshark",
        "gram",
        "Surfshark VPN",
        "Windows 10",
        "LG",
        "a house party",
        "17-inch",
        "CleanWeb",
        "the MacBook Pro",
        "three",
        "one",
        "about four feet",
        "the end of the day",
        "the day to day"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "TIME",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERSON",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PERCENT",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "LAW",
        "ORG",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE"
    ]
}