{
    "id": "ie1wyZGYJD0",
    "title": "Fossil's Gen 5 Tries To Fix The Smartwatch",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2019-08-06T02:23:36Z",
    "video_url": "https://www.youtube.com/watch?v=ie1wyZGYJD0",
    "category": "Science & Technology",
    "tags": [
        "fossil generation 5 review",
        "fossil gen 5",
        "fossil carlyle hr",
        "wear os",
        "smartwatch 2019",
        "wearable tech",
        "mrmobile",
        "android central",
        "michael fisher"
    ],
    "views": 602364,
    "likes": 10883,
    "comments_count": 460,
    "description": "Fossil Group offers far and away the most diverse portfolio of smartwatches running Google Wear OS, and the newest installment is finally here. The Fossil Generation 5 seems likely to serve as the jumping-off point for most of the new Wear OS watches well see from Fossil this year, with a resurrected speaker/mic pair and four new battery modes to try solving the Gen 4's biggest pain points. I've spent the past four days giving it a trial run, so join me for the Fossil Gen 5 Hands-On!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S FOSSIL GEN 5 HANDS-ON]  MrMobile's Fossil Gen 5 Hands-On was produced following five days with a Fossil Generation 5 review sample (Carlyle HR) provided by Fossil. Preproduction hardware running pre-release software. Once final software is provided, a full review (either standalone or as part of a wearable compilation video) will follow.   Some filming by David Cogen of TheUnlockr [   Special thanks to Better Buzz Coffee Roasters for location shooting.   [LINKS]  Fossil Gen 5 Smartwatch [Amazon affiliate link]:    [SOCIALIZE]        [MUSIC]  \"Fashionista\" by Olive Musique, available at Premium Beat:    [DISCLOSURE]  This post may contain affiliate links. See Mobile Nations' disclosure policy for more details:   #fossil #smartwatch #fossilgen5 #wearabletech #watch #wristwatch #carlylehr #wearos #androidwear",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://theunlockr.com].",
        "http://mrmobile.tech/1K6",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.premiumbeat.com/royalty_free_music/songs/fashionista",
        "http://www.mobilenations.com/external..."
    ],
    "transcript": "(upbeat music) - It's too soon to review. In fact, it's barely soon enough to unbox. The fifth generation Fossil is finally here. You know how I get about my smartwatches. Let's see if this one has a chance at earning its price tag. (upbeat music) Okay, so Fossil Group offers far and way the most diverse portfolio of watches, running Google's Wear OS. And this Gen 5 will probably serve as the jumping off point for most of the new ones we'll see this year. So it's promising to see the latest Snapdragon 3100 chip set under the hood, even if the promised battery life improvements from that platform have never really materialized. To help with that, Fossil cooked up three of its own battery optimization modes. So you can select which watch features stay active and which get put to sleep for maximum endurance. Also, within the stainless steel case is the same gigabyte of RAM that makes the Montblanc Summit 2 run so smoothly. And ditto the rotating crown. In my opinion, a must have for the best Wear OS experience. As usually, the other two pushers default to Google Fit and Google Pay, but they can be customized to suit your own preferences. I'm not much for talking to my wristwatch, but the microphone of the previous generation has been retained and augmented by a speaker that's just as water resistant as the watch is. That means you can hear alarms and messages from Google Assistant and also make and take calls while the watch is paired to your Android phone. If you wanna make those calls while paired to an iPhone, instead, Fossil will make that possible for the first time on a Wear OS device through another proprietary app due this fall. I've only been able to use the Gen 5 for a few days, and it's on pre-production software so the custom battery optimizations aren't yet working. From what is working, there are very few surprises. My review sample is the Carlyle, one of two styles, and while it's handsome with the included metal bracelet, I'm grateful the standard 22 millimeter connection let me swap it out for a band of my own. The charger is Fossil's standard magnetic puck, same as on the company's Sport and without using any of the battery saving features, I have to put the watch on that charger about as often as usual, every other night. There's a heart rate censor on the back, a bright and beautiful display on the front, and this being Fossil, a metric ton of watch faces, which I really appreciate. (upbeat music) Along with the battery claims, what's impossible for me to evaluate at this point is the Gen 5's reliability. A cursory look at the Wear OS and Fossil subreddits reveals that the Generation 4 had a widespread defect that caused the back covers to fall off on many devices. Fortunately, those forums are also replete with stories of Fossil's good customer service, but then, there's Wear OS. Google's revised smartwatch platform is much better than it used to be, and it boasts a large ecosystem of apps. But it's still got more than its share of bugs, compared to something like Samsung's Galaxy Watches, or of course, the Apple Watch. These are all things to consider when you're shelling out nearly $300 for a smartwatch. Give me some more time once the final software hits, and I'll have more to share alongside other watches soon. Please, subscribe to The Mr. Mobile on YouTube so you don't miss it. If you wanna buy it today, I'll drop a link in the description, it is on sale as of press time. This hands-on made possible by a review sample provided by Fossil. No copy approval was offered, and no money changed hands in the production of this video. Special thanks to David Cogen of TheUnlockr for camera assistance. Until next time, thanks for watching, and stay mobile, my friends.",
    "transcript_keywords": [
        "Fossil",
        "Wear",
        "Google",
        "watch",
        "running Google Wear",
        "Google Wear",
        "Fossil Group offers",
        "battery",
        "Fossil Group",
        "generation Fossil",
        "Gen",
        "time",
        "Google Pay",
        "Google Fit",
        "generation",
        "Google Assistant",
        "watches",
        "make",
        "Fossil standard",
        "review"
    ],
    "transcript_entity_values": [
        "22 millimeter",
        "Wear",
        "the Apple Watch",
        "nearly $300",
        "Samsung",
        "fifth",
        "a metric ton",
        "a few days",
        "YouTube",
        "three",
        "Fossil Group",
        "Mobile",
        "the Generation 4",
        "this year",
        "today",
        "iPhone",
        "RAM",
        "first",
        "one",
        "Galaxy Watches",
        "Google",
        "TheUnlockr",
        "two",
        "the Gen 5's",
        "the Gen 5",
        "David Cogen",
        "Wear OS",
        "this fall",
        "the Montblanc Summit 2",
        "Carlyle",
        "Google Fit",
        "Android",
        "Fossil"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "EVENT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "CARDINAL",
        "EVENT",
        "EVENT",
        "PERSON",
        "ORG",
        "DATE",
        "PRODUCT",
        "LOC",
        "ORG",
        "ORG",
        "PERSON"
    ]
}