{
    "id": "iEbKHtTM3eY",
    "title": "This Gaming PC is AWESOME! - EKWB Vanquish 295",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2021-05-02T18:58:13Z",
    "video_url": "https://www.youtube.com/watch?v=iEbKHtTM3eY",
    "category": "Science & Technology",
    "tags": [
        "Personal Computer",
        "Pre-Built",
        "EKWB",
        "KEWB",
        "Fluid Gaming",
        "Vanquish Line",
        "RTX",
        "3090",
        "NVIDIA",
        "AMD",
        "ASUS",
        "5950X",
        "Performance",
        "Liquid Cool",
        "Hardlined",
        "Alex",
        "Unboxing",
        "Shipping Damage"
    ],
    "views": 465698,
    "likes": 23295,
    "comments_count": 1157,
    "description": "Sign up for Private Internet Access VPN at    EKWB wanted to send over one of their highest spec gaming PCs, the Vanquish 295. It has an AMD 5950X and a NIVIDA 3090 RTX graphics card. We couldn't say no, but there were a few issues...  Check out EK's Fluid Gaming lineup at   Buy AORUS FI27Q-P 27\" 1440p Gaming Monitor On Amazon (PAID LINK):  On Newegg (PAID LINK):  On B&H (PAID LINK):   Buy Logitech G915 TKL Wireless Keyboard On Amazon (PAID LINK):  On Newegg (PAID LINK):   Check out the Glorious Model O Wireless at   Purchases made through some store links may provide some compensation to Linus Media Group.  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  Our Official Charging Partner Anker:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  Mac Address:  Techquickie:    LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://www.privateinternetaccess.com/ShortCircuit",
        "https://lmg.gg/R4KR9",
        "https://geni.us/hBYPYZ",
        "https://geni.us/l97inm",
        "https://geni.us/k7S2",
        "https://geni.us/KOJlJUs",
        "https://geni.us/VhO5",
        "https://lmg.gg/zULpw",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/AnkerLTT",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.facebook.com/ShortCircuitYT",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/macaddress",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Here today. We have the EK water blocks, fluid gaming. Oh, what the, heck's it called? Vanquish 295. I believe it is. Yes. Nailed it. It's water cooled. Well, of course it's water cooled, it's EK. But she's really frigging powerful. Yeah. Budget build rate here only, you know the least rich Saudi princes buy this one, (wheezes) you go into Dubai with this thing and they're just like, Oh, damn it. You got the EK fluid gaming? What the hell are you even doing? I don't even think it has SLI-39, so like (lip trill) We get a tube, presumably for filling? Oh, draining, actually it says it right there. All of the other cables that would come with your power supply, I guess its an EVGA one. And two and a half inch drive bays. Everyone's favorite way to open these. Oh, heck yeah. Oh yeah. That is sex back right there. Yeah. One thing to note is that it did not come pre-filled, our logistics guys did that for us. I'm pretty sure that it was really easy though. Cause they have just like a fill port right there and a drain port down there, if you ever want to take the fluid out and that way you don't have to worry about like, things move around a lot in shipping. So if you couldn't tell this is based off of a Lian Li 0-11-D, in my opinion, it's basically one of the best computer cases on the market right now. It has cool things like the ability to put two power supplies in it. If you're De Bauer (wheezes) and it also has such a good setup for custom water cooling and EK has taken full advantage of that. Now what you normally don't get in an 0-11-D is this frigging incredible distribution block and reservoir and pump combo that they have up here. Oh, you do get these fairly small hardline tubes. I think those are like 10 mils. Oh wow. Yeah. It looks like that, something unpleasant happened to this in the shipping. You can see a little bow right here. Yeah. The box looks pretty good. Let's turn this on just to figure out exactly how this flows. Oh, there we go. That's a good sploosh right there. No leaking that I can see. Okay. And now we know for sure that the way that I thought it was going to flow it actually does. There's a little spinning wheel here that shows us that the water is actually flowing. Pump pumps here goes out into the GPU, down into here and then across into the CPU comes back in here into Radiator One which looks like a 240, then into Radiator Two, which is a 360. And then it comes back into the big old reservoir right here which I imagine is going to have absolutely no trouble cooling this thing, like just this 360 probably totally fine for the system. Chuck in the 240 there as well. And she's, she's real good to go. So like we have an X570 prime as the motherboard here you could technically have like a crosshair or like a strict gaming E, which would be better. But at the same time, I highly doubt. It's going to give you any actual more performance RTX 3090, fastest GPU you can get. I guess you could put two of them in here, but in the vast majority of cases, one is going to be just as fast. If not faster. As for the CPU, Ryzen 9 5950X, fastest CPU on the market, that's kind of just how she goes. 64 gigabytes of 3,200, I believe it's C16, but they didn't say, memory from G-Skill and to round the whole thing out, you get a 970 EVO. So they could have gone for the 980 which does support PCIE 4.0. But at the same time, you can't really saturate PCI 3.0 so it doesn't super matter. And in the back here, we have a four terabyte hard drive for all of your games. From the front I would say that the cable management is exceptional for a prebuild. This one right here. I guess if I was to really complain, could be marginally better, but only marginally. This is really well done. It just looks really sick. Okay. So the timings on this RAM is C-Sixteen-Eighteen, Eighteen-Thirty-Eight, which is pretty good. I believe, I'm not a RAM overclocking kind of person because it's always a terrible time. But if that's your jam, I imagine this stuff does pretty good where they might be hiding. Some badness though is in the back, I guess that the airflow goes sucking in through here and in through the bottom and then exhausting through the radiator at the top, which is actually a pretty smart way to do it. So this is a thousand watt, EVGA Supernova G5. It's just a fantastic power supply. Take a look here. Oh, that's really quite well done, for like, a prebuild. Then finally you can see the hard drive is right here. One thing, that's nice, that they did do, is there is another SETA connector already placed right there. So if you want to chuck in another hard drive, it's already basically run. You do have to put a SETA cable down. Now the final kind of janky thing that they did is the motherboard does not support WiFi but they threw in an MSI WiFi card. I don't know why they do that. Like it's the sort of thing where it doesn't matter. This WiFi cards probably better than onboard WiFi overall though like this thing is just exceptionally well done. Like you expect it. It's, you know, a $6,000 gaming PC, but again, I've seen pretty stupid stuff and very expensive prebuild's before, so good job EK. I want to play some games on it. Just like I want to make Jonno happy with the segue to our sponsor, PIA. Private internet access is a VPN that allows you to access services and websites as if you're in a different country and encrypts all of your internet traffic and uses a safe, protected IP. Connect to up to 10 devices at once with clients, for Windows, MacOS, Android, iOS, and Linux. Buy a one-year plan for $39.95 using the link in the video description. All right, we got her all set up and this is my favorite part. That's luxurious right there. Oh, now, that was a fantastic peel. But what's not as appealing is the fact that they used a DDC pump in this. It should have a D5. There's no reason it should have a DDC. It's this big, DDC's suck, D5's are good. Come on EK, you know this. Ahhhaha (uncomfortable laughing) Well it's I don't think this is EK's fault, but that's not good. Yeah. We used boot time. Excellent. But what the heck happened there? Let's see here. Let's boot up Doom maternal again and hopefully we don't get a blue screen. Okay. Doom maternal opened. Now we're not even in the game. What? What is this? Why? Oh, something might be broken. Okay. I have no clue why the blue screens were happening. Okay. So Doom just open. We're just idling with CPU temp in the mid-50s and the GPU also in the mid-50s. That's good for now, but let's see how good we go here. All right. We're looking at above 200 FPS for sure. Overall though, unsurprisingly, a 3090 is delivering excellent gaming performance. Something's weird with this system. So earlier today I was using basically this exact same config. So 5950X and a 3090, and a case that was about this big that was using mostly EK's stuff. And it was being cooled better than this, despite the fact that this should be better in basically every single way. Yeah. Maybe they overclocked it from the factory. Oh, okay. Yup. They had auto overclocking enabled. So that's probably what did it, so nevermind. System's working great. It was just overclocked and I didn't know. Let's do this again. You had me scared there, EK. Okay. So the CPU's already gotten above 80 degrees. Something's wrong with this computer? Something-Something's terribly wrong. I genuinely don't think it's EK's fault. We saw clearly that it was damaged in shipping. Like the bottom in here, is pretty mangled. I don't know what's going on without totally taking it apart, but, Oh, that's disappointing. This thing is so freaking cool. It's legitimately like one of the coolest computers that I've ever unboxed. Like you just look at it. It's freaking awesome. I'm sorry, EK. None of this was your fault. You built an awesome system and it got damaged. I really hope that we get another one in, at some point in time that's not broken or we can fix this one. We almost definitely can. Like, I'm not worried about that. Get subscribed, have a great old day. See ya.",
    "transcript_keywords": [
        "good",
        "thing",
        "Yeah",
        "pretty",
        "pretty good",
        "CPU",
        "water",
        "back",
        "gaming",
        "time",
        "GPU",
        "guess",
        "DDC",
        "drive",
        "WiFi",
        "basically",
        "system",
        "Radiator",
        "Doom",
        "hard drive"
    ],
    "transcript_entity_values": [
        "up to 10",
        "5950X",
        "Dubai",
        "four terabyte",
        "Lian Li",
        "one-year",
        "10 mils",
        "One",
        "RAM",
        "X570",
        "3,200",
        "C-Sixteen-Eighteen",
        "chuck",
        "80 degrees",
        "Ryzen 9 5950X",
        "Ahhhaha",
        "mid-50s",
        "240",
        "970",
        "3090",
        "Eighteen-Thirty-Eight",
        "Saudi",
        "two and a",
        "295",
        "IP",
        "Radiator Two",
        "Windows",
        "D5",
        "EVGA Supernova G5",
        "DDC",
        "Radiator One",
        "EVO",
        "PIA",
        "D5",
        "EVGA",
        "980",
        "EK",
        "a thousand watt",
        "De Bauer",
        "Linux",
        "Chuck",
        "64 gigabytes",
        "C16",
        "PCIE",
        "two",
        "MSI",
        "6,000",
        "Android",
        "GPU",
        "SETA",
        "PCI",
        "the mid-50s",
        "CPU",
        "VPN",
        "39.95",
        "Jonno",
        "MacOS",
        "EK",
        "0-11",
        "today",
        "earlier today",
        "G-Skill"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "DATE",
        "GPE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "NORP",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "PERSON",
        "GPE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "TIME",
        "ORG"
    ]
}