{
    "id": "IEEJAQhDmfM",
    "title": "New MagSafe iPhone Chargers!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2022-04-28T17:49:51Z",
    "video_url": "https://www.youtube.com/watch?v=IEEJAQhDmfM",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 260288,
    "likes": 11640,
    "comments_count": 449,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "(soft upbeat music) - Hey, guys. So today we're gonna be doing a nice little random unboxing. Like I don't even know what is in this little surprise bubble wrap here. I got this little treat from Nomad, and I'm such a huge fan of Nomad. I love everything that they have. They've got iPhone cases. They have some really cool charging docks. Even have like mouse pads, they've got like leather cases for your freaking MacBooks, like, oh my God like their stuff is just, it's super high quality, which is why I love it. And today we've got a little, a little package here. I haven't actually seen what's in here yet. So I have no idea. I just took it out of the box 'cause it was trash day, and I needed (laughs) to get my recycling out. 'Cause one of the things that I struggle with is being an unboxer and a tech reviewer, like we have a lot of perks. Like we get a lot of things, but with a lot of things, comes a lot of recycling. And breaking down boxes, especially when you only have like once a week recycling is, it's a lot. So let's see what we've got in here. Thank you Nomad for sending this over. Always so excited to see what you guys have got. I also have to be extra careful with knives now because I'm on blood thinners, and my sister has been opening my packages. The one day that she didn't open something, I cut myself on the freaking box and I was like, I got to be careful 'cause I don't want to bleed out. Okay, what? We got like a little grab bag here. This is exciting. Well what have we got? Oh, gee. Oh, wow. Oh, my goodness. Gifts galore. It's been a while since I've just done like a random unboxing for fun. Like this is great. All right, we've got... We have a pen. Oh, my God. Okay, look, I'm sure all of this is great, but the other day I had to sign for a package, and this has happened a few times already, the guy was like, okay, would you have a pen? I was like, I don't think I have a pen. I looked all over the house, could not find a pen. The only that I had was like a glitter Sharpie marker, and so I had to like sign for that. And he was like, you have to have something in this place. I was like, dude, you don't know me. I don't have a pen. And now, I do have a pen. The only other pen that I did find was (laughs) it was a tactical pen, which is not really made for writing. It's made for other things. So that didn't write. We have a pen. I want that guy to come back. It looks like we have a, oh, these are MagSafe. Okay, so the, oh, this is so exciting because what. Oh, my gosh, this is so exciting because this is actually what I have been using bedside is this little charging dock, but this is MagSafe, which is very exciting 'cause the one that I had previous was the Nomad charging kind of like little leather base that you kind of just set it on, wasn't MagSafe you just kind of had to place it ever so slightly, but this is freaking beautiful. And is this an iPhone stand? Oh, my God. This is great for my desk. This is, oh, these are so awesome. Oh my, and look at this, a little 30-Watt USB-C. This is a good gift because I don't have a pen. Look at that. Look at this pen. Look at this. Oh, my God, it's so heavy. It has such a nice weight to it. Is this recording? Yeah. Great. Should I zoom in a little? Yeah, we can do that. Look at that. That's nice. Check this pen out. Let's see if it writes. (pen scratching) That's not a good demo. I need a piece of paper. Okay, well it's writing on my hand. Oh, that's nice. Look at that. Oh, man, now I'm gonna have writing on my hand for the rest of the videos that I'm shooting today. Oops. But here you go, look at that. (pen clicks) A nice write. Hyped about the pen. Okay. Pen, check. Can't believe I have a writing utensil now. I know. So, let's go from smallest to largest. So, next we have this 30-Watt USB-C power adapter. I was actually just looking for one of these to plug that camera in. Oh, look at that. It just goes like this. Surprise. Nice, look at that. That's beautiful. That's beautiful. (adapter clattering) Oh. Where did you even go? Look at that. Very, very nice, great product. Very into it. I also love this. Look at their little skew that they have here. There's like a little car driving on it. It's so cute, but look at my art. Should I sell that as an NFT? That's art, that's art. Next, we have the Base One with MagSafe. So, this is a 15-Watt MagSafe fast-charging, weighted design for convenience, solid metal body with glass face. Wow. This is, oh my God, it's so heavy. But like it's freaking beautiful. Shiny, shimmering, splendid. Oh, okay. I see why they gave us the, sent this separate because you need this to charge this. So, this doesn't come with a power brick. So, obviously you're gonna need to have one of those sold separately, or you can use one that you already have. I love this braided cable though. This is very, very nice. Oh, it's long too. That's great. So, we just plug this in just like so, and this plugs into the back. Oh, I love that it's weighted too. So, yeah, that's a nice look. I'm not plugging it in 'cause I don't feel like getting up again, but that's on there. (charging dock banging) That's great. Wow. I love MagSafe. (charging dock banging) Very premium. That is a premium product if I've ever seen one. All right. Okay, what do we have next? MagSafe, a mounted stand. Yeah, check that out. Wow. That looks so sleek. Oh, my God, I love it so much. So, that looks like integrated MagSafe mount that Apple sells. So you just have that already assuming that you have that. So, don't buy this thinking that that's coming with it. 'Cause you'll be a little disappointed (laughs) thinking that it comes with it. So, here is your little MagSafe connector, and this stand obviously is made for the MagSafe connector. So, if you already have one of these, you're definitely gonna need that to make this work. So, you're just gonna slide the cable right through here just like so. That just pops in just like that. This is freaking beautiful. I love this so much. So if you can see the cord just goes right through the back, and then you would just plug this into your Apple charger that you already have. I love it. Like look how nice this looks. Beautiful, absolutely beautiful. Last up is the Base One Max with MagSafe. This is definitely going by my bedside. Very excited about this. I also like that it is a nice, fresh white color too, like that looks really good. Oh, this looks so nice. Oh, wow. Look at that. It's so heavy too. Like this isn't just some little tiny flimsy device. Like this is freaking industrial. Look at that. This is so beautiful. I mean, I haven't tried every single MagSafe charging dock in existence, but to date, I don't think I've seen one this nice. Like this is by far the nicest one that I've ever seen by the quality and just like the feel. Like this is so, it's perfect. It's so beautiful. Put the Apple Watch just like so. I also love that it has this nice braided white cable too to match. Just plugs right there into the back. You are MagSafe ready for charging. Well, thank you guys for watching, and huge thank you to Nomad for sending me these to check out. They're always sending me so many goodies, and I haven't really made a video about them in a long time. So, I really wanted to share with you the latest Nomad haul, and I'm so glad I decided to do this because I had no idea what was in this package. I was like, let's just see what's here, let's do a fun little unboxing, and these are so good. I just can't believe it. I'm so excited to have some new charging docks around the house. I need to go do a little upgrade to see how everything looks in their new homes. So, I will see you guys in my next video. Let me know if there's anything else you'd like to see me unbox or check out here on my channel. Leave me some comments below, and let me know what you guys think of these, and which one is your favorite? I'll see you guys in the next video. Don't forget to subscribe. Hit the bell to be notified when I post new videos, and leave me some comments below so that we can all chat together. I'll see you guys in the next one. Bye. (soft upbeat music)",
    "transcript_keywords": [
        "pen",
        "nice",
        "MagSafe",
        "love",
        "beautiful",
        "God",
        "Nomad",
        "guys",
        "great",
        "freaking",
        "charging",
        "lot",
        "freaking beautiful",
        "wow",
        "Check",
        "things",
        "Yeah",
        "Apple",
        "exciting",
        "back"
    ],
    "transcript_entity_values": [
        "30-Watt",
        "15-Watt",
        "iPhone",
        "MagSafe",
        "NFT",
        "One",
        "the Apple Watch",
        "one",
        "MagSafe",
        "Max",
        "today",
        "Apple",
        "MacBooks",
        "Nomad"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERSON"
    ]
}