{
    "id": "IFwFDZDQWAA",
    "title": "This SSD is Faster Than Your RAM - Apex Storage X21",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-13T17:26:56Z",
    "video_url": "https://www.youtube.com/watch?v=IFwFDZDQWAA",
    "category": "Science & Technology",
    "tags": [
        "Apex Storage",
        "X21",
        "SSD",
        "Sabrent"
    ],
    "views": 3045590,
    "likes": 92271,
    "comments_count": 3323,
    "description": "Looking for a reliable mobile provider that won't break the bank? Meet Tello Mobile! With Tello, you get top-notch coverage, no contracts, and fully customizable phone plans that fit your needs. Switch to Tello now and get 50% OFF any plan above $10 until May 16th at   The Apex Storage X21 is an absolutely wild AIC that allows you to connect twenty one SSDs to a single PCIe slot... and it is very fast.  Discuss on the forum:   Thanks again to Sabrent for sending us all those SSDs! Check them out at   Check out the Apex Storage X21 NVMe AIC:  Buy a Sabrent Rocket 4 Plus 8TB NVMe M.2 SSD:  Buy a Gigabyte AORUS Gen4 AIC Adaptor:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   EQUIPMENT WE USE TO FILM LTT:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 - It's cram packed full of M.2 slots! 0:49 - Tello! 1:05 - What is the X21? 4:00 - Popping the heatsink 5:48 - A Single SSD 8:35 - Hot swap? 9:27 - 21 SSDs 16:52 - Linux! 19:51 - Real use cases 21:19 - Tello! 22:27 - Outro",
    "description_links": [
        "https://tello.com/?utm_source=partner",
        "https://linustechtips.com/topic/1506855-this-ssd-is-faster-than-your-ram/",
        "https://sabrent.com/",
        "https://lmg.gg/OFxJ9",
        "https://geni.us/O10iXs",
        "https://geni.us/SRGL9j",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/LTTEquipment",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- We see a lot of wild tech around here, but this, this is the wildest we've seen in a long time. Like here's a question you need to ask yourself. How many SSDs do you need in your computer? One, two, three? How about 21 of them? That's right, we got it. The Apex storage X21, it's absolutely cram packed full of M.2 slots, each of which contains a Sabrent Rocket 4 plus 8 terabyte SSD. That's right, friends. I'm holding a casual 168 terabytes of storage and this thing is so fast it shocked even the CEO of Apex Storage. Just like I'm gonna shock you with this message from our sponsor. Tello. Get super affordable phone plans with awesome freebies and excellent customer service from Tello. They were rated excellent by over 9,000 unbiased customer reviews on Trustpilot. So switch to Tello today by clicking the link in the video description. - Be careful. - Have you ever held 150 terabytes in the palm of your hand? - These things are worth more than my car. And my car is new. It's a '21. - It is a pretty good car. Kind of a car guy. Woo. All right. Really the star of the show is this, though. There are only three of these cards in existence, but if the buzz around it is anything to go by, there's soon to be a lot more of them. Unlike some PCIE slot based SSDs, the Apex Storage X 21 allows you to mix and match any commodity M.2 drives that you want and even upgrade them down the line, because all you're doing is taking this PCIE by 16 gen 4 slot and splitting it up to all the attached drives. And oh boy, can you attach a lot of drives. This controller at its heart can apparently handle up to 100 PCIE lanes. And the best part is you can install this in any motherboard. You don't need a server board that supports PCIE slot bifurcation. All of that's handled on board. And another feature I'm really excited about is that apparently you can hot swap the SSDs on the board. - No. You don't wanna do that. - We're gonna have to try that. - I really don't want to do that. - We're gonna have to try that. I mean, Sabrent would want us to. Shout out Sabrent by the way. They asked us, hey, if we send you those drives, can you guys mention us in the video? I was like, I will suck on your toes for this many drives. So you'll find them linked in the video description. It's an SSD, but it actually takes up as much space in your computer as a GPU and has the same number of power connectors. Okay, there's six pin PCIE instead of eight pin PCIE. But still, how much power does this thing draw? - I don't think it's that much. - Oh my God. Right, I knew that. I knew that. These are over a thousand dollars, but still it just didn't register. Woo. Holy crap. So what are they? Hold on a second. What are they doing here? This looks like it's gotta be at least a PCIE by eight link. This has gotta be another PCIE by 16. Actually looking closer at the layout of the dotter board, that makes sense. This top slot here is routed to these four and these four on the back. So a total of eight drives to the 60 next slot. And these four here are routed to the other one. That gives us a probable total of two lanes per drive, which might seem like, oh, that's a bottleneck 'cause this Rocket eight terabyte can do seven gigabytes a second and that's only three and a half. But when we consider that the system is accessing all these drives through a single PCIE by 16 slot, I don't think it's gonna be a major factor for performance. That is something we could test though by running a speed test on just one drive installed in the card. We should do that, hey? - Oh, sure. - Yeah. I kinda wanna try it. There's other stuff to look at here. Six pin PCIE power connector. I mean, should we pop the heat sink? - [Alex] Go for it. - I kind of wanna look at it, right? I'm assuming we have to send this back, hey? - [Alex] I don't know. - Oh. Who the heck are these guys? It's so wild. They come out of basically nowhere and they're like, yep, we've got more SDS than anyone else. That's what you get for being asleep on the job. Switchtec PFX. I don't know why, but I was like expecting an FPGA or something. I guess that makes sense that it wouldn't be, since you're not really doing any logic on the board. If it was some kind of raid card or something like that, then maybe, but if all this is doing is just PCIE switching, then it doesn't have to be that. Maybe there's an FPGA somewhere else. No, it looks like the whole thing is just this chip. - Just this chip. It's bigger than most CPUs. - I mean, well, yeah, yeah, yeah. I mean not, it's not undermining the coolness of the chip. I'm just... and where would we normally find something like this? I'm imagining like a PCIE fabric, like rack mount switch or something. Or? - I don't even know. - I don't really know, sir. - [Alex] It can be used in metro networks and core networking. Cellular infrastructure, broadcast equipment. - I would imagine anyone building out a composable PCIE over fiber infrastructure might use something like this. Man, those things are wild. You can have a whole bunch of PCIE devices just connected over fiber optic cables to a switch and then you can have your systems and then on the fly you can assign, well I'll just put six GPUs in that one and it just connects to... Anyway. Okay. - And I do want to say the hot plug support that I said is on the data sheet for this chip. - Mm. - Not the data sheet for this whole solution. - Well, start with one. Which one's gonna be the lucky slot here? - Why would you start with one? - How about this one? Because I wanna see if they each get two lanes. - Oh, yes. Well, but you can just do that with all them on there. - Yeah, I just... I wanna see how it behaves with one. - [Alex] Okay. Okay. - This is awkward. We need to move our GPU. - [Alex] 40/70 by the way. - 40/70. Ah. All right, let's turn it back on. Yeah. You were here the whole time. I did nothing. - You did touch it though. - I did. Well, I touched it. So you want the GPU in now? - Yep. The thing is- - Oh. - You can't put it in this slot because then we get by eight and by eight. - Right. We need all 16 PCIE gen four lanes for our SSD. So I guess we're putting it in this one X slot. - Yes. One sec. - That's the- - One sec. - Stupidest thing ever. Really? Does it touch something? Is it gonna short out? - [Alex] Yes. - Yeah, I'm giving it a sec. Oh, I don't think it got green before. Hold on. Hey! - Patience. - All right. This GPU is in at a very uncomfortable angle, sir. - [Alex] Yeah, I don't love it. - And our one disk shows up. Oh, I see you've... Did you configure this in a Windows software raid zero? - Yes. - That's the stupidest thing I've ever heard and I love it. All right, let's- - We can also do the BIOS raid if you want. - That would be smarter. Although I've had some issues with AMD PCIE raid and you know, reformatting windows and getting confused and stuff. So, I don't know. I mean, if we're doing something we'd never recommend anyway, it doesn't really matter how we do it. So my theory then is that this is only gonna get us a by two connection. No, wait, how does that work? It's claiming to be PCIE Gen four by four. Right, but wait. The connection through the PCIE switch chip would be at least five. Or, but then the drive wouldn't report back. Okay, let's just try this. - I don't know. Yeah, let's see what it does. - Man, if they wired every slot up for four lanes... They did! - [Alex] They did. - They wired every slot for four lanes. That dramatically increases the cost, but also dramatically increases the utility of this product because under normal circumstances you wouldn't do something dumb like configure 21 drives in a raid zero. You would have this in a system that's got a lot of CPU resources as well. And then you would be dividing up that solid state storage, sometimes leasing it to separate clients. So some of them might be using it when others aren't, which means being able to get the full throughput to one drive could matter depending on your use case. - That's pretty cool. - That's awesome. Let's add another drive. - Oh, please turn it off. I don't... Seems like a really bad idea. - [Andrew] I'm a little nervous too. - [Alex] Please do remember each of these drives is $1,500. - 1,500 bucks. Oh, let's get a cheaper one. I think I have one in my backpack. - [Alex] Of course. - I mean, why wouldn't I, right? Don't you keep an SSD in your backpack? Hey! Good, old, reliable, crucial. Only 500 gigs. Okay. You're doing a great service for your country. Woo! - [Alex] Oh, light turned on. - [Andrew] Oh, yeah? - That's something. It's not there, but also this is still working, so I kind of consider that a win. - Holy crap. Even though it wasn't doing anything. It's like flipping hot. - Oh, wow. - I just installed 32 terabytes of SSD on here. Oh, looks so good. 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 21. Hey, they're all here! Sick. - [Alex] And you can maybe changing that to raid changes it. I don't actually know. - No, it's somewhere. Oh, but. - Just... Just let it go past the bios. - Oh. Oh wait, what? - [Alex] Now do you see why I had a Windows raid? - Wait, you have to physically remove the drives from the system? We don't even have them configured in a raid. - You just can't in the BIOS, it's too many for AM five. - This must be a consumer platform lockdown thing because otherwise you could totally just run it. Does Intel let you do it? - I'm not entirely sure. - Oh, maybe what I said earlier about just being able to throw this in a nuk and boom SSD server isn't true then. AMD locks it down. Butt heads. Man, I'm disappointed. You gotta put this in a server motherboard. What the average consumer doesn't have $2,800 to spend on an M.2 carrier card? So AMD didn't think of that? Well, I guess what I need to do then is go back into disk management and fix your raid that I broke. - Yes. - Oh, boy. This will be tedious. - Can you not just click like add to volume and it figures it out? - It's raid zero. The volume is dead. Oh. - Oh. - What? - Haha. - Okay. It worked. I have no idea what just happened there, but I'm into it. Oh, yeah. Oh, yeah. - I'm gonna call you Big D. Yes. Thank you for hitting quick format. - Oh. - I did not hit that once. It took like five hours. It was 5:30 and I was just like, all right, see you tomorrow. - And that's on SSDs. I've done that with hard drives before. - Wait, have you actually run Windows raid zero in a system? - Sort of. I was running multiple raid cards, running raid five, hardware raid five, and then I raid zeroed them in windows. That's one of the early iterations of one X server actually. - Oh. - This blows my mind. Whoa. You Okay? - Yep, I'm fine. - Okay. This is the maximum speed of some things. - Okay. SATA 600 megabytes a second. Okay. PCIe 3.0. 3.4. Single one of these drives. Seven gigabytes a second. DDR4 25.6 gigabytes per second. All right. These drives are already getting pretty toasty here. I haven't even done anything yet. - [Alex] Oh yeah. - [Andrew] We should get a- - [Alex] Yeah. - We should get some cooling on this. Or wait, well yeah, check the camera. Yeah, let's check the camera first. Okay. Alex, that heat sinks at 90 degrees. - [Alex] All right let's- - That means the chip's probably hotter. Yeah, the fact that these 55 degree SSDs didn't look hot in the frame is a bad thing. Well wait, how are you even supposed to access any of the fan ports? They're all down here. - There's a bunch of fan ports. So do you want to zip tie that on the back here? - Really? - Yeah. So our method- - Oh. Oh, I see we're making like a tunnel. - Yes. - With cardboard. - Yes. - Of course we are. - Oh my God. Alex, what the hell? - What? It's highly effective. I zip... Okay. So, oh. - What the hell is is going on here? - It's fine, it's fine. You know this is barely in the slot, right? - Yeah. (fan roaring) - What fan is that? - Not as good as it was before. What I found worked really well was I took one zip tie- - Really well you say? - Yes, really well. Right up through there. - [Andrew] Oh my god. - [Alex] Now one of those- - [Andrew] And I was the reckless idiot for trying hot swap. - So that can go on there and then I found it worked really well if the other one went through the GPU. - Hold on, I need another zip tie. Now I'm participating. I'm officially party to this. Okay. It's at 74 degrees. - [Alex] Yep. They're all like 36, 35 degrees now. - [Andrew] Yeah. - [Alex] Down from 50, 60. - [Andrew] Heck yeah. - Nice. It works. - Okay. Gigabytes is... (Alex laughing) Now I wanna make something clear, just because that's as fast as a stick of memory and I don't even just mean, you know, theoretically when you're addressing it raw. This is with file system overhead, doesn't mean that you could use it as ram. The latency is gonna be much, much higher even if the bandwidth is off the charts unbelievable. - [Alex] Let's just have a look here. - [Andrew] Oh yeah. How many threads are we giving it? - It looks like four. Four is kind of where it seemed the happiest in Windows. - Oh okay. So four for all? - [Alex] Sure. - We are right at the theoretical limit of this slot. - Yeah. - I mean that's the thing, right? Is we're putting so many drives behind it that the SSD controllers, the NAN flash, none of these bottlenecks exist anymore. You're actually limited by the PCIE slot, at least in sequential workloads. As these random ones come up, you're gonna see, oh wow, two gigabytes a second is a (beep) lot. That's... Wow. It's obviously nowhere near the capabilities of the slot. We'd have to put another... What would that work out to? Not... About 200 drives on one of these carriers, you know, at a Q depth of 32 in a random workload to really saturate the PCIE slot. But still, now that I've said it, I'm sure those wild people over at Apex Storage are gonna try and build one. Now it's worth noting you've seen speeds like this before in the past. In fact, with an inexpensive carrier board that relies on the motherboard to do the bifurcation and just four SSDs, you can put up benchmark numbers like this, no problem. That's actually what I was running in my old personal rig. The issue though is you can only see these kinds of numbers under ideal conditions when those SSDs are acting in their SLC cash mode. As soon as you hit them with any kind of sustained load, especially along right, they are going to absolutely plummet. With the X 21 though, having so many drives running in parallel, we weren't able to change these numbers no matter how hard we hit the array. Oh, wow. It is actually using 100% of these discs, at least if task manager's to be believed. That is a lot of data to be moving around in like five, six seconds? - Yep. - I don't even know what to do to like show how fast it is 'cause like what do we do? Check an SSD in here or an SD card? - Nothing else is fast enough to keep up. - Yeah, it's not fast enough. - That is way too slow. There's no way we're gonna be able to wait that long. Okay. So we'll just fire up Linux? - Sure. - All right. The reason we're firing up Linux and doing this is not because we're expecting to see faster sequential speeds. I mean we were already at the theoretical limits of what that slot can do in Windows, but in Linux we have a lot more control over our hardware and we are expecting to overcome some of Windows as limitations in terms of IOPS. And IOPS are far more important for the kinds of applications that folks buying a carrier card like this might care about. So things like databases or many, many users accessing this storage all at the same time. It's a measure of how many operations per second our storage array can perform. Assuming that every one of those transactions is very, very small, which is much more realistic for. - For some context, normal SD is what? Like somewhere around a million? Like a really, really good SSD? Honey badger was somewhere around 4 to 6 million. - That was obscene. - Really, really fast. - Especially at the time. Okay. And go. What the hell? (Alex laughing) - So this is very small files to get around the PCIE limitations, but it shows you kind of the upper limits of what we can expect. - And like I alluded to when we were running tests in Windows, this is without the burden of a file system. It's going down. - [Alex] Yeah. - It's still stupid. Just wanted to check something. Can you think of any reason why our IOPS would gradually fall on this array as we run the test in Linux? - [Person On Phone] If it's doing any writes, then it could be because of that. - Oh, is it doing writes? - [Person On Phone] Is it doing writes? I don't know. I'm not entirely sure how it's doing that right now, but it could also be that it's heating up. - Okay. I suspect it's the writes thing. I just wasn't sure if this test was actually writing to the drives. - [Person On Phone] Yeah, I'm not sure if it is either. - It seems to be kind of settling in now anyway. And it's still at 40 million IOPS. - [Person On Phone] Yeah, I mean it could be that originally it was like really high burst because of the DRAM cache and all that kind of stuff. But now it's settled into the natural IOPS. - All right, see you later. So I lied earlier then. We did manage to overcome the SLC cache. Just it's still really fast. I do kind of wanna know where it ends up. - It seems like it's ending up here 'cause it went slower and now it's going faster. - Oh, yeah. Wow. I thought it would just kind of fall a lot. I mean the speed of an individual drive will fall by as much as like a 10th sometimes. - Yeah. - When it goes from cache mode to just like steady state where it has to do garbage collection in the background. That's really fast. There's just so much NAND that it can do things in the background and still pump out these crazy numbers. - Yep. - Now as much fun as that was, this is a serious tool for serious work and you're probably wondering, well just what kind of serious applications are people using cards like this for? We asked Apex Storage and while they couldn't give us exact names, they said that their pre-orders are from people who intend to use them for enterprise data center like applications. And this is to take advantage of the falling prices of Flash right now. Think of something like a high performance version of Backblaze where they can use consumer hardware and then pass those cost savings along to the customers. They also have pre-orders from folks in the digital forensic space who are excited by the size and speed with the ability to add cards into existing workstations. And they've had interest from high-end performance users and video editors who are excited to use it with 4K and 8K footage. Other than the capacity, I don't really see any reason why you would need this for video editing, but sure. There's apparently also people in the AI space since well, you work with these giant data sets and if you've got spicy GPUs- - We should chia mine on it. (Alex laughing) - Chew through a lot of data. In general, Apex summarized their customers as being really anyone who spends a lot of time writing to and reading from disks. The more IOPS and bandwidth that you need at this kind of capacity, the more it's going to improve your computing case. Some of which they probably haven't even thought of yet. And I share your sentiment. I'm also excited to see where people use these and I'm excited to tell you all about our sponsor. Tello! Are you tired of feeling like you're stuck in a phone plan that doesn't meet your needs or is too expensive? Meet Tello mobile's, Build Your Own Plan. With Tello's Build Your Own Plan you can create the perfect phone plan that suits your lifestyle and your budget. They've got options like 2 gigs plus unlimited talk and text for just $14 a month or unlimited everything for just $29 a month. So you can enjoy affordable and flexible plans that suit you. And that's not all. Tello also offers freebies like hotspot, wifi calling and unlimited texts. Plus, with international calls to 60 plus countries and eSIM included, you'll have everything you need in one plan. And for families, Tello offers individual plans for each line with no shared balance or extra cost per line, making it easy to manage multiple lines. You can even have up to 10 lines on one account. Finally, Tello offers a referral program where you can earn 10 Tello dollars for you and a friend when they place a successful order with your unique referral link. Order online, pop in your Tello sim and you're done. You can even keep your phone and number, which makes the switch even easier. So switch to Tello today by clicking the link in the video description. If you enjoyed this video, you might enjoy the last time we took a look at a Wild SSD carrier card, the liquid honey badger.",
    "transcript_keywords": [
        "PCIE",
        "Yeah",
        "PCIE slot",
        "drives",
        "slot",
        "Tello",
        "SSD",
        "raid",
        "Kind",
        "Apex storage",
        "Windows",
        "SSDs",
        "thing",
        "storage",
        "pin PCIE",
        "AMD PCIE raid",
        "lot",
        "Apex",
        "drive",
        "PCIE gen"
    ],
    "transcript_entity_values": [
        "3",
        "15",
        "one",
        "5:30",
        "100",
        "3.4",
        "SSD",
        "eight",
        "One",
        "zero",
        "GPU",
        "About 200",
        "13",
        "'21",
        "9",
        "10th",
        "Tello",
        "NAN",
        "1",
        "AI",
        "six seconds",
        "only three and a half",
        "1,500",
        "AMD",
        "Wild SSD",
        "FPGA",
        "three",
        "1,500 bucks",
        "11",
        "two gigabytes",
        "40 million",
        "Windows",
        "Linux",
        "21",
        "90 degrees",
        "like five hours",
        "Four",
        "PCIE Gen",
        "7",
        "10 Tello dollars",
        "first",
        "2",
        "SDS",
        "Sabrent Rocket 4",
        "Sabrent",
        "32",
        "19",
        "14",
        "Apex",
        "Tello",
        "35 degrees",
        "32 terabytes",
        "4",
        "6",
        "only three",
        "Six",
        "CPU",
        "six",
        "sec",
        "just $14",
        "Seven gigabytes",
        "60",
        "BIOS",
        "Honey badger",
        "Intel",
        "tomorrow",
        "Trustpilot",
        "over 9,000",
        "Only 500",
        "Windows",
        "four",
        "SD",
        "21",
        "2,800",
        "just $29",
        "FPGA",
        "around a million",
        "the dotter board",
        "Tello",
        "25.6 gigabytes",
        "16",
        "40/70",
        "at least five",
        "five",
        "Alex",
        "10",
        "M.2",
        "100%",
        "Build Your Own Plan",
        "Tello's",
        "16",
        "10",
        "two",
        "SLC",
        "month",
        "36",
        "4",
        "second",
        "12",
        "Apex Storage",
        "150 terabytes",
        "SSDs",
        "55",
        "PCIE",
        "seven gigabytes",
        "AMD PCIE",
        "IOPS",
        "168 terabytes",
        "the Apex Storage",
        "today",
        "Apex",
        "17",
        "8",
        "about 21",
        "2",
        "Windows",
        "Switchtec PFX",
        "74 degrees",
        "Linux",
        "50",
        "8",
        "5",
        "3.0"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "MONEY",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "NORP",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "MONEY",
        "LAW",
        "CARDINAL",
        "ORG",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERCENT",
        "WORK_OF_ART",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "LOC",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "GPE",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL"
    ]
}