{
    "id": "ihcGnBjUAm4",
    "title": "Who's Buying These? - MinisForum Elitemini B550",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2022-06-21T17:05:49Z",
    "video_url": "https://www.youtube.com/watch?v=ihcGnBjUAm4",
    "category": "Science & Technology",
    "tags": [
        "nuc",
        "nook",
        "intel",
        "adm",
        "amd",
        "rizen",
        "rysen",
        "ryzen",
        "miniitx",
        "minitx",
        "ats",
        "micro atx",
        "mini computer",
        "mini comptuer"
    ],
    "views": 1307216,
    "likes": 50395,
    "comments_count": 2424,
    "description": "Buy a Seasonic TX 1000 PSU:   Get your Crucial DDR5 RAM today at:   ATX? That's too big. Mini ITX? Nah, still too big. How about an upgradable NUC-alike where you can install your own AM4 CPU and slot the whole system into a bracket that holds a super powerful desktop GPU? Big when you need big, small when you need small. It's the perfect package. Or is it?  Discuss on the forum:   Check out the Minisforum Elitemini B550:   Buy a Ryzen 3800X3D:   Buy a Ryzen 5700G:   Buy an AMD 6800XT:   Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   SUPPORT US ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:    FOLLOW US  ---------------------------------------------------   Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0   Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 0:53 EliteMini B550 2:11 What makes it weird. 4:41 The Bracket 5:35 The Cables 7:14 The Big Moment 8:37 Testing and Thoughts 11:16 Outro",
    "description_links": [
        "https://geni.us/aryiquT",
        "https://crucial.gg/LTT_DDR5",
        "https://linustechtips.com/topic/1438596-this-was-cool-until-it-wasnt/",
        "https://bit.ly/3QOFf9g",
        "https://geni.us/WDWDj36",
        "https://geni.us/zyox9",
        "https://geni.us/JOgALCe",
        "https://lttstore.com",
        "https://www.floatplane.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- What, that big thing? You don't need that! You can fit the full power of AMD's Ryzen platform in the palm of your hand. Oh, what, you want more GPU? Well, guess what? She goes in. Boom, right, like that. All the GPU you could need. No compromises. No strings attached. Zero probab- - Hey, there's actually compromises. - Wait. There are compromises. Wow, man. Well, that sounds like a big problem for a little computer. And I'm about to get big money from a little segue to our sponsor. - Crucial. Don't just work faster, work better. Crucial's DDR5 RAM is engineered for efficiency. So you can load, transfer, and download files faster with less lag time and more efficiency. Get your Crucial DDR5 RAM today, using the links below. - It's been about a year and a half since we last covered Minisforum. And while we were on break, they have received some pretty bad press. Both GamersNexus and DerBauer found them guilty of both false advertising and some pretty, embarrassing product design mistakes around liquid metal. Now, from our perspective, both of those seemed more like gross incompetence than malice. So we're hopeful that Minisforum has cleaned up their act because this thing looks pretty freaking exciting. This puppy, the Elitemini B550, features a desktop-grade CPU in a full, fat AM4 socket, meaning you can BYO CPU. Party at Minisforum! The IO is good, but not groundbreaking. You got 2.5 gig LAN, dual HDMI. That's nice to have, but if we flip over to the bottom, we've got these external power connectors. That's a four-pin, and that's some kind of weird ten-pin thing. What the devil is that for? Then over on this side, we've got a little window for the discrete graphics card interface. Hold on just a gosh, darn minute, ex discrete graphics card interface. What the devil are you? Oh, no way! (gasps) It's a full PCIe 16X male interface. This is a lot of expandability for a system like this. A 2.5-inch drive, dual 80 millimeter M.2s. There's your wifi card. And then, and this? Trays, interesting. Oh, wow! Basically, your system goes here, and you put a discrete graphics card on it. You've got dual DDR4 SODIMM slots. These are populated by Kingston modules. Did we provide the modules? Or did it ship as a- - It shipped with it, but you're also still connected by a cable. - Yeah, yeah, that's fine. - Okay. - Don't worry about it. - It's still a delicate cable. - Then we've got a large, more, almost like a GPU-style cooler on it. Really flat, really broad, with what appears to be an 80 millimeter fan. Minisforum markets the system as user upgradeable. And while I do have my concerns about the ease of that upgrade, especially in light of these extremely difficult to connect wifi antenna cables, the fact that it does have a completely standard AM4 socket means that, yes, technically, you can do that. Well, I shouldn't say completely standard. We can already see, having removed the 2.5-inch drive bracket, that the back plate for the CPU, is not an AM4 standard back plate. Okay. So it's like a totally normal AM4 socket. You just don't have any of the additional like mounting points around it or anything. - [Adam] It comes with a 5700G. - Oh, that makes a ton of sense. It's got that onboard graphics, in case you don't hook up a discrete GPU, but still great performance. That's an 8-core. - And that's our thermal paste application, because we had to troubleshoot this computer. It was crashing all the time. Switched out every single part and it ended up being the CPU. - Oh, like it was a bad one. - The one that they shipped us ended up being the problem. - Wow, must be, very rarely see it. - I know. - A bad CPU. - [Adam] The cheapest configuration is bare bones which is no CPU, no RAM, no SSD. That comes in at $400. - $400 for a motherboard, cooler, power supply. And you also get the external. - Yep. - That's actually not that stupid. - No, not; not bad at all. And the full spec is $900. - Mm-kay, I'd probably build it myself then. I can see where this bracket goes now. That's pretty obvious. Um. Yeah. Yeah! Now, let's show you guys the party trick. (laughs) Just like that. And that PCIe slot, the male slot, essentially, is plugged into an extender now that turns it into a female slot, meaning that you can either run the onboard GPU or put a full, fat discreet GPU on this thing with, functionally, no size limitations. I mean, is this the biggest card you got? - [Adam] We have a bigger one. - Wait, is this that dead one, though? - It is the dummy one. - Oh for- - Ah, don't (chuckles). - If you have a triple slot card and a large shroud on it, it may actually interfere with this little piece of the bracket here. That seems like something they could have solved pretty easily by having it not do that. We could fix it with a Dremel, but we're not gonna bother. The confusing part right now, though, is how does power work for all of this? Clearly we've got our wall brick that plugs into, there you go, the PC itself. There are these, kind of internal power supply looking cables here. Oh my goodness. What the devil is this? - You do need this. These are extension cables, of which we do not know the pin layout. They're male to male. And they go straight ahead. They intend for you to use these with your PSU. Don't do that. - Yeah. (Adam laughs) - Because if your pinout is not the same, you will fry your system. Luckily, they've informed us that they are not actually including these in the final release, which is good. It's a very good way to protect consumers. Just like how our hats are a good way to protect your skin from the sun, lttstore.com. - Get a dad hat. 24 pin connector in here then. Boom, just like that, goes to the modular interface on our SFX power supply here. This is a pretty cool little unit from SilverStone, 80 PLUS Platinum, 750 Watt, you absolutely do not have to use a fancy one like this. Just any random desktop ATX power supply would work. What is that power? What is that 12 volt for? - That'll be for your CPU, I think. - Well, no, 'cause your CPU has to be able to be powered by the brick. - [Adam] No, you don't power. You do not have the brick plugged in at the same time. It's all gonna be through this PSU. - Well, it's not the kind of thing Apple would make. (Adam laughs) Apparently, a bracket for the power supply is coming. - [Adam] Yeah, there's no details on their website about which power supply will be supported by the bracket. - I mean, for now this is pretty, it's something. You ready for the big moment? - [Adam] Hope we plugged it in all right. (bird cawing) - You said there was some a (clears throat) troubleshooting. - Ah, well, this, it worked before (laughs), yeah. - Hey, it's working. Classic, have you tried unplugging it and plugging it back in. She's booted! It's working. - It's working. - [Linus] This really is not that small. - I actually measured it all out. - Yeah. - Because I was like, if you put this the powers supply right here. - Yeah. - It's just a sandwich form factor SFX case like the Ghost S1. - It's actually exactly that sandwich layout. That is, whoops, man. (Adam laughs) (TV signal tone rings) Man, I gotta say you can't fault the performance. At 4k Ultra Nightmare, we are sitting at anywhere from 150 to just shy of 200 frames per second in \"Doom Eternal.\" I mean, that's what you'd expect for a 6800 XT, hooked up via PCIe 16X interface, to a Ryzen 8-core CPU. I mean, that's the point of this thing, right? It's small, sort of (laughs), and performs fastly, I guess. - The other point is that it's also a, it's a fully enclosed mini computer. - How's the performance of the system without the rigmarole? - Well, by itself, it's pretty good. The 5700G is a 65-Watt CPU. So it's not super hard to keep cool, but this thing does it really silently, even trying to put it through a thermal torture test, it only ever got to about like 67 degrees on the GPU. - Right. - And 72 degrees on the CPU. - [Linus] Even now the vast majority of the noise is actually from the GPU. - Yeah, and if you wanted to, you could even run it with PBO, physician boost overdrive, that is really pushing against the 120-Watt power supply, though. - Mm, yeah, I don't know if I'd recommend that. - And probably wouldn't recommend it. I even got it to run a 1050 Ti, also pushing up against the power limits. - Wait without external power. - Yeah. Without external power. - Ooh. Yeah, I wouldn't recommend that either. - But you can. The downside is that there's no room to grow. With a 5800X 3D, it handled it, but you never got full boost clocks. - Right? - So, what upgradeability is there really? - Basically nothing. I'm having a hard time trying to figure out who this is for. I can afford a GPU. I care about gaming performance or why would I buy this? But I don't always wanna take my GPU with me. I wanna be able to pull my CPU, storage, RAM, and motherboard off, go get a brick, power brick, to take with me, and then I'm gonna pack them together. I'm gonna go, but I don't need my GPU. - I feel like what they could have done is if they made it so that this whole platform has like extensions for all of your power, you plug this little platform through here, and then you can just slot this in. All of the plugs are on the same side. You slot it in, you take it out. Power's delivered on the same side your PCIe lane is on the same side. Then it's literally like you walk, you go, oh I need to get going somewhere, yoink. - Yeah, but, Why are you taking this with you? - I don't know, maybe, you bike to work (laughs). And like, this is a little bit too much. - You take this to work with you? - Like maybe you're in a co-working space and you have like important documents, but you also have the same system. Like if you're a contractor, maybe you want the small computer to take somewhere with you. - Get a laptop. - Yeah, I know. But maybe you want more power. - Maybe you want this message from our sponsor. (laughs) - Seasonic. Seasonic's Prime TX 1000-Watt power supply is a great choice for high performance systems. It features an 80 PLUS Titanium rating, which means less power gets wasted during power conversion. The TX-1000 is also fully modular and features hybrid fan control to control overall fan noise with fluid dynamic fan bearings. Plus it comes with a 12 year warranty, 12 years! If you're building a new system and looking for a power supply you can rely on, you can trust Seasonic. Learn more about them on seasonic.com or through the links below. They're always there. - If you enjoyed this video maybe go check out one of our mini-ITX builds. They make kind of a bit more sense than this, especially when you factor in how quick it would be to just unplug the GPU from it, and take that with you on the go, compared to all these cables you're gonna fight with, with this thing.",
    "transcript_keywords": [
        "power",
        "Yeah",
        "power supply",
        "CPU",
        "GPU",
        "supply",
        "pretty",
        "thing",
        "system",
        "card",
        "slot",
        "full",
        "RAM",
        "external power",
        "work",
        "Minisforum",
        "interface",
        "good",
        "bracket",
        "brick"
    ],
    "transcript_entity_values": [
        "750 Watt",
        "ATX",
        "one",
        "DDR5 RAM",
        "second",
        "four",
        "Elitemini",
        "2.5-inch",
        "Apple",
        "LAN",
        "Seasonic",
        "12 year",
        "Doom Eternal",
        "Ryzen 8-core",
        "DerBauer",
        "Dremel",
        "Crucial",
        "80",
        "16X",
        "GPU",
        "Classic",
        "today",
        "Kingston",
        "about a year and a half",
        "900",
        "XT",
        "120",
        "the Ghost S1",
        "12 years",
        "67 degrees",
        "80 millimeter",
        "GamersNexus",
        "5800X",
        "RAM",
        "a ton",
        "8",
        "Minisforum",
        "400",
        "12 volt",
        "AMD",
        "1050",
        "150",
        "ten",
        "BYO",
        "Minisforum",
        "PSU",
        "200",
        "72 degrees",
        "Ryzen",
        "6800",
        "1000-Watt",
        "CPU",
        "5700",
        "Adam",
        "SilverStone",
        "Linus",
        "CPU",
        "65-Watt CPU",
        "PBO",
        "2.5",
        "24",
        "IO",
        "Zero"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL"
    ]
}