{
    "id": "IHs-QqUik4E",
    "title": "Real World Hacking with OTW (Privacy and Cybersecurity IoT warning)",
    "channel": "David Bombal",
    "channel_id": "UCP7WmQ_U4GB3K51Od9QvM0w",
    "subscriber_count": 2650000,
    "upload_date": "2023-08-06T14:00:09Z",
    "video_url": "https://www.youtube.com/watch?v=IHs-QqUik4E",
    "category": "People & Blogs",
    "tags": [
        "botnet",
        "iot",
        "otw",
        "occupy the web",
        "hack",
        "hacking",
        "hacker",
        "pegasus",
        "cybersecurity",
        "spyware",
        "malware",
        "iphone",
        "android",
        "infosec",
        "information security",
        "wifi",
        "linux",
        "tails",
        "privacy",
        "cyber security",
        "ethical hacking",
        "online privacy",
        "kali",
        "kali linux",
        "moveit",
        "breach",
        "cyber",
        "real world",
        "xiaomi",
        "iot hack",
        "iot hacking",
        "smart home",
        "python hack",
        "hack python",
        "security",
        "how secure",
        "home hack",
        "home security",
        "samsung",
        "app",
        "app security",
        "iot security",
        "internet of things",
        "authentication",
        "encryption",
        "mirai",
        "mirai botnet"
    ],
    "views": 109812,
    "likes": 3653,
    "comments_count": 249,
    "description": "Should you be using IoT devices? Think carefully ... there is a new Botnet out there targeting IoT devices. IoT devices unfortunately often have very poor security.... and can be targeted.  // Juniper Free Training // Big thank you to Juniper Networks for supporting the community and making this training free (and sponsoring my channel). Go to  to get lots of training and also learn how to get certified for $50 (Associate Level). Use this voucher code to register for your courses: DAVIDBOMBAL  If you have issues with the Juniper registration, please use these links that they gave me: For Login assistance link  Customer Support link-   // Occupy The Web SOCIAL // Twitter:   // OTW Discount // Use the code BOMBAL to get a 20% discount off anything from OTW's website:   // Mr Robot Playlist //   // David's SOCIAL // Discord:  Twitter:   Instagram:   LinkedIn:   Facebook:   TikTok:  YouTube:    // Occupy The Web books // Linux Basics for Hackers:  Getting Started Becoming a Master Hacker:  Network Basics for hackers:  Top Hacking Books you need to read:   // Book Discussed // If its smart its vulnerable by Mikko Hypponen:   // Other books // The Linux Command Line:  How Linux Works:  The Car Hackers Handbook by Craig Smith:  Hacking Connected Cars by Alissa Knight:   // Louis Rossmann YouTube // Louis Rossmann:    // MY STUFF //   // SPONSORS // Interested in sponsoring my videos? Reach out to my team here: sponsors@davidbombal.com  // MENU // 00:00 - Coming Up 01:40 - Sponsored Segment 03:17 - Welcome Back, OTW! 05:11 - OTW's New Course 06:42 - Hacking IoT 07:00 - Botnets and DDOS 14:03 - OpenWrt 18:34 - How do Botnets get Access? 21:57 - Electronic or Manual Locks? 26:28 - TikTok 30:24 - You Buy but You Don't Own 32:22 - Ring Doorbell Story 33:31 - Right to Repair 36:05 - Hacking Vehicles 40:44 - Luddites 47:00 - Conclusion  iot mirai mirai botnet otw occupy the web internet of things hack hacking hacker cybersecurity  Please note that links listed may be affiliate links and provide me with a small percentage/kickback should you use them to purchase any of the items listed or recommended. Thank you for supporting me and this channel!   Disclaimer: This video is for educational purposes only.   #hacking #cybersecurity #iot",
    "description_links": [
        "https://juniper.net/davidbombal",
        "https://userregistration.juniper.net/loginassistance",
        "https://support.juniper.net/support/requesting-support/",
        "https://twitter.com/three_cube",
        "https://davidbombal.wiki/otw",
        "https://www.youtube.com/playlist?list=PLhfrWIlLOoKNYR8uvEXSAzDfKGAPIDB8q",
        "https://discord.com/invite/usKSyzb",
        "https://www.twitter.com/davidbombal",
        "https://www.instagram.com/davidbombal",
        "https://www.linkedin.com/in/davidbombal",
        "https://www.facebook.com/davidbombal.co",
        "http://tiktok.com/@davidbombal",
        "https://www.youtube.com/davidbombal",
        "https://amzn.to/3JlAQXe",
        "https://amzn.to/3qCQbvh",
        "https://amzn.to/3W1iiCQ",
        "https://youtu.be/trPJaCGBbKU",
        "https://amzn.to/3GdCbR0",
        "https://amzn.to/3ihGP3j",
        "https://amzn.to/3qeCHoY",
        "https://amzn.to/3pBESSM",
        "https://amzn.to/3dDUZN8",
        "https://www.youtube.com/@rossmanngroup",
        "https://www.amazon.com/shop/davidbombal"
    ],
    "transcript": "When we talk about the Internet of Things, we're talking about you know cameras and routers and light bulbs and refrigerators and all the things in our lives now okay in the industrial world, industrialized world that now have digital capacity and these things generally have a very small Operating System inside them and what these people are doing is that they're taking control of the small tiny Operating System. This is here um this is OpenWrt okay, this is a tiny little Linux but it's really small it's like 10 megs less than 10 megs in size and this is what's embedded inside of these IoT devices. So OccupyTheWeb you've been in this game a long time would you buy electronic locks on IoT devices would you stick to manual as a recommendation? uh I I always use physical locks and so there's a scene in Mr Robot where they think it's in Season 3 where they social engineer law enforcement and and call had asked them to slow down the vehicle that's chasing them so so those of you who have GM OnStar enabled vehicles you basically are giving up that control of your vehicle they can shut off your vehicle, they can't do that. Now right now only law enforcement has control of it. [Music] Big shout out to Juniper Networks for sponsoring this video and making a huge amount of their training available for free I'm a firm believer in getting certified, I'm a firm believer in IT training why because it changed my life I used to work crazy hours in a retail environment but my life changed when I got certified when I started learning about IT and I believe that you can do the same. This is fantastic you can get free training from Juniper not just for networking but you can also get Security Training, Cloud Training, Devops training. So they have all of this Associate Level Training for free but as they say there's more, but wait, you can get Specialist Training, Service Provider Enterprise Security for free from Juniper and there's more another one Professional Training available for free. Now there are some prerequisites you have to pass an Associate Level Certification before you can do some of this training but the point is is that you can get training for free and they've bundled their JNCIE Training when you purchase an exam package. A lot of people will say David but what about the exams you know exams are expensive, and that's what I love about what they've done here. Once you've gone through the training you can go through an Assessment if you get 70% or higher for that Assessment so make sure that you study then you get a 75% discount on the exam. This to me is one of the ultimate sponsorships working with a company like Juniper highly regarded in the industry you get free training if nothing else go and learn about how to secure networks using their free training but I personally wouldn't stop there I would go and get certified please use the link below, go and show them some love. Thank you for Juniper for sponsoring my channel thank you for making training like this available. Hey everyone David Bombal back with OccupyTheWeb welcome. Thanks David it's always an honor to be back on the best IT and cyber security YouTube channel. I really appreciate you saying that just for everyone who hasn't seen our previous videos OccupyTheWeb is the author of this book, OccupyTheWeb you're giving me some good news about this book offline, this is in like the top 2000 on Amazon at the moment or something right? It's selling extraordinarily well yeah it's uh it actually was as high as the top 1000 books of all books on Amazon which is a just an extraordinary record very few Tech books ever achieved that. Exactly I mean that's fantastic, so for everyone who's watching go and look on Amazon go and look at the reviews there's a reason that the books in the top 1000 or 2000 of all books on Amazon I personally highly recommend this book and OccupyTheWeb hopefully very soon I'm going to convince you to do videos on your book right? Yeah we'll uh we'll do them in this fall and we'll have them out in September October. That's great so expect that we're going to do a video series based on the book so companion Guide to the book, if you like OccupyTheWeb also the author of this book Getting Started Becoming a Master Hacker and more recently Network Basics for Hackers and again I always say this and uh this is my honest opinion, what I love about your books is that you keep it simple you have all this experience but you approach everything from a hacker's mindset which is great to see. Thanks David good we try really hard to try to make what seemingly is complex hacking and IT systems and trying to make them simple because really when you boil it down these are really simple systems and once you get down to the fundamentals there's there's nothing too complex about these systems so that's what we try to convey in the books and in our classes. You know I want to talk about your classes because you're telling me offline and just for everyone who's you know is watching there's a reason that we only do specific topics if you want to like get into really interesting things that we can't put on YouTube because of all the rules then you know use the link below. OccupyTheWeb you've got to tell me about two things number one what was this course that you you were telling me that you wrapped up yesterday and what's the great news about some kind of discount? Oh well we're going to offer to all the viewers on your channel 20% off use the discount discount code Bombal right and you can get 20% off anything on our website and we just finished we just finished up a course on SDR for Hackers and at the end of that course we started doing Hacking of Mobile Systems, the Cell Systems as well as Satellite Systems and we have an advanced course coming up in 2024 where we're going to be looking just exclusively at mobile systems and satellite systems and what do people recognize is being able to pick up satellite transmissions is relatively simple to do and be able to pick up both the text messages and the data and the voice that's being transmitted across these Satellite Systems is most of it's unencrypted and openly available to anybody who has the equipment to do so so that's what we've been doing in that class and we'll continue and expand upon that in the advanced course. So everyone who's watching let us know the kind of topics that you want us to cover I was thinking about perhaps SDR OccupyTheWeb like Flipper Zero, Hack RF maybe some devices like that? How about hacking IoT? Yeah that'd be great yeah that would be nice and I mean actually that brings us to our topic today right because you are you you're talking about a botnet that's that's the becoming important in the last like few weeks is that right? Yeah we have a botnet it's kind of a return of an old botnet yeah so what's what's new is old and what's old is new in 2016 we had a botnet that probably most of your viewers are familiar with called Mirai and and Mirai was a was just well if you if you think about it in terms of success meaning how many systems they're able to knock out the Mirai botnet is one of the most successful DDoS attacks in history. So what happened is a few young men they are they were young men who who had developed a company for DDoS protection and so what they did is they started ddosing companies to try to essentially sell their product DDoS protection, so we say DDoS we're talking about Distributed Denial of Service and what made this particular DDoS attack different is that it used IoT devices the Internet of Things and we talk about internet of things we're talking about you know cameras and routers and light bulbs and refrigerators and all the things in our lives now, okay in the industrial World industrialized world that now have digital capacity and these things generally have a very small Operating System inside them and it's almost always Linux okay not always but almost always Linux and what these people are doing is that they're taking control of the small tiny Operating System right these things are all connected to the Internet otherwise they couldn't communicate, they have to be connected to the Internet. So they're connected instead of trash I like to say but well some people like to say but anyway sorry Internet of Trash.So we've got all of these things that are all connected to the Internet and all of most of them are very simple um they have very little security they don't use encryption and so the original Mirai botnet basically took advantage of that to take control of all these hundreds and thousands of IoT devices and then use them to send packets all right traffic at the target and they were able to generate huge amounts of traffic this is a typical DDoS you know in the past DDoS attacks, well for instance when the Ukraine Russia War started there was thousands of us who participated in uh DDoS attack against Russia and we were able to shut their infrastructure down for about six weeks that's a little different that it's somebody's sitting behind a computer here we have it's a little bit different in that we have a botnet where we have one person who controls thousands maybe even millions of devices that are then capable of sending traffic sending packets at the target and they can really disrupt the capabilities of anybody right through their target and so we've got this new Mirai developing in the last couple of months, okay so Mirai was 2016 and now we've got a new Mirai that's taking advantage of IoT Internet of Things largely these small Linux Operating Systems that sit inside these devices and they're embedding some Shell Code inside there and that Shell Code then allows the head of the botnet you know one person or group of people who then control all these devices and then those devices all will simultaneously send traffic to the target and if you send enough traffic to any target you know you can shut them down you can basically you can take up all of their resources so that nobody else can connect to them. That's basically what a DDoS attack is a Distributed Denial of Service which is distinctive from a DoS attack it's a Denial of Service and Denial of Service attack is a little bit different it usually is a little more sophisticated and it doesn't require a botnet or millions of users it requires the capability of trying to shut down a server like for instance the BlueKeep attack of 2019 was an attack against Windows machines that were running RDP Remote Desktop and it was capable of basically blue screening the the blue screen of death on those windows machines and that's different than a DDoS that's where you get the system to reboot itself or freeze up and so that it can't work, DDoS is a little simpler in that it just uses up all the resources and just sends so many packets at a system so that you're not able to receive packets from legitimate sources and we've got a new one of these a new Mirai developing right now so we've seen it in the while and we haven't seen it actually DoS DDoS anybody yet but we've seen it developing in the wild and so I kind of wanted to put it out there and let people know that this is coming that may be hitting you anytime soon here and it and it's going to look like it's coming from you know some camera or router or other IoT device and then you know it has a capability of shutting down your system. Question always is how do they get access to all of these devices is there vulnerabilities in the device or is it like just default passwords how do they get access to all of these devices with the spot to create the spot net? Well the original variety they largely just use default passwords you know it was many of these devices were put out there with just default passwords and they were able to to do that and that's you know people are thinking about Security in these IoT devices but you know we tend to not think about these IoT devices but they're they are literally they are Operating Systems and they're Linux Operating Systems and if somebody can get into them and they can put in a little bit of Shell Code a tiny bit of Shell Code they then can control it shell code is basically like a listener or rootkit it's just a way for the bot herder or the bot command and control to control it if you've ever used some something like Netcat or what have you it's just a way to control the system remotely and so it doesn't take much in the way of code to be able to put it into one of these Linux systems and then control it and then get it to send traffic to a target system as a matter of fact um I have to to show your viewers I have a small Linux you just kind of give you some idea this is here um this is OpenWrt okay this is a tiny little Linux I mean there's not a whole lot that we can really show it's got you know it's got if you go into CD bin you know that's where all the commands are at you can see what commands are it's capable of the things that we're all used to like ps you know and commands sometimes are a little bit different pwd shows me it's in the bin directory it has bi and a number of other it's it's a much smaller version of the Linux that say you'll see in a Kali or a Debian or a Ubuntu or a Red Hat but it's really small it's like 10 megs less than 10 megs in size and this is what's embedded inside of these IoT devices so it doesn't take much for somebody who has the username and password on the system or find some other vulnerability in it which oftentimes what happens is that they'll take these tiny Linuxes and use a simple web server on them that'll allow for configuration what have you and they can attack that web server get inside embed some Shell Code in there and then use this as an attack vehicle against whoever they're targeting this is OpenWrt is is a project it's an open source project that builds tiny Linuxes to embed inside of devices you know like routers right. The most famous is routers right? Sorry go on. Yeah, yeah it's it's I think WRT stands for Wireless Router Technology or something like that and so they have hundreds literally hundreds of of Linuxes I'll show you their website. Here's a sampling of some of these are for Netgear here and the Meraki uh these are Operating Systems look at the size of these Operating Systems the tiny tiny Operating Systems and the one that I'm showing you here is a little bit bigger than these this is about the one I'm showing you is like 10 10 megs okay, this is like 6.3 megs, right 7.6 meg and this is what we'll be using to build our femtocell that we have a class coming up this fall I'm building a femtocell which is not a mini cell tower so we'll be building our own femtocell and we'll be using WRT to build that so these are just simply tiny Linuxes which once again makes the case for why you should know Linux because because all of these I have to refrain from saying all but nearly all of these devices are built with these tiny Linux Operating Systems inside of them and if you know a little bit of the basics of Linux you to get inside these IoT devices and play around and do what you want you can build your own and that's what we'll be doing in our classes we're building we'll be starting from this framework that OpenWrt provides us and then build our own little Operating System that'll allow us to create a femtocell that will be able to capture cellular traffic. So yeah this is this is a a cool little Operating System it's uh it has most of the capabilities but there is no GUI, there's only the basic commands you know even if I tried to do a ps on it right and so I tried to do the ps or ps w right there we go, ps w works but ps aux which we're used to using okay does not work right. So it's it's a paired down version of what we're accustomed to working with in in Linux but it works you know it does it does all the things that Linux does but without many of the bells and whistles but you can always add the bells andwhistles to it to make it do what you wanted to do but this is what's inside of all these IoTdevices that the Mirai botnet is taking control of and using it as a tool to run DDoS attacks. OccupyTheWeb it just helped me because I'm slow how did they get access to these devices on internetis it just is it like in the old days where they use default passwords or is it some othervulnerability or something? In the original they used default passwords in the new version they'rethey found vulnerabilities in some of these devices and there's a number of vulnerabilities because when people are when companies are building these security is not the first thing ontheir mind and so they found vulnerabilities that they can go out and remotely attack these systemsand put remote code RCE's Remote Code Execution inside of these Linux Operating Systems and thencontrol them and they can control thousands of them and use them for attacking whoever theydecide to target and usually they hold them for ransom the whole idea is to try to hold them for ransom we're going to knock out your systems unless you pay us money and and that'sthat's basically the business model for these types of things. In the case of the original Miraitheir business model was to sell their anti-DoS software which you know there's a lot of goodI should record that yeah yeah there's a lot of good Anti-DDoS software out there by the way as manycompanies who sell Anti-DDoS software and and most of it works really good so you know that's somethingthat if you're on the defensive side you know that you might consider is to to go with somebodylike radware or cloudflare who sells Anti-DDoS protection and then of course I don't have oneof these but I know that they sell refrigerators right they sell refrigerators that will actually Iguess you know there's some refrigerators that can actually order food for you right I mean they gotto be connected to the Internet somehow to be able to do any of those things and sometimes they'rejust connected for tech support too but in any case there's all these new devices that were thatare coming part of our daily lives they all have little Operating Systems in them mostly Linuxand oftentimes not always oftentimes I connect them to the Internet if they're connected to theInternet then they can be hacked oftentimes these systems that are not as secure as theyshould be. Well we we as you probably know we we hacked a lot of cameras in Ukraine and Russia andthose were those were incredibly easy to do. Once again those those systems have tiny little Linux in them right and they had both simple passwords default passwords and some of them have flaws in them and usually those flaws come up with the way that they do password resets so almost all the time these systems have to have a way to reset the password right and then resetting the password has to be done remotely so you can exploit those those password reset settings to change the password to a new password that only you have and the original user does not and that's what we did and many of them is simply change the passwords by using those password remote password reset settings on those systems. So OccupyTheWeb you've been in this game a long time would you buy electronic locks and IoT devices or would you stick to manual as a recommendation. uh I I always use physical locks. And like like your heating and stuff is it like I would is it like all the old school stuff or if you like use all this new stuff? It's old school I don't want to give anybody I won't to tempt anybody to hack my house so it's all old school it's not connected to the Internet uh my locks are physical locks you know if you're here you can try breaking the locks but you're not goingto break them remotely. Ah so yeah I mean from a security point of view it just sounds like I theless IoT you have the better. Well I mean there's there's kind of a a rule and the rule is that the, the more digital things you have in your life the more vulnerable you are and it's a rule that we all have to keep in mind so every time that you buy a new device okay if it's electronic if it's digital and this sort of electronic but digital then and it's connected to the Internet thing you're susceptible to having that system soon be hacked and so I don't even have youknow remote cameras connected to the Internet um just because I know that it's too easy to hackthem and you know I can do what I have I can put my security in without connecting anything tothe Internet and I prefer to keep it that way no I may change my mind in the future but rightnow that's the case so. I think it's just really interesting because you've been a hacker for manyyears and you've hacked crazy systems great to get your perspective for people who are you who areunaware of all the vulnerabilities like a lot of people buy these shiny new toys oh I can controlmy fridge by Alexa to me that just sounds like an absolute nightmare, All right I agree it's uhI know people they get they get a thrill out of control in your fridge you know lights or you knowwhat have you by Alexa but you know we you always have to keep in mind that all of that convenience comes at a price I'm I do have an Alexa but I'm a little weary of her I'm an Alexa I have it turnedoff I only use it for demos I really careful about what I talk about in front of Alexa I have Alexa but I don't talk about anything that's confidential in front of Alexa Danielle says herAmazon device and her Portland home recorded a private conversation and sent that recording to arandom contact which happened to be the employee in Seattle it's pretty clear that one of the reasons that you know all of these companies are giving us or providing these devices is thatthey want to use them to collect data on us right so not only are they susceptible being hacked butthey're collecting data on us now some people say well I have nothing to hide I'm not committing itI'm not committing any crimes I have nothing to hide your first mistake yeah going through yeahfirst mistake I mean privacy is a is something that I think most of us value it is a human rightto have privacy and we have companies like Amazon and meta you know just selling our most privateinformation and I think that's something that we need to be concerned about I mean privacy isa human right we we have a right to be private and these companies are abusing that right andthey're saying well we're not looking at anybody in particulars you know we're not looking at yourswe're just putting it into a big computer system that then recommends advertising to you whateveryeah whatever I could trust Zuck for sure right exactly so you know I I said on this show beforethat uh you know if if a service is free right you know you're not the customer you're theproduct right and you're if if they're giving you away Facebook for free I mean how do theymake money then well they make money by selling your information they're selling your privacy and you're giving them all of that information you're providing them basically the the fuel that runs their engine and the same applies for tick tock as well and that's one that we probably need to talk about in that well Tick Tock is a Chinese company that has ties to theChinese government Tick Tock gathers all your information sends it back to the company there is a national security issue there you know when we're talking about IoT one of the more interesting casings of IoT hacking or IoT vulnerabilities is that in the U.S at least I think in Great Britain as well that who I um products are banned the Chinese big Telecom company networking company who I um their products are banned in the US and Great Britain and some other countries as well why because it's way too easy to put in a back door or some Shell Code that would give the Chinese access to those systems okay so that's why they're bad that's why you can't buy them in U.S is because of this uh well they've discovered back doors Shell Code in them and then it'd be real easy for the Chinese simply to type in shut down shut down now right from remotely and shut down the system and uh actually this one doesn't even have a shutdown in it this little uh OpenWrt so it shows you how how paired down it is but you can put in you know that command in there and shut it down and so this is why you know we have to be concerned about these IoT devices it's why the Huawei products are not sold or in the United States I guess there are some in the United States and there are some in Great Britain but the newer ones have been banned because of the risk that's involved here it's real easy to embed Shell Code in these tiny operating systems and then allow somebody to remotely control them and I think that's true it goes the other way too I mean if you're selling the counter argument would be the US is doing the same thing so exactly I mean right and the U.S companies you know the large number of them who sell networking and IoT products you know can easily put in some Shell Code now you know what they'll tell you okay this is there's some validity to this argument is that we need to have that Shell Code in there so that we can connect to do Tech support and updates and upgrades and what have you right I mean that's that's a legitimate argument but it doesn't preclude them for using it for other purposes as well if you're China can you build your entire Internet infrastructure on American networking products there's a vulnerability and national security vulnerability that applies there as it does with the US or Great Britain or anybody in Europe so you know one of the things that we need to think about and I don't think is often talked about enough is that these products have National Security implications to them to all of us whether it be Russia or China Great Britain or Israel or the US or anybody else out there right that the products that you buy for building your Internet and building your IoT infrastructure have National Security implications because it's easy enough for each of these products to have a little bit of Shell Code and that's what we say Shell Code so some people refer to as a back door that just allows somebody to remotely get into the system and then do whatever they want with me and so if we're in a conflict you know and you have your whole Internet Infrastructure is built on my products you know I can just shut your shut off your whole entire Internet this is something that we're dealing with in this new world of ours you know especially now that we have IoT devices too I might be able to shut off your refrigerator remotely. There's any there's an interesting story in the UK I I keep getting asked to get a smart uh meter in the UK so like for my gas and my electricity and stuff right and I keep refusing that because there's been cases in the UK where people haven't been able to pay for their gas or their electricity um to their homes for whatever reason and then the companies have remotely turned them off all right they've remotely put them on a bad tariff or remotely put them on prepaid so in other words they have their their gas or electricity goes off unless they you know top up the meter and I mean that's just to me crazy I'd rather have like all the analog traditional stuff that I can control and like you said no one can have access to for hacking but also you know just to have control over the stuff in your own home it seems crazy um Lewis Rosman does a lot of you know this these talks he is great he has a great Channel where he talks about the fact that you buy it but you don't own it and John Deere is a good example of that and I like to repair movement and all of that it just seems crazy that if you're giving your devices if you're buying all of these electronic devices they're all connected to the internet and then they have to have a subscription so that's even worse makes it a whole nother level of craziness I think the famous example recently is BMW uh telling you that you have to pay a subscription to have heated seats in your car so the car comes with the heated seats but they can't be used unless you have a subscription I mean I did I didn't know that yeah it's it's insane or John Deere with it with the where the farmers in the US as an example might be in the middle of nowhere and then you know they can't service their own tractors or whatever it's just it's crazy so I'm with you on the fact that I'd rather have analog stuff as much as possible this whole thing where it's connected to the Internet is is bad enough but it gets worse where it's connected to the Internet and then they can remotely control it. Did you hear Louis also did this example where did you hear the story where someone at home had an Alexa or had a doorbell I think was the was the ring doorbell um a guy came to the house to deliver a package and then he heard something and he thought it was a racist remark or something and then Amazon disconnected that person's account and the guys like he um complained about it because he said you know I wasn't even at home so the delivery driver had heard the incorrect uh information um but the point is is that that Amazon shut down his prime account shut basically blocked him from Amazon because a delivery driver complained about him making a comment through a ring doorbell or something. um wow. That's insane so I mean I think that's the next level of craziness that people have to be aware of and Louis does a whole I'll link his channel below he does a whole bunch of videos which are fantastic to go and watch where he talks about a right to repair he's been advocating this for a long time in the US it's just insane where if you buy all of these electronic devices that they that can be hacked is what we're talking about but also that companies can then control your life. Yeah right to repair I mean you uh you know I I don't think I'd ever I've never purchased something that I don't have the right to repair and I would really be reluctant to purchase anything that I don't have the right to repair I know that John Deere does that and uh I think that's it's a good idea that the buyers reject that but...It's a huge it's a huge thing a huge problem I mean it's getting worse and worse I mean the BMW heated seats example is just another like crazy example yeah. That's crazy yeah yeah Louis has a whole bunch of videos where he gives examples like this I'm trying to think of some other good ones but yeah the Alexa one I will never have an Alexa in my house on for you it's just like they're listening in or whatever or like a ring doorbell is just crazy so from a privacy point of view I mean I say this but you know it's you've got to decide for yourself but it's um is it privacy that you want or do you want ease and um I mean I think what's nice about talking to you is like the hacking side of it is just another level of worrying apart from the corporate companies trying to sell your data or control your life or whatever you think about it. Yeah I mean if we started thinking about this control that the companies have um you know and maybe those companies are benevolent okay supposedly but but imagine that all of those devices got hacked by a malevolent okay entity right and they could do things like cut off your gas or what have you cut off cut off all of your systems in in some type of attack against you or your city or your state or your country so these devices all have vulnerabilities okay every elect every digital device can be hacked it's just a matter of how hard is it to hack and in these IoT devices there's really very little in the way of security that's built into them and so as a result they tend to be relatively easy to hack and what we're seeing is that that's leading to these botnets of IoT devices that are then used for DDoS attacks but you know we can imagine a lot of other scenarios here right I mean if if you hacked everybody's ring doorbell right and then you could rake a lot of havoc on their lives or their Alexa's or you know the refrigerators or is it what about calls you know the connected cars is the next big I think kind of once it's coming yeah there's a there's a scene in uh in Mr Robot where uh he uh they're being chased by I think it's by the the the the Chinese hackers in a General Motors vehicle Tahoe or something like that and and the social Engineers the law enforcement to be able to use the OnStar they have these the OnStar and GM vehicles um that allow law enforcement to literally slow down your vehicle so that if they're chasing a vehicle so law enforcement they're chasing your vehicle and it's a it's a General Motors OnStar enabled vehicle law enforcement can literally push a button and not stop it but slow it down and so there's a scene in Mr Robot where they think it's in season 3 where they social engineer law enforcement and and call ahead and asked them to slow down the vehicle that's chasing them so may I help you yeah I need to report an emergency this is detective Robert Abernathy badge number 83011936 we need to initiate to slowdown okay VIN number here we go yeah uh okay I seethe lights blinking. So those of you who have GM OnStar enabled vehicles you basically are giving up that control of your vehicle they can shut off your vehicle they can do that now right now only law enforcement has control of it but it may be others. I think the concern is more and more cars are becoming more and more like computers right I mean it connected cars are causing me connected to the Internet permanently um it's like a big worry I mean it's a it's not like a toaster it's it's a different level of of worry when it's a when it's a call yeah I think that uh I think more and more vehicles almost all the new vehicles are connected in some way to the Internet whether it be through GPS or if it's connected to the entertainment system Bluetooth Wi-Fi there's always some connection that people can hack into the vehicle and we've seen the many examples of that done already but it gets more and more complex and more digital aspects to the car the more vulnerable it becomes I often joke that most cars like most cars are a automobile that has added digital aspect the computer they've added a computer to through the vehicle a Tesla is a computer that has a car built into it it's the other way around and so a vehicle of that is that complex and that advanced is probably the most vulnerable to these types of attacks. And and I think Tesla have opened up the way and a lot of other vendors seem to be following that same path especially with electric vehicles right? Yeah they're getting more and more complex and many many systems all these digital systems in them there's you know there's computers throughout that CAN Protocol so the cars all the devices inside of an automobile are all connected on a simple what's called a CAN Protocol Network and if somebody can access that CAN Protocol and we've had recent examples of where hackers have been able to get into the network from the exterior so for instance through the headlights in other places where they can get into the network and then they can send commands back into the vehicle from the wires in the headlight because the headlights are connected to the network right exactly once you're once you're inside the network there's no authentication there was no encryption and anybody can send commands through that Network that's one of the things we do in our automobile hacking classes if you can get into the CAN Network okay then you can send commands in there that can start the car, can turn the cars and hit the brakes, accelerate the car, those are all things that there are commands on the CAN Network to activate those this is something that we have to be thinking about in IoT devices are just expanding the amount of things that can be hacked and can be used against us then there's also the question you know we don't want to be a luddite right and say we want to see. I'm going to buy I'm going to buy a classic car I'm going to live with like no electronic devices yeah it's it's like balance right sorry go on. Exactly that's that's what I was coming to is that we have to balance it about against being a luddite, we can't we can't stop progress I mean people have tried in the past and a lot of it's those of you who aren't familiar there was a group I think they were in England weren't they they were in England they they they tried to stop the uh the movable press because it was putting people out of out of work and so when we talk about people who are anti um technology we often use a term luddite because that's the group was called the luddites but and and that's never worked right it's never worked to be anti-technology and anti-forward moving in terms of technology I I refrain from using the word progress because sometimes new techno new technology is not progress right exactly but we need to be critical we need to be critical of the way that technology is being used we need to think about how it's being used and what we want to allow into our lives and you've decided not to put in Alexa in in your home, I've decided to not talk about anything confidential in front of my Alexa but this is the kind of at least we're thinking about we don't necessarily agree on it everybody's going to be different in terms of the amount of privacy and vulnerability they want to accept but but in 2023 we need to be thinking about these issues and not just go oh wow this is wonderful you know. I was going to say this I interviewed Mikko he wrote this book if it's if it's smart it's vulnerable he's going to use that quote yes oh okay yeah yeah if it's smart it's vulnerable yeah and it's his quote so he gets it's attributed to him he he was talking about the fact that you know even if you try and stop this the manufacturers are going to start putting 5G chips inside toasters and fridges and any everything anyway um I mean at the moment you can buy like buy a washing machine that's got Wi-Fi I mean I would never enable that but you know in the future what's going to happen is they they're just going to circumvent your home Wi-Fi and that fridge or that washing machine is just going to go straight into 5G and that just becomes worried worrying then when the when you can't buy a device without it being connected. And this is why we need to have these discussions as as a society as a global Community is what we we can't stop this these new devices but we need to at least think about how we want to interact with them as a global Community as a society and as a government do we put restrictions on say what NETA can collect about us I mean right now there really is very little in the way what a restrictions are better and what they can what they can collect about us and sell to other people this might be something that we want to talk about right yet I don't hear people talking about it it's not it's not a conversation that's taking place in the general public there's a little bit of discussion about Tick Tock we've seen that people are discussing that but it involves all of these devices that are collecting information about us and selling it and invading our privacy and so this is I just want to put this out there I mean yes the DDoS attack is something we need to be concerned about but that's mostly those of us who are in cyber security but all of us need to think about giving up our control and privacy to these devices that we're putting into our home and I just want people to think about that, about is this what you want to do? Is this is this the way that we should be doing this? Is there a better way that we can do this? Is there a way that we could put in some restrictions on these devices to limit what they can do? I think it's a the problem is number one it's if it's if it comes to comfort versus security most people choose comfort and secondly it's uh just awareness you know we we I think in the cyber security sort of uh niche if you like people or field people can get really like uh everyone's aware of what's going on but out of this sort of niche you know if you go into like someone who's like not technical um and I won't use an example but let's just say someone in another field that's totally not technical they might not even be aware or even care and essentially you know we we we we when we get into the technical details you lose a lot of a lot of people um but it's important to talk about it and make people aware of it and I. I think so I think it is important to make people aware of it and I'm hoping that this message that we're discussing here gets out to people beyond just the cyber security community but you know those of us who were in cyber you know we need to be aware of how this can impact our security these IoT devices and others but the broader audience needs to be aware of how this can actually steal their privacy from them and in some cases suck money out of their wallets because you don't have on any other options other than bringing it back to the dealer to have them do the repair on it like in the case of John Deere tractors so these are all important issues that I wish were more of the in the public Marketplace of ideas and discussion because this is shaping this is shaping the world it's shaping our future we need to be having this discussion at a broader playing field than just a cyber security community. But I think that's what's also nice about us doing like hacking videos online people complain about hacking videos but if you don't tell people what's possible they don't realize what's possible so like it's so great to get you on the channel and you can tell us about the things that you you know it's not everything you can demonstrate but you can tell us what's going on and it makes it it raises awareness so people are aware of the issues of IoT they're aware of these these botnets that are out there out there and what they can do. So OccupyTheWeb I really want to thank you for sharing it's always great to have you on the channel it's always great to you know get your real world views of things before you wrap up you've got to tell us about some of the new courses that you're working on I'll just tell everyone once again you know YouTube we can do certain things but unfortunately because of YouTube rules we can't post some of the stuff that OccupyTheWeb and I would like to talk about but you know OccupyTheWeb in your courses you have the freedom to do that so tell us about some of the sort of interesting courses that are coming up. Well one of the more interesting courses of course was we just finished up the SDR for Hackers class and and that was I think that went really well we finished up hacking satellites and sell systems and then we're gonna do an advanced version of that and in 2024 where we'll just just focus on Cell systems and satellites we have the femtocell class coming up this fall as well where we'll be building a mini cell tower these are legal we say we've seen them used in Mr Robot they were used against the FBI and Mr Robot and I think in season 1 and so we'll be building one of those and we'll begin building it and using these tiny Linux Operating Systems so what we're going to be doing is replacing the Operating System that's built into it with our own operating system once again they're tiny 10 meg 5 meg Operating Systems that then we can control and collect the information from that's traversing that particular device so we've got that we've got reverse engineering coming up I think in February we've got Bitcoin forensic coming up in January so if any of these things are interest you let us know we we do have the coupon for 20% off using a discount code BOMBAL we're at www.hackers-arise.com that's great OccupyTheWeb thanks so much and just for everyone who's watching put in the comments below stuff that you want to see uh I'm really looking forward to doing the Linux basics for hackers a video series with OccupyTheWeb where we cover the content in his book but you know as always let us know the other topics that you you want us to cover one of the ideas I mean it's just time but one of the other ideas is eternal blue uh talk about that and a whole bunch of other topics. For everyone watching thank you so much for watching and again put your comments below. OccupyTheWeb thanks. Thank you [Music]",
    "transcript_keywords": [
        "Linux Operating Systems",
        "Operating Systems",
        "systems",
        "IoT devices",
        "Operating System inside",
        "tiny Operating System",
        "devices",
        "Linux Operating",
        "small Operating System",
        "tiny Linux Operating",
        "System",
        "Internet",
        "people",
        "Operating",
        "Things",
        "Linux",
        "yeah",
        "code",
        "meg Operating Systems",
        "control"
    ],
    "transcript_entity_values": [
        "Season 3",
        "Linux",
        "theChinese",
        "a CAN Protocol Network",
        "the Ukraine Russia War",
        "Hack RF",
        "National Security",
        "Devops",
        "OpenWrt",
        "Alexa",
        "China",
        "Europe",
        "an Associate Level Certification",
        "YouTube",
        "Great Britain",
        "Ukraine",
        "Linuxes",
        "about six weeks",
        "Alexa",
        "Linux",
        "1000",
        "Network Basics for Hackers",
        "DoS",
        "General Motors",
        "2016",
        "thousands",
        "ps",
        "VIN",
        "a Denial of Service",
        "Specialist Training",
        "OnStar",
        "Bitcoin",
        "Mikko",
        "BMW",
        "2024",
        "Operating System",
        "David Bombal",
        "RCE",
        "Wi-Fi",
        "Satellite Systems",
        "Cloud Training",
        "the Operating System",
        "Hackers",
        "Mobile Systems",
        "Facebook",
        "83011936",
        "Distributed Denial of Service",
        "January",
        "millions",
        "Lewis Rosman",
        "GM",
        "Tick Tock",
        "Israel",
        "3",
        "Bluetooth Wi-Fi",
        "today",
        "Juniper Networks",
        "the last couple of months",
        "John Deere",
        "NETA",
        "General Motors OnStar",
        "one",
        "Linuxand",
        "the Cell Systems",
        "Netcat",
        "Flipper Zero",
        "England",
        "Professional Training",
        "Windows",
        "Louis",
        "70%",
        "YouTube",
        "first",
        "UK",
        "2019",
        "IoT",
        "Juniper",
        "Getting Started Becoming a Master Hacker",
        "Russia",
        "the United States",
        "Mr Robot",
        "ps",
        "Wi-Fi",
        "Operating Systems",
        "ps w",
        "Amazon",
        "this fall",
        "IoT",
        "secondly",
        "Tech",
        "Linuxes",
        "Netgear",
        "2023",
        "less than 10 megs",
        "Mirai",
        "David",
        "GM OnStar",
        "2000",
        "Linux",
        "Linux Operating Systems",
        "Chinese",
        "the old days",
        "Iguess",
        "SDR",
        "Portland",
        "ps w works",
        "Alexa",
        "6.3 megs",
        "Debian",
        "Zuck",
        "a Distributed Denial of Service",
        "20%",
        "Bombal",
        "BlueKeep",
        "Guide",
        "Shell",
        "Meraki",
        "5",
        "US",
        "Tesla",
        "FBI",
        "10",
        "hundreds and thousands",
        "hundreds",
        "Tahoe",
        "10 10 megs",
        "Robert Abernathy",
        "Alexa Danielle",
        "American",
        "September October",
        "the last like few weeks",
        "Huawei",
        "the CAN Network",
        "hackthem",
        "Juniper",
        "Seattle",
        "1",
        "Network",
        "7.6 meg",
        "75%",
        "Protocol",
        "DDoS",
        "U.S",
        "number one",
        "Kali",
        "meg Operating Systems",
        "February",
        "Robot",
        "Denial of Service",
        "10 megs",
        "ps aux",
        "GUI",
        "Wireless Router Technology",
        "Remote Desktop",
        "about two",
        "yesterday",
        "Mirai"
    ],
    "transcript_entity_types": [
        "DATE",
        "ORG",
        "NORP",
        "LAW",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "LOC",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "PRODUCT",
        "DATE",
        "FAC",
        "GPE",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "NORP",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "PERCENT",
        "PERSON",
        "ORDINAL",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "WORK_OF_ART",
        "GPE",
        "GPE",
        "PERSON",
        "ORG",
        "LOC",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "LOC",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "NORP",
        "DATE",
        "PRODUCT",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "QUANTITY",
        "NORP",
        "PERSON",
        "WORK_OF_ART",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "LOC",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "LOC",
        "GPE",
        "DATE",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "LAW",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON"
    ]
}