{
    "id": "IhXAKG0DL2k",
    "title": "Installing Ubuntu Linux (PowerPC) on an iMac G4 - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2018-10-18T20:00:53Z",
    "video_url": "https://www.youtube.com/watch?v=IhXAKG0DL2k",
    "category": "Science & Technology",
    "tags": [
        "Installing Ubuntu Linux (PowerPC) on an iMac G4",
        "Ubuntu",
        "Linux",
        "Apple",
        "iMac",
        "Vintage",
        "Macintosh",
        "iBook",
        "Mac mini",
        "macOS",
        "OS X",
        "GNOME",
        "Unix",
        "Installation",
        "Software",
        "Computer",
        "Tech",
        "Comedy",
        "Funny",
        "Humor",
        "Krazy Ken",
        "KKTM",
        "Krazy Ken's Tech Misadventures"
    ],
    "views": 113246,
    "likes": 2164,
    "comments_count": 402,
    "description": "To celebrate the release of Ubuntu 18.10, Krazy Ken rummages through his old CDs, and finds a PowerPC version of Ubuntu Linux 8.04. He chooses to install it on a vintage iMac G4, and get it on the network, but plenty of chaos ensues.  Want more videos like this?   Subscribe for more tech videos!    Like the CC on Facebook   Follow the CC on Twitter   Follow Ken on Twitter: @Hildron101010  Krazy Ken's Tech Misadventures #69 - Installing Ubuntu Linux (PowerPC) on an iMac G4  Contact the CC    Want music for your videos?   (We use these guys a lot. They're good.)  Get film gear Ken uses   On a lower budget?   Amazon links are powered by the Amazon Associates Program.  #KrazyKen #Linux #Ubuntu",
    "description_links": [
        "http://krazyken.thecomputerclan.com",
        "http://subscribe.thecomputerclan.com",
        "http://facebook.com/computerclan",
        "http://twitter.com/thecomputerclan",
        "http://thecomputerclan.com/contact-us.html",
        "http://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "http://amzn.to/2hLrJBL"
    ],
    "transcript": "- For the first time ever, on a Krazy Ken episode, we are doing a dual installation sensation. Popularity contest? I've never been good at those. Oh yeah! Psychedelic colors! That should be simple, that should just work. (bleep) Now I just need to hijack an Ethernet cord. Come on, focus, focus. And got it. (alarm ringing) Oh shit, oh shit! Oh boy, oh they're after me. (beeping) (funky upbeat music) Hey guys, how you all doing? Really, that's just great. You know what, I was doing great until about five seconds ago, because I realized the computer I wanted to experiment with today, does not have a Wi-Fi card. It's gonna make things a little bit difficult. Because I wanted to install an old version of Ubuntu, made for PowerPC, on here, but I kinda wanna do it with network access, otherwise it's like whoa, whippie. So not being able to connect this to the internet, kinda sucks. I just realized, like right before I started the tech video log, that there's actually not an AirPort Card in here. Bummer. And 10 stories underground, it's kinda hard to run Ethernet down here too, so I actually have jack shit. However, I'm gonna try to find a cable, drill through the ceiling, go up 10 stories, and wire it up to the government's router. I'll be right back. Whoa Nellie, whoa look at that. There's a spider in my cable locks. Is it alive? Hello little spider (screaming). Oh, was that gravity that did that? Hello little spider, are you dead? All right, let's see if we can find that Ethernet cable. Well I couldn't find anything in that bin, and that's pretty much all of my possessions. I'm going to plan B, because I want to install this, but I wanna have network access. Here's plan B. This iBook, has an AirPort Card in it. So we'll be able to use the internet. Even better, I have this 8.04 disk, but I also have this beautiful 10.10 disk, yes. I thought, what a better way to celebrate today, which is the Ubuntu 18.10 release day, than with a vintage Ubuntu PowerPC installation. So we're gonna install both versions of Ubuntu on two vintage Macs, because we can. Let's get started. All right, so I set my little iBook over here. I'm just gonna start on the iMac. The iMac is going to get version 8.04. The iBook is gonna get version 10.10. Now I believe I used this disk once before, but it has been a long ass time. I think in terms of the operating systems currently on this computer, I have... It looks like I have a drive called Mac OS 9 Lives, but there's nothing in here. Would I really have named the hard drive, Mac OS 9 Lives? What? How old? Latest backup, October 15, 2011. Yeah, I have a feeling I haven't really touched this computer lately (laughing). I don't remember much of what I've done on this thing. Holy cow, that was a long time ago. It looks like we have OS 9 applications on here, so there's probably an OS 9 system, alongside Leopard here, and then we have this drive, which is just basically nothing. So I'll probably format that to be the Linux installation. Okay! Let's reboot, and see what happens. It could start on fire, but please don't, because there's not much ventilation (computer dinging) 10 stories underground. We're gonna hold down the trusty option key, to load up the boot picker. I believe that is the official name of this screen. The boot picker. Ah, listen to that CD, oh yeah! Here we go, we got our little penguin. Honestly, that's a cool thing about these old PowerPC computers. It could tell you if you had a Linux CD in there. Now, by default, the boot picker just says Windows, for any other CD you insert, or flash drive. It just says Windows. All right, and return. Let's do this. Oh, it just started going by itself. Okay, so anyway, I guess I didn't have to do anything. I don't remember this part. I've done this, I think, once before on a different computer, but again, that was many moo-moons ago. Well, I can hear it doing stuff. I can't see anything, but it's making noise. While that's loading, I'm just gonna shove you to the side, and then we're gonna start on the iBook. Because for the first time ever, on a Krazy Ken episode, we are doing a dual installation sensation, world record. Of course, right when I go to setup this iBook here, the CD loads. Oh yeah. This is really nostalgic, this is coming back to me. I mean, that's definitely some kind of bird. Okay, the current date is 1904, so apparently there is a flux capacitor in this computer. I'm just kidding. Since this is a dual installation sensation, let's just boot this guy up right now. (computer dinging) While this one loads, this one will boot up. And again, this one has Wi-Fi in it, so we should be able to have a lot more fun with the Interwebs. Let's see, well, it's not 1904. We're just gonna scroll all the way to 2018. Almost there. And, boom, right on 2018. Yes, all those arcade games for tickets and all that shit, eatin' up my tokens, are paying off. I'm learning timing. Yes, this is good. Suzie Orman, you are denied. I bet you this clock is all effed up too, yeah. The clocks on these things are probably way effed up, 'cause the batteries are probably totally dead. Let's brighten you up. We need to brighten up the day. I don't know if that's as bright as it gets. I'm sorry (laughing). Poor old little LCD. Let's just take a look here. Just gonna bounce back-and-forth a little bit. Let's see, clock, clock, clock. Date and time, there we go. December 31st, 1969, because this is probably set for the central time zone. CST, central standard time, is GMT minus six. There you go, minus six, so we're at 6:00 p.m. Normally it would be January 1st, 1970, the beginning of the Unix clock, I believe, is how that works. You know what? That makes sense now. I think I got it, because the Unix clock started in 1970, that's when the date started for it. I believe it was that day. So 32-bit, if it's a 32-bit signed integer, that means you have, 32-bits is approximately four billion values. Let's just round it to four billion. So since it's signed, you have plus two billion, and minus two billion seconds. So two billion seconds out, from January 1st, 1970. Let's see, 35 million seconds in a year, divided out, dah, dah, dah, dah, dah, I think it goes to like 2030 something. So that would be about 60 something odd years. So yeah, what was that other one, 1901 or 1904? So if you add 60 something odd years to 1970, you get 2030 something. If you subtract the 60 something years, you get 19-0 something. That's it, okay (laughing). I know I did a lot of rounding there. That shit fascinates me, all those bits and shit. Yeah, it fascinates me. This got reset 'cause the clock battery's dead, so it went back to the default Unix time, or whatever that's technically called. So, Ubuntu 10.10 for PowerPC, I'm gonna throw this in the iBook. While that does it's thing, we're gonna redirect our attention back to the iMac. While the iBook subplot sits on the side, let's take a look at examples. All right, test documents. That's good. Some of these things are still similar, but a lot of this is pretty different though. This is from, at this current date, this is from like about 10 years ago. More than 10 years go. Oh cool, it picks up the right click. Which is good, because Apple mouse, just wanted to make sure (laughing). Welcome! No localization. We'll do English, 'cause that's the language I know the best. Chicago, oh that scrolls really smoothly. Oh that's hot! Chi, huahua? Is that Chihuahua? I have no idea. Oh, dead keys, that sounds very morbid. We're gonna do USA Macintosh, because we are on a Macintosh keyboard. All right, starting at the partitioner. Oh yes, the nice orange glossy progress bars. I like that. It feels very citrusy. I want some OJ now, there's so much orange in here. Okay, use entire disk. Well, don't really wanna do that, 'cause that's gonna wipe out my Leopard and my OS 9 install, so let's try manual and (bleep) everything up (laughing). Let's figure this out. A lot of unknown things. I don't exactly remember why that's happening. Let's have a look. Okay, used 23300 out of 30234, that must be the Leopard partition. I'm guessing this is just the one that has nothing in it, but that desktop folder. So, 10 gigs oughta be enough. Let's format that, I can't check the box, 'cause I probably gotta delete first. I'm so gonna eff this up, aren't I? Scanning for intruder, scanning for intruder, scanning for intruder. So now we have free space. Yes, we can create a partition here. I guess just extended three would be fine. We should probably have some swap. Shit, I forgot. I know where we have swap. So at the mount point, I guess we'll set this at 9,000. Oh shit I accidentally bumped. That was not what I wanted to do. Okay, well it doesn't look like it made any changes. Let's set this to 9,000, beginning extended three, slash, boom. Hopefully that gives me the free space of a gig left. I'll just use that for swap. That might be a bit of overkill, considering it's only a 40 gig drive. Actually, I don't know how much RAM is even on here? I don't even know the RAM on this thing. I haven't used it in so long. I guess we can just make this the swap area. Again, a little bit of overkill, but whatever. There can't be more than a gig of RAM in this computer. It's from 2001. I got this thing for 30 bucks on eBay (laughing). You'll definitely see it on Vintage Apple Vault, soon. I love this old iMac. The design, the swivel screen and everything, that we could wiggle it around everywhere, yeah. Boon forward. Okay, I clearly forgot something. No NewWorld boot partition was found. The yaboot boot loader (chuckling) requires an Apple Bootstrap partition at least, so let's see, 819 kilobytes in size, using the HFS Macintosh file system. Well, we gotta fix that. So, let's delete, oh, oh, no, no, no, jump back. You asswipe! So I decided to undo a few things on the iMac over there. It's just loading some more stuff in the partitioner. In the meantime, I'm going to let the iBook do its thing and boot up into the live CD. I love the sound of the old disk drives. (clicking) You don't get that anymore. (robotic noises) Wicky, wicky, wicky, like your favorite, favorite, favorite, DJ J J. So, here's the free space. You might think, damn, that is a nice free space. We're gonna set this now to, we're gonna go NewWorld, And all new worlds (computer playing music) Whoa! The iBook over there, just wanted to bust into the party, and be like, yo, listen to my amazing speakers. Two megabytes, I guess. Okay, I'm just gonna pray that I did that right. Going forward, hopefully it works. What is your name, son? My name... My keyboard's a little hard to reach, shit. Curse the short cable. Why didn't I put the USB extender on here? I got this. Call me Ishmael. I'm just kidding. (horn honking) Whoa! (horn honking) That is an amazing sound. That's gonna be my alarm clock now. (horn honking) Oh, shit. Oh (bleep). I just ejected and rejected. De-injected? Anyway, I had no idea the eject button would actually work on the live CD. I probably just effed everything up, but anyway, my name is Krazy Ken. Nice to me ya'. Choose a password. Alligator three, alligator three. We'll call it Krazy Ken desktop, and forward. Oh my mouse cursor's jumping around. I wanna see what the Advanced, oh, Popularity contest. I've never been good at those. All right, install. And something should happen. Now? There we go, oh, starting up the partitioner. Ah well, I'm sure it knows what it's doing. It's a professional. Okay, I don't know why, but the disk just ejected itself, while it was in the middle of formatting. Okay, I'm gonna pretend that didn't happen. I seriously don't know why it did that. That was really bizarre. I don't remember that happening before. Right now, it's being weird. It's like stuck on the screen, and it just ejected the CD, while it was in the middle of this. I don't know why. And it gets ever weirder, over here. This guy doesn't even wanna turn on. I saw the purple screen come up. It said Ubuntu 10.10, and then it did its thing. Nothing's even on the screen. I'm trying to look through the Apple logo on the back. I don't see anything on there. It's not just the backlight that's off, the screen itself isn't even coming on. Just to add to the complexities, the Krazy Ken curse is just being mean to me, when I'm just trying to have a little bit of fun. Of course it is. So, I'm gonna shut this baby down. (computer grinding) Oop, hang on. Well when I pressed a button, and now the CDs going crazy. But it's not doing anything, the screen's black. I'm just gonna hard reset, or hard shut down, boot back up. It was being weird. Oh yeah, the backlight was on. I could tell now, shit. So the screen was on, it just wasn't actually showing like an interface. Really bizarre. Let's try that again. Bong. (computing dinging) Go to the boot picker. There's our little penguin friend. Good 'ole tux. All right, click, enter. Or, return, excuse me. And there we go. Ubuntu 10.10. That's exactly what happened last time. But then after this went away, the screen just went black. We're gonna try it again. Now we're gonna deal with the iMac. It's like having two misbehaving children. I'm still not sure what caused the CD to eject while it was partitioning, but it is hung. Nothing's happening, so I'm gonna try to... Oh, that's (bleep) great! I control alt deleted. I seriously have no idea what the (bleep) I just did. What's a squash file system? Whoa, I've never see that before. Okay, that was something (laughing). Maybe I shouldn't have done that, but maybe I should have. At this point, I really don't care. I just wanna get it working. Like in the good 'ole days. So while the iMac is doing its thing (zipping), we got a desktop. Yeah, with a cursor! Oh man, it actually doesn't look too bad on this old G4. That's cool. Let's take a look at the Wi-Fi thing here. I'm guessing it doesn't have a driver. Device not ready, firmware missing. That makes sense. I may have to manually transfer a driver over, to get the Wi-Fi working on here. But I know it has an antenna in here, because it works in Mac OS. So first, let's just install shit. I can already feel this going way smoother than the iMac G4. I don't want to erase the entire disk, because I do have a Leopard partition on here. So I'm gonna split the disk up. Oh balls and wieners, I forgot. I don't really have a partition for Linux. Can I resize this? Probably not. I'm gonna have to do that inside the Mac operating system, I bet. 'Cause I don't wanna delete this. Do I even have anything on here? I probably can't mount this in here, I bet. (touchpad clicking) Shit. I'm gonna have to do some resizing inside of the Mac OS, before I do a Linux installation, 'cause I don't wanna risk wiping out the whole disk. Hey, roadblocks, no big deal. We'll come back to this later. I'm gonna reboot it. We're gonna go back to this stubborn iMac. Something is definitely not right. This iMac has been doing this for about five minutes. So, hard reset? I think so. Sorry iMac, nothing personal. It's like you're strangling it. (computer dinging) I'll boot up the iBook while I'm at it. Back in the Mac OS. (computer dinging) I hope it's not too complicated to follow these two plot lines. Just think of it like one of those sitcoms, where there's like three different plots going on at once. Yeah, 'cause everybody loves that. Ah, it's almost like we're having a mini-race, except it was totally unfair, 'cause I started them at different times. That one's got the Snow Leopard wallpaper, which is probably my favorite Apple desktop wallpaper they ever made. But I meant to actually boot that computer into Linux. So I'm gonna have to restart that again. Oh, man, I'm losing it. I can't keep track of these two computers at once. I should of read my contract. I'm never doing a dual installation sensation again. All right, I'm gonna throw that back into Linux, and this into disk utility. Let's make a partition for like a Linux Playground, just to experiment with Linux. I should be able to just do this, do this. We're gonna add Linux, resize OS X, boom. That should be simple, that should just work, and we'll all be happy. I miss the barber pole. I really do. Well, your attitude appears to be wrong, Mr. Ubuntu. Fine, we'll adjust the clock, and then you better leave me alone. The hard drive could be effed up now, 'cause it was like 5% of the way through like a formatting operation. Then everything just locked up. I could've effed up the whole thing. This is fascinating. It looks like it detected something. The resize operation may take a long time. Yeah, you don't say (bleep). No, give me, asswipe! Okay, fine. We'll go back to manual mode (laughing). I really don't even wanna read that anymore. (bleep) you bitch! Manual. What the shit, I want manual! Yeah, why did it take me like three clicks to make that work? Don't be a dick to me, I got enough going on. Come on man, just work. I know you can do it. Do you want to return to the partitioner? Dah dah dah dah dah, has not been marked for formatting. Yeah, anything under hda9, that's fine. That's any empty partition, it should be. My name is Krazy Ken. All right, theoretically, this should just work, right? Install, so now it's gonna do the formatting, and hopefully not eject the CD on me. 'Cause it did that last time, which was stupid. While it's doing that, let's take a look at the iBook. So, I took a quick browse of the applications, just to see if I had any special programs installed, just in case I had to erase everything. The funny thing is, apparently, the previous owner, had 2005 World Book on here, which I think that's kind of funny, because a viewer was actually just asking me about that for a Krazy Ken episode, I think. It's like, hey, it's on here! So, cool, that's cool. Honestly, there's really not much on here, and not much that I, I can just reinstall this stuff. It sounds like the disk is doing something, but this has been going on for a long time. I don't even know if it's working. But, I know something that is working, over there. Before that, I just wanna call out one thing. MATSHITA CD? I didn't need to know that Mat, keep that to yourself. But yes, gadies and lentlemen, this is now installing. I think we did everything right last time, but something ejected the disk and effed it all up. It's working now, copying files, sweet. Now it's just a waiting game, 'cause both computers are trying to load shit. Let's play Yahtzee, or Sudoku, or something. So, status update, this is still copying. Fantastic, looks good. This is still modifying the partition map. Again, it sounds like the hard drive is doing something, but we've been stuck here for a long time. So, I don't know if I'm gonna be able to really get Linux on here, 'cause to be honest, I don't really know if I wanna erase everything that's on here, right now. I might, but I have another backup plan. This might turn into a triple installation sensation, because I have this Mac mini, which could potentially act as a router for that iMac. Let me explain. If I take the Mac mini, which doesn't have Mac OS on it, right now, and I install Mac OS on it, I can use the internet sharing feature to use the Wi-Fi inside of here, I'll put it through Ethernet, and then into that iMac. And hopefully, it just picks it up as a wired network, and then connects to the internet. Here is the catch. In the lair, I only have one Ethernet cable, and it is currently connected to the router. So I need to yank the Ethernet cable from that router, thus, destroying access to Wi-Fi all over. So now it's like, what's the point, I have no Wi-Fi? Well, I have a cellular mobile. Somehow, I am able to get service 10 stories underground. So, here's what I'll do. I will take a cellular signal from the cell tower into my phone. I will turn the hotspot onto my phone, and send the cellular data, over Wi-Fi, to the Mac mini. I will then have the internet sharing feature in Mac OS, take the Wi-Fi, transfer it over Ethernet into this iMac, running Ubuntu for PowerPC. Possibly, just possibly, through all those stages of conversion technology, will get this 2001 machine on the internet, with Linux Ubuntu 8.04, or Ubuntu Linux, however you wanna say it. So yes, multiple stages. Lots of points for failure. But I wanted to get some PowerPC Linux installation online today. That doesn't have a Wi-Fi card in it, and this thing is being naughty. So, we may have to go to a triple installation sensation, and then unify it down to a singular installation sensation, to bring the universe back into balance. Did you get all that, were you taking notes? Because that is probably what's gonna have to happen, if this doesn't start doing something soon. Whew, that was a lot. I need a drink. Well, gotta get the Mac mini all set up with this here monitor, because currently, it's headless, and I won't be able to interface with it (cord banging) properly. All right, power. This'll be for the monitor, fantastic. Man, this is the most crowded this table's ever been. Holy bazonkers! Video, we need video. Where can I get some video at this hour? Aha, here we go. More conversion technology. We'll be coming out of the Mac mini with HDMI, and converting to DVI. Now I just need to get power to the Mac mini. And I'm at a bit of an impasse. I think I am out of extension cords. This really is turning into a multi-step, overcomplicated, retro-fitting. But hey, sometimes that's what retro-fitting requires. That's kind of what makes it fun. Oh yeah, this, that cord is a little tight. That's as good as it's gonna get, for now. Okay, that's all hooked up. It's just like a rat's nest/deathtrap of cords. If you're gonna walk through here, you might fall and die. So, this looks like the installation's complete though, so that's bueno. I'm actually gonna, yoink, steal your keyboard for a sec, and plug it into the Mac mini. 'Cause I need to get this thing into a recovery mode, and get the Mac OS back on here. (computer dinging) I'm throwing this into internet recovery, because from our past experiments with, I think, Linux Mint that we did on this computer, we don't have any other system software. Or, excuse me, operating system. Some people say I'm too old, I guess, 'cause I say system software, but whatever. There's no other operating systems on here, just a broken version of Mint, so we need to clean the disk and put a fresh new copy of Mac OS on here. If you wanna check out those experiments, you can check 'em out right there. Lots of fun. So now while this is going into recovery mode, let's get that thing rebooted. Yoink, stole your keyboard, 'cause I'm a rebel. Restart now. It looks like the volume is showing up, yep. There we go, we have a CD and a hard drive icon, that's a good start. (moaning) (CD crashing) Ah, shit. Nice and toasty. Nothing like a warm CD, right? Then, return. Sweet, oh yeah! Psychedelic colors! It looks like it's booting. The colors are effed up, but it's doing something. Okay, while that loads, let's take a look at recovery mode for the quasi-router/Mac mini. I have just inserted this beautiful Belkin product. (mouse clunking) All right, we'll use English. Mountain Lion is gonna be the system on here now. But that's okay, 'cause Mountain Lion has the functionality we need to do the internet sharing. No big deal, but first, let's make sure the partition table is reset back to just one single HFS+J volume. So you can see we have a couple leftover things from our Linux system. This was probably extended three and then here, we have Linux. (drum banging) Whoa! Bongos! Donkey Kong's in the house. All right, we'll get back to that later. (sighing) What was I saying? So the Linux swap and then this was probably the extended file system thing for, I think Linux Mint was on here. So let's just go to the disk, partition. We'll just do one partition, and apply. (mouse clicking) That shouldn't take too long. Partition complete. Look at how easy that is. Now we're gonna do reinstall Mac OS X, untitled one, install. Oh, I didn't need to sign in at all. Wow, isn't that convenient. And there we go. We are now reinstalling Mountain Lion. So this computer can finally have a Macintosh system back on it. It hasn't had that in a while. Okay, let's switch back to the iMac. I do apologize that this screen is a little wonky, with the Dutch angle, but it is a little bit broken, so it doesn't actually stay perfectly horizontal. In the corner here, we'll just (laughing), like have the Mountain Lion stalk us, just to keep track of that over there (laughing). All right Ibuntu, do your thing. At least it sounds like the sound is working. That's a good start. Hey, the menu bar animated in, or the panel, excuse me. This is a menu bar, this is a panel. Any questions? Yep, about panels. There you go, there's your proof, bitch. GNOME Panel 2.22.2 2 2 2 2 2 2 2 2 2. Linux for human beings. I'm one of those. Thank you for your Linux and, oh yes, Hardy Heron, that's right. It's the PowerPC version too. So while that's installing, let's just fiddle around a little bit. What do we got on here? We got Evolution, OpenOffice, the word processor, spreadsheet, presentation, the inter webs, graphics, GIMP, we've got GIMP, we got F-Spot. Oh games, oh I love blackjack. Hey Sodoku, we were talking about that earlier. We may have to play us some Sudoku, although I suck at it. Tomboy notes, I always thought that was an interesting name. Computing, basic strategy, all right. That's good to know. We're at 14, click to deal another card. How do I bet here? They busted, I win! Oh yeah! I have no idea how much I actually bet though. I really don't, but I won. That's all that's important. Oh yeah, I'm definitely gonna hit there. 21, bitch! Two in a row. Let's do that again. 12, yes, I do like to live dangerously. I'm just kidding, I'm gonna hit. Oh I busted and they got 16, so they stop there. House won. Well, that was fascinating. And we did some gambling, cool. Let's customize it up. Let's see, I'm going to delete this panel, bum, bum, bum. And then I'm going to go to properties here, and I'm gonna put it on the bottom. Because I'm a rebel and I'm gonna make it biggerer. That's way too (bleep) big. Do, do do, oh, expand. So I can make it, yeah, it feels kind of macOS-y now. I'm gonna do that. Background, oh I love this. I'm gonna do... I gotta do it, I know everything's orange, but (laughing) oh I can change that. Let's see, four, eight, six, zero, ac, I think it is. (mouse clicking) That didn't work. Four, eight, six, zero, ac. (mouse clicking) I guess I can't type in the hex code. Well, butter my biscuits. Anyway, that's one of our brand colors, so that's why I was trying to get around there. Anyway, it's dark now, and I like dark. Get out of my face, get out of my face. Whoa, whoa, whoa. This is actually running pretty damn smooth. It doesn't render the transparency down there. I don't know if that's probably just because of the old graphics in here, or if that actually is a limitation of the older OS. But yes, this is an older system, PowerPC. The system came out seven years before this version of Linux even came out. It's running okay. Well, now that I deleted that other menu, that's a bit of a problem. Let's add something to the panel. Then I should be able to go to my menu. Fantastic, that's really all I wanted. Fun, fun for everyone Appearance. Oh yes, all our awesome themes. Crux, Crux looks kinda cool. Oh yeah, I remember this, when you had the three tiers. Do they do that now anymore? I know there's other DEs, and compositors, and shit. I don't know if they do the little three tier thing anymore. I remember this. Let's crank it all the way up. I doubt it's gonna work. It's probably gonna go like, \"You're system is way too freakin' old, you piece of shit. \"What do you want from me? \"I can't render all this.\" Yeah (laughing). Let's try normal. Now we have it customized a little bit. I'm just gonna clean some other things up here. That looks pretty gucci. I don't really need mail though. I don't really need help. I mean, we all need help, but (laughing). I feel like this should be, ah (bleep), I just got rid of, whatever. I'll just have the menu here, keep it simple. There we go. This is actually pretty cool to see a Linux desktop, but with the Apple hardware design. We can just show Linux off with the swivel display here, or we can hunker down with the spreadsheet. Tilt that screen up, work inside of GIMP. Swivel it around, show off our awesome OpenOffice documents, to people (laughing). I'm just kidding. But anyway, it's cool to see the Linux software on Apple hardware, like this. As for this Leopard thing, I'm gonna call that one a loss. I don't think it's gonna work. It's not resizing. (computer dinging) I don't really wanna wipe out the drive. I think our other solution will be fine. So I think it's okay if we let go of this particular computer. And that bong you just heard was the Mac mini rebooting. Oh, voiceover, stop, shush. (keyboard clicking) I don't have the keyboard plugged in. I can't really do anything. Oh, shut up voiceover. I don't need you now, please. You're like a revolutionary accessibility feature, but I don't need you right now, but thank you. The thing that makes me uncomfortable with this, is I don't like to abort these operations, because I don't wanna eff-up the disk. But it looks like nothing is happening, at all. We can check the disk activity, but I've done this kind of stuff on older computers before, and it has not taken this long. So something is wrong. But again, this was owned by someone else. There could be some barnacles and crust on here. Okay, okay, okay, whoa! That changes things. The CPU is at max percentage here. So it's doing something. Disk activity, it doesn't look like it's doing much. Wait, report crash! Report crash is using 61%? (bell dinging) What, did something crash in the background? Oh, and I have MAME open. That's probably not doing anything useful. Get out of here. Report crash is apparently doing something in the background. Something's not right. Disk utility's really not doing anything. The disk activity is really low, with very intermittent spikes. Something got screwed up. Oh, report crash is now gone. Nope, it's back. What the shit? That's weird. Disk utility, I'm just gonna have to quit you. Yep, it's gonna want my attention now. I'm just gonna quit. It's not working man. Yep, again, I'm just gonna ignore this one for now. We're just gonna focus on the iMac, and try to reel it all back in. It was worth a shot. But for now, I'm gonna shut this one down. Let's go take a look at the Mac mini, as we continue setting that up as the router, if you will. Goodbye Leopard. Let's get this set up. Start using your Mac, today. Boom. You're welcome. Ah, the nice zoom animation, the galaxy. Oh, this is bringing back some nostalgia. Look at that. The old glassy dock. Beautiful. So, here's what I'm thinking I'm gonna take my phone, my cellular mobile. I am going to go to, running iOS 12 by the way, yes. Make sure the personal hotspot is on, which it is. Hopefully, this should be able to connect to it. I have a bad feeling it's not gonna be able to connect to it. Oh no it is, shit, that's right! Oh cool, it even has the hotspot icon, sweet. We'll save that for later. The other thing I need to set up though is internet sharing, which is right here. Perfect, Ethernet. Because this Mac mini still has Ethernet on it, which is cool. I'm going to internet share, from Wi-Fi, which will soon be my hotspot. Man, I haven't used this feature in forever. But I will tell you what. It's pretty useful in situations like this, especially. So now, internet sharing is on, through the Ethernet. Perfect. Now I just need to hijack an Ethernet cord. To do that, I need to steal the one and only Ethernet cable I know of, from the Wi-Fi router, thus, shutting down access to internet all over the asylum complex. I'm gonna have to be quick about it. Okay, looks like everything is hooked up to this base station here. Let's just get the USB out of the way. There we go. Now the Ethernet. Give it a little jiggle, it's a little stuck. Is it time for tacos? No, it's not time for tacos. Come on, focus, focus. And got it. (alarm ringing) Oh shit, oh shit. Oh boy, oh, they're after me. Oh shit, oh they're after me. But I got it, I got it. Oh shit, here they come. (robo-dogs barking) You want a piece of this? You want a piece of this? (gunshots exploding) (alarm ringing) Okay, I think that's all of 'em. (dog barking) Ah! (gunshots exploding) Just die already. Man, oh, robo-dogs. You don't wanna mess with them. Think. Scan and assess. I think that's them all, okay. Whew, man. It was just an Ethernet cable! But, it's now ours. So we shall continue with our experiment. I'm gonna take our Ethernet. Plug it into the mini. And now, into the iMac. (plastic clicking) There we go. Now we just gotta make sure the hotspot's configured. Back to the system preferences. I'm getting a whopping 3G signal, right now. So this might be a little sluggish. But again, 10 stories. So, go to the network. Ethernet's connected, fantastic. Wi-Fi is connected. That's not possible though. Because the router, that can't work. The router has no access to the modem. It's connected to the Wi-Fi, but it's not gonna be able to pull up anything. Yeah, there's no way. It's not gonna work. Let's switch to the iPhone. Let's see if we can get an IP address. Ethernet connected, Wi-Fi connected, and internet sharing should be on. If my calcumalations are correct, I didn't really factor in driver support, but assuming that the Ethernet driver on that version of Ubuntu on the older iMac is functioning, we should be able to get that thing online, (hands slapping) grand finale. Let's have a look. (keyboard clicking) Waking up the computer. Let's go to network, internet. Kill the video star I probably shouldn't sing that. Sorry about the moire pattern on the screen, oops. I'm loading up Firefox, and let's go to one of my favorite websites, thecomputerclan.com. Page load error (bleep). It detected we have the network. Oh, connect to. Oh, oh, wait, what the peep? What the shit. I just did a little test here. I unplugged the Ethernet, and then it does disappear from the menu, so it does detect that it's connecting to something. But there's something else not right. I am trying to plug this sucker back in, without looking at it. (plastic clicking) All right, let's give it a sec. It already started spinning. Doing its thing. Reopen the menu, and then there it is. It says wired network. I don't know if this is even relevant to what we're doing. It detects that I have something plugged in, but it's not granting us access, to anything. Maybe the internet sharing is not compatible with this older computer, and/or this older version of Linux. That's interesting. Wired connection with roaming mode, on, doesn't do anything. Roaming mode, off, with a static IP address, with the IP address is from the computer, the Mac mini, also don't do anything. It seems like I exhausted all those options. I'm a little stuck. Well (chuckling), this is awkward. Those agents are probably gonna want that Ethernet cable back real soon, so I don't have a lot of time. So here's the deal. We got the system installed. That was the main goal. I'm calling that a win. However, I had a stretch goal. I wanted to get this thing online. I'm calling that a loss. Right now, we're kind of at a bit of a stalemate. (door banging) Oh crap, (muffled yelling) they're already coming. I gotta be quick. (door banging) If you see this, and you have an idea on how to maybe fix this and get this working, let me know (door banging) and I will try it again in a future tech video log, if I am alive. (muffled yelling) (muffled yelling) Good? Good, awesome. Thank you in advance for (door banging) helping me out. Crap, they're gonna catch me. Speaking of catching, like, no they won't. (door banging) I'll get away. But speaking of catching, catch the Krazy, and pass it on. I hope I make it out of this alive (door banging) (uplifting music)",
    "transcript_keywords": [
        "Mac",
        "Mac mini",
        "Linux",
        "Ethernet",
        "thing",
        "shit",
        "back",
        "yeah",
        "Krazy Ken",
        "disk",
        "Ethernet cable",
        "iMac",
        "Ubuntu",
        "time",
        "system",
        "internet",
        "WiFi",
        "Linux installation",
        "computer",
        "good"
    ],
    "transcript_entity_values": [
        "Mint",
        "January 1st, 1970",
        "Two megabytes",
        "Yahtzee",
        "two",
        "USA Macintosh",
        "3",
        "30234",
        "six",
        "about five seconds ago",
        "about 60",
        "the Wi-Fi",
        "Mac OS 9",
        "Nellie",
        "jack",
        "40",
        "Vintage Apple Vault",
        "four",
        "one",
        "four billion",
        "Linux Playground",
        "iBook",
        "Wi-Fi",
        "Ethernet",
        "Linux Ubuntu 8.04",
        "Sudoku",
        "Two",
        "21",
        "Mountain Lion",
        "a year",
        "6:00 p.m.",
        "Firefox",
        "32",
        "Sudoku",
        "10 years ago",
        "Dutch",
        "Linux Mint",
        "30 bucks",
        "Four",
        "Crux",
        "Linux",
        "Apple",
        "iMac G4",
        "max",
        "December 31st, 1969",
        "IP",
        "that day",
        "Mac OS X",
        "8.04",
        "approximately four billion",
        "Wi-Fi",
        "Mac",
        "Windows",
        "MATSHITA",
        "first",
        "OpenOffice",
        "iBook",
        "iMac",
        "Suzie Orman",
        "16",
        "House",
        "2018",
        "Tomboy",
        "Linux",
        "the Wi-Fi",
        "sec",
        "minus two billion seconds",
        "three",
        "this current date",
        "Boon",
        "Macs",
        "USB",
        "DVI",
        "Krazy",
        "Linux",
        "9",
        "two billion",
        "Chicago",
        "14",
        "an AirPort Card",
        "Apple Bootstrap",
        "1904",
        "32-bits",
        "Ubuntu",
        "ac",
        "minus six",
        "two billion seconds",
        "MAME",
        "today",
        "Krazy Ken",
        "10.10",
        "Belkin",
        "CPU",
        "Evolution",
        "Windows",
        "10",
        "61%",
        "5%",
        "Donkey Kong's",
        "F-Spot",
        "iPhone",
        "Goodbye Leopard",
        "hda9",
        "GMT minus six",
        "about five minutes",
        "1901",
        "Dah dah dah dah dah",
        "World Book",
        "19",
        "1970",
        "60 something years",
        "More than 10 years",
        "the Snow Leopard",
        "2030",
        "release day",
        "Linux Mint",
        "Hardy Heron",
        "2005",
        "eBay",
        "Mat",
        "CST",
        "NewWorld",
        "seven years",
        "Mac",
        "Macintosh",
        "60 something odd years to 1970",
        "Ubuntu Linux",
        "LCD",
        "12",
        "just one",
        "English",
        "RAM",
        "9,000",
        "G4",
        "23300",
        "35 million seconds",
        "Ishmael",
        "iMac",
        "2001",
        "Chi",
        "HDMI",
        "819 kilobytes",
        "this hour",
        "eight",
        "HFS Macintosh",
        "Leopard",
        "October 15, 2011",
        "the day"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "FAC",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PRODUCT",
        "LOC",
        "PRODUCT",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "GPE",
        "FAC",
        "ORG",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "PRODUCT",
        "ORG",
        "DATE",
        "QUANTITY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "PERSON",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "QUANTITY",
        "TIME",
        "DATE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "DATE",
        "DATE",
        "WORK_OF_ART",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "LANGUAGE",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "TIME",
        "PERSON",
        "PRODUCT",
        "DATE",
        "PERSON",
        "ORG",
        "QUANTITY",
        "TIME",
        "DATE",
        "ORG",
        "PRODUCT",
        "DATE",
        "DATE"
    ]
}