{
    "id": "iIBYa1ZEzFQ",
    "title": "iPhone 14 Pro vs. S22 Ultra vs. Pixel 7 Pro: 1,000 photos later",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-11-09T15:00:26Z",
    "video_url": "https://www.youtube.com/watch?v=iIBYa1ZEzFQ",
    "category": "Science & Technology",
    "tags": [
        "iphone 14 pro",
        "galaxy s22 ultra",
        "pixel 7 pro",
        "google pixel 7 pro",
        "samsung galaxy s22 ultra",
        "samsung s22 ultra",
        "pixel 7 pro camera",
        "google pixel 7 pro camera test",
        "pixel 7",
        "iphone 14 pro max vs galaxy s22 ultra",
        "iphone 14 pro max vs s22 ultra",
        "iphone 14 pro max vs samsung s22 ultra",
        "s22 ultra",
        "google pixel 7",
        "google pixel 7 pro review",
        "pixel 7 pro review",
        "s22 ultra vs iphone 14 pro max",
        "iphone 14",
        "google pixel 7 pro unboxing",
        "iphone 14 pro max",
        "pixel 7 camera"
    ],
    "views": 479935,
    "likes": 14325,
    "comments_count": 954,
    "description": "This year even the iPhone 14 Pro has a 48MP camera which is still half as many as the 108MP of the Samsung S22 Ultra but almost the same as the Pixel 7 Pros 50MPs. So to crown the best smartphone camera of 2022 Becca took 1000 photos on each of them.  0:00 Intro 0:35 Line up 0:54 Ultra-wide 1:56 Telephoto 3:03 Telephoto (low light) 3:37 Front-facing camera (video & low light video) 5:05 Front-facing camera (photos) 5:42 Wide lens / Main camera (iPhone, S22, Pixel 7 Pro) 6:47 iPhone 14 Pro RAW 40MP 7:22 S22 Ultra Camera Pro Mode 7:46 iPhone 14 Pro vs. S22 Ultra (main lens) 8:41 S22 Ultra Portrait Mode (main lens) 9:23 iPhone 14 Pro vs S22 Ultra (video, cinematic, stabilization) 10:41 The winner is  Read more:   Check out Becca's photos here: iPhone 14 Pro:  Pixel 7 Pro:  S22 Ultra:    Shop The Verge's merch here:   Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:",
    "description_links": [
        "http://bit.ly/3UCJxl6",
        "https://adobe.ly/3TC2bJ7",
        "https://adobe.ly/3hrF3j4",
        "https://adobe.ly/3DNTOUP",
        "https://shop.theverge.com/",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr"
    ],
    "transcript": "- Telephoto lenses with a 100 times zoom, macro shots on the ultra wide, portrait modes using AI Stereo Depth Maps, and cinematic video in 4K. The cameras on our phones have gotten incredibly advanced and full of features. So I decided there was no better way to test these cameras than to take a thousand photos with each of them. We're gonna be focusing on three cameras this year. The iPhone 14 Pro, the Pixel 7 Pro, and the stylist touting Galaxy S22 Ultra. This is the thousand photo smartphone camera shootout. Welcome back to Full Frame, buds. (upbeat music) Just as packed with features as they are with megapixels, are three contenders in the best smartphone camera of 2022 contest, all have multiple lenses that provide perfectly good images. But to crown the very best smartphone camera, I'm gonna be going through each lens, and whatever camera has the most winning lenses, well, they take the crown. Let's start with the widest one, the Ultra wide. Our three contenders all have 12 megapixel f2.2 ultra wide lenses with macro modes. And with similar specs, come similar photos that are only differentiated by the processing each camera does after the photo is taken. Although many, and I mean, many of these photos are hard to tell apart, the iPhone wins narrowly by allowing the shadows to be shadows. An ultra wide lens can create a great deal of impact by exaggerating the frame, warping those edges just a bit. And what makes that drama stronger is contrast. And at night, when all of these cameras have their own downfalls, I mean the iPhone and Pixel's reflections here, the total lack of clarity here, the iPhone reproduces an image that most looks like what I was seeing, irl. The iPhone also preserves a bit more detail in the highlights. You can see it here in the clouds or on the side of this church. And it's this small difference that makes the iPhone the winner of the ultra wide, but so, so narrowly. And unfortunately, that contrast and clarity can't make up for the iPhone's lack of a telephoto lens. So the iPhone 14 Pro, it does have a 12 megapixel f2.8 telephoto lens, but it optically only extends to a 3x zoom or a 77 millimeter equivalent. The Pixel 7 Pro has a 48 megapixel Quad Bayer, so that's a 12 megapixel equivalent five times or 116.2 millimeter, f3.5 telephoto lens. And the S22 Ultra, well, it has both a 10 megapixel, 3x f2.4 lens and a 10 megapixel, 10x f4.9 lens. For this test though, I'm only gonna compare each camera's farthest reaching lens since it's the telephoto comparison. And that 10x telephoto lens on the S22 Ultra, it's equivalent to 230 millimeters, and it is very crisp in great light. Far crisper than the iPhone and the Pixel digitally zoomed to 10 times. I have had so much fun taking photos with this focal length. The contrast levels are dramatic, but not too much, so the image is nicely flattened out, but quite plainly, this camera can see further than my eye and it's just fun to show off. But at night, that f4.9 aperture really slows this lens down, and it is shocking how much the image quality drops. Even with its optical and digital stabilization, images are pixelated, obviously over-processed, and just flat out blurry. In dark situations, you can get a much clearer photo from the Pixel's 5x lens, which is a bit sharper than the iPhone's 3x. The Pixel does a nice job of smoothing the image while also capturing enough light to preserve the details. So for daylight shooting, nothing comes close to the S22 Ultra's telephoto lens, but at night, that Pixel 7 Pro, it still can't be beat. So both of 'em get a point. Wow wee, so whether I'm checking if there's something stuck in my teeth or I'm on a Zoom call, the front facing camera is by far the most used camera on my phone. And on the iPhone, you have a 12 megapixel f1.9 true up camera. The Pixel has a 10.8 megapixel, f2.2 front facing camera. And then the S22 Ultra has a 40 megapixel f2.2 front facing camera. Also, the image is incredibly sharp and clear, almost too sharp, some might argue, I happen to love it, but when you compare it to the iPhone, well, the iPhone's just not as sharp. That's not to say it's blurry though either. I like the way the Apple's, you know, not over sharpening the image at all. And ah, man, this Pixel, I don't know, it's just like too contrasty for me. I wish that they would tone it down a bit. But how do all of these cameras look when it's a bit darker? Okay, welcome to the dark. What you'll notice right off the bat is the iPhone is dark. Much like it's photos, it's really not afraid to keep the shadow shadows. And when it comes to video on the front face camera, I'm not sure that's the best idea, but it does have the least amount of smoothing and noise. The Pixel, it kind of sits right in between these two, right? I mean, you can kind of see my face a little bit better, but it's a lot of noise and grain happening. And then on the S22 Ultra, you can see me the best. It really is gathering a lot of light, but with it comes a pretty fair amount of noise. On the photo side, more megapixels doesn't always mean high resolution photos, but in good light, the S22 Ultra's front facing camera is a step above the competition. The naturally blurred background is subtle, yet adds a great deal of value. And overall, this camera provides more detail than the iPhone or the Pixel. If you do want even more blur though, Samsung has the best cutout and portrait mode too. Lower light situations can cause the S22 Ultra to be a bit less predictable and fall into some bad smoothing. For example, the iPhone did a much better job here of providing a clear image. But overall, I love the level of contrast detail in depth the S22 Ultra provides. It gets the win. It's time for the title match, folks. The most important round, the wide lens. And right off the bat, I'm gonna knock one camera out of the competition completely. Although the Pixel every so often has a big win in low light, I have found that overall, it's continually a step behind the S22 Ultra and the iPhone 14 Pro. The system's choices are incredibly inconsistent, with photos either leaning too magenta or too blue. Sometimes they lack contrast and it's hardware creates these strange light reflections, both during the day and night. Not to mention that it's added features like cinematic mode and stabilization often fall flat. It is by no means a bad camera, but it is not as consistently good as its competitors. Okay, but the iPhone 14 Pro, it has a 48 megapixel wide lens that is pixel bin to a 12 megapixel sensor, unless you're shooting in raw mode. There's also a 2x lens option that crops in on that 48 megapixel sensor to create 12 megapixel images, but since that lens is using the same sensor as the main wide lens, I'm not gonna spend too much time on it. The 48 megapixel photos from the standard wide lens are gorgeous. I don't think that the average user is going to tap on this raw option often, but for anyone wanting the most amount of detail, well, you got it. Photos feel like you can reach into the screen and just grab this cone right out. And if you're going to bring them into an editing program, you'll have more options to punch in or slightly adjust the colors before the image falls apart. I love this feature very much, but Apple is playing a bit of catch up here. Samsung has used in 108 megapixel sensor since the 2020's S20 Ultra, and that amount of megapixels is in the S22 Ultra as well. The raw photos here are incredibly crisp, but what makes them even better is the pro mode that you have to be in to take them. With the S22 Ultra, you have full control over iso, shutter speed, white balance, exposure value, and even focus in this pro mode. And all that is nicely packaged and so fun to use in the phone's native camera app. And I cannot believe that Apple doesn't have a native pro mode, especially with a 48 megapixel camera, it's kind of insane. We're not taking photos in raw mode though. The iPhone will pixel bin the sensor or use software to group four pixels into one and produce 12 megapixel photos. These photos are not too punchy, but not too flat either. And what I love most about them is that they are consistent. The color tab, mature, the saturation, the contrast, it all feels the same regardless of time of day or location. And the skin tones are balanced. The S22 Ultra, on the other hand, well, it loves the color blue, and as soon as it recognizes the sky, it'll turn that blue up to borderline turquoise. But not all the time, it's just some of the time and there's no telling when this might happen. Samsung has always had a reputation for creating far too saturated images, and most of the time with the S22 Ultra, it's able to tame that desire, but just about every 20 images, it can't hold back. This unpredictability is it's biggest downfall. Where the S22 Ultra makes up for this though is portrait mode. The S22 Ultra uses an AI stereo depth map feature to map out small elements such as pieces of hair on a subject's head and keep it in focus with the subject to better sell the applied blur. This creates far more realistic depth between the subject and the background, and leads to photos I truly can't believe I took on a smartphone. I mean, in this photo, it held onto the cat's farther eyeball. And here, the S22 didn't over correct the warm light that was present at the table. The iPhone, however, is quick to seemingly just draw a circle on what it recognizes as a face and add a big blur to everything else. Case in point, Pete's dog tag's here. Gorgeous day in Brooklyn, let's go. On the video side, the iPhone 14 Pro is, again, very consistent with color, contrast, and clarity. It can shoot up to 4K 60 frames per second in pro res. And when comparing it to the S22 Ultra's 4K video, it's just a bit crisper and less jagged. That's not a professional term, but when filming small details such as leaves, you'll notice that the iPhone does a better job at separating details, but not over sharpening them. But the S22 Ultra also shoots an 8K 24 frames per second. And while I don't think anyone in needs 8K, I mean, where are you actually gonna be watching this footage? It does look noticeably better than the iPhone in this mode. There's a crop, but there's also more details. (motorcycle engine revving) November something or other, and it's like 70 something degrees, this ain't right, but I'm not gonna lie, it feels real good. This is so cool. At night however, you can see that both cameras are really working hard to stabilize the image with jagged details such as on this stoplight. Although the iPhone does do a nicer job of smoothing out the grain in the shadows. And yes, both cameras have a video stabilization mode and both have some sort of cinematic video mode that adds depth the field. But I think both of those features are still too unpredictable for the average user to use them. All right, so who wins? Last year, everyone got real mad at me for saying that if you're an iOS user, it's the iPhone, if you're an Android user, well then it was the Pixel. So this year I'm promising you a winner, and that winner is the S22 Ultra. Because folks, this camera system has so many good features, not just a couple of great tricks. When you use this camera system, you have 108 megapixels to play with, four great lenses, one of which the three times lens that I didn't even have time to talk about, but is equally as sharp and very usable. You have a portrait mode that'll have you saying, I can't believe I took this on a phone. And then on top of all of that, there's 8K video. But more importantly, and what makes this system feel like an actual camera and not just a camera slapped onto a phone is you have pro modes that let you control every part of it. Check, check, check, check, check. And I think that that control is what makes it the winner. So long as you're willing to pay $1,200 for it, which I guess in that regards, it is following along the actual camera path a bit too closely, but in the age of every phone having a perfectly acceptable camera, the ability to then tune that camera precisely to what you want it to look like is what makes it the best tool for capturing the world around you. And you know, you might actually learn a bit more about photography while you're doing it too. I know you got thoughts and I have galleries for you. There's a pin comment down below with some of my favorite photos that I took on all of these cameras. Download 'em, mess 'em up, let me know what you think. Who has the best camera, I'm coming to from the S22 Ultra, the front facing cam, and I just like cannot get over how good that is. It's kind of insane. All right, I don't know if I'll ever do this project again. It almost kills me every year, but I appreciate you for watching.",
    "transcript_keywords": [
        "ultra",
        "camera",
        "iPhone",
        "Pixel",
        "ultra wide",
        "lens",
        "megapixel",
        "Pro",
        "photos",
        "ultra wide lens",
        "cameras",
        "mode",
        "wide lens",
        "Ultra telephoto lens",
        "bit",
        "telephoto lens",
        "pro mode",
        "image",
        "front facing camera",
        "wide"
    ],
    "transcript_entity_values": [
        "The Pixel 7 Pro",
        "November",
        "Android",
        "Galaxy S22 Ultra",
        "2022",
        "108",
        "one",
        "Apple",
        "four",
        "AI Stereo Depth Maps",
        "day",
        "three",
        "the Pixel 7 Pro",
        "14",
        "Pixel",
        "the S22 Ultra",
        "the day",
        "48",
        "AI",
        "about every 20",
        "8",
        "5x",
        "116.2 millimeter",
        "2020",
        "10.8 megapixel",
        "108 megapixels",
        "night",
        "1,200",
        "Samsung",
        "2x",
        "the S22 Ultra's",
        "230 millimeters",
        "two",
        "thousand",
        "every year",
        "Last year",
        "12",
        "4",
        "12 megapixel",
        "this year",
        "Brooklyn",
        "The S22 Ultra",
        "second",
        "five",
        "70",
        "10 megapixel",
        "iPhone",
        "100",
        "3x",
        "Ultra",
        "48 megapixel",
        "40",
        "Pete",
        "Quad Bayer",
        "Pixel 7 Pro",
        "77 millimeter",
        "10"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "GPE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "QUANTITY",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL"
    ]
}