{
    "id": "iK5AXNfTJ-I",
    "title": "Best 360 Camera yet! Insta360 ONE!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2018-07-18T16:29:52Z",
    "video_url": "https://www.youtube.com/watch?v=iK5AXNfTJ-I",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "insta360 one",
        "360 camera",
        "VR",
        "how to use 360",
        "how to use the insta360 one",
        "360 video tutorial"
    ],
    "views": 385354,
    "likes": 11473,
    "comments_count": 1214,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, how's it going? It's Justine and I am so excited because today we are doing an unboxing of the Insta360 ONE. I've actually been testing this camera out for a few months. I've taken it on several trips. I took it to Tahoe, I took it to Hawaii, and I've been really loving the shots that you can get with this. And I'm not over exaggerating. I might seem a little bit excited, but when you guys see the really cool stuff that this thing can do, you're going to be just as excited as I am. (upbeat music) Oh that's not it. Ooh I've got some other things. This one is a dog mount. You can get this on Insta360's website. So you better believe we're going to be putting this on Mattie today. We've got a few other accessories. There's a bike mount, there's a helmet mount, and a chest strap. So guess what? I'm going to be on a bike today as well. This video's going to get crazy. (cutting, unwrapping sounds) So there's a bunch of different pieces that go into this. So this is, well, I guess you could call it a selfie stick, but it's so much more than that. As it says on here, this is designed for Bullet Time. Here is the actual camera. It's great because it has this little protective case on it, so it'll protect the lens. So you can see there's a lens on both sides. There's one here, and one here, and down here on the bottom, this flips up and you can plug this directly into your Iphone. Here's the on button. You can also use this to take photos and videos. Here's the SD card slot, and this is also where you will be putting the selfie stick. You can call it the Bullet Time stick. There's also another little place right here where you can screw on an actual tripod. The best part about the Insta360 ONE is the stick. You actually will never see it in any of your videos or photos. It magically erases it from all of your footage. So it kind of just looks like a drone is following you. We also have a Bullet Time handle. This will all make sense, I promise. This screws into the bottom of the Bullet Time selfie stick. And you basically will be able to swing this around to get the Bullet Time shots. And yes, you are going to look absolutely ridiculous, but it is so worth it for the shots you will be able to get. The stick also extends, if you haven't noticed, I'm not going to swing this around in my office, because I will definitely hit that camera. We also got some USB cables, which are very very important. I'm sure you guys have never seen these before. New technology. So this just charges with a micro-USB cable that they included as well. So I already have the Insta360 ONE app installed on my phone. You plug it in. (beep sound) Okay so we're going to hit this little plus button right here so you can look at your 360 album, your Iphone album, or you can choose to shoot a new video or photo. And here we are. It is live. So I can scroll around here so you can see me, you can see my office, and this is all happening pretty much live on your phone. Like, all we did was plug this camera into your phone. Oops, I didn't even mean to hit that. But right now, we just took a picture. So you don't need to have this plugged into your phone to shoot videos or photos. One press to take a picture. Two press to record video. And when you have the Bullet Time handle on, you press it three times, (clicking sound) And that's when you swing it around your head to get the Bullet Time shots. One of the things that I really like is I love free capture. Because if you don't want to post a 360 video on your Instagram or on Twitter, you can just kind of use this and just film. Then go back in later and choose the shots that you want. Pivot points will allow you to sort of play connect the dots in your 360 video. It'll automatically connect each point to give you really great cinematic shots. You can just go out and film with this thing and not have to worry about getting the shot because it's 360. You've got the shot. This also has a thing called flow-state stabilization. So you can go running, you can put this on your dog, you can put it on your bike, and it'll give you that look and feel of it being a Gimbal, but it's not. It's this. Once this is connected, you can see all of those really amazing things that you just shot. You can edit it, save it out, and then you can also share it. (chime sound) We need to get out of my office so I can give you guys a proper demo of this. We're going to be going over a lot of things. So, get ready, because we're going outside. I'm going to test this out, and put this in the middle of this jungle gym. Double tap to start the video. Will I get hurt today. That's the question. Oh what's cool is you can use the editing feature inside of the app, so this is being shot right now in 360, but I can follow myself around using pivot points. So it's a 360 video, but you guys are seeing it in a not-360 video. This is so fun. Holy crap. Why have we never come here before? Is that a slide? There's a slide. There's a, oh wow, there's so many things I can do here. (mumbling laughter) This is like the park whore dream. So we'll plug it in, and see what we just got. (children yelling playfully) We made perfect timing, because the children have arrived. One of the best things is if you look down, where's the stick? It's gone. It is automatically removed. Here's a quick look at the Iphone interface. So right here, there's a 360 button option, and if you click that, it'll give you various modes that you can choose from. There's a circle view, and a rectangle view. You can choose from from the front or the back camera to put in each section. This is one of my favorite views. This is a split view, and I've been using this a lot in IGTV. If you guys follow me on Instagram, you probably have already seen me experimenting with this. Switching from the 16x9 aspect ratio to the 9x16 will give you this perfect vertical look. You can change up the views from the top and the bottom, and then export that, and you've got yourself the perfect IGTV video. Now I want to show you guys a demonstration of the flow-state stabilization. And this is probably one of my favorite features because it essentially will make it look like you have a drone following you, but you don't. You're holding this camera on a stick. Double tap. Okay it's recording. Now, we can run around. (upbeat music) Lost my phone again. (upbeat music) You guys may notice that I have my phone in my hand, but a few minutes ago, I realized that the phone had dropped out of my pocket while I was running around like a fool. Let's see if we can replay the exact moment that I lost my phone. Yes. So look. It's crazy, because you can not even see the stick. When does the phone fall out? At what point? So you can see the stick in the shadow. There it goes! There it goes! Yes! The phone! There it goes. That's amazing, wow, what a moment, captured, here in 360. (upbeat music) We've got a dog harness here, and we've got the mount. So what we're going to do is we're going to put this on my dog, and we're going to see what happens. Because you can get some really cool stabilization shots. I've seen a few previews of this before, so now it's time to try it out on my own dog. Hey Mattie! Let's put your little (click sound) Oh! What've you got on your back? What've you got on your back? (upbeat music) Look at this! Yeah Mattie! You are the best! He looks like a little robot boy. Are you a robot? Alright now we are heading to the dog park. We're going to test this out and see what happens. Mattie is loving it. He is super into it. (upbeat music) Time to see what we've got from Mattie. Oh my goodness, this is awesome. Oh my gosh, this is amazing. This is such a cool perspective of my dog. I wonder if he knows how cool he looks. (calm music) There's also a desktop app that you guys can use to export higher quality videos than what I'm showing you guys here. I just choose to use my Iphone because it's so easy and convenient, but I just wanted you guys to know that there is a desktop option if you choose to do that. This is the tiny planet mode. You can use any aspect ratio you want, but I think it looks best in the square. Let me know what you guys think. (calm music) Here's an example of before and after using the flow-state stabilization. As you guys can see here, there are two different versions of this. If you do decide to turn off the flow-state stabilization, you won't be able to use free capture. It's pretty easy to turn on and off in the settings, but my recommendation is leave it on, because it looks way better. We need to talk about Bullet Time. Some of you guys may be too young to remember the small little movie called The Matrix. It was a good film. If you haven't seen it, you should look it up. But this is one of my favorite features. So this is a little handle, that spins around like this. The handle attaches to the Bullet Time selfie stick like this. And then, essentially, you're going to swing this around your head. You will look like an idiot. I promise you. It is something that will happen. But when you see the footage, it is worth it. You're going to triple tap the power button to automatically go into Bullet Time mode. When my sister and I were in Hawaii, I was up on top of this mountain swinging this around my head. And people were like, what are you doing? I said, hold up, wait a minute, let me show you. So I plugged this camera into my phone on the top of the mountain, and I showed people this, and they were blown away. So now, let me demonstrate. Let me show you how cool I look. Wheee! Look at my friends. They are flocking from miles away. And you can experiment with moving your arm different ways to see what works best, but, I'll tell you what, man, look at this. (calm music) Alright, now we're going to be testing out the hyperlapse feature, and for that, I rented myself a bike. Safety first, kids. So this is the bike mount. This is sold separately on Insta360's website. So you can just pop that on there, and I think we're about ready to test this out. Buh-bye! Do I come back, wait, do I have brakes? Here we go! - [Camera Man] I'll be here. - Okay should I just drive around? (upbeat music) I'm too impatient to see what my footage looks like. Look. Wow, this is so neat. (talking in video) I created that hyperlapse very easily. I just added some pivot points so that I can move the camera around as I was moving along. Once those are all set, you can go in and change the speed from 1X all the way up to 64X. Export it out, and you're all done. You guys, thanks so much for watching. I hope you guys enjoyed this video. I had so much fun playing with the Insta360 ONE. Let me know if you guys like the video and if you'd like to see me do anything else crazy or fun with this, leave those in the comments below. And I'll see you guys in my next video. Uh, this is great, see you later. Whoa, whoa, whoa! (upbeat music)",
    "transcript_keywords": [
        "Bullet Time",
        "Bullet Time shots",
        "Bullet Time selfie",
        "Time",
        "guys",
        "Bullet Time handle",
        "Bullet",
        "Bullet Time stick",
        "video",
        "stick",
        "Time selfie stick",
        "phone",
        "Bullet Time mode",
        "Time shots",
        "shots",
        "camera",
        "Time selfie",
        "selfie stick",
        "dog",
        "things"
    ],
    "transcript_entity_values": [
        "The Matrix",
        "a minute",
        "ONE",
        "Justine",
        "Two",
        "Iphone",
        "Hawaii",
        "Instagram",
        "three",
        "Time",
        "micro-USB",
        "Twitter",
        "Buh-bye",
        "the Bullet Time",
        "Bullet Time",
        "Tahoe",
        "360",
        "Mattie",
        "SD",
        "today",
        "Bullet Time",
        "Gimbal",
        "two",
        "Insta360",
        "16x9",
        "a few months",
        "a few minutes ago",
        "USB",
        "One"
    ],
    "transcript_entity_types": [
        "WORK_OF_ART",
        "TIME",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "WORK_OF_ART",
        "WORK_OF_ART",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "FAC",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL"
    ]
}