{
    "id": "ikQOw0Nxyr4",
    "title": "Why Someone Bought This Card for $166,100",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2019-05-06T16:40:04Z",
    "video_url": "https://www.youtube.com/watch?v=ikQOw0Nxyr4",
    "category": "Education",
    "tags": [
        "this is",
        "austin evans",
        "mtg",
        "magic the gathering",
        "wizards of the coast",
        "magic: the gathering",
        "magic",
        "ccg",
        "tcg",
        "wotc",
        "magic cards",
        "magic card game",
        "Black Lotus",
        "Richard Garfield",
        "RoboRally",
        "Pokemon",
        "Yu-gi-oh",
        "Friday Night Magic",
        "deck",
        "card game",
        "trading card game",
        "mtg arena",
        "planeswalkers",
        "yugioh",
        "pokemon tcg",
        "mtga",
        "cards",
        "magic arena",
        "standard deck",
        "arena",
        "game",
        "magic the gathering arena",
        "booster"
    ],
    "views": 72901,
    "likes": 2733,
    "comments_count": 176,
    "description": "Pokemon and Yu-Gi-Oh! got nothing on Magic: the Gathering's Black Lotus How The Pirate Bay Almost Bought a Country:  How Marvel Assembled the Avengers:  The Most Illegal Place on the Internet:  How Airline Travel Is Safer Than Ever:  The First Meme:    Subscribe!  Twitter:  Instagram:",
    "description_links": [
        "https://youtu.be/A3kKG9Svo-k",
        "https://youtu.be/OUKLXm_y4lk",
        "https://youtu.be/1qwUBovBw6s",
        "https://youtu.be/nRrOzMQFo5c",
        "https://youtu.be/TFOowriWTww",
        "http://www.youtube.com/thisis",
        "https://twitter.com/thisisguys",
        "http://instagram.com/austinnotduncan"
    ],
    "transcript": "- Hey guys, this is how Magic: The Gathering took over the world. Recently, Magic's rarest card, the Black Lotus, broke records by selling for an astronomical $166,000, double the previous record, only $87,000. Now that, that's expensive. Now other card games such as Pokemon and Yu-Gi-Oh! were able to rise to popularity mainly due to their TV and video game franchises. I know as a kid I was super-excited to buy some Yu-Gi-Oh! cards after I watched the show, but without that advantage, how did Magic get so popular? Well, there are dozens of different card games out there. Magic: The Gathering was the first actual collectible card game, and that is by definition. Magic's creator, Richard Garfield, coined the term when they patented the game play. Fun fact: Garfield, an avid tabletop gamer, was originally trying to produce his own tabletop game, RoboRally, but instead, they made Magic to be a quick and easy game for people to play while waiting in lines at conventions. But now there are Magic conventions and people waiting in line to play. You know, that's just, time's a flat circle, the Matthew McConaughey meme. It all makes sense. Baseball cards, which had been around since as early as the 1860s, have always had the collectible aspect, but there was no actual gameplay involved. It was just a game about collecting your favorite players. Of course, card games such as poker or rummy have been around for centuries. What makes them different from Magic is that they have a set deck structure. For example, poker uses the same 52 card deck every time, whereas in a true CCG the deck customization is a key element of the gameplay, and that's part of the reason why Magic has become so popular. A big contributing factor for Magic is how accessible it is especially for new players. Now Magic even offers free decks for beginners. Matt, can you please provide some decks? Okay, wait, wait, oh, oh, okay, all right. These are really sharp. (laughing) How many decks did you get? - [Matt] Five. - Okay. So these are all free decks that Matt was able to go, literally, he just walked into the Magic shop and just said, \"Hey, I want some decks, please.\" - [Matt] Yeah, that's exactly how that went. - Okay. Now, sure, you might get some free decks to start you out, but that's just how they hook you. Matt still came back with a bunch of booster packs as well. Probably the more nefarious reason for the game's popularity is just how addictive it is. On the competitive side of things, constant modifications and upgrades to your deck are required. Now several professional players have reported that even though they make a lot of money from winning tournaments, they then spend thousands or tens of thousands of dollars in new cards every year, often barely breaking even. That of course is on the very extreme side of things, but still, this could get pricey. - [Matt] I spent $100 here. - How is it $100 now?! From a collection standpoint, around 10,000 individual cards have been printed. Now even semi-rare cards can go for hundreds, if not thousands, although sadly our cards are not worth more than 40 cents. You can easily argue that card games such as these are pay-to-win. Sure, you can go start out with your free deck, but you won't be winning any tournaments with it. For as much as much people dislike loot boxes in video games, booster packs have operated pretty much the exact same way for decades. For those with money, you could just go buy a Black Lotus and instantly boost your deck, although it's actually banned in most tournaments, so good luck with your brand-new $166,000 card. Now of course it is actually banned for a reason, and not because it's just too powerful. 25 years after first releasing, Magic is probably more popular now than ever, and a huge part of that is due to how well Wizards of the Coast have actually made this a game to play instead of just collect. Although I'm sure I'm about to get a lot of comments from Magic people, like, saying, like, \"No, they suck because they stopped printing \"my favorite card and my brother went into debt \"because he spent all his money \"trying to find a Black Lotus!\" I really should stop doing that voice. I think that's really offensive. Thank you so much for watching this episode of This Is. If you enjoyed, definitely be sure to smash that like button and subscribe for more episodes like this. If you don't, just remember, that for every person who's not subscribed while watching this video, Matt buys another booster pack.",
    "transcript_keywords": [
        "Magic",
        "card",
        "game",
        "Black Lotus",
        "card games",
        "cards",
        "deck",
        "decks",
        "games",
        "Matt",
        "Black",
        "play",
        "Lotus",
        "Hey guys",
        "Magic rarest card",
        "Gathering",
        "free",
        "people",
        "free decks",
        "Richard Garfield"
    ],
    "transcript_entity_values": [
        "thousands or tens of thousands of dollars",
        "RoboRally",
        "hundreds",
        "Coast",
        "Yu-Gi-Oh",
        "Garfield",
        "CCG",
        "Black Lotus",
        "Five",
        "only $87,000",
        "Matt",
        "Magic",
        "dozens",
        "Magic conventions",
        "10,000",
        "as early as the 1860s",
        "Magic: The Gathering",
        "thousands",
        "Magic",
        "centuries",
        "every year",
        "more than 40 cents",
        "100",
        "Matthew McConaughey",
        "25 years",
        "Richard Garfield",
        "Pokemon",
        "decades",
        "first",
        "the Black Lotus",
        "52",
        "166,000"
    ],
    "transcript_entity_types": [
        "MONEY",
        "ORG",
        "CARDINAL",
        "LOC",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "MONEY"
    ]
}