{
    "id": "il6qzbDUYaA",
    "title": "They bought the wrong console...",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2020-09-24T02:38:32Z",
    "video_url": "https://www.youtube.com/watch?v=il6qzbDUYaA",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "preorders",
        "launch",
        "release date",
        "specs",
        "Xbox SEries X",
        "Xbox",
        "Xbox Series X preorder",
        "Xbox Series X stock",
        "Series S",
        "Xbox Series S preorder",
        "Xbox REmote play",
        "Xcloud",
        "iOS"
    ],
    "views": 501792,
    "likes": 28280,
    "comments_count": 1066,
    "description": "Learn through Problem Solving and the first 200 people can save 20% off today on Brilliant at   GET MERCH:  SUPPORT US ON FLOATPLANE:  LTX EXPO:   Timestamps 0:00 Hoodlinked 0:03 Xbox Series X + Series S preorder shenanigans 1:20 Microsoft Ignite 2:22 Pixel 5 + Pixel 4A leaks 3:16 Brilliant 3:53 QUICK BITS 3:56 Tesla Battery Day 4:23 Ex-Blizzard devs found Dreamhaven 4:48 Samsung Galaxy S20 FE 5:10 Google Maps gets Covid data 5:24 Sony Xperia Play 2  NEWS SOURCES  TOO MANY XS, NOT ENOUGH BOXES Xbox Series X preorders  Lotta people bought Xbox One Xs   Holding stock for launch day  Remote Play  xCloud WILL launch on iOS, dammit   SEE THE FUTURE Exclusively licenses OpenAI GPT-3  - first new Zenimax title is a text generator  Holographic storage  Microsoft Premonition  predicting the next pandemic    MAMBO #5 Pixel 5 + 4A 5G specs leak Pixel 5 design      QUICK BITS  CHARGE MORE WHILE CHARGING YOU LESS Tesla Battery Day  25K electric car in 3 years    THEY GOT DREAMS, COACH Ex-Blizzard CEO, devs create Dreamhaven game company     ITS FOR THE FANS Samsung Galaxy S20 Fan Edition   OK GOOGLE, AVOID WISCONSIN Maps shows you how bad Covid is    I MISS THE OLD SONY The Playstation phone that could have been   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/TechLinked/",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://kotaku.com/xbox-series-x-pre-orders-have-been-a-debacle-so-far-1845142151",
        "https://linustechtips.com/main/topic/1250148-amazon-reports-a-747-increase-of-xbox-one-x-sales/",
        "https://www.polygon.com/2020/9/22/21451484/xbox-series-x-preorder-one-mistake-s-microsoft-naming",
        "https://www.reddit.com/r/Games/comments/ixwbn4/xbox_on_twitter_if_you_werent_successful_today_be/",
        "https://www.xda-developers.com/xbox-remote-play-console-streaming-android-free/",
        "https://www.cbr.com/xbox-ios-support-xcloud/",
        "https://venturebeat.com/2020/09/22/microsoft-gets-exclusive-license-for-openais-gpt-3-language-model/",
        "https://twitter.com/sharifshameem/status/1282676454690451457",
        "https://youtu.be/4EADwGV5Gv8",
        "https://techcrunch.com/2020/09/22/microsoft-launches-premonition-its-hardware-and-software-platform-for-detecting-biological-threats/",
        "https://youtu.be/5dHqY5sCNFs",
        "https://winfuture.de/news,118410.html",
        "https://winfuture.de/news,118001.html",
        "https://www.theverge.com/2020/9/23/21452607/pixel-4a-5g-spec-leak-similar-pixel-5",
        "https://9to5google.com/2020/09/23/pixel-4a-5g-specs-leak/",
        "https://arstechnica.com/cars/2020/09/how-tesla-plans-to-make-batteries-cheap-enough-for-a-25000-car/",
        "https://www.themanufacturer.com/articles/main-takeaways-tesla-battery-day/",
        "https://www.kitguru.net/gaming/matthew-wilson/former-blizzard-ceo-and-co-founder-forms-new-game-studio/",
        "https://www.dreamhaven.com/news/announcement",
        "https://kotaku.com/former-blizzard-boss-mike-morhaime-launches-dreamhaven-1845152912",
        "https://www.gsmarena.com/the_samsung_galaxy_s20_fe_goes_official_with_4g_and_5g_versions_65_120_hz_oled_display-news-45432.php",
        "https://www.neowin.net/news/google-maps-adds-covid-19-layer-to-let-you-see-critical-data-in-specific-areas/",
        "https://blog.google/products/maps/navigate-safely-new-covid-data-google-maps/",
        "https://www.reddit.com/r/SonyXperia/comments/ivutbx/xperia_play_2_anyone_knows_about_this_device_the/",
        "https://arstechnica.com/gaming/2020/09/apparent-prototype-photos-show-sonys-canned-playstation-phone-follow-up/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Tech news, but with hoods on. Hoodlinked. After retailers screwed up PlayStation 5 pre-orders last week by launching product pages early, Microsoft said their retail partners were prepared for an onslaught of console hungry gamers when pre-orders for the Xbox Series X and S went live Tuesday morning. The launch proceeded on schedule, but online stores still found their servers overloaded with requests from people like Colton - Wow, what? - For Xbox's, and they quickly sold out. Unfortunately, some fans fell victim to Microsoft's confusing naming scheme and accidentally ordered Xbox One X's instead. With Amazon marking a 740% increase in sales of their three-year-old console. And if you're one of those poor souls, or if you just couldn't get a Series X or S, don't worry. Microsoft is holding a certain amount of consoles in stock for the actual launch on November 10th. Until then, you can play with the new Xbox remote play feature which lets you stream games from your console to your Android phone. This is not to be confused with XCloud, the cloud streaming service, which Microsoft is adamant will launch on iOS despite Apple's predictably silly rules when having a dedicated app for each cloud game. Their iOS home screen would be so crowded. Although you could make it look pretty sweet with them new widgets. For the first time in my life, I want an iPhone. It feels weird. - [Colton] You're gonna get an X box too? - Maybe. Microsoft is also holding their Ignite developer conference right now where they've made a few interesting announcements. The company is developing a method of holographic storage involving sending beams of light through lenses at a crystal cube, which can hold information until it's wiped with the UV radiation, Sounds nerdy as hell. There's also Premonition, Microsoft's attempt to build something like a weather monitoring system, but for disease outbreaks, using robotics and cloud based software to capture, sample and test disease carrier, like mosquitoes or people. I guess soon it'll be normal to see spot robots' leaping around snatching flies out of the air, a beautiful future. And finally, Microsoft announced an exclusive licensing agreement with OpenAI's GPT-3 language model. In case you forgot GPT is the AI behind the amazing AI dungeon text RPG. I can see it now. Bethesda's first game under its new management, Microsoft language simulator. It will be sick as long as you don't need words to mean anything. And a bunch of leaks from German site WinFuture have given us a look at the possible specs and design of both the Google Pixel 5 and the beagle, the Google Pixel 4a 5G. The leak is consistent with previously seen rumors claiming the Pixel 5 will have a six inch OLED 90 Hertz display covering the whole front with a cut out selfie camera. Bye bye gesture controls, I guess. And good riddance. Hey, I use those. Inside is a Snapdragon 765G with sub six gigahertz 5G support, eight gigabytes of RAM and a 4,080 milliamp hour battery. The Pixel 4a 5G supposedly has the same processor, but only six gigabytes of RAM, a smaller battery and a display capable of a measly 60 Hertz. Although, it is slightly larger, or is it? I don't know. And neither do you but we should both know for sure come September 30th when Google officially unveils both devices. For now, it's time for the quick bits brought to you by Brilliant. The website that helps you reach your learning goals by working just a little bit every day. The courses use interactive explorations on a mobile app to take complex concepts and break them up into delicious chunks of your intellectual convenience. We suggest checking out their mathematical fundamentals course, which has been redesigned with interactive features to help you, yes you with the foundational concepts of line algebra, number theory, logic and all the things that are all smarty pants, making it a great resource for STEM students. The first 200 people that head to Brilliant.org/TechLinked will get 20% off in annual premium subscription. So check it out right now. - Brilliant. - Whoa, quick bits. Yeah, yes! At their battery day event yesterday, Tesla announced that upcoming advancements in the company's battery technology will enable them to sell a $25,000 electric car, in three years, Tesla is also phasing out cobalt, a component of lithium batteries since it's expensive and often mined unethically. (blows tongue) Because reducing emissions is less worth it if you have to use child labor to do it, you know, it's good to get rid of that stuff. Unless you're Elon Musk's son who was probably an Android and doesn't count. Hey, think Blizzard has sucked since Activision got involved? Well Blizzard co-founder Mike Morhaime agrees. and now has founded a new company called Dreamhaven. It will be the parent company of two development studios called Moonshot or Moon's hot and Secret Door, both headed by former creative leads of Blizzard. Frankly, I'll take a StarCraft knockoff if it comes with those bomb ass cinematics. \"My life for Auir.\" Know what I mean? Samsung apparently realizes the Galaxy S20 got a lukewarm reaction when it launched for a thousand bucks. So now they're releasing the S20 Fan Edition for $700US with a slightly lower spec, like a 1080P display that doesn't curve on the side, but it's still got 120 Hertz screen and a decent battery. Please buy it. We have different colors, please. Google maps is getting an update that will show these seven day average COVID cases in US States, a handy metric for planning your next road trip, which you probably shouldn't be taking right now. But if you do, consider heading straight downward into a bunker. And hey look, it's the Sony Experia Play 2 a phone that never launched. But from the looks of it, it should have because with its thin screen and stylish PlayStation style buttons, it could have been an awesome mobile alternative for PlayStation fans. Sony, it's not too late to give up on this whole console thing and tackle Nintendo head-on. They've rained over portable gaming for a long enough, right? Seize power. Seize it! - They tried twice. - Yeah, they've tried, yeah. And we'll end this episode before things get too scary. Come back on Friday for more tech news 'cause we've got what you need. Tech news. I feel like when I have a hood on I just act like Riley more. Its weird. - Yeah. - Oh, this was tied up too. That must have looked weird when I was- - Yeah you have a really gangster look going on.",
    "transcript_keywords": [
        "Microsoft",
        "Xbox",
        "Xbox Series",
        "Google Pixel",
        "Pixel",
        "Google",
        "Yeah",
        "console",
        "battery",
        "Colton Wow",
        "Xbox remote play",
        "live Tuesday morning",
        "Hertz",
        "company",
        "Series",
        "ordered Xbox",
        "accidentally ordered Xbox",
        "Blizzard",
        "launch",
        "Tuesday morning"
    ],
    "transcript_entity_values": [
        "a thousand bucks",
        "700US",
        "yesterday",
        "PlayStation 5",
        "six inch OLED 90",
        "morning",
        "three years",
        "the Xbox Series X and S",
        "Hertz",
        "RAM",
        "only six gigabytes",
        "Riley",
        "XCloud",
        "Tuesday",
        "September 30th",
        "20%",
        "Tesla",
        "S20 Fan Edition",
        "Colton - Wow",
        "Bethesda",
        "seven day",
        "Google",
        "StarCraft",
        "Amazon",
        "three-year-old",
        "Secret Door",
        "last week",
        "Activision",
        "AI",
        "eight gigabytes",
        "200",
        "Nintendo",
        "Microsoft",
        "Samsung",
        "Auir",
        "Friday",
        "740%",
        "November 10th",
        "annual",
        "Experia",
        "first",
        "4a",
        "Dreamhaven",
        "Sony",
        "Premonition",
        "Hoodlinked",
        "two",
        "120",
        "Android",
        "GPT",
        "German",
        "WinFuture",
        "25,000",
        "US States",
        "Elon Musk's",
        "the cloud streaming service",
        "Moon",
        "Xbox",
        "Xbox One X's",
        "2",
        "PlayStation",
        "Apple",
        "5",
        "4,080 milliamp hour",
        "Mike Morhaime",
        "Moonshot or"
    ],
    "transcript_entity_types": [
        "MONEY",
        "MONEY",
        "DATE",
        "PRODUCT",
        "QUANTITY",
        "TIME",
        "DATE",
        "EVENT",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "PERCENT",
        "ORG",
        "PRODUCT",
        "LOC",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PERCENT",
        "DATE",
        "DATE",
        "PRODUCT",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "MONEY",
        "GPE",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "ORG"
    ]
}