{
    "id": "iMIAqhaLKwQ",
    "title": "The NEW Colorful HomePod Minis! Orange Unboxing",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2021-11-01T14:02:25Z",
    "video_url": "https://www.youtube.com/watch?v=iMIAqhaLKwQ",
    "category": "Science & Technology",
    "tags": [
        "ijustine"
    ],
    "views": 349750,
    "likes": 12712,
    "comments_count": 763,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine. And today in front of me, we have one of the brand new HomePod Minis, they just released a bunch of new colors. They have obviously the space gray and the white that they previously had before. But now they've added a yellow, orange and a darker blue color. And I'm really excited about this because I love the HomePod so much. I feel like I'm one of the people that definitely can account for a large percentage of their sales over the past couple of years. I slowly went from one HomePod to two, to three, to four, to having my entire home be filled with them. So when the HomePod Mini did come out and didn't really have a need to get many of them, but I do have a couple. So I'm very excited though, for the colors, because this is kind of like a fun added flare, a little bit of decoration, if you will. The main thing though, to note, is it really is just a color upgrade. There isn't any tech difference between this and the previous HomePod Mini. But the thing that they do have now is the voice plan for Apple Music. And why this is kind of interesting is because before, if you would get a HomePod, you would want to have an Apple Music subscription and it would be even more expensive. And you basically only use your voice to talk to your HomePod. So having this added 4.99 voice plan gives you the ability to have all of the access to Apple Music, playlists, telling Siri to play you different songs, and not have to pay the full price for an Apple Music subscription. I think that's going to kind of be a really interesting thing for a lot of people who don't have Apple Music and maybe are just getting into the HomePod game for the first time. And if you are, welcome, it's nice here. Let's open this up. Look at this. Kind of hyped about this because I have the AirPod Max to match this. And this is definitely the color that was my favorite of the new ones that were announced. We don't need to use a knife, but we're going to use a knife. Hi, little HomePod. Oh, you're so cute. Oh, look at that. Oh, it's so nice. I love the braided cable. The fact that the cable actually is an accent color, so it kind of matches the orange HomePod. Even the Apple logo, check that out. The Apple logo is even kind of like a light orange salmony color. I was honestly hoping that they would have released every single color to match the iMac. Because the purple iMac is such a nice color. They even made the buttons a little orange tint as well, so it matches. This is nice. Look at that. Oh, this is fun. We've got our charging brick. This is the 20 watt so you do have to make sure if you have the 18 watt charging brick, this will only work with the 20 watt, and I've made that mistake. I've gotten them mixed up before. So 20 watt only. Okay, let's plug this in. Oh, I'm so excited. I just love the fact that Apple products are so easy to set up. You basically just bring your phone close to it. It's magic. It is actually magic. (upbeat music) So I got the new HomePod all set up. And one of the things that I thought was really cool is during the setup process, it actually recognized that this was the orange HomePod. So in the setup dialog, you can see that it is labeled with the orange HomePod. Now, much like all of the previous HomePods and other Apple accessories, it's so easy to set this up. You just bring your phone close to it. It automatically realizes that this is something needs to be set up, and it goes through the whole process. I've had HomePod since the very beginning, and I love the fact that they did introduce these new colors. And this orange one really just brightens up the space. Look at this, bright, cheery, happy. I know it's been a while since the original HomePod review video that I did, but some of my favorite features that they've added recently is the intercom feature. And this is really fun because whenever my sister comes over and has like a sleepover or something like that, we're able to talk to each other from room to room. So there's one in her bedroom, there's one in mine. I have one in the kitchen. You can either use the HomePod to do an intercom, or if you have your phone up, you can just hit the intercom button up at the top. Uh, tell Jenna that it's time to wake up and we're going to go get breakfast now. - [HomePod recording] Uh, tell Jenna that it's time to wake up and we're going to go get breakfast now. - I probably could have just said, hey Jenna, we're going to go get breakfast. But for some reason I always end up acting like I'm talking to Siri and then telling her to tell somebody something, but you get the point. The other thing that I like with the power of the U1 Chip, which is only in the HomePod Mini and not in the larger versions, is you can bring your phone close to it. If nothing is playing, it'll automatically pop up with some suggestions of things to play. This also works if you're listening to something already, or if you're on a phone call, you can transfer it directly to your HomePod. One thing that Apple recently announced is the Apple Music Voice Plan. And this is 4.99 a month. So instead of spending the 9.99 a month for Apple Music, the voice plan is 4.99, and you basically just use your voice. So you can basically tell Siri to play music, playlist, genres, and all sorts of things like that. But you won't have access to the actual app. To create playlist or scroll and search, you can only use your voice. This might make sense for some people who don't really use their phone and they just use the HomePod as a music playing device or something that allows them to have HomeKit enabled in their home. HomeKit is incredible. So with the HomePod, this will allow you to connect all sorts of HomeKit devices like lights, locks, garage door openers, all sorts of things that are HomeKit compatible, as long as you have the HomePod, it'll give you voice access to all of these devices. So I was looking at some things to see if there's something that I didn't know about the HomePod. This I actually did not know. You can tell Siri to play sounds of animals. What sound does a cow make? - [Siri] A cow sounds like this (cow moos) - What sound does a giraffe make? - [Siri] Here's the giraffe. (giraffe grunts) - I'm unsure if that's correct. I don't, I've never heard a sound of a giraffe before. - [Siri] Here's a hippopotamus. (hippopotamus bellows) - Oh, geez. (hippopotamus bellows) - I didn't like that. If you have two of these, you can set them up as a stereo pair, and you can also have access to your Apple TV so you can have it control, start, play, stop. All of those things you can control with your voice on the HomePod. Later this year, they're going to be coming out with voice recognition profiles. So it'll be able to tell my voice from my sisters. So each be able to have customized controls of the HomePod. Also very exciting, that you can now change Siri's voice. You guys may have seen that they changed this a while ago. - [Siri] Hi, I'm Siri. Choose the voice you'd like me to use. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - I'm Siri. - Choose the voice you'd like me to use. - That's what we're going to use. And that's what I actually did have on for awhile. And then I somehow said something and Siri picked it up and then it started talking and I forgot that I changed it to a male voice. And I thought there's a person in my home. And I was like, what is happening? And it turned out it was our dear friend, Siri. I mostly use my HomePod for playing music. So doing things like play top 90s Rock. This is actually really loud for such a tiny little speaker. Much like the previous version, the top is touch sensitive, can also adjust your volume controls. You can make it louder or less loud. You can also obviously use your voice and tell Siri to turn the music down or up. What's the weather like? - [Siri] It's currently clear and 81 degrees. Temperatures are heading down from 81 degrees to 68 tonight. - So that was just the first look at the orange color of the new HomePod Mini. I'm really excited about this and all the other colors. If you guys haven't got a HomePod already, now seems like a pretty great time to do so. They do start at $99. You can choose from yellow, orange, blue, the black and the white. It's also kind of exciting, again, like I had mentioned, the voice plan, that it's 4.99, so you don't have to get a full music subscription. You could just use this as your HomeKit enabled device and get the voice plan and still have all of the access to Apple Music. Thank you guys so much for watching. I would love to hear what you guys think. Leave me some comments below. And let me know, if they made a HomePod color that is not already out, which one would you like to see them make? See you guys in the next video. Bye.",
    "transcript_keywords": [
        "Apple Music",
        "Siri",
        "HomePod",
        "Apple",
        "voice",
        "Music",
        "HomePod Mini",
        "Apple Music subscription",
        "Apple Music Voice",
        "voice plan",
        "color",
        "orange",
        "things",
        "Mini",
        "orange HomePod",
        "kind",
        "Justine",
        "Siri voice",
        "Music subscription",
        "Music Voice Plan"
    ],
    "transcript_entity_values": [
        "81 degrees to",
        "the HomePod Mini",
        "one",
        "iMac",
        "Apple TV",
        "Apple",
        "Justine",
        "HomeKit",
        "4.99",
        "tonight",
        "99",
        "the Apple Music Voice Plan",
        "81 degrees",
        "three",
        "the past couple of years",
        "HomePod",
        "HomePods",
        "four",
        "Siri",
        "4.99 a month",
        "Later this year",
        "20 watt",
        "today",
        "iMac",
        "two",
        "the U1 Chip",
        "90s Rock",
        "9.99 a month",
        "HomePod Mini",
        "18 watt",
        "HomePod Minis",
        "first",
        "Apple Music",
        "the HomePod Mini",
        "Max",
        "Jenna",
        "One"
    ],
    "transcript_entity_types": [
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "TIME",
        "MONEY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "QUANTITY",
        "DATE",
        "ORG",
        "CARDINAL",
        "FAC",
        "GPE",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}