{
    "id": "imMd4kLLIvo",
    "title": "Bliss History: World’s Most Viewed Photo - Krazy Ken’s Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2023-07-21T14:59:42Z",
    "video_url": "https://www.youtube.com/watch?v=imMd4kLLIvo",
    "category": "Science & Technology",
    "tags": [
        "Bliss History: World’s Most Viewed Photo - Krazy Ken’s Tech Talk",
        "Microsoft",
        "Windows XP",
        "Bliss",
        "Michael MJD",
        "Charles O'Rear",
        "PC",
        "iMac",
        "Apple",
        "Windows NT",
        "Windows 98",
        "Codename Whistler",
        "Windows Whistler",
        "Beta",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "California",
        "Sonoma",
        "Wine Country",
        "Vineyard",
        "Computer Clan"
    ],
    "views": 118463,
    "likes": 6243,
    "comments_count": 461,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Krazy Ken tells the fascinating (and somewhat tragic) story behind the historic Windows XP \"Bliss\" wallpaper. He also travels to California to photograph it himself and sh*t hits the fan  Data recovery scam-buster   Patreon!   Download my wallpapers!    Follow me on Twitter   Facebook   Shop for cool stuff on my store   Hey! I have a Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Big thanks to Brainiac Brent for helping film!  And special thanks to Michael MJD and WindowsOnWindows!  Music at 3:29 is Drifting2 by   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear I use   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  00:00 Introduction / The Mission 01:20 The Hill is Real! 01:53 Windows XP History 04:54 Charles O'Rear (The Photographer) 05:35 Photo Day! And Vineyard Tragedy 07:55 Selling the Rights / Photo Licensing 09:32 Bliss Revealed / Red Moon Desert 10:50 Let's Go Find the Hill! 12:45 Taking My Own Photos 13:22 Uh-oh I Think I Screwed Up 14:24 Fact Checking, a Valuable Life Lesson 16:03 Windows 8 and Moving on From Bliss  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://youtu.be/W3-I3gJxM50",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/wallpapers",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://audionautix.com",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- This is Bliss hill, the site of the world famous Windows XP default wallpaper. It's regarded as being the world's most viewed photograph. And my mission, should I choose to accept it? Is to find this hill, so I can photograph it myself and present it to the world's most prestigious art critics, YouTube viewers. - Why can't you just present your photo to me. I'm one of your best friends. - Validation only works when it comes from total strangers. We've been over this. - Oh, right. - Anyway, my Pixel Peeper analysis has narrowed down the hill's location to somewhere on this planet. So we're getting close. - Ken, that's not very useful. - But that's why I'm counting on you, Old Man Ken. - Me? - Yeah. I mean, you and the original photographer, Charles, are about the same age, right? So you're probably sharing similar brainwaves. - Well, I can try, but there's one big problem. - What? - Michael MJD already beat you to it. He launched his \"Bliss\" episode today. - Son of a... Sponsored by Linode, Cloud Computing from Akamai. (upbeat music) Hey everyone, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and I just love this photograph. It's so nostalgic. And I also love Windows XP, the operating system that humbly blasted this photograph to a hundreds of millions of people's eyeballs. And to give props to my buddy, Michael, he did a great job talking about it. But because that was a while ago, it's now my turn to take a crack at it. (knuckles crackling) (screaming) In an era of video games and computer graphics everywhere, sometimes we forget that reality is still a thing. The Bliss wallpaper is a real hill in a real place, and aside from minor modifications that were made during the digitization process, this photograph has not been altered in any way. And there's a fascinating and somewhat tragic story behind the land and the photograph itself. I just need to pinpoint the coordinates, but don't worry, I got my best guy on the case. (Old Man Ken snoring) Oh, gosh, I hope he doesn't screw this up. So while Old Man Ken gets the coordinates, let's talk about some Windows XP history, because I think it's important to know about the operating system that made this photo so famous. (air whooshing) Before Windows XP, Microsoft sold two lines of Windows OS as under different names. One for consumers, and one for businesses. For several years, consumer releases had a year in the name like Windows 98, and business-focused releases followed the NT naming scheme until Windows 2000. The 9x releases were based on older DOS technologies, while the NT releases were based on the newer, more solid NT kernel, which is still updated and used today in Windows 11. And urban legend says, the NT stood for new technology but this was never clearly defined by Microsoft. (air whooshing) Microsoft wanted to unify these product lines into a single Windows platform aimed at the home and at business users, and they wanted to build it on the much more modern and robust NT kernel. And behold, Whistler was born in January, 2000. This was the code named for what would eventually become Windows XP. Now, development for this new operating system was taking a long time. It was gonna be worth it, though. But in the meantime, Microsoft released a stopgap product, I guess, you could call it. (Windows 2K/Me startup sound) Windows Millennium Edition, also known as Windows Me. The goal for Windows Me was to take features from the latest NT release, Windows 2000, and bring those features to a consumer OS product. But that OS still used the same MS-DOS and clunkier 9x core underpinnings. And this resulted in some stability issues. So this is why a consumer-oriented version of Windows that was based on the NT core was imperative to the future success of Microsoft. (air whooshing) The Windows XP name was officially unveiled during a press event on February 5th, 2001, and the XP stood for experience. XP was released to manufacturing on August 24th, 2001, and to the general public on October 25th, featuring that new Windows NT kernel, we talked about earlier, and an all new user interface. And XP launched with this amazing event, featuring Regis Philbin and Bill Gates playing \"Who Wants to Be a Millionaire?\" (suspenseful music) - Well, you know, Regis, I've always wanted to be on your show. (audience laughing) - Yeah, if anybody needs a million, it's you. But- (audience laughing) - Good times. We miss you, Regis. So instead of having two product names, like 98 and NT, Windows XP had a single product name, but two editions, Home Edition and Professional Edition. And XP went on to be a huge fricking success, selling over 400 million copies in just five years. And Microsoft supported the OS until April, 2014. (air whooshing) And this brings us to the famous hill photograph. If you look at the default wallpaper of previous Windows releases, you'll notice it's kinda plain, but Microsoft changed that in Windows XP with their first ever photographed, default wallpaper, \"Bliss.\" And it paired well with the new blue and green \"Luna\" theme. This Bliss wallpaper was originally named, Bucolic Green Hills, and it was photographed by Charles O'Rear. So who was that? (air whooshing) Charles O'Rear was born in 1941 in Missouri, and he took photos for daily newspapers before moving to California to work for the Los Angeles Times. In 1971, he started work for National Geographic, documenting various subjects for the magazine, including computer chips. And in 1978, Charles went to Napa Valley to photograph vineyards. And in this May 1979 issue of National Geographic, you can see some of his earliest vineyard photography. Coincidentally, Old Man Ken has narrowed down the hills location to Wine Country, somewhere in Sonoma County, to be somewhat more specific. So, yeah, it seems like our boy, Charles, has really grown a love for wine. Charles continued to work for Nat Geo until 1995, and that brings us to this historic moment. January, 1996. It was an ordinary afternoon, and as you know, when a story starts with the word \"Ordinary,\" it's anything, but... (air whooshing) While Charles was driving on California 12, he spotted a rare sight, a beautiful hillside, with bright green grass and a sunny blue sky. Now why was this so rare? Well, this hill was actually a vineyard. So normally, it doesn't look this untouched by man, we'll just say. (air whooshing) The sunny climate in this area of California is perfect for growing grapes for wines. Much of the land was used for vineyards, but this particular hill, at this time, was free of vines, and it looked more natural. This was due to a phylloxera infestation. Oh, delicious. I just love parasitic relationships. These insects feed on the roots and stunt the vines growth, causing galls to form on the leaves. Then they lay eggs in the gulls. About 50,000 acres of vineyards were destroyed during this infestation. (air whooshing) And that caused an estimated loss of $1.25 billion in revenue. (paper rustling) Vines had to be ripped out of the ground and burned or destroyed, in some way, to help stop the spread. (suspenseful music) Ooh! Well, that sucks, but (chuckling) at least we got this pretty picture out of it. (Ken chuckling) Anyway, Charles pulled his truck over and took four photographs with a Mamiya RZ67 medium format camera with Fuji Velvia film. Then he continued his drive. And, Charles named his new photo, (keyboard clattering) \"Bucolic Green Hills.\" Green Hill, huh? Hey, sounds like a place Sonic would love. Oh, you know what? That actually makes sense. That's why they filmed that part of the Sonic '06 cutscene on that hill. It's all coming together now. Anyway, yeah, I had to look up that word too. I've never heard of the word \"Bucolic\" before. (paper rustling) It means, \"Relating to the pleasant aspects of the countryside and country life.\" Yeah, that checks out. (air whooshing) Charles licensed the photo through Westlight, a stock photo agency he co-founded with Craig Aurness in 1980. Two years later, Corbis bought Westlight. Corbis was another stock photo agency. And this is where fate really worked in Charles' favor, because guess who owned the Corbis? Bill freaking Gates, the CEO of Microsoft at the time. The dots are connecting. Now, Microsoft doesn't want to just merely license the photo like they did with other wallpapers in the OS, they wanted to buy all the rights to it. Because of Charles' NDA, he can't disclose how much Microsoft paid him, but it's estimated to be around $100,000. Quick crash course on licensing. When you buy the license to a photograph, you're allowed to use it under certain restrictions and parameters. So for example, maybe you're allowed to use it as a social media digital ad, but you can't print it and put it on a giant billboard. But if you buy the rights to the photo, and then you can do whatever the heck you want, and that was Microsoft's goal. If you look at the marketing material for XP, you'll notice the photo wasn't just used as a wallpaper. It was used in website banners, print material, endorsed magazines, and a similar rendition of the hill was used in the commercial where people use Windows XP and start to fly everywhere. You know, I tried that and it didn't work. I can run, but I can't fly. Zero out of 10. (air whooshing) This seemingly insignificant hill, became a core component of the XP branding, and it was a huge part of the $200 million \"Yes You Can\" ad campaign. Allegedly, the original tagline was prepared to fly but... 9/11 changed that. I think, \"Yes You Can\" works out better anyway. So now, Microsoft officially had the rights to the photo and they renamed it \"Bliss.\" (Windows system chimes) But as part of the deal, they were to have the actual film in their possession. (air whooshing) The deal was worth a lot of moolah. So to receive the physical film it needed to be shipped, but no shipping service wanted to take the risk. So Microsoft bought Charles a plane ticket, so he could hand deliver the film to Microsoft personally. Then at CES 2001, Microsoft revealed the all new look and feel for Windows, still codename \"Whistler\" at the time. And they showed the soon-to-be default wallpaper \"Bliss.\" However, there may have been another contender for the default wallpaper. In some Whistler beta builds, Red Moon Desert, also photographed by Charles, is the default wallpaper on first boot. Red Moon Desert was still included in the public release of XP as a wallpaper choice, but in the end, it was not the default. Microsoft programmer, Raymond Chen, said, \"During testing, people thought the wallpaper looked like a butt.\" Yeah, okay, I guess I see it now. Fair enough. (air whooshing) Sandy butts aside, Bliss won the title of Windows XP's default wallpaper. And again, XP was really successful. So hundreds of millions of people, if not, over a billion people, saw this photo at least once on their computer screen. It's a famous hill. It may seem like an insignificant green lump that a bazillion people drive by every day, but it's historic, and I can't wait to see it for myself. Thankfully, Old Man Ken just texted me the address. I didn't even know he knew how to text. I don't know how he figured that out. So I'm gonna go take some photographs of it, and I'm gonna bring Brainiac Brent with me, because, well, he's a smart guy and he's astute, and I am non-astute. So let's get our butts to California. (guitar thrumming) That is a wall, California is this way. (air whooshing) So, Brainiac Brent and I flew into San Francisco, and coincidentally, the location worked out great because I was also working with DriveSavers to make an episode, \"Debunking fake data recovery scams on the internet,\" and their headquarters was nearby. After that, we took an Uber onto Highway 12, and I used satellite imagery to find a safe spot we could pull over, so we could walk to the hill and take our time to photograph it, without worrying about getting hit by a car. Thankfully, Brent found a dirt path on the other side of the guardrail, which was safely away from the road, and we took it on foot from there. Well, it is 80 degrees and sunny today. Perfect day to wear a black T-shirt. Smart Ken. Anyway, the UV index is eight, so it's important to put on sunscreen. Stay nice and protected from those harmful... (birds chirping) (Ken sniffing) (birds chirping) This is mayonnaise. (air whooshing) And I gotta tell you, when you look up and see those giant green, rolling hills in front of you, it takes your breath away. It's so beautiful. And the grooves of the vineyard give a very unique pattern to the hill that you don't see naturally. So we walked around for a bit, looked, and then, there it was, the famous Bliss hill. Now we come to the next challenge, recreating the photograph. And it won't be an exact recreation because, one, the land is an active vineyard now, so it looks a little bit different. And, two, I'm using a different camera, and different cameras have different looks. But that's not gonna stop me from taking a good photograph. Now I just need to find the right spot. (air whooshing) Thanks to Brainiac Brent's help. We tried using Charles' original picture and Michael MJD'S video as reference. And geologically, or topographically, not sure. We try to use these mountains in the distance as a reference point. (birds chirping) It's sometimes a bit tricky because even a little bit of a perspective difference makes the mountains look like they're gone or in a totally different place. And there's some other things going on here. There's power lines and vines in the foreground. Stuff that wasn't in the original photo that makes it kinda challenging. (air whooshing) I took a photo at a lower angle, showing the vines in the foreground, but I wanted to get up higher. Thankfully, there was just this giant wood box nearby. So I stood on top of that, and shot multiple photos, and stitched them into a panorama, so I could have an ultra wide view of this beautiful hill. I also walked to the left and photographed a slightly different portion of the hill, and I thought that would make for a good wallpaper. I also cropped my panorama and used Adobe Generative Fill to remove the power lines, but it made the grass kinda messy, so I removed them by hand. And, boom, another wallpaper you can download from me. (gentle music) Now I'm gonna present it to the most prestigious art critics in the world. So ladies, gentlemen, automatons, behold, my own take on the Windows XP Bliss wallpaper. (gentle music) (audience cheers and applauds) Thank you. (audience applauds) (iPhone ringtone) Oh, excuse me for one second. (iPhone ringtone) Oh, it's Michael MJD! Hey, what's up? - [Michael MJD] Ken, you know you photographed the wrong hill, right? - Son of a. (suspenseful music) - [Ken's Voice] No, no, this isn't right. This isn't right, the photos don't match. (suspenseful music) They don't match. (air whooshing) They don't match. (suspenseful music) I followed the instructions. (air whooshing) I followed the instructions. I did everything right. (suspenseful music) I did everything right. I did everything right! (suspenseful music) (phone ringing) - Hey, Ken, how did the photo go? - We (bleeps) up. - What? - What address did you give me? - I don't remember. I went to the Google machine, and the Maps app showed me \"Bliss Windows\" as a historical landmark. - Was the street number, 3283? - No, it was a, 420, oh... (finger taps) (mobile phone thuds) - Everyone, it's time for a valuable life lesson. Google Maps has community features, where people can submit tourist locations and edit other information, kinda like Wikipedia, which means, not everything is 100% accurate. Google knows a lot of things, but they don't know everything. Always, always fact check your information, especially if you're traveling somewhere. Because I ended up being about 0.9 miles away from where I actually wanted to be. Yeah, that's right. That hill, even though I think it looks beautiful, was not even close to the actual hill I wanted to be at. And I don't know why this incorrect information was on Google Maps in the first place. I don't know who put that there, but it should be removed. But that aside, I'm not gonna play the blame game. I will take responsibility for this big (bleeps) up that I made. And I'm sorry. (air whooshing) The funny thing is, when I posted these photos, no one said I was at the wrong hill. And I think that's just because, well, there's many similar hills in that area. So how did I notice I was at the wrong place? Well, when I looked at the photos, I saw three big clues. (air whooshing) The first one was the power lines. If we look at the actual hill, you won't see power lines. The second clue were the hills in the background. When Brainiac Brent and I were trying to line them up, we struggled to get it right. We eventually thought we got it, but, no, we were still inaccurate. And now we know why, because we were a fricking mile off course. (air whooshing) And the third clue was this pathway in the vineyard. It's visible in other modern day photos and videos, but in my photo, it's not there. So yeah, I screwed up big time, but I still think my photos turned out really great and I hope you like them too. (air whooshing) And thanks to Michael MJD, we can at least see what the hill looks like today. (gentle music) Charles humbly says, he didn't create Bliss. He just happened to be there at the right moment and documented it. Beautifully put. Charles did call Microsoft, asking if they'd like him to take a new photograph for Windows 8, but unfortunately, he did not hear back. This photo of two daisies wind up being the Windows 8 default wallpaper. But who took it? No one seems to know for sure. It's been hard to trace its origins. Regardless, I still think the photo is pretty but it's hard to beat Bliss. Thank you, Charles, for creating such a beautiful photo that everyone will love and remember forever. And thank you, Microsoft, for making it famous. Now I promise I will fix my mistake. I will visit the real Bliss Hill and take some new photos, and I'll share them with you when I can. Hmm, that means, I'm gonna have to buy more plane tickets and hotel rooms. Yeah, that adds up pretty quick, but, thankfully, awesome people like Linode sponsor me. Thank you guys. (chuckling) And if you have an application or website that you need to scale and deploy, Linode has the 24/7 support and infrastructure that you need. (air whooshing) Linode offers out-of-box apps, for game servers like TF2, CS:GO, and even Minecraft. You can run your own virtual private network with OpenVPN, build an online application with Joomla's content management system or build a video streaming site with a multitude of app choices. There's so much you can do with Linode's affordable Linux virtual machines. And to boot, they offer award-winning 24/7 technical support. Visit linode.com/computerclan, and click one of the signup buttons, and we'll give you a 60-day $100 credit just for watching this episode. And when you do that, you're also supporting the Computer Clan. So thank you very much. Catch the crazy and pass it on. (upbeat music) Hey, I didn't screw this up. I found where the Windows 11 wallpaper was taken. It was easy. The coordinates are seven-",
    "transcript_keywords": [
        "Windows",
        "hill",
        "Microsoft",
        "Bliss",
        "Charles",
        "photo",
        "Bliss hill",
        "wallpaper",
        "default wallpaper",
        "Bliss wallpaper",
        "photograph",
        "Man Ken",
        "Bucolic Green Hills",
        "Bliss Windows",
        "Ken",
        "famous Bliss hill",
        "world famous Windows",
        "photos",
        "Hills",
        "Windows Millennium Edition"
    ],
    "transcript_entity_values": [
        "Regis Philbin",
        "National Geographic",
        "August 24th, 2001",
        "XP",
        "Wine Country",
        "1995",
        "Michael MJD",
        "Two years later",
        "Bill freaking Gates",
        "Windows XP",
        "two",
        "a.",
        "Windows",
        "Green Hill",
        "Michael MJD'S",
        "Bliss Windows",
        "over 400 million",
        "around $100,000",
        "Pixel Peeper",
        "Windows OS",
        "October 25th",
        "four",
        "one",
        "Windows NT",
        "San Francisco",
        "February 5th, 2001",
        "just five years",
        "an ordinary afternoon",
        "Whistler",
        "Michael MJD]",
        "hundreds of millions",
        "a year",
        "Mamiya",
        "Corbis",
        "Home Edition",
        "Nat Geo",
        "Bliss",
        "Westlight",
        "06",
        "Linux",
        "bazillion",
        "100",
        "$1.25 billion",
        "Brent",
        "60-day",
        "a million",
        "Sonic",
        "Windows 98",
        "100%",
        "Google",
        "Akamai",
        "Napa Valley",
        "Maps",
        "Joomla",
        "first",
        "Charles O'Rear",
        "Microsoft",
        "Missouri",
        "Linode",
        "Professional Edition",
        "420",
        "Bliss Hill",
        "three",
        "January, 2000",
        "Ken",
        "Windows 11",
        "Red Moon Desert",
        "eight",
        "every day",
        "DriveSavers",
        "Windows 11",
        "Windows XP",
        "Fuji Velvia",
        "24/7",
        "Bucolic Green Hills",
        "Sonic",
        "9x",
        "Smart Ken",
        "Cloud Computing",
        "TF2",
        "Zero",
        "today",
        "YouTube",
        "Krazy Ken",
        "January, 1996",
        "About 50,000 acres",
        "Who Wants to Be a Millionaire",
        "Windows",
        "Wikipedia",
        "10",
        "3283",
        "Raymond Chen",
        "Windows 2000",
        "Bill Gates",
        "Charles",
        "Brainiac Brent",
        "Adobe Generative Fill",
        "Minecraft",
        "the Computer Clan",
        "Michael",
        "about 0.9 miles",
        "several years",
        "$200 million",
        "1978",
        "third",
        "a fricking mile",
        "April, 2014",
        "Westlight",
        "Windows Me",
        "daily",
        "Bucolic Green Hills",
        "one second",
        "1980",
        "Windows 8",
        "Sonoma County",
        "NT",
        "May 1979",
        "California",
        "the Los Angeles Times",
        "Bliss hill",
        "Regis",
        "NDA",
        "1971",
        "2001",
        "One",
        "Ordinary",
        "second",
        "Google Maps",
        "1941",
        "80 degrees",
        "Bliss",
        "Craig Aurness"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "DATE",
        "PERSON",
        "DATE",
        "PERSON",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "WORK_OF_ART",
        "GPE",
        "PERSON",
        "WORK_OF_ART",
        "CARDINAL",
        "MONEY",
        "LOC",
        "PRODUCT",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "GPE",
        "DATE",
        "DATE",
        "TIME",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "MONEY",
        "PERSON",
        "DATE",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "EVENT",
        "LOC",
        "CARDINAL",
        "DATE",
        "ORG",
        "LAW",
        "ORG",
        "ORG",
        "CARDINAL",
        "WORK_OF_ART",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "PRODUCT",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "DATE",
        "MONEY",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "DATE",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "TIME",
        "DATE",
        "LAW",
        "GPE",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "WORK_OF_ART",
        "ORDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG"
    ]
}