{
    "id": "ImO-vBmL4gk",
    "title": "The Best Tech Essentials for Students!",
    "channel": "Dave2D",
    "channel_id": "UCVYamHliCI9rw1tHR1xbkfw",
    "subscriber_count": 3660000,
    "upload_date": "2017-07-27T18:43:47Z",
    "video_url": "https://www.youtube.com/watch?v=ImO-vBmL4gk",
    "category": "Science & Technology",
    "tags": [
        "Dave2D",
        "Back to School",
        "Top tech",
        "technology",
        "guide",
        "back school",
        "back to school tech",
        "gadgets",
        "samsung",
        "galaxy",
        "Phone",
        "school",
        "student",
        "student tech",
        "college",
        "college tech",
        "dorm",
        "review",
        "smartphone",
        "iphone",
        "school supplies",
        "android"
    ],
    "views": 2338295,
    "likes": 52143,
    "comments_count": 1250,
    "description": "Awesome tech accessories for college and students. Cable of Dreams -  Awesome USB Drive -  Anker Battery -    IPhone Battery -  Micro USB -   WD Backup -  Seagate Backup -    Music Credits: Background: Fili - The Break  If you want to support the channel, consider a Dave2D membership by clicking the Join button above!      Purchases made from store links may give me some money.  (It doesnt cost you extra, so please buy everything)",
    "description_links": [
        "http://amzn.to/2eRsw85",
        "http://amzn.to/2w3VNjn",
        "http://amzn.to/2v1dq6u",
        "http://amzn.to/2h6JT5r",
        "http://amzn.to/2uC3vDi",
        "http://amzn.to/2uCktkS",
        "http://amzn.to/2tNtZmG",
        "http://twitter.com/Dave2D",
        "http://www.instagram.com/Dave2D",
        "https://discord.gg/Dave2D"
    ],
    "transcript": "Hey, how's it going Dave 2D here. So this is a video on some tech accessories that I think are super useful for students, and this is not going to be a video where you're going to see stuff like TVs and speakers, because as fun as those are, I seriously don't think that those are just really all that useful for students. What you will see are things that I actually think are, well, I'm not a student anymore, but I feel like if I had these when I was a student these would be awesome. Okay, first up are some cables. They're not just any cable, these are every cable in one cable. So, these are made by a company called Chafon, and it's essentially every single charging cable connected into one USB-A cable. So we have mini USB, micro USB, USB C and on the big one it actually comes with two lightning cables. So, with this device you can basically charge any phone as long as those made in the last like 10 or 15 years. I think this is incredibly useful. So the thing that makes this thing cool is how simple it is and you can keep it in your bag, your car, wherever you want, they're very inexpensive. I think they're like eight or nine dollars. Yeah, great, purchase. Very useful in my opinion. Second on the list are some battery packs. So my go-to battery pack is Anker, I feel like they make some of the best quality battery packs on the market. They're inexpensive and they don't have like stupid features, like lights and like flashlights and RGB stuff going on. Very simple but very reliable batteries that I've owned from even before I started doing YouTube stuff. They come in various colors and various sizes and some of the bigger ones from Anker can recharge some laptops. Now if you're in the market for a battery pack and you want something that's a little bit more streamlined, there are a couple devices out there that have like built-in prongs, so you can just plug them right up into the wall to charge. And they have built-in cables to make it that much easier. Now sadly, I've never found one of these all-in-one battery packs for USB-C. But they do have them for micro USB and Lightning. I'll link both of them below. Alright, the last thing I want to talk about is storage, and I really think this device is something that every student in 2017 should have. This is a device, it's just a flash storage, right? Very unassuming, but it has both USB-C and USB-A on one device. So you can just flip it around and plug it into whatever port you want. If you format this thing with exFAT, you can connect it to any computer: Mac OS, Windows, Linux. Whatever you want. You're basically unstoppable. But the thing that makes this thing so useful is like if you ever want to transfer a file or if you need to transfer someone's file over to your computer... whatever... like.. this thing... and it goes onto your keychain, right? It's so small. It's so insignificant Get this thing this will save your butt so many times in school like just do it. Okay, If you want something a little more substantial we have Seagate and Western Digital drives. These are obviously a lot bigger. These are one terabyte at a minimum. I think they start at like 50 bucks, they're relatively inexpensive- And you can use these things as backup to store your work, your games, your videos. Whatever you want. Now, I've always used Seagate drives in the past, but I've actually tried these recently and these Western Digital ones. And I find them actually slightly better. They're equivalent in price, but the thing that makes you kind of cool, I mean they come in different colors, so that's kind of a bonus, but they have these rubber feet on the bottom. The seagate drives don't, so when you place them down on a table, the Western Digital ones just, I don't know, they stick around a little better, and that alone makes me prefer them more, but you can't go wrong with either of them. Okay. That's basically it. Three pretty important pieces of technology I think every student should have.",
    "transcript_keywords": [
        "thing",
        "Western Digital",
        "Dave",
        "USB",
        "cable",
        "battery",
        "student",
        "battery packs",
        "makes",
        "micro USB",
        "Western",
        "Digital",
        "cables",
        "device",
        "Seagate",
        "packs",
        "inexpensive",
        "Western Digital drives",
        "stuff",
        "USBA cable"
    ],
    "transcript_entity_values": [
        "USB-C.",
        "Anker",
        "seagate",
        "one terabyte",
        "Dave",
        "micro USB",
        "Windows",
        "USB",
        "one",
        "Second",
        "Three",
        "USB C",
        "Anker",
        "RGB",
        "Seagate",
        "two",
        "first",
        "2017",
        "Chafon",
        "10 or 15 years",
        "Linux",
        "Mac OS",
        "Western Digital",
        "USB-C",
        "YouTube"
    ],
    "transcript_entity_types": [
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "QUANTITY",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "DATE",
        "PRODUCT",
        "DATE",
        "GPE",
        "ORG",
        "ORG",
        "ORG",
        "PERSON"
    ]
}