{
    "id": "iNxh6CfM-Hg",
    "title": "The UVLEN Scam is FINALLY DEBUNKED! - Krazy Ken's Tech Talk",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2021-10-21T16:00:11Z",
    "video_url": "https://www.youtube.com/watch?v=iNxh6CfM-Hg",
    "category": "Science & Technology",
    "tags": [
        "The UVLEN Scam is FINALLY DEBUNKED! - Krazy Ken's Tech Talk",
        "UVLEN",
        "UV Light",
        "UVC",
        "Far-UVC",
        "iPhone",
        "Android",
        "Smartphone",
        "Hand Sanitizer",
        "Tech Scam",
        "Scam",
        "UVLEN Scam",
        "Ultraviolet Light",
        "Electromagnetic Spectrum",
        "Science",
        "Krazy Ken's Tech Talk",
        "Krazy Ken",
        "Tech",
        "Computer Clan",
        "Debunking",
        "Debunked",
        "Apple",
        "Google",
        "NeXT",
        "Macintosh",
        "CRT",
        "Fake",
        "Fraud"
    ],
    "views": 258214,
    "likes": 11518,
    "comments_count": 530,
    "description": "You can support this channel on Patreon! Link below 9 months later, the UVLEN tech scam can FINALLY be debunked! With science! Watch part 1 of this saga!    Download our epic wallpapers   Watch more tech scam-busting episodes    Support our channel and get cool stuff   Follow us on Twitter   Like us on Facebook   Subscribe and listen to our podcast     Patrons got to see this episode early! They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://youtu.be/DcaDKF1wb5I",
        "https://thecomputerclan.com/wallpapers",
        "https://www.youtube.com/playlist?list=PLFWeyvvxf1riKzQK3dHt6c9_6D2lVwr78",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://applekeynotechronicles.transistor.fm",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Don't you just love it when you order something online and nine months later, it still doesn't show up. Yeah. Sounds like a scam. (upbeat intro music) Hey guys, how are you all doing? If you're new here. Welcome. My name is Krazy Ken. And today we're hosting the grand finale in this crazy three-parter UVLEN scam-buster. Now, if you haven't seen the beginning of this crazy quest, I recommend you check that out first but in summary, here's what UVLEN claims to be. UVLEN claims to be a portable digital hand sanitizer, which converts a phone's flashlight into UVC light. This is possible thanks to the patented Ultraviolet Germicidal Irradiation coat plus Diffraction Grating and dichroic mirror filter. Yeah. Okay. In my past episodes, I made some educated guesses as to why this is fake because there's no way a thin cheap material could practically increase the frequency of full spectrum light into far-UVC light. So, all of that is great, but the problem is I want to test the product for real, not just make educated guesses. But the product still isn't here. It's been nine months and it still hasn't showed up. And I've even contacted the company. They replied to me saying, \"Oh, there's gonna be a tracking number soon.\" Yeah. That never happened. But friends, I gotta say, the Computer Clan community. You guys, you're the best tech community out there 'cause you're always there to help me out. One of my awesome viewers from South Korea somehow got his hands on an official, genuine UVLEN product. And he shipped it to my layer. So now, let's take a look at the packaging, examine the claims that are on it. And then we'll take a look at the product itself. The packaging claims UVLEN is antibacterial tested 99%. Grammatically, I don't know if that means it reduces bacteria by 99%, or if the test is only 99% complete, but moving on. The packaging reiterates some of the features of the product and says there's a free mobile app. On the back, you can scan the QR code to download this app, but weirdly enough, (tech beeping) it just brings you to the UVLEN homepage. You can navigate to the download button manually, and then choose Google play or Apple App Store. However, the app store button does not bring you to the UVLEN app. It brings you to a generic strobe light application, which looks nothing like the advertisements. The Google play button also doesn't work correctly. Instead of bringing you to the play store, it brings you to a one drive link where you can download the APK file, and load it manually on your phone. The packaging also lists these health warnings to try to make it seem more legitimate, I guess (laughing) But if my hypothesis is correct, these warnings won't mean anything because there's no UVC light being emitted from the product. So now, let's take a look at the product itself, and then afterwards we'll put it to the test. The UVLEN itself feels really cheap, but for $15, you really can't expect much, I think. The claimed bio-sheet feels extremely flimsy, and it's likely just a thin piece of plastic. None of this sci-fi jargon BS they were trying to spew earlier. The product adheres to the back of your phone. And it can slide out over your phone's flashlight. I'll admit the adhesive worked a little bit better than I thought it would, but after a few tests of putting it into my pocket, it already popped off. So now, the big question, can it actually emit UVC light and disinfect surfaces? Well, I appreciate your guys' patience, but now the wait is over, we're gonna test it out. My first test was with Petri dishes. I swabbed an iPad in the screen corner, and on the power button. And then I swabbed the Petri dish. Then I shined the UVLEN product for a solid 10 seconds, not with the strobing feature on the iPad surfaces. And then repeated the swabbing. Then I let the Petri dishes sit for four days, but I noticed the UV dish was actually growing more bacteria than the control. I knew that couldn't be accurate. So, I assumed my swabbing was just a little inconsistent and sloppy. So, I decided to restart the experiment and try again. This time I tried using a dirty dollar bill. As I was swabbing, I was counting how many motions I was doing in my head. And then I did the same thing with the Petri dish, hoping for better results. Then I shined the UVLEN on the dollar bill for a solid 10 seconds, and then repeated that consistent swabbing. Then I let the Petri dish sit for six days, and I still had the same problem. The UV variable Petri dish was growing more bacteria than the control. Maybe I'm just not a real scientist. (sad music) Okay. So it's time to rethink this. Honestly, I just wanted to use the Petri dishes 'cause I thought it would be fun, but clearly I suck at using these things. So, there's a simpler approach to this. I just have to use UV-reactive surfaces. When you shine a UV light at a monochrome CRT, for example, you'll notice a glow because the CRT is reacting to the UV light. But when I shine the UV Len at the CRT, I do not get a reaction, indicating there's no UV light emitting from the UVLEN. I also used a UV light testing card, which is specifically made for UVC light. Which is a higher frequency of UV light, and that's the type of light UVLEN claims to emit. But before we use the testing card with the UVLEN, we need to test it with a true UVC light just to make sure it's working properly. So behold, my patented Krazy Ken UVC Light Testing Station. (pats box) Yeah, it's just a prototype, but it'll work. For the control, I placed the testing card under a real UVC tube, and immediately the green circle glowed, indicating the light from the tubes was in fact UVC, and the card was working properly. Then I shined the UVLEN at the card and sure enough, no dot was present. No dot was present on the UV A/B test card either, completely debunking UVLEN's claims. And another observation I made was the color of the UVC light on camera. I noticed to the naked eye, the UVC light looks more white, but on camera it looks cyan. But the UVLEN light looks nothing like the UVC tube's light, to the naked eye and on camera. I don't have the scientific facts as to why that color change happens between the naked eye and the camera, but that's just an observation I made. So, now I can officially say this product is bull (bleep), and it's a huge shame that they still try to sell this thing on their website. And all they're doing is ripping off consumers. By the way, if you see any other scam tech products online and you think they would be good for this show, feel free to DM them to me on Twitter and stay tuned because I have some other great scam-bustings coming up. Including the part two of the PROPODS investigation. It's gonna be fun. Now, all I can say is thanks for your patience, and thanks for sticking with me through these nine months, as I tried to dig into this investigation some more. And hey, if you want to help me buy some more crappy scam products, feel free to pledge to my Patreon, and I'll give you some cool perks in return. Thanks in advance for your support. And feel free to subscribe for more tech episodes coming out all the time. I love doing episodes about rare and retro tech, new tech, and of course scam tech. And hey, if you like this episode, you know what to do. (upbeat techno music) Thanks, and I'll see you next time. Catch the crazy and pass it on. (upbeat techno music) (echo and clicking sound)",
    "transcript_keywords": [
        "UVC light",
        "UVLEN",
        "light",
        "UVC",
        "UVLEN claims",
        "light UVLEN claims",
        "UVLEN product",
        "product",
        "Petri",
        "Ken UVC Light",
        "Petri dish",
        "UVC Light Testing",
        "light UVLEN",
        "UVLEN light",
        "test",
        "Krazy Ken UVC",
        "UVC tube light",
        "packaging claims UVLEN",
        "Petri dishes",
        "shined the UVLEN"
    ],
    "transcript_entity_values": [
        "nine months",
        "four days",
        "Diffraction Grating",
        "Krazy Ken UVC Light Testing Station",
        "99%",
        "PROPODS",
        "these nine months",
        "two",
        "15",
        "bull",
        "nine months later",
        "only 99%",
        "iPad",
        "Patreon",
        "today",
        "10 seconds",
        "Krazy Ken",
        "Apple App Store",
        "Google",
        "first",
        "one",
        "UVLEN",
        "One",
        "CRT",
        "Twitter",
        "UVC",
        "South Korea",
        "Petri",
        "Computer Clan",
        "three",
        "six days"
    ],
    "transcript_entity_types": [
        "DATE",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PERCENT",
        "ORG",
        "DATE",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "PERCENT",
        "ORG",
        "ORG",
        "DATE",
        "TIME",
        "PERSON",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "NORP",
        "ORG",
        "CARDINAL",
        "DATE"
    ]
}