{
    "id": "IO2fY_XIXxI",
    "title": "Keyboard Phones In 2020: The QWERTY Compromise",
    "channel": "MrMobile [Michael Fisher]",
    "channel_id": "UCSOpcUkE-is7u7c4AkLgqTw",
    "subscriber_count": 1250000,
    "upload_date": "2020-05-07T14:00:15Z",
    "video_url": "https://www.youtube.com/watch?v=IO2fY_XIXxI",
    "category": "Science & Technology",
    "tags": [
        "unihertz titan review",
        "blackberry key2 review",
        "cosmo communicator review",
        "fxtec pro1 review",
        "qwerty phones review",
        "keyboard phones 2020 review",
        "best keyboard phones 2020"
    ],
    "views": 1770506,
    "likes": 35588,
    "comments_count": 3588,
    "description": "Keyboard phones. Over the past two decades theyve gone from new necessity, to laughable leftover  and all the way back around to nostalgic novelty. Hard as it may be to believe, in the year 2020, you can still buy keyboard phones  and in this roundup Im taking a look at all four that Ive been able to find. Join me for an extended hands-on with the Unihertz Titan, F(x)tec Pro1, Cosmo Communicator  and a loving send-off to the BlackBerry KEY2!   [SUBSCRIBE TO MRMOBILE]     [ABOUT MRMOBILE'S KEYBOARD PHONES 2020 ROUNDUP]  MrMobile's Keyboard Phones 2020 Roundup was produced following 2+ months with a BlackBerry KEY2 review sample, Unihertz Titan review sample, Fxtec Pro1 review sample and Cosmo Communicator review sample. The devices were provided by their respective manufacturers for review/evaluation. No company paid a fee or otherwise offered compensation in exchange for this coverage.   [PRODUCTS IN THIS VIDEO]  BlackBerry KEY2:   Unihertz Titan:   F(x)tec Pro1:   Cosmo Communicator:    [SOCIALIZE]        [DISCLOSURES]  This post may contain affiliate links, which afford MrMobile / Future plc a commission if you make a purchase. See our affiliate link policy for more details:   Additional information concerning MrMobiles ethics policy can be found here:   #blackberry #key2 #blackberrykey2 #unihertztitan #unihertz #cosmocommunicator #planetcomputers #fxtecpro1 #pro1 #fxtec",
    "description_links": [
        "https://www.youtube.com/channel/UCSOp...",
        "http://mrmobile.tech/1QX",
        "http://mrmobile.tech/1QU",
        "http://mrmobile.tech/1QY",
        "http://mrmobile.tech/1QZ",
        "http://facebook.com/themrmobile",
        "http://instagram.com/themrmobile",
        "http://twitter.com/themrmobile",
        "http://mrmobile.tech",
        "https://www.mobilenations.com/external-links",
        "https://mrmobile.tech/ethics"
    ],
    "transcript": "- [Michael] Phones with physical keyboards. Over the past two decades they've gone from new necessity to laughable leftover. And now all the way back around, a nostalgic novelty. Hard as it may be to believe, in year 2020 you can still buy phones with physical keyboards. And in this round up, I'm taking a look at all four that I've been able to find. (upbeat tech music) Folks, we're barely 30 seconds in and I guarantee you someone is already down in the comments saying, keyboards have no place on a phone today. Well, I've spent the last three years arguing otherwise, thanks to devices like this one. Yep, It's a Blackberry. It's called the Key2 and yes, it was until very recently a fully fledged, modern Android smartphone. One that I carried as my daily driver for nearly a year. That's a long time for a phone reviewer. Sadly, I had to give it up because this funky aspect ratio was playing havoc with apps I needed and also, the spacebar started failing. Pretty common failure on this model. Returning to the Key2 to shoot this video, I'm just so conflicted. I mean this was the keyboard phone to get when it debuted in the summer of 2018 and it's still the best mobile keyboard for me. The best keyboard on any phone today. Taking notes and sending emails on this thing was always more satisfying and often more accurate than a touch screen and I miss it a lot. But you should not buy it. Apart from being two years old, running two versions of Android behind and packing the camera that was never great, the Key2 is a device without a future. While Blackberry continues to exist as a software and services company, its hardware licensee, Blackberry mobile announced back in February that it would close up shop come summer. And while they promise to support existing models through 2022, it's just not a good enough reason to buy one today. With no potential savior or spin-off in sight, I'm afraid the time has come again to close the door on the brand that introduced me to smartphones back in 2004 with this Blackberry 7520. No, I'm not going to cover it in this video, but let me know if you'd like to see a throwback on this in the comments and either way, please subscribe while you're there. Speaking of Blackberries, this isn't one, but it sure wants to be. From the same company that brought you one of the world's smallest smartphones, here's one of the biggest. Complete with a keyboard that's been ripped right off the Blackberry Passport. Now the Unihertz Titan may look the part, but it turns out the danger in xeroxing another company's concept is that if you're not careful, you bring over its failures as well. That's what happened here with no number row at all and a space bar that splits the lower row. Ergonomic complaints all of us reviewers made about the passport back in 2014. That's exacerbated by the so-called tool belt, which has four big physical keys for what should be system functions, about the home button in the middle of it, just a touch pad. There's no travel at all. So you get this annoying disconnect. Hopping between physical and virtual buttons. Physical and virtual feedback too and bizarrely the shift and ALT buttons are way up here, instead of where they are in every other keyboard. There are just a lot of these strange design decisions that make this a real chore to use and because it's a physical keyboard, they can't all be fixed in software. Speaking of, like literally every other phone in this video, the Titan runs an outdated version of Android. Now, the company does promised Android 10, but what's more staggering is the current security patch. October 2019... Big yikes. Now, I want to recognize the Unihertz did some things well. I mean, this is the only keyboard phone I've ever used with a rugged design that includes IP67, dust and water resistance. Plus it's the only found in the video with wireless charging and certainly the only one with a six thousand milliamp hour battery, man, that's huge. And if you want to overlook one more blatant piece of plagiarism, you can use the Titans keyboard, like a capacitive trackpad. Just like you could do on the BlackBerry because intellectual property, what's that? Now, Unihertz hardware prowess alone makes me hope they build a second version of this thing, but for 340 bucks, the least you should expect is a security patch that isn't seven months out of date and a keyboard that doesn't make you rewrite your muscle memory to use it. Now, we're going to end on another 90s call back. But first, let's cover the one that I think most of you should buy if you really need a keyboard. At first glance, the F(x)TEC Pro1 looks like a fairly typical Android smartphone until you apply a little bit of pressure. Yeah, you might remember this one. It was one of the darlings of mobile world congress 2019. That big beautiful display with edges curved enough to catch the eye, but not so curved that it's annoying to use. A thoughtful design that keeps it balanced in the hand and propped up on a desktop. Smooth, mostly fast software. And again, a physical keyboard that lets it do things the other phones just can't. The keys themselves are pleasantly clicky and well isolated from each other. The branding and fonts used on the key caps are also pleasant. Nothing about this thing feels cheap. Also, when it's closed, the Pro1 retains that tall display that most Android apps expect, so you don't get as many layout or compatibility problems as you would with a Key2 or a Titan. And you have much more display area. For portrait use, a virtual keyboard takes over, just like any Android phone. That's Android 9 for now, by the way. With Android 10 promised and if you want another OS you can put it on there, due to the unlocked Bootloader. For a first smartphone, small team at F(x)tec made a darn good one. Trouble is, even when it debuted, the Pro1 asking price was a lot for a phone from an as-yet unproven company. With a commensurately low probability of long-term support and running silicon from a few years ago. And in the years since we've seen incredible value spring up in the form of the Google Pixel 3A and iPhone SE, each which is about half the price of this thing with newer software and better cameras. All that together makes it tough to justify the 699 asking price. To finish is off, a question. What if you don't really want a phone, so much as you want a pocket laptop? This is the Cosmo Communicator. And if you were around for the dawn of the personal digital assistant in the late 90s, you might recognize it as a modern version of the Scion PDA, which was resurrected a couple years ago in the form of the Planet Gemini, but that device was hindered. By the lack of a keyboard backlight and the absence of an external display. Well the Cosmo Communicator fixes both those problems and I gotta say, in really clever ways. Despite the addition of a lighting layer, the keys are still surprisingly bouncy and tactile. As for the outer display, well, it's tiny. Makes the Galaxy fold external screen look like a tennis court. But Planet had to overcome so much to even make it work. These guys had to build a whole real-time OS from scratch and give it a tone dedicated processor. It's like they built a basic Smartwatch and wired it into the phone casing. It may not be the prettiest thing in the world, but it gives you the shortcuts you need until you break it trying to update it. Oh, never mind, I fixed it. Yep, just small volume, niche products like this, you're going to have wonkiness. My review device is a very early one, so maybe they've solved some of these problems, but others are foundational. Android does not like being forced into landscape. So you get these UI overlap issues on the notification shade and even Google's own apps aren't always usable on a screen like this. Unlike on the F(x)Tec Pro1, forcing portrait on the Cosmo... You can if you need to, but you know. Toss in the lack of an oleophobic coating on the display and a bunch of other just weird little bugs and really, at over 800 bucks, this is only suited to people who want to fully embrace the past with the 90s era Scion apps that go with the 90s era Scion keyboard. Or load another OS on here go to hacker town. If what you're looking for is something... About 20 years more current, the company is cooking up another phone, the Astro Slide, which makes the same keyboard to a more modern slider mechanism. Running Android 10 and hopefully with that one, they'll be able to focus on the hardware and leave the software tinkering in the past. Folks, if you're using a mobile keyboard, whether it's a phone from the past or a phone I forgot to mention or an accessory you love, let me know in the comments. I really want to hear about it. This video was produced using review devices from each manufacturer mentioned, but no company paid a fee for its inclusion in this video and none was given an early preview or copy approval rights. What that means is they're seeing it for the first time right alongside you. A links to all these devices in the description, if you do want to buy any of them. Please subscribe, if you'd like to see more videos like this on YouTube and stay tuned for a new series, focusing on some of the most fun mobile phones ever to grace the planet that's coming very soon. Until next time, thanks for watching. Stay safe at home for now and in spirit at least, staying mobile, my friends.",
    "transcript_keywords": [
        "keyboard",
        "Android",
        "phone",
        "keyboard phone",
        "Blackberry",
        "physical",
        "physical keyboards",
        "Android smartphone",
        "company",
        "Android phone",
        "years",
        "Phones",
        "video",
        "mobile keyboard",
        "display",
        "mobile",
        "keyboards",
        "thing",
        "phone today",
        "back"
    ],
    "transcript_entity_values": [
        "699",
        "Key2",
        "the Unihertz Titan",
        "six thousand milliamp hour",
        "90s",
        "the Astro Slide",
        "BlackBerry",
        "2022",
        "Android 10",
        "year 2020",
        "IP67",
        "About 20 years",
        "summer",
        "the late 90s",
        "October 2019",
        "Blackberry mobile",
        "nearly a year",
        "this Blackberry 7520",
        "Cosmo",
        "the years",
        "YouTube",
        "seven months",
        "four",
        "10",
        "the summer of 2018",
        "over 800 bucks",
        "today",
        "daily",
        "a couple years ago",
        "first",
        "2004",
        "Google",
        "2014",
        "two",
        "Pro1",
        "a few years ago",
        "Galaxy",
        "UI",
        "the last three years",
        "Running Android",
        "340 bucks",
        "the Planet Gemini",
        "another 90s",
        "3A",
        "Unihertz",
        "the Blackberry Passport",
        "second",
        "2019",
        "Smartwatch",
        "Blackberry",
        "about half",
        "barely 30 seconds",
        "iPhone SE",
        "two years old",
        "February",
        "Titan",
        "one",
        "Android",
        "Titans",
        "the past two decades"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "GPE",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "EVENT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "MONEY",
        "DATE",
        "DATE",
        "DATE",
        "ORDINAL",
        "DATE",
        "ORG",
        "DATE",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "MONEY",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "EVENT",
        "ORDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "TIME",
        "ORG",
        "DATE",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "NORP",
        "DATE"
    ]
}