{
    "id": "ioEISgR5TZ0",
    "title": "Is it truly GODLIKE? - MSI Z690 Motherboards",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-03-02T19:32:49Z",
    "video_url": "https://www.youtube.com/watch?v=ioEISgR5TZ0",
    "category": "Science & Technology",
    "tags": [
        "MSI",
        "Motherboard",
        "Z690",
        "Intel",
        "Godlike",
        "Expensive",
        "Ethusiats",
        "Gaming",
        "Performance",
        "RGB",
        "Why would anyone buy this?",
        "Is this just for show?",
        "Who needs this?",
        "$2100 for a MOTHERBOARD?",
        "12-th Gen",
        "Game",
        "Screen",
        "Touch screen"
    ],
    "views": 1020087,
    "likes": 35858,
    "comments_count": 1570,
    "description": "Thanks to MSI for sponsoring this video! Purchase an MSI Motherboard from Amazon at:   This motherboard costs over $2000. Why does it cost that much? Is it genuinely GODLIKE? Anthony takes a look at MSI's most expensive consumer motherboard for the Z690 line, but you might want to take a look at something else.  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:",
    "description_links": [
        "https://geni.us/s3QsHs",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- What does a $2,000 motherboard look like? Is it a data center motherboard with multiple sockets, a million PCI express lanes? Or is it some kind of exotic, super amazing one off or anything like that? - [Jono] Gold! Ooh, yeah, have some, like, precious gems in there. - [Jono] Oh, yeah. - Yeah, like audio quest cables. (mumbling) Anyway. (Jono laughs) Okay, they don't have gems in them, but they've got like... \"So (stuttering) we're fully silver.\" and it's like, \"Okay, cool. But it doesn't justify the price.\" Anyway, another thing that may not justify the price, (Anthony grunts) The MSI Z690 GODLIKE! And this is probably the biggest box. Like, you could fit a 17 inch or maybe even like a 20 inch laptop in here. This is honestly pretty ridiculous, and there's not a whole lot on the box either. Like, it's just the front side is pretty much the most that's on here. The side just says \"GODLIKE!\" And the other side we just got, oh, we got some specs. I don't need to, like, squint or lean in or anything like that, the font is just big enough. It supports 12th gen core processors, yep. LGA 1,700, two PCI express 5.0x16 slots, one PCI express 4.0x16 slot, two Thunderbolt 4 type C ports input from mini DisplayPort. So, you can actually get display out on these. Six set of six gigabit per second ports. For a motherboard that says \"GODLIKE,\" I expect 69, if you wanna be nice about it. It's also got an Aquantia 10 gigabit NIC, built in. That is pretty spicy. And you've also got Wi-Fi 6E, Bluetooth 5.2, and 8-channel audio with Audio Boost 5 HD. I'm not sure what that's all about. Oh yeah, and this thing comes with memory and liquid cooling in the box. Yes. - [Coltono] Anthony, I've got one question. - What's your question? - [Coltono] Is it \"GODLIKE?\" - We're gonna find out. Let's see if I can open this without hitting the microphone. Oh, oh, it just cleared it. (Anthony chuckles) This is so unwieldy. So, this is just there to hold the motherboard in. Oh, so this isn't the... I thought this was, like, just an outer box with other boxes inside, but no, this is all just packed in here. That's interesting. Okay, so let's just pointedly avoid the motherboard for now. What do they give you in here? What is this? Is this a key chain? It's really long. Yeah, it looks almost like something that you'd hang from your mirror. \"Oh yeah, dog tag. Dude. Yeah it's, like, from my time in the dragon army.\" (laughter) All right, so here's the memory. Kingston FURY Beast DDR5, MSI MEG Z690 GODLIKE, are ready to reveal a new dimension of performance. Sure. Wonder what this is for? Probably for the motherboard itself. And there's a good reason for it, you'll wanna use it. All right, so what is... I don't know what I'm looking at. (yelling) (laughter) Oh no, this is a sponsored video. They're never gonna sponsor us again. I'm just, I will destroy you. All right, let's get the motherboard outta here and then completely ignore it for now. We're looking at the accessories. Pretty standard MSI shark fin Wi-Fi antenna. It's got a pretty thick cable. Looks pretty, it seems pretty nice. I have no idea what's going on with these. What are, what is all of this? What is this? Does this come with its own test bench? Is that what that is? Ah, let's see. \"Join the MSI reward program.\" Oh, that's pretty neat. Yeah, these are little stickers to, you know, kinda label your wires. That's actually a good idea. We should do that for lttstore.com. \"This product was created with great passion and we hope you could enjoy it.\" But you couldn't. Because there's only, like, a hundred of these, so. Huh, What? This is what they call the DIY stand set. It's an easy way to build a test bench. Holy crap. I'm gonna have to do this, aren't I? These aren't mentioned in that though. What are these? Man. Motherboard accessories. They're in the, oh, they're in a nice little bag. That keeps them nice and organized. Ah, this is the cooler. I think. So, we got bracket and screws. The water block pad. The radiator. It's, yeah, that is sizable. So much stuff. Radiator fans. Okay, so you got the three fans in here. These are heavy. Silent Gale. And, of course, we've got some nice stickers. Oh man, there's just so much stuff. It's exploding everywhere. All right, let's close it up. Let's get it out of there. This thing is chonky. 6.832 pounds. Oh, it smells. (Anthony sniffs package) We should make a cologne that basically just smells like electronic, like new electronics. - Don't need to worry about ESD on this guy, except around here, I guess. Everything from here over to here looks relatively normal. The VRM cooler is very beefy, with this kind of wavy pattern on the back. I don't know if you can kinda, you can see? Yeah, you can kind of see it there. It's weird, but I like it. It's visually pleasing. That's how it's so heavy, it's just covered in metal. Then we've got a rather sizable assortment of ports on the side here. Where do I begin? There's a 10 gig ethernet port here, it's powered by an Aquantia chip set. Mini display port in, for your Thunderbolt. Plenty of USB three. It's a 2.5 gig ethernet. Of course, we've got the whole 7.1 channel audio thing going. It's weird that motherboards still have toslink, isn't it? It's got a party trick. This thing comes off. This is a little touch screen. It does come with a little cable that you can plug in over here. Right here, yeah. This one that says, like, what is it, M vision. Which, I'm not sure why they call it M vision. So, it just kinda slots in like that. You can use it inside the computer, if that's your jam, or on your test bench. Personally, I don't think the motherboard looks all that good with it missing. But, it does say a little thing down there, \"One board to rule them all.\" GODLIKE! That is an RGB connector for Corsair. You can use standard addressable RGB with MSI's mystic light, or you can just straight up use Corsair's. You don't need to have their fancy commander. It's great. There's a lot of stuff that's covered with these peels. Should I? - [Jono] But we only peel when we power on, though. - True. There are three PCI express slots in this motherboard, situated such that you could SLI triple slot cards. So like, RTX 3090s, if you so chose. This bottom slot, I am, I only see solder balls underneath the socket for, I think, eight X. But that's still a lot more than you might expect out of this, considering how many M.2 slots we have here. There's so much tall stuff on this motherboard that it's actually kind of difficult for me to see in this light. Okay. So yeah, there's a M.2 slot there. So, here's another 110 millimeter, underneath this here 80 millimeter. It's all using bandwidth from the chip set. They have, I think, a switch chip on here that makes it so that it's possible for this stuff to be split up the way it is. These are opposing, there. It's a, frankly, ridiculous amount of M.2 expansion. This is basically the no compromise. Like, I mean, there's so much power delivery. Just look at that. Usually when you have a lot of features in a motherboard like this, there's always a compromise. In this case, you're giving up in your wallet. And I mean, obviously, you're not gonna buy it, and maybe it is stupid, but I want it. And it's together. These stands are not as stable as I would like. Apparently they are more stable if you have a fan there but there are still six of them, and there's only four holes in a fan, so. Let's get to peeling. Oh yeah. (laughter) - [David] This is not sensual enough. - [Jono] Look at your face! (plastic peeling) (Anthony exhales) (laughter) - There we go. Oh, It's a little bit shy. There we go. Oh man, there's fingerprints all over it already. All right, so it's got power now. This little guy is separate from the motherboard. We could plug it into one of the external ports as well. This looks like it. Nope, that's a display port. There we go. Yay, there we go. I'm not sure why it sounds like a tiger. But, I mean, I don't know what a dragon sounds like, do you? Okay. So, what can I touch here? So, we got CPU clock, plus or minus. Okay, you can use it as a timer. \"Please download MSI center to enable functions.\" Okay, cool. Got a calculator here. Is that what that is? - Why? - There we go. Okay, so I'm getting a live readout of the BIOS, up there on the top. We're at 98 right now. B four. - [Computer Generated Voice] Graphics card error, please check graphics card. - Excuse me? That's weird. Let's have a look through the BIOS here. It's a pretty standard MSI click BIOS. Does have the nice dragon in the middle, though. And this motherboard should be pretty good for overclocking. Like, it's got a 20 phase power delivery for the CPU. Kinda bonkers. These are beta functions? Like, NVMe SSD Self-Test and SR-IOV Support. That doesn't sound right, but sure. Let's just get into Windows and see what the software has to offer us. Windows update! Oh, it's like the whole advanced section is hidden behind that, now. I can use this to bump up the CPU clock, I guess. Okay, that added 50 megahertz. I don't know. This is part of why living on the bleeding edge isn't always the best thing. So, there's gonna be a few hundred of these in the world. And honestly, I don't suggest that you buy one. But, MSI sponsored this video not to look at that, specifically, but to kind of contrast it against a more reasonable motherboard that they have here. Now, I'm not gonna do the full unboxing of this here, but the MEG Z690 ACE is much more reasonably priced at around well, $600, I think. Which is still a lot, but you're getting a lot of the functionality, the base functionality, that's in this motherboard, in this package. And the box is significantly smaller, too. - [Jono] And it's also real gold leaf. - Real gold leaf? It still has pretty much identical IO. So, you're not really missing out on anything. It's got the Thunderbolt ports, the mini display port inputs, all the USBs, the Wi-Fi. It doesn't have the 10 gig LAN, but it does have the 2.5 gig. And one fewer MVME, and there's no integrated RGB. But, it does have the pinouts for RGB, if you do you so desire. One of our editors, Mark, I think has the Z590 version of this, specifically because it has the thunder bolt with the display board. Yeah, this is pretty much the same motherboard, in terms of guts, as this. And you should buy this instead if you're thinking about buying this. If you are still thinking about buying this, then there's nothing I can say that will prevent you from buying this. You know who you are. Everybody else look at this, or one of MSI's other Z690 or even B660 motherboards. - [Jono] Oh yeah. Well, this is kind of weird. I don't usually unbox motherboards. There's usually not much to say about them. But, there's plenty to say about the other things that we see here on ShortCircuit. So, get subscribed so you don't miss any of our (Anthony hums) more esoteric things that we unbox. I'm probably gonna shoot this this week, aren't I? - [Andy] Quiet on set, please! - Quiet on set, indeed. GODLIKE!",
    "transcript_keywords": [
        "motherboard",
        "yeah",
        "MSI",
        "pretty",
        "GODLIKE",
        "kind",
        "PCI express",
        "Pretty standard MSI",
        "thing",
        "PCI",
        "lot",
        "nice",
        "set",
        "ports",
        "RGB",
        "box",
        "standard MSI",
        "port",
        "display port",
        "stuff"
    ],
    "transcript_entity_values": [
        "Wi-Fi 6E",
        "Six",
        "SR-IOV Support",
        "Kingston FURY Beast DDR5",
        "DIY",
        "Windows",
        "three",
        "One",
        "MEG",
        "4",
        "one",
        "8",
        "Thunderbolt",
        "a hundred",
        "5.0x16",
        "VRM",
        "Aquantia 10",
        "6.832 pounds",
        "million",
        "Corsair",
        "Mark",
        "20 inch",
        "unbox",
        "3090s",
        "50 megahertz",
        "second",
        "4.0x16",
        "Audio Boost 5 HD",
        "SLI",
        "IO",
        "17 inch",
        "David",
        "7.1",
        "SSD Self-Test",
        "the Wi-Fi",
        "six gigabit per",
        "Silent Gale",
        "Jono",
        "LAN",
        "only four",
        "this this week",
        "Wi-Fi",
        "10",
        "DisplayPort",
        "Anthony",
        "M.2",
        "another 110 millimeter",
        "LGA 1,700",
        "2.5",
        "two",
        "MSI",
        "B660",
        "80 millimeter",
        "Aquantia",
        "a few hundred",
        "12th",
        "four",
        "600",
        "Andy] Quiet",
        "PCI",
        "2,000",
        "RGB",
        "98",
        "ShortCircuit",
        "ESD",
        "six",
        "CPU",
        "eight",
        "20",
        "NIC"
    ],
    "transcript_entity_types": [
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "WORK_OF_ART",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "LOC",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "CARDINAL",
        "MONEY",
        "PERSON",
        "ORG",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG"
    ]
}