{
    "id": "iOmX5PeU_lA",
    "title": "Nvidia, AMD, and Intel FACE OFF!",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-01-13T02:40:43Z",
    "video_url": "https://www.youtube.com/watch?v=iOmX5PeU_lA",
    "category": "Science & Technology",
    "tags": [
        "Techlinked",
        "netlinked",
        "Linus",
        "CES",
        "CES 2021",
        "news",
        "tech news",
        "AMD",
        "Ryzen 5000",
        "mobile",
        "Intel",
        "11th gen",
        "Nvidia",
        "RTX 30 Mobile",
        "RTX 30 series",
        "RTX 3060",
        "laptops",
        "notebooks",
        "announcements"
    ],
    "views": 511298,
    "likes": 33778,
    "comments_count": 1158,
    "description": "Remotely monitor and manage your server or PC with Pulseway at   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      Timestamps: 0:00 ON A TUESDAY?? 0:05 New AMD + Intel mobile CPUs 1:09 RTX 30 Mobile GPUs, RTX 3060 2:16 Razer Project Hazel + Brooklyn 3:19 Pulseway 3:57 QUICK BITS: Weird CES stuff 4:37 Parler \"hacked\" (not really hacked) 5:10 iPhone 12 messes up pacemakers 5:33 Russia to fine Starlink users 5:55 CRISPR writes DNA to bacteria  NEWS SOURCES  RYZE AGAIN Ryzen 5000 series Mobile    fastest mobile processors   Until Intels H-series Tiger Lake CPUs come out?      GREEN MEANS GO RTX 30 Mobile Series GPUs    And RTX 3060    Smart Access Memory   dont forget about RDNA 2    OH WE LOVE RAZER DONT WE Razer smart mask      Project Brooklyn      QUICK BITS  CES IS WEIRD LG transparent display   Lasso at-home recycling machine     Emotional support pet robot     TALKING TOO MUCH Parler has 50TB of data hacked       MORE LIKE MAG-NOT SAFE!! LOL iPhone 12s Magsafe feature stops pacemakers     NOT FINE AT ALL  Russia to fine citizens for using Starlink      INFORMATION IS THE POWERHOUSE OF THE CELL Scientists write data to living bacteria with electricity + CRISPR   ---------------------------------------------------   AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Techquickie:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://lmg.gg/ces2021",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://linustechtips.com/topic/1293019-ultra-fast-ultra-book-ultra-competition-amd-ces-2021/",
        "https://youtu.be/74y1-JQJbjU",
        "https://youtu.be/sxTjfX9v8M0",
        "https://cdn.videocardz.com/1/2021/01/AMD-Ryzen-5000-7.jpg",
        "https://www.anandtech.com/show/16384/intels-8-core-mobile-tiger-lake-h-at-45-w-to-ship-in-q1",
        "https://www.anandtech.com/show/16381/intels-new-h35-series-pushing-quadcore-mobile-tiger-lake-at-15-w-to-35-w-for-50-ghz",
        "https://linustechtips.com/topic/1293033-game-on-with-a-better-budget-nvidia-ces-3060-announcement/",
        "https://youtu.be/oi8WpLMy3ZM",
        "https://www.nvidia.com/en-us/geforce/graphics-cards/30-series/rtx-3060-3060ti/",
        "https://www.kitguru.net/components/graphic-cards/dominic-moass/ces-2021-nvidia-confirms-12gb-rtx-3060-priced-at-329/",
        "https://www.pcgamer.com/nvidias-mobile-ampere-gpus-and-answer-to-amd-smart-access-memory-set-for-ces-reveal/",
        "https://www.theverge.com/2021/1/12/22227144/amd-rdna-2-gpu-gaming-laptops-release-date-ces-2021",
        "https://linustechtips.com/topic/1293092-razer-announces-a-smart-mask-with-more-than-just-rgb/",
        "https://youtu.be/FvWiCclESL8",
        "https://www.razer.com/concepts/razer-project-hazel",
        "https://youtu.be/MDqK_Wd-8i4",
        "https://www.razer.com/concepts/razer-project-brooklyn",
        "https://www.theverge.com/2021/1/10/22223774/lg-transparent-oled-tv-display-55-inch-smart-bed-ces-2021",
        "https://www.engadget.com/lasso-loop-closed-recycling-home-appliance-112631719.html",
        "https://youtu.be/W2f-eNpQTZk",
        "https://boingboing.net/2021/01/12/heres-an-emotional-support-animal-you-can-take-on-a-plane-because-its-an-ai-powered-tribble.html",
        "https://youtu.be/irJ1pwVng5U",
        "https://linustechtips.com/topic/1292676-former-social-network-parler-has-over-50tb-of-data-leaked-online/",
        "https://twitter.com/SwiftOnSecurity/status/1348754107750879240",
        "https://gizmodo.com/every-deleted-parler-post-many-with-users-location-dat-1846032466",
        "https://hexus.net/mobile/news/accessories/147250-british-heart-rhythm-society-warns-apple-iphone-12/",
        "https://bhrs.com/important-life-saving-therapy-inhibition-by-phones-containing-magnets/",
        "https://arstechnica.com/science/2021/01/russia-may-fine-citizens-who-use-spacexs-starlink-internet-service/",
        "https://www.popmech.ru/technologies/news-658363-internet-ot-ilona-maska-sochli-ugrozoy-nacionalnoy-bezopasnosti-rossii-i-hotyat-shtrafovat-za-ispolzovanie-starlink/",
        "https://www.newscientist.com/article/2264383-crispr-gene-editing-used-to-store-data-in-dna-inside-living-cells/",
        "https://www.scientificamerican.com/article/newly-studied-proteins-expand-crisprs-editing-range/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Okay, filming Tech Linked on a Tuesday feels wrong. I'm not happy about this. - [James] I am! CES 2021 is now in full swing. Or, one quarter swing since tech companies are making virtually all of their announcements, virtually. Did you like that? - [James] Yeah. - Nah! But a pandemic can't stop them from making wild claims to stir up excitement. So let's start with AMD, who announced their Ryzen 5000 series mobile processors during a keynote this morning. Laptops will be releasing in Q1 for major players like Asus, HP, and Lenovo featuring the new chips, which range from the lowly four-core eight-thread Ryzen 3 5300U, to the beastly eight-core 16-thread Ryzen 9 5980HX. - [James] Beast wars! - Yeah, beast wars! AMD has said these chips will be the fastest mobile processors you can get showing a slide comparing one of their top chips to Intel's current 10th and 11th gen offerings. But Intel also had a press conference today. Uh oh! Announcing that they're 35 and 45 watt 11th gen mobile CPUs would also launch in Q1. Oh no, who will win this battle of the mobile chips? The answer is, - [James] Apple! - Team green obviously wasn't happy letting team blue and red have all the spotlight today. So they made their own announcement, also focused on mobile parts. Gaming laptops featuring RTX 30 series mobile graphics cards will become available starting January 26th. And unfortunately, it looks like those spec leaks from last week were mostly correct. While there will be variants of these cards that deliver close to the power we might have expected, there may be other variants that offer drastically lower performance. We don't know why Nvidia designed them like this. But I am going to blame the pandemic. Nvidia also unveiled the RTX 3060, the non-Ti version. And while it has significant less CUDA cores, it has more VRAM, 12 gigs compared to the 3060 Ti's eight gigs, and a slightly higher boost clock? It's like Nvidia pressed the randomized button on the GPU specs generator. - [James] They always do this to us. - It can make it interesting sometimes. Anyways, as expected, Nvidia also announced resizable bar support for ampere GPU's which will work with both Intel and AMD processors. Which is almost something I would expect AMD to do instead. But hey, weird things happen in CES. I'm just glad we're doing this remotely. It's much weirder in person. Speaking of weird thing, Razer did their razor at CES thing and announced not one but two wacky concept products today. The first is Project Hazel, a transparent face mask with a built-in mic and amplifier, so people can still hear your muffled voice. It's also equipped with a surgical N95 respirator and active ventilation, but I didn't see any mention of fans. So I'm guessing that's just referring to, breathing. Of course, there's freaking RGB lights on it, including on the inside. So people can still see your mouth even when it's dark. And it's charging case includes a UV light to disinfect it when you take it off. Which you won't do, because you won't get it in the first place. Just like you won't get Razer's other concept, Project Brooklyn, and immersive gaming station consisting of a chair, with a mechanized arm that emerges from the rear to unroll a transparent 60 inch OLED display in front of you. - [James] Now, twirl your mustache. (laughter) - At the same time. I'm glad I bought these. Razer CES is an April fool's day. I don't, I think you've got it confused this year. Now it's time for Quick Bits brought to you by Pulseway. Look, I know you miss your devices. But there's a way you can see them again. Pulseway's real-time remote monitoring and management app is compatible with Windows, Mac, and Linux, and gives you access to real-time status, system resources, logged in users, network performance, Windows updates, and more. So you can spend quality time with your systems and servers even when you're miles apart. They won't miss you deploying custom scripts and updating all their systems on the go, because you'll be able to do that remotely while giving them a virtual, kiss on their tender cheeks. Let your devices know that you'll always be there for them by trying pulse away for free at pulseway.com, or through our link below. Creepy! Believe it or not, CES has even weirder stuff than Razer's projects. LG announced a transparent display, which it apparently wants you to place in front of another TV, so you can watch TV while you're watching TV. I don't know what they're doing. - [James] Just give us AR blasters. - James, you'll like this. Lasso is an at-home recycling machine, which will actually clean, sort, and break down recycled materials for you in your house. - [James] But how energy inefficient is the machine? - Oh no! Throw it in the garbage. And Mufflin is an AI-powered fluffy pet robot that will wiggle around to provide emotional support somehow. And there it is. This year's cat pillow, I knew it would show up. Controversial social network Parler's troubles didn't end when it was taken offline by basically everyone. 50 terabytes of data found on the platform's servers has been leaked, have been leaked. Thanks to Parler's developers using a public API, which allowed internet archivists to easily troll the site for data. - [James] And it's incriminating data, is it? Is it? - I don't know, some of it. I don't know, I don't wanna, no comment. Parler is suing Amazon for violating anti-competition laws. But I'm not sure what innovation they're bringing to the competition in terms of data security, if this is, true. Moving on. The British Heart Rhythm Society has identified a problem with the iPhone 12's MagSafe connector. Researchers were able to easily reproduce a situation where an iPhone 12 placed close to the chest of a patient with a pacemaker, would cause the implanted device to stop working. - [James] Ooh, that's arresting. - Oof! - [James] Cardiac arrest. - Yeah, I got it. So maybe you get a different phone for your grandparents to FaceTime you until they sort this one out. Russia's government has proposed fines for citizens who use SpaceX's Starlink satellite internet service because the country is working on their own space internet called, Sphere, with much cooler features. Like heavy content restrictions. (mumbling) Who would want to use (mumbling) the American internet, anyways? It's probably covered in McDonald's grease. And the DNA editing technology, CRISPR, has been used to write data to the DNA inside living bacteria, for the first time. - [James] It's like a tattoo. - Man, there's so much more bad-ass now. Researchers at Columbia University were able to accomplish the feat by combining CRISPR with voltage regulation techniques. So it might not be very long before you can transfer me a file not using a USB stick, but using bacteria. - [James] Turn it up, man. - You can plug this sucker in. And if you've been waiting for this episode to end, good news. Come back tomorrow, for more of a normal Wednesday type Tech Linked. It'll be way less weird. Trust me, I love those way better. - [James] Here's my braces. - Dude, that's",
    "transcript_keywords": [
        "Tuesday feels wrong",
        "Tuesday feels",
        "filming Tech Linked",
        "feels wrong",
        "filming Tech",
        "Tech Linked",
        "CES",
        "mobile",
        "Tuesday",
        "AMD",
        "Nvidia",
        "Tech",
        "Razer",
        "Ryzen",
        "data",
        "Intel",
        "mobile processors",
        "chips",
        "Razer CES",
        "announced"
    ],
    "transcript_entity_values": [
        "USB",
        "2021",
        "this year",
        "Amazon",
        "Razer CES",
        "Windows, Mac",
        "McDonald",
        "Quick Bits",
        "Lasso",
        "AMD",
        "James] Now",
        "Nvidia",
        "January 26th",
        "30",
        "CRISPR",
        "Ryzen 3 5300U",
        "tomorrow",
        "today",
        "Lenovo",
        "10th",
        "Sphere",
        "HP",
        "CUDA",
        "Tuesday",
        "American",
        "API",
        "April fool's day",
        "Linux",
        "Columbia University",
        "James] Turn",
        "first",
        "AMD",
        "Asus",
        "two",
        "Project Hazel",
        "British",
        "GPU",
        "60 inch",
        "Russia",
        "this morning",
        "3060",
        "Ryzen 9",
        "eight",
        "one quarter",
        "James]",
        "one",
        "iPhone",
        "N95",
        "Project Brooklyn",
        "last week",
        "Tech Linked",
        "11th",
        "James] Ooh",
        "LG",
        "Razer",
        "Parler",
        "Wednesday",
        "12",
        "50 terabytes",
        "Q1",
        "CES",
        "SpaceX",
        "Mufflin",
        "45 watt 11th",
        "Intel",
        "James] Beast",
        "year",
        "3060 Ti's",
        "Windows",
        "AI",
        "Starlink",
        "James] Apple! -",
        "Pulseway",
        "16",
        "35",
        "four",
        "James] Cardiac",
        "RGB",
        "Ryzen 5000",
        "James"
    ],
    "transcript_entity_types": [
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "WORK_OF_ART",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "CARDINAL",
        "PERSON",
        "LAW",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "NORP",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "PERSON",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "NORP",
        "ORG",
        "QUANTITY",
        "GPE",
        "TIME",
        "CARDINAL",
        "LAW",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "ORG",
        "ORG",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "FAC",
        "PERSON"
    ]
}