{
    "id": "IoWQbPhzkPU",
    "title": "The WEIRDEST MSCHF Scams",
    "channel": "This Is",
    "channel_id": "UC1IQIspOkCeV3WnYm32SBFQ",
    "subscriber_count": 480000,
    "upload_date": "2023-05-03T17:27:27Z",
    "video_url": "https://www.youtube.com/watch?v=IoWQbPhzkPU",
    "category": "Science & Technology",
    "tags": [
        "this is",
        "austin evans",
        "matt ansini",
        "test drivers",
        "the test drivers",
        "facebook",
        "tech",
        "technology",
        "amazon",
        "google",
        "sony",
        "playstation",
        "ps5",
        "xbox",
        "apple",
        "meta",
        "gaming",
        "consoles",
        "pcmr",
        "laptops",
        "gpu",
        "rtx",
        "psready",
        "denki",
        "xboxready",
        "superswitchgo"
    ],
    "views": 183388,
    "likes": 5388,
    "comments_count": 117,
    "description": "The team over at MSCHF are out of their minds       Subscribe!  Twitter:  Matt:  Instagram:   Produced by Kinsey Edited by Aron Goodall:   Chapter Titles ------------------------------- 0:00 Hello and Welcome 0:25 88 Holes + Spots 1:24 Key4all 2:48 This foot does NOT exist 3:37 Chair Simulator 4:25 Museum of Forgeries 5:10 Participation Trophy 5:56 Tax Heaven 3000 7:11 Card V Card 7:48 Finger on the App 8:55 Tontine Game 10:12 MSCHF Box 11:45 White Whale 12:31 Alexagate 14:05 Big Fruit Loop",
    "description_links": [
        "https://youtu.be/5WdOcTd5ytA",
        "https://youtu.be/RSdz9peLuhk",
        "https://youtu.be/beJ97So74UY",
        "https://youtu.be/wP2n9_O-F74",
        "https://youtu.be/_-WGvpgOEcI",
        "http://www.youtube.com/thisis",
        "https://twitter.com/ThisIs_Channel",
        "https://twitter.com/matt_ansini",
        "http://instagram.com/thisis_channel",
        "https://twitter.com/arongoodall"
    ],
    "transcript": "- Hello and welcome to This Is. We're gonna take a look at some stuff from MSCHF. - Vowels are overrated. - Yeah. This is like, \"Oh, I need a new company. Get rid of the vowels.\" We're gonna take a look at stuff from MSCHF, which is another one of those hypebeast nonsense stores. - [Austin] No, no, these guys are wild. They do some of the coolest and/or dumbest things that anyone with a lot of money wouldn't be able to do. Let's start out with the first one, which is 88 Holes + Spots. I'm familiar with some of the MSCHF stuff. So they started out by buying a $30,000 Damien Hurst Spot print which is literally 88 colored dots on paper for $30,000. - I'm already checked out of this. - It's 88 dots, right? Just picture this. - I can get 100 dots for about 50 bucks if I go to the local art school. - Oh wait, it's almost a dollar per dot. - You gonna talk about paying $30,000 for 88! - No, no. Here's what they did, right? So what was clever about MSCHF is that they saw this and they thought, \"Stonks.\" So instead of selling it and trying to just get people excited about it, they actually cut out each one of those dots and they sold it for $480 each. Which, fun fact, are now worth about $1,000 each, because, stonks. Then they took the paper and they named it 88 Holes because the dots were gone, and they auctioned it off for $261,000. Art, baby! - I hate this so much. - It's literally- They made value from nothing! - [Matt] Key4All. (Austin laughing) I do remember this one. - [Austin] I do remember this too. - Years ago, in 2022, for $20 each, they sold 5,000 keys to a single 2008 PT Cruiser. - I know a bunch of people I saw on Twitter who actually had found this and gotten it, but the idea was, you had the car, you drove around a little bit, but then you drop it off and the next person comes and grabs it. So it started out in New York, ended up in Orange County, which is where there's a specific picture where it had been heavily modified as art. As far as I know, this actually is still going. It's not been run off a cliff, amazingly. - So they have a whole discord server of all the key holders, and basically, they're kind of like crowdsourcing where to get mechanics or repairs. - My concern is like, okay, when the tags are expired and you get pulled over and then the cops are like, \"Hey, what's wrong with this car?\" Good luck trying to explain that. Or just say, \"Oh, it's MSCHF, don't worry. It's just a little MSCHF. I just stole this car.\" \"From who?\" Oh, you're going to jail. Done. I am absolutely shocked that this has been around for almost a year at this point. And it is still, supposedly, a functional vehicle which has not been absolutely trashed. I fully expected someone to do this and just run it off a cliff or like throw it in a lake or something. Like, how every single time someone gets the key, how are they not just absolutely destroying it? Shout out to an internet community actually banding together and not ruining what's a really fun thing. I can't believe that it's still around. - [Matt] This Foot Does Not Exist. Kinsey, foot me. - As astute viewers of This Is will know, we have quite the relationship with feet. There are literal dozens of photos of my feet online, including on a highly acclaimed Wiki site for feet. The nice thing is, is that if you're interested in photos of feet and the internet can't deliver, then MSCHF will generate a unique foot photo for you. - What's the number? I'll take one for the team. - Look at his face. He's pretending he doesn't have the number already saved right now. - So they immediately responded. (Matt laughing) - [Austin] Oh, it's a thing! - [Matt] Aw. - [Austin] There's too many toes in that photo, I think. - [Matt] There's not enough toes in this photo. We're gonna keep the foot out for the rest of the episode. - Are we, though? - This foot does not exist. - That foot exists. - It doesn't exist. This is AI generated. The Chair Simulator. (Austin laughing) If you're like me and gravity is just your mortal enemy, for free on Steam, you can sit on chairs, earn chair points and then collect more chairs. - [Austin] That's great. You can be MrBeast, you can be some of the dudes from FaZe Clan as they cry about their stock price. - Because we mentioned FaZe Clan, I actually feel like we do need to have a disclaimer that our editor, Aaron, is heavily invested in FaZe. - His entire life savings, I think. - Yeah. Yeah. So I feel like we have- Disclaimer. Like, no insider trading here. - Please, FTC, don't sue us. How many chairs do you think you've sat on in your life, Matt? What's a ballpark estimate? In your whole life, how many chairs? - Okay, 'cause here's the thing. Millions. I sit in so many chairs. - Millions? - Billions. - Okay. If it's millions- - My life's goal is to (beep) in the chair. - [Austin] Museum of Forgeries. Basically what they did was, they bought a $20,000 Andy Warhol piece, except that instead of giving you the Warhol, they also made 999 forgeries using a custom robot. They sold all 1,000 of them for $250 each, and they erased all the evidence of which one was the original. So there are thousand of these Warhol pieces out in the world and no one has any idea which one is the real version and which of the 999- - This is literally just Redd from \"Animal Crossing\". - The real idea here is that this is trying to make a point about how the authenticity of the art world is a little bit of a goofy concept. Clearly MSCHF made a whole lot of money on this. You wonder how they fund a lot of this stuff? It's because they sell nonsense like this. - [Matt] The Ultimate Participation Trophy. - Wait, this is an actual real collab with Tiffany? It's not like they faked it? This is actually a real collab with Tiffany? So I know that Tiffany is a brand which is quite high-end, they make a lot of very fancy goods. I actually did not know that Tiffany made trophies, but I guess it makes sense if you want a high-end, fancy Daytona 500 trophy. - So they sold 100 of these trophies for $1,000 each. And so the first person gets the first place trophy, the second one to buy it gets the second place trophy, the third place gets the third place. - You get the first place trophy for being the first person to buy the trophy. - And then all the rest of them were participation trophies. (Austin laughs) Before cars were invented, I do think this was the original \"Rocket League\". Horse soccer. - I wanna boost my horse off and do a little flip. - When they do the flips. That was good. - [Austin] Tax Heaven! - [Matt] Come on! - [Austin] Tax Heaven 3000. The big tax man, not the IRS, but big tax like TurboTax and H&R Block and whatever. They make an absolute fortune helping you, dear viewer, to file your taxes. It's cheap, it's easy. I'm glad these companies exist to make your lives easier and not to lobby the government to make filing your taxes a byzantine nightmare and so that they can all stay in business when you sign up for their \"free service\" and when you get to the end they charge you $60 'cause you accidentally added a deduction which is in there paid tier. - This is a dating sim. So what you do is, you tell your waifu your social security number. - Supposedly, this actually is a real way to file taxes. - So this is ideal for single filers with no dependents. Big shock there. And it was removed from Steam without any explanation, but, like, you are giving them your social security number. When I saw this, I'm like- - \"What's your social security number?\" - [Matt] The collector's edition came with a disc and a body pillow so you could cuddle with your waifu while talking about your taxes. \"Uwu, you're getting audited.\" - You know what? I'm not gonna name names, but there is a person in the office who unironically wanted to do this until it got removed from Steam. I would still rather use this than TurboTax. - [Matt] The Card V Card. Do you want your credit card to be player versus player? So every one of the cards is connected to a single bank account that MSCHF would periodically deposit money into. - This is a card without any actual numbers on it so you can't use it online. You have to take the physical card and go to a store and swipe it, or I guess, use the chip or whatever. But I'm sure 99.99% of the time there's no money on it and it's going to fail. However, if you're lucky enough that MSCHF just dropped 50 bucks in there, you actually get your purchase to go through but you don't know what's going on. Let's be real. If you're spending this much time on MSCHF, you're probably used to your card getting declined sometimes. So, you know, after your tax refund comes in, it'll all be square, right? Finger On The App. Okay. So this is the MrBeast app, which essentially was, well, exactly what it says. Keep your finger on the app, you have to move it around and follow it, and the last person who keeps their finger on it wins $25,000. Here's the thing, this was, let's say, a little controversial perhaps, 'cause I don't think it quite went the way the people thought it was gonna go. - So the final prize was determined by players who didn't win. It went on for 70 hours and 4 people were still going. And MrBeast just decided like, \"All right, I'm over this\"- - [Austin] And gave them all 20 grand. But the thing is, a couple of them actually didn't believe him and they kept still doing it 'cause they didn't wanna get disqualified. This feels like one of those things that, cool idea, but you can easily see where this is gonna go. Like, it's very splashy. But you're gonna have a bunch of people who are really upset for a variety of reasons. Like this almost is designed to piss off your most hardcore fans. Imagine you're 6 hours in to holding your finger going, \"Boop boop boop boop\", and then some dumb thing happens like- It feels like a good idea in theory and it is a 0% surprise that this ended up being a bit of a disaster. - So you can use your waifu tax filing when you have your $25,000. - Yeah, good luck explaining that one. (Kinsey laughing) Tontine Game. What is this? - [Matt] So this is a daily login battle royale who is named after an investment scheme dating back to the 1,600s where people invest and then the last person alive inherits all the money. - This had 7,140 people who jumped on, paid $10 to join. You have to log in every day and you have to click \"I'm alive\" or you are dead and the last one still alive gets the money. The thing is, this has been around for 472 days and there's still 478 people still alive, right? So it went from 7,000 down to 478. - I like how they just took snaps, like snap streaks, and then just made it into a game. - To be fair, I think snap streaks probably came from this Ponzi investment scheme called the \"Tontine Game\" from the 1,600s. This is cool. I like this because, everyone put in 10 bucks, so if you lose your $10 it's not the end of the world. You're literally investing years and years of your life doing this every single day, which, if it's worth it to you, have fun, and if not, you lost 10 bucks. Like, I'm on board with this one, this is a cool idea. Hopefully they never shut the servers off or there's gonna be a whole bunch of angry people. - So the only one who actually wins this game is MSCHF who's collecting all the interest payments on 71 grand. - That's probably gonna be worth 80 grand eventually, maybe 90, 100. Who knows? Good job, MSCHF. Hopefully you're still around by then. - Moving on. The MSCHF Box. - [Austin] Oh! - [Matt] So this is a $10 mystery box, and it appreciates in value $10 every day that you don't open it. - So you spend $10 and then tomorrow it will be worth 20, the day after, 30, 40, et cetera, et cetera. You can send it back unopened at any point for the value that it's worth up to a thousand dollars after 100 days. If you're a good investment person who makes smart financial decisions, you buy the box for 10 bucks, which obviously are very limited, not everyone could do it, you hold onto it for a hundred days, you ship it back to them and you made yourself $1,000. Absolute no brainer, a terrific return on your investment. Or you can be a giant dumb-dumb and open it up. Now the thing is, you don't know what's inside the box. Some of it was literally worthless crap. We're talking about garbage, chewed gum, and just all kinds of nonsense. But on the flip side, you get all kinds of actually good stuff, Matt. - So there was like, a Rolex, a Vespa, 25 years worth of free chicken sandwiches. - Someone from Mashable opened the MSCHF Box, and instead of getting a Vespa or something really cool, they got a toaster that toasts \"Yolo\" and \"you got this\" into toast. - I guarantee that based on our experience with toasters that burn, remember when we got the Bob Ross toaster? - [Austin] Yeah. - [Matt] And like, it did not look like Bob Ross on there. It just looked like a skid mark on some tidy whiteys that are no longer that whitey. - You would be absolutely ridiculous to not send the box back. You spend 10 bucks and you make $1,000 at the end? Why would you open it? - But the mystery! - I mean, unless you're a YouTuber or something, keep that thing sealed. Although I think these have been long gone 'cause this was a while ago. - [Matt] The White Whale. - [Austin] Wait, what? - [Matt] So this isn't really a product? They posted half of a phone number and said, \"Find our phone number and text us 'MSCHF'.\" - But isn't this gonna mean that anyone who shares the digits- So say your phone number has 3-4-8-5 in it, people are gonna just start randomly spamming the word \"MSCHF\" to like hundreds if not thousands of phone numbers? - [Kinsey] That's absolutely what happened. - [Austin] Oh, that's bad. Okay, you probably shouldn't do that. - So you get a bunch of random texts from hypebeasts, also a bunch of people having fun lying to the hypebeasts and texting back like, \"Hey, you got it!\" Like, \"You got this, man!\" Supposedly someone did find the correct number- - Did they really? - But it's unclear what really happened which doesn't make, you know, that's not surprising because- - Wait, wait, that's it. So MSCHF didn't say, they just said, \"Find our number and text us.\" They didn't say what happens. They just said do it and then you'll enjoy it. Alexagate. So this was a $99 high-tech audio jammer that sits on top of an Amazon Echo and jams its microphone from always listening. You know, like the mute button does. But this, this is much more nefarious because you wanna trust the mute button? I've heard that when you hit the mute button Jeff Bezos goes, \"Oh, someone hit the mute button\", and he specifically starts listening in 'cause he knows you only hit the mute button when you're about to say something spicy, like how you're a huge fan of This Is and you wanna subscribe and ringling the dingling button. And Jeff goes, \"Oh wow, I forgot to subscribe to This Is. I'm gonna remember to subscribe right now and also ringing the dingling button.\" So he always gets our notifications directly served to his mobile device, probably his Amazon Fire Phone. - So what you could do is, you could clap/tap it three times (Matt clapping) to toggle it on or off. And it seems to make a point about privacy and sticking it to Bezos, but it feels like it's more of just like imagined privacy. - Think about MSCHF. This is a company who are up to mischief. They want to try to get splashy headlines. Like, that's literally what the whole business is. Let's make some crazy thing, we'll sell it to a couple hundred people, whatever. And then we want the overall brand to get bigger and everyone gets super excited about it. I personally like my buddy Jeff to listen in on all my most private conversations. - We don't have the Alexa in here. You don't have to suck up to him. - Oh good. Okay. So, he keeps listening. It's really creepy. - Dude, every time we invite him over he always like- We would be like, \"Hey, do you guys want pizza?\" He's like, \"No, I'm not gonna have any pizza.\" And then he has like three slices! He never chips in for pizza. Jeff Bezos! - But I'm glad he subscribed and decided to ringling the dingling button on the This Is channel. - [Matt] Big Fruit Loop. It's big, it's fruity, it's a loop. It was almost half a pound and 930 calories. - You probably shouldn't eat this one. I just love that they've got the toucan who has just tried to swallow it and is choking. Can I actually say? So I'm just gonna hold the foot. I'm not sure why I've grabbed the foot, but I'm holding it. I have had contact with some of the crew from MSCHF in the past over some of the things that they may or may not do in the past, present and/or future. And I gotta say that after looking at some of these things, these guys are cool, these guys legitimately do really cool stuff. - So now we know who found the White Whale. - I think that while it's easy to make fun of a lot of hypebeast nonsense, the fact that they do everything so tongue in cheek is great. Like some of the things, I will admit, are a little goofy, but that's their whole thing, is they've gotta be turning these things out, there's gotta be a new drop all the time. And while not all of them are gonna be winners, I think that there's enough things here that are legitimately fun and cool. I'm about it. My Austin Evans MSCHF drop will be coming soon. Subscribe. Otherwise you'll miss it. And you'll have to text random numbers and steal cars to find out. - Like, follow, subscribe. Let us know what we should have looked at from MSCHF, and we'll catch you in the next one. - The BTS Army one was one of my favorites. (mellow music)",
    "transcript_keywords": [
        "MSCHF",
        "thing",
        "people",
        "number",
        "make",
        "MSCHF Box",
        "things",
        "Foot",
        "Good",
        "button",
        "Card",
        "person",
        "cool",
        "Box",
        "mute button",
        "Trophy",
        "phone number",
        "stuff",
        "chairs",
        "real"
    ],
    "transcript_entity_values": [
        "Redd",
        "New York",
        "90",
        "Aaron",
        "Austin] Museum of Forgeries",
        "Years ago",
        "Damien Hurst Spot",
        "three",
        "Andy Warhol",
        "Bezos",
        "Jeff Bezos",
        "IRS",
        "FaZe",
        "ringling",
        "Amazon Fire Phone",
        "20",
        "YouTuber",
        "thousands",
        "MSCHF Box",
        "Ponzi",
        "1,000",
        "Alexa",
        "480",
        "up to a thousand dollars",
        "Tiffany",
        "toucan",
        "every day",
        "all 1,000",
        "5,000",
        "30",
        "Amazon Echo",
        "hundreds",
        "third",
        "0%",
        "472 days",
        "60",
        "Twitter",
        "the \"Tontine Game",
        "250",
        "999",
        "Matt",
        "dozens",
        "daily",
        "Austin",
        "Jeff Bezos!",
        "Tiffany",
        "2008",
        "Orange County",
        "25,000",
        "The Chair Simulator",
        "Wiki",
        "10 bucks",
        "MSCHF",
        "25 years",
        "Stonks",
        "first",
        "Bob Ross",
        "70 hours",
        "Tontine Game",
        "20, the day after",
        "Warhol",
        "2022",
        "battle royale",
        "30,000",
        "FTC",
        "whitey",
        "Kinsey",
        "71",
        "AI",
        "20",
        "about 50 bucks",
        "6 hours",
        "50 bucks",
        "Boop",
        "MSCHF",
        "TurboTax",
        "almost half a pound",
        "almost a dollar",
        "4",
        "a hundred days",
        "MrBeast",
        "second",
        "Jeff",
        "the White Whale",
        "999-",
        "261,000",
        "Rocket League",
        "Yolo",
        "99",
        "tomorrow",
        "Rolex",
        "about $1,000",
        "80",
        "one",
        "500",
        "waifu",
        "20,000",
        "7,000",
        "100 days",
        "Austin Evans MSCHF",
        "almost a year",
        "years",
        "3",
        "Mashable",
        "half",
        "FaZe Clan",
        "88",
        "thousand",
        "99.99%",
        "The White Whale",
        "930",
        "10",
        "40",
        "3000",
        "7,140",
        "100",
        "1,600s",
        "478",
        "a couple hundred",
        "H&R Block",
        "Millions"
    ],
    "transcript_entity_types": [
        "PERSON",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "MONEY",
        "FAC",
        "MONEY",
        "MONEY",
        "ORG",
        "NORP",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "PERCENT",
        "DATE",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "GPE",
        "MONEY",
        "WORK_OF_ART",
        "PERSON",
        "MONEY",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "ORDINAL",
        "PERSON",
        "TIME",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "MONEY",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY",
        "MONEY",
        "TIME",
        "MONEY",
        "PERSON",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "FAC",
        "CARDINAL",
        "MONEY",
        "ORG",
        "PERSON",
        "MONEY",
        "DATE",
        "PRODUCT",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PERCENT",
        "PERSON",
        "CARDINAL",
        "MONEY",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL"
    ]
}