{
    "id": "IPvbnRz0eq8",
    "title": "MASSIVE Jelly Bean Taste Test with Ro!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-04-16T20:58:03Z",
    "video_url": "https://www.youtube.com/watch?v=IPvbnRz0eq8",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "rosanna pansino",
        "jelly bean",
        "taste test",
        "easter",
        "candy",
        "trying jelly bean flavors",
        "new jelly beans",
        "beer jelly beans",
        "jelly bean easter candy"
    ],
    "views": 1669312,
    "likes": 27271,
    "comments_count": 2133,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, it's Justine and I here with Ro today. - Hello. - This is super exciting. So I guess it's the jelly bean season right now. - Mm-hmm. - And I thought it'd be really fun to taste a bunch of jelly beans. And when I was online I bought so many. I even got some of the, what are they, the Bean Boozled? - Oh those ones are gross. - They're really gross, so I thought that we would warm up to the jelly bean taste test-- - Okay. - And start with some good flavors first. - Ooh. - So this'll be for a separate video. They even have beer-flavored jelly beans. - [Ro] Beer? - [Justine] Champagne? - [Ro] Like stout? - [Justine] This is so strange. - I've never seen those. - Krispy Kreme. - I got so excited, she brought these over, these are little cocktails, and I love pina colada. Look at this, they have strawberry daiquiri, mojito. - There's a lot on there. Do people like jelly beans? 'Cause I don't really like them. I love candy. - I love jelly beans. - But this is not like my go-tos. You do like them? - Yeah I have a little jelly bean bowl. I like jelly beans but usually I don't find these fancy flavors. I just have the little Jelly Belly variety pack. - Huh? - I don't have these like fancy, these are like... For a special occasion. - Well I brought my ax today, my throwing knife. - (laughs) Oh my gosh. - So you open. (laughs) - Why does it have your name in it? - Oh, my friend Suzy-- - Like it's so fancy. - Got it engraved because we always go on adventures together. This is really? - Um, yeah. Justine, what is that for, chopping down trees? - [Justine] It's like a throwing ax. - What do you throw that at, targets? - Tree targets. We've got the Cocktail Classics. Here we go, whoa. - [Ro] Ooh, what drink would you like? Tastes tropical. - Mm, super tropical. That's actually quite nice. - I taste the pineapple. - You do. - And the coconut, I love 'em, that's one of my favorites. - Peach Bellini. - What is that? - Whoa. - Mm. - Okay so remember when I said I didn't like jelly beans. - That's delicious. - I think maybe I didn't realize that I like them. - Oh mojiot, mm, mm, mm. - Whoa. That so far is my favorite. - How are they doing this? - I love mojiots. - This tastes so good. - This is really good. How about Strawberry Daiquiri? - I don't know if I've had a strawberry daiquiri. - Like ever, like a real one? - This tastes delicious. - It's like a-- - It's really good. Is that a strawberry? No wait, that's a Peach Bellini. - It's reversed. - The label are reversed on the back. This is a pomegranate cosmo. - [Ro] A cosmo? What's in a cosmo? It's just like spirits and, what? Cranberry juice? - That one's okay. - I've never had a cosmo. Okay. - I think I have. - Cosmos were my least favorite in this pack. - Yeah. - But all the other ones were perfect. - Mm, the mojito. Definitely my favorite. - Pina colada was my favorite. But they're all-- - We'll save these for you for later. - Okay. - You can put them in your jelly bean bowl. - Oh my gosh, these are going in my jelly bean bowl. - I didn't know that I liked jelly beans. - Aren't they great? - I take back everything that I said. - They're a little chewy. - Little chewy. - But they have great flavor. - I have two fake teeth, so sometimes that causes me trouble. - What happened to your tooth? - I don't know! I just never had teeth that came in when I was a child. - They never came in? - No, they pulled my baby tooth out, and they're like, oops. - You need to come to my dentist. My dentist is great. - [Justine] Wow, this is the Fabulous Five. - Oh, the fab five! What have we got going on here? - So this is what we just tried. (Ro gasping) - [Justine] So this is the cocktail classics. This is a smoothie blend! - Ooooh, what kind of smoothies? We've got berry smoothie, orange smoothie. - This is... Okay, that wasn't so good. That tasted, at first it was good. Now it tastes like spoiled milk. (cow mooing) - What color did you do? What color is that? - I don't know. - Hey wait a minute-- - I think that-- - Orange. You get red? - I think it was that one. - Okay, I'm not gonna eat the red. I'm gonna try an orange. (pensive music) - I don't think I like the smoothie ones. They're like milky. - Here's what's weird is, in the beginning, it has a great taste. The after's a little... - It's like spoiled milk. Ick. Nuh-uh. - Skip the smoothies. There's a color cheat on the back. Give me some mint mint chocolate chip. Here we go. Favorite ice cream flavor. - [Justine] I'll try that one, too. Ew. (Ro grumbling) Oh my god, you're making weird noises. Are you okay? - It's like fake, artificial cream flavor. (Ro fakes vomiting) Ew! - Oh my gosh! - I don't like fake, artificial cream flavor. - That is foul. - [Justine] I'm gonna try birthday cake as well. - Birthday cake ice cream. Don't hit me with that artificial cream flavor. (dramatic music) (Justine spitting) - Ew! - That's weird taste. - Happy birthday, here's a gift. - Happy birthday, Justine. - Trash! Gross, I don't like it. Alright, we should move on to soda pop. Grape Crush, root beer, Orange Crush, 7 Up, Dr. Pepper. I love Dr. Pepper. (Ro gasping) - They have Dr. Pepper? - Yes, I think that this is Dr... No, that's-- - Oh my gosh! And they have root beer and 7 Up. I wanna try Dr. Pepper. I wanna try root beer. Which one did you try? - Dr. Pepper. - How'd you know? They're both brown. - Oh god! (Justine groaning) - [Ro] That's terrible. - That's absolutely disgusting. - Oh, that's terrible. - That tasted like rotten, moldy, soiled... Body parts. - Ew. - Ew! Okay, Dr. Pepper was not good. What are you gonna try next? - I'm gonna try root beer. - Okay. - It's not great. It's really light. That's what I appreciate about the flavor, is that it's like a really light like root beer. Dr. Pepper just had way too much flavors. - Yeah. - Like too much artificial flavor, hitting me in the face. - I didn't like it. Should we try 7 Up? - Yeah. I love 7 Up. - Mmm! Really-- - This is nice. - Oh! - It's super limey. (laughing) - Yeah. - I feel it in my sinuses. (laughing) I'm sweating now. - [Ro] Are these... - They don't taste like the soda, though, I don't feel like. - No, that was so limey! - What do you call the soda? - I think it depends who you're talking to. And what they say. I'll try the grape one. - Nuh-uh, I'm not even going near the grape. I'll do orange. - Actually, grape is nice. - Orange isn't bad. It's really hard to mess up a jelly bean. - Clearly it's not that hard. - These aren't even the gross jelly beans. - Those are in the bag. I can't even imagine-- - These are supposed to be the good jelly beans. - These are the citrus mix. - Like Sunkist the juice. - I'll try a lemon. Lime is good, or-- - Better. - Lemon. I don't even know what I'm tasting. They all taste the same. - Sunkist, better than the sodas. - I'm gonna try the grapefruit, even though I don't like grapefruit at all. - I don't like grapefruit either. - It's really, like-- (Ro gasping) - We just bonded. - We did. - We just had a moment, everybody. - We had a moment. - And you guys saw it on camera, but we both don't like grapefruit. (Justine fakes vomiting) - Samesies! Why is it so sour? - I don't know. - They're almost like Sour Patch Kids sour, isn't it? - Ew, it is, yes, ew. - It's a lot. - Bye-bye. - It's a lot, whew! - Fabulous Five is down. - [Ro] Yeah. - I think that-- (Ro gasping) We've been having so much fun with those little box containers that we should really get super silly! - [Ro] Oh my gosh. These are supposed to be champagne flavored jelly beans. - [Justine] And these are the beer flavored jelly beans. - [Ro] Little stout! Let's see if they actually taste like... Do you think it's going to be a lite beer, or dark beer brew? - This looks like kind of a lite beer, I would say. - What kind of a port is it? - Oh, that stinks. - Smell that. - It's smells-- Girl, what is it? Like a dark-- - Ick! - Oh! - [Justine] Ew. - Ew! - Should we do beer first? - It smells like dirt and yeast. I just really-- - Oh, look how pretty they are, though. - This looks like champagne, like it looks all pretty. - Do we do beer first, because it's probably gonna be disgusting? - Let's try beer, and then I'll wash the taste out with maybe one of these. (soft, pensive music) - That does not taste like beer. - No. - I actually like this. - It's really good, and then it's really light. I mean it's... Why does it smell so bad, but it tastes just fine? - I'm surprised, actually. I thought this was gonna be disgusting. - It's not. - No, it's good! - Put that in your bean container. - Whoa, that just blew my mind. I was not expecting that after the smell. Champagne, are you ready? - Champagne dreams. - Cheers? Cheers! - Mm. - Sweeter. - I like it. - It's so mild. - Yeah, the ones that I thought were gonna be trash are really good! These might be my favorite jelly bean flavors, because it's very light. - It's so light. It almost tastes like... Like a grapefruit juice. Like a white grapefruit juice. - [Justine] I love it. - [Ro] Like a really light. Alright, we're gonna switch it up. Okay, what's this? - Spice flavored. - Spice? I'm a little scared. - Okay, jelly beans are pretty. I think I'm starting to like jelly beans. - They're really cute. - [Justine] So this is from a different company. This isn't the Jelly Belly. This is from Just Born, which they also make Hot Tamales, and Peeps, and Mike and Ike's. - Ooh. - Just Born. I got a red one. - I'll do it with you. - Oh! - Hot. - Hot! (coughing) - That's hot! It's like a Hot Tamale jelly bean. - I forgot that's spice. It's spice! (spitting) We definitely tried the red one, which is cinnamon. And now I've found the flavors. White is peppermint. I would use that to counteract. - It's good. - Oh, that one's real minty. - It's really minty, it's really strong. If you want strong flavored jelly beans. - Oh, Just Born. - They taste like fresh and strong. - Okay, so the yellow one is clove. - Clove? - I can't tell if I love it or hate it. I'm not sure. - It's strong, wow. Wow, what? - It's a weird taste. - It reminds me of the holidays, you know? Because I always but cloves and nutmeg and ginger in together, like when I'm making spice cookies for the holidays. - Yeah. I wanna make a flashback to us making holiday videos. (laughing) Alright, I'm gonna put this around the tree. - Okay. (laughing) Justine, you got me in there. (laughing) Justine, wait! (laughing) Look at all these muscles! - My goodness. - It goes really good with these pants, so I left them on. What's the other one? - Okay, so spearmint is green. - Okay. - I like spearmint. - I'm a blow. Are you a mint, or a spearmint kind of a person? - I love spearmint. - Did you say vinegar? - Winter green. - Oh! (laughing) I thought you said vinegar. I was like... - That wouldn't surprise me. - What the heck's a winter green. - I don't know. - Why if it's called winter green? It's pink. - Because they ran out of green. I like this. - It's really good. - I like winter green. Next up I think that we should try these Krispy Kreme Donut flavors. (gasping) - Oh my god, I love Krispy Kreme. - They also come in this bag as well. It's basically the same donut flavors, but they are rocks. - Okay these are like pretty displayed. We have original glazed right in the middle. And then we have a glazed blueberry cake, a chocolate iced with sprinkles, strawberry iced, and then a cinnamon. What is this, a cinnamon? - She can't open it fast enough. Oh my goodness. - Cinnamon. I see the first ride of cinnamon! - Do you need help? - Yes. - [Justine] Alright, go for it. - Why can I not open anything? Cinnamon apple fill. - [Justine] Wow! - Look at those pretty pretty over here. - Ooh. - Ooh! This shot, this is pretty. - [Justine] Which one, do you want to try the glazed first? - Yeah. - Since it's a classic. - Yes, I have... The original glazed. I wanna know, does this taste like a straight-up donut? (dramatic music) - I don't like it. - I hate it. (fake sobbing) - Ick! - That does not taste like a donut. - That was an absolute lie. You're disgusting. - Okay, if you guys get these, you'll know what we're talking about. That does not taste like a donut. (fakes vomiting) - Which one do we try now? - I'm like really sad now. Like are any of them gonna taste like donuts? - I don't know, let's try the strawberry. Strawberry iced. - Okay, let's do strawberry. - That one's nice. It's a little creamy. - It's better than the first one. - But if that is what we're basing all of these off of? - I think there's like an underlying flavor, like the \"donut\" flavor doesn't taste like donuts. - No. - Because if it's mixed with any of these, it's just gonna be weird. - Mm-hmm. - What about your blueberry one? - Oh, no, is this gonna-- - Blueberry glazed donut. - Is this gonna ruin all my hopes and dreams? - Let's try. Uh-oh, uh-oh! - Okay, it's like fine. - It's okay. - Sub-par. - Do any of these taste like a donut? - Why are you doing this to us? - Look, there's sprinkles in there. My mouth feels funny. - What's your favorite kinda donut ever made? - Honestly, I like these cake donuts. Like that type of like... - Like the old fashioned with the glaze? - Yeah. - Those are great. - Or like those French donuts. - I like, yeah, those or chocolate covered donut, or a maple bar. Chocolate, let's see. Mm, no, that's not a chocolate donut. - Okay, we've got one more. It's the cinnamon apple filled, and you were hyped about the cinnamon. This is like-- - Girl! - Christmas morning-- - Give me something. - and Santa decided to not go to your house. - This is like a got a lump of coal in my stocking. But he wrapped the coal, you know? Wrapped it, so I thought, ooh, this could be something. And then you open it, and it's like... (groaning) - This one's okay. It's just okay. Well, I'm disappointed. I don't wanna see these again. - Krispy Kreme, you have great donuts, but the jelly beans are not for me. - Not for me, maybe it's for you. - [Ro] What have we got? - We've got two more. - Okay, I'm getting excited again. - We've got holiday favorites, which these potentially could be expired because the holiday is way over, but. - Oh, you'll be fine. They're jelly beans! - I don't know! I ordered all this stuff from Amazon to do an Oreo unboxing-- - Yeah. - Everything was expired. - No! - And this conspiracy, I had these Oreos with the mega-stuffed ones. But there was like three cookies missing. Yeah. - [Girl In Blue] That doesn't even count. That doesn't even have a mega in it. - No, it doesn't. - We have been misled. - [Justine] Someone definitely ate a cookie. Somebody ate like three cookies. Somebody ate a couple cookies. - [Justine] Look at that, the other half of this isn't even there. - I'm upset! - Somebody-- - Are you kidding me? - Had their little mitts in my cookies. - Welches, Welches? - Grape. - How do you say Welchers? - Welchers's? - Welchers's? Welcher's. - [Justine] Family-farmer owned. Yeah, so let's try the grape. - Mmm. I like them. - I like this. - I like these. - So this is a different brand as well. So which one do we think is the strawberry? - I was gonna say, I don't like grape flavors, but I like this brand of grape. - This is a good grape, yeah. Because it's family farmer owned, obviously. - This is my first brand of grape I've ever liked. Wow. - Today's the day. Oh, they also do strawberry really well. - Mmm. - Mmm. - Those are great. - [Justine] So full of flavor! - [Ro] Whoa. - Wow. White grape peach. - Mmm, that's good. - Oh, that is good. - Mmm, that's really good. - Oh my god. - What about these red ones? - Oh my gosh. I think the yellow is the white grape peach. - That's good. - Wow, these are my favorite so far. - My favorite jelly bean. Put them-- - Right here. - In your jar. - These are going in the good bowl. - Wow, these were so good. - Mmm. - Did we try them all? These are my favorite. - These are really, really good. I don't even know which one's my favorite flavor out of them. - God, you gotta give me your dentist's number, because I need to go after this. - [Ro] I've got a great dentist. He's amazing. - I may be going into so sort of, like... Sugar coma. - Same. - I'm not sure. We may be, posting this grim story from the emergency room after this. - Justine, I'm leaning away from you. - Holiday favorites. (Ro gasping) - [Ro] I love the holidays. - [Justine] Me, too. Oh my gosh. - [Ro] Okay, what? Oh my gosh, they have eggnog. They have candy cane. - Cranberry sauce? Pumpkin pie. - [Ro] Pumpkin pie? (both gasping) - Remember when we tasted all those pumpkin flavored things? (laughing) (dramatic music) (smacking) - It taste like a naked Dorito. - They're really good. And I was like, come over. I have a few pumpkin things to try. I had like 26 things. - [Justine] A smorgasbord. - I was like, oh sorry, I hope you were hungry. Oh my gosh! Okay. - Ooh. (dramatic music) I'll put that one away, to never be tasted again. I don't like it. - That doesn't... - It doesn't taste good. It was like a spicy rot. A spicy rot. Hmm. - Ick, ew. - We're over it, ew! - Over it. - Pew, gross! - [Justine] Candy cane. - [Ro] Okay, candy cane. You better not a little mess up nit. - Oh, yeah, that's nice. - Mmm, that's really nice. - It's like a piece of candy cane. - Mm-hmm. - Tastes like a piece of gum. - It's nice after you just have kind of a weird tasting one. - Yeah, it really cleanses. - It kind of cleanse, yeah. It's, hoo, nice and fresh, okay. - So eggnog, I don't really like eggnog to being with. - See I like eggnog. - So you tell me if this tastes like eggnog. - Okay, I have a really good eggnog cake recipe. - Oh. - It's delicious. (dramatic music) - It's fine. - Actually, I'm gonna give it a medium. - It's fine. - It's like... - I'm not that into it. - Mm-hmm. - I'm not gonna be like, wow, I really wishing I had some eggnog jelly beans right now. - No, no, it's not bad. - Cranberry sauce. - I love it. - Oh! - I couldn't-- - Let's-- - ruin everything. - Make a jelly bean cranberry sauce. - I have a great recipe for these, too, by the way. Just throwing it out there, everybody. It's fresh, it's good. That just tastes like a cranberry. - It does! - But like a candy cranberry. - Yeah, they're super sweet. - What do we have next? - We have one last one. This is our final bean. (Ro gasping) - The final bean! - And it's hot chocolate. - Oh my gosh! - Ah! Okay. - That is so cute. - Cheers, the final bean! - Little hot cocoa. (groovy music) - Yeah. - Tastes like chocolate. - It does. I have a stomach ache at this point. - Are you serious? (laughing) - I thought this would be so easy because they're so small. - Yeah. - But there's a lot of these. - Okay, can I just say, this adds up. - [Justine] This really does add up. - I mean, the amount of sugar we probably just ate is a lot. We probably had a bagful. - No, I don't know, let's not think about it. So I think probably my favorite one was the mojito. I really liked the mojito one a lot. - It was so good, nice and minty. - Yeah. - I liked the pina colada one. And then my favorite bag was the little juices. - [Justine] You guys, if you're gonna get any of these, I would get the juice ones. - Yum! - Those were so good. Also, the size comparison of this bean as opposed to the Jelly Belly ones, they're a little bit bigger. - Yeah. - So you've got a little bit more of a taste per bean. - And you get a lot. (kissing) - I am so glad-- - Justine, this was a great video idea. - I decided not to bring in the gross ones. (gasping) - Should we do a video? - We're gonna have to do a follow-up in three months because I need to detox first. - Okay. - Well guys, thank you so much for watching. Ro, thank you so much for eating all of this sugar with me. - Thank you for bringing this over. I have a major sweet-tooth, so any time you want to try weird candies or any flavors, I'm in. - So-- - Count me in. Call me, I love it. - This is great. Well, go check out Ro's channel; I'll link the description. We have so many fun videos that we've done together. And that's it; we'll see you guys later and let us know if you want us to taste the gross beans. (gasping) - Oh my god. (Justine fakes vomiting) (fakes vomiting) (groovy music)",
    "transcript_keywords": [
        "jelly beans",
        "jelly",
        "good",
        "taste",
        "beans",
        "Yeah",
        "bean",
        "favorite jelly bean",
        "Tastes",
        "love",
        "flavored jelly beans",
        "Beer",
        "jelly bean bowl",
        "favorite",
        "jelly bean taste",
        "flavor",
        "Donut",
        "good jelly beans",
        "great",
        "Grape"
    ],
    "transcript_entity_values": [
        "Welcher",
        "smells-- Girl",
        "one",
        "Amazon",
        "Welchers",
        "Oreo unboxing-- - Yeah",
        "cosmo",
        "26",
        "Champagne",
        "Justine",
        "Ro",
        "Strawberry Daiquiri",
        "Ike",
        "Strawberry",
        "Welches",
        "Sunkist",
        "three",
        "Justine] Champagne",
        "Justine] Ew",
        "the day",
        "the Bean Boozled",
        "Hot Tamale",
        "the Cocktail Classics",
        "Justine] Family-",
        "Mike",
        "Justine]",
        "Mm",
        "a Peach Bellini",
        "five",
        "Oreos",
        "Orange Crush",
        "Justine] Look",
        "Justine] Candy",
        "- Peach Bellini",
        "today",
        "Kreme",
        "Pepper",
        "two",
        "Dorito",
        "Krispy Kreme",
        "Jelly Belly",
        "first",
        "Justine] Alright",
        "French",
        "three months",
        "the Jelly Belly",
        "Ro",
        "Justine] Me",
        "Santa",
        "Grape Crush"
    ],
    "transcript_entity_types": [
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "GPE",
        "PRODUCT",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "FAC",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORDINAL",
        "PERSON",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON"
    ]
}