{
    "id": "irjc1nJ1eJs",
    "title": "Mac Studio and Studio Display: a dream and a nightmare",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2022-03-17T13:00:32Z",
    "video_url": "https://www.youtube.com/watch?v=irjc1nJ1eJs",
    "category": "Science & Technology",
    "tags": [
        "verge",
        "the verge",
        "mac studio",
        "mac studio review",
        "studio display",
        "M1 Ultra",
        "apple",
        "apple display",
        "apple display studio",
        "apple mac studio",
        "apple mac studio review",
        "apple mac studio m1 max",
        "m1 max",
        "m1 max chip",
        "apple mac studio price",
        "mac studio display",
        "apple event 2022",
        "apple event march 2022",
        "mac",
        "mac studio fix"
    ],
    "views": 431155,
    "likes": 12198,
    "comments_count": 753,
    "description": "Apples Mac Studio is heavy, gray, and full of ports. But the really exciting stuff is on the inside. Meet the M1 Ultra, Apples brand-new processor that combines two M1 Max chips into one monstrous CPU. We gave this device to professionals across The Verges creative team. Heres what they had to say.   Apple Mac Studio review:   Studio Display review:    Quick correction! At 9:07 the current MacBook Pro and iPad Pro use a mini-LED display, not micro-LED. Thank you to DGB Antho for flagging   Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. For more information, see our ethics policy here:    You can get the Mac Studio here:   You can get the Studio Display here:    Subscribe: Like The Verge on Facebook: Follow on Twitter: Follow on Instagram:  The Vergecast Podcast: Decoder with Nilay Patel: More about our podcasts:  0:00 Intro 0:54 M1 Ultra 2:30 Mac Studio configuration 3:00 Mac Studio vs Mac Pro for video editing 3:50 Mac Studio for Video, Audio and Illustration 7:32 Studio Display review 11:15 Studio Display speaker comparison 11:54 Studio Display webcam 12:56 Apples response to poor Studio Display webcam quality  13:51 Mac Studio M1 Ultra benchmarks (Geekbench 5, Shadow of the Tomb Raider, Cinebench R23, PugetBench) 16:45 Mac Studio display output 17:10 M1 Ultra vs M1 Max 18:25 Conclusion  Read More: Community guidelines: Wallpapers from The Verge:  Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "https://www.theverge.com/e/22745856",
        "https://www.theverge.com/e/22745785",
        "http://bit.ly/2TQsqjB",
        "https://apple.co/3thCZxl",
        "https://bhpho.to/3JqF67W",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- The Mac Studio, the rare Apple product that doesn't have Pro anywhere near its name. But make no mistake, this device is for pros. It's configurable with up to a 20-core CPU, a 64-core GPU, a 32-core neural engine, 128 gigabytes of unified memory and eight terabytes of SSD storage. It has six USB-C ports, two USB-A ports and HDMI and an SD card slot. It can cost as much as $8,000 and Apple has been clear about the target audience. It's for video editors, photographers, audio engineers, people who need serious power and for whom a MacBook isn't going to cut it. And don't worry, we gave it to those folks. But first, the chip. (lively music) There are basically two Mac Studio models you can buy and they're pretty far apart in price. One starts at 1999 and it includes the M1 Max. Apple announced this chip last year and it's one of the most powerful CPUs you can get. But for the past year, it's only been available in one machine, the MacBook Pro. Apple has finally put this chip in a desktop system, the Mac Studio, which is exciting news in itself. But we have the more expensive Mac Studio that includes Apple's brand new M1 Ultra and this one starts at nearly $4,000. The M1 Ultra isn't a new chip exactly. Apple has essentially taken two M1 Maxes and fused them together. They're not the first company to try something like this. AMD and NVIDIA have both put out dual GPU cards in the past. But the difference is that the Ultra is not actually two GPU's. Thanks to a process called ultra fusion, it functions as one monstrous GPU with twice the CPU cores, twice the GPU cores and twice the memory bandwidth. Now Apple has made some very ambitious claims about how this Frankenchip will perform using various fancy charts that it did not label in any particularly useful way. Most surprisingly, it told us that the M1 Ultra's performance would exceed that of NVIDIA's RTX 3090 while using 200 fewer watts of power. But as we learned last year with the M1 Pro and M1 Max, Apple's lofty graphic claims don't always pan out the way Apple says they will. So we set out to verify just how powerful this thing actually is. So the configuration that we have here has a 64-core GPU, 128 gigabytes of RAM and two terabytes of SSD storage. This is basically the most powerful Max Studio you can buy and it's going to cost you $6,199. Now I could run thousands of Google Docs on this and be very happy but the reality is that I'm not at all the target audience for this device. So I carried this eight pound computer around the Verge office. I plopped it down on various people's desks and I watch them work, you know, as you do. - No proxies, y'all. No proxies. Full res playback only okay because that is the goal and the dream. What up buds, Becca Farsace, video director here at the Verge. - My name's Andrew Marino. I am a podcast producer, audio engineer at the Verge. - What's up everyone. I'm Alex Castro, illustrator at theverge.com. - I'm the lucky Verge employee that gets to use the $17,000 Mac Pro that we purchased and reviewed a few years ago. It's got a 3.2 gigahertz, 16-core Intel Xeon W processor, two Radeon Pro VEGA II graphic cards, 96 gigabytes of RAM and one terabyte SSD. And on paper, it is a total beast. But in everyday use, I find it to be pretty laggy especially in Adobe Premier. Disappointed! - So since I started my career, I mostly been using MacBook Pros almost exclusively. - At home I use a custom Frankenstein of a PC. It has Intel i7 quad core, 32 gigs of RAM and a GTX 1080. And I add 1070 in there. Sometimes I get to use it in certain softwares. - All right, so this entire review you're watching, I decided to edit on the Max Studio M1 Max and M1 Ultra. This project is over 500 gigabytes of footage. I shot on Sony FX3s at 422 10 bit. And y'all, I am, I'm pretty impressed. Generating pfiles hella quick. Damn. Okay. Check this out y'all. Just kidding. We finished before I could show you. - One of the things I was really impressed with was the oil brushes in Photoshop. Photoshop has this kind of graphics engine/brush engine that calculates the wetness of certain paints and brushes. And it's supposed to blend different features of the brush basically. On any other computer I've ever used, It's been super slow. You hope you get the effect that you want within five clicks basically or else you're chugging along and waiting for things to load. But with this, it was actually happening in real time. Something I've only ever seen happen and like procreate on the iPad Pro. - I'm usually running multiple programs for podcasting at the same time and that's where I see a lot of slowdown in my computer. So what I've noticed with the Mac Studio is I wasn't even thinking about is this gonna slow down my computer? Is this taking too long to export? It all just kind of worked. So think a machine like this in my daily process would change everything. I feel like... - Especially stuff like the Photoshop brush is actually working. Like that's a whole feature set. That's very hard to utilize in Photoshop unless you have a really good machine. And if you just had something like this, you could focus on quality over trying to save performance all the time. - But performance isn't even the best part about this computer. No, no, no. If you're coming from the Mac Pro, you certainly have this dongle on the top of it. It's an SD card slot. But buzz, this right here, look at this, look at this. Look at this. Look at that. I'm tempted to say thank you Apple, but come on, that was a huge miss on the Mac Pro. - Above all else, I have this iLok dongle that is USB-A that I need to plug in to a computer to run most of the software I'm using. So, thank God it is on the Mac Studio. - Here it is rendering a graphic and after effects side by side with the 2019 iMac with a Core i9. Even to an amateur like me, the Mac Studio looks blazing fast. I asked all these creators for the biggest improvements they saw over their current systems and they basically all said everything. Exporting, rendering, scrubbing, brushes across the board, the experience was incredible. Our creators tried both the M1 Ultra and the M1 Max. And the general consensus is that the M1 Ultra was a bit faster but it didn't necessarily feel $3,000 faster and it certainly didn't feel twice as fast. These are both extraordinary chips. And while people loved using the Ultra, everyone did feel that the Max would also be sufficient for their current work. A big part of that is that Adobe's Creative Suite is running way better on Apple systems now than it ever has before. Premiere Photoshop, Lightroom and Media Encoder are all running natively on Apple Silicon. And we are finally able to combine the absurd power of Apple's chips with editing software that's designed to run really well on them. The other huge benefit the Studio has over a MacBook is its massive Studio Display and I know someone who has a lot to say about that. - I am one of the many display nerds here at the Verge and I was really excited to dive into the Studio Display which is basically the only other 5K display on the market right now besides the old and finicky LG UltraFine. We have two Studio Displays, the standard 1599 model and the 1899 model with Apple's nano texture matte glass which I will say smudges at the slightest provocation. Both have the stock stand. Adding height adjustment costs another $400 for some reason. Unfortunately, there isn't much to nerd out with on the display itself. It is very similar to the 27-inch iMac display that Apple sold for years and only just discontinued with the introduction of the whole Mac Studio line. The Studio Display is the same 27-inch size, the same 5120 by 2880 resolution, the same 218 pixels per inch, the same 60 hertz refresh rate and the same standard single zone LED backlight. The only real spec difference is that Apple says the Studio Display now has a typical brightness of 600 nits versus 500 on the iMac. But in real world use, that's pretty hard to see. Compared to Apple's other displays across the Mac, iPhone and iPad lineup, the Studio Display is actually most notable for the things it doesn't have. Apple's high-end products all have displays that can produce true blacks in various ways. OED screens on the iPhones, local dimming on the Pro Display XTR and micro LED display backlights on the MacBook Pro and iPad Pro. The Studio Display has none of that. It's a regular old LED backlight and the darkest black it can produce is basically a very dark gray. Here's the local dimming test video we usually use. You can see how the Studio Display doesn't do any local dimming. The Studio Display is also notable for being an SDR display with no HDR modes to speak of. Apple's high-end iPhones, iPads and Mac laptops all support HDR. But the Studio Display tops out at 600 nits and Apple doesn't offer an HDR mode in the software at all. Really the only reason to chase after this display for the screen itself is if you desperately care about having a 5K display that can show Mac OS at pixel perfect resolution with no scaling. Some of you care about that a lot and $1,600 sounds totally reasonable considering the only other option is that buggy LG UltraFine that costs $1,300. For those of you that don't care, $1,600 sounds ridiculous and there are lots of other fascinating displays to think about including a number of neat Ultrawides and plenty of displays that support higher refresh rates. The other reason you might want to be thinking about spending 1599 on the Studio Display is the webcam, mic and speakers of which Apple is very proud. There's an entire A13 chip powering the audio and camera system here same as the iPhone 11 and the camera itself is a 12 megapixel sensor with an F/2.4 lens that's theoretically comparable to the front camera on an iPhone or an iPad. There are six speakers, four woofers and two tweeters and Apple says they support spatial audio. The mic and speakers sound great. You can adjust to the three mic array to do voice isolation or not in control center and you'll sound is good or better on calls as any conference spikes I've ever heard. The only reason you might need something better is if you're regularly recording podcasts or streaming to an audience on Twitch or something. The speakers are loud and deep and better than any other built-in speakers you'll find. Here, take a listen. They made you feel like it was do or die But no. Oh no. Look more you push they pull it. It's made your journey fuller. And still to sacrifice your life all right. Oh! Oh! Oh! Oh! Oh! Oh! Oh! - The bad part is that I have no idea what's going on with this webcam. Apple has a long history of producing amazing images with 12-megapixel sensors and A-series chips. And here, this thing just looks bad. Actually, it looks bad in great light like we have now and downright miserable in low light. I've tried it on the Mac Studio and on my MacBook Pro running Mac OS 12.3. And no matter what, it produces grainy, noisy images with virtually no detail. I tried it in FaceTime. I tried it in Zoom and PhotoBooth and QuickTime. You name it, it's the same image. Turning off the center stage feature that follows you around the room doesn't help. Turning portrait mode on and off doesn't help. I've obviously asked Apple about this and the company's looking into it. But until there's an explanation, I simply wouldn't want to use this camera. The cameras on the M1 iMac and the M1 MacBook Pros are simply better and the front camera on an iPhone is obviously better still. So that's the new Studio Display. If you are adamant about having a 5K display connected to your Mac, you'll think the price is in the realm of reasonable. If not, I think you're probably better off looking elsewhere. Hey everybody, it's Nilay. I'm coming at you from the Studio Display the night before the review. This is the mic. This is the camera. It's still pretty sunny outside. I'm sitting in front of a window and this is what it looks like. Now through the course of the review, I've been asking Apple what's up with this image quality. And just now, the night before the review, the company sent along a statement. I'm gonna read it to you. We looked into the images you shared and discovered an issue where the system is not behaving as expected. We'll be making improvements and a software update. That's it. No timeline on when that update might arrive. No details on what it might improve. Now the rule at the Verge has always been we review what's in the box. We can't take into account the promise of a potential software update in the future. We just look at what we got. So when that update comes out, we'll let you know. But for now, this is what this webcam looks like. (lively music) - Apple in its keynote claimed that the M1 Ultra would outperform NVIDEA's RTX 3090, the most powerful consumer desktop GPU on the market today. And I'm gonna be honest. I have no idea where Apple is getting that. We ran Geekbench Compute, which tests the power of a system's GPU on both the Max Studio and a gaming PC with an RTX 3090, a Core i9, 10900 and 64 gigabytes of RAM. And the Mac Studio got destroyed. It got less than half the score that the RTX 3090 did on that test. Not only is it not beating in video's chip but it's not even really coming close. On the shadow of the Tomb Raider benchmark, the RTX was also a solid three frames per second faster. Now the Mac Studio is not a gaming PC and very few people are going to buy it to game. But the Tomb Raider is a GPU heavy program and it's been used as a proxy for GPU performance for several years. If the Ultra can't keep up graphically here, it's not clear to me that there's anywhere where it will outclass the RTX 3090. On the other hand, in CPU performance the M1 Ultra is in a class of its own. Compare this to our Mac Pro model with an Intel XEON W and across our CPU benchmarks, there was really no contest. The XEON is outclassed. In fact, the Ultra was so dominant in Premier that I could find very few higher scores in the Puget system's database. It's beating threadrippers left and right. It's beating almost everything. Our $12,000 PC with a 32-Core Threadripper 3970X did slightly beat the M1 Ultra on Geekbench multicore but the Ultra was much, much closer to the Threadripper than it was to the XEON. That's a really big achievement considering that the Mac Studio is small and nearly silent whereas Pro over PCs have way more cores and they're massive and loud generally. Part of this is that in CPU tasks, the M1 Ultra really is about twice as powerful as two M1 Maxes. On the multi-core benchmarks in Cinebench and Geekbench, the M1 Ultra was consistently getting double the scores of the M1 Max. Now a double benchmark score doesn't always translate to double the performance in the real world. We ran a bunch of benchmarks in Python to simulate scientific use cases and on almost everyone, the Ultras and the Max's scores were very, very similar. And while the Ultra did outperform the Max in every real world task we ran, it wasn't doubling its scores. There are clearly some bottlenecks here that aren't just based on throughput. At the end of the day, Mac Studio is still a full system with RAM, storage and IO, not just a chip. Apple also said that the Mac Studio would be able to support up to four Pro Display XDRs and a 4K TV at once. I couldn't find four Pro Display XDRs but I did plug in one XDR, two Studios, one 4K Dell monitor and a TV. It was very confusing, but it did work. So if you have four monitors and a TV lying around, that option is on the table. (light music) So I'm sure people are wondering whether the M1 Ultra is worth the upgrade over the M1 Max and here's my honest answer. The Ultra is faster but the difference won't be massive unless you are consistently running well threaded workloads that scale to every available CPU core. Everyone else will need to decide how much a small performance improvement is worth. Ultimately, the professionals here saw it as a benefit but not an essential upgrade. So, what are the drawback here? The most obvious one is the price. This thing as configured is over $6,000 and that's a lot but compared to the $17,000 Mac Pro we have, it's still a hell of a deal. The Mac Studio is faster than the Mac Pro. it's smaller. It has a better port selection. It uses far less power and it's a fraction of the price. And there's also the matter of the GPU. If you wanna play graphically intensive games or you're running a heavy computing load that relies on a heavy duty GPU, the M1 Ultra is not the obvious choice. The scores that put up on those sorts of tasks were not particularly impressive. These are all very legitimate reasons that the Mac Studio won't be the right computer for all kinds of people. Personally though, after having used the thing, I can't bring myself to care about them all that much. The most impressive thing about this product to me is that everything works. The Verge has been reviewing Apple computers for of the past decade. And in many of those reviews, we've said things along the lines of this is a nice computer but the software isn't ready. That was what we said about the Mac Pro back in 2020. It seemed to work fine but the Adobe Creative Suite wasn't optimized for it and people were turning over all sorts of glitches that broke their workflows. We ran into fewer but still some issues with first M1 MacBook Air when that came out and that didn't happen here. What I did see was creator after creator being blown away by how much more they could get done on this machine. This is why companies innovate. This is why manufacturers like Apple put out slightly more powerful versions of the same computers and this is why people keep buying them every year. It's so that people can make more and do more and make it and do it better. It's so the things we do, the things we watch and read, the things we love can all be better. Ultra fusion is not a kooky new idea that Apple is wasting our time with. Companies have been trying to mush two GPS into one for over a decade and Apple finally did it. This computer is a historic achievement but perhaps more importantly, the M1 Ultra is a glimpse at the future because we all know that at some point there's another Mac Pro coming and I'm quite excited to see what Apple Silicon can do in a truly high end system. - Can I just say one more thing? Apple keeps calling displays like this edge to edge but y'all, there is a half inch of bezel here. I'm looking right at it, a half inch of bezel. Now I care about you and I know you're excited but this has to stop. Words have meanings.",
    "transcript_keywords": [
        "Mac Studio",
        "Studio Display",
        "Mac Pro",
        "Studio",
        "Apple",
        "Mac",
        "Ultra",
        "Display",
        "Pro",
        "Max Studio",
        "Pro Display",
        "Pro Display XDRs",
        "Mac Studio models",
        "Pro running Mac",
        "Mac Studio line",
        "expensive Mac Studio",
        "Mac Pro model",
        "Mac Pro coming",
        "massive Studio Display",
        "powerful Max Studio"
    ],
    "transcript_entity_values": [
        "Twitch",
        "Ultra",
        "this eight pound",
        "AMD",
        "LG UltraFine",
        "3.2 gigahertz",
        "M1 Ultra",
        "The Studio Display",
        "Andrew Marino",
        "1,300",
        "three",
        "FaceTime",
        "SDR",
        "K TV",
        "iMac",
        "5",
        "the end of the day",
        "iPads",
        "CPU",
        "20",
        "1,600",
        "thousands",
        "every year",
        "the iPad Pro",
        "A13",
        "the M1 Ultra",
        "iPad Pro",
        "PhotoBooth",
        "One",
        "422 10",
        "Studios",
        "Puget",
        "12 megapixel",
        "64",
        "12,000",
        "1599",
        "Studio",
        "Geekbench Compute",
        "1899",
        "Intel Xeon W",
        "RAM",
        "the M1 Pro",
        "218",
        "XEON",
        "Ultra",
        "Tomb Raider",
        "iLok",
        "Max Studio",
        "the Mac Studio",
        "Adobe Creative Suite",
        "GPU",
        "iMac",
        "M1 Max",
        "Geekbench",
        "USB",
        "The M1 Ultra",
        "Verge",
        "two terabytes",
        "over $6,000",
        "12-megapixel",
        "MacBook Pro",
        "2020",
        "the Studio Display",
        "Photoshop",
        "iPad",
        "27-inch",
        "Intel XEON W",
        "17,000",
        "Alex Castro",
        "NVIDEA",
        "MacBook",
        "32",
        "K Dell",
        "IO",
        "first",
        "96 gigabytes",
        "the M1 iMac",
        "M1 MacBook Air",
        "the Max Studio",
        "nearly $4,000",
        "Threadripper",
        "MacBook Pros",
        "last year",
        "M1 Maxes",
        "Becca Farsace",
        "a half inch",
        "the Mac Pro",
        "LG",
        "Lightroom",
        "The Studio Display",
        "128 gigabytes",
        "64 gigabytes",
        "1999",
        "the Studio Display",
        "10900",
        "less than half",
        "Frankenchip",
        "Creative Suite",
        "Adobe",
        "12.3",
        "Ultras",
        "Studio Display",
        "Apple Silicon",
        "Media Encoder",
        "The Mac Studio",
        "4",
        "SD",
        "2019",
        "400",
        "USB-C",
        "M1 Max",
        "second",
        "five",
        "GTX",
        "Intel",
        "Ultra",
        "2880",
        "200 fewer watts",
        "the Mac Pro",
        "Mac Studio",
        "Frankenstein",
        "5120",
        "one",
        "Mac",
        "Geekbench",
        "Apple",
        "500",
        "the M1 Ultra's",
        "four",
        "Python",
        "iPhones",
        "Cinebench",
        "Ultrawides",
        "the Studio Display",
        "today",
        "Mac Pro",
        "the M1 MacBook Pros",
        "1080",
        "six",
        "60",
        "3090",
        "a few years ago",
        "years",
        "XDR",
        "the MacBook Pro",
        "several years",
        "the past decade",
        "MacBook",
        "3,000",
        "6,199",
        "two",
        "the past year",
        "the Tomb Raider",
        "over 500 gigabytes",
        "Core",
        "eight terabytes",
        "Sony",
        "the Mac Pro",
        "Google Docs",
        "SSD",
        "NVIDIA",
        "Max",
        "600",
        "iPhone",
        "Mac",
        "16",
        "HDMI",
        "as much as $8,000"
    ],
    "transcript_entity_types": [
        "PERSON",
        "NORP",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "PRODUCT",
        "ORG",
        "PERSON",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "DATE",
        "PRODUCT",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "LOC",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "MONEY",
        "QUANTITY",
        "ORG",
        "DATE",
        "FAC",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "MONEY",
        "PERSON",
        "ORG",
        "FAC",
        "CARDINAL",
        "ORG",
        "GPE",
        "ORDINAL",
        "CARDINAL",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "MONEY",
        "GPE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PERSON",
        "QUANTITY",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "NORP",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "ORG",
        "PERSON",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORG",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "DATE",
        "DATE",
        "ORG",
        "MONEY",
        "MONEY",
        "CARDINAL",
        "DATE",
        "ORG",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "ORG",
        "EVENT",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "MONEY"
    ]
}