{
    "id": "IrWfhbqURC4",
    "title": "This GPU cost $15,000 and there’s only ONE like it – 3dfx Voodoo 5 6000",
    "channel": "Linus Tech Tips",
    "channel_id": "UCXuqSBlHAE6Xw-yeJA0Tunw",
    "subscriber_count": 15900000,
    "upload_date": "2023-05-07T17:00:03Z",
    "video_url": "https://www.youtube.com/watch?v=IrWfhbqURC4",
    "category": "Science & Technology",
    "tags": [
        "gpu",
        "3dfx",
        "voodoo",
        "voodoo 5",
        "6000",
        "sli",
        "quad",
        "AGP",
        "prototype",
        "glide",
        "directx",
        "direct3d",
        "ross tregemba",
        "VSA-100",
        "nvidia",
        "ati",
        "s3",
        "matrox",
        "rendition",
        "gaming",
        "pixel shader",
        "vertex shader",
        "shader",
        "anti-aliasing",
        "original",
        "hank semenec",
        "retro",
        "classic",
        "windows 98",
        "win98",
        "graphics",
        "multi-gpu",
        "history",
        "benchmark"
    ],
    "views": 1916923,
    "likes": 62772,
    "comments_count": 2173,
    "description": "Check out the $14.99 Minnow set and the $19.99 Moray set at:   3dfx was the king of the graphics card world in the 90s, and in a flash they were gone. The Voodoo 5 6000 was the last GPU 3dfx produced, and released  Could it have changed the face of PC gaming?  Discuss on the forum:   The deal fell through and this card is still for sale! Contact Ross at voodoo56000prototype[at]gmail.com  Purchases made through some store links may provide some compensation to Linus Media Group.   GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   SPONSORS, AFFILIATES, AND PARTNERS:   OUR WAN PODCAST GEAR:   FOLLOW US  ---------------------------------------------------  Twitter:  Facebook:  Instagram:  TikTok:  Twitch:   MUSIC CREDIT --------------------------------------------------- Intro: Laszlo - Supernova Video Link:  iTunes Download Link:  Artist Link:   Outro: Approaching Nirvana - Sugar High Video Link:  Listen on Spotify:  Artist Link:   Intro animation by MBarek Abdelwassaa  Monitor And Keyboard by vadimmihalkevich / CC BY 4.0  Mechanical RGB Keyboard by BigBrotherECE / CC BY 4.0  Mouse Gamer free Model By Oscar Creativo / CC BY 4.0   CHAPTERS --------------------------------------------------- 0:00 Intro 1:17 What makes this so special? 2:13 Firing it up and Half-Life 1 4:40 Tribes 2 5:58 3DMark 2001 7:22 The prototype isn't the only way to play 8:04 It was doomed to failure 9:03 Why was 3dfx even successful? 11:52 3dfx got complacent 13:29 Forced to compete without a competitive product 14:11 The doors close and Nvidia takes over 14:52 Conclusion - Competition is good",
    "description_links": [
        "https://www.ifixit.com/LTT",
        "https://linustechtips.com/topic/1505531-this-23-year-old-prototype-video-card-has-four-gpus%E2%80%A6-and-it-works/",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/partners",
        "https://lmg.gg/wanset",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.tiktok.com/@linustech",
        "https://www.twitch.tv/linustech",
        "https://www.youtube.com/watch?v=PKfxmFU3lWY",
        "https://itunes.apple.com/us/album/supernova/id936805712",
        "https://soundcloud.com/laszlomusic",
        "https://www.youtube.com/watch?v=ngsGBSCDwcI",
        "http://spoti.fi/UxWkUw",
        "http://www.youtube.com/approachingnirvana",
        "https://www.instagram.com/mbarek_abdel/",
        "https://geni.us/PgGWp",
        "https://geni.us/mj6pHk4",
        "https://geni.us/Ps3XfE"
    ],
    "transcript": "- The owner of this GPU was recently offered $15,000 by a collector. Why? I'll tell you why. Because it's a ridiculously rare artifact from the early days of 3D gaming. The bad news is the collector wasn't me. I know. (baby crying) The good news is that I got my hands on it anyway. (people cheering) I know right? When the deal fell through, the owner, Ross, agreed to drive it up to Canada for us to show it off. And as luck would have it, it actually works. This is the real deal, guys. A very late stage prototype of what would've been 3DFX's final flagship card, the Voodoo 5 6000. And this one has even been reworked by a former 3DFX engineer to reach what we believe would have been the final spec. Could this beast of a quad GPU card have saved 3DFX and change the face of gaming as we know it? Probably not. But that doesn't mean that we can't fire it up and relive our wildest dreams from a parallel universe and fire up this message from our sponsor. iFixit. Learn more about the extremely portable and affordable Minnow and Moray sets and how they can make your repair life easier at the end of this video. What makes this card really special is that it's straight from 3DFX themselves, making it the best glide gaming experience on the planet. I mean, yes, we showed recently that you can emulate 3DFX hardware on a modern PC, but so far, you can only go up to the Voodoo 3. You wanna go faster, you're gonna need better metal. (man grunting) Let's ride. Not being a 3DFX historian myself, I wasn't a hundred percent sure what to expect. I can tell you that I didn't expect an external DC barrel jack, though. Okay, sure. Rather than just putting a bigger cooler on the front, you just add these little heat sinks to the back of where the dies are soldered. I guess. Man, I wish we'd done this video even like six months ago. You guys would've been so impressed by the size of this card, but now that the 4090 exists, it's like, eh. Make up for it with your personality. Here we go. It's loud. It's right next to my mic. Wish I'd thought of that. Hey, nice. Athlon XP 2200+. Oh no, no floppy disc! Is everything working right now? Like, capture's working and everything? - [Producer] Capture is working. - This is so exciting. World of Warcraft 1.12.1. I mean surely we can't play WOW on this. - [Producer] Yeah, it didn't like that. - Should we play Half-Life? If you have a 3D card that incorporates the Voodoo 2 or Banshee chipsets, you will want 3DFX Mini Driver. Let's go. That is some mighty fine screen tearing. The latency is great and this is butter smooth. If I had to guess, and this is gonna be pretty tough 'cause I'm on a 60 hertz display, I would say probably 100 to 150 frames per second. Like it feels very, very low- Oh, get back here. (man vocalizing) Imagine having this kind of money for a computer back then. - [Producer] And like $600 for one of these things. - $600 GPU. But it runs like I just- - [Producer] Now it's worth noting that this is a game from 1998. - Yeah, right. So this game came out a couple of years before this even had reached the prototype. Whoa, hey, hey, hey. Stop that. - [Producer] Yeah, hence the Voodoo 2 and Voodoo Banshee notes in the option screen, there. - Ah. Okay, this thing absolutely blows away what I would've been using at the time. I know, obviously it looks like crap by today's standards, but I wouldn't have been able to believe my eyes if I had seen this back in 2000. Can I just say how painless this was for a prototype graphics card? - [Producer] I don't think it was very painless to get it working to begin with. - Well, yeah, but it's painless for me now. - [Ross] Yeah, so go to console and then \"timedemo\" as one word, space, blowout. - Okay, here we go. Ooh, look at it go. We're gonna find out what the FPS was and this is a much more demanding scenario than what I was looking at. Now I feel like I underestimated it. 119 frames per second. Okay, let's try tribes. A Voodoo card has been detected. If you experience oddities, you should try the WickedGL drivers at wicked3d.com. (intense music) (keyboard clacking) Oh, (beep). So first of all, 1024 by 768, right? - [Producer] Yep. - Bit depth 16, right? - [Producer] Can be 16 or 32. - Well, let's go 32. Let's go. Okay, I mean obviously we're just gonna crank everything to high, right? - [Producer] What could go wrong? - Let's see how many FPSs we get here. Plenty. We're getting shot down boys. Bro, no! Oh wait, did I actually die? Oh, seriously? Okay. How do I make this go away? - [Producer] I think it's just paused you while it tells you about everything. - Oh, come on. Oh, hey, here we go. Got something to fight. Flay Master, let's go. What the crap am I even firing? It's a bouncing ball. Oh my goodness. Bounce it up the thing. Oh, I got one. It's running shockingly well. That is to say, the performance is great on that era games and it's kind of problem free as far as I can tell. Four flipping GPUs. Um. Benchmark. I mean, she's running it. - [Producer] Yep. - This is about what I remember this looking like. I remember this second run through. Oops, uh-oh. Okay, mostly problem free. I thought this was pulled from an actual Matrix game at the time. - I don't think so. - Are you sure? - [Producer] I don't- You're making me doubt myself. - [Linus] I mean the reflections are all looking okay. - [Producer] Kind of. - Nope, you're totally right. It's just a Matrix inspired demo. - [Producer] So I shazamed you? - Okay, hold on a second. \"Faster than a Ferrari and more reliable,\" that PC world ad in the bottom? Love it. (person laughing) I remember this running a lot better on hardware a couple of years later. - Oh, boy. - Yikes. - [Producer] I think software rendering would be actually faster. - Oops. No hardware support. - [Producer] Rip. - We'll talk about that later. Oops, no hardware support. - [Producer] Just doesn't do bump mapping at all? - Talk about that later. Not yet. Pixel shader. No hardware support. - Rip. - Hey, 2647 3D marks. Let's go. There it is. - [Producer] Yep, that's why it was so slow. If you ran 2000 it would actually like probably be pretty good. Basically, NVIDIA having that was a killer app for them. - What a cool trip to 3D gaming Christmas past. But believe it or not, this isn't the only time machine. There are other brand new Voodoo 5 6000s that are available today for a fraction of the cost of this one. Russian modder, Anthony ZX64 has made a name for himself refurbishing and modding vintage GPUs. And the Voodoo 5 6,000 rebuild is his crowning achievement. Not only did he build his reproduction with only a non-working prototype for reference, he actually improved the design by doubling the VRAM to 256 megabytes. Though it should be noted that Anthony recommends using the onboard jumper to fall back to 128 megs to improve compatibility with older games. Genuine 3DFX hardware or not though, this thing was wicked fast at the time, even if the truth is that the Voodoo 5 6000 was destined for failure before it even got to this prototyping phase. See, here's the thing. 3DFX had a wealth of experience using multiple GPUs together to make FPS number go up. But the fact is the single GPU competition was getting good, really good. And in 2001, the GeForce 2 and Radeon 8000 showed up with both strong performance, and a new technology that would radically change the graphical fidelity of video games: shaders. This meanwhile, lack shaders, and was expected to cost an estimated 600 US dollars at retail. Unthinkable at the time, even if it sounds pretty good today. So as amazing as it was, that's a turd that absolutely will not polish. But how did 3DFX get to this point? They were the undisputed kings of the 3D gaming space from 1996 onward. To understand that, we have to understand why they were the kings, because it's not like they were the first. Incumbents like Matrox, ATI, and S3 had their own 3D boards and Rendition's Verite series came out at around the same time. And unlike 3DFXs early cards, none of those required a separate video card just to run the 2D desktop. Two GPUs? One for 3D, one for 2D. 3DFX actually came into this market with a huge disadvantage but what they had was as perfect a blend of features and performance as you could possibly expect at the time. Not only did the Voodoo 1 support a faster fill rate than its competitors, it had hardware support for Z-buffer depth information, bilinear texture filtering, anti aliasing, and it boasted higher resolution, higher color output. These are all things that other cards either relied on the CPU to do for them, or just straight up couldn't do at all. Which meant that you could run a much lower tier processor, like even a 486, and still get an enjoyable 3D experience. I mean, to be clear, unlike today, a dedicated 3D accelerator wasn't necessary to play most games, but if you used full software rendering, you'd be stuck at super low video quality. I'm talking 320 by 240. 256 colors if you were lucky. Voodoo to the rescue, then. And a big part of their special sauce was the way that they wrapped these advantages into a relatively easy to program package with the Glide API. Remember guys, this is in the days before direct 3D or widespread open GL support. So each vendor had their own API that game developers needed to support. But Glide was surprisingly similar to Open GL in both syntax and feature set, limited, though it was. So if a game developer had to program in support for each vendor's API, while they were far more likely to support Glide over say, S3D or Red Line. This almost immediately gave 3DFX a special place in the hearts of gamers, even if the API was proprietary. 3DFX then subsequently enjoyed a virtual monopoly in the 3D gaming space, while the competition either made expensive gambles or sat with their development effectively on pause while they waited for the first direct 3D specification. The NV1, for example, from NVIDIA used a wildly different rendering mode than Direct 3D would eventually use, forcing NVIDIA to scrap their NV2 and then start playing catch up. But while 3DFX became well known for their robust feature set, easy development, and their multi GPU scan-line interleave, or SLI, which allowed for higher frame rates and resolutions than anyone else, success seemed like a paralyzing force for them. And by the time of the Voodoo 3, things started to take a turn. With direct 3D and clearer open GL specifications to target, the competition was catching up and fast and in some cases even surpassing 3DFX's offerings. For example, NVIDIA's RIVA TNT2 brought competitive performance, 32 bit color rendering, and maximum texture sizes that were eight times larger than the Voodoo 3, which could still only display 16 bit color in game. Meanwhile, 3DFX, rather than investing in GPU R&D, invested in a litany of side projects and attempts to stave off the competition. The failed bid to provide chips for the Sega Dreamcast was a major blow that ended in a lawsuit and while the terms weren't disclosed, Sega had intended to purchase the rights to use 3DFXs technology so as to prevent the competition from being able to, and it's likely they got their way. You can get your way, by the way, with a desk pad from lttstore.com, same price, any size, and now available in our stealthy circuit pattern. And, while they didn't know it then, 3DFX'S 1998 purchase of their biggest board partner, STB Systems, ended up being not the monopolistic takeover of the market that many feared, but rather the beginning of their end. In effect, it changed 3DFX's relationship with their board partners from chipset provider and partner, to competitor, which incentivized their partners to support the real competition, primarily NVIDIA and ATI, whose rapid hardware development cycles became popular with system integrators like HP and Dell, which 3DFX had no interest in catering to. So without chips going into game consoles and with their board partners mutinying and taking over the system space, 3DFX was left in the unenviable position of relying on only the enthusiast segment as their customers. And better options were now beginning to emerge for them, as well. Perhaps seeing the writing on the wall, 3DFX purchased Gigapixel in mid 2000, after that company lost its bid to provide chips for the original Xbox. The idea, it seems, was to finally get their next gen GPU rampage across the finish line. That GPU had been in development since 1998 and had it released when 3DFX would've liked it to, it's possible that they could have stayed competitive with the GeForce 2 that they were staring down in 2000. Unfortunately for them, their creditors were fed up by year's end, voting for bankruptcy and liquidating the company. NVIDIA would go on to acquire all of their intellectual property. Pretty bitter pill to swallow. The parallels between 3DFX's downfall and NVIDIA's behavior lately is kind of ironic if you think about it. 'Cause they've been going down a very similar path, antagonizing their board partners, diverting attention to side businesses, like crypto mining autonomous vehicles, machine learning, you get it. But fortunately for NVIDIA, it seems like they've got a wide enough mode around them and enough cash on hand to weather pretty much an apocalypse. And there are no existential threats to them like 3DFX faced during their decline. At least not yet. This, my friends, is why competition is so important in the industry because it can and will light a fire under a company that's grown complacent, like 3DFX did. If they'd had less debt, if they'd gotten the Sega contract, or simply made different decisions, who knows what might have happened when the competition heated up? A 3DFX forced to compete while they still could might have survived. Unfortunately for this timeline, they chose the Voodoo 5 and I choose this segue to our sponsor. iFixit. If you're constantly on the go, iFixit's Moray and Minnow kits are for you. iFixit's pocket sized toolkit, the Minnow, is just $14.99. It features a magnetized case that's easily opened and doubles as a built-in sorting tray. It has 16 different bits and the handle has a built-in sim eject tool. And if you're in the need of something bigger, the Moray driver kit is only $19.99. It's got 32 different bits with extended reach necks and best of all, every iFixit kit, regardless of the price, comes with a lifetime warranty. So check out our links in the description and buy yours today. If you enjoyed this video, go check out our video on the 3DFX Voodoo 2 SLI gaming setup for a little more on just how good 3DFX used to be and how much they allowed to slip through their fingers.",
    "transcript_keywords": [
        "Voodoo",
        "GPU",
        "NVIDIA",
        "support",
        "card",
        "time",
        "hardware",
        "competition",
        "game",
        "hardware support",
        "GPUs",
        "gaming",
        "video",
        "Hey",
        "Voodoo card",
        "good",
        "API",
        "Yeah",
        "games",
        "Voodoo Banshee"
    ],
    "transcript_entity_values": [
        "one",
        "5 6,000",
        "Minnow",
        "486",
        "eight",
        "One",
        "DC",
        "mid 2000",
        "fed",
        "Christmas past",
        "GPU",
        "2647",
        "Dell",
        "1",
        "just $14.99",
        "FPS",
        "2000",
        "GL",
        "Canada",
        "Anthony",
        "1998",
        "SLI",
        "six months ago",
        "Linus",
        "256",
        "Four",
        "the Glide API",
        "a couple of years",
        "Sega",
        "256 megabytes",
        "iFixit",
        "Banshee",
        "768",
        "first",
        "RIVA",
        "32",
        "2001",
        "320",
        "Ferrari",
        "1024",
        "S3",
        "32",
        "3DFX",
        "Verite",
        "2D. 3DFX",
        "STB Systems",
        "Direct 3D",
        "CPU",
        "the early days",
        "Voodoo 5 6000s",
        "3DFXs",
        "60",
        "TNT2",
        "3D marks",
        "Red Line",
        "240",
        "Warcraft 1.12.1",
        "Ross",
        "HP",
        "Matrix",
        "Rendition",
        "Radeon 8000",
        "16",
        "GPU R&D",
        "3D",
        "jack",
        "a hundred percent",
        "ATI",
        "3DFX Mini Driver",
        "600",
        "Matrox",
        "only $19.99",
        "119",
        "API",
        "Russian",
        "second",
        "600 US dollars",
        "100 to 150",
        "128 megs",
        "Two",
        "year's end",
        "today",
        "NVIDIA",
        "the days",
        "15,000",
        "Flay",
        "4090",
        "a couple of years later",
        "Moray",
        "Gigapixel",
        "Xbox",
        "2",
        "GeForce 2",
        "the Voodoo 3",
        "GL",
        "an estimated",
        "1996"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "PERSON",
        "QUANTITY",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PRODUCT",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "MONEY",
        "CARDINAL",
        "ORG",
        "NORP",
        "ORDINAL",
        "MONEY",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "ORG",
        "DATE",
        "MONEY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE"
    ]
}