{
    "id": "iRYP7zaXeBM",
    "title": "Let's Talk Megatouch (Because It's Dying!) - Krazy Ken's Tech Misadventures",
    "channel": "Computer Clan",
    "channel_id": "UCQ6fPy9wr7qnMxAbFOGBaLw",
    "subscriber_count": 493000,
    "upload_date": "2022-03-24T15:59:47Z",
    "video_url": "https://www.youtube.com/watch?v=iRYP7zaXeBM",
    "category": "Science & Technology",
    "tags": [
        "Let's Talk Megatouch (Because It's Dying!) - Krazy Ken's Tech Misadventures",
        "Linux",
        "Megatouch",
        "Arcade",
        "Arcade Game",
        "Gaming",
        "3D",
        "Graphics",
        "Touchscreen",
        "Merit Industries",
        "Video Game",
        "Computer",
        "PC",
        "Hard Drive",
        "Megatouch Maxx",
        "Megatouch Maxx Sapphire",
        "Krazy Ken's Tech Misadventures",
        "Krazy Ken",
        "KKTM",
        "Comedy",
        "Humor",
        "Tech",
        "Funny",
        "Computer Clan"
    ],
    "views": 159805,
    "likes": 5572,
    "comments_count": 606,
    "description": "Sign up with Linode today and get a 60-day $100 credit   You can support this channel on Patreon! Link below Let's talk about Megatoucha once successful touchscreen video game line. Now that it's dying off, we must preserve these beautiful machines and share them with the world-wide web!  Check out our rare tech playlist   Download our epic wallpapers   Support our channel and get cool stuff    Follow us on Twitter   Like us on Facebook   Shop for cool stuff on our store   Hey! We're on Discord    Support the Computer Clan on Patreon   Patrons got early access to this episode. They also got behind-the-scenes access, Discord VIP access, and their names in the credits! Pledge now to get those awesome perks, and help fund the future of the Computer Clan! Thanks for your support.   Contact Us    Get royalty-free stock footage with Artgrid. Sign up with my link to support the channel and get 2 extra months free:   I also use Artlist for the music in my videos. I highly recommend them  Click for 2 extra months free:   Get film gear Ken uses   On a lower budget?    Computer Clan is an Amazon Associate. Amazon links are powered by the Amazon Associates Program.  #KrazyKen #ComputerClan",
    "description_links": [
        "https://linode.com/computerclan",
        "https://bit.ly/clan3zlKXX9",
        "https://thecomputerclan.com/wallpapers",
        "https://Patreon.com/KrazyKen",
        "https://twitter.com/thecomputerclan",
        "https://facebook.com/computerclan",
        "https://thecomputerclan.com/etsy",
        "https://thecomputerclan.com/discord",
        "https://Patreon.com/KrazyKen",
        "https://thecomputerclan.com/contact",
        "https://bit.ly/clan2Dr3M3e",
        "https://bit.ly/clan2LBaKov",
        "http://amzn.to/2hmJhHU",
        "https://amzn.to/2hLrJBL"
    ],
    "transcript": "- Before iPads and smartphones were the mainstream way (intense ambient music) to play touchscreen games, the Megatouch was one of the best ways to experience this type of play. Unfortunately, the company is now defunct so there's not many of these around anymore. So we'll have to dive into this rare gem ourselves. Sponsored by Linode. Hey guys, how are you all doing? If you're new here, welcome. My name is Krazy Ken, and yeah, earlier I said we need to dive into this gem, I did not plan that pun. Yes, it's a Sapphire unit but that was totally a coincidence, please believe me. So the Megatouch was one of my favorite game machines to play when I was a kid. When they were at a restaurant and I saw one, I always got so excited. They were also at a lot of bars. So that was kind of awkward, me being a little kid at the bars, but don't worry, my parents were there, it was all good. And another fun fact, this thing actually runs a custom version of Linux. But before we get into the hardware, who actually made this thing? the short answer is Merit Industries Incorporated. They date back to 1975, another Merit source says 1977, but either way, they go back a long way. And one of their first games was Four Play. It was a video poker type game. And the first Megatouch came out in 1994 and many other versions came out afterward. It was a very successful machine. So Megatouch gained popularity. And over time through a bunch of business moves and acquisitions and stuff, I really can't explain, it's hard to track the history of this thing, the Megatouch property ended up being part of AMI Entertainment Network. And then in 2013, Megatouch was spun off into its own LLC, simply named Megatouch LLC. And then everything shut down in 2014. They ceased production, they offered limited technical support, but no more products from 2014 on out were being made in the Megatouch line. And on top of that, I can't find much information about Merit on the internet in general. When you look them up, you get the AMI Wikipedia page. And even that page is only like two paragraphs long. I think it's kind of a bummer that they kind of just died off the face of the planet 'cause at one time they were so fricking popular. So what I wanna do today is revive some of that popularity. So now let's take a look at the hardware. We'll even open this thing up and then we'll take a look at the operating system and the hidden menu, if you will. And then of course we gotta play some games. Let's go. So this particular Megatouch is a Maxx Sapphire 2 unit. It came out in 2004 and I believe the original Sapphire came out in 2003. And what I really love about this design, not only is it a nice like swivel bar top design, but it's blue and yellow. I just like that color combination, the contrast looks really cool with the blue color on the side and this nice yellow T-molding, and overall, this is in pretty good condition considering its age. Plus, you know, it was in a smoke filled bar for a long time. In fact, I got it from one of my buddies who refurbishes these things, it's so cool that people take the time to refurbish these things 'cause no new ones are coming out. So thank you guys. So you have this decal on the side here, it actually could peel off, it's not like printed right onto the side here but down there, there's also the patent number plate and there's also a plate with the serial number and the model number on it. So these machines are heavy. Not only because they're a big case with a CRT but they need to be weighed down a bit more because you don't want your bar patrons just walking away with them. The machines are expensive, yes, but there's also money inside of these machines. So they are purposely heavy. The cabinet units, the full cabinets that stand on the floor, those can weigh upwards of 250 pounds. So yeah, they're beasts. The lock is not in this current system because I have it set on \"Freeplay\". And this is the massive collection of components that holds all of the bills and all of the change. And it connects to the Megatouch through this interface, right, and that's how it communicates with the rest of the computer. And then on the inside, we'll talk about this more in a bit, there's a calibrate and set up button. The calibrate button lets you recalibrate the touch screen in case something goes wrong, and the setup button brings you to a hidden menu that's hidden behind this thing because you don't want your normal patrons just getting into that. So it's supposed to be hidden and quite literally under lock and key. So another thing you don't want your bar patrons to have easy access to is the inside. So there's a key right here to make sure no one can get in, except for who you want get in. And we're gonna take a look. And on the inside, you know, it's what you would see inside a typical computer, there's a lot of the same parts but there's one really special thing we'll talk about. So here we have the motherboard, power supply, down here is the hard drive, it's not the original hard drive that was in it, that one actually died. All the high scores got wiped out but still it was how having problems. The CRT is back here. There's also a little board right there for adjusting the CRT settings, like contrast, and there's additional labels like warnings on, hey don't store stuff inside of here. I mean it does get warm. There's also serial number labels and a label showing you instructions on how to remove the lid. I also like seeing dates on here, copyright 1999, Merit Industries Incorporated. But actually this board is what's important. This riser card has the key on it. Without this key, none of the games work. So that's how Merit verifies, hey, you're the actual owner of this, you're not pirating it. So that key lets all the games function properly. And without it, it's just a door stop. And you have other ports on the board here, like the VGA, that's how you get at video to the CRT. And this port right here is for the touchscreen controller. That's what actually tells the computer, hey, your finger is going here, trigger this thing in the software. So that's pretty important too. All right, so we'll close it up and then we'll boot it up. (machine beeps) All right, nice little beep there. And let's just enjoy the Linux boot up sequence here. Phoenix bios, all right. There's been a lot of Phoenix computer stuff in my life recently. I'm looking at you Apple. Merit Linux. There we go, uncompressing Linux. Okay, booting the kernel. I just love some of the language in these Linux startup sequences, it's just like, okay, booting the kernel. Megatouch Maxx, nice beveled graphics. And here we are at the main menu. So bar patrons could tap on the categories and choose games but there's a couple other little buttons here. If you tap the Merit logo, you actually get a little bit of a explainer here talking about the Sapphire release which is this particular Megatouch. And if we go to options here, we can even see stuff about Merit. This is actually where I got some of the information about Merit's history. They have some backstory and stuff here. But this is just what's on the surface, there's actually a whole hidden interface that owners of Megatouches can use to change things. Now, when I was talking about the coin bay earlier and showing you that button in there, that's exactly what I'm talking about. Press \"Setup\" and loading. So now we're behind the scenes here. This is where the bar manager, whoever can change things, credits, pricing, the volume but also you can just look at the books, 'cause again, this is for a business, it's for bar owners to make money. So if you take a look at the books, you can actually look at how much money the machine made over time, even broken down to categories. Cash settlement collection. I don't even know what balance to split. I don't even know what that means. Maybe because it's set to free play, it's at minus $2,000. I don't know. Wow, I really don't know how to run a business. This is great. So there's an erotic mode in this thing, it's in a bar late at night, there's gonna be some people that wanna play those types of games, but you maybe don't want those games showing all the time. So you can actually set a timer for it or you can just manually turn it on and off. So if you go to games and I think it's under options. Yeah, there it is. \"Enable erotic games\" and you can choose partial nudity or full nudity and you can set the timer when it's on and off between certain hours of the day. Because we're mostly a semi family friendly channel, we're just gonna turn that off. So here you can change the graphics and show certain things at certain times like, hey, happy hour special, buy two beer, get three beer. I don't know it. Edit. Krazy Ken... Brent, did you (censored beep) with this thing? - [Brainiac Brent] I may or may not have. - You. - Put some ad slides in. - Oh my gosh, \"Krazy Ken is a Conquest hack. (chuckles) His scores are whack.\" Full disclosure, I didn't cheat, man. Those are all my legit scores, I'm just really good at the game. What else did you do on here? \"Did you know that you put a hotdog in a flashlight, nothing happens\". Well, anyway, this is actually good, 'cause now I don't have to build a graphic from scratch. \"Krazy Ken is a Conquest hack. Go play a real game, like Mystery Phrase\". I actually haven't played Mystery Phrase yet. That might be a good one to do today 'cause I have no practice with that one. There's actually sales and operator presentations in here as well that teach people (upbeat ambient music) about the features because these are kind of expensive machines. I don't remember how much they sold for back in the day, but they're also made to make money. So you gotta have sales people to convince, restaurants and bars to actually take this stuff in. And it's like a cool little pitch with graphics and texts. Earnings example, $1,292 per week equals $67,184 in yearly revenue. So it's just kind of cool that the sales pitch is all built into here. All right, game time. I'm gonna start with my all time favorite game on the Megatouch-Conquest. I played this a bunch when I was a kid. This alien guy. Yeah, I'm about to eat his lunch. Although his lunch is probably very gross. The concept is simple, you try to move your little player next to the opposite color player and that opposite color turns into your color and you try to conquest the board. I actually had a really good board sweep recently, I was really proud of that. Oh man, this is a close game, 18 to 19. Oh, I might be off my game a little bit. I think it's because you guys are watching me, I'm just nervous. I'm gonna jump here, get these three. No, I'm now open, crap, I probably shouldn't have done that but now he's gonna be open here. Sometimes it's just a bit of back and forth. Oh, hey, does anyone have a quarter I can insert? Okay, this is really close. I'm gonna have to jump, which one's gonna give me a better shot? I think this one. 22 to 20. Oh gosh, it's gonna be really close and one, oh yeah, suck it. 24 to 20. Okay, I'm glad I actually did okay. I had a feel like I was gonna like rush it when I was in front of you guys and mess up. Did I get on the scoreboard? I didn't even get on the scoreboard. I played this game clearly too much. This Krazy Ken guy is so good, I couldn't even get 10th place, whatever. Royal Flash, this is a fun one. It's like a quick fire sort of Texas Holdem game. All right, my high score is 160,120. I don't think we're gonna beat that but we're gonna try, you ready? Here we go. Trying to concentrate here. Club, I'm just trying to get flushes here. Okay, speed bonus, let's see what we got, times 370, and okay. Oh, okay, 58,090, round two. And we're gonna add the scores together. Also huge shoutout to like old-school textured graphics with bevels. I just love the nostalgia and these types of interface designs. All right, here we go, round two. Spade, heart, heart, heart club, club, diamond. We're running out. Oh, that got lucky right there. Let's see what we got. See if you just go fast, you get a really good speed bonus. So okay, it doesn't look like we beat the high score but still a decent score I think. 105,000, I'll take that any day. Golfing, this is a fun one. If you want your customers to spend a lot of money, have them play a long game like, oh, I don't know, 18 holes of golf. I'm not gonna do all that tonight, because I don't wanna bore the crap out of you. Eh, yeah, no, we'll do this driver and we'll do that nice windows ding sound, don't you love that? We'll try to get it like over 100%. And I think that's the spin control. We'll try to do no spin. I don't know how golf works. 129 yards away, so let's try to aim for a perfect 100%. You can overdrive it in the red there, but let's go for a perfect 100, pretty close and boom. Did we overshoot it? A little bit. Little bit. 151 yards. Okay, little too much. Oh, there's the gopher. It's rough out here, or out there. Thank you Caddy Shack, thank you for interrupting my game. Now my concentration is all over the map. Get in the hole, baby. Okay, I don't think we're hitting par on this one. I was three feet away. Oh, come on. That was so close. Nice and easy. Get in the hole. There we go. All right, let's see what else we got on here. Four Play. Oh no. - Oh no. - Oh no. We're oh no'ing, because the AI in this game, I suck at beating him. I've beaten him once in my entire life. All right. Round one. There's the little AI guy. This like peacock son of a. Oh no, wait. Oh, he's doing the other face because he knows I beat him. Right, I don't know. No, I did it, oh, shit, it was right there. That's what it was, oh, I got distracted by my own thinking. I was about to beat him. All I had to do was go there. Oh, geez. I really suck at games, man. This is why I don't play 'em. Oh no, he won. There we go, he's doing his face. He knows he beat me, he's gonna go right there. (upbeat ambient music) Don't roll your eyes at me. I almost won, I just wasn't paying attention. Okay, redemption time. I can't go there. Oh (censored beep), I was not trying to. (grunts) I was trying to point, not actually press the screen. (upbeat ambient music) That's the epitome of The Krazy Ken Curse right there, just Murphy's Law has got nothing on it. A game I really like to play was Puck Shot. It's virtual shuffle board basically. Ah, nice butt crack, I feel better already. He just incinerated his puck. Idiot. Let's go through it. - What do you call that? - Oh. Oh, he is at 21 now, this is getting interesting. Let's try to knock him out, or give him more points, that works too. Cheap shot. Oh, they put a knife in my puck. What the hell? Nice Hannah Barbera sound effect right there. That was a cheap shot. (upbeat ambient music) All right, so we're mostly semi family friendly channel, but cleavage of all the games, it's an air hockey game that has the boobs in it. But yeah, I think they're trying to send a little bit of a message here, they're like literally hanging into the air hockey table. And anyway, let's play some air hockey against her and she's beating me. - Ooh. - Hey, no, no, I'm off my game, I got this, I got this. - Does that count? - Yes, it does count, you shut your face. Oh yeah, I got. - Did I do that? - You actually did, 'cause I didn't even touch the puck. I love how our hand is just like floating there. That's beautiful. Per Brainiac Brent's demands, or as he likes to call it, a suggestion, he wants me to play Mystery Phrase which is kind of like Wheel of Fortune. I've never actually played this before. You can tell he does a lot, because he literally has every score on the board. So I'm gonna try it literally for the first time right now. Okay, letter value, 5,100. Well, I'm gonna start with R. There's two R's. Okay. I'm gonna solve, just kidding, that would be dumb. Hang on, there's gotta be an m, 'cause I'm guessing that's empire. York. The Empire State. (upbeat ambient music) Lovely music. Let's you know you did something right. Let's do this. Player one, that's me. Ooh, there's some letters in purple. Select four letters and a vowel. Well, I'm just gonna do, R-S-T-L-E, Oh gosh, that is really hard. (machine beeping) Busted. Oh, okay. \"Da Lynch Mob\", I. 257,850, not bad for the first try. Number nine on the board! All right. Not bad. This thing is just so much fun to play. If you can find one in public or on eBay or something, I really encourage you to try it out and just have some fun with it. They are quite a rare treat. And I think it's really cool that they run their own custom version of Linux. And you know what else runs on Linux? About 90% of the internet actually, in terms of cloud infrastructure, Linux is everywhere. And of course I gotta thank my awesome friends at Linode (upbeat ambient music) for sponsoring this episode, and Linux based cloud infrastructure is their specialty. You can simplify your infrastructure and cut your cloud bills in half with Linode's Linux virtual machines. Whether you're developing a personal project, building a website or managing larger workloads, you deserve simple, affordable and accessible cloud computing solutions. And that's exactly what Linode is for. Heck, you can even deploy Minecraft and CS:GO servers. And as a thank you for watching my show, I'll give you a 60 day $100 credit when you sign up today. You also receive 24/7, 365 human support, regardless of your plan size. You can choose shared and dedicated compute instances, or you can use your a hundred dollars in credit on S3-compatible object storage, managed Kubernetes and more. To put it simply, if it runs on Linux, it runs on Linode. Visit linode.com/computerclan and click the \"Create Free Account\" button, and I'll give you that $100 60-day credit. And when you do all that, you're also supporting the Computer Clan. So thank you very much. So there is no good Megatouch content on YouTube until today. That's why I'm doing this. I wanted to change that. I think it's a really cool machine that was really popular at one time, but it's been lost to time ' cause the company really started dying off, iPods and iPads and like other touch screen devices and smartphones kind of just took over. And I feel like these awesome guys got a little bit buried. So I just wanted to bring them to the surface again and show you how cool these machines can be. So thanks for coming on this nostalgic time travel trip with me and feel free to subscribe for more tech episodes coming out every week. I love making episodes about rare and retro tech, new tech and of course scam tech. (upbeat ambient music) And hey, if you like this episode, you know what to do. Thanks, and I'll see you next time. Catch the crazy and pass it on.",
    "transcript_keywords": [
        "Megatouch",
        "game",
        "Krazy Ken",
        "play",
        "Linux",
        "games",
        "time",
        "Merit",
        "thing",
        "Merit Industries Incorporated",
        "bar",
        "bit",
        "good",
        "Ken",
        "Krazy",
        "yeah",
        "Hey",
        "board",
        "machines",
        "nice"
    ],
    "transcript_entity_values": [
        "Number nine",
        "58,090",
        "24/7",
        "60 day",
        "two",
        "160,120",
        "LLC",
        "a.",
        "20",
        "Freeplay",
        "tonight",
        "Hannah Barbera",
        "129 yards",
        "151 yards",
        "Kubernetes",
        "Merit Linux",
        "105,000",
        "four",
        "one",
        "67,184",
        "between certain hours of the day",
        "18",
        "a hundred dollars",
        "AI",
        "1999",
        "2004",
        "2014",
        "Texas Holdem",
        "Conquest",
        "three feet",
        "Linux",
        "Apple",
        "Phoenix",
        "100",
        "Royal Flash",
        "Brent",
        "60-day",
        "2013",
        "370",
        "100%",
        "I. 257,850",
        "Murphy",
        "Phoenix",
        "1994",
        "first",
        "S3",
        "Krazy Ken... Brent",
        "CRT",
        "100",
        "minus $2,000",
        "Linux",
        "Linode",
        "Mystery Phrase",
        "Megatouch",
        "three",
        "1,292",
        "22",
        "Caddy Shack",
        "Linux",
        "Maxx Sapphire 2",
        "Nice",
        "Merit Industries Incorporated",
        "24",
        "10th",
        "the \"Create Free Account",
        "today",
        "YouTube",
        "Krazy Ken",
        "Megatouch Maxx",
        "Sapphire",
        "only like two",
        "21",
        "Puck Shot",
        "1975",
        "Minecraft",
        "the Computer Clan",
        "About 90%",
        "CS",
        "250 pounds",
        "Megatouches",
        "half",
        "York",
        "iPads",
        "every week",
        "Four Play",
        "1977",
        "Sapphire",
        "eBay",
        "Wheel of Fortune",
        "365",
        "iPods",
        "2003",
        "AMI Entertainment Network",
        "The Empire State",
        "a quarter",
        "R.",
        "5,100",
        "yearly",
        "R-S-T-L-E",
        "Megatouch LLC",
        "VGA",
        "Merit",
        "Megatouch",
        "Linode",
        "the day"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PRODUCT",
        "TIME",
        "PERSON",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "MONEY",
        "TIME",
        "CARDINAL",
        "MONEY",
        "ORG",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "ORG",
        "GPE",
        "MONEY",
        "ORG",
        "PERSON",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "MONEY",
        "GPE",
        "ORG",
        "WORK_OF_ART",
        "ORG",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "WORK_OF_ART",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "LOC",
        "CARDINAL",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "TIME",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "NORP",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "PRODUCT",
        "DATE"
    ]
}