{
    "id": "is5IMELJ1gs",
    "title": "I got your mom an iPad - Apple iPad (10th Generation)",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2022-11-03T20:00:42Z",
    "video_url": "https://www.youtube.com/watch?v=is5IMELJ1gs",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "apple",
        "ipad",
        "tablet",
        "ios",
        "ipados",
        "mom",
        "technology"
    ],
    "views": 541301,
    "likes": 18636,
    "comments_count": 882,
    "description": "Get a dbrand skin or grip case today at   Riley LOVES iPads, so we gave him the new 10th generation iPad to see his thoughts. Does the 1st Gen Apple Pencil make sense? Should you use your iPad outside? Does Riley hate moms? We try to answer these questions and more in this video!  Buy an Apple iPad (10th Generation):   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    SUBSCRIBE ON FLOATPLANE:    GET MERCH:   AFFILIATES, SPONSORS & REFERRALS:   PODCAST GEAR:   SUPPORT US ON FLOATPLANE:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 It's the iPad guy! 0:19 Unboxing 0:35 Initial design and spec impressions 2:44 What else is in the box? 2:56 The Magic Keyboard 3:59 Sponsor - dbrand 4:58 We're not finished with the keyboard 6:27 Why are there missing features? 7:12 Display impressions 7:38 Can you use iPads outside? 8:17 Camera/Mic impressions 9:44 Speaker impressions 10:52 Talking about the Pencil scandal 12:15 Pricing and overall thoughts  14:12 Outro",
    "description_links": [
        "http://shortlinus.com",
        "https://geni.us/TkoNjU",
        "https://lmg.gg/7s34e",
        "https://floatplane.com/ltt",
        "https://lttstore.com",
        "https://lmg.gg/scsponsors",
        "https://lmg.gg/podcastgear",
        "https://www.floatplane.com/",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "- The iPad guy is back, baby. It's iPad time once more, 10th gen. I like talking about iPads. If you watched any of my LTT reviews on the iPad Pro, or the iPad Air, or whatever, you know that I have opinions, and there are some opinions to form about this guy, because they made some changes, let's just say. This is the 10th gen base model iPad. Who packaged this? If this was Apple, I'm writing a letter. It doesn't even fit in there. Just kidding, someone put that back in there. (laughs) This is out. There we go. That's what I want to see. Yeah, it's the 10th gen iPad, and Apple is continuing their design philosophy of taking this, like, flat, square design, and passing it down from the iPad Pro to its children. It's a hand-me-down design. Yeah, it feels good. The bezel situation seems to be very close to what the iPad Air is. You can see there, the bezels are still sort of thick, but we do have this flat design. What do we have on the outside? Up here we've got two speaker grills, a touch ID sensor/power button up top to replace the Home button that used to be down here. On this side, we've got the two volume keys. On the bottom, two speakers, again, and the USB-C port, that's new. This is the last iPad model to be updated with USB-C. It's in the iPad Pro and the iPad Air. There is also no headphone jack. The ninth gen iPad was the last iPad to have that, and now all the new error models do not have a headphone jack anymore. On this side, we've got the smart connector to connect to accessories like that magic keyboard. On the opposite side of the smart connector is, what's this? A camera on the landscape side. This is the first iPad to have that as well. Normally the camera is over here on the top, and now they have made the decision to move the camera to this side, because people are using it in landscape to, like, FaceTime, and stuff. This was the scandal. There are many tweets about the fact that the camera is here now, so that means you can't attach a pencil there. On the iPad Air, and Pro, the way you charge the Apple Pencil, the second-gen one, which is magnetic, is it snaps to this side, but because they put a camera module there, they can't put the charging mechanism there, which means that it doesn't support that second-gen pencil. We'll get into that, and there's a dongle situation. I have thoughts, but that's where the camera is. Also, this is a 12 megapixel landscape ultra, whatever they call it, wide view camera. I think it's 122 FOV. On the back, this used to be an eight megapixel camera, and now it's upgraded to 12 megapixels. So, that's the exterior, and then I don't know what that is. Is it flash? You can blind your family while taking photos. I think I got it. We've got a power adapter and a USB-C to C. We're all C, all the time, except when it comes to the iPhones. That'll change next year though. Are we excited? Now, we don't just have the iPad today. We also have another related thing that has also gotten an upgrade, and some changes, side-grades, I don't know what you call it. It's a magic keyboard, but it's not as fancy as the floaty magic keyboard that the iPad Pros get. That was cool, do you remember that? That was, like, that was shocking. What's wrong with you? Why can't I just have some fun? Ah! And then you put this here, and then, so there it is, keyboard folio. This magic keyboard folio is weird this year. I didn't break it. They just copied the Surface Pro situation. You've got the back part of the folio, and then that's going to snap onto this, but you need the iPad, I guess. The iPad connects, but then you can also snap this guy on. Is that just magnets? Okay, and there's also a kickstand. Is this an Apple Surface Pro? Oh my gosh, I can't wait to do all of my important professional work on this computer right after we talk about our sponsor. Dbrand send us another iPad, and have defaced it in some way, or applied a face, in-faced it, and what am I supposed to do, just look at it? Let's see what they did. It's a dramatic reveal. I'm scared. Ah! What, is this a skin or is this a... (laughing) I just saw it. I just saw it. Maybe you saw it already, viewer. There it is. Short Linus, because he's such a small man. Dbrand skins are made from high quality 3M vinyl that is true texture. The patented adhesive is guaranteed to leave no residue on your device if you want to change the skin. So, that's good, and their grip cases for your phone, or AirPods, or other things, are super durable and fit snug, just like Linus' sandals. Go to shortlinus.com, it's a funny URL, and buy your overpriced stickers today. They spent a lot of money on that URL, so they've gotta make their money back somewhere. They need your help. Please help the poor, poor people at dbrand. The Surface Pro's, you know, wobbly a bit here. It lays flat when you put it down, so you can take the tablet, and just stick it on. Oh, that worked. Sometimes when I come at it from the wrong angle, it won't connect, and then it's connected to the back. This is... You know, Apple's really gone downhill. The next thing is the fact that this doesn't go back very far. Like, if they wanted to be Surface Pro, if they wanted to copy Surface Pro, you know, they have multiple angles, and that's fine, but Microsoft makes such a big deal about this hinge going all the way back. Like, I want to push, I'm gonna push it down. Go. There's one more thing. This thing right here. What is this, a MacBook of some variety? No, it's a magic keyboard for an iPad. Everyone made a big deal about the iPad Pro's magic keyboard not having an escape button, or, you know, these function row keys, but they're here now. This is the weird thing that Apple does with their products is, that they will release a lower tier product after a higher tier product, and the lower tier product will have a more premium feature that the higher tier product lacks until they add it next year. Let's talk about some of the specs while I'm setting this up here. This has the A14 Bionic SOC inside it, upgraded from the A13 Bionic in the ninth gen iPad, but it doesn't have the A15, which was included in the iPad mini, but I can understand this is the base model iPad. This is the one you give your mom, and your mom's not gonna use all that horsepower. Just kidding, I don't want to say it's just for moms. The thing that's missing that's important to point out here, that I have to talk about it now, I was gonna talk about it later, Stage Manager, the big cool new feature for iPad OS where you can have windowed apps, that's not here. They initially were saying that that feature wouldn't come to lower model iPads, because of a limitation with RAM, or the processor requirements, or whatever. So, I'm sure that's what they're saying this time, but it is really weird for them to essentially have iPad OS with all the bells and whistles, a keyboard accessory that turns it, basically, into a laptop, but leave out that feature that makes it more of, like, a computer situation. So, that's weird, and I actually haven't tried it out yet. So, I was looking forward to doing that, and now I can't, and I'm upset, but to make that a little bit better, let's look at the display, because it has been upgraded. We've got a 2,360 by 1,640 resolution, 264 pixels per square inch, which means, I guess, in Apple's logic that means that it's a liquid retina display, which is the same thing as the other iPads, so it's upgraded in more ways than one. The display gets up to 500 nits brightness, which, you're not gonna be using this outside. I hope you're not. You know how you have, like, inside cats and outside cats, the iPad is an inside cat. If you're using your iPad with this stuff, sitting on a park bench, because you have work to do, fine. - That's weird. - No. - That's fine. It's weird, but I'll allow it. But if you're just sitting on a park bench, going like, on your iPad, I'm like, \"Go home, get a room.\" I want to be clear that this is more of a bit than any sort of, like, earnestly held belief on my part, but, hey, comment below if you have thoughts about that. But everyone knows that the coolest thing to do with your iPad is take photos with it while you're lounging inappropriately at the park. Ready guys? Three, two, one. Oh, that was good. Stabilization. Oh my gosh, I'm at the event. I'm at the event, and I've gotta see up front, and I'm holding my iPad up in front of everyone else, so they can't actually see what's going on. They can just see what's on my iPad screen, and, \"Wow, thank you so much, son, for getting me this iPad. I love it. I take it everywhere.\" - [Bell] You really hate hate moms, eh? (laughing) - I bought my mom an iPad. This is... No, okay, I'm gonna put this back on, because this is now a teleconferencing device, and it's even better, because look at this, we're centered. The camera is centered perfectly in the thing. Does it really bother people that much if the camera is over here instead of up here? It's got Center Stage, so I can go, \"Leave, go away, leave me alone. Stop, Apple. Stop following, stop it.\" Apparently, we have this technology that makes it look as if you're looking at the camera. I've heard about that. I didn't know... Is that released? The only time I ever really use Apple products in any real respect is when I unbox them on ShortCircuit. Ready? We're having so much fun. Yay! You could have done better, Jake, my eyes are closed. It's an iPad camera. I've got no complaints. Here is iPad video. Thank you for coming to this video call. I'm disappointed, frankly, in your performance, which is why I put you down here, and I'm up here talking to you. I think I've encountered this before on iPads, but it is super confusing, because when you think about the iPad in portrait mode, where's the power button, up here, right? The volume button closest to the touch ID sensor is volume up. When it's in landscape, it's the opposite. That's really confusing to me as someone who is used to just, like, feeling where the button is, and pressing it, regardless of what orientation the device is in. - [Bell] You're supposed to use your phone landscape. - Anyways, I can get over it this time to continue the crab rave, because I love them so much. (upbeat music) You know, as usual, Apple has, like, the best iPad speakers, or tablet speakers at the very least, and I think even their phone speakers are, like, the best right? What are they doing? What's their special sauce? But I do want to confirm whether these are both speakers or not. (upbeat music) From my very technical testing, I've determined that this is a speaker, and this is not. Can you see that? The screen is, you know, amazing based on Crab Rave, which is our... Well, how we test. Will artists be able to use this instead of, like, the iPad Air or the iPad Pro? Well, that's a good question, one that we're not fully able to answer on this ShortCircuit, but we can talk about the pencil support, because this is interesting. Apple has the first gen pencil, which is right here. Other way... And, you know, when this launched, it was so funny, because the way you're supposed to charge it is by literally inserting it into the iPad like this. So, then your iPad would be sitting there with the pencil sitting out, and then Apple fixed that by releasing the second gen Apple Pencil, which charges magnetically, as I said earlier. However, we've moved the camera over here, which means that we can't magnetically attach the second gen pencil to that side. Instead, it only supports the first gen pencil, but, uh-oh, this iPad has a USB-C port instead of Lightning, so you can't directly plug it in like that. You need the dongle, the $9 dongle. The only other way I could think of them that they could do it, and make a dongle that goes from USB-C to, like, a little charging cradle for the second gen pencil, so then you could just, you know, you could use the second gen pencil. If you're gonna have a dongle to use a pencil anyways, it would make sense to have, like, a dongle that allows you to use the new pencil, but then the question comes up, \"Oh, is there something about the display technology here that also doesn't support the second gen pencil?\" And I am not equipped to answer that question. It might be the case that I'm thinking way too hard about all this. You know, this is the base model iPad. Maybe this isn't, like, the most technically advanced iPad you can ever get, but it comes in fun colors. There's pink, there's blue, there's yellow, or silver, and if I didn't mention that, Horse would kill me, and so, we have to remember at the end of the day, that this is for... You know, this isn't for the pros, this isn't for the people who are like, \"I need a capable machine to draw my professional diagrams, and stuff.\" It's for the people who want one of the cheaper iPads, but if you consider that, that's another interesting thing because this is $450. That's a big jump up from the $329 that the ninth gen iPad launched at. This keyboard folio is $249. This should be way less. This should be like under a $100. This should be under $100 for this thing. I'm sorry. I think that they're overpriced. I think that iPads always will be overpriced, but, like, it's weird. I have this weird relationship with Apple iPads where I think that they're overpriced, and people really shouldn't buy them unless they don't have any other options, and they're not really tech literate, but I love them at the same time. I want use, and I want to get an iPad, and customize it, and use iPad OS, and use Stage Manager. So, this wouldn't be the right one, because it doesn't support Stage Manager, but the platform is really interesting. It's smooth, it's user friendly, it's pretty, and one thing I didn't mention is that this keyboard, you know, it's a magic keyboard, it's a very distinct bump when you type on it. It feels good to me. In conclusion, it's the somewhat similar conclusion to the one that I always do, which is, iPad's are really, really cool. I love playing with iPads. I want Apple to continue making iPads, and I want people, rich people with lots of expendable income to keep buying them, so that they keep developing this form factor. Maybe, eventually, it'll be less expensive. Maybe it'll make a little bit more sense as they keep adding these desktop features, but you should probably still get the ninth gen one, and you should also check out another video from ShortCircuit. Watch one of our iPad videos from recently. Watch my iPad mini one. I talked about how it can be a phone, but not really, so you probably shouldn't use it like that.",
    "transcript_keywords": [
        "iPad",
        "iPad Pro",
        "Apple",
        "iPad Air",
        "Surface Pro",
        "Pro",
        "Apple Surface Pro",
        "iPads",
        "gen iPad",
        "pencil",
        "gen",
        "camera",
        "gen pencil",
        "thing",
        "ninth gen iPad",
        "iPad Pro magic",
        "keyboard",
        "magic keyboard",
        "Apple Pencil",
        "model iPad"
    ],
    "transcript_entity_values": [
        "AirPods",
        "122",
        "iPad",
        "450",
        "The Surface Pro's",
        "FaceTime",
        "iPad",
        "Apple Pencil",
        "10th",
        "Three",
        "Jake",
        "RAM",
        "one",
        "the iPad Pro",
        "Center Stage",
        "249",
        "Bionic SOC",
        "Crab Rave",
        "12 megapixel",
        "the iPad Pro's",
        "2,360",
        "FOV",
        "the iPad Pro",
        "this year",
        "3M",
        "264",
        "second",
        "LTT",
        "the A13 Bionic",
        "next year",
        "Microsoft",
        "Dbrand",
        "iPad Air",
        "A15",
        "100",
        "9",
        "first",
        "the Apple Pencil",
        "Surface Pro",
        "ninth",
        "two",
        "12 megapixels",
        "iPhones",
        "329",
        "iPads",
        "up to 500",
        "USB-C. It's",
        "the iPad Air",
        "iPads",
        "1,640",
        "the end of the day",
        "Linus",
        "ShortCircuit",
        "USB-C",
        "jack",
        "MacBook",
        "eight megapixel",
        "Apple",
        "today",
        "Home"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORDINAL",
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "NORP",
        "PRODUCT",
        "ORG",
        "MONEY",
        "MONEY",
        "ORDINAL",
        "ORG",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "QUANTITY",
        "NORP",
        "MONEY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "FAC",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG"
    ]
}