{
    "id": "ItP9VXYz19A",
    "title": "Insta360 OneX Review - How to shoot TINY PLANET videos!",
    "channel": "iJustine",
    "channel_id": "UCey_c7U86mJGz1VJWH5CYPA",
    "subscriber_count": 7100000,
    "upload_date": "2019-08-24T19:43:57Z",
    "video_url": "https://www.youtube.com/watch?v=ItP9VXYz19A",
    "category": "Science & Technology",
    "tags": [
        "ijustine",
        "how to edit final cut pro",
        "insta360 one x unboxing"
    ],
    "views": 137848,
    "likes": 5289,
    "comments_count": 305,
    "description": "PLEASE SUBSCRIBE:  GET MY PINK iJUSTINE CABLES HERE:   GET MY EDITING PLUGIN:    MUSIC I USE -   FRIEND ME HERE:        MY NEW PROJECT:   PODCAST:       WHAT I USE TO MAKE VIDEOS    CAMERAS: Sony a7 IV -  Sony a1 -   Sony a7s III -   Insta 360 ONE X3 -  Insta 360 ONE RS -  Insta 360 GO2 -   LENSES: New Sony GM 24-70mm ii -  Older Sony GM 24-70mm -  New Sony Sony 20-70mm -  Sony GM 16-35mm -  Sony GM 50mm -  Sony GM 135mm -  Sony GM 85mm -   AUDIO:  Sennheiser AVX Digital Wireless -  Sony XLR Adapter -  Sony Hot Shoe Shotgun -  Tiny Sony Microphone -  DJI Mics -  Rode Podcaster Pro II -  Podcaster Mic -  Elgato Wave 3 Mic -   DRONES: DJI Mavic 3 -  DJI Mini 3 -  DJI Air 2S -   LIGHTING: Aputure 600d Pro -  Aputure Light Dome II -  Aputure Amaran 200d -  Aputure 35in Light Dome -  Aputure Lantern Softbox -   Sony CF Express A 160g + Card Reader-  Sony CF Express A 800g -     These links are affiliate and by using them youre helping out my channel! Thank you!     BECOME A CHANNEL MEMBER:",
    "description_links": [
        "http://www.youtube.com/subscription_center?add_user=ijustine",
        "https://geni.us/wnIN",
        "https://mvfx.co/mKeynote-with-iJustine",
        "http://share.epidemicsound.com/NNNGs",
        "http://twitter.com/ijustine",
        "http://instagram.com/ijustine",
        "http://facebook.com/ijustine",
        "https://tiktok.com/@ijustine",
        "https://snapchat.com/add/ijustine",
        "http://twitter.com/jpig",
        "http://youtube.com/samebrain",
        "https://geni.us/U70407",
        "https://amzn.to/3jScz3h",
        "https://geni.us/mAtruYL",
        "https://geni.us/2mPGn",
        "https://geni.us/8kJHun",
        "https://geni.us/cZGA6ST",
        "https://geni.us/liSjf",
        "https://amzn.to/3DWqJau",
        "https://geni.us/irEgHq",
        "https://geni.us/vwolf",
        "https://geni.us/gxDS",
        "https://geni.us/R46usnU",
        "https://geni.us/diFZAJ",
        "https://geni.us/eaUR",
        "https://geni.us/TfEu",
        "https://geni.us/eqim0",
        "https://geni.us/hjmjD",
        "https://geni.us/pxN9Vw6",
        "https://geni.us/OmAta4o",
        "https://geni.us/6KKHkB",
        "https://geni.us/DXX7",
        "https://geni.us/RU6m",
        "https://geni.us/Ga4H",
        "https://geni.us/RaBW61",
        "https://geni.us/uKRvYQ",
        "https://geni.us/M1MUS",
        "https://geni.us/8I5a",
        "https://geni.us/DOJNEo",
        "https://geni.us/0b4zBFR",
        "https://geni.us/Gku22",
        "https://geni.us/p3RtyR",
        "https://www.youtube.com/channel/UCey_c7U86mJGz1VJWH5CYPA/join"
    ],
    "transcript": "- Hey guys, this video that you're about to watch is a video that I actually will teach you how to edit. Recently, I launched this really cool app that teaches you how to edit in Final Cut, and this is the video that I edited in the tutorial. In the tutorial, I will show you guys everything. How to edit a video start to finish, and I even include all of the footage that I used to make this video. So if you guys want to check it out, I'll put a link in the description, and if you guys enjoy the app, make sure you guys rate it five stars and leave it a really nice review. I will be reading all of them, so thank you guys so much. And now, here's the video that you guys can learn to edit. Today, we are checking out the Insta360 ONE X. This is one of my favorite cameras, and yes, it's a 360 camera, so, you can shoot in 360, but, you can also do things like this. (mellow electronic music) Now, it is time to unbox, and I'll show you guys the camera that made all that happen. (crinkling) So this is the camera. This comes in several different versions, but this one is the Apple bundle that you specifically can get at Apple. And what's cool about this, is it comes with pretty much everything you're gonna need. You can buy the camera just standalone, but this one has a few extra goodies in it. (gasps) Yes! Here it is. This is everything that comes in this bundle. It's great because it comes with a camera, but it also comes with this invisible selfie stick. You can be filming in 360, and all of the footage that you're filming, the stick is magically removed. And this thing actually extends to this long. Not really sure how long that is. This also comes with two extra batteries. And here it is, the camera. (bright electronic music) So this right here is really cool. This is what allows you to get these bullet time shots. This is the bullet time handle, and then you click it on to the bullet time option, and then, you just swing it around! (bright electronic music) There's a little LCD right here. This is the button that you use to take pictures and record video, and this is the power button. Let's see what else we have in here. This seems to be a protective pouch. Lovely. Put your camera right in there and to protect the lens. So it's cool because this camera does connect to wifi, but to connect even faster to transfer your footage, you can use these cables. This USBC, and there's a Lightning cable, and there's a micro USB. There's another really cool accessory that this has, that you can actually put this camera inside of this thing that looks like a football. You put your camera inside of here. You screw it in, just like this, and then, I can't make this up, you throw it. (mellow electronic music) One of my favorite things about this camera is the software that goes along with it, because the camera, yes, is incredible, but the software is so great; because you can take all of the footage that you shoot, import it into your phone, and then edit it right on the fly. This is something that I previously edited while I was in Hawaii. This is the little, tiny planet mode that you can do. You can zoom in, and this gives you a really great example of what it's like, because you can just scroll all the way around, up, down, everywhere. And then, you can use this thing called SmartTrack. So if I wanna just track myself the entire time throughout this clip, I can do that very easily. Click SmartTrack, and now it tracks me the entire time. But, there's also something that's my really, really favorite feature. You basically can reshoot this clip. So you just hold the record button down, and I can move around. And so basically, in real time, I'm editing this video, and I can then save it, share it out, and then, post it wherever I wanna post it. (upbeat hip hop) Thank you guys so much for watching. I hope that you enjoyed this video, and I look forward to making some more for you. So, I'll see you guys on the internet. Bye.",
    "transcript_keywords": [
        "guys",
        "camera",
        "video",
        "Final Cut",
        "edit",
        "time",
        "Hey guys",
        "cool",
        "show you guys",
        "footage",
        "put",
        "bullet time",
        "make",
        "thing",
        "camera inside",
        "Apple",
        "tutorial",
        "Cut",
        "bullet",
        "Final"
    ],
    "transcript_entity_values": [
        "SmartTrack",
        "Hawaii",
        "Today",
        "USBC",
        "five",
        "360",
        "ONE",
        "Final Cut",
        "LCD",
        "USB",
        "Apple",
        "two",
        "One"
    ],
    "transcript_entity_types": [
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "WORK_OF_ART",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL"
    ]
}