{
    "id": "Iucirmc6JjU",
    "title": "World's Smallest Bluetooth Speaker!",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-03-09T23:54:25Z",
    "video_url": "https://www.youtube.com/watch?v=Iucirmc6JjU",
    "category": "Science & Technology",
    "tags": [
        "bluetooth speaker",
        "speaker",
        "bluetooth",
        "wireless",
        "wireless speaker",
        "speakers",
        "bluetooth speakers",
        "audio",
        "smallest",
        "tech",
        "technology",
        "unboxtherapy",
        "review",
        "best bluetooth",
        "best",
        "2015",
        "2016",
        "unboxing",
        "best wireless",
        "does it suck",
        "unbox therapy",
        "apple",
        "iphone",
        "sound",
        "samsung",
        "android",
        "iphone 6s",
        "galaxy",
        "smartphone",
        "6s",
        "iphone 6",
        "bass",
        "android (operating system)",
        "ue boom",
        "apple iphone",
        "beats",
        "mobile",
        "apple iphone 6s",
        "s7",
        "apple inc. (publisher)",
        "phone",
        "new",
        "smartphone (video game platform)",
        "test",
        "s6",
        "plus",
        "iphone 7"
    ],
    "views": 3648781,
    "likes": 55985,
    "comments_count": 3864,
    "description": "Smallest Bluetooth Speaker -   Does the world need a smaller bluetooth speaker?  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1RGLO65",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- What's up, guys? Lou here, back with another video and once again, it's your favorite show here on Unbox Therapy called, \"Does it Suck?\" And of course today, we will be evaluating something that you may think sucks, but it might not, and that's the whole magic of this show. Right here, in front of me, is something that's listed on Amazon as the smallest Bluetooth speaker in the world. Just quotes around everything here. I don't know if there's a smaller one or not, but it is a tiny, little thing here. I have to say, my expectations, pretty slim. Pretty, pretty slim, so let's jump inside and find out what this thing is all about. Now, first challenge here, is of course, finding a way in. I don't know. There we go, okay. Cool. Smart box, camera, music, calls. It does it all. Look at that little guy. How cute. See that there, Jack? Little grill on the top. I'm assuming that's where your audio's going to come from, and then on the bottom side, a button, possibly microphone? And then, a micro-USB jack for charging it up. A tiny little keychain-type deal here. That's it. Wow, no charge cable, nothing. Press the buttons on and off to play, pause, answer calls. Michael, see, I was right. Bluetooth indicator light, charging indicator, micro-USB port. All right, that's it. That's your user manual. Let's hit the button. Uh-oh. The cheaper the product, the greater the likelihood that there will be no charge out of the box. This thing has been sitting on a shelf for a while. Micro-USB cable, here I come. Should I walk back in? Where were we? I'm just back. So, I'm going to hit the power button. (machine music) Isn't that, isn't that the Samsung sound? - [Voiceover] Bluetooth mode. - Flashing blue, I think they snagged the opening chime from Samsung there, Jack. Thanks, thanks for the feedback. The icon here, it's showing as a keyboard on my phone, not a speaker. That's okay. This is the perfect time for some Jeopardy music. (dings) Oh! There we go, okay, cool. We got it this time. Smart box connected. My main thing here is attempting to figure out if this sounds better than the speaker on my actual device, which you can see comparatively there. Still the Blackberry Priv for now, has this speaker here. If this can't beat this, we're going to have a problem. (hip-hop music) It is cute, though. (upbeat hip-hop music) All right, you know what? Eh. This thing's a novelty, that's what it is. You just want to tell people you have the smallest Bluetooth speaker. Maybe you're not going to use as much battery on your phone, if you're using Bluetooth as opposed to the speaker itself. I don't know, but I can't really figure out why you would want or need this. Does it suck? Unfortunately, yes. I think so. I think it could have sounded a little bit better. Calling Jack. (phone ringing) Hello. Anybody home? Chris? - [Voiceover] Hey. - What's going on, man? - [Voiceover] Not much. - Can you uh, can you hear me? - [Voiceover] Kind of. - Kind of, it sounds terrible, doesn't it? - [Voiceover] Yeah. Sounds like you got a cloth over your mouth. (Lou laughing) - All right, talk to you soon, man. Chris don't lie. Never lied in his life. Said, his words, sounded like I was talking with a cloth over my mouth. Not sure how he knows what that sounds like. I'll link it down in the description if you have some creative idea of what you might do with the world's smallest Bluetooth speaker, but I'm saying it sucks. This is probably the most, the single most requested item in Unbox Therapy history. This is the-- (loud single boom)",
    "transcript_keywords": [
        "Bluetooth",
        "smallest Bluetooth speaker",
        "Bluetooth speaker",
        "speaker",
        "smallest Bluetooth",
        "Jack",
        "thing",
        "Unbox Therapy",
        "pretty slim",
        "sounds",
        "pretty",
        "Unbox Therapy called",
        "smallest",
        "box",
        "show",
        "microUSB",
        "back",
        "Suck",
        "sucks",
        "Unbox"
    ],
    "transcript_entity_values": [
        "Amazon",
        "Chris",
        "today",
        "the Blackberry Priv",
        "first",
        "Micro-USB",
        "Bluetooth",
        "Samsung",
        "Unbox Therapy",
        "Michael",
        "Jeopardy",
        "Unbox",
        "Jack",
        "Lou",
        "one"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL"
    ]
}