{
    "id": "iV0eCxj1CRw",
    "title": "A Truly Wireless iPhone?",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-01-13T21:40:56Z",
    "video_url": "https://www.youtube.com/watch?v=iV0eCxj1CRw",
    "category": "Science & Technology",
    "tags": [
        "prong",
        "prong iphone",
        "pwr",
        "prong pwr",
        "iphone",
        "iphone 6",
        "iphone 6s",
        "6s",
        "apple",
        "prong pwr iphone",
        "apple iphone",
        "prong iphone 6s",
        "prong iphone 6",
        "review",
        "case",
        "unboxing",
        "iphone 6s plus",
        "samsung",
        "iphone 6s review",
        "smartphone",
        "tech",
        "iphone (video game platform)",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "smartphone (video game platform)",
        "plus",
        "android (operating system)",
        "apple inc. (publisher)",
        "apple iphone 6s",
        "gadgets",
        "battery",
        "battery case",
        "android",
        "best",
        "test"
    ],
    "views": 1996825,
    "likes": 42684,
    "comments_count": 2559,
    "description": "Prong PWR Case for iPhone 6/6s -   FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://amzn.to/1THLC8R",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "(deep breath) - Wow! - [Man] Feels good. - Wow! There's a whole lung there. A couple of them. - [Man] Yeah. - What's up guys? Lou here, back with another video, and today I've got something that you probably haven't seen before. You might have heard about it, but it does a couple things in one package and as far as I know, this is the only product, the only device that does exactly this. A case/battery back-up/charger in one unit. This guy here has the power prongs built right into the case so there is no separate cable to charge. That's what gets you the name Prong. Prong. Also, the name of one of my favorite animals. You know what animal that is? The Pronghorn. Way up in the mountains, I don't know, the Pronghorn. I always liked it. Up to 100% more battery life. It's a 2600 milliamp hour battery, and all of this in the wake of the Apple battery case that I'm pretty sure you're aware of. The protective case, detachable battery back-up. A micro USB power and sync cable. Audio adapter, blah, blah, blah. Also, an LED charge indicator. That's kinda cool. Let's get this baby cracked open. Live, cord free. What I'm just noticing now, I didn't even know this, is that the power portion, is removable from the case portion. That is cool. Hello power, goodbye cord. Blade, do we have a blade? And, we're not joking around. (laughs) The micro USB that I mentioned, and then a headphone adapter. So this will allow you to put this slim one in there and then, any headphone you want to connect. On the case, we have a micro USB port, in this location here. Button in that location there, I assume that, maybe checks the battery level. Micro USB and then the headphone cutout. A lightening connector. That's what's going to go into the phone itself, and then here is a cutout for the speaker to, sort of, send the audio through. Now one of the side benefits of using a case like this, is that with the Iphone, you have the speaker shooting out the bottom, instead of at you. This redirects it forward, so this grille here means that the audio is shooting at your eardrums. Which is kinda ideal, since your ears do the heavy lifting when it comes to listening. Down, and up. Gotta admit, kinda cool. We're going to insert this into the case. This allows you to use the phone in a slim fashion, with some protection, and access to all your buttons. Then when you want that juice, when you need that juice, slide it in and that's what the package looks like. Now, obviously not the slimmest thing in the world, but you are getting 2600 milliamp hours, and you are getting the flexibility of after you've got that juice or you've charged up your phone, of simply, sliding it out. When you slide it in the volume rockers line up really nice. Now this button on the bottom here, does that? There you go. That starts it up, I guess. The power icon, which it shows that the device is now charging. You could save the battery case for later. This switch here allows you to completely control that. Let us try out some actual charging, because I just wanted to see how this guy fits in there. Like so. This little mini hack of the idea of being your phone charger as well. Now, another cool thing about this is, it kind of acts like a way to prop up your device so if you do have an outlet it your kitchen above the counters, or something. What you end up with here, when you plug it in, is an upright way of looking at your device. This thing is curved, I mean, it fits in the hand. You get a confident grip on that, it's really not that crazy. It looks chunky, but it's utilitarian. I'd probably use it more as a charge dock, and a battery back up optionally. Options, don't hate on options. There you have it guys. The Prong case. The Iphone battery case, with a secret. You could live a cable free life. You guys know I hate cables. You've seen pictures of my set up. I've spent hours hiding cables. There will one day be a wireless future, but until then, go Prong yourself. Or look at a Pronghorn. Thanks very much for watching guys. I appreciate your viewership. If you enjoyed this content, make sure to leave a thumbs up down below, and I will catch you on the next episode. Later.",
    "transcript_keywords": [
        "case",
        "battery",
        "micro USB",
        "battery case",
        "Prong",
        "USB",
        "power",
        "Pronghorn",
        "Iphone battery case",
        "Apple battery case",
        "guys",
        "micro",
        "kind",
        "Prong case",
        "cool",
        "phone",
        "device",
        "micro USB power",
        "Wow",
        "battery backup"
    ],
    "transcript_entity_values": [
        "one day",
        "2600 milliamp hours",
        "Iphone",
        "USB",
        "Up to 100%",
        "Micro USB",
        "hours",
        "Pronghorn",
        "2600",
        "Prong",
        "Apple",
        "Lou",
        "one"
    ],
    "transcript_entity_types": [
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "PERCENT",
        "ORG",
        "TIME",
        "NORP",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "CARDINAL"
    ]
}