{
    "id": "iViNcWNfYBs",
    "title": "Microsoft lied?",
    "channel": "TechLinked",
    "channel_id": "UCeeFfhMcJa1kjtfZAGskOCA",
    "subscriber_count": 1900000,
    "upload_date": "2021-08-05T01:00:06Z",
    "video_url": "https://www.youtube.com/watch?v=iViNcWNfYBs",
    "category": "Science & Technology",
    "tags": [
        "Linus",
        "LinusTechTips",
        "tech news",
        "Riley Murdock",
        "tech",
        "news",
        "Windows 11",
        "Microsoft",
        "upgrade",
        "system requirements",
        "TPM",
        "TPM hack",
        "TPM secure",
        "TPM hacked",
        "Dolos",
        "eligible PC",
        "minimum requirements"
    ],
    "views": 516261,
    "likes": 38150,
    "comments_count": 1006,
    "description": "Get 20% OFF + Free Shipping @Manscaped at     LISTEN TO THE TECH NEWS:  GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      NEWS SOURCES:  ---------------------------------------------------  Timestamps: 0:00 dark magic 0:10 TPMs are hackable 1:14 Facebook shenanigans 2:25 Blizzard President steps down 3:24 Manscaped 3:57 QUICK BITS 4:05 Stadia tech being licensed? 4:33 UK could block Nvidia buying Arm 5:00 Oppo under-display camera 5:23 YouTube Shorts Fund 5:50 US govt has bad cybersecurity  AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  Facebook:     FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  Mac Address:  Techquickie:  ShortCircuit:  LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://manscaped.com/TECH",
        "https://lmg.gg/TechLinkedPodcast",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/7qAhD",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "http://twitter.com/TechLinkedYT",
        "http://instagram.com/TechLinkedYT",
        "http://facebook.com/TechLinked",
        "https://lmg.gg/linustechtipsyt",
        "https://www.youtube.com/channel/UC0KfjyvabuE2J-RBC6ko2Lw",
        "https://lmg.gg/techquickieyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "(shushing noise) - Quiet. To summon the tech news I must perform the ritual. (people laughing) - What's going on? Microsoft's hardware requirements for Windows 11, 11, have rubbed some enthusiasts the wrong way, against the grain, counter to the suede. As they indicate some systems that may be running just fine, won't be eligible for the upgrade. A recent IT-focused video from the company just made things worse with a Microsoft rep saying, \"It 'sucks' that some users won't get the upgrade.\" - Oh, Windows 11 is not eligible for that device. - But for those who will, oh baby, it's going to be the best, off the chain- - [Male Speaker] So it's all fine then. - They're still saying that at Microsoft. Adding fuel to the fire is the fact that security researchers from the Dolos Group just demonstrated a way to defeat a trusted platform module, or TPM security, which is one of the main hardware components that Microsoft claims users need in order to upgrade to Windows 11. - [Male Speaker] Dolos! - Do they really care about security or do they just want you to buy new Windows 11 laptops? Typical dirty company, trying to incentivize customers to buy their products, disgusting. - [Male Speaker] What do you think this is? - A capitalistic society. Speaking of evil corporations, Facebook is researching ways to paradoxically analyze encrypted content without actually decrypting it. A technology known as homomorphic encryption. This could let Facebook engorge itself with your data while also keeping it private. Everybody wins. Strangely the head of Facebook-owned WhatsApp, which uses end-to-end encryption, says they're not pursuing the tech, because, \"That's not how the force works.\" This made Facebook panic, so they tried to distract us by posting the story about how they're making VR headsets that protect your eyes on the outside. - [Male Speaker] What? - This is so cool. - [Male Speaker] That's hilarious. - I forgot all about the fact that Facebook also recently disabled the accounts of NYU researchers, who were studying how political ads on the platform targeted certain demographics. - [Male Speaker] Hey... - Just slipped my mind. Yeah, Facebook says, \"NYU is accessing data that shouldn't be available to third-parties.\" Kinda like the whole Cambridge-analytical thing. But the researchers say that they were silenced because their work calls attention to the spread of misinformation on the platform. And if you get access to real information, Mark wouldn't get to post tone-deaf videos for 4th of July. So there's obviously an incentive there. - [Male Speaker] He uses them to power his hydrofoil. (James laughs) - [James] And after weeks of controversy over claims of sexual misconduct and toxic work culture at Blizzard, the game company's President, J Allen Brack, has stepped down to be replaced by two other executives, Jen Oneal and Mike Ybarra. - [Male Speaker] And now he's gonna make beef jerky. - What? - [Male Speaker] J Allen Brack's beef jerky! - Sweet baby rays. Following Bracks' resignation, Activision Blizzard CEO Bobby Kotick said, \"Ongoing investigations of the company will hold people responsible for their actions.\" But that hasn't given many fans much confidence. Given that old Bobby is seen as being partially responsible for Blizzard's decline since their merger with Activision. - [Male Speaker] Dang it, Bobby. (James laughs) - Regardless, the saga is far from over as some shareholders have joined the state of California in suing the company for failing to disclose the number of HR complaints received over the years. And to make matters even worser, Diablo Immortal, the super highly anticipated mobile RPG game, has been delayed to next year. - [Male Speaker] No! - Ohh! Now it's time for the quick bits, brought to you by, who else, Manscaped, provider of all-in-one men's grooming tools that have you covered from head-to-toe, no matter how close or far apart those things are. Of course anyone can use them, not just men, because hair doesn't discriminate. The Manscaped Performance Package 4.0 Kit is designed to make grooming below the waist easy with The Lawnmower 4.0, and other goodies, like The Crop Preserver and Crop Reviver sprays, to keep things fresh. (sniffs loudly) So head to manscape.com/tech and get 20% off your ball hair. Just kidding, you can shave it all off. 20% off Manscaped and free shipping today. (James groans) - When I'm all done with the big heavy stories, I like to relax with a nice cup of quick bits. Oh, child! A LinkedIn job posting indicates that Google is looking to license the cloud gaming tech built for Stadia, out to other interested companies. So everyone can have negative latency. (everyone laughs) - Whatever. But Google already announced that they were doing this when they shut down their internal game studios. So if anything, this might be an indication that they haven't actually secured any interested buyers yet, which is so weird because Stadia's really... - [Male Speaker] Stadia's got game. - Really good. - Nvidia's acquisition of Arm has still not been approved by regulators, particularly in Arm's homeland, the UK, where the government is considering blocking the deal because of security concerns. (blows raspberry) It's unclear what these concerns might entail, but Jensen is a little too excited on stage sometimes while explaining something super boring, like, \"Sooner just to cloud learning,\" or whatever. Plus he only wears leather jackets, so is he in the Matrix? Is he- - Is he even real? - The One? - [Male Speaker] He's a virus. - [James] APO has announced its second-gen under-display camera technology. And unlike the first iteration, this design might actually result in decent photos. So unfortunately you won't be able to use this camera as an excuse for looking haggard in your selfies. - [Male Speaker] I woke up on the wrong- - Side of the- - [Male Speaker] The tracks. - The Meridian, I'm in China, I have a Chinese phone. Whoa! - [Male Speaker] Ahh! - Just wait for Samsung to do a good job. YouTube has begun its Shorts Fund Program, meaning select YouTube creators can rock these puppies, lavender-colored short pants. Oh, they're below the camera? Oh okay. Whatever. It's not about those shorts anyway. - [James] YouTube Creators can start earning up to $10,000 from the TikToK-style format, which was previously ineligible for monetization. Remember when we made those shorts? - [Male Speaker] I'd rather not. - For TechLink? - [Male Speaker] No, I don't- we didn't do that. - No, we blocked it out. - [James] And a Senate report has given seven out of eight federal agencies bad grades in cybersecurity, with the Department of State, Commerce, Education, Transportation, and Veterans Affairs, all receiving a D, a giant thick D. Homeland Security did okay though, which is probably the most important one to have that right. So Russia can go ahead and hack the others. - [Male Speaker] So what are they gonna get, papers? - They can just use Facebook for that anyway. - [Male Speaker] File folders? (James blows raspberry) And before you give this video a grade, don't, because it's over, and B, we don't have to live in that paradigm, you know, we can be less competitive. But come back on Friday for more tech news and- - [Male Speaker] We don't give grades here. - You'll just get participation points. - [Male Speaker] Yeah, good job, James. - Yeah. - [Male Speaker] Go to detention.",
    "transcript_keywords": [
        "Facebook",
        "Windows",
        "Microsoft",
        "security",
        "company",
        "tech",
        "Blizzard CEO Bobby",
        "Allen Brack",
        "Microsoft hardware requirements",
        "Activision Blizzard CEO",
        "Microsoft claims users",
        "Blizzard",
        "Bobby",
        "Manscaped",
        "game",
        "upgrade",
        "Microsoft hardware",
        "made Facebook",
        "CEO Bobby Kotick",
        "Stadia"
    ],
    "transcript_entity_values": [
        "J Allen Brack's",
        "Senate",
        "seven",
        "Homeland Security",
        "weeks",
        "Windows 11",
        "Stadia",
        "the Department of State",
        "Cambridge",
        "Activision Blizzard",
        "Facebook",
        "One",
        "20%",
        "The Manscaped Performance Package 4.0 Kit",
        "J Allen Brack",
        "Mark",
        "The Lawnmower 4.0",
        "Google",
        "the Dolos Group",
        "Mike Ybarra",
        "Bobby Kotick",
        "WhatsApp",
        "Activision",
        "Diablo Immortal",
        "second",
        "Transportation",
        "Bobby",
        "next year",
        "Arm",
        "Matrix",
        "TechLink",
        "Microsoft",
        "Samsung",
        "Commerce",
        "Friday",
        "NYU",
        "TPM",
        "up to $10,000",
        "China",
        "third",
        "Blizzard",
        "Jensen",
        "first",
        "11",
        "Jen Oneal",
        "Nvidia",
        "Chinese",
        "Facebook",
        "two",
        "Manscaped",
        "Veterans Affairs",
        "the years",
        "UK",
        "RPG",
        "California",
        "Manscaped",
        "Russia",
        "Education",
        "Windows 11",
        "James] YouTube Creators",
        "YouTube",
        "James",
        "James] APO",
        "eight",
        "Shorts Fund Program",
        "today",
        "4th of July"
    ],
    "transcript_entity_types": [
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "DATE",
        "LAW",
        "ORG",
        "ORG",
        "GPE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERCENT",
        "ORG",
        "PERSON",
        "PERSON",
        "PRODUCT",
        "ORG",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "ORDINAL",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "ORG",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "MONEY",
        "GPE",
        "ORDINAL",
        "ORG",
        "PERSON",
        "ORDINAL",
        "DATE",
        "PERSON",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "DATE",
        "GPE",
        "PRODUCT",
        "GPE",
        "PERSON",
        "GPE",
        "ORG",
        "PRODUCT",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "ORG",
        "DATE",
        "DATE"
    ]
}