{
    "id": "IWF2QUCftBc",
    "title": "Motorola Edge Plus hands-on: back in the game",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-04-22T16:00:08Z",
    "video_url": "https://www.youtube.com/watch?v=IWF2QUCftBc",
    "category": "Science & Technology",
    "tags": [
        "motorola edge plus",
        "edge plus",
        "motorola edge plus hands on",
        "motorola edge plus review",
        "edge plus motorola",
        "motorola",
        "hands on",
        "review",
        "flagship phone",
        "new motorola phone",
        "new phone",
        "phone hands on",
        "specs",
        "camera",
        "screen",
        "android",
        "android phones",
        "android hands on",
        "galaxy s20",
        "samsung galaxy",
        "oneplus 8 pro",
        "oneplus 8",
        "technology",
        "gadgets",
        "tech",
        "latest updates",
        "tech news",
        "how to",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 901669,
    "likes": 16759,
    "comments_count": 1168,
    "description": "The Motorola Edge Plus is the company's most powerful phone in years. Motorola is getting back in the flagship phone game and the Edge Plus has specs to match the best Android phones around, like the Galaxy S20 and OnePlus 8 Pro, including a 108-megapixel camera.  Learn more:   Subscribe:  Subscribe to Verge Science:   Read More:  Community guidelines:  Wallpapers from The Verge:  More about our podcasts:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:",
    "description_links": [
        "https://bit.ly/2yCVy57",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://www.theverge.com/podcasts",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX"
    ],
    "transcript": "- You know Motorola, everyone knows Motorola. They've been making phones for years, but the last few years they haven't been making, like, really good phones. I mean, they've been making good phones, but they've been mid-range stuff, two, $300 phones like the Moto G or Moto E series. And they're great, but they're not the best phones you can buy. Until now, anyway. Now they have the Motorola Edge Plus, which is its new flagship, its first flagship in years. And this things' seriously impressive. So let's dive in. (upbeat music) It starts with the screen, which is where the name comes from, that Edge Plus thing. 'Cause it's a regular phone, but then the screen just kinda goes all the way to the edges and then past the edges. Motorola says this actually curves almost 90 degrees down the side of the phone. The screen itself is a 6.7-inch display, which is the largest screen Motorola's ever put in a phone. It's a 21:9 aspect ratio, though, so it actually feels really nice in your hand. It doesn't feel like you're holding this giant, massive slate. The screen has a 90 hertz refresh rate, so everything should look super smooth. Although you can switch that down to only automatically enable, or just run it at 60 hertz in order to save battery life. It's only an FHD+ panel, which is lower than some of the ultra-high resolution displays that we've seen in other phones, but Motorola say that's intentional. It wants to make sure that it can get as much battery life as it can out of it, and that means running it at a little bit of a lower resolution than some of the other competitors. It still looks great, though. Colors are bright, the scrolling is super smooth thanks to that refresh rate, and it's enjoyable to use. (bright music) The edge display isn't entirely cosmetic, though. Motorola's doing a couple cool things with it. So the first is something that they call edge lighting, where the edge of the phone can actually light up when the phone is, say, face-down on a table. So if you get a notification come in or a call come in, the edges'll light up so that you can see from across the room that someone's calling you. It also lights up with alarms or when you plug the battery in. There's also some cool gestures. You can double-tap on the side to turn off the edge display if you just don't like the way it looks in an app, although if you don't like the edge display, don't buy a phone called the Edge Plus, maybe? And you can also use it to swipe between apps. Motorola also says you'll be able to use it as a sort of trigger when playing games, so you'll be able to use it as shoulder buttons if you're running around in \"Fortnite,\" but that's not quite working just yet. The Edge Plus has stereo speakers. There's a speaker on the bottom, which is the main speaker. There's a speaker on top for the earpiece, which doubles as the second speaker for stereo sound. And in the very brief time I've used it, it's pretty loud. Since it's 2020, there's obviously no bezels or notches. There's just a single hole-punch camera in the top-left corner. It's a 25 megapixel camera, which works with the same Quad Pixel technology as a bunch of Motorola's other phones. Motorola hasn't just focused on the screen, though. The entire phone is a top-notch Android device. There's a Snapdragon 865 processor, which is Qualcomm's best, fastest, newest processor. And it also has full 5G support. It actually supports both sub-6 gigahertz and millimeter wave 5G. Motorola says this should be one of the fastest mobile devices that you'll be able to buy. Obviously, we haven't been able to quite put that to the test yet. It's gonna depend a lot on where you live and what kind of 5G connection it is, but they're really going in that this will be a top-of-the-line phone. 12 gigabytes of RAM, 256 gigabytes of storage, a 5,000 milliamp hour battery that Motorola says should last up to two full days. They're really not cutting any corners here, and that includes the headphone jack, still got one. The top-line specs also extend to the cameras, and again, Motorola's not pulling any punches here. The main camera on the Edge Plus is a 108-megapixel sensor. It's the biggest and best camera sensor that you can put in a smartphone. It's similar to the one Samsung's using on it's top-line monster, the S20 Ultra. It can shoot 6K video, and you can either shoot it at a full 108 megapixels if you really wanna crop in and get the details, or you can use it with Quad Pixel technology which shoots at a mere 27 megapixels, the horror. As for the other two cameras, there's also an eight-megapixel 3X zoom telephoto lens if you really wanna zoom in and get close on something, or shoot something from really far away that you'd still like to see at a normal size. And there's 117-degree ultra-wide at 16 megapixels that also has a really nice macro mode. You can really punch in and get some really good details from small stuff, like a coin. Things aren't quite finalized yet with the Edge Plus. The cameras, hardware and software are still being tweaked a little bit, so we'll have to put it to the full test once the device releases for real, but on paper it sounds impressive. The Edge Plus fast charges over USB-C with a wire at 15 watts. You can also fast charge it wirelessly at 15 watts, too, if you have a wireless charger that supports that. You can also wirelessly charge another device like a smart watch or a pair of headphones using the Edge Plus, but that only goes up to five watts. Now for the big number, the price. Motorola's selling this for 999, which puts it about in line with basically every other major flagship phone. In the U.S. it'll only be on Verizon. Motorola says that it's making this decision in part because it wants to rely on Verizon's network, especially its 5G millimeter wave network, which is a particular area of 5G that Verizon has been focusing on a lot more than other carriers. But still, if you don't have Verizon and you think this phone's cool it's a little disappointing to hear, especially in 2020 where we usually don't see these kinds of carrier lockdowns anymore. Right now, it's a new flagship phone from Motorola, which we haven't seen in years, and that's just really exciting. Obviously, we're gonna have to spend a lot more time with this when it comes out to put it through its paces, see if it really does hold up next to the S20s and iPhones of the world. As you might have guessed, we actually filmed this video a few months ago, and in that time Motorola's actually given us the release date for the Edge Plus. It'll be out on May 14th in the U.S. It'll cost, again, $999, and it'll be exclusive to Verizon. Stay safe and keep doing what you're doing.",
    "transcript_keywords": [
        "Motorola",
        "Edge",
        "phone",
        "edge display",
        "phones",
        "Motorola Edge",
        "making good phones",
        "good phones",
        "edges",
        "Verizon",
        "screen",
        "making",
        "put",
        "screen Motorola",
        "years",
        "making phones",
        "flagship phone",
        "Moto",
        "camera",
        "display"
    ],
    "transcript_entity_values": [
        "the Edge Plus",
        "15 watts",
        "90",
        "Quad Pixel",
        "Android",
        "108",
        "one",
        "S20s",
        "the Motorola Edge Plus",
        "The Edge Plus",
        "16 megapixels",
        "999",
        "256 gigabytes",
        "U.S.",
        "Verizon",
        "iPhones",
        "the last few years",
        "60 hertz",
        "5,000 milliamp hour",
        "3X",
        "21:9",
        "a few months ago",
        "5",
        "eight-megapixel",
        "999",
        "Moto E",
        "2020",
        "a mere 27 megapixels",
        "300",
        "years",
        "108 megapixels",
        "hertz",
        "Qualcomm",
        "almost 90 degrees",
        "Samsung",
        "865",
        "May 14th",
        "25 megapixel",
        "two",
        "Motorola",
        "Moto G",
        "6",
        "Edge Plus",
        "sub-6 gigahertz and millimeter",
        "USB-C",
        "Fortnite",
        "second",
        "Verizon",
        "up to two full days",
        "first",
        "up to",
        "117-degree",
        "RAM",
        "6.7-inch",
        "millimeter",
        "12 gigabytes"
    ],
    "transcript_entity_types": [
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "QUANTITY",
        "MONEY",
        "CARDINAL",
        "GPE",
        "ORG",
        "NORP",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "DATE",
        "QUANTITY",
        "MONEY",
        "DATE",
        "QUANTITY",
        "ORG",
        "ORG",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "CARDINAL",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "WORK_OF_ART",
        "ORDINAL",
        "GPE",
        "DATE",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY"
    ]
}