{
    "id": "IXF6JV2fE2E",
    "title": "Your High Speed Internet Might Still Suck (Peering Issues)",
    "channel": "Techquickie",
    "channel_id": "UC0vBXGSyV14uvJ4hECDOl0Q",
    "subscriber_count": 4300000,
    "upload_date": "2021-03-05T18:01:53Z",
    "video_url": "https://www.youtube.com/watch?v=IXF6JV2fE2E",
    "category": "Science & Technology",
    "tags": [
        "internet",
        "speed",
        "latency",
        "peering",
        "transit",
        "settlement-free",
        "netflix",
        "cogent",
        "comcast",
        "level 3"
    ],
    "views": 264472,
    "likes": 19387,
    "comments_count": 1051,
    "description": "Learn through problem-solving, and the first 200 people can save 20% today on Brilliant at   What are peering issues and how can they drastically slow down even the fastest Internet connections?  Leave a reply with your requests for future episodes, or tweet them here:   GET MERCH:  SUPPORT US ON FLOATPLANE:    LTX EXPO:      AFFILIATES & REFERRALS --------------------------------------------------- Affiliates, Sponsors & Referrals:  Private Internet Access VPN:  MK Keyboards:  Nerd or Die Stream Overlays:  NEEDforSEAT Gaming Chairs:  Displate Metal Prints:  Epic Games Store (LINUSMEDIAGROUP):  Official Game Store:  Amazon Prime:  Audible Free Trial:  Our Gear on Amazon:    FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Facebook:  Instagram:  Twitch:   FOLLOW OUR OTHER CHANNELS ---------------------------------------------------   Linus Tech Tips:  TechLinked:  ShortCircuit:   LMG Clips:  Channel Super Fun:  Carpool Critics:",
    "description_links": [
        "https://brilliant.org/Techquickie/",
        "https://twitter.com/jmart604",
        "http://www.LTTStore.com/",
        "https://www.floatplane.com/",
        "https://www.ltxexpo.com/",
        "https://lmg.gg/sponsors",
        "https://lmg.gg/pialinus2",
        "https://lmg.gg/LyLtl",
        "https://lmg.gg/avLlO",
        "https://lmg.gg/DJQYb",
        "https://lmg.gg/displateltt",
        "https://lmg.gg/kRTpY",
        "https://www.nexus.gg/ltt",
        "https://lmg.gg/8KV1v",
        "https://lmg.gg/8242J",
        "https://geni.us/OhmF",
        "https://twitter.com/linustech",
        "http://www.facebook.com/LinusTech",
        "https://www.instagram.com/linustech",
        "https://www.twitch.tv/linustech",
        "https://lmg.gg/linustechtipsyt",
        "https://lmg.gg/techlinkedyt",
        "https://lmg.gg/shortcircuityt",
        "https://lmg.gg/lmgclipsyt",
        "https://lmg.gg/channelsuperfunyt",
        "https://lmg.gg/carpoolcriticsyt"
    ],
    "transcript": "- Have you've ever had the experience where even though it looked like there was no issues on your end for your internet connection, lots of websites are loading extremely slowly or not at all. Or maybe you've even had the opportunity to see the wonders of YouTube loading videos and 144p, despite the fact that you have fiber. Well, if you've tried all the usual steps to fix your connection, like rebooting your router, or adjusting your DNS settings or switching to a wired Ethernet connection, and still nothing helps not even calling your ISP, chances are there's a peering issue to blame. But the heck does that mean? Alright, so because the internet is not one centralized network, it has to work through, different physical networks connecting to each other through some sort of agreement. The largest networks called Tier 1 networks, connect to each other using something called settlement-free peering. What this means is that they agree to carry each other's data without an expectation of payment. Strictly speaking, peering technically refers to no cost arrangements such as these for the purposes of this video, we're using a broader definition where peering refers to any agreement between networks to carry data, including paid agreements. Anyhow, these big Tier 1 networks can reach the entire internet without having to pay for the privilege. For example, our American viewers will recognize big names such as AT&T, CenturyLink, and Sprint, which have Tier 1 networks. However, most ISP are Tier 2 or Tier 3 networks. A Tier 2 network can do some free peering with other networks, but has to pay money or purchase transit to Tier 1 services to access portions of the internet, while a Tier 3 network only purchases transit, and then sells the internet access they bought to consumers. Typically, all this behind the scenes buying and selling results in a seamless experience for the user. Whether you're trying to view a website hosted halfway around the world, or just watch another fine episode of Techliky, but sometimes, a poorly conceived peering agreement, can really gum up the works. You see peering agreements usually include an understanding about how much bandwidth each network can use. If one networks data ends up hitting a bandwidth cap or overwhelming the second network, throttling, and slowdowns can result and that's something you're gonna experience. This famously happened with Netflix when Cogent a Tier 1 network that carry lots of Netflix traffic, had to dispute with Comcast, since Netflix traffic takes up a surprisingly large chunk of internet bandwidth. Its data ended up throttled when it hit Comcast servers before it was able to make its way to viewers at home dear to sheer volume. And because it puts so much load on Comcast, Comcast asked Cogent to start paying for access to its network. As previously the two were connected via settlement free peering when Cogent said law, lol no. Comcast fired back by essentially allowing all that traffic at the interconnection point to bottleneck. And guess what customers got choppy video until the two companies decided to bury the hatchet. But in the meantime, Netflix went straight to Comcast for a better deal and paid for the privilege of hooking up its servers directly to Comcast network, obviating some of the need to buy transit from Tier 1 Cogent there have actually been a number of instances of peering shenanigans over the years, whether it be from one side's infrastructure, not being up to scratch, or business disputes, such as the Netflix example we just discussed. But if you're faced with slowdowns at home because of peering problems, you can try using a VPN and if that doesn't work, well there's not much else you can do other than wait for the problem to get resolved or just switch ISP is because you know what? We all have plenty of those to choose from right. Save us Ilan. Big thanks to Brilliant for sponsoring this video. Brilliant is a website and an app that makes learning accessible and fun. There's no grades, there's no long lectures, there's no strict time limits. They've got over 60 courses on everything from astronomy to programming to Python. With one of the best courses that we suggest being the cryptocurrency course, you can learn the history of how we went from traditional fiat currencies to crypto, how cryptocurrencies are created and just what the heck a blockchain even is. Using Brilliant you can master subjects instead of just memorizing the answers. And one of the best parts of Brilliant is that they have an active community of over 8 million learners and educators today, the first 200 people who head to Brilliant.com/Techquickie will get 20% off an annual premium subscription. So check it out. Thanks for watching guys. If you liked this video, give us a thumbs up, hit subscribe, and be sure to hit us up in the comment section with your suggestions for topics that we should cover in the future.",
    "transcript_keywords": [
        "loading extremely slowly",
        "Tier",
        "networks",
        "peering",
        "network",
        "Comcast",
        "networks called Tier",
        "extremely slowly",
        "Netflix",
        "wired Ethernet connection",
        "internet",
        "loading extremely",
        "Ethernet connection",
        "Cogent",
        "connection",
        "Comcast network",
        "Brilliant",
        "ISP",
        "Netflix traffic",
        "big Tier"
    ],
    "transcript_entity_values": [
        "Sprint",
        "Brilliant.com/Techquickie",
        "ISP",
        "Python",
        "over 8 million",
        "60",
        "AT&T",
        "one",
        "20%",
        "Tier 1",
        "Tier 1 Cogent",
        "YouTube",
        "ISP",
        "Cogent",
        "second",
        "200",
        "DNS",
        "American",
        "today",
        "annual",
        "Comcast",
        "first",
        "Tier 1",
        "CenturyLink",
        "Tier 2",
        "Netflix",
        "Tier 2",
        "two",
        "Ilan",
        "the years",
        "144p",
        "Tier 3",
        "VPN",
        "Techliky",
        "ISP"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "NORP",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "PERCENT",
        "FAC",
        "FAC",
        "GPE",
        "GPE",
        "ORG",
        "ORDINAL",
        "CARDINAL",
        "ORG",
        "NORP",
        "DATE",
        "DATE",
        "ORG",
        "ORDINAL",
        "PRODUCT",
        "ORG",
        "ORG",
        "ORG",
        "PRODUCT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "PRODUCT",
        "PERSON",
        "ORG"
    ]
}