{
    "id": "Ixg3Gz6UR00",
    "title": "Apple’s antitrust fight begins | The Vergecast",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2024-03-22T12:25:20Z",
    "video_url": "https://www.youtube.com/watch?v=Ixg3Gz6UR00",
    "category": "Science & Technology",
    "tags": [],
    "views": 29554,
    "likes": 719,
    "comments_count": 166,
    "description": "The Verge's David Pierce, Alex Cranz, Lauren Feiner and Nilay Patel discuss the breaking news about the the US Department of Justice accusing Apple of operating an illegal monopoly in the smartphone market in an expansive new antitrust lawsuit.  Further reading:    US v. Apple: everything you need to know:   0:00 - Intro  00:49 - The DOJ's Allegations 02:23 - Five key areas of the DOJ's complaint against Apple 05:55  - Super Apps 15:14 - Cloud gaming on iOS 23:48 - Messaging apps and green bubbles 30:17 - Smartwatches 35:04 - Apple's control over NFC and transactions 42:00 - Nilay joins us from vacation 48:59 - Google's market dominance  51:51- Middleware and the future of apps 58:51 - Apple's defense 01:02:18 -  The Open Web 01:13:22 - Lightning round 01:18:16 -  A Super App for babies  Subscribe:  Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Follow on TikTok:   The Vergecast Podcast:  Decoder with Nilay Patel:   More about our podcasts:   Read More:  Community guidelines:  Wallpapers from The Verge:   Subscribe to The Vergecast on YouTube, new episodes on Wednesday and Friday:",
    "description_links": [
        "https://www.theverge.com/2024/3/22/24108557/us-v-apple-antitrust-case-vergecast-podcast",
        "https://www.theverge.com/24107581/doj-v-apple-antitrust-monoply-news-updates",
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://bit.ly/42VeCVU",
        "https://pod.link/430333725",
        "http://apple.co/3v29nDc",
        "https://www.theverge.com/podcasts",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://bit.ly/3I6nJtz"
    ],
    "transcript": "Welcome to the Verge cast, the flagship podcast of the performance smartphone market, which means something. It means we're going to spend the whole show figuring out what the performance smartphone market is, because that's what we do here on the Verge cast. I'm your friend, David Pierce. Alex Kranz is here. Hi, Alex. I'm your friend who is so excited to talk about the news we've got today. Pure, unadulterated chaos. Uh, Nilay Patel is not here. He is, uh, I think last we heard in an airport somewhere, Florida, maybe Florida. I don't know. Nilay is going to come on the show in a little while, um, because he could not possibly ditch the Verge cast. But for now, Lauren Finer's here. Hi, Lauren. Hi. You've had what I would call a couple of days. How are you holding up? I truly have. I'm hanging in there. It's been busy. Yeah, I believe it. So we have a lot to talk about and almost all of it is just about Apple, uh, huge antitrust lawsuit against Apple. We're going to talk about that. Then we're going to talk about that more, and then we're going to do a lightning round and not talk about antitrust law for once. Uh, but let's just dive right in. There's lots to get to here. And I think the first thing we should try to do is just like explain this Messy, long, complicated complaint, as well as we can. So Lauren, at the risk of totally setting you up to do something impossible here, just start at the beginning. What, what happened here today? Yeah, so this morning, the DOJ and 16 state and district attorneys general sued Apple, um, for maintaining an illegal monopoly in the smartphone market. So basically what they're saying here is that, um, Apple has basically made consumers and developers more reliant on their ecosystem, um, through a series of actions. Um, so they say they've done things like disrupt super apps, um, that could encompass a bunch of different programs that would make the stickiness of iOS, um, less for consumers and developers, um, or suppressing the quality of messaging between iPhones and Androids, um, you know, those infamous green bubbles. Um, so there's all sorts of things in this lawsuit, um, that the DOJ is going after and basically just saying that Apple, um, has. abused its dominant position in the smartphone market. Yeah, I feel like I've been trying to think how I would summarize all of this, and there's a ton of details. And I actually think one very useful thing this suit did was sort of divide itself into five categories. And I want to talk about each of those five categories. But I feel like in a lot of cases, it's basically like you either bought your way into a monopoly, which is not allowed, or you have done some kind of shady stuff in order to remain a monopoly, which is also not allowed. This is neither of those things. This is, this is basically like they took all of my complaints about iOS and said, actually, that's illegal. I mean, kind of. And I'm like, I was reading it. I was like, yes, yes. You get it. I hate the green bubbles. Yeah. I should be able to use a different watch. I was like, get it, Cantor. Um, I had the best time reading it. I don't know if it's actually illegal, but I guess that's why we have a court system, huh? Yeah. We're, we're going to get to that because I too have that question. Um, but I feel like Lauren, tell me what you think of this, this read that I've been workshopping over the last few hours, which is that basically. What the DOJ is saying is that Apple has done a series of things to keep competitors and users from getting the most out of their iPhone or the most out of all the experiences they have in the iPhone. And so what consumers are getting is worse products. For more money that are harder to walk away from in any way, shape or form, and that that is how Apple has abused its monopoly, that it is so powerful, not that it is explicitly doing something nefarious to one of its competitors, but that it is just making everything worse for everybody and that that shouldn't be. allowed. How far off am I? That's essentially the argument. You know, they're basically saying, you know, Apple has through many different actions across different areas. Um, you just made it so that it's just a little bit worse to, um, Use its products or use someone else's products in combination. Um, so, you know, just making it so it's, there's more incentive to stay on the Apple platforms, um, than to try to combine it with something else or move to something else. Which is like by design, like we talk about it all the time on this show, Apple does all of this because it likes money. Yeah, and it's not illegal to like money. Yeah, apparently. It is a little illegal. Well, and that's, that's the like crazy mental gymnastics of this suit to me, which I think it's going to be so interesting to see how all of this goes. Cause it's basically saying the iPhone is bad. It's like a fundamental part of this argument, or like, at least if it's not bad, it's not nearly as good as it could be. And Apple. Is doing that on purpose. And the only reason Apple would do that on purpose is to prevent people from leaving, which if you think about it and just say it like that is bananas, but like, but also it, it like it sort of holds, and this is where we should probably get into like each of the five things that, uh, Apple is being sort of accused of doing this too. And there's a much longer list of. Of like actual accusations here, but the DOJ really bullies it down to five things. And, uh, I'm just going to read the five things. So it's basically, uh, super apps, which Lauren, you mentioned, uh, cloud streaming services by which it mostly means game streaming services, uh, messaging apps, smartwatches, and digital wallets. What a five, some, um, but let's, let's just do these one at a time. And I think we should basically do it in the order in which. The suit does it, and Alex, you and I have been talking about the super apps thing all day, so explain the case for the super apps here. Okay, so they are saying that super apps, which are super, super popular in Asia, to the point that Apple, they have like notes from Apple being like, yeah, those are super popular in Asia. That would be super bad if they got super popular here in the United States. And by super apps, it's like. I mean, WeChat is like a canonical example. Yeah, WeChat, KakaoTalk, a lot, like most countries in Asia have some sort of app that like you can do just everything in. And we don't have that. We have iOS. It ends right here. And so they're saying that these apps have been consistently like kind of deprioritized and made worse on iOS. And they go through a lot of it. And it's kind of true. We don't know quite if people don't like super apps in the United States because we just don't like super apps or if it's because the experience is kind of crummy on iOS and we all use iOS. Well, not all, but big chunk of us, 60 something percent of the market, I think is what the DOJ said. Yeah. And they kept saying things like 75 percent of new phones are bought or are iPhones. And even that probably under represents the Monopoly number and it's like, well then tell me what the Monopoly number is. But anyway, I digress. Lauren, I'm really curious what your read on this one was to me, because I think the other four here are things we've heard everybody yell at Apple about for a very long time, right? Like it was pretty obvious. This is going to be about game streaming. It was pretty obvious. This is going to be a messaging apps. Uh, smartwatches was a little bit of a, Right turn, but so it's digital wallets, but we can come back to this super apps. I would not in a million years, if you had been like David, what are the 50 things in this lawsuit going to be about? I would not have picked super apps. Uh, what, what's your read on all this? Yeah, that was surprising to me too. I think it just seems to fit this general theme that the DOJ is going after that super apps, um, That basically they're saying that Apple is trying to lock down its ecosystem, um, so that, you know, developers can only do so much and, you know, you can't interoperate to a great degree and they don't want to do things that, um, will take away from Apple's own services and its own experience. ecosystem, um, that this is how the DOJ is characterizing it. So I think it just fits the theme, um, and so that's something that they decided to go with. I think, um, it is kind of surprising given, given that, you know, we don't really see a lot of super apps here in the U. S., um, so it's kind of like, you know, Is that a chicken or the egg problem? Is it, would we have more super apps if Apple was open to them? Or are they just not that popular here for other reasons? Yeah, I've spent a decade talking to people about that question and over and over the answer from people has been, well, we just don't want it in the U S but I do think it's True that it is, uh, also we've never really tested the theory in the U S like WeChat is on the app store, which I suspect Apple will be happily reminding lots and lots of people of in the very near future, but it's not the same now. And like the thing about WeChat is that like in a place like China, uh, and I have not lived in China, so I can't say this for sure, but I've heard that this is true. Is that like WeChat is more important Then your phone, right? Like, WeChat is the thing. And as long as it's there. You're a good, like the hardware doesn't matter as much. So on the one hand, a, that has made China's smartphone market, like incredibly cool and competitive because all you need is something that runs WeChat. So they all have to compete on something else. So they build all this wacky hardware. There are a million different brands out there doing stuff. They were early on foldables. They were early on flip phones. They were early on big new phablet phones. Like. The China market is thriving as hardware, in part because WeChat is the thing. Yeah, which is kind of proving the point that the DOJ makes, which is that we can't do all the cool stuff here because Apple is standing in the way of it. And that's, I don't know, that always feels true to me. That has felt like a complaint. We're all like, yeah, I really want a folding phone. Well, I'm going to wait until Apple makes one. No, I think that's totally fair. Also, have you ever used WeChat? That app is a nightmare. Yeah. It's, it's just, and this is, this is kind of what we're talking about. Like it's either a cultural difference, and there are a lot of people who make the case that it is a cultural difference, that in the U. S. we like, we like cleaner, simpler, more sort of straightforward and siloed off software. That is, that is, I don't know how you prove that, but that is I mean, Apple likes that. And has been true for a long time, right? Yeah. Uh, whereas in China. The idea of having every possible thing that exists in the world just sort of shoved in one place. That's just what folks are used to. And yeah, like the counterfactual of like, if it were just as easy to do in the U S would we have it? We'll never know. But I do agree with you that like there is something in that logic that holds that if you make the app, then the app has all kinds of fascinating antitrust things and we'll probably be getting sued for the same thing. At least like if, if you want to make the case that that is what is keeping the hardware market from thriving, China seems like it would prove that case. Yeah. Yeah. And I think like what we see again and again in this. Yeah. And I think the biggest complaint from the U. S. government is that they feel the United they feel Apple has become dominant. Apple dominates the market in the United States specifically, and that has totally warped how we use different apps. And that is like just straight up true, right? Every single time we write a story about a green bubble, some of our international colleagues are like, why are you writing about green bubbles? Do you know WhatsApp exists? And it's like, for sure. Yeah. And we don't use it because we use. I message because it is the dominant platform in the United States because Apple is the dominant smartphone maker in the United States. I see. But then if you like rewind back further, we adopted things earlier in the United States. So what we actually did was we got hooked on SMS and, and WhatsApp. Came up because SMS was really expensive in places where people couldn't afford SMS. And in the U S by and large, we could. And so we just, we got hooked on SMS and then what's up like end around it. And the thing that I messaged did that was so smart was built on top of it, which is. Also in this antitrust suit. Uh, but Lauren, the thing I kept thinking about was I expected this first thing that's actually about super apps to be about web apps. Um, and, and this is the thing we've been hearing a lot of is that like, there's been this big fight over the PWAs, progressive web apps, and this idea that like actually what Apple is doing is systematically making the web worse. And this has been a big part of the fight in the EU. Over how to make sort of these cross platform web apps work better on the iPhone whether Apple allows it or not There wasn't really that much of like the web in this complaint Was that as surprising to either of you as it was to me that I'd shocked me Honestly, I guess it's because they're focusing on this, you know I phone mobile device ecosystem and it seems like everything is really focused on You You know, how they've been able to advance this iPhone platform, um, to, you know, maintain their monopoly. They do talk about web apps in this. And what was interesting was they were like, basically, we considered web apps, that is part of this, but that's already part of the monopoly, because it all has to be built on, you know, Like, it's part of the bigger complaint, which is that Apple forces people to do things in the Apple way, thus limiting, uh, development, limiting, limiting progress, right? And so it's sort of a tangential way. Yeah. So it's like tangential, but it's like, well, you have to use WebKit to do anything on an iPhone, right? So you're, you're like, you're stuck in it. We can't even talk about web apps because WebKit exists is kind of like how they, they treat it. My theory is also that, uh, Whoever wrote and filed this lawsuit decided that trying to explain the concept of PWAs and browser engines and all of this was just like not worth the hassle. Whereas you can just say super app out loud and people like sort of understand what it is where you're like the, the progressive web app on my phone doesn't have access to the local cash. Like everybody just falls asleep. So they specifically say they specifically say in it. Yeah, nobody knows how to use web apps on iOS because it's really complex and weird and hard. And I was like, yeah, that's true. Do you even know how to find the add to home screen button? Like, no, no one knows. Sometimes. I think you really can't underestimate how much the DOJ is going to have to like really simplify this when they get to court. Uh, because having gone to the DOJ Google trial, um, you know, there's a lot, you know, the judge at times would be like, you know, what are these things? Um, and sometimes they're simple things. Sometimes they're complicated terms. Um, but these are judges that, you know, for one thing, aren't usually taking antitrust cases a lot of the time, especially not anti monopoly cases. And second of all, definitely don't know the ins and outs of, um, such a technical Ecosystem. So, you know, I think there is something to like wanting to have a simple story to tell. Yeah. And speaking of that, I think the next thing on the list, the second one in the five was the game streaming services, which is another one that I think is like a sort of viscerally understandable. Thing like, why can't I play fortnight on my iPhone is actually like a sort of universally understood question at this point Asked you and explain that one. Yeah, so back in 2019 Everybody said cloud gaming is gonna be a thing and Apple said not on my watch That's really what happened. Everybody was rolling it out. It worked. You could get these apps on an Android and Apple was like, no, we're not going to put that on, on our stuff. I remember talking to Google and Microsoft and, and Nvidia at the time being like, do you guys want to give a comment on, on, on this? And then Epic sued Apple. Saying, you know, you're, it was all related, right? Every, all of this was, was related and Apple kind of like would walk it back very occasionally to be like, okay, well, you can have cloud gaming, but it can only be in those web apps that nobody knows how to use. And, uh, that's, that's one way you could do it, or you can put it on the store, but we have to approve every single game and like. No one was going to do that. If you've got 200 games, you have to get all 200 games approved. If you've got three games, you have to get them all. Like nobody wants to do that. You have to get every update approved. And so it was really, really onerous. And it really, it wasn't the only reason cloud gaming has not become just the new hot thing and everybody doesn't care about the PS5. But it didn't help. It did not help. Yeah, it really, it really hurt things. And well, and I actually, I really liked this one in particular because I felt like That was where the DOJ did the best job of explaining just like what a gigantic pain in the ass Apple inflicts upon its developers who want to make things for iOS, where it was basically like you, like you said, you have to go through, you have to get every single game approved. You have to run each one of them differently. These games get updated constantly. Most of them are like service games that are just running all the time. These live services games are everywhere. You have to get every single update approved through this like opaque. Occasionally nonsensical Apple review process, or you have to like carve out a completely different game for Apple and run everything over there elsewhere, and then have a specific game for the iPhone that it was just like, and this was kind of the point that they're continuing to make is it doesn't necessarily matter whether it's possible, but it is such a gigantic. Hassle and pain and awful process for everyone involved that no reasonable developer can be asked to do it And this is again where I feel like we're in this weird sort of legal jiu jitsu thing that the DOJ is trying to do Where it's like if Apple had just kept going to epic and saying never game streaming on the App Store ever That's a thing you can poke at, right? Like that is a fight that you can actually pick in this way. But what it's actually saying is like, okay, sure. Good luck. Assholes. And that's, that's so much the vibe of like a lot of what happens on the app store. And we've all heard from developers over the years who go through this awful process. Your app gets banned for reasons you don't understand. Updates don't get approved for days or weeks or months or ever. Uh, and so much of this just boils down to this thing where like. Apple is running its whole process in such an awful way that it can't possibly be doing it for anyone's benefit, it must be monopoly maintenance, which is like, I don't know, slightly hard for me to wrap my head around, but it feels true in a certain way. Yeah, it passes the stiff test. It does. I agree with that. Yeah, like it has a big whiff. And we talked about this a lot in the past few weeks because of what's going on in Europe where they're like, Oh, yeah, yeah, we're gonna we're gonna do what you ask. In the most obnoxious way possible, and just, just make it as painful as possible. You will hate yourself for it and you're probably not going to do it. And the government's like, hey, stop, well, and that's what we've heard from all the developers in the EU, right? Like all the browser makers were like, oh, That's so nice to view. We can use our own rendering engine, but now we have to build two versions of our app inside one version of our app that just sort of automatically selects like, no, we're not doing that. And they've all, they've all basically been like, no, this is actually worse than it was before. You've made our lives harder in the name of pretending to make it easier. And that feels like if I were to boil all of these accusations down, it would be that, yeah, that Apple, Apple keeps claiming it's trying to do good things for its users. And all it does is make everything worse for everybody. Lauren, how do you feel? I think this one is interesting because it, I think if you look at the streaming games claims, it kind of helps you understand the super apps claims in a way because, you know, if you think about it, like the way that David, you were saying, we chat, um, in China is like more important than the phone itself. Um, you know, the DOJ is saying here, like Apple looked at cloud gaming and was like, Oh, if that is the North Star, then the hardware doesn't matter as much, and we can't have the hardware not matter, uh, because we want to make superior hardware and we want that to be valuable to people. So I think that seems to be like the theme that I'm seeing between those two. Two claims that strikes me is way less compelling than the super app example. Like I, I do think in theory, the super app thing holds. And again, like in China, it seems to be real. I just don't think there are that many people out there who are like, if I can't play my two games, I'm switching phone operating systems. No, maybe I'm wrong. I don't think that was the argument. Maybe there's a whole generation of kids who are like growing up on Roblox and Roblox will be more important to them than what phone they use. I don't know. But for right now, like. It does seem like, yeah, like, like you're saying, Lauren, if you go through the argument, it's like, okay, if I can play cloud games, I all of a sudden realize, oh, I can play cloud, cloud games anywhere. I'm going to switch phones. I just, is that how that works? I don't know. See, this is where David, your, your gadget love is, is shining through. Okay. And, and like, Lauren, are you a giant gadget nerd? It's okay if you're not. I'm not the biggest gadget nerd, but I like some gadgets. Well, that's Lauren Feiner, everybody. She's never been on the broadcast again. No, but I think, I think this is a great moment for Lauren because David and I, we're gadget nerds. We know what the processor is called in the iPhone and we care a lot about that and we care about that speed and we care about that performance and the stuff outside of the apps. Lauren, if, if you didn't have to, like, if you could just get the cheapest phone, it would do all the stuff you needed it to do because it was all based in the cloud. Would you save? Would you not spend 1, 600 on a new phone? Probably. Yeah. And a lot of people are that way and not like us and probably most of our listeners are probably like, Lauren, how dare you? And there's a lot, there's a lot of people around you who are just like Lauren. Many of your friends and family are probably like Lauren. It's hard to understand. I'm, I'm working to process it as well. Please send all gadget recommendations to Lauren. Hiner at TheVerge. com. She'd love to hear from you. The more expensive, the better. No, I think, I think you're right as a whole, right? Like on that theory, like I think about this with like Chrome OS, right? What Chrome OS proved is that most people want the cheapest thing that kind of works. And this has become a huge problem for Google because they can't sell you good things that make money because all anybody wants is the cheapest thing that kind of works. Uh, I think that's also true to an extent with a lot of smartphones. And I think, I mean, it's, it's surely not an accident that Apple has not sold 400 phones because I think a lot of people would buy them and that's actually pretty bad for business. If you're Apple, right? Like that's, you have a 30 percent markup on a phone. Yeah. Granted. I'm just saying, I don't think games are that thing. I think the idea, if I could have an exact, like an equivalent smartphone experience. And to be fair, I think like, if again, a lot of this argument from the DOJ adds up to what you're saying, like, I should be able to have an equivalent smartphone experience anywhere. And Apple is preventing me from that. And if I could, a lot of people would leave the iPhone. I think that's true. Yeah. And I think it's going to be really interesting to see to what extent we actually get to see that bear out. I'm just saying I don't think games are that thing. I would agree with that, totally. And I say that as a gamer who used every single one of those cloud gaming services. Did you know Luna is still around? Oh, Luna! Remember Luna? Uh, yeah. Nobody's better at having products still around. You forgot about, but are still just kicking than Amazon. Yeah. Google kills them and the ones you like. Amazon leaves the ones you've never heard of alive. Yeah. Amazon just puts it like further down in the menu system on amazon. com. And that's, that's all that happens to them. Um, all right, we should go to the next one, which is, uh, messaging apps. Lauren, do you want to explain this one? This one feels like the most like mainstream. Relevant of the five. Do you explain what's going on here? Totally. Yeah, this is one that I think everyone is going to be like, Oh, yeah, I've been complaining about this for years, which is that, you know, it's basically the green bubble problem that when you are messaging someone from an iPhone to an Android, you're Seeing, seeing a green bubble on your screen instead of blue. Um, and so basically the DOJ is saying like, this is very intentional. Um, and this is really just another way to lock users into the iPhone iOS ecosystem. Um, and that it's not just that it's like annoying, it's also that, um, there's just worse functionality when you're doing these, this messaging between iPhone and Android. Um, and they even reference, uh, Tim Cook's, uh. comment of buy your mom an iPhone, where he told someone, uh, you know, Oh, someone was complaining at a conference that, um, you know, his mom, um, when he's texting with his mom, he's getting green texts. And, uh, they said, he just said, buy your mom an iPhone. That was the That was the solution. My hottest take about all of this is that I think that sentence is going to come back to haunt Tim Cook. Like, I think that sentence will haunt Tim Cook maybe for the rest of his career. I like when that happened, when we, cause it was at code 2022 and it was Tim Cook. It was Joni Ives. It was Lauren Powell jobs. They were all hanging out with Kara Swisher was her last one. And, and this guy gets up and is like, I can't text my mom. And I'm like, Just, there's like a level of almost, I think we talked about it on the show after that. He came off a little smug and the DOJ noticed. I mean it was a funny line at the time. It was very funny. But it was like, ooh. It played very well in the room, if I remember correctly. But I think, like, The, I was rereading a bunch of stuff from the Microsoft antitrust trial from whatever 25 years ago. And there was this thing that a Microsoft executive said, I think in an email, I could be wrong, but very early on said something to the effect of, we have to cut off Netscape's air supply. And that phrase became like the mantra of the case that Microsoft is this nefarious company out to destroy anyone who would possibly compete with it and is just going to squeeze everyone to death. Uh, I think buy your mom an iPhone. Is going to do that. Not barbarians at the gate. No, that's like slightly too esoteric. I think it's like a cool line. We should, I wrote that line down. We should read it. But, uh, that, that line came when they were talking about the super apps and apparently an Apple exec was like, we can't let. Super apps in the United States and onto our platforms, it would be like the barbarians. Yeah. So this is from the complaint. It says, as one Apple manager put it, allowing super apps to become the main gateway where people play games, book a car, make payments, et cetera, would quote, let the barbarians in at the gate. Why? Because when a super app offers popular mini programs, iOS stickiness goes down. Like, lesson number one, everybody don't send emails, but anyway, that's the first lesson. Just send emails to Lauren dot finder at the verge. com with all of your gadget recommendations. Only emails allowed, but no, I think the messaging apps one I thought was. Again, like you're saying on the most sort of understandable to the most people, but also maybe the most compelling, if your argument is that Apple is willfully making its products worse to make it harder to leave. Like we talked about beeper a ton on this show earlier this year. Right. And the case, so did the DOJ, so did the DOJ. Yeah, it was, it was in the complaint. Like there were a few companies that. We're very clearly being talked about, but didn't get named beeper was one of them. There's a section about, you know, a company promising to make the, uh, security of the iPhone better for everybody. There was also a one about like a company that canceled a smartwatch and it's just like, obviously meta. But anyway, uh, the, the beeper story was essentially, they went around all of Apple's, uh, systems in order to make your green bubbles blue. Even if you're on an Android phone. Apple said, no, it was the whole thing. Everybody listening to the show, I'm sure it knows. But what Bieber kept saying is we are making text messaging more secure for iPhone users, because now instead of using SMS, which is awful technology, bad user experience, and fundamentally insecure, all of those things, undeniably true. SMS, it sucks and it should not be allowed. And they, that was the case they kept making an Apple basically shut it off because they're like, well, we're Apple. We can. And. So the DOJ is coming and saying, no, the fact that you are willingly and obviously making your product worse, not just for other people, but for your users is pretty strong proof that you are not just doing things with your customers in mind, that if you were, what you would have given them is either access to more messaging tools and competition and let other apps like WhatsApp and whoever else access SMS, which is one of the things that this argues should be allowed, or You have to actually give your customers the best product available to them. And they have, I mean, there's like this, the famous email from Tim Cook now shooting down the idea of putting iMessage on Android because his argument was that it would be worse for Apple than it would be good to, you know, have this stuff. Again, like, you just cannot make the argument that that is good for users. You just can't. So, you come back from it and say, this is purely monopoly maintenance, to use their term. Uh, I think this is going to end up being the one we talk about a lot in the course of this trial, personally. I, I, yeah, it's the most indefensible. Apple has never been able to adequately defend this. And they try, all the time, right? And every single time. So. No, I don't think anyone believes them. I, I, like, I would struggle to think of someone who's like, yeah, apple has totally got it right. I am totally fine with garbage green bubbles. Uh, and if I don't like it, I can go use WhatsApp. Well, the argument against it is that Apple doesn't have to, right? Like, yeah, it's Apple's platform. Apple can do what it wants. And, and the, the, and this is like what the DOJ is saying is they're like, no, actually that's not how this works. And we're gonna prove it in court. Uh, and I assume. All of Apple's extremely well paid lawyers are like, bring it on. Yeah. The people really winning in this case are the lawyers. Oh, as a lot of billable hours as always, it's going to be great. Um, all right, let's blow through these last two, uh, and then we're, we need to take a break because this is going to be a 19 hour long first guest. Uh, uh, smartwatches one? That's the next one on the list. Yeah. Smartwatches. Uh. This one feels easy, actually. This one is very easy. In terms of like, what the problem is. Yeah. The problem is if you want to have a good smartwatch experience on iOS, you have to have an Apple Watch. There is nothing else. Nothing else competes. And if you want a good smartwatch experience on Android. You would probably want an Apple watch because it is in fact the best smartwatch right now. And you can't do that either because it's going to be a garbage experience on Android. And it's just that you're about to say you'd found some way to hack an Apple watch onto Android. And I was like, let's talk about that for a while. No, that's, that's, that's next episode. Um, but, but yeah, it is very straightforward. It's a crummy experience. And I would have loved it. They'd also brought in Bluetooth headphones here because, uh, I got a lot of feelings explicitly mentioned that Bluetooth is bad, which I very much appreciated. That was like, if you want to use a non Apple smartwatch, you have to use Bluetooth and it just sort of leaves unsaid that like, well, that's a real bummer, but I appreciated that. And it was, yeah. I mean, it was little things that they brought up. quick responses to messages, which came up like enough times in this complaint that I feel like someone at the DOJ has like a personal issue with not being able to send quick response. Someone was using a pixel watch, um, with their iPhone and they are pissed. Yeah. Right. Like there's some, some like deputy AG somewhere who's like, I just want to send my text messages. What the hell Apple? It was very strange. Uh, but yeah, I mean that that's essentially the crux of it. Right. Learn that it's like, if you want a good Apple. Experience you have to buy an Apple watch, which again, once you bought an Apple Watch, brings you even further into the iPhone ecosystem. Right? Yeah. It just goes back to Apple wanting you to just use Apple products and making it just de disincentivizing. Um, you like mixing and matching between Apple products and other products or just switching all together? Yeah. Which. Is I think a very funny way of looking at exactly the same thing that Apple has always said, right? Like Apple on its face, shouldn't disagree with any of this, right? Like for Apple to say, like, Oh yeah, the Apple watch is better. If you also have an iPhone, like Apple's been making commercials about that for decades. That's the whole pitch is that like we integrate the hardware, the software and the services so that it's better. Apple's like, yeah, that's the point. And now the DOJ is saying, you know, actually what you're doing is you're not making it. Better when those things are together, you're just making everything else worse. And again, this is where I come back to like, I'm not a lawyer, so don't take any of this seriously, but I, it seems to me that that is a much harder like argument to pull and a, like a string to pull on over the course of a trial. I mean, it's just, it's a, it's a major philosophical difference and it sounds like, I mean, Lauren, correct me if I'm wrong, but this is going to be down to the judge to decide like who's right. Because both are right. And in the cases of vertical integration, vertical integration, Always makes things much more smooth and, and, and, and, uh, seamless. It also makes things much more difficult if you want to change. And, and we can see that in the healthcare industry. We can see it in a lot of industries where they say, yeah, we vertically integrated everything. And repeatedly, they've been like, actually, you did too much. There's like, there's some, and we don't know what that line is, but it feels like the courts eventually find it. Is that right, Lauren? Yeah, that's basically right. I mean, I think the judge is going to have to weigh like, was there a legitimate business reason that Apple did these things or, you know, or like, is the effect of these things taken together because of its dominant position in the market? Um, is it too much? And, you know, does it fall into the category of becoming illegal, uh, monopolistic behavior. And that's kind of the key difference here between like 2000 when you could only use an iPod on an Apple device. That was because it was fine then because Apple didn't have a huge section of the market for laptops. It didn't have a huge section of any markets really. And so it was like, okay, cool. You're, you're, you're making new things, you're innovating. And now the difference is that. Now Apple is huge. Is that right? That's exactly right. And that's why you see Apple, um, saying that they don't think that the U. S. smartphone market is the relevant market. It's really the global smartphone market. And that's really like the go to response, um, in pretty much any monopoly lawsuit is to say like, this is the wrong market. Look at this much bigger market where we're just like a speck on the map. Does Apple know that the United States Department of Justice is not like a global organization? Is that no, I believe they're probably aware. Okay, cool. Just checking in case you're not Tim. I know you're listening. Just FYI. That's how that works. Um, all right. One more. And then we should take a break. Um, Alex, you, you explain this one because you've been sitting at your desk, just like muttering about banks all day. Yeah. So explain the digital wallets one. This one, Lauren agree. Like, correct me if I'm wrong. This one was the most surprising one for me that, that it popped up here. And then the more I read about it, I was like, Oh, someone at the banks was, In the attorney general's ear. Do either of you ever spend any time thinking about your digital wallet? No. Like, I feel like on the list of like things I care about on my phone, I would rank digital wallets so low. Yeah. And I, I would Chase feel that way or, uh, some of the other large banks, I think they feel differently. And, and, and that's what. That was like me reading between the lines on this part of the complaint, and the complaint is that digital wallets, you can really can't use any other digital wallet on Apple devices because of how the NFC chip works and how their APIs work. Nothing else works on it. So you have to partner with Apple. You have to pay their fees. If you want to do transaction, you basically have to engage with them in the same way that you have to engage with the app store. And crucially, you have to share data that you might not otherwise share, both the consumer and the banks have to share data that they wouldn't normally share with Apple in order to make all of this work because Apple's sitting there in the right, right? And so the D O J is basically saying Apple has inserted itself into this process and is refusing to allow anybody else to do that. And that is wrong. And like, I was like, Oh, no. That's that's I never thought about that, but yeah, that's because I don't think about my digital wallet because I'm not Chase Bank, so so and then I was like, Yeah, that that actually makes sense and is probably not great. Well, and this is like the only thing I can think is that every fintech company has been in the DOJ's ear over the last year talking to them about this, because Part of the point that they're making is that you don't think about your digital wallet because your digital wallet sucks because no one else is allowed to compete with Apple, right? That if you're, if you want to build, uh, uh, some kind of payment products on the iPhone, you are required to integrate it with the Apple wallet app. You can't use tap to pay. You're just hamstrung in all of these ways that actually go out of their way to promote Apple wallets specifically. So if you wanted to do something like, and it actually mentioned a digital car keys as a version of this, that has been kind of under innovated as a result because there's no. Good way to do it. And they specifically said they had a bunch of examples. They didn't name names, but they had a bunch of examples of where like app developers and banks and in car companies would just had to give up on developing certain applications and certain features because it wouldn't work with iOS because Apple wouldn't allow it to use the parts of the phone that it would need to make it all work. And like, Ooh, that's not a great look for Apple. That's a really bad look. Yeah. You just think of it and this one feels like. It's probably one of the biggest slam dunks, but also. The least interesting one for 99. 9 percent of people who don't work at Chase Bank. Yeah, this one has the fewest sort of sympathetic victims. It's like, oh no, poor Goldman Sachs can't do what it wants on the iPhone. That's awful. Awww. And they try to make it about the consumer by saying, you know, you have to share this data. You have to share stuff that you wouldn't normally share. And, and. That's also true and not great. And I loved just I know we're going to take a break here in a second. But I did love there was this through line throughout the thing that was like, you know what, everything Apple says about privacy and security is absolute bullshit. And every single time they are they are making the privacy and security worse by by doing this. And I love it. That I'm not entirely sure of, right, because the digital wallet, a big part of that is they've got the secure enclave on the device, and they don't want anybody else interacting with that net from a security standpoint. That makes sense. Like Apple's argument there makes sense. But at the same time, green bubbles, there's all these other places where they have made it less secure, right? Even and I think this is part of what it. The DOJ is trying to do is that say, even if individually, these things are sort of gross, but not illegal, put them all together and it adds up to something bigger and they had a bunch of other ones that there's like a list at the end of just like all the other crappy things Apple has ever done, which I thought was very funny. And it names, let's see, it names FaceTime, uh, third party iOS, web browsers, e sims, uh, cloud storage, iCloud. Sales channels and, uh, Siri, which is my favorite. They don't, that's basically like Siri sucks and it's Apple's fault and it's illegal. And I think it's, I think it should be illegal for Siri to be as bad as it is. So I'm in full support of that. Um, Lauren, before we let you go, you've, you've been talking to folks all day. There was a DOJ briefing right after this went out. There was an Apple briefing right after this went out. What's the, what are the vibes like in the hours after this comes out? What are you hearing? Yeah, well, I haven't gotten a chance to catch up with too many people yet, but, um, you know, coming out of the briefing and, you know, just seeing what's out there right now, I think, you know, developers that have been complaining about this for a while are really excited. They're happy to see the U. S. finally take on Apple, um, in this really big way. Is this big enough for those people? Like, are they, are they, I feel like a lot of times. Folks get mad and they yell and they want big action and then they get small action and they get frustrated. But the little bit that I've heard is folks saying like, this is the big swing we've been waiting for. Is that what you're hearing too? I think it's a pretty big case. Um, you know, I think everyone is going to want to see like their, their little piece of the complaint that they've had for years in this, but I think it's a, it's a pretty, uh, sweeping complaint. So I think that, um, a lot of developers will be happy to see this and welcome it. I think. You know, the problem with cases like this and, you know, every antitrust case in the U. S. is that it takes a long time to see them play out. So, you know, I, I think it's going to be maybe a little bit disappointing to people who have wanted to see action for a really long time to see that, you know, it's going to take a while. Um, you know. The DOJ filed its first Google lawsuit, um, back in 2020, it went to trial in 2023. So this is going to take a long time to resolve. All right. Before we let you go here and we go take a break, I'm going to put the over under at 2030. Is this resolved before or after? Are we going over? Are we under? Do we mean like a past, like exhausting the Supreme court option and everything? The last. Pieces of paperwork have been filed, whatever that turns out to mean. 2030, I think over, but it might be close. Okay. Okay. That's good. So I've set the odds correctly. This is, this is good. I feel good about it. All right. All right. We got to say rake Lauren. Thank you so much. We're going to come back and, uh, just talk more about this. All right. We're back and we have a guest, our good friend vacation. What up? How you doing, buddy? I'm good. I haven't been on vacation like this since 2019, and of course. Of course, the DOJ sued Apple for being a monopoly while it's in the air to Mexico. Yeah, there was no chance something was, everything was just going to be chill for a week while you were gone. Just no chance. I assume we're going to do like four or five emergency forecasts over the next eight days or so. It's going to be great. Yeah. Tim Cook is going to overthrow the government. Uh, here's Max. Max is just running. Hey, Max, come say hi to the Virginas. Yeah. Perfect. That's, that's, that's the energy we're looking for from Max. So we just talked with Lauren. We went through kind of the, the bones of the complaint. We talked about like the five big sections of what's going on. Uh, and honestly, I'm just curious for, for Neely vibes. We have a lot of like legal thinking questions about how this case differs and is similar to some of the old cases we've seen, especially the Microsoft one from, you know, 25 years ago. But, uh, I'm sure you read the complaint on the plane, like all cool vacation people. Uh, Uh, what do you make of it? Where's your head so far? So I, you know, I interviewed Jonathan Cantor, uh, on Decoder a few weeks ago. Uh, and I asked him about this case and he was very paging about, um, then my impression of this whole Jonathan Cantor is the assistant attorney general for antitrust and environmental justice. He was on stage. Uh, my read on it is that they are explicitly trying to link Apple to Microsoft in the nineties, right? They're trying to say there was a big bad in the nineties. There's Microsoft. Microsoft tried to kill Netscape and tried to kill Java. And we stopped them from doing that. And that is what let a bunch of other innovative companies do all of it. Including Apple. Including, specifically including Apple. Yeah. Right? Microsoft tried to kill QuickTime on Windows. They basically nerfed it. Microsoft probably didn't want to let iTunes be a first class application on Windows. And letting them do that is what let the iPod tick off, right? When they finally were able to bring the iPod to their knees. So they're making that comparison very explicitly in the complaints. But then also, I think just from like a vibes perspective, the attitude of the DOJ is, okay, well, uh, Microsoft itself, Was built on IBM compatibility, right? Like there was an IBM platform that allowed Microsoft to go unpopular in Microsoft. We stopped Microsoft from being the big, big bad that allowed Apple to be a surrogate guest, but it also created the opportunity for Google to exist because Google is a browser company. The application layer moved from Wintel to the web because of the web and that allowed Google to do this. And then they even go so far as to, you know, when you, when you hear them make the argument, they're like, and then Amazon was built on top of Google, which is, yeah, that's a theory, but the idea that people were searching for products and they landed on Amazon and Amazon became the best retailer because they had the most selection, their point is. The natural evolution of technology is for one platform provided boost to the next one and for people to move sort of like higher and higher up levels of attraction and what Apple has done is they basically forbidden that from happening. So if you think like they keep talking about super apps and the complaint. The comparison that they make, I think they were going to make it more loudly. Um, in the windows case, they called it middleware, which is a deeply funny word. And I think they were going to try to use that word again. And it's still in this complaint a little bit, but the idea is like, uh, Java was middleware on windows. So you'd have to write to windows. You can write the Java and you could deploy an app anywhere. Uh, you don't have to write to windows. You can write to the web and you can deploy anywhere. Flash is a type of middleware, which people are going to have a lot of feelings on. But Apple is basically. All of these things from being actual competitors to running natively on the phone. Uh, so like web apps, they're not a good competitor for real apps on the phone, even though they were intended to be in the beginning. If you remember C drop, and I, I think people have a lot of feelings about that, like on both sides. Right. Uh, and I think they went away from like web apps, the middleware, the super apps. And here's my hottest take. I think they're talking about super apps so much 'cause they know Elon Musk wants X to be a super app. And so if they get Elon Musk to say, Apple's a monopoly, like that's good for them. Is it that's just like, that's two pin coladas, man. That's, that's just me staring at the ocean and being like, why do they keep talking about super apps? It's to get Elon to tweet about it. I love the political theory that getting Elon on your side is, is the surest way to winning in the courts right now? It sure is. If you think maybe Trump might win, right? If you think Trump is trying to woo Elon and you think there might be a change of regime at the department of justice, you probably want this to appear to be really bipartisan, if I want to say the richest man, the most innovative triangle car man in the world, uh, thinks that's a good idea. Cause then he can make the super app that, uh, all innovative guys can And robots want to do, I don't know, like, I think that's a better argument politically than web app could be as powerful as. Native American, which is I, which is what I believe, but I don't, I'm not the only one. Like that's probably part of the reason that the digital wallet stuff is in here. It's because you, it is bipartisan. Like the banks want, want to get rid of that. They want to be able to put their own wallets on the phone and, and now the, the DOJ is saying, yeah, we want you to do that too. Also, just in case you're wondering, Elon Musk has tweeted twice today about the woke mind virus and zero times about Apple and the DOJ. So not great so far. Yeah, look, the man does not love, does not love a government regulator. It's not his favorite. But I'm just saying, like, if you can use some vocabulary that is more popular over there in crazy town, you're better off than talking about middleware, or whatever nonsense they were going to talk about before. I also think I think Apple's response to this is like, Fair! This is our business model. We make products that work really well together. I'm sorry if Jamie Dimon and Elon Musk are mad at us. We stand between you and the capricious, avaricious banks. That's a pretty good argument. I, I don't, I'm not sitting here being like, man, I wish I could deal with my bank more directly, but I, I do think there's like a political coalition that they're trying to make out of it. Yeah. Well, we were talking a little bit about this with Lauren in the last segment, but the, the fact that what Apple is being accused of, is the same thing that Apple has always said that it does, which is build hardware, software and services that work best together. And so like the argument that the Apple watch is the best way to use a smartwatch with an iPhone, like every single person at Apple park is like, yep, that's right. And it's just a question of, and I feel like this, this to me reminds me a little bit of like, when I was at the Google antitrust trial and they were arguing about basically Google's bigness and why Google has so much market share. And Google was like, No, it's because we're very good and we make good products. And the government was like, well, no. And it just like that proving the opposite of that point seems very difficult to me in a way that like the DOJ set itself up with this really interesting narrative that kind of starts at the iPhone isn't very good and ends at monopoly. And I think you can sort of get there. But it just seems to me that like. Legally speaking, jump, like proving the case from hoop to hoop. There seems very complicated. Yeah. I didn't know that they start with the iPhone isn't very good. I think they're more or less like the iPhone is great. And we have all of this evidence that Apple actually doesn't. Feel any competitive pressure on the iPhone, right? But I think, but part of that is Apple saying the iPhone is not as good as it could be. That like, what they're saying is your experience would be better if there was more competitive, if there was more competition in this space, right? And even so we don't have all the evidence. They haven't seen it. Sounds like there's just like oceans of Apple discovery, right? Like that exists. Yeah. Um, it's going to be good. And, but even in this complaint, there's the marketing manager for the iPhone saying we made the phone too good. Like the features are good enough already. We didn't have to put more expense into the phone. We made the phone too good. We should, especially if the features are going to be expensive. I think the quote is like, we can challenge expensive features going into the consumer phone, right? It's like, it would be good enough today. What we did a while ago. Yeah, right. Like we were making things better for no reason. That's bad. Right. What you want is Apple saying Samsung is on our ass, like Lenovo is on our ass, whoever, like Motorola, right? Yeah. And we should make the phone as good as possible to win market share, otherwise people will switch. And the argument that the DOJ is making, again, comes back to just like, where is the application layer with? Because the application layer moves up one level, uh, super apps or the web instantly, the iPhone gets disintermediated and I have to compete. And this is by the way, exactly what happened through windows. I just, we just had Dylan field at South by Southwest with us talking about Figma. And he was like the app, the best way to deploy applications to desktop computers today is the web, right? No one writes native window binary. It's not, you're writing games or you need some other specific, very specific. Access to the hardware, which some, some people do. I'm not saying it's completely dead, but there's a reason that like windows apps aren't the hotness desktop apps all right. Like our, um, there's a reason windows apps aren't the hotness web apps. So when they all live in a cloud and some of them have native access, like big one does a lot of cool stuff in web assembly. Yeah, I mean, Electron is like the new middleware, right? Like it is, it is a thing that lets you run, write one app that runs lots and lots of places. And people can have a lot of feelings about like, like Electron and a lot of like, Electron destroys your computer and like they try to make it better. But all that means is in particular for Apple. When the application layer moved to the web, they were able to ship the iMac and take market share away from Windows. And that is, that, right, that created the opportunity for Apple to exist. And so if the DOJ is basically saying, look, Apple is restricting the natural evolution of technology, and they're not letting the application layer move to super apps or the web or wherever. AI, wherever it might go. And that means the next generation of computers is not forming. And here's the evidence, which is Apple is artificially keeping the price of the phone high and they're not trying very hard. And here's some quotes in the complaint where they're explicitly not done very well. They got to prove all this. This is a complaint. But I see the argument because it is exactly the argument that allowed the iMac to exist. Well, and to that point, like Apple understands better than anybody. The consequences of this, because Apple exists because of those consequences, right? Like it is, I think. The, the, basically like the Microsoft antitrust trial led to the success of the iPod is like a slightly wild take. Uh, I think that's going too far. I, I, I, I think it led to the success of the web, which allowed the iMac to exist. Yeah, I think that's a better argument, but the complaint says the iPod did it. Well, it's going, the complaint says the iPod because they wanted to connect QuickTime, where they had all these quotes from Apple executives talking about QuickTime and how it was hindered on Windows. So, like, They wanted to stay in theme and reuse Apple quotes to be like, yeah, suck it, Apple. Right. And all those people are like, rich or gone. It doesn't matter. Um, but that thing, like, I, I, I, I just, we've talked enough about it. Like, in many ways, a complaint reads like a broadcast episode. It kind of does. It's like fascinating to me, um, it's like bringing bubbles and like, NFC access, like, it's very wonky, like, I, you know, I, I didn't just spend an hour with Tantor on a stage, like, the dude is a nerd. He, he, I think he gets it, um, in a way that, you know, I think it's, it's very tempting to say, like, I don't know, do you understand how computers work? Like, I spent some time with him recently. I, I think he gets it. I think the point he's trying to make is, like, Over and over again, what happens in technology is the application layer moves up one level of abstraction. Uh, I'll give you an example that's totally unrelated. This is more peanut butter thoughts, indeed. But I'll give you more, uh, one more example that's totally unrelated to this. Jensen Wong from NVIDIA, like, he just on stage said, I don't think people are going to have to know how to code anymore. Because they'll just tell the AI what to do, and the AI will generate applications for them. That's a huge step up in levels of abstraction. It's massively inefficient to say, I will no longer know how to program a computer. I will tell a data center full of NVIDIA GPUs to write programs for another computer. Like, massively inefficient. Uh. But that's everyone believes in. And I, I, I think if you believe that that is the arc of technology, then you, you, it's hard to look at the iPhone and say, well, where are the really interesting electron ish app? Where are the really interesting super apps in this country? We have had our coverage of super apps are coming on the word for five years. Like ever since anybody woke up and saw WeChat in China and said, Oh, look, the Chinese market, there's a lot of switching between phones. It was like, it's a more vibrant market over there in smartphones because this one app is actually the operating system, right? Why doesn't that kind of thing happen? It's not that Google doesn't want that to exist, but that Meadow wouldn't do that tomorrow with Facebook. It's an Apple is basically prediction. I mean, that's functionally what Facebook has been trying to do for a decade now is, is build more and more of that stuff in. And ironically on the web for a long time, it worked really well. And then, and this is, we were talking about the, the super app thing and whether it's like a function of the way Apple works or just a genuine cultural difference. And this hadn't occurred to me until now, but I think maybe the best argument you could make for why it's just a cultural difference is that everybody hated when Facebook got really cluttered, like ran away from the app and, and Facebook, Like pretty nakedly and loudly, like tried to learn from WeChat and just pull more and more of that in. And it got messy and it got weird and it got complicated. And then, you know, politics happened and people started to like flee Facebook, but still people use marketplace and groups and like Facebook is in a very real way. It is the closest thing we have in the United States to a super app, but it's not close enough. It's not. No. And it can't do it on mobile. Right. It's not. I do everything with that. So I can switch to a Samsung phone or whatever kind of a phone, a pixel, and basically recreate my experience. And the point is, if you could, if you can switch your services or you can switch your application environment easily. You'll be very likely to switch your hardware. And the, there's a line in the complaint that another Apple quote, this is the one that led me to believe there's a mountain of evidence in this case. Um, where it's an email from an unnamed Apple executive who says, if we let this cloud stuff happen, Anyone can just buy a 25 Android and have a great experience. He said bucks and spelled bucks with an X, which I hate so much. Uh, and I believe he said that that's the barbarians at the gate. Yeah, it's pretty good. Right. And that's like Apple, like openly being afraid of Android in that way, not because it's a better, but because it's deeper and saying we have to make or it's not a good experience over there. Not by making our phone great, but by letting, making sure that application developers can't do things over there that they can do here, or making sure that if they do things over here, it's costly. Like cloud gaming, right? I think that was the example there. If we allowed cloud gaming, anyone can buy a cheap Android phone and have a great experience because they'll just be cloud gaming. That's bad. I can't stress enough how bad that is. Again, I'll come back to Figma just because we had Dylan on the show recently. I know a lot of designers who have given up their MacBooks because they spend all day using Figma on a Chromebook. And then they, you know, they allocate their dollars elsewhere. That's fascinating. It's just a fascinating turn of events that has happened in that market. It's crazy that nothing has gotten in between the phone. Now, just for the sake of the argument, I will make all of Apple's arguments without having really read their responses, because again, I'm a big sleep gun. They are what you think they are. I'll tell you that. Like there was, there's, they, they did a background briefing with a bunch of reporters and have put out a couple of statements and nothing in it will remotely surprise you. None of it. Yeah, I do love when the briefing was on background, by the way. Um, we're mad, said no one. Cool. Anyhow, uh, I'm guessing they're like, The security is really important. These things are in your pockets all the time. Um, we craft, uh, integration of hardware, software, and services that no one else does. Like, that's actually the business, not with other stuff. That is alarmingly close. Yeah. Sure, right. Yeah, but we've covered this company for a long time. And I'm wondering if they brought up battery life. Because that, that's the one, to me, that's like, uh, Our producer, Liam, is just at my house and we were on a Google meet with my 2015 iMac. And he was like, what's that noise? And I was like, that's the iMac. That's the fans from the iMac trying to run this web app right now. And he was like, I thought that was your furnace. It was your 2015 iMac. There are a lot of arguments, especially on a mobile phone, power constraints, small device, blah, blah, blah, network constraint, where you want to be in tight control of what an application can do. I totally, I totally buy it. I don't think those arguments are wrong. I just think Apple probably ever since Tim Cook said like services revenue and a call five years ago has been actively protecting the business as opposed to growing it. And I think there, I think there's a bunch of evidence to that, to that effect. So Apple didn't mention battery life on super apps instead, all on background again. So we don't know who actually said any of this. Maybe it wasn't even Apple. Maybe it was orange. Uh, but, but they said that super apps exist already and, and that anything they do is for privacy and security reasons, which is the big theme. Uh, what two countries did they call out to grab some tasting in, uh, China and India? Yep. WeChat and Tata. Right. So, uh, two countries that regulate the shit out of Apple. Yep. I just want to be blunt. Like China basically is like, you're going to give our user data to the state and China and Apple's like, cool. Uh, China. From, uh, John Gruber, I think, reported is, uh, China is the one that said you're going to do RCS and Apple finally paved for bad reasons, right? I think China wants Apple to move to RCS. The people will stop using an encrypted eye method. Yeah, that's bad, but they're going to do it. Uh, India also extraordinarily interested in regulating Apple. Also, uh, I don't know if you saw the pictures of Rihanna performing at a wedding in India lately. Uh, Rakesh Ambani's son's, uh, wedding, Rakesh Ambani owns Reliance Jio, the largest carrier in India. He's a major benefactor of the government. And when the wireless carrier in India says, we want to make sure people can switch easily, Apple gives up, right? And like, that's a big thing. Uh, my favorite fact about the Indian smartphone market is there are like 10 phone launches a week for some insane number like that, because people are switching, people are switching so hard all over the place because the application layer and the network layer It's actually to some extent on reliance, like reliance via the network is actually the application layer there, which is utterly fascinating. So I would just point out like Apple saying it super rapidly exists and not mentioning that in the two countries that regulates Apple, the hardest in various ways. It's pretty funny, man. It's a how it appears to be on background. So we don't even know that someone whispered this. Yeah, in a meeting, and no one was allowed to ask that person, you know, I fell asleep and I woke up and had these arguments in my head in my head. Yeah, yeah. Uh, yeah. Why do you think they didn't talk about the web more in this complaint? The thing that surprised me the most was that all of the arguments that we've been talking about on the verge cast for months now about what the open web could be. Like, I just imagined Dieter bone reading this and like screaming about progressive web apps and he's like, this solves all problems. The palm pre knew it. Everything would have been great. Uh, but the open web wasn't really a thing. Like they didn't talk about web browsers except sort of obliquely. There were not big discussions about what web apps could do to make these things better. Like why, what's your read on why that was not part of this complaint? One, I texted Dieter today and I said, I miss you. The United States government says web apps are important. He was just like, go on vacation. Like, he texted you back from messages. Google. com, the web app. So yeah, good call out there. Um, I, again, I, I think this is a political situation. I think that stuff is in there. I know for a fact the DOJ has been paying a lot of attention to Apple's compliance, the DMA in Europe, and their move to, you know, disallow web apps, and then like bring them back because the EU regulator sleeps out. By the way, that web app thing, you know, I'm not like a crypto person, but, uh, there was a huge freak out because there are crypto apps that store, that are web apps that store the data locally and Apple was able to wipe out people's wallets by disallowing web apps because they were just going to get rid of the functionality. Yeah. Literally the, the local data on their phone that was stored there with their money. But it's just been gone insane, which is, I mean, hilarious. It's I know the DHA has been paying a lot of attention to everything there. I really think. This comes down to who is the audience for this, for this complaint. I was talking to Sarah Jung about it. This complaint is a press release. It's fundamentally, it's written like a press release. It's a story. It begins with like, Steve Jobs in Media Red, like, doing a thing. And that's like, it's a story. It starts with a Kindle ad. Like, truly, what a win for the Kindle today. The Kindle is the bastion of openness. Yeah. And I think telling people. The weird web apps are going to do it on a phone. It's like people know what websites look like on a phone. We have the only good ones, the only good one. Yeah, that is the rest of them are trying to mug you in a dark alley. I think they had to move on and say, like, there's a next generation of products that's being held back. By the way, Elon Musk, proprietor of triangle cars, wants to build one right now, doesn't he? And I think that's a much better story. It's a story about the future. And it's a story about the past. But I think fundamentally. But, you know, the recent history of technology suggests the web is actually the best application platform. Yeah, yep. It distributes most widely. And it has, in fact, taken over on desktop. Like, in a real way, a lot of the native apps that you think you're using on a Mac or a PC are, in fact, electronic apps. Yep. Um, they're just wrappers around web apps. I've been covering browsers more in the last 12 months than I have in like the previous decade, because again, the, the, the layer of applications is moving and all these browsers are starting to realize like, Oh, your operating system isn't actually the place that can do all the stuff for you online. It's your browser. Yep. So we're, we're going to give you more. Cross platform tools, we're going to rethink the way extensions work. Arc is one of a bunch of browsers doing a bunch of interesting stuff with AI. And so like, that's the same sort of layer of app abstraction that you're talking about and it's making browsers, at least on desktops, like really interesting and important again. It's all about Microsoft Edge. Well, and even again, like Microsoft now is like. Edge is a crucially important thing to Microsoft in a way that like, remember the last time browsers were important to Microsoft for 2040, 2040, Microsoft edge is going to be a horrible monopoly. Just you wait. That's a good take. I appreciate that. I mean, this is just a circle of life, right? I was just like, your thing I would say is like a bunch of these quote unquote middleware, it was like, did turn out to be garbage. Like I don't, like Java did not turn out to be an excellent application environment. And, uh, Flash, I think someone famously, uh, was a piece of crap. But if you don't allow the things to like take hold in the market, then you are going to be stuck with one vendor kind of controlling everything. And I, I, I wonder how much of a thought gun approach this complainant, again, it's everything. It's iMessage. It's applications. It's super apps. It's, uh, wallets. It's, I mean, smartwatch. It's everything. And I wonder how much of this is like, let's put it out there so people grab on to it and then follow up on that one. Yeah. How much of the case, when it finally goes, is just going to be spicy Apple quotes and then being like, look how spicy this is. Destroy them. Yeah, I think what we've learned from all of these recently, uh, is there's nothing more fun than putting a powerful executive on a stand and just reading their email to them. You wrote this email. They're not certain. They're like, I don't recall. That's pretty good. But I'll watch that. You know, we have seen a lot of that. The thing I warn everybody, uh, is the Microsoft case in the nineties took a decade. Right. It was like three or four years in trial and three or four years of appeal. Then I got kicked back. Then there was a settlement at one point. Uh, I have this very distinct memory of standing in the target and we're seeing Wisconsin. It's like a child teenager reading the news week that was describing how Microsoft would be split up into something called apps co and OSCO. Yep. Because they were going to split windows from the application business. I don't know why this happened in a target and we're seeing, I mean, I know I was going to see in Wisconsin. Which I grew up, but I don't know why this memory is specific to standing in a public reading newsweek, Grant. Uh, but it is. That's what I got for you. I can't remember anyone's names, but I remember that. That's who I am. Yeah, there you go. And like, it got all the way to the DOJ was going to break up Microsoft. It came all the way back down. And that took 10 years. Um, and so I think this is a decade. Like this is a gravitational well that will last a decade. Like the entire industry is going to bend around this case for a decade. Yeah, we, we gave Lauren the over under of 2030, uh, and for this to be like fully all the way done and dusted. And she sort of gently took the over. It sounds like you're, you're like hard over on 2030. Yeah. I mean, unless, uh, I think the only difference to me in my mind is the, the DNA exists in the EU now and Apple is making these changes anyway. And so it's going to collect some data about how much money it can make in the meantime, and what that would be like for each other. There's a possibility that that breaks this case and makes it go shorter, but they're mad, like this is a company that is idealistically, ideologically upset is the notion, but we can't do whatever it wants. Uh, and I get it. Like, I, I don't like being told what to do. No one does. I don't know if anyone has ever noticed, but I think in this case, like, Again, to some extent this complaint reads like a verge text. It's like, why, why, why did it take so long for Apple to log in and stream the app on their iPhone? Oh, because they want to protect the app store. Right. It's as simple as that. Yeah. Yeah. So, one more thing and then we should let you go because you have many more pina coladas to drink. So many. How do you feel like I'm never coming home. Mexico. Neely is going to be a whole new addition to the verge cast. I love this. Uh, talk to me about how you feel about this, like as a, as a lawyer who would have to argue this case, because one of the things Alex and I have been arguing about all day is my feeling is that one of the big things that happened in the Microsoft case was that you had Netscape, which was this like one party that had been like viciously Loudly wronged and it actually ended up not being the most important part of that case But it was like it was a very helpful victim that you could argue This is the bad thing that was done to someone and it crushed them and and maybe it's just too early to know the answer This question but my argument has been that there isn't a version of that in this complaint. Alex is A response, which I think is fair, is that basically the, the victim in this is us, the people who use these devices, but like if, if you were a lawyer standing up in front of people trying to argue this case, how does it feel to you from seeing the complaint? It, it you, in terms of just like handicapping your chances being able to prove this in court? Uh, I, I, I wish I knew what evidence they were sitting on. What I would say is Netscape was like very convenient victim. Because it was the web. It represented the thing that people liked. Here's the exciting new thing. Like. Why are you getting on the internet to use this and Microsoft wants to crush it and own it? And that's a good story to tell. Um, I think in this case, it's much more like Look at Apple looking at any threats to its business and sending emails saying we can't let that buy them Look at Apple saying we cannot allow people to buy cheaper things Uh, I, you know, we, we've talked a lot really just talking about, about like, theories of antitrust law on this show, and like Hanh trying to change them from like the consumer welfare standard to blah, you know, like all this stuff. And one thing that's really notable about this complaint is there's no esoteric new antitrust, new brand. It's apple kept prices high. That's the argument. Yep. Yep. Apple won't by, by, by not allowing these new application model to take, take hold. Apple gets to keep the price of the iPhone high. And I think that actually, that's what I would focus on is you don't need it. Right? Like your Gmail app runs everywhere. Why doesn't X Box run everywhere? Well, it's because Apple won't let it like, what are the number of things we can see in this industry that basically don't happen because Apple won't let that happen on the iPhone or like for a lot of people and blogging on and off. There's a lot. And I, I think the funny thing is all those victims are also companies. The DOJ is suing like, like Google is like writing out lists and the bear villain meta is in that list. They're a villain. So I think it's going to be much more about painting Apple as a villain rather than trying to find a victim. That's good. I like it. All right. Me and I go have vacation. Uh, I will see you presumably like Monday morning when something else insane happens. The three of us will be back in here doing this. If, if I come back, just get ready for this pale, pale human being to be gone in place by a happy, healthy, extremely, extremely hammered. We'd love it. Thanks buddy. We'll see you later. All right, we gotta take a break and then we're gonna come back and Alex and I are gonna do an actual lightning round for once Because holy god, have we been talking a long time? We'll be right back All right, we're back we're gonna do an actual lightning round because Nila's not here So he can do this quickly as we like to do from time to time Nila, by the way, if you see him on the beach somewhere in Mexico Pour him a tequila shot. He'll like that very much. All right, let's do, we're going to do two things each because there's been a lot of like little news, so let's just bounce through some of it and then we'll get out of here. You go first. What do you got? All right. First up, YouTube, uh, is, is bringing their multi view that they do for sports and stuff. They're bringing it to the iPad. And iOS, which is very exciting. Oh, wait, really? Yeah. Oh, that's awesome. Yeah. I think, uh, one of the hot takes I've developed recently is that split screen is a thing that should exist in every app on every device for everything all the time. Yes. Like the more I use it on like the, the Samsung phones or the pixels where they're getting better at sort of letting you drag apps up and down. It's just great. It's, it's such a And all the arguments that screen's too small, you don't, no, screw that. My phone's enormous. Let me look at two apps. Yeah, uh, they aren't the only ones doing multiview. The other multiview news this week was from Peacock, which is going to be doing multiview up to four streams for the Olympics, and then they are planning to have that stick around for sports, maybe even like scripted content. So you can watch below deck on like four screens at once if you want it to theoretically, and that's, I wouldn't want to. So there's this. Sports podcasts I listen to, uh, shout out to the Bill Simmons podcast, uh, and he always talks about Uh, being able to watch basketball on one screen and movies on another screen. And his argument is essentially if he like looks over at the movie and it's a good part, he'll flip the volume to that and just like watch it for a few minutes or if the game goes to commercials. And I used to think that was ridiculous. And now every single time he mentions it, I'm like, God, that sounds awesome. Like one thing hits commercials, you just flip to the other one. Go back and forth. You're like, Oh, well, I don't care about the next five minutes of this. I'm going to watch 10 minutes of the Godfather, like that rules. Yeah, the cool dads in the 90s, they just did that. They just had like picture and picture. And for some reason, computers were like, we can do that, but we're not gonna. Or the back button on a TV remote. A plus choice. Yeah. YouTube TV should have this, but they should have it for everything. Yeah. I should just be able to have four screens of whatever the hell I want to watch at any time. And Peacock, important. It's going to work on every everywhere. So it's not just good. It's going to work on the apps. It's going to work in the smart TV. Like they're rolling it out across the board. Can I say I love that you're a peacock convert? I'm a peacock convert. Oh, we should disclose here now, um, NBC Universal, which is a division of Comcast as a minority investor in Vox Media. Uh, Nili will happily come home from Mexico and tell you that he executive produced a show for Netflix called the future of it's very good. Everybody should watch it. Uh, Alex loves peacock now. Apparently I have always loved peacock. Um, you think Netflix is going to die, which is weird. It's on a 40. That's probably good. Yeah, yeah, yeah. I didn't say 90. Like, it's going to die eventually. Everything does. It's beautiful. Um, all right. My first one is, which one of these do I want to do first? Uh, let's talk about beeper. So we mentioned beeper a few minutes ago as one of the apps that has actually become like embroiled in this whole Apple antitrust saga, uh, gave up on the idea of trying to replace iMessage, which. Good idea. Uh, someday you might be able to, but that's a very long time from now. And it's just back to building like a kick ass cross platform messaging app, which rules. Uh, they just rolled out a new app for Android in, I think it's in public beta now. It's really good. Is it? It's like the thing that they got back to, which I appreciate is they're like, what if we just took Signal and WhatsApp DMs and LinkedIn and X, I think still works even though that API has been weird. I could be wrong. I'm not sure. I haven't used X in a long time, so don't believe anything I say about X. Uh, but basically all the messages you get and just sort of put them all into one Organizable inbox that makes sense. Which, with or without SMS and iMessage, Terrifically useful service. Yeah, I want that. And the app is, has always been like a little Funky. It's like, it's, it's sort of just built on a series of elaborate hacks, um, but they're getting very good at it now. And the new app is really nice. So if you use beeper and are on Android, it rules and it is the rare app that is way better on Android than on iOS. So for all the Android using Verge staffers and Vergecast listeners, this is a victory for you. Don't worry. I'm going to wait till 2030. Maybe 2032 it sounds like. And And I'll have this app too. There you go. Dude. The messaging app is about to get, or the messaging app world in general is about to get real weird. Yeah. WhatsApp is doing the thing where it's interoperating, the EU is forcing everybody to interoperate. Like it's gonna get very strange, but I think in mostly really good ways you're gonna be able to just like get all your messages, all the places, which is how this should have worked forever. So the 2002 is gonna come back, but instead of like Adio and whatever the windows version of that was called, start with a t. Trillion. Trillion, they were set. There was also Pigeon. Oh yeah, Pigeon. Which I loved. Yeah. It was good. Inject all those apps back into my veins. Just right into your veins. Alright, what's your second one? Okay, my second one is, uh, Allison wrote a really cute piece this week and it just felt appropriate. We talked so much about super apps. I kind of think Sago Mini is like a super app, but for babies. Now we're talking. Tell me so much more. Well, you know, uh, she, she, she was like. She compared it to like Blippi, but not Blippi. She was just like, it gives a bunch of little games that kids can play. It's all in one place. They're all like good games for small children, for babies. Cause she has a baby, two years with babies, right? You said super app for babies and I started imagining like my 15 month old son running around being like, I got good night moon in here. I got a bunch of trucks in here. Ah, sick. Honey, no Cheerios. Got that in here. It's like, I can message my mom rules. I'm into this. It's not quite there yet. I don't know if that's there. Yeah. Yeah. I don't know if that's actually their ambitions, but it's mainly Cheerios. It's a lot of structured games and it's for, it's for really small children instead of because like if you go on YouTube, if you go to the app store and you try to find games for babies, you will have a time. Oh, it's a mess. Yeah. It's a total mess. And I will say this is, I'm glad you brought this up because we get a surprising amount of emails and calls to the hotline basically all asking variations of the same question, which is just like, what do I do with my kid on. Screens and devices and computers because we're like at this point where I when kids are like I don't know eight you have to start having like a really real series of complicated conversations about like what it means to use the internet Uh huh younger than that It's just like I'm just gonna plant you in front of something and something's gonna happen but this question of like Is YouTube kids a safe place to be is increasingly kind of fraught because there's all kinds of weird stuff on YouTube kids. And like, there's been this stuff recently with AI generated videos going in front of kids that is spooking a lot of people, I think for totally good reasons. So there's this sense of like, what is the right call here? And we're having all these complicated questions. Discussions about screen time and what it means to be put in front of these devices. And so for stuff like this, that's just like cool, silly, low stakes, fun stuff, like there's so little of that in the world right now. I think, honestly, I wish I'd known about this. Before all of this, because, uh, when I saw my, my godson recently, I was like, I don't know what to do and like pull up one of those videos where like the squirrel eats nuts that's supposed to distract cats. And I was like, does this work for a six year old? It doesn't. I bet. I bet it doesn't. I will say I found an hour long video that's just people feeding red pandas. Uh, you know who that super worked for is both me and my son. We sat like wrapped in front of that thing for an entire hour. You watch those animals eat and you're like, wow. Look at him go. Yeah, that's great. I want to do that. It was so nice. I have no notes. Uh, my son's also very into trains. So we just watch a lot of videos. I just want to say there is there is a man on the internet who just makes hour long videos of trains. Yeah. And it just Cuts from train to train and he travels the world and does all the trains. His name is Mike something and I love him He you are my favorite. Let's be friends. I love a train guy. I love a train guy And they all have like 10 million views, which is so funny. Yeah, it's great. All right, my second one Mm hmm is that I saw the humane pin this morning. This is the reason I'm in New York. What? So the humane pin is coming out on We waited until now. Yeah. We have two to three more hours. Um, and, uh, a humane put out a video yesterday, Wednesday, um, that I think was the single most useful piece of content humane has ever published. It's like almost 20 minutes long and they're basically just like, here is what the AI pin is. Here's what it does and here's how it works. Okay. Very helpful. And then I got to go see it this morning and talk to Imran and Bethany, the co founders of the company. I spent like 90 minutes just like goofing around with the thing. Um, I still have lots of questions. We're going to get to review it at some point. I'm very excited about it, but I actually got to like hold the thing in my hand and use it. And I will say I have, I have said a lot of mean things about the AI pin on this podcast. It's a very cool piece of technology. Is it a good product that is worth the money? I don't know. It still feels like probably not, but like they made the thing like it works. I want to point out. I, I, I'm now a peacock fan. And you're now, my God, what have we become? Who are we? Like Neal? I go, like, this is, this is where we are. This is life now. But no, I, I'm actually very excited about it because we're, we're in this phase now where we're going to get the humane AI pin. And then I think sometime like in weeks, not months later, we're going to get the rabbit R1. And then there's also this company, Brilliant Labs, which makes the frame glasses. And I was talking to their CEO yesterday, uh, they're about to ship in April. And so we're getting this first run of like real honest to God, AI gadgets. Yes. And it's going to be really interesting. And we're like, the big question is basically like, are any of these, Better than a smartphone. Do I need this? If I have a smartphone, shouldn't these have just been smartphone apps? Like super fun, interesting questions. Like what does a smartphone mean in my life is I think like a big question of 2024 for a lot of people. Uh, it certainly has been for me so far. And. Like, I'm just very excited to try all of these gadgets and just playing with the pen. It was like, okay, I have big questions about how this fits into my life and whether 700 and a pretty expensive monthly subscription is a pretty steep price tag that this thing meets TBD. But like, how did it feel? The thing works. It feels really good. Does it? Just from like a pure, like they made a gadget thing. It just feels good. It's got a charging case that feels like one of those sort of worry stones and has a really nice hinge. Like. It's, it's made by people who love hardware in a way that I very much appreciate. Did they make a good product? I don't know. But boy, did they make a cool thing that I'm like the laser projector I am so spectacularly unconvinced by. Yeah. But it's kind of fun to like do the thing and you like tip your hand forward to scroll down and it's like deeply silly, but it was kind of fun. I loved watching you do this just now. That's literally what you do. You hold it up. And it's like kind of right at this level. And then if you want to scroll down, you literally just tilt your hand towards you. And if you want to scroll up, you tilt your hand away. Like a segue. And then you click to click. It's a, it's a hand segue. It's a virtual segue for your palm. Yeah, of course. That's how they actually pitched it to everyone. But yeah, I suspect if, if Humane is right, uh, about when it's going to ship, that should happen very soon. They've been saying. Like end of March, it was supposed to be earlier in March. They've been saying end of March, I think into April potentially. Um, so like all of this is happening and we've been talking about these gadgets for months. Yeah. And we're actually going to get to like use them in the world. And I'm very excited about it. I am so excited for you. Yeah, it's going to be good stuff. I'm so excited. My goal is for my review of the AI pin to be longer than Neeli's. 8, 500 word review at the vision pro. I'm going to put a really excited word count. Like maximum just close the Google doc at 2, 500 words. That feels right. Yeah. Um, all right. Um, we have gone on way too long. We've had a great time. As we want to do. This has been very fun. Yeah. Thank you for doing this. Thanks to Lauren for being here. She's lovely. Eli for joining from the beach. Uh, we are also going to be talking so much about this. Like I think it's, it's going to be a weird case because it's going to ebb and flow pretty aggressively. Like I think my guess would be that we're going to have a bunch more news in the next few days as reactions start to come in and we start to get more reporting on what people are thinking and where some of this evidence comes from and who are the other companies that are being kind of obliquely referred to in the complaint. Big lull, like big lull, and then we're going to get discovery and, and like, it's going to pop off. When discovery happens for our listeners, that's when you get all the good gossip. It's going to be, it's going to be wild. And then someday between now and like 2064, this might actually go to trial. There'll be a trial, maybe a consent decree. I love a consent decree. I do actually. I love it. Who doesn't? We should have been the flagship podcast of consent decrees. No, it's performance phones, which is, that's what they call the iPhone. They say the iPhone is a performance smartphone. It's not a cool, a regular smartphone. It's a cool smartphone. It's a cool smartphone. It's got race car stripes. All right. We got to get out of here. Uh, there's tons of good stuff on the verge. com. Our whole team has done an awesome job covering the antitrust stuff today. We have an amazing story stream with all this stuff. From the presser and the complaint and all kinds of stuff. So keep it locked there. There's still lots more to come. We will be back next Tuesday, next Friday forever and ever. Yeah, it's going to be good times. We'll see you then. That's the Verge cast rock and roll. And that's it for the Verge cast this week. Hey, we'd love to hear from you. Give us a call at 866 Verge 1 1. The Verge cast is a production of the Verge and Vox Media Podcast Network. Our show is produced by Andrew Marino and Liam James. That's it, we'll see you next week.",
    "transcript_keywords": [
        "Apple",
        "Yeah",
        "super apps",
        "apps",
        "thing",
        "app",
        "DOJ",
        "web apps",
        "Apple Watch",
        "things",
        "good",
        "people",
        "lot",
        "Lauren",
        "super app",
        "super",
        "super app thing",
        "Apple wallet app",
        "Microsoft",
        "web"
    ],
    "transcript_entity_values": [
        "Luna",
        "zero",
        "Dylan",
        "Decoder",
        "hours",
        "the nineties",
        "90",
        "Allison",
        "Android",
        "the 90s",
        "New York",
        "the vision pro",
        "15 month old",
        "WeChat",
        "Elon",
        "Vox Media Podcast Network",
        "Andrew Marino",
        "three",
        "Hanh",
        "Sarah Jung",
        "yesterday",
        "Imran",
        "a call five years ago",
        "morning",
        "Epic",
        "up to four",
        "the United States Department of Justice",
        "FaceTime",
        "Grant",
        "Alex Kranz",
        "Neely",
        "25 years ago",
        "a few minutes ago",
        "2",
        "EU",
        "iMac",
        "a few minutes",
        "TheVerge",
        "WebKit",
        "Steve Jobs",
        "2024",
        "Goldman Sachs",
        "Two",
        "Chrome",
        "One",
        "March",
        "U. S.",
        "the last 12 months",
        "an hour",
        "50",
        "the news week",
        "iMessage",
        "Brilliant Labs",
        "Alex",
        "a million",
        "United",
        "Asia",
        "Native American",
        "Microsoft",
        "between like 2000",
        "OSCO",
        "YouTube",
        "Mike",
        "Vox Media",
        "DMA",
        "three or four years",
        "400",
        "yesterday, Wednesday",
        "David Pierce",
        "200",
        "2015",
        "the department of justice",
        "Bethany",
        "99",
        "Lauren Finer's",
        "Nila",
        "third",
        "this week",
        "the hours",
        "the last year",
        "Blippi",
        "iMac",
        "Meadow",
        "Chromebook",
        "Trump",
        "Verge",
        "Joni Ives",
        "Chase Bank",
        "Mexico",
        "Google",
        "like 90 minutes",
        "YouTube TV",
        "Neeli",
        "NBC Universal",
        "the previous decade",
        "KakaoTalk",
        "Cantor",
        "2020",
        "this morning",
        "iPad",
        "RCS",
        "Organizable",
        "Cheerios",
        "1 1",
        "jiu jitsu",
        "Samsung",
        "YouTube",
        "iCloud",
        "Elon Musk",
        "NFC",
        "2030",
        "iOS",
        "an entire hour",
        "Wintel",
        "Netscape",
        "Indian",
        "China",
        "9 percent",
        "WhatsApp",
        "weeks",
        "AG",
        "2040",
        "Netflix",
        "10 years",
        "decades",
        "Liam James",
        "first",
        "60 something percent",
        "30 percent",
        "Southwest",
        "75 percent",
        "two to",
        "Jensen Wong",
        "Peacock",
        "40",
        "DOJ",
        "a ton",
        "Chinese",
        "earlier this year",
        "10",
        "a couple of days",
        "Fair",
        "next Friday",
        "WeChat",
        "the U. S.",
        "2022",
        "PS5",
        "DHA",
        "MacBooks",
        "Electron",
        "the U S",
        "Roblox",
        "the past few weeks",
        "Mexico Pour",
        "Comcast",
        "Sago Mini",
        "the next eight days or so",
        "the next five minutes",
        "Gmail",
        "Virginas",
        "Windows",
        "AI",
        "2064",
        "Lauren Powell",
        "a week",
        "a decade",
        "Androids",
        "8",
        "a million years",
        "Nili",
        "Neely",
        "Rihanna",
        "these last two",
        "Flash",
        "Tim",
        "Olympics",
        "newsweek",
        "Liam",
        "Neal",
        "IBM",
        "25",
        "last a decade",
        "Trillion",
        "10 million",
        "Facebook",
        "LinkedIn and X",
        "Monopoly",
        "India",
        "2019",
        "Jamie Dimon",
        "second",
        "Bluetooth",
        "five",
        "Lauren Feiner",
        "Elon",
        "Lenovo",
        "Monday",
        "Media Red",
        "Jonathan Cantor",
        "amazon",
        "South",
        "tomorrow",
        "1",
        "First",
        "Kindle",
        "Supreme",
        "a six year old",
        "a few weeks ago",
        "one",
        "Kara Swisher",
        "Nilay Patel",
        "Apple",
        "five years",
        "John Gruber",
        "four",
        "Mac",
        "Wisconsin",
        "days",
        "iPhones",
        "2002",
        "Humane",
        "500",
        "today",
        "Rakesh Ambani",
        "Tim Cook's",
        "Reliance Jio",
        "Eli",
        "the last few hours",
        "Chase",
        "Europe",
        "2032",
        "eight",
        "19 hour",
        "Florida",
        "SMS",
        "two years",
        "Bill Simmons",
        "years",
        "the years",
        "months",
        "API",
        "Tim Cook",
        "Roblox",
        "an Apple Watch",
        "monthly",
        "the AI pin",
        "866",
        "TBD",
        "Look at Apple",
        "DOJ Google",
        "the United States",
        "2023",
        "Netscape",
        "Siri",
        "two",
        "Lauren",
        "2030",
        "Signal",
        "all day",
        "Amazon",
        "Motorola",
        "David",
        "Apple Watch",
        "Tantor",
        "iPod",
        "Tata",
        "next week",
        "WebKit",
        "the next few days",
        "10 minutes",
        "almost 20 minutes",
        "Java",
        "iPhone",
        "Nvidia",
        "600",
        "Max",
        "NVIDIA",
        "United States",
        "Microsoft Edge",
        "next Tuesday",
        "16",
        "Figma",
        "700",
        "April",
        "Lauren dot",
        "the North Star",
        "Adio"
    ],
    "transcript_entity_types": [
        "PERSON",
        "CARDINAL",
        "PERSON",
        "ORG",
        "TIME",
        "DATE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "GPE",
        "ORG",
        "DATE",
        "PRODUCT",
        "PRODUCT",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "DATE",
        "TIME",
        "ORG",
        "CARDINAL",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "DATE",
        "TIME",
        "CARDINAL",
        "ORG",
        "PRODUCT",
        "TIME",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "GPE",
        "DATE",
        "TIME",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "CARDINAL",
        "ORG",
        "LOC",
        "NORP",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "CARDINAL",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "GPE",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORDINAL",
        "DATE",
        "TIME",
        "DATE",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "ORG",
        "ORG",
        "NORP",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "TIME",
        "ORG",
        "PRODUCT",
        "NORP",
        "GPE",
        "PERCENT",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "DATE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "PERCENT",
        "PERCENT",
        "LOC",
        "PERCENT",
        "DATE",
        "PERSON",
        "ORG",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "NORP",
        "DATE",
        "CARDINAL",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "GPE",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "DATE",
        "TIME",
        "PERSON",
        "GPE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "ORG",
        "PERSON",
        "PERSON",
        "DATE",
        "PERSON",
        "PERSON",
        "EVENT",
        "ORG",
        "PERSON",
        "PERSON",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "PERSON",
        "ORDINAL",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "LOC",
        "DATE",
        "CARDINAL",
        "ORDINAL",
        "PERSON",
        "ORG",
        "DATE",
        "DATE",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "ORG",
        "GPE",
        "DATE",
        "NORP",
        "DATE",
        "PERSON",
        "CARDINAL",
        "DATE",
        "PERSON",
        "PERSON",
        "ORG",
        "PERSON",
        "TIME",
        "ORG",
        "LOC",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "DATE",
        "DATE",
        "DATE",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "ORG",
        "GPE",
        "DATE",
        "ORG",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "ORG",
        "ORG",
        "PERSON",
        "ORG",
        "PERSON",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "DATE",
        "TIME",
        "TIME",
        "ORG",
        "ORG",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "GPE",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "PERSON",
        "FAC",
        "PERSON"
    ]
}