{
    "id": "IxwU-h_h8Ls",
    "title": "THE 6TB MONSTER PS4",
    "channel": "Unbox Therapy",
    "channel_id": "UCsTcErHg8oDvUnTzoqsYeNw",
    "subscriber_count": 24800000,
    "upload_date": "2016-02-24T21:08:59Z",
    "video_url": "https://www.youtube.com/watch?v=IxwU-h_h8Ls",
    "category": "Science & Technology",
    "tags": [
        "ps4",
        "playstation 4",
        "playstation",
        "nyko",
        "data bank",
        "nyko data bank",
        "ps4 upgrade",
        "upgrade",
        "playstation upgrade",
        "hard drive",
        "hard",
        "drive",
        "6tb",
        "4tb",
        "3tb",
        "2tb",
        "8tb",
        "upgrade ps4",
        "sony",
        "sony playstation",
        "gaming",
        "video games",
        "hard disk drive (invention)",
        "hdd",
        "playstation 4 (video game platform)",
        "video game (industry)",
        "ssd",
        "seagate",
        "xbox",
        "review",
        "xbox one",
        "storage",
        "solid state drive",
        "hard disk",
        "console",
        "unboxing",
        "samsung",
        "xbox 360",
        "tech",
        "technology",
        "unboxtherapy",
        "unbox therapy",
        "wd",
        "external",
        "backup",
        "sata",
        "best",
        "ps3"
    ],
    "views": 2836046,
    "likes": 64306,
    "comments_count": 5195,
    "description": "Video With Phil DeFranco -  Nyko Data Bank -  6TB Hard Drives -  2TB Restriction Lifted -   Need an upgrade for your Playstation 4? The Data Bank from Nyko might have you covered!  FOLLOW ME IN THESE PLACES FOR UPDATES Twitter -  Facebook -  Instagram -  Google Plus -",
    "description_links": [
        "http://bit.ly/1R28Q7S",
        "http://amzn.to/25uQ9Dd",
        "http://amzn.to/1U8IhiN",
        "http://bit.ly/1QyKstN",
        "http://twitter.com/unboxtherapy",
        "http://facebook.com/lewis.hilsenteger",
        "http://instagram.com/unboxtherapy",
        "http://bit.ly/1auEeak"
    ],
    "transcript": "- Before we get into today's video, I wanna give a quick shoutout for a project a collaboration I got to do with Youtube's own Phil DeFranco, we had a lot of fun things went off the rails. Did a little bit of trivia and there was even some punishment involved for the loser. That's about all I can tell you right here so check out the link in the description. There's also an annotation somewhere here so watch this video then go watch that one. Thank you very much guys, show some Unbox Therapy love. Much appreciation. (breathing deeply) What's up guys, Lou here back with another video and today I'm gonna be showing you how you can substantially increase the storage on your Playstation 4, got one over here you'll see it in a minute, using this Nyko modular data bank. It will allow you to put a 3.5 inch hard drive so something like this, I've got a six terabyte Western Digital Black over here so something like that or whatever it is that you have lying around. It'll allow you to put that on top of your PS4. Now the reason that's important is because unlike on your Xbox you cannot just connect an external USB drive and install games onto it. You can of course swap out the 2.5 inch drive that's currently installed for another bigger one but you're gonna pay a lot of money for a little bit of storage and if you wanna do something crazy like six terabytes, that's just not currently available in the 2.5 inch form factor. Let's open this thing up and take a closer look at it. Now it kinda sticks up a little bit kinda like an appendage. You probably want an external USB drive for backing up whatever is currently on your Playstation before installing this guy here. This is pretty light actually. Comes with a little tiny screwdriver for the purpose of installation and then this little tray over here. Okay. Perfect. And some instructions which do I really need? Nah, Jack what do you think? Geez Lou, doesn't need to be this complicated. Think I never done this before. This is the main component here. This is actually, you can kind of see through this a little bit, so I guess you can look in and see your large hard drive. If you're the kind of guy that likes to remind yourself of how big your hard drive is. And then on the back you can see there's like a power cable pass through. It's time to do some surgery here. Is this a record breaking Playstation? Maybe, I don't know if there's any other six terabyte Playstations out there. That just slides off, I was right. Now you'll see how much smaller the stock drive in a Playstation is here. Jack you gotta see how cool this screw is too here. This is like my favorite screw of all time. Right now everybody's thinking, Lou it's a screw, calm down. Cool right? Okay fine, you're not as excited as I am. This was the stock drive 500 gigabytes. These drives, desktop drives, are faster too. Substantially faster. This little component here replaces where that one went. Just slides right in there, you take that fancy little screw put it back into this spot here. The big, the behemoth here oh like that okay perfect. Booya! Now you wanna connect this part here regular sata connector in that location and then connect your drive. Six terabyte WD Black, getting it done. The cool thing here, there you go you can sort of feel it connect The cool thing here is if you wanted to then take this one out and put another one in for whatever reason it's actually really easy. It's just this little cover here. So this guy goes on top. There we go, yea I can't, without a flashlight I'm not gonna be able to appreciate my hard drive the way I'd like to. And then the last thing to do on the back is you take this little cable, bring it over to the power plug and simply plug that in, right like that. Now you're standard Playstation power cable is gonna go from here to the wall and everything's gonna be powered up. Now if you have an older Playstation running older firmware, then this six terabyte drive might not function as expected so it's important to check out which version you have so you know it's gonna work well. Otherwise you might wanna stick to a two terabyte expansion which is supported pretty much on every Playstation. Actually, it is supported on every Playstation. There's a press release on Nyko's website which details all of this, I'll link it in the description as well as a link to this product page. Build yourself a monster. A six terabyte PS4. Now I'm definitely Rocky. You see the, don't forget the uppercut. Just when you were relaxing, you had the hands up you were looking for the overhead but I hit you from underneath.",
    "transcript_keywords": [
        "Youtube own Phil",
        "Phil DeFranco",
        "Playstation",
        "drive",
        "give a quick",
        "quick shoutout",
        "project a collaboration",
        "hard drive",
        "Youtube",
        "Phil",
        "external USB drive",
        "terabyte",
        "USB drive",
        "Western Digital Black",
        "bit",
        "Lou",
        "terabyte Western Digital",
        "thing",
        "hard",
        "fun things"
    ],
    "transcript_entity_values": [
        "WD Black",
        "Playstation",
        "3.5 inch",
        "Playstations",
        "today",
        "USB",
        "Six",
        "Jack",
        "Lou",
        "two",
        "a minute",
        "six",
        "2.5 inch",
        "Nyko",
        "500 gigabytes",
        "Rocky",
        "six terabyte",
        "Youtube",
        "Xbox",
        "Playstation 4",
        "PS4",
        "Geez Lou",
        "Phil DeFranco",
        "Western Digital Black"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "ORG",
        "DATE",
        "ORG",
        "CARDINAL",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "QUANTITY",
        "PERSON",
        "QUANTITY",
        "ORG",
        "ORG",
        "PRODUCT",
        "GPE",
        "PERSON",
        "PERSON",
        "ORG"
    ]
}