{
    "id": "IygtUhGmsBc",
    "title": "Samsung Galaxy Note 9 hands-on",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2018-08-09T15:30:00Z",
    "video_url": "https://www.youtube.com/watch?v=IygtUhGmsBc",
    "category": "Science & Technology",
    "tags": [
        "samsung",
        "samsung galaxy",
        "samsung mobile",
        "galaxy note 9",
        "note 9 samsung",
        "note9",
        "note 9",
        "samsung galaxy s9",
        "galaxy s9",
        "review",
        "hands-on",
        "smartphone",
        "first look",
        "technology",
        "top 10",
        "gadgets",
        "tech",
        "latest updates",
        "how to",
        "how to make",
        "diy",
        "mkbhd",
        "marques brownlee",
        "apple",
        "google",
        "iphone",
        "microsoft",
        "verge",
        "the verge"
    ],
    "views": 605251,
    "likes": 5859,
    "comments_count": 743,
    "description": "The Samsung Galaxy Note 9 is a big bet for Samsung. Once again, a Note phone touts its battery as one of the main features. But there are some new changes, like making the S Pen a remote, using AI in the dual-camera system, and support for DeX by just plugging in a cable.  Subscribe:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:  Read More:  Community guidelines:   Subscribe to Verge Science on YouTube, a new home base for our explorations into the future of science:",
    "description_links": [
        "http://goo.gl/G5RXGs",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "http://bit.ly/2FqJZMl"
    ],
    "transcript": "- Stefan with The Verge here, and the brand new Samsung Galaxy Note 9. This year, Samsung hasn't changed a lot of the stuff that makes the Note 9 truly special. In fact, they doubled down on them. The display, the battery and the S-Pin have all been revamped. Overall, it doesn't feel like an amazingly different experience, compared to last year's Note, but it is still an improvement. It's an evolution more than a reinvention, but this could end up being the Galaxy Note that fans of the line have always wanted. The Note 9 looks almost identical to last year's model, except the fingerprint sensor around the back is now below the camera and easier to reach. It comes in blue and pink and if you get the blue model, it comes with a bright yellow stylus. It has an ever-so-slightly larger screen than last year's Note 8. 6.4 inches versus 6.3 inches. Everything else is the same, so there's a headphone jack, water resistance, wireless charging, USBC, and of course, a bixby button. The more substantial changes to the Note 9 are elsewhere starting with the largest battery that's ever been in a Note phone. It's 4,000 milliamps. And since the Note 7 disaster hasn't yet been forgotten Samsung is taking some extra precautions with its own safety checks and also having it validated and certified by the outside companies. Above all else, the Galaxy Note 9 is about productivity. Getting stuff done. This year, Samsung has built decks into the Note 9, so you can use it like you would a desktop, by plugging the phone into an external display. The Note screen can be used as a track pad or keyboard, when working on documents and decks. This turns the Note 9 into a really portable PC with minimal fuss. Samsung is loading the Note 9 up with powerful hardware and best in class LTE speeds, to make sure it's fit for that job. There will be two models of the phone. A 128 gigabytes storage option, with 6 gigs of RAM and the top end, 512 gigabyte version, with 8 gigs of RAM That much memory should make the Note 9 a true multitasking champ. The Note 9 runs on the Snapdragon 845 processor. But Samsung says it has made improvements to the GPU. There is an even a new water carbon cooling system in the Note 9, which is supposed to keep it cool when you're playing games, like, you guessed it, Fortnite. I even asked a Samsung rep if there really is water inside of the Note 9, and it turns out, yes there is. The rear camera is pulled right from the Galaxy S9 Plus, and has the same dual aperture capabilities with a secondary lens for portrait shots. New this year, is AI-powered scene recognition. The Note 9 will try to automatically detect what your subject is, and adjust things like contrast, saturation and white balance, without you having to do any of it yourself. The camera will also alert you if a shot was blurry or if someone blinked. This type of thing doesn't fair so well in other phones, so we're gonna have to figure out if the Samsung's implementation is any better. You can always turn it off and stick to the manual or auto modes, if you prefer. And, because this is a Samsung Galaxy Note, of course there's an S-Pen, which now has Bluetooth low energy built in. Bluetooth gives Samsung's stylus new functionality. It's button can act as a remote camera shutter, a presentation clicker, or, control your music. By default, pressing and holding that button opens the camera. But you can customize it to open any app you want. It works from up to 30 feet away and Samsung has built in a super capacitor for rapid charging when it's inside the phone. You should never have to worry about the S-Pen's battery life. Pre-orders for the Note 9 start on August 10th and it ships on August 24th. The 128 gigabyte model is $999.00 and the 512 gigabyte version is $1249.00. But Samsung is cramming everything it can into the Note 9, to make it it feel super powered and super productive. So overall, the Note 9 definitely is an improvement over last year. But it's going to take a full review and living with it to really figure out if it lives up to the hype and if it's worth the upgrade. Don't forget to like and subscribe and stay tuned to youtube.com/theverge. And don't forget to (stutters) stay tuned. (laughs) Oh my god, Stefan! (laughter) It hurts inside. (laughing) It hurts inside. - Director: You're killing it.",
    "transcript_keywords": [
        "Samsung Galaxy Note",
        "Note",
        "Galaxy Note",
        "Samsung",
        "year Note",
        "Samsung Galaxy",
        "year",
        "Galaxy",
        "Verge",
        "Note phone",
        "camera",
        "Note screen",
        "phone",
        "inside",
        "Samsung stylus",
        "loading the Note",
        "model",
        "make",
        "battery",
        "makes the Note"
    ],
    "transcript_entity_values": [
        "the S-Pin",
        "an S-Pen",
        "last year",
        "USBC",
        "999.00",
        "128 gigabyte",
        "845",
        "GPU",
        "Snapdragon",
        "LTE",
        "1249.00",
        "the S-Pen's",
        "the Galaxy Note",
        "Samsung Galaxy Note 9",
        "6.3 inches",
        "August 24th",
        "8",
        "the Galaxy S9 Plus",
        "6.4 inches",
        "New this year",
        "the Galaxy Note 9",
        "Fortnite",
        "128 gigabytes",
        "August 10th",
        "Samsung",
        "two",
        "bixby",
        "6",
        "9",
        "This year",
        "up to 30 feet",
        "Stefan",
        "last year's",
        "RAM",
        "512 gigabyte",
        "4,000 milliamps"
    ],
    "transcript_entity_types": [
        "ORG",
        "PRODUCT",
        "DATE",
        "ORG",
        "MONEY",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "PRODUCT",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "DATE",
        "PRODUCT",
        "ORG",
        "CARDINAL",
        "DATE",
        "ORG",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "PERSON",
        "DATE",
        "ORG",
        "QUANTITY",
        "QUANTITY"
    ]
}