{
    "id": "Iyp_X3mwE1w",
    "title": "A Complete Beginner's Guide to Electric Vehicles",
    "channel": "Technology Connections",
    "channel_id": "UCy0tKL1T7wFoYcxCe0xjN6Q",
    "subscriber_count": 2460000,
    "upload_date": "2022-09-09T16:34:24Z",
    "video_url": "https://www.youtube.com/watch?v=Iyp_X3mwE1w",
    "category": "Science & Technology",
    "tags": [],
    "views": 1127757,
    "likes": 40700,
    "comments_count": 5875,
    "description": "That is what this video is. It's a lot simpler than you think! OKAY SO THERE WAS SOME NEWS ABOUT PLUGS.   Referenced videos: Electric car chargers aren't chargers at all  EVSE Explained   The tech which can charge an electric car in 10 minutes (DC Fast Charging)   2nd channel discussion   Technology Connections on Twitter:  The TC Subreddit   This channel is supported through viewer contributions on Patreon. Thanks to the generous support of people like you, Technology Connections has remained independent and possible. If you'd like to join the amazing people who've pledged their support, check out the link below. Thank you for your consideration!   Oh, and look at these wonderful patrons! Jacob Francis, ShoddyCast , Casa De Nyquil, Alice V, Kang Seonghoon, Thomas Bohmbach, Jr., Jeff Andrews, Enrique Gutierrez, Magnus Kvevlander, Mr. Kitty, Zefram Marks, Zach Matthews, Andrew Dunham, Darryl Smith, Kirit Slensminde, Roger, L8 4 Tea, Dustin Schoenbrun, Candice Colby, Kain Mahaney, Dick Jones, Palyk , Barrett Olson, Dan Turner, Maddie Goldberg, Pierce Staab, Joo Andrade, JP Addison, Marcus, Lancaster, SnorkY2K, Diego Elio Petten, Chris, Rick Egli, Mike V, John Malkin, Trltexx , Tobias Wooldridge, Chris Johnston, Thomas Lovell, Karunamon, Daniel Miles-Sackett, Stephen Edmonds, Petr Petras, Alex Hall, Jtwenty7 , Just Roy, Jade Sharpe, Peter Springer, Domas iaudvytis, Erik Padgen, James Robertson, JDubs, David H, John Bradley, Sam Martinez, Jason A. Diegmueller, David Shaffer, Scott Earle, Lucas, Paul Hart, Jennifer Skahen, Techdisk, Mark I Sullivan, Yashwin Pamecha, Alan Cooper, Mark Cockrell, Jesse Lang, Jeff Sowell, Nicholas Menghini, Caledron, Edward Aten, Scyler Yang, Michael Parlier, Jorge Luis Borges, Cate Stock, Brett , Dale Green, Lou Paris, Erik Granlund, Kerbal01, Jessamyn De Vos, Dianna Black, Ken Snider, Bish, Sam Carl, Paul Bernard, Matt, Colin O, Tom McMahon, Moon moon, Alexandra Robison, Sembiance , Brandon Lewis, Derek Cowburn, Devil of the Ceilingful Mount, Bennett Staley, David Wedekemper, Jason Banich, Ed O'Brien, Edverything , Noah b, Ian C, Aaron Bruce, Onigiri-Kun , Joshua (InexorableTash) Bell, Raena Jackson Armitage, popular_penguin, Nicholas H (TheNH813), David Greve, Nick Kirk, Adam Steele, Clara Schultz, Kevin DeGraaf, James Ribe, Charles Keisler, Rinnn Tosaka, mikebad, Dr. Clyde H. Hedgcoth Jr.  00:00 Intro 02:35 Understanding Energy and Electric Vehicles 10:36 Power and Charging Speed 16:27 Charging Solution to Fit Your Needs 19:15 Level 1 Charging (charging from a household outlet) 23:51 Level 2 Charging - Installation options 28:09 Sizing a New Charging Circuit 32:34 How far an overnight charge will take you 34:43 Basic charging circuits are powerful 37:42 Multi-car families 40:24 DC Fast Charging 46:49 Factors which affect driving range 55:32 Conclusion 56:48 Bloopers",
    "description_links": [
        "https://youtu.be/ZJOfyMCEzjQ",
        "https://youtu.be/RMxB7zA-e4Y",
        "https://youtu.be/sZOuz_laH9I",
        "https://www.youtube.com/watch?v=1WuJtcgExa8",
        "https://twitter.com/TechConnectify",
        "https://www.reddit.com/r/technologyconnections",
        "https://www.patreon.com/technologyconnections"
    ],
    "transcript": "So, lets say youre considering an electric car but you dont know what living with one might be like or what you might need to keep it charged up. Youve landed on the right video! Ill be covering the ins-and-outs of living with and charging EVs in 2022, from what chargers are out there for home use, how to choose the right one based on your needs, vehicle, and situation, what traveling long-distance is like now and what needs to be improved, and what hiccups to look out for particularly in cold weather. This will be a largely US-centric conversation, especially when we talk about stuff like volts, amps, and miles... per gallon... of gasoline, but the broad strokes apply no matter where you are. My goal here is for you to have a fairly complete understanding of electric cars so you can make the most educated and rational choices for your personal needs. Before we get started, youve probably already noticed that this video is quite long. I want this video to answer as many questions and concerns as someone entirely unfamiliar with electric cars might have, and all in one place. So theres a lot of information here. Chapter markers are there to help you move around. But I want to stress that in day-to-day life, Im not thinking about any of this stuff! I simply plug in my car and walk away, and in the morning its full again. Although it takes my car several hours to charge, I spend seconds plugging it in and it charges while I'm asleep. That means I actually spend much less time refueling compared to negotiating a gas pump transaction every week or two. I can tell you with absolute certainty that I would never go back to a gas-powered car. An EV is simply much more convenient and easier to live with when you can charge it at home. And I know not everyone can do that right now. Thats something we need to work on. But if you can, heres the situation in a nutshell: If you drive the typical average distance daily, a regular household outlet might actually meet your needs. And if you need or want a little more power, dont assume youll need an electrical service upgrade; a basic 20A 240V circuit can easily cover very long commute distances - up to 100 miles - every day, charging only overnight. And any car can plug into any charger of any capacity - dont chase the fastest charging speed a car supports unless you really need it. How do you know if you really need it? Well, do I have a video for you! Its its this one. Music With that, we need to start with the basics, and I mean the really basic core tenet of everything: energy. How much energy does an electric car use? How much can it store in its battery pack? How far will that take you? And how long does it take to replenish that used energy? For a while I was struggling with how to begin answering these questions - electric vehicles require different thinking than what you might be used to and as we go on youll see why. But, well I kinda forgot that we can in fact translate most concepts from a combustion vehicle to an EV. Since more of you are familiar with those than EVs, lets start with this: the battery pack is the new gas tank, and the kilowatt-hour is the new gallon. An electric cars battery pack doesnt have a capacity in gallons, of course, but it does have a capacity. Rather than giving that capacity in volume of a liquid chemical concoction, we define its capacity in raw energy terms. Energy. It makes the world go round! But what is it really? This section is going to feel like were deep in the weeds but its fundamental to understanding how charging works. First, you need to understand the difference between power and energy. This trips a lot of folks up because its a bit confusing. You probably have a general sense of how much power things in your life use, for instance light bulbs are given a wattage. The watt, though, is a unit of instantaneous power, not energy. Quantifying energy from power requires a time component, and in the realm of electricity we use the watt-hour. Watt-hours are what they sound like. Its simply the average power draw in watts that occurs over a period of one hour. As an example, a 10 watt light bulb that has run for 1 hour will have consumed 10 watt-hours of energy. When you change the power level, you change the speed at which energy is consumed. A more powerful light bulb will burn through energy more quickly. For instance a one hundred watt light bulb only needs to run for six minutes to have consumed the same 10 watt-hours as our 10 watt bulb does over an hour. It uses 10 times as much power, so the same total energy use is reached in one tenth the time. Watt-hours are pretty small, though, so when talking about electrical energy we usually use the kilowatt-hour - which is just one thousand watt-hours. Your electric utility probably bills you in this unit. And the battery pack capacity of an electric car is given in kilowatt-hours. Battery-electric vehicles on the market today (meaning those which are purely electric, not hybrid powertrains) usually have battery packs of at least 30 kilowatt-hours, though 50+ is more typical in the US market. Many models are available with different pack sizes to choose from, for instance my car - a Hyundai Ioniq 5 - can be had with either a 58 kWh pack in its base configuration, or a 77.4 kWh pack, the size I have. Of note, right now, car manufacturers tend to be a little vague on whether the figure they give their battery packs is the packs actual capacity or a usable capacity. See, to prolong battery life most cars only give you access to a certain range of the packs charge levels. It puts more wear and tear on a battery cell when you push it to its extremes, so somewhat typical is for a 100% indicated charge to really be something like a 95% charge, and when the battery is dead at an indicated 0%, its really more like 5% charged still. To be clear, this is a good practice! But I wish every manufacturer would give distinct gross and usable capacity metrics for their battery packs so we can understand how much theyre pushing the cells. For what its worth, many EVs will let you be gentler on their batteries by allowing you to set a maximum charge level. I have my car set to stop charging at 80% because honestly it has way more range than I need, and limiting charge levels is thought to prolong battery pack life. Anyway, lets go back to what I said earlier. The battery pack is the new gas tank, and the kilowatt-hour is the new gallon. So, my cars tank holds 77.4 kWh. And how many miles can each of those 77.4 kWh take me? On the highway, about three. This car, like lots out there, actually gives you efficiency in miles per kilowatt-hour, and just like miles per gallon, a higher number is better. Some cars will flip that and tell you how many watt-hours you consume to go a mile, but I find distance-driven per kilowatt-hour to be much more human-friendly, especially since I pay for electricity in that unit. How far can a full tank take me, then? Its the same math as a combustion vehicle, just with different units. 3 (our distance we can go with a kWh of energy) multiplied by 77.4 (how many of those kWh our pack holds) gives about 232 miles of range, a bit shy of the 256 miles my car is rated by the EPA to go. Thats because the EPA rating includes mixed driving, and in the realm of EVs, highway driving is less efficient than stop-and-go. Ill explain why later, but for instance around town Im regularly hitting 4 miles per kWh in this car, but at sustained highway speeds that just isnt possible. Heh, right, speaking of the EPA, some knucklehead thought that MPGe was a good idea. If you look at the window sticker of an electric car its gonna be prominently given a fuel efficiency in Miles Per Gallon-gasoline Equivalent. [exasperatedly] Heres how that works: we assume a US gallon of gasoline contains 33.7 kWh of energy. Then, based on the actual energy consumption of the vehicle in real units, a backhanded calculation is done to give you Miles per Pretend Gallon. I... its not exactly meaningless, its nice to see how much farther an EV will take you with the same amount of energy. But nobody buys electricity by the gallon, so miles per kilowatt-hour makes way more sense. That would be too easy, though, so if you want to use real units the EPA gives them to you, but they tell you how many kWh of electricity the car needs to go 100 miles. Look, playing around with different energy units is fun and you can do it however you like, but MPGe is just a wee bit silly, dontcha think? Anyway, thats the basics. Electric cars have a battery capacity in kWh, and we measure a cars driving efficiency in much the same way as miles per gallon. And that efficiency multiplied by the packs capacity gives you its driving range. If youd like to get an idea of how much it will cost to charge your electric car, well again the basic math is the same as with a gas-powered car, just with different units. Take your commute distance and divide by your cars efficiency. Ill do a 40 mile commute as an example, and divide by my cars 3 mi/kWh highway efficiency. I should expect an all-highway 40 mile commute to need 13.3 kWh. Now its a simple matter of determining how much your electric utility charges per kWh. Supposing a cost of $0.15/kWh, that commute will cost $2.00. Now Ive ignored charging losses with this calculation; adding 10% will give a more accurate cost. Public charging tends to be more expensive, but well get to that in a bit. Music I know the next thing a lot of you want to know is how long it takes to charge a car back up and thus refill its proverbial tank. The answer is actually so simple it only needs two words. Are you ready? Now, dont worry, once you get your head around a few variables, youll be able to answer this quite confidently. Thats literally my goal, here! For now, were going to focus on slow AC charging. If you have regular access to a \"slow\" charger which can fill your car up overnight (or perhaps when youre at work), youll never even think about visiting a charger when youre out and about. And one of the most beautiful things about the power grid is that its everywhere! Level 1 and 2 AC charging simply connects a car to the grid in the same way you do anything else, from a table lamp to a clothes dryer. But Im getting a little ahead of myself. To answer how long it takes to charge, theres really only one critical factor: how much power you can deliver to the car. Well get into details on how exactly thats accomplished shortly, but when you know how much power you have available and you know the size of your battery pack, solving for time to fill it is really simple math. All you do is take the battery pack size in kWh and divide it by the power supply in kilowatts and there, youve solved for hours! Heres an example for determining charging time. Say you have a car with a 60 kWh battery pack, and a charger which can supply 5 kilowatts. 60 divided by 5 is 12, so that car would need 12 hours to charge from empty to full with a 5 kW charger. But if you had twice the power, 10 kW, the charging time would be cut in half to six hours. 60 kilowatt-hours divided by 10 kilowatts is 6 hours. And if you only had 3 kW to play with, charging time would be stretched to 20 hours using the same math. But its important to keep in mind that charging time also depends on how charged the battery already is. A half-full battery is already half-full! So in our 60 kWh example car, a 50% charge means only 30 kWh actually needs to be fed to it. That cuts all those charging times in half. This is because on AC charging, since the battery pack is so large and the power input is relatively low, the charging curve is essentially linear. Were not dealing with the effects you might be used to with a phone or laptop battery. What really matters is how much energy was taken out of the battery, and how much power we have to refill it. Again, this is in the case of AC charging. DC fast charging is another story, which well get to later. Now, manufacturers will give you a required charging time for their cars. But honestly, you should probably just ignore that. See, if you were to look at Hyundais information on my car, theyll tell you that it takes a little less than 7 hours to charge it from 10% to 100% on a 240V charger. Thats pretty good for an up-to 300 mile EV. But, I dont like that answer. At all. To be clear its not wrong - that speed is absolutely possible! But only if you have a charger with enough capacity to support that speed. Which I dont because, frankly, I think its very much overkill for virtually anyone. But again, getting ahead of myself here. A while back I made a video on what exactly an EVSE - the technical name for a car charger - is, does, and how it works. I wont get into the specifics here, if youre curious watch that video! But the key thing to know is that the actual charger, meaning the device that takes AC power from the grid and converts it to DC for charging the battery cells, lives in the car. The voltage conversion and all that stuff is entirely the cars job. The EVSE is just a very-slightly-smart power cord which delivers raw AC voltage to the charge port and tells the car how much power its allowed to pull. Thats all this does, plus a few safety things. Hyundais charging time claim comes from the fact that the Ioniq 5s onboard charger can accept a maximum of 48 amps, and at 240 volts thats 11.5 kW. 77.4 kW-hours divided by the cars maximum power input of 11.5 kW tells us that we need 6.73 hours of charging time to deliver an entire battery packs worth of energy, exactly what Hyundai claims. Now, hang on, they claimed that time from 10 to 100%, and we did the math for 0 to 100% - why the discrepancy? Well, there is about a 10% loss when charging a battery, in other words only about 90 of every 100 kWh pulled by the car ends up stored in the battery. The rest is lost as heat in chemical processes and various charging components. But in the end, and this goes for any car, all you need to know to determine charge time are three variables: the size of your battery pack, how much of its capacity you need to recover, and how much power your charger can deliver. Add 10% to the end result if you want to be really accurate. Manufacturers are generally going to quote an empty-to-full time on the fastest charger the car will support - thats useful to know and is a simple selling point, but the real world is messier. Usually in good ways! Music So now, lets talk about what sort of charging solution you might need. First, let me acknowledge that I know there are lots of you out there who need to drive a car but dont have a dedicated place to park and charge one. Trust me, Im not trying to be dismissive of your situation. Im just as frustrated as you are! See, the beauty of AC charging is that its simple! Its incredibly straightforward infrastructure to deploy, and theres no reason it shouldnt spread to multi-family dwellings and areas with on-street parking other than finicky details like permitting, billing structures, maintenance concerns, building codes, and miscellanea like that. The good news is that there are plenty of creative solutions in the works and Im sure well see more of them with time. So while I dont have answers for you here, keep your eyes peeled. For those lucky ones who have a garage or even a driveway close to their home or other electrified structure, well youre probably pretty good to go. In fact you might already be set. Actually, right, heres a misconception I keep seeing pop up from time to time: This connector design is waterproof theres a gasket in here which seals the pins from the elements when a connector is attached. And charging your car outside is totally OK. There is plenty of charging equipment meant to go outdoors, so dont assume youll need a covered parking spot. You can simply install a charger on an outside wall near to where you park. And plenty of cars these days can lock the connector to the car to keep bored teens from unplugging it while you sleep. The other thing to mention is that in the US market, this J1772 connector is an industry standard followed by all players... except Tesla. Tesla uses a proprietary charging connector, for better or worse. Im not going to relitigate this whole debacle as Ive done it several times now with increasing levels of exasperated snark, but you should know that throughout this video Im assuming that youre looking for a charger that is directly compatible no adapters needed with literally every plug-in car sold since 2010 and literally every option on the market today except for those models made by That Company. Even if you want a vehicle made by That Company, I would suggest installing a J1772 charger as a simple adapter which is provided with their vehicles will allow you to plug into it. And if you want one of the dozens of options that arent S, 3, X, or Y, youll charge in dongle-free bliss. But theres a good chance that you might not even need to install a charger at all. Music If you drive a fairly average amount, say up to 50 miles a day, one of these little guys might actually take care of you just fine! Level 1 charging is charging on 120V power, and most of the time this involves simply plugging your car into a household outlet through a portable EVSE like this one, which many vehicles come with. Here in the US an EV can draw 12 amps through this sort of supply. At 120V thats 1.44 kilowatts. Thats not a lot, but in a very efficient EV, 50 miles of highway driving might take as little as 12.5 kWh. Assuming some losses that will take about 10 hours of charging to recover. Now, thats admittedly a long time. But Im willing to bet that you sleep for long enough to cover the bulk of your charging. Level 1 charging isnt for everyone and has drawbacks, but I would argue its more useful than many realize. When I first got my 2013 Chevy Volt, which only had about a 40 mile electric range from its 10.5 kWh pack, I just plugged it into a regular outlet. Its small battery pack meant that it only ever took 10 hours for a complete charge. And with a 32 mile round-trip commute, I was driving entirely on electricity every day. My next job was nearly twice as far away at a 60 mile round-trip, but by asking nicely and bringing a cord protector with me to keep folks from tripping on it, I was also able to plug-in during my workday - again, to a bog standard outlet. Usually Id be topped off by the end of my shift, so even then I was doing an all-electric 60 mile commute with only level 1 charging and a 40 mile range. I would shortly move a little further from work, proving that even a 70 mile commute was possible in the Volt with only Level 1 charging at both ends. At least, for the seven or eight warm-enough months of the year.... OK, I spent too much time on this so heres a condensed voiceover. Level 1 charging is slow, and since cold weather decreases driving range, if you live in a cold climate a 40 mile commute might be cutting it close. And I'm not gonna pretend everyone can plug in at work. I just wanted to give you an example of its potential. L1 charging is also less energy efficient since the cars charging electronics need their own power to operate, and with only 1.4 kW controls and monitoring start to take up a larger percentage of the power available to the car. That effect can also be problematic if you park outside and the car needs some power to heat its battery pack, leaving little power for actual charging - but thats very model and circumstance dependent. Plugging into a standard outlet may also present problems depending on what else is on the same circuit. That is especially notable in older homes. And, a 12 amp load on a normal socket is kind of a lot, and old, worn-out receptacles present a hazard. Thats easy to fix by replacing the receptacle, but you should be aware of that. And in case youre watching from one of those 240V countries where boiling a liter of water takes 2 minutes in a kettle, you should definitely not rule out charging off a standard outlet because you have more zippy zappy to play with. The last main drawback of Level 1 charging is that, since you need your car to be charging essentially whenever it can, you wont be able to take advantage of time-of-use rates if your utility offers them. Since my power is a lot cheaper at night, I benefit from having a more powerful supply to my car. So I have one, and the car is programmed to wait to charge until midnight, a feature nearly all EVs offer. My more powerful charger is a 240V charger, so its classified as LEVEL TWO. Now, an annoying thing about the classification Level 2 is that it can be anything from 2.5 all the way up to 19.2 kW. Thats all LEVEL TWO so as a category its just not that useful. Its another reason I dont like Hyundai saying it takes 7 hours on a 240V charger to charge my car. And wait till we get to the fact that sometimes 240 is 208. Anyway, lets say you need or want a Level 2 charger installed. Whats that gonna look like? Here comes that 2-word answer again: it depends. Music First thing I want to say if you are building a home or buying new construction, even if you dont have an electric car right now, ask to have one of these installed in your garage. This is a NEMA 14-50 receptacle, and it supplies enough power to charge virtually any EV from empty to full overnight. Many inexpensive car chargers are out there which plug straight into this nasty fella and its sort-of becoming an unofficial standard EV charging plug over here. To clear up a sort-of mistake of mine, in my video on EVSEs I suggested a NEMA 6-50 which doesnt have the fourth, neutral pin. See, I had already bought a charger from Costco which featured a 6-50 plug and thought since an EVSE doesnt need the neutral that's probably what most EVSEs are gonna plug into but nope! There are way more options for 14-50 plugs out there, possibly because big RVs use that plug so its fairly common at campsites. But moving on Heres another fun angle, do you have an electric clothes dryer and is it close to where you charge your car? If you have a conventional electric dryer, and its in or near to your garage, you already have a 30A 240V circuit at your disposal. And inexpensive chargers are available whichll plug right into it. A 30A circuit wont give you the fastest charge out there, but its over 5 kilowatts which is, trust me, plenty. Now, dont worry, you dont need to keep unplugging and replugging your dryer every laundry day. There are simple splitters on the market designed to let you have both an EVSE and a dryer plugged into the same receptacle, but you will have to remember to unplug your car before you use the dryer should you go that route. Really, though, if you have this option - take it! But if youre not in that lucky boat, to add a charger to your existing home youll need a new circuit run from your electrical panel to wherever you charge your car. If your panel is in or near your garage, this will be a cinch and should only cost you a few hundred dollars. If its farther away, expect to pay more. Since Level 2 chargers are 240/208V and require both hot legs you will need two free spaces in your breaker panel. If you currently have none, you may be able to consolidate some circuits together - consult your electrician for whether or not thats possible or allowed where you live. Oh, and definitely dont assume you need an electrical service upgrade to drive electric - I would argue you almost certainly dont. There are also some pretty exciting developments when it comes to breaker panels which will come up in a future video. But assuming you do have the space for a new breaker in your service panel, well heres broadly whats gonna happen. A new two-pole circuit breaker will take up two spots in the panel, and a two-conductor with ground cable will be connected with the hot wires to the breakers lugs, and the ground to your ground block. That cable will then exit the panel and run through walls, attics, or whenever code allows until it gets to where you want your charger. If youre hardwiring a charger, youll stick a junction box on the wall where that cable ends up, pull the wires into the box and connect them through to an EVSEs incoming power wires. If youre installing a high-power receptacle, its much the same idea. Close up the panel and box, close in the breaker and energize the wires, and youre done. This is a really straightforward process, so much so that Ive done it myself two times now: once for my parents, and later for me. DIYing its not for everyone, and different chargers may need different things - for instance, really big EVSEs actually need a disconnect switch as well. But when it comes to electrical work this is really simple stuff, and the simplicity here is one of many reasons Im much more excited about EVs compared to, say, hydrogen. And when you have a circuit like this available in your home, you are seriously never going to think about charging. You can have a full battery every day and the idea of stopping somewhere to get a top up will just leave your mind. Its truly amazing and I hope everyone who needs to drive can experience this. Music Assuming you have the option of running a new circuit, well now comes the time when youll need to decide how large of a circuit you want to run. And here Id like to whip out my Midwesterner card and strongly convince you to not go overboard. There are a lot of people who think that theyre gonna need a big honkin 50A circuit with expensive 6 gauge wiring to charge their car. And Ive seen multiple folks in two car families presume that theyll need two of those very large and expensive circuits to drive electric. Heres my spicy take; ya dont. The only scenario where you would actually need that much power is if you and your partner *each* drive over two hundred miles every single day. Ive seen so many folks in comments, product reviews, and really wherever else online get into this mindset that they want the fastest charger possible. Theyll immediately start looking for massive high-power charging stations and often seem to assume that if they were to buy a car which *can* charge at 10 kW, they'll need a 10 kW charger for it. I mean, if you can swing it go ahead but thats not how it works. Any car will work on any charger and simply limit its power draw based on a capacity signal coming from the charger. Thats how the standard works. So dont just rush out and buy the fastest charger for your car - its expensive and may come with more headaches than you bargained for. How do you know what sorta charger you actually need? Simple, you just listen to me! Its 7.2 kW. Thatll do fine! Im kidding, but actually not really... I consider that to be the very good speed thatll work for just about anyone but to give you some real information in the realm of electric vehicle supply equipment, amps are what matters first and foremost. Wires of a given thickness can only handle so much current, ultimately making amps allowed on a circuit the limiting factor. So when you look for a charger, youre gonna find them listed by amperage. Thanks to the 80% rule which limits continuous loads to 80% of a circuits capacity, youll usually find two amperages listed: the size circuit a given unit requires, and the actual amperage it can deliver to a car. Now, I know weve been talking in kilowatts and now Im throwing amps at you. Sorry about that. To know the power output of a charger in kilowatts, you simply multiply amps it can supply by the voltage of that supply. That is usually gonna be 240V, but in some settings (mainly in large buildings which have three-phase power) it might be 208V. Its a relatively small difference, so its not worth getting too hung up on, but be prepared for the same charger in a home setting to be just a little bit slower in a commercial setting. Heres a chart of all the common circuit sizes and how much power that nets you. To make comparisons to real life a little easier, we can use a cheat. You will somewhat commonly see circuit capacities be given a miles per hour figure. This is useful, but a little messy. A typical vehicle will gain about 10 miles of range per hour on a 20 amp charger, 15 miles per hour on a 30 amp unit, 20 mph on a 40A unit, and Ill let you do the rest as homework. Oh and Level 1 charging, remember thats just plugging into a household outlet, gives you about 4 miles of range per hour, maybe 5 with a really efficient EV in perfect conditions. Using these miles-per-hour speeds is a decent starting point but now that bigger EVs are on the market, its beginning to fall apart. My car lines up with those figures pretty well at 3 miles per kilowatt-hour on the highway, but of course in winter it needs a little more time since it uses more energy to go the same distance. And a vehicle like an F-150 Lightning will, based on what the EPA says, only gain about as much range per hour its plugged in as the conventional speeds wisdom. So Id argue its better to think about this in energy terms, but giving a charger a speed like that is handy. So handy, Im gonna use it right now! The next thing to do to help you determine how large of a charging circuit you might need is to multiply that miles-per-hour figure by hours plugged into a charger to get a sense of how many miles are regained in that time. Im gonna go ahead and work with a 10 hour overnight charge time since lots of you sleep for 8 hours and a morning and evening routine tacks on a bit at each end. If youve been following along then youll know a 20 amp circuit gets you 100 miles of range overnight, 30 amps gives you 150, 40 amps 200. And again - I'll leave the rest for homework. Notice how the smallest number I just gave you was 100 miles. Im going to stress this point. And Im going to be obnoxious about this because I really need yall to know this and deeply: A 20 amp circuit. Which is not a whole lot. And which can be run with cheap 12 gauge Romex, can make even a crossover-sized EV like mine go 100 miles every single day, charging exclusively in the overnight hours. You do not need a giant charger. Yes, I hear you, what about all those \"but sometimes!\" situations youre thinking of? Like winter, for instance! Well, even if we assume an extreme 40% winter range loss, youre still getting a 60 mile round trip commute recovered every evening. And lets be real, you can probably charge your car for a bit more than 10 hours every night if you really needed to. Now Im not saying everyone should limit themselves to 20 amp circuits for their car chargers. I myself use a charger which is twice as powerful. But Im only doing that so I can drive 100 miles in a day (a thing I regularly do) and top the battery up entirely during off-peak hours, taking advantage of low overnight power rates. If I didnt care about that, frankly my life would not change one bit if I were limited to a 3.8 kW charger. Even my long drives would be recovered overnight, but I might need to charge from 9:00PM to 7:00AM rather than midnight to 5:00 AM. The reason Im so passionate about spreading this gospel is that I know there are lots of you with only 100A service or possibly even less that have ruled out an EV because youve assumed youll need a service upgrade. Im not gonna tell you that you definitely wont because I dont know your particular situation, but you should know that a car charging on a 20A circuit only pulls 16 amps. Thats only 16% of your capacity if you have 100A service. And yet, that can take you quite far. A conservative 20,000 miles annually charging only 10 hours a day and only on work days. Its important to note that you cant just add up the breakers in your panel to see how close you are to using up your service level. In nearly all homes youll find the total circuits far and away exceed the main breakers rating. You need to think through whats on those circuits and how often they get used - an electrician should be able to help you with that. The other reason Im pretty gung-ho about basic level 2 chargers is that the wiring needed for them is cheap and plentiful. So long as your garage or driveway is close enough to the service panel that voltage drop doesn't become an issue, this stuff is all you need and the going rate right now is about $80 for 50 feet. And heck you can step up to the orange stuff, 10 gauge, and run a 30 amp circuit the same length for about $50 more. And, uh, those of us who live where Romex isnt legal can cry in a corner and hope that armored cable is up to code. Anyway, before you get scared off thinking you need panel or service upgrades, Id encourage you to think long and hard about whether thats truly necessary in your situation. I can tell you from experience that a 20A charger on wiring like this would have easily taken care of my 70 mile commute even in the dead of winter, and even with my crossover-sized vehicle. If you have the wiggle room, though, I would personally suggest that you run a 40 amp circuit for a 30 or 32 amp charger. I consider 7.2 kW to be the Certified Midwestern Gold standard of charging. You have to drive an awful lot and with a pretty inefficient vehicle for this to not meet your daily needs. Over 10 hours, such a charger will push something like 65 kWh into a battery pack after losses, which is about 200 miles in my car. Its the vast majority of the pack. And even with a vehicle as large as a Ford F-150 Lightning, thats 130 miles of range recovered every night, nothing to sneeze at. To give you some sense of how Absolutely Fine I consider that charging speed, well at home I do indeed have a 50 amp circuit going to this receptacle so I could charge at 9.6 kW, but I only bought a 7.2 kW charger (because it was a lot cheaper) and I see absolutely no reason to upgrade. Aha, but what if your household, through the magic of having two of them, needs to charge up two cars? What now, Toaster Boy? Well, the first thing Id like to point out is when you get your hands on a 200+ mile EV, a funny thing happens. You stop bothering to plug it in every day. It begins to feel kinda silly never discharging the battery pack below 80%, so you just sorta end up behaving like you did back in the dino juice days and only plug it in when you really need to. I guess I shouldnt speak for everyone but honestly at this point I really only plug the car in after a long journey, otherwise I'll go a solid week without charging it. 200 miles is a long distance, folks! Thatll get you from Chicago all the way across Illinois and solidly into Iowa. I really hope youre not commuting like that. So if you have to charge two cars, first dont jump to the conclusion that youll need to run two circuits. A single charger can easily be shared. If you feel like thats too hard or have some weird parking space restrictions or something like that, well there are also options in which two EVSEs share a single circuit. They talk to each other and split power between two cars if theyre both charging at the same time. But trust me, the simple and free solution of just figuring out a system works pretty friggin great. On Mondays, Carl parks on the left, and on Tuesdays, Brenda does. Alternate and then switch on the weekends. You can do it, I believe in you! And if one of you gets in the habit of backing in you might not even need to switch places! Obviously if youve got a bigger family where more than two people drive cars, this gets more complex and there may very well be value in having multiple charge points in your situation. But think long and hard about how powerful those chargers actually need to be. Remember, a 40 amp circuit can push 200 miles of range in a car over 10 hours. Even if there are four drivers in your household, your daily miles driven need to add up to over 200 miles before that power level really starts to limit you. But were getting well into edge cases now, lets reel it back in a bit. At this point weve covered pretty much everything I think you need to know about AC charging. Bottom line: Level 1 might work for you, so dont rule it out right away. But if you need more power, even a really basic Level 2 charger can take you places. If you can swing a 7.2 kW charger, I think youll be happy no matter what you drive. And going above that level might be necessary, but really only if you drive a big vehicle very far every day. Now lets talk about DC fast charging! Music First, and I know I sound like a broken record, DC fast charging should really only be necessary to enable long-distance travel. I hope you can see why slow AC charging at home (or even at work if you have that option) is where its at - its cheap infrastructure to set up, and its way more convenient to charge while youre sleeping (or working). Then youre never actually waiting. We just need to figure out ways for it to spread outside of the easy targets of single-family housing and the like. I promise you thats a much better future for all involved than turning todays gas stations into fast charging stations. Well need some of those in-town for getting folks out of a jam or for day trips and whatnot. But DC charging should really be the exception and not the norm. Im not going to talk too too deeply about DC fast charging here because Ive made a video already on that tech. Clicky thing, link below, you know the drill. But that video didnt touch much on the more persnickety details of todays battery tech. It was mainly about the chargers and how powerful they are. Which, to be clear, theyre very powerful! These chargers have an output in kW and we can do the same math we did for AC charging to figure out charge times. The quasi-standard 150 (!) kW chargers are fast enough to completely charge my cars 77.4 kWh battery pack in 30 minutes, and a 350 kW charger could do the same in only 13 minutes. Except, they cant. Not because of the chargers but because of the batteries. When DC fast charging, those effects you might be used to with a phone or a laptop are now in play. Todays battery chemistries can only be charged so quickly, and how fast you can do that changes based on a number of factors, most prominently how charged the battery currently is. Right now its common for car manufacturers to give a 10% to 80% charge time. My car manages that in 25 minutes at a 150 kW charger, and 18 on a 350 kW charger. Beyond 80% state of charge, charging speed drops quite a lot because, for physics and chemistry reasons, it becomes a lot harder to push electrons into the battery cells. Ive seen a few folks fixate on this and even view it as some sort of cheating or false advertising on the part of automakers but, well heres the thing. You dont actually need to top up every time you charge. Its a huge waste of your time to get that last 20% when theres another charger 100 miles away. Sure, youll end up needing to charge more frequently since youll effectively only be using 70% of your range between stops, but in my car thats still over 170 miles. Stopping for a 20 minute charge after every two and a half hours of driving isnt nearly as bad as you might think. I legitimately quite enjoyed it, though to be fair my car charges exceptionally quickly. Id be very surprised if just-as-fast-to-charge models dont become the norm pretty quickly, though. Many EVs will help you plan a route in their navigation software which optimizes for the least time required at chargers based on their battery packs charging curve, although you can also play around with apps such as A Better Route Planner if youd like. Or if, like me, you have a car which just doesnt help with route planning. Im not too bummed by my cars omission there, though, because I fully expect DC fast charging stations along highway corridors to proliferate pretty quickly, and make that sort of planning ahead less necessary. However, there is one thing my car doesnt really do, at least not yet, that it absolutely needs to: battery preconditioning. Todays battery chemistries are happiest within a certain temperature range. Nearly every EV on the market - even the original Chevy Volt - has means to heat and cool the battery pack to keep it in its happy place. But when DC fast charging, to get the fastest possible speeds the battery cells need to be pretty warm - warmer than they otherwise need to be to drive. And in the winter, if the battery isnt warm enough DC fast charging may be not so fast. At least, not at first. Once the car realizes its on a fast charger itll start heating the pack up as fast as it can, but since the battery is so massive, that can take a while. You could easily see a 20 to 30 minute increase in charging time when its cold out. Certain EVs, notably Teslas and a few others as well, will start expending energy to warm up their battery packs as you approach a DC fast charger. This battery preconditioning allows them to accept maximum power, or close to it anyway, as soon as its plugged in. This is an important feature that needs to roll out to all EVs, in my opinion. Frankly I dont care if its as fancy as Tesla's or Porsches implementation where it knows youre headed to a fast charger because youre navigating to one - as a matter of fact I kinda dont like that as someone who navigates with Waze using Android Auto. Id rather there just be a button I can press or a voice command I can give when Im 15 miles or so from the next charger. But I do appreciate how the automated schemes would keep me from forgetting to do that. With all this said, the biggest issue with DC fast charging today is that we barely have enough chargers right now. Already some popular corridors are experiencing charging queues, and this will get worse as more EVs are sold. The good news of course is more EVs that are sold means theres more demand for chargers, but were in the midst of growing pains. Like, for instance, charger reliability is a growing concern, and some network operators are less-than-great at operating their networks. My personal belief is that a lot of this comes from the fact that DC fast charging technician is a very rare job title right now, and with the current makeup of sparsely-spaced chargers, getting to them when they need parts or repair is a chore. I dont mean to use this as an excuse, but it does make me fairly confident this will get better with time. But lets move on from DC fast charging and finish up with some pointers on factors which affect your driving range. Music Ive brought it up a few times already but if you live in a cold place, in winter driving range drops. And Id like to tell you its just a little bit, but unfortunately it can be significant. I do want to stress again, though, that with todays EVs, so long as your commute is reasonable and you have access to a charger at home, these range losses are unlikely to impact your day to day needs. They will extend charging time and cause you to spend a little more money on charging, but when you are only driving an average of 40 or even 80 miles a day, its not a big deal. Long distance driving does have some challenges, though. You might want to ask, why does this cold-weather range loss happen? Well, a huge part of the range loss comes from using the cabin heat. In a combustion vehicle, the explodey machine under the hood is so bad at turning chemical energy into mechanical energy that it ends up with all this waste heat it needs to get rid of. Theres literal explosions happening over a thousand times per minute, and explosions are hot. Dealing with that heat is what the cars cooling system and radiator is for, and by running a second circuit of engine coolant into the cabin and through a small radiator called the heater core, the excess heat from the combustion can be used to keep you warm. Since it would otherwise be wasted, its free heat. Electric vehicles, though, dont produce much waste heat at all. This is cool! Its why the world is excited about them, theyre just much, much, much more energy-efficient. But that means that when you want to warm the cabin, you have to take energy out of the battery pack. And that leaves you with less for driving the car. With an EV that has a resistive cabin heater, youll start to notice range dropping around mid-fall. Basically as soon as you start needing to use the heater. It will be pretty mild at first, but once youre into the true winter months, you can expect about 30% range loss. My familys 2017 Chevy Bolt went from reliably hitting 230 miles of highway range in the summer down to between 160 and 170 from December to early March. Using seat heaters more and cabin heat less can help, but whenever you need to use your defroster youre kinda stuck running the heat. Unless of course you have one of those cool direct-heated windshields, a feature I think should be standard on EVs! Speaking of features, one feature thats finally spreading to more and more EVs is, drumroll please, HEAT PUMPS! If youre not familiar with this channel, I love heat pumps. Theyre the hottest cool things around. By doing what essentially amounts to running an air conditioner backwards, you can collect and concentrate heat energy from outside and move it inside. And since pretty much every EV out there has air conditioning, making it reversible was an obvious next step. I don't know why it took so long. Doing this allows an EV to cut its energy consumption for cabin heat by up to 75%, as moving heat takes a lot less energy compared to creating heat. For the 2022 model year, Hyundai gave all-wheel-drive Ioniq 5 models a heat pump. Im hoping they make that standard soon because let me tell you, it makes a big difference. I took delivery of my car in February so I havent yet experienced the worst of the worst winter conditions, but from what I did get to see earlier in the year, a 15 to 20% winter range drop seems fairly typical. When it gets extremely cold, the heat pump does need to be supplemented by a resistive heater so larger range drops are possible, though. Oh, and Id like to dissuade fears of running out of battery juice should you get stuck in traffic or worse stranded in a blizzard. The cars heater needs to work a lot harder when youre in motion because all that wind rushing against your car does a great job of sucking heat right out of it. But when youre slowed or stopped, thats not happening. At least, not nearly as much. In the Chevy Bolt youve seen some adventures in, which doesnt have a heat pump, I noticed that when stationary, even in subzero temperatures, the car was only consuming between 1 and 2 kilowatts, with the occasional blip up to 3 kW, to keep the cabin and battery pack warm. So, even with only one third battery charge, 20 kWh, you could expect that car to keep you warm for at least 5 hours, probably more, and you can easily stretch that just by turning the temperature down and bundling up. Aside from winter, lets talk about what other things affect your range. Earlier I mentioned that highway driving is less efficient than stop-and-go. Why is that? Well, with all else being equal, the single greatest factor to driving efficiency in an EV is your average speed. See, as you go faster, your car has to work a lot harder to push itself through the air. As a matter of fact, wind resistance and rolling resistance are essentially the only two things working to slow your car. Both increase with vehicle speed, but the drag created by air is not a linear function - as a matter of fact when calculating drag force, velocity is squared. So the faster you go, the harder a motor needs to work to push your car the same distance, and the effect gets worse as speed increases. Thats not unique to EVs, of course. The same goes for any vehicle. But because the vehicle doesnt use any energy when its not actively trying to push itself forward, you dont get the waste of an idling engine. Even better, regenerative braking allows the car to get back most of the excess energy it used to accelerate from a stop when you return to a stop or slow down. Regen braking and zero idling waste make average vehicle speed essentially the only factor when it comes to energy efficiency. That is of course until we talk about wind. When youre driving into a 10 mile an hour headwind, the effect of the wind is exactly the same as if you were driving 10 miles an hour faster than you really are. So wind conditions can rather drastically affect your driving range. On the road trip I took with Aging Wheels, we started our journey driving right into a nasty headwind, which reduced my cars efficiency from my typical average of 3.2 miles per kWh down to 2.4 miles per kWh. That was about a 25% increase in power consumption, and thus resulted in a 25% drop in range from what I was expecting. In the end, this wasnt a problem. Our route planner was being so conservative that we actually hit the expected energy consumption almost exactly. And, heres the other thing to keep in mind, if we absolutely needed to stretch our driving range theres a really easy way to do it: just slow down. Thanks to that head wind, we experienced a range similar to if we were driving perhaps 90 or 95 miles an hour, even though we were really doing 70. While its obviously annoying, dropping to 55 or 60 miles an hour would immediately have stretched our driving range considerably. So if all else fails, just slow down. Wind, average vehicle speed, and cold weather are definitely the three biggest factors that will impact your driving range. But what surprised me the most when I started driving electric was the impact of wet roads. Light to moderate rain doesnt have too much of an effect, but when its raining heavily enough that water is pooling on road surfaces, the extra drag created as your tires work to push it out of the way is much more substantial than I would have expected. The absolute worst driving conditions when it comes to range are windy wintry days with slushy road surfaces. Add enough snow to keep you using the defroster and you have a recipe for heavy range loss. Its for these reasons that I feel we need much more density in DC fast charging options along highway routes than we currently have or are planning for. 50 miles apart is a decent target, and realistically even if I had a 75% range loss that would at least keep me on the road. But since driving range can be less predictable than is ideal, I hope to see far more DC charging options. If we keep driving cars on long trips at the rate we do now, we are eventually going to need as many charging stops along the highway routes as there are gas stations today. So theres a lot of work to be done, to be sure. But perhaps my favorite thing about electric cars is the chicken-and-egg problem that normally comes with changing fuels is sidestepped. Those of us with home charging can get an electric car right now. It can take care of all of our daily needs and we dont need to rely on public charging. And now that those vehicles exist, theres a market for DC fast charging on highway routes. And when owners of todays EVs sell them, less expensive options are on the market which encourages more adoption, and that will increase pressures to install charging infrastructure at apartment complexes and other hard-to-serve areas. Theres a lot of work to be done, and many would argue that electrifying cars is just trading one problem for another. And to be honest, Im increasingly upset with how car-centric our infrastructure and cities tend to be. But frankly, right now I need a car. And Im not gonna poo poo harm reduction. The fact is going electric is really quite easy once you understand the ins and outs. If you can run a wire to use a dryer you can charge a car and go real far. Now we just have to do it. Thanks for watching. energetically smooth jazz Hey, Im gonna be recording an unscripted video on my second channel talking about some potential options for multi-family buildings and other finicky-to-serve places. Clicky thing, link below, you know the drill. How to choose the right one for your *sigh* didnt get through the FIRST LINE! Here we go. What is happening? What... what is that? Oh, its velcro from the thing. Got it. Any car will work eh, Bah! PEH! PLEH! BAH! with different pack sizes to chooge from. Chooge? But again, getting my getting a getting myself ahead of here? It puts a lot of wear and tear oh no, I changed that on purpose you dingo! I hope those of you who like That Company aren't too put off by my suggestion that folks install a J1772 charger. It just seems to me that there's more value in the standard which benefits from industry cooperation than the one made by a single, if currently dominant, player. Don't like putting all me eggs in one basket, y'know.",
    "transcript_keywords": [
        "car",
        "charging",
        "charger",
        "battery pack",
        "battery",
        "miles",
        "charge",
        "cars",
        "fast charging",
        "power",
        "charging time",
        "range",
        "time",
        "energy",
        "electric car",
        "pack",
        "level",
        "chargers",
        "driving",
        "circuit"
    ],
    "transcript_entity_values": [
        "kWh",
        "20,000 miles",
        "February",
        "2017",
        "Gallon",
        "dozens",
        "240 volts",
        "32 mile",
        "2.5",
        "$0.15/",
        "170",
        "Ioniq 5s",
        "only 10 hours",
        "10 watt-hours",
        "Mondays",
        "two",
        "as miles per gallon",
        "Brenda",
        "3",
        "the winter",
        "20",
        "wintry days",
        "2",
        "at least 5 hours",
        "40%",
        "watt-hours",
        "10.5 kWh",
        "one hundred watt",
        "170 miles",
        "fourth",
        "NEMA",
        "several hours",
        "40",
        "30 minutes",
        "Midwesterner",
        "2.4 miles",
        "four",
        "one",
        "over 200 miles",
        "90 or 95 miles an hour",
        "watts",
        "only overnight",
        "TWO",
        "1 hour",
        "7:00AM",
        "5",
        "15 to 20%",
        "10 hour",
        "18",
        "10 miles an hour",
        "every night",
        "50%",
        "150 kW",
        "240V",
        "Ford",
        "50A",
        "9.6 kW",
        "as little as 12.5 kWh",
        "Hyundai",
        "gallon",
        "over 5 kilowatts",
        "up to 75%",
        "32",
        "only 1.4",
        "20 hours",
        "80 miles",
        "about three",
        "10% to 100%",
        "10 to 100%",
        "only 100A",
        "Carl",
        "12",
        "a little less than 7 hours",
        "20 to 30 minute",
        "Waze",
        "70",
        "1.44 kilowatts",
        "19.2",
        "2013",
        "15 miles",
        "a few hundred dollars",
        "10 kilowatts",
        "up to 100 miles",
        "100%",
        "gallon",
        "Miles",
        "11.5 kW",
        "AC",
        "more than 10 hours",
        "about $50",
        "a 10 mile an hour",
        "first",
        "4 miles",
        "Ioniq 5",
        "these days",
        "70%",
        "the summer",
        "Y",
        "240/208V",
        "70 mile",
        "200+ mile",
        "about 30%",
        "25%",
        "5:00 AM",
        "16",
        "kWh",
        "six minutes",
        "more than two",
        "30A",
        "208V.",
        "77.4",
        "miles per kilowatt-hour",
        "three",
        "about 4 miles",
        "77.4 kWh",
        "10 hours",
        "zero",
        "65 kWh",
        "200 miles",
        "two and a half hours",
        "eight",
        "20 mph",
        "6-50",
        "every day",
        "3",
        "evening",
        "20A",
        "1",
        "3 miles per kilowatt-hour",
        "3 kW",
        "overnight",
        "only about 90",
        "Level 1",
        "14-50",
        "below 80%",
        "Chicago",
        "Tuesdays",
        "one thousand watt-hours",
        "10 watt",
        "Porsches",
        "EVSE",
        "Over 10 hours",
        "watt-hour",
        "Level 1",
        "a miles per hour",
        "only one third",
        "a mile",
        "kWh",
        "150",
        "kilowatt-hours",
        "7 hours",
        "256 miles",
        "13.3 kWh",
        "Level 2",
        "80%",
        "20 kWh",
        "one hour",
        "FIRST",
        "up to 50 miles",
        "midnight",
        "today",
        "Iowa",
        "0%",
        "zippy zappy",
        "20 minute",
        "F-150 Lightning",
        "between 160",
        "kW",
        "the Chevy Bolt",
        "EV",
        "months of the year",
        "Romex",
        "0",
        "10 watt light bulb",
        "seven",
        "40A",
        "about $80",
        "last 20%",
        "todays EVs",
        "winter months",
        "40 mile",
        "between 1 and 2 kilowatts",
        "kW.",
        "10",
        "100 miles",
        "about 232 miles",
        "60 kWh",
        "5%",
        "DC",
        "7.2 kW",
        "December to early March",
        "hours",
        "55",
        "10 kW",
        "kilowatt-hour",
        "60",
        "48",
        "30A 240V",
        "every single day",
        "6.73 hours",
        "2010",
        "Aging Wheels",
        "2 minutes",
        "10% to 80%",
        "one tenth",
        "Volt",
        "15 miles per hour",
        "200",
        "about 200 miles",
        "day",
        "half",
        "6 hours",
        "3.8 kW",
        "58 kWh",
        "kW",
        "Chooge",
        "half to six hours",
        "77.4 kW-hours",
        "30",
        "50 feet",
        "every week",
        "daily",
        "25 minutes",
        "5 kilowatts",
        "just like miles per gallon",
        "10%",
        "2022",
        "only 30 kWh",
        "8 hours",
        "120V",
        "only 16%",
        "gallons",
        "Tesla",
        "Costco",
        "20A 240V",
        "the overnight hours",
        "over an hour",
        "12 hours",
        "6",
        "at least 30 kilowatt-hours",
        "50",
        "about 10 miles",
        "95%",
        "winter",
        "Chevy Volt",
        "only 13 minutes",
        "3.2 miles",
        "75%",
        "12",
        "EPA",
        "US",
        "350 kW",
        "mid-fall",
        "Watt-hours",
        "Hyundais",
        "9:00PM",
        "130 miles",
        "Illinois",
        "A Better Route Planner",
        "2022 model year",
        "Teslas",
        "208",
        "50 miles",
        "60 mile",
        "the Certified Midwestern Gold",
        "about 10 hours",
        "First",
        "240",
        "second",
        "60 miles",
        "230 miles",
        "60 kilowatt-hours",
        "DIYing",
        "annually",
        "two hundred miles",
        "11.5",
        "2.00",
        "100A"
    ],
    "transcript_entity_types": [
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL",
        "LAW",
        "TIME",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "QUANTITY",
        "PERSON",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "TIME",
        "PERCENT",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "ORDINAL",
        "ORG",
        "TIME",
        "CARDINAL",
        "TIME",
        "PRODUCT",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "LOC",
        "TIME",
        "CARDINAL",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "PERCENT",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "PERCENT",
        "PERCENT",
        "CARDINAL",
        "PERSON",
        "DATE",
        "DATE",
        "TIME",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "QUANTITY",
        "MONEY",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "TIME",
        "PERSON",
        "QUANTITY",
        "ORG",
        "TIME",
        "MONEY",
        "QUANTITY",
        "ORDINAL",
        "QUANTITY",
        "PRODUCT",
        "DATE",
        "PERCENT",
        "DATE",
        "ORG",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "PERCENT",
        "TIME",
        "CARDINAL",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "DATE",
        "DATE",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "EVENT",
        "CARDINAL",
        "PERCENT",
        "GPE",
        "DATE",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "ORG",
        "TIME",
        "TIME",
        "LAW",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "FAC",
        "CARDINAL",
        "TIME",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "LAW",
        "PERCENT",
        "QUANTITY",
        "TIME",
        "ORDINAL",
        "QUANTITY",
        "TIME",
        "DATE",
        "GPE",
        "PERCENT",
        "PERSON",
        "TIME",
        "PRODUCT",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "DATE",
        "PRODUCT",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "ORG",
        "MONEY",
        "PERCENT",
        "ORG",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "GPE",
        "QUANTITY",
        "DATE",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "TIME",
        "CARDINAL",
        "CARDINAL",
        "PRODUCT",
        "DATE",
        "TIME",
        "DATE",
        "ORG",
        "TIME",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "CARDINAL",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "GPE",
        "PERSON",
        "TIME",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE",
        "DATE",
        "TIME",
        "QUANTITY",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "TIME",
        "TIME",
        "CARDINAL",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "ORG",
        "PRODUCT",
        "TIME",
        "TIME",
        "TIME",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "PERCENT",
        "DATE",
        "ORG",
        "TIME",
        "QUANTITY",
        "PERCENT",
        "CARDINAL",
        "ORG",
        "GPE",
        "QUANTITY",
        "DATE",
        "TIME",
        "PRODUCT",
        "TIME",
        "QUANTITY",
        "GPE",
        "ORG",
        "DATE",
        "PERSON",
        "CARDINAL",
        "QUANTITY",
        "QUANTITY",
        "ORG",
        "TIME",
        "ORDINAL",
        "CARDINAL",
        "ORDINAL",
        "QUANTITY",
        "QUANTITY",
        "QUANTITY",
        "PERSON",
        "DATE",
        "QUANTITY",
        "CARDINAL",
        "MONEY",
        "CARDINAL"
    ]
}