{
    "id": "izxNzd_0SvQ",
    "title": "Recording police brutality: how one snap decision changed this town",
    "channel": "The Verge",
    "channel_id": "UCddiUEpeqJcYeBxX1IVBKvQ",
    "subscriber_count": 3390000,
    "upload_date": "2020-08-31T13:00:16Z",
    "video_url": "https://www.youtube.com/watch?v=izxNzd_0SvQ",
    "category": "Science & Technology",
    "tags": [
        "police brutality",
        "police violence",
        "police",
        "brutality",
        "violence",
        "video",
        "videos",
        "protests",
        "protest",
        "black lives matter",
        "blm",
        "blm protests",
        "recording",
        "phone",
        "camera",
        "social media",
        "civil rights",
        "witness",
        "danger",
        "consequences",
        "racism",
        "systemic racism",
        "baytown",
        "texas",
        "Isaiah Benavides",
        "george floyd",
        "Breonna Taylor",
        "Jacob Blake",
        "cops",
        "recording video",
        "body cameras",
        "technology",
        "tech",
        "verge",
        "the verge",
        "police videos",
        "protest videos",
        "ferguson",
        "officer brown"
    ],
    "views": 2550911,
    "likes": 41342,
    "comments_count": 5924,
    "description": "As Black Lives Matter protests have spread across America, more and more people have begun sharing clips of police violence online. Its not just happening at protests, either: sometimes police violence is captured in everyday life.  On June 2nd, a traffic stop in Baytown, Texas turned violent when a couple friends began to question the arrest of a black man. One man recorded the clip and it went viral, but it didnt end there. It set off a ripple effect across his life and the city of Baytown, Texas.  What happens when someone uses technology to glare back at police interactions? For Isaiah Benavides, it may have put him in harms way.  This video is part of a larger project at The Verge that looks at the power and consequences of filming police violence. Verge Science investigates what police body cameras dont show you  check that out here:   Read more:     Subscribe:  Subscribe to Verge Science:   Read More:  Community guidelines:  Wallpapers from The Verge:  More about our podcasts:   Like The Verge on Facebook:  Follow on Twitter:  Follow on Instagram:",
    "description_links": [
        "https://bit.ly/2YNuFFY",
        "https://bit.ly/2QDuZ5A",
        "https://bit.ly/3hLf2Gq",
        "http://goo.gl/G5RXGs",
        "http://bit.ly/2FqJZMl",
        "http://www.theverge.com",
        "http://bit.ly/2D0hlAv",
        "https://bit.ly/2xQXYJr",
        "https://www.theverge.com/podcasts",
        "https://goo.gl/2P1aGc",
        "https://goo.gl/XTWX61",
        "https://goo.gl/7ZeLvX"
    ],
    "transcript": "On June 2nd, outside this convenience store in Baytown, Texas, Isaiah Benavides saw his friend being pulled over. He took out his phone and pressed record. - 'Cause he's Black, huh? - I didn't do nothing. - You're cussing in public. Put your hands behind your back. - As he filmed, the incident got pretty violent. - Put your hands behind your back. And if you don't get back, I'ma break your shit. - But it didn't end there. Isaiah posted the video online. It went viral and set off a string of consequences for Isaiah, his friends, the local police, and the city of Baytown. All from one video clip and one snap decision to hit record. - Shit just went down, bro. I think they're probably gonna try to get me next. - It all started after Isaiah and his two friends, Skylar Gilmore and Isaiah Phillips, left a barbecue. - Well, Jostin was leaving and we were going to get more beers from the store for the barbecue. And Jostin got pulled over in his car. - We noticed Officer Brown pulling over our friend. - Their friend, Jostin Moore, had been pulled over for a traffic violation. - That's Officer Brown. - All of Baytown recognizes Officer Brown. - Officer Brown is known in Baytown for doing some shady stuff. So we just wanted -- I just wanted to make sure that our friend Jostin was alright. - They pulled him over just 'cause he's Black. - That's fucked up, bro. - Black lives matter. - Officer Nathaniel Brown had previously been accused of targeting and harassing Black Baytown residents. - Like, we started talking about how he was doing this shady stuff in the past, how he sicced a dog on somebody. - He's the one that sicced the dog. Oh, 'cause you Black, bro. A hundred percent 'cause you Black. - I guess he overheard us talking about him. - He clearly had a problem with us basically watching him. - He proceeded to walk up to Skylar and I was just standing there behind Skylar like that's not right. - I didn't do nothing. - You're cussing in public. Put your hands behind your back. - Whoa, whoa, whoa. - I get thrown against a wall, thrown onto the ground, and then I get kneed in the face. - Put your hands behind your back, hands behind your back. - What happened next? I mean, he basically got up from Skylar, walks over to the other officer and he says, \"Just to make things fair across the board.\" - I gotta be fair across the board. - And grabs the other officer's handcuffs, and then that's when he grabbed Isaiah. - Turn around. - They're arresting him for nothing. - They slammed me and left a dent on my face. - If you don't get back, I'ma break your shit. - I'm not doing nothing to you. - I was hoping they didn't draw their guns. That's all I was thinking in my head. They cannot draw their guns on me today. - What surprised me is that I was getting arrested for talking on the sidewalk. - I was confused, but I was enraged at the same time. So I had to use my mind, take a step back, and keep using the camera that I used. And that's how we got that video out like that. - Skylar and Isaiah Phillips were arrested for disorderly conduct for using profanities in public. Jostin was arrested for the traffic violations and a prior warrant related to a car accident. What happened next is the reason we know this story and so many others like it. Later that night, Isaiah and another friend, Dajone Mitchell, posted the video online. - Isaiah and Skylar were in jail. From there, Dajone put the video to Twitter, and I put it on Facebook. - By the time we got to see the video, it already had a couple million views. - Not even 24 hours later, we had, like, eight news interviews back to back to back. - After the incident went viral, the friends joined other victims of police brutality in Baytown to stage a protest. - The march was organized due to several incidents involving the Baytown Police Department. - And that really made our cause bigger, and that ended up causing the petition to form itself. We ended up getting Officer Brown fired. - The charges against Skylar and Isaiah Phillips were also dropped. The Verge was unable to reach Officer Brown for comment. - We're happy that it went viral because our justice is gonna be served soon, but at the same time, like, that's not the video you wanna be known for going viral. - Isaiah had never filmed the police before this moment. - I'ma get out and record. - So what made him hit record now? - He was by himself without any other recording on him, then they could do whatever they want. Normally, it's supposed to be he says, she says, but if you say something and the officer says something, it doesn't go that way. It's the officer said something and that's it. - When they see a cellphone being pulled out, I think law enforcement are aware of the potential accountability that may come with these recordings. - Chaz Arnett teaches law at the University of Maryland, and he studies the role of technology in situations like this one. - Typically, what we see -- we see this in some of the footage from most recent Black Lives Matter protests -- is that when cameras are introduced in these scenarios, law enforcement oftentimes take that as a threat to what they are doing. - That's what Isaiah thinks happened with Officer Brown. - He clearly had a problem with us basically watching him. I feel like that's the exact reason why everything happened. I feel like he was angry that we weren't letting him do what he wanted to do, so he came and took it out on us. - I mean, I think that's a reflection of law enforcement knowing that there is some level of power connected with being able to document these episodes. It is seen as a way of attempting to take away and flip on its head that imbalanced power relationship. - Skylar and Isaiah Phillips' lawyers believe the video was key in getting the charges promptly dropped. But using technology this way can have scarier consequences, too. - For the next couple of weeks, we were getting, like, watched by the officers. At the beginning, there was just one cop car that would be watching us, and now after the protests, that's whenever they'd have different types of cop cars that would watch us at different times. It made me feel like I was gonna get picked up by a black van one day. - Anytime an individual is attempting to document or speak to what is happening in terms of law enforcement and police abuse, they become targets. - The Verge reached out to the Baytown Police Department but did not receive a response before publishing this story. - Yeah, we've been getting a lot of anxiety. Could barely even sleep. Every time I see a cop, I'm not even doing nothing wrong and I'm just already, like, my heart's already racing. It brings stress to not only us but to our families. I mean, they're scared 'cause this simple matter, it can cost us our lives. - In spite of everything that happened, Isaiah feels like he did the right thing. - I don't regret any of it. I feel like it would have been swept under the rug like nothing happened. Because that's what happens almost every day whenever somebody... even if somebody gets a video of it. - Recording the police can be a risky and painful act. But as we're seeing across the country, it is also powerful. - Particularly with the killing of George Floyd, I think that video has ignited and set off these global reckonings with law enforcement. - And that movement clearly helped Baytown residents have their own reckoning. - This incident really changed how our community really does things because everybody really took a part in taking the movement and making it into something else. The more people across the country doing good and making more protests, the more my community and other communities would do the same just simply because other people are doing it. - I feel like more people should record the police, not even if it's just their problem. I feel like even if you see somebody else that's in a problem, I feel like you should record it. Because nobody is gonna believe our voices. The whole world believed the video, though. This video was part of a larger project at The Verge that looks at the power and consequences of filming police violence Our other YouTube channel Verge Science looks at what police body cameras don't always show you",
    "transcript_keywords": [
        "Officer Brown",
        "Isaiah",
        "Isaiah Benavides",
        "Officer",
        "Baytown",
        "Brown",
        "Baytown Police Department",
        "back",
        "Black",
        "video",
        "Isaiah Phillips",
        "Skylar",
        "police",
        "Officer Nathaniel Brown",
        "Baytown Police",
        "feel",
        "Texas",
        "June",
        "Black Baytown",
        "Jostin"
    ],
    "transcript_entity_values": [
        "24 hours",
        "Chaz Arnett",
        "one",
        "a couple million",
        "Twitter",
        "today",
        "the University of Maryland",
        "Black Baytown",
        "Verge",
        "Isaiah Phillips",
        "eight",
        "Later that night",
        "June 2nd",
        "Skylar",
        "almost every day",
        "the Baytown Police Department",
        "the next couple of weeks",
        "Isaiah",
        "Verge Science",
        "Skylar Gilmore",
        "Isaiah Phillips'",
        "Brown",
        "Jostin Moore",
        "Dajone Mitchell",
        "two",
        "Jostin",
        "Baytown",
        "Facebook",
        "Nathaniel Brown",
        "George Floyd",
        "Texas",
        "Baytown",
        "YouTube",
        "Jostin",
        "Isaiah Benavides",
        "A hundred percent"
    ],
    "transcript_entity_types": [
        "TIME",
        "PERSON",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "ORG",
        "LOC",
        "ORG",
        "PERSON",
        "CARDINAL",
        "TIME",
        "DATE",
        "PERSON",
        "DATE",
        "ORG",
        "DATE",
        "PERSON",
        "ORG",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "PERSON",
        "CARDINAL",
        "PERSON",
        "GPE",
        "ORG",
        "PERSON",
        "PERSON",
        "GPE",
        "PERSON",
        "ORG",
        "ORG",
        "PERSON",
        "PERCENT"
    ]
}