{
    "id": "j-3or4KACMI",
    "title": "IT'S SO BIG! - LG 45GR95QE",
    "channel": "ShortCircuit",
    "channel_id": "UCdBK94H6oZT2Q7l0-b0xmMg",
    "subscriber_count": 2310000,
    "upload_date": "2023-02-25T19:50:20Z",
    "video_url": "https://www.youtube.com/watch?v=j-3or4KACMI",
    "category": "Science & Technology",
    "tags": [
        "shortcircuit",
        "SC",
        "unboxing",
        "first impression",
        "tech",
        "gadget",
        "home",
        "fun",
        "buy",
        "LG",
        "Monitor",
        "cool",
        "wide",
        "big",
        "wowzers",
        "xeneon",
        "ark",
        "flex",
        "samsung"
    ],
    "views": 506670,
    "likes": 12872,
    "comments_count": 1088,
    "description": "Thanks to Secret Lab for sponsoring today's video! Check them out at   LG makes GREAT monitors and their new 45\" curved gaming OLED is so good, that even though Plouffe has an AW3423DW, he's thinking about making the switch. Is one big monitor a productivity nightmare or is having discord open in the background really that big of a deal when your screen is this nice?  Buy a LG 45GR95QE Monitor:   Purchases made through some store links may provide some compensation to Linus Media Group.  Want us to unbox something? Make a suggestion at    GET MERCH:   LTX 2023 TICKETS AVAILABLE NOW:   GET EXCLUSIVE CONTENT ON FLOATPLANE:   AFFILIATES, SPONSORS & REFERRALS:   OUR WAN PODCAST GEAR:   FOLLOW US ELSEWHERE ---------------------------------------------------   Twitter:  Instagram:  TikTok:  Facebook:   CHAPTERS --------------------------------------------------- 0:00 So big, so fast, so cool 0:43 Unboxing 3:05 Design and ports 5:01 Sponsor - Secret Lab 5:28 Initial impressions 6:39 HDR and screen glare impressions 8:18 OSD, RGB, and stand adjustments 9:26 Gaming impressions and thoughts on the curve 12:06 Overall thoughts, pricing, and competitors 13:45 Outro",
    "description_links": [
        "https://lmg.gg/SecretlabSC",
        "http://bit.ly/40BzpwS",
        "https://lmg.gg/7s34e",
        "https://lttstore.com",
        "https://lmg.gg/ltx23",
        "https://lmg.gg/lttfloatplane",
        "https://lmg.gg/masponsors",
        "https://lmg.gg/podcastgear",
        "https://twitter.com/ShrtCrctYT",
        "https://www.instagram.com/shortcircuityt",
        "https://www.tiktok.com/@linustech",
        "https://www.facebook.com/ShortCircuitYT"
    ],
    "transcript": "(host groaning) (box slams) - We got the GR95QE from LG. This thing is a huge. It's a 45-inch curved ultrawide OLED that's gonna do 240 hertz. Oh, it's so fast. (box slams) It's so fast. LG didn't even sponsor, whoa. (chuckling) - [Andy] Don't drop your knife. (host laughing) - LG didn't even sponsor this one. They're so confident that, you know, these are gonna be beautiful displays that they just sent it to us and said, \"Hey, open it up. Check 'em out.\" And I can confirm. I've seen a lot of these panels, specifically. They're kinda the new hotness this year for OLED, so we're getting 'em in ASUS, in Acer. Like, everyone's making this monitor, but LG makes the panels. (styrofoam scraping) Ooh, okay. I hate styrofoam. I hate it so much. I actually opened this upside down, which is a little unfortunate 'cause now I've just got the panel kinda hanging out here. I'm an idiot. And there's handles here that's always gonna tell you whether it's right-side up or not. It's kind of expensive, but it's pretty good We'll get a box. LG, life's good. We've got our remote. This thing does come with a remote, so I'm actually pretty excited to check that out. What else we got? A bunch of cables. We got a cable clip or something. Yep, looks like that's for clipping cables on the back of your monitor. HDMI, probably a 2.1 cable since this is a 240-hertz monitor. Yep, 8K60. Power brick, for you external power brick people who love a slim design on the monitor, and then you're okay with this big, beefy power brick on the ground. Power brick's rated for 210 watts. I think this normally draws about 160, 170, but it can spike depending on how bright you're making your screen. What else they've got here is a USB A-to-B cable as well as a DisplayPort cable, probably just 1.4 since there's only 1.4 connections on this monitor. I know DisplayPort 2.0 is barely a thing, but like, I'd really like to see it on more monitors, especially when you're paying a hefty price. Oh, okay, here we go. This is what I really wanted. Display Quality Assurance Report, telling us all the measurement conditions, which is nice. Like, the color temperature, they checked that, and the input signal and test equipment and all that. One piece, two piece. We'll connect our stand in a little bit here. It's a 45-inch display with a 21:9 aspect ratio. You're getting an ultrawide here, and it has an 800R curvature. So like, the reason why this box is so thick is so that it can actually support the monitor's curved nature inside this box. We've got our stand. We're gonna put it together here. Luckily, it's one of those super easy-to-put-together stands where you just pop it in and you get the screw and you screw it down. I love these. (stand clicking) It clicks down, but like, this cardboard... I highly recommend that you actually do this on the ground. It's just gonna be easier to pull it outta the box. You're not gonna have to worry about dropping it on the floor, but we're, you know, doing it the hard way. And I'm gonna see if I can, like, just lift this thing up. You ready? Okay. - [Andy] Go for it. - Oh my god. Oh no. Get out of there. Ah. (grunts) (host giggling) Looks squeaky clean. Don't get me wrong. I've checked out the Samsung Odyssey Ark, and that is also huge, but that's, like, arguably a TV. This thing is still just straight up a monitor. And oh my god, it's enormous. Wow. What a peel. (plastic flapping) One problem is that it's such a big display. And this isn't LG's fault. This is gonna happen on just about any display this size, but it's kinda wobbly. Like, I'm definitely, you know, giving it a bit more than would normally hit it. I think that, ultimately, you're gonna wanna put this thing on an arm, and you can. It looks like it's 100 x 100 VESA mountable. The stand isn't bad. It's definitely not the stand's problem. It's just the fact that this thing is huge. It's gonna be a problem to do that as well because this thing is 24 pounds with the stand, and the panel itself is something like 18 pounds. It does have a bunch of motion. You can do height adjustment, something the Xeneon Flex can't do, by the way. There's no height adjustment on that guy. It can also swivel, not much. You're only getting a few degrees in either direction. But you know what? It's better than nothing. You can definitely adjust it in your setup once it's there. And then I think it can tilt. It's not a bad amount of tilt either. We've got two HDMI 2.1 ports, a DisplayPort 1.4, optical audio, and a USB-B on the other side as well as two USB-As and our DC-in for power. And then there's also a headphone jack down here with DTS Headphone:X as well as Kensington lock. I'm gonna put the cable cover on. Yeah, that was easy. It's a pretty beefy back here, so while the rest of the panel itself, thanks to it being OLED, it's super thin, you've got a lot of the computer components inside here, like, your motherboard and everything. And honestly, that's kind of why I'm perfectly fine with having the power brick, like, up here. Like, if you're already taking up this much space, take up a little more, and then I don't have to take it up on the floor, but that's okay. I don't know if this is the UltraGear logo or the LG logo, but either way, looks good. We're gonna turn it on, find out, but not before a word from our sponsor, Secretlab. Secretlab chairs are designed to keep you comfortable for those long nights of work and play. Their TITAN EVO 2022-series chair offers four-way lumbar support, comes with a magnetic memory-foam head pillow, and is offered in different upholsteries like hybrid leatherette, soft-weave fabric, and Napa leather. Best of all, a five-year extended warranty is included along with a 49-day return policy, so you're covered if anything goes wrong. Head to the link in the description and check out Secretlab today. But not before I set this up. Oh, crap, we gotta move the other monitor first. This thing is huge! Look at the size of it when I'm just sitting right in front of it, and we've gotta push, like, all the way back to the edge of the desk. I'm definitely a multi-monitor kind of person, but if I was going to go with a single, giant-ass display, it'd probably be this one. I'm definitely a bigger fan of larger curvatures once you get into a screen that's this size or if you start going into 32:9 territory. But otherwise, everything seems to be working just fine right outta the box. It's cranked up to 240 hertz, no problem. We're using HDMI 2.1, HDR. Enable HDR. Turn that on, boop. Yeah, so now we got 10-bit color, high dynamic range. It lists 603 nits here in Windows. I don't think that's right. Their own specs say that it should reach about 1,000 nits of peak brightness in HDR depending on what you're doing. It's OLED, so it's gonna have a .03-millisecond gray-to-gray response time, which is just absolutely insane. One of the nicest things about OLED is, on top of the, like, super inky blacks that everyone loves, what you really want is that every pixel is a dimming zone. It looks fantastic when you're watching HDR content, absolutely stunning. The only problem is that with an ultrawide, YouTube doesn't have ultrawide videos, so we're just gonna have black bars here. But you can see that they just look black because it's OLED. It just kinda disappears, and if this was a dark room, you'd hardly even be able to see it anymore. It's such a good feature that you don't know you want until you've actually experienced it for yourself. I wanna try the remote. They've included it. Pretty bare bones, you've just got, like, input, volume, brightness. Oh, actually, having the brightness on the remote's kinda handy. Wow, that takes forever. I never wanna use this again. Yeah, the glare is actually kinda killing me. It's not your fault, Andy. It's the studio lights. They're just at this, like, perfect angle where, no matter where I go, I've got this one bar of glare. That being said, they do have a pretty decent anti-reflective coating, it looks like. So it's distracting to me, personally, but I always find that these kinda blurred-out anti-glare coatings are much more of a distraction for me than if it was just glossy in general. When I've got the mirror finish, my brain tunes it out somehow. I don't know how to explain it. It's like when there's a blur, my brain is sitting there trying to figure out what that blur is. Anyway, to each your own. Some people prefer gloss. Some people prefer matte. This is 1440p on a 45-inch screen, so that's coming out to about 83 pixels per inch. For design work, this is probably not ideal. Like, if I get in close, I can start looking at pixels, and you know, you can get a bit of a screen door effect. It's not awful. And when it comes to gaming or just watching content like this, especially when you're sitting a little further back, particularly for a large 45-inch screen, it becomes not nearly as much of a problem as you might think it is. Wow, that's gorgeous. As for the OSD, it's not bad. We've got our HDR telling us that it's on. It's got variable refresh rate. It'll do G-SYNC Compatible and FreeSync Premium, not Pro, and you know, just Compatible, but that's okay. Game adjust, oh yeah, we got VRR on and off, crosshair, FPS counter, game reset. So those are features that you see in a lot of gaming monitors, but I don't really know anyone that uses them outside of maybe the crosshair. Picture adjust, we got brightness, sharpness. A lot of these are grayed out probably because of HDR. If I turn that off, I could probably adjust them. And then our input and general. Ooh, hexagon light. Oh yeah, there's RGB on this thing. Okay, we gotta check it out. My only disappointment is that it is there on the sides, but it's not present on the top here. It's a kinda minor thing, but I would've loved to see them actually complete the ring and go all the way around instead of just on the sides there, but it's pretty good. So the Xeneon Flex doesn't have a height-adjustable stand. And they said that they tested it with a ton of different people. And like, people of different heights were totally fine with where the screen was, partly just because of how big it was. But I gotta say that I don't like it way up here, and I don't like it way down here. However, right around the middle, it's actually about perfect for me, personally. And then we wanna go to Screen Calibration, HDR. Like, below 100, you definitely see it, but plus 50, okay. I'm just gonna keep this at 50. While we're searching, I'll mention that this can do 98.5% of the DCI-P3 color space. That's a lot. It's not quite like, you know, 100% would be better, or like, even over that would be fine because HDR uses Rec. 2020 and it can do much beyond DCI-P3, but that's still really good. It's pretty respectable. Another point to make is that this thing does not come with speakers. It's a really minor grievance, and I know that most of you are never gonna use your monitor's speakers, but like, they're really nice to have, even if they're garbage, for those few moments where you need audio and you have no other options. Man, this is crisp. I'm sitting super close, and honestly, it feels totally fine. Like, I actually really like this display. I'm kinda leaning towards going with one big display, kinda like what Linus is doing. I think that maybe I could get away with it. Like, you know, I like having Discord and other chat stuff up on a secondary monitor, but having this curvature, when you're this close, on a 21:9 screen is about right. I don't like this much curve on a smaller display or on something that's not ultrawide. I just don't think it's necessary at all. But for something this size, especially when you're sitting, like, about this close, man, is it ever immersive. As for the vibrancy and the color and everything, it just looks fantastic. Like, it really pops when you've got that HDR-1000. No, BigT! How could you do this to me? But like, look at these lights. Like, these are getting nice and bright, and they're really popping, like, especially that glare right there and even the floor here. Like, it might not be 1,000 nits, but that's pretty bright. For the first time in, like, a pretty long time, I'm actually really immersed. There's something about just having the screen kinda wrap around you that just, like, feels right. So while some might complain that 800R is too much curvature, I think, in a case like this, it's perfectly fine. Now, one of the other major improvements on this display over previous UltraGears is getting OLEDs into that 240-hertz zone. 120 should kinda be the minimum on gaming monitors these days, just because we've seen how good it is compared to 60. And 240, I'm still not completely sold on. I don't think it's necessary for most people. I honestly can hardly tell. Like, if this was playing at 120, I'd probably be more than happy. But I gotta say, man, it's crispy. Like, you don't ever feel like there's any kind of lag. You don't ever feel like things are taking forever to respond, especially when you've got that just (snaps) insanely fast pixel response time that OLED's gonna give you. There's honestly not a lot wrong with this monitor. If anything, like, it's just good. The pixel density, sure, you can argue that you'd like it higher. And that's fine. I understand. But when it comes to just consuming content... I'm sitting pretty close you guys, and like, this looks great until I start, like, actually getting in there and start looking for screen door effect. The only real problem with this guy, and honestly, it's not that bad when you consider all the other alternatives, but this is 1,700 US dollars. Now, it's OLED, it's 45 inches, and it's 240 hertz. I think, at that price, it's honestly pretty reasonable. Hold on. Sorry, I had to burp. (upbeat synth music) Okay. The Xeneon Flex, for instance, is using basically the same panel, but you can curve it. That thing is like two grand. Do you want to pay an extra $300 for a feature that you're honestly probably not gonna use that much, or do you want a more adjustable stand? I personally would go with this guy. I think that the stand is just pretty decent even if it's a little wobbly. Like I said, that's because the display is huge. And just the ability to mount it, personally, like, that just means the world of difference when it comes to a display this size. I don't know, Andy. Maybe I gotta join the one-screen gang and just live my life like this. I probably can't afford it right now, so I'm not going to. (chuckles) But for anyone who's looking for, like, a super crazy screen, I don't think you can go wrong with this. The only way you can is if maybe you're a graphic designer and you really should have a higher pixel density. Other than that, this thing is killer. Thanks for watching \"ShortCircuit.\" If you wanna check out another one, check out the Xeneon Flex. It's basically the same thing as this one, but it's got a really cool party trick that, I don't know if it's worth the 300 bucks, but it's pretty sweet.",
    "transcript_keywords": [
        "kind",
        "thing",
        "pretty",
        "monitor",
        "OLED",
        "screen",
        "HDR",
        "Display",
        "Xeneon Flex",
        "stand",
        "good",
        "Power brick",
        "problem",
        "fine",
        "honestly",
        "Power",
        "Check",
        "cable",
        "lot",
        "sitting"
    ],
    "transcript_entity_values": [
        "FPS",
        "VRR",
        "49-day",
        "100%",
        "secondary",
        "a ton",
        "One",
        "1.4",
        "Kensington",
        "60",
        "one",
        "DTS Headphone",
        "USB",
        "DCI",
        "HDR-1000",
        "1,000",
        "603",
        "Rec",
        "about 1,000",
        "this year",
        "240",
        "only 1.4",
        "21:9",
        "100",
        "800R",
        "the Xeneon Flex",
        "Andy",
        "DC",
        "OSD",
        "G-SYNC Compatible",
        "an extra $300",
        "Acer",
        "Napa",
        "300 bucks",
        "45-inch",
        "BigT",
        "2020",
        "FreeSync Premium",
        "The Xeneon Flex",
        "24 pounds",
        "98.5%",
        "Discord",
        "LG",
        "50",
        "100 x 100",
        "240 hertz",
        "UltraGear",
        "10",
        "DisplayPort",
        "first",
        "Screen Calibration",
        "five-year",
        "about 83",
        "DCI-P3",
        "these days",
        "1,700 US dollars",
        "two",
        "120",
        "45 inches",
        "32:9",
        "four",
        "OLED",
        "50",
        "about 160",
        "RGB",
        "Linus",
        "VESA",
        "2.1",
        "Secretlab",
        "YouTube",
        "ASUS",
        "the Xeneon Flex",
        "210 watts",
        "170",
        "18 pounds",
        "today"
    ],
    "transcript_entity_types": [
        "ORG",
        "PERSON",
        "DATE",
        "PERCENT",
        "ORDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "GPE",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "ORG",
        "ORG",
        "NORP",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "CARDINAL",
        "DATE",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "CARDINAL",
        "FAC",
        "PERSON",
        "GPE",
        "ORG",
        "ORG",
        "MONEY",
        "ORG",
        "ORG",
        "MONEY",
        "QUANTITY",
        "NORP",
        "DATE",
        "ORG",
        "ORG",
        "QUANTITY",
        "PERCENT",
        "ORG",
        "ORG",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "ORG",
        "CARDINAL",
        "ORG",
        "ORDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "DATE",
        "MONEY",
        "CARDINAL",
        "CARDINAL",
        "QUANTITY",
        "CARDINAL",
        "CARDINAL",
        "ORG",
        "DATE",
        "CARDINAL",
        "ORG",
        "PERSON",
        "ORG",
        "CARDINAL",
        "PERSON",
        "ORG",
        "ORG",
        "ORG",
        "QUANTITY",
        "CARDINAL",
        "QUANTITY",
        "DATE"
    ]
}